{
  "hadithId": 316,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:657",
      "https://sunnah.com/muslim:651"
    ],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "صحيح البخاري / صحيح مسلم",
    "babId": 20
  },
  "name": {
    "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَثْقَلُ اَلصَّلَاةِ عَلَى اَلْمُنَافِقِينَ: صَلَاةُ اَلْعِشَاءِ, وَصَلَاةُ اَلْفَجْرِ, وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا } مُتَّفَقٌ عَلَيْه ِ",
    "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”منافقین پر سب سے بھاری نمازیں عشاء اور فجر کی نمازیں ہیں، اور اگر انہیں معلوم ہو جائے کہ ان دونوں میں کیا (اجر و ثواب) ہے، تو وہ ان میں ضرور حاضر ہوں، خواہ انہیں گھٹنوں کے بل گھسٹ کر آنا پڑے۔“ (متفق علیہ)",
    "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"The heaviest prayers for the hypocrites are the Isha prayer and the Fajr prayer. If they knew what (reward) is in them, they would come to them even if they had to crawl.\" (Agreed Upon)"
  },
  "takhreej": {
    "arabic": "صحيح متفق عليه.‏ رواه البخاري (657)‏، ومسلم (651)‏.",
    "urdu": "صحیح، متفق علیہ۔ اسے بخاری (657) اور مسلم (651) نے روایت کیا ہے۔",
    "english": "Sahih (Agreed Upon). Reported by Al-Bukhari (657) and Muslim (651)."
  },
  "importantWords": [
    {
      "arabic": "أَثْقَلُ",
      "english": "Heaviest / Most burdensome",
      "urdu": "سب سے بھاری / بوجھل"
    },
    {
      "arabic": "اَلْمُنَافِقِينَ",
      "english": "The Hypocrites",
      "urdu": "منافقین"
    },
    {
      "arabic": "مَا فِيهِمَا",
      "english": "What is in them (reward)",
      "urdu": "جو ان دونوں میں ہے (ثواب)"
    },
    {
      "arabic": "حَبْوًا",
      "english": "Crawling",
      "urdu": "گھٹنوں کے بل گھسٹنا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ عشاء اور فجر کی باجماعت نماز منافقین پر بہت گراں گزرتی ہے، جبکہ مومن کے لیے ان کا اجر اتنا عظیم ہے کہ اگر اسے پتہ چل جائے تو وہ معذوری کی حالت میں بھی رینگ کر مسجد آئے۔",
    "english": "This Hadith highlights that congregational Isha and Fajr prayers are the most burdensome for hypocrites. It emphasizes their immense reward, stating that if people knew their value, they would attend even if they had to crawl."
  },
  "references": [
    {
      "arabic": "رواه البخاري (657)",
      "english": "Reported by Al-Bukhari (657)"
    },
    {
      "arabic": "رواه مسلم (651)",
      "english": "Reported by Muslim (651)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://youtu.be/83wSXe5O2MA?si=9w2zD4lqP7Sgq_X8",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Muttafaq Alaih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر",
        "english": "Background of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بھاری کیوں؟",
              "english": "Why Heaviest?"
            },
            "content": {
              "urdu": [
                "عشاء آرام اور سونے کا وقت ہوتا ہے اور فجر میٹھی نیند کا۔",
                "نبی ﷺ کے زمانے میں بجلی نہیں تھی، اندھیرے کی وجہ سے منافقین کا نہ آنا چھپ جاتا تھا۔",
                "منافقین صرف دکھاوے کے لیے نماز پڑھتے تھے، اندھیرے میں دکھاوا ممکن نہ تھا اس لیے وہ نہیں آتے تھے۔"
              ],
              "english": [
                "Isha is time for rest, and Fajr is time for deep sleep.",
                "In the Prophet's time, there was no electricity; darkness concealed the absence of hypocrites.",
                "Hypocrites prayed only to show off; since darkness prevented showing off, they didn't attend."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفاق کی پہچان",
              "english": "Sign of Hypocrisy"
            },
            "content": {
              "urdu": [
                "ان دو نمازوں میں سستی کرنا نفاق کی علامت ہے۔",
                "مومن کی پہچان یہ ہے کہ وہ آرام اور نیند پر اللہ کے حکم کو ترجیح دیتا ہے۔",
                "سیدنا ابن عمر فرماتے ہیں کہ اگر کوئی فجر یا عشاء میں نہ آتا تو ہم اس کے بارے میں بدگمان ہو جاتے تھے۔"
              ],
              "english": [
                "Laziness in these two prayers is a sign of hypocrisy.",
                "A believer prioritizes Allah's command over rest and sleep.",
                "Ibn Umar (RA) said if someone missed Isha or Fajr, we would think ill of him (suspect hypocrisy)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر کی عظمت",
        "english": "Greatness of Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھسٹ کر آنا",
              "english": "Coming Crawling"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے مثال دی کہ اگر چل نہ سکیں تو گھٹنوں کے بل آئیں۔",
                "یہ الفاظ ثواب کی عظمت اور اہمیت کو ظاہر کرنے کے لیے ہیں۔",
                "یعنی ان نمازوں کا نفع دنیا کی ہر تکلیف سے بڑھ کر ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used the metaphor of crawling if unable to walk.",
                "These words emphasize the greatness and importance of the reward.",
                "Meaning, the benefit of these prayers outweighs any worldly hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "پوری رات کا قیام",
              "english": "Standing the Whole Night"
            },
            "content": {
              "urdu": [
                "ایک اور حدیث میں ہے: جس نے عشاء جماعت سے پڑھی گویا آدھی رات قیام کیا، اور جس نے فجر بھی جماعت سے پڑھی گویا پوری رات قیام کیا۔",
                "یہ مختصر عمل پوری رات کی عبادت کے برابر ہے۔"
              ],
              "english": [
                "Another Hadith states: One who prays Isha in congregation is as if he prayed half the night, and if he prays Fajr too, it is as if he prayed the whole night.",
                "This brief action equals the worship of an entire night."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزم و ہمت",
              "english": "Determination"
            },
            "content": {
              "urdu": [
                "ہمیں اللہ کا شکر ادا کرنا چاہیے کہ آج روشنی اور سواری کی سہولت ہے۔",
                "اگر اتنی سہولتوں کے باوجود ہم نہ جائیں تو یہ بڑی محرومی ہے۔",
                "فجر کے لیے الارم اور عشاء کے لیے مصروفیات ترک کرنا ضروری ہے۔"
              ],
              "english": [
                "We should thank Allah for lights and transport facilities today.",
                "If we still don't go despite these facilities, it's a huge deprivation.",
                "Setting an alarm for Fajr and leaving activities for Isha is essential."
              ]
            }
          }
        ]
      }
    }
  ]
}
