{
  "hadithId": 319,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:575",
      "https://sunnah.com/tirmidhi:219",
      "https://sunnah.com/nasai:858",
      "https://sunnah.com/ibnhibban:1564"
    ],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "سنن أبي داود / جامع الترمذي / سنن النسائي / صحيح ابن حبان",
    "babId": 20
  },
  "name": {
    "arabic": "وَعَنْ يَزِيدَ بْنِ اَلْأَسْوَدِ ‏- رضى الله عنه ‏- { أَنَّهُ صَلَّى مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-صَلَاةَ اَلصُّبْحِ, فَلَمَّا صَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا هُوَ بِرَجُلَيْنِ لَمْ يُصَلِّيَا, فَدَعَا بِهِمَا, فَجِيءَ بِهِمَا تَرْعَدُ فَرَائِصُهُمَا, فَقَالَ لَهُمَا: \"مَا مَنَعَكُمَا أَنْ تُصَلِّيَا مَعَنَا?\" قَالَا: قَدْ صَلَّيْنَا فِي رِحَالِنَا.‏ قَالَ: \"فَلَا تَفْعَلَا, إِذَا صَلَّيْتُمَا فِي رِحَالِكُمْ, ثُمَّ أَدْرَكْتُمْ اَلْإِمَامَ وَلَمْ يُصَلِّ, فَصَلِّيَا مَعَهُ, فَإِنَّهَا لَكُمْ نَافِلَةٌ\" } رَوَاهُ أَحْمَدُ, وَاللَّفْظُ لَهُ, وَالثَّلَاثَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّان َ",
    "urdu": "سیدنا یزید بن اسود رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ فجر کی نماز پڑھی۔ جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو دو آدمیوں کو دیکھا جنہوں نے (جماعت کے ساتھ) نماز نہیں پڑھی تھی۔ آپ صلی اللہ علیہ وسلم نے انہیں بلایا، تو انہیں لایا گیا جبکہ ان کے شانے (خوف سے) کانپ رہے تھے۔ آپ نے ان سے پوچھا: ”تمہیں ہمارے ساتھ نماز پڑھنے سے کس چیز نے روکا؟“ انہوں نے کہا: ”ہم اپنے پڑاؤ (گھروں) میں نماز پڑھ چکے تھے۔“ آپ نے فرمایا: ”ایسا مت کرو، جب تم اپنے پڑاؤ میں نماز پڑھ لو، پھر امام کو پاؤ اور اس نے ابھی نماز نہ پڑھی ہو، تو اس کے ساتھ بھی پڑھ لو، کیونکہ یہ تمہارے لیے نفل ہو جائے گی۔“ (اسے احمد نے روایت کیا ہے اور یہ الفاظ اسی کے ہیں، اور تینوں [ابوداؤد، ترمذی، نسائی] نے بھی روایت کیا ہے، اور ترمذی اور ابن حبان نے اسے صحیح قرار دیا ہے)",
    "english": "Narrated Yazid bin Al-Aswad (RA): He prayed Fajr with the Messenger of Allah (ﷺ). When the Messenger of Allah (ﷺ) had finished the prayer, he saw two men who had not prayed (with the congregation). He called for them, and they were brought trembling with fear. He asked them: \"What prevented you from praying with us?\" They said: \"We have already prayed in our dwellings.\" He said: \"Do not do so. If you pray in your dwellings and then come to a mosque where there is a congregation (and the Imam hasn't prayed yet), pray with them, for it will be a voluntary prayer (Nafl) for you.\""
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (4/160 و 161)‏، والنسائي (2/112)‏، وأبو داود (575)‏ و (576)‏، والترمذي (219)‏، وابن حبان (1564 و 1565)‏ وقال الترمذي: \"حسن صحيح\".‏",
    "urdu": "صحیح۔ اسے احمد (4/160، 161)، نسائی (2/112)، ابوداؤد (575، 576)، ترمذی (219) اور ابن حبان (1564، 1565) نے روایت کیا ہے۔ اور ترمذی نے اسے حسن صحیح کہا ہے۔",
    "english": "Sahih (Authentic). Reported by Ahmad (4/160, 161), An-Nasa'i (2/112), Abu Dawud (575, 576), At-Tirmidhi (219), and Ibn Hibban (1564, 1565). At-Tirmidhi graded it Hasan Sahih."
  },
  "importantWords": [
    {
      "arabic": "لَمْ يُصَلِّيَا",
      "english": "They two had not prayed",
      "urdu": "ان دونوں نے نماز نہیں پڑھی تھی"
    },
    {
      "arabic": "تَرْعَدُ فَرَائِصُهُمَا",
      "english": "Their shoulders were trembling",
      "urdu": "ان کے شانے کانپ رہے تھے (فرائص: گوشت جو شانے اور پہلو کے درمیان ہو)"
    },
    {
      "arabic": "رِحَالِنَا",
      "english": "Our dwellings / Camps",
      "urdu": "ہمارے پڑاؤ / گھر"
    },
    {
      "arabic": "نَافِلَةٌ",
      "english": "Voluntary prayer",
      "urdu": "نفل نماز"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ اگر کوئی شخص گھر میں فرض نماز پڑھ لے اور پھر جماعت مل جائے، تو اسے جماعت میں شریک ہو جانا چاہیے؛ یہ دوسری نماز اس کے لیے نفل شمار ہوگی۔ نیز جماعت سے الگ تھلگ بیٹھنا ناپسندیدہ ہے۔",
    "english": "This Hadith instructs that if someone prays the obligatory prayer at home and then encounters a congregation, they should join it; the second prayer will count as voluntary (Nafl). It also shows that sitting apart from the congregation is disliked."
  },
  "references": [
    {
      "arabic": "رواه أحمد (4/160)",
      "english": "Reported by Ahmad (4/160)"
    },
    {
      "arabic": "رواه أبو داود (575)",
      "english": "Reported by Abu Dawud (575)"
    },
    {
      "arabic": "رواه الترمذي (219)",
      "english": "Reported by At-Tirmidhi (219)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "يَزِيدَ بْنِ اَلْأَسْوَدِ",
        "english": "Yazid bin Al-Aswad"
      },
      "slug": "yazid-bin-al-aswad"
    }
  ],
  "ytLink": "https://youtu.be/k2Mxo0Nlo9A?si=l4nQ8vJ4X5bF8Gg_",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر",
        "english": "Background of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا خوف",
              "english": "Fear of Companions"
            },
            "content": {
              "urdu": [
                "جب ان دو آدمیوں کو بلایا گیا تو وہ ڈر کے مارے کانپ رہے تھے۔",
                "یہ نبی ﷺ کا رعب اور ان کی اپنی غلطی کا احساس تھا۔",
                "نبی ﷺ نے ڈانٹنے کے بجائے پیار سے وجہ پوچھی۔"
              ],
              "english": [
                "When called, the two men were trembling with fear.",
                "This was due to the Prophet's awe and their realization of mistake.",
                "The Prophet (ﷺ) asked the reason gently instead of scolding."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد میں الگ بیٹھنا",
              "english": "Sitting Alone in Mosque"
            },
            "content": {
              "urdu": [
                "مسجد میں ہوتے ہوئے جماعت میں شامل نہ ہونا تہمت کا باعث بنتا ہے۔",
                "لوگ سمجھ سکتے ہیں کہ یہ نماز نہیں پڑھتے یا امام سے ناراض ہیں۔",
                "اس لیے حکم دیا گیا کہ نفل کی نیت سے ہی سہی، جماعت میں شامل ہو جاؤ۔"
              ],
              "english": [
                "Not joining the congregation while in the mosque causes suspicion.",
                "People might think they don't pray or are upset with the Imam.",
                "Hence, the command to join, even if as Nafl."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دوبارہ نماز کا حکم",
              "english": "Ruling on Repeating Prayer"
            },
            "content": {
              "urdu": [
                "اگر فرض پڑھ چکے ہوں تو دوبارہ جماعت ملنے پر شامل ہونا مستحب ہے۔",
                "یہ دوسری نماز نفل شمار ہوگی۔",
                "فجر اور عصر کے بعد نفل مکروہ ہیں، لیکن اس خاص سبب (جماعت کی فضیلت) کی وجہ سے یہ جائز ہے۔"
              ],
              "english": [
                "If Fard is done, joining the congregation again is recommended.",
                "This second prayer counts as Nafl.",
                "Nafl is disliked after Fajr and Asr, but permissible here due to the specific cause (virtue of Jama'ah)."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرضیت کس کی؟",
              "english": "Which is Fard?"
            },
            "content": {
              "urdu": [
                "پہلی نماز جو گھر میں پڑھی، وہی فرض ادا ہو گئی۔",
                "دوسری نماز نفل ہوگی، جیسا کہ حدیث میں صراحت ہے۔",
                "بعض علماء کہتے ہیں کہ اللہ جسے چاہے فرض بنا دے، لیکن راجح پہلا قول ہے۔"
              ],
              "english": [
                "The first prayer offered at home fulfills the Fard.",
                "The second is Nafl, as explicitly stated in the Hadith.",
                "Some scholars say Allah accepts whichever He wills as Fard, but the first view is preferred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سوئے ظن سے بچنا",
              "english": "Avoiding Suspicion"
            },
            "content": {
              "urdu": [
                "اپنے عمل سے دوسروں کو بدگمانی کا موقع نہ دیں۔",
                "اگر نماز پڑھ چکے ہیں تو مسجد کے باہر انتظار کریں یا اندر جا کر جماعت میں مل جائیں۔",
                "مسلمانوں کے اتحاد کا مظاہرہ کرنا ضروری ہے۔"
              ],
              "english": [
                "Do not give others a chance to be suspicious by your actions.",
                "If you have prayed, wait outside or join the congregation inside.",
                "Demonstrating Muslim unity is essential."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفل کی اہمیت",
              "english": "Importance of Nafl"
            },
            "content": {
              "urdu": [
                "نفل نماز اللہ کے قرب کا ذریعہ ہے۔",
                "جماعت کے ساتھ نفل پڑھنے کا ثواب اور بڑھ جاتا ہے۔",
                "یہ عمل عاجزی اور اطاعت کا نمونہ ہے۔"
              ],
              "english": [
                "Voluntary prayer is a means of nearness to Allah.",
                "Praying Nafl in congregation increases the reward.",
                "This act is a model of humility and obedience."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کا اصول",
              "english": "Principle of Verification"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے سزا دینے یا برا بھلا کہنے سے پہلے تحقیق کی۔",
                "پوچھا: 'کیا چیز مانع ہوئی؟'",
                "فیصلہ سنانے سے پہلے ملزم کا موقف سننا انصاف کا تقاضا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) investigated before punishing or rebuking.",
                "He asked: 'What prevented you?'",
                "Hearing the accused's stance before passing judgment is a demand of justice."
              ]
            }
          }
        ]
      }
    }
  ]
}
