{
  "chapId": 46,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 719,
    "to": 726
  },
  "hadiths": [
    {
      "id": 719,
      "name": {
        "arabic": "عَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَدِمَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-اَلْمَدِينَةَ, وَهُمْ يُسْلِفُونَ فِي اَلثِّمَارِ اَلسَّنَةَ وَالسَّنَتَيْنِ, فَقَالَ: { مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ, وَوَزْنٍ مَعْلُومٍ, إِلَى أَجَلٍ مَعْلُومٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو لوگ پھلوں (کی خریداری) میں ایک ایک اور دو دو سال کے لیے پیشگی ادائیگی (سلف) کیا کرتے تھے۔ آپ ﷺ نے فرمایا: ”جو شخص کھجور (یا کسی بھی چیز) میں پیشگی ادائیگی کرے، اسے چاہیے کہ وہ معلوم ناپ، معلوم وزن اور معلوم مدت (کے تعین) کے ساتھ پیشگی ادائیگی کرے۔“",
        "english": "Narrated Ibn 'Abbas (R.A): When the Prophet (peace be upon him) came to Al-Madinah, they were paying in advance for fruits for a year or two. He (peace be upon him) said: \"Whoever pays in advance for dates, should pay for a specified measure and a specified weight for a specified period.\""
      }
    },

    {
      "id": 720,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ أَبْزَى، وَعَبْدِ اَللَّهِ بْنِ أَبِي أَوْفَى رَضِيَ اَللَّهُ عَنْهُمَا قَالَا: { كُنَّا نُصِيبُ اَلْمَغَانِمَ مَعَ رَسُولِ اَللَّهِ صلى الله عليه وسلم وَكَانَ يَأْتِينَا أَنْبَاطٌ مِنْ أَنْبَاطِ اَلشَّامِ, فَنُسْلِفُهُمْ فِي اَلْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ ‏- وَفِي رِوَايَةٍ: وَالزَّيْتِ ‏- إِلَى أَجَلٍ مُسَمًّى.‏ قِيلَ: أَكَانَ لَهُمْ زَرْعٌ? قَالَا: مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا عبدالرحمٰن بن ابزی اور عبداللہ بن ابی اوفی رضی اللہ عنہما سے روایت ہے کہ ہم رسول اللہ ﷺ کے ساتھ (غزوات میں) غنیمت حاصل کرتے تھے اور ہمارے پاس شام کے نبطی (کاشتکار) آتے تھے۔ ہم انہیں گندم، جو، منقیٰ اور ایک روایت کے مطابق زیتون کی پیشگی قیمت (بیع سلم) ایک مقررہ مدت کے لیے دے دیتے تھے۔ ان سے پوچھا گیا: کیا ان کے پاس اپنی زمینیں یا کھیت ہوتے تھے؟ تو انہوں نے جواب دیا: ہم ان سے اس بارے میں سوال نہیں کرتے تھے۔",
        "english": "Narrated 'Abdur-Rahman bin Abza and 'Abdullah bin Abi Awfa (RA): We used to get war booty while we were with Allah's Messenger (ﷺ), and the Nabataeans of Ash-Sham (Syria) used to come to us. We would pay them in advance (Salam) for wheat, barley, and raisins (and in another narration: oil) for a fixed period. They were asked, 'Did they have their own crops?' They replied, 'We never used to ask them about that.'"
      }
    },

    {
      "id": 721,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- قَالَ: { مَنْ أَخَذَ أَمْوَالَ اَلنَّاسِ يُرِيدُ أَدَاءَهَا, أَدَّى اَللَّهُ عَنْهُ, وَمَنْ أَخَذَهَا يُرِيدُ إِتْلَافَهَا, أَتْلَفَهُ اَللَّهُ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جو شخص لوگوں کا مال (بطور قرض) لے اور اس کے ادا کرنے کا ارادہ رکھتا ہو تو اللہ تعالیٰ اس کا (قرض) ادا فرما دے گا اور جو شخص ان (کے) اموال ضائع کرنے کی نیت سے لے تو اللہ تعالیٰ اسے ضائع کر دے گا۔“ (بخاری)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: 'Whoever takes the money of the people with the intention of repaying it, Allah will repay it on his behalf, and whoever takes it in order to spoil it, Allah will spoil him.'"
      }
    },

    {
      "id": 722,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ ! إِنَّ فُلَاناً قَدِمَ لَهُ بَزٌّ مِنَ اَلشَّامِ, فَلَوْ بَعَثْتَ إِلَيْهِ, فَأَخَذْتَ مِنْهُ ثَوْبَيْنِ بِنَسِيئَةٍ إِلَى مَيْسَرَةٍ? فَأَرْسَلَ إِلَيْهِ, فَامْتَنَعَ } أَخْرَجَهُ اَلْحَاكِمُ، وَالْبَيْهَقِيُّ, وَرِجَالُهُ ثِقَاتٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے عرض کیا: ”یا رسول اللہ! فلاں تاجر کے پاس شام سے کپڑا (بز) آیا ہے۔ کاش آپ کسی کو اس کے پاس بھیج کر دو کپڑے گنجائش ہونے (میسرہ) تک کے لیے ادھار خرید لیتے۔“ آپ ﷺ نے اس کی طرف آدمی بھیجا، مگر اس نے (ادھار دینے سے) انکار کر دیا۔",
        "english": "Narrated 'Aishah (RA): I said, 'O Messenger of Allah! So-and-so (a merchant) has received some garments (cloth) from Ash-Sham. If you were to send someone to him and buy two garments from him on credit until you have the means to pay?' He (ﷺ) sent someone to him, but the merchant refused."
      }
    },

    {
      "id": 723,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلظَّهْرُ يُرْكَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا, وَلَبَنُ اَلدَّرِّ يُشْرَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا, وَعَلَى اَلَّذِي يَرْكَبُ وَيَشْرَبُ اَلنَّفَقَةُ } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”رہن رکھے ہوئے جانور پر اس کے اخراجات کے بدلے سواری کی جا سکتی ہے، اور دودھ دینے والے جانور کا دودھ اس کے اخراجات کے بدلے پیا جا سکتا ہے جبکہ وہ رہن ہو۔ اور جو سواری کرے گا اور دودھ پیئے گا، اسی کے ذمے اس (جانور) کا خرچہ ہو گا۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) said: \"The animal's back may be ridden in return for the expenses of its food when it is mortgaged (pledged); and the milk of a milch animal may be drunk in return for the expenses of its food when it is mortgaged. The one who rides the animal and drinks the milk must bear the expenses.\""
      }
    },

    {
      "id": 724,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ: { لَا يَغْلَقُ اَلرَّهْنُ مِنْ صَاحِبِهِ اَلَّذِي رَهَنَهُ, لَهُ غُنْمُهُ, وَعَلَيْهِ غُرْمُهُ } رَوَاهُ اَلدَّارَقُطْنِيُّ, وَالْحَاكِمُ, وَرِجَالهُ ثِقَاتٌ.‏ إِلَّا أَنَّ اَلْمَحْفُوظَ عِنْدَ أَبِي دَاوُدَ وَغَيْرِهِ إِرْسَالُهُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مرھونہ (گروی شدہ) چیز اس کے مالک کیلئے روکی اور بند نہیں کی جائے گی۔ اس کا فائدہ بھی اسی کیلئے ہے اور تاوان کا بھی وہی ذمہ دار ہے۔“ (اسے دارقطنی اور حاکم نے روایت کیا ہے)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'A pledged object (Rahn) is not locked away from its owner who pledged it; he enjoys its benefits and must bear its liabilities (costs/loss).' [Reported by ad-Daraqutni and al-Hakim]."
      }
    },

    {
      "id": 725,
      "name": {
        "arabic": " وَعَنْ أَبِي رَافِعٍ { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا فَقَدِمَتْ عَلَيْهِ إِبِلٌ مِنَ اَلصَّدَقَةِ, فَأَمَرَ أَبَا رَافِعٍ أَنْ يَقْضِيَ اَلرَّجُلَ بَكْرَهُ, فَقَالَ: لَا أَجِدُ إِلَّا خَيَارًا .‏ قَالَ: \" أَعْطِهِ إِيَّاهُ, فَإِنَّ خِيَارَ اَلنَّاسِ أَحْسَنُهُمْ قَضَاءً } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابورافع رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک شخص سے ایک جوان اونٹ (بکر) قرض لیا۔ پھر آپ ﷺ کے پاس صدقہ کے اونٹ آئے تو آپ ﷺ نے ابورافع کو حکم دیا کہ اس شخص کا جوان اونٹ ادا کر دیں۔ ابورافع نے عرض کیا: (ہمارے پاس جوان اونٹ نہیں ہے) مجھے تو صرف بہترین 'رباعی' (چھ یا سات سالہ عمدہ اونٹ) ہی مل رہا ہے۔ آپ ﷺ نے فرمایا: ”وہی اسے دے دو، کیونکہ لوگوں میں سے بہترین وہ ہے جو ادائیگی میں سب سے اچھا ہو۔“",
        "english": "Narrated Abu Rafi' (R.A): The Prophet (peace be upon him) borrowed a young camel (Bakr) from a man. When some camels from the Sadaqah were brought to him, he ordered me to pay the man back his young camel. I said, \"I can find only a 'Khiyar Ruba'i' (a superior six or seven-year-old camel).\" He (peace be upon him) said, \"Give it to him, for the best among people is the one who is best in repaying (debts).\""
      }
    },

    {
      "id": 726,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ { كُلُّ قَرْضٍ جَرَّ مَنْفَعَةً, فَهُوَ رِبًا } رَوَاهُ اَلْحَارِثُ بْنُ أَبِي أُسَامَةَ, وَإِسْنَادُهُ سَاقِطٌ  وَلَهُ شَاهِدٌ ضَعِيفٌ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ عِنْدَ اَلْبَيْهَقِيِّ وَآخَرُ مَوْقُوفٌ عَنْ عَبْدِ اَللَّهِ بْنِ سَلَامٍ عِنْدَ اَلْبُخَارِيِّ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”ہر وہ قرض جو (کسی قسم کا) نفع کھینچ لائے، وہ سود ہے۔“ اسے حارث بن ابی اسامہ نے روایت کیا ہے اور اس کی سند بہت کمزور (ساقط) ہے۔ بیہقی کے ہاں فضالہ بن عبید رضی اللہ عنہ سے اس کا ایک ضعیف شاہد موجود ہے، اور بخاری میں عبداللہ بن سلام رضی اللہ عنہ سے اس کا ایک موقوف شاہد بھی مروی ہے۔",
        "english": "Narrated 'Ali (RA): Allah's Messenger (ﷺ) said: 'Every loan that draws a benefit is Riba (usury).' [Reported by al-Harith bin Abu Usama, but its chain of narrators is very weak]. It has a weak supporting narration from Fadalah bin 'Ubaid reported by al-Baihaqi, and another Mauquf (statement of a companion) narration from 'Abdullah bin Salam reported by al-Bukhari."
      }
    }
  ]
}
