{
  "chapId": 52,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 751,
    "to": 754
  },
  "hadiths": [
    {
      "id": 751,
      "name": {
        "arabic": "عَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَلَى اَلْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَهُ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": " سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو کچھ ہاتھ نے لیا ہے جب تک اسے ادا نہ کر دے اس کے ذمہ ہے۔“ اسے احمد اور چاروں نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Samurah bin Jundub (RA): Allah's Messenger (ﷺ) said: 'The hand is responsible for what it has taken until it repays it (returns it to the owner).' [Reported by Ahmad and the four (Sunan compilers), and Al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 752,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَدِّ اَلْأَمَانَةَ إِلَى مَنْ اِئْتَمَنَكَ, وَلَا تَخُنْ مَنْ خَانَكَ } رَوَاهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَصَحَّحَهُ اَلْحَاكِمُ, وَاسْتَنْكَرَهُ أَبُو حَاتِمٍ اَلرَّازِيُّ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے تمہارے پاس امانت رکھی ہو تو اسے امانت واپس کر دو اور جس نے تیرے ساتھ خیانت کی تو اس کے ساتھ خیانت نہ کر۔“ اسے ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے اور حاکم نے اسے صحیح کہا ہے اور ابوحاتم رازی نے اسے منکر سمجھا ہے۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Return the trust to him who entrusted it to you, and do not betray him who betrays you.' [Reported by Abu Dawud and at-Tirmidhi, who graded it Hasan, and al-Hakim graded it Sahih, but Abu Hatim ar-Razi graded it Munkar]."
      }
    },

    {
      "id": 753,
      "name": {
        "arabic": " وَعَنْ يَعْلَى بْنِ أُمَيَّةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَتَتْكَ رُسُلِي فَأَعْطِهِمْ ثَلَاثِينَ دِرْعاً \", قُلْتُ: يَا رَسُولَ اَللَّهِ ! أَعَارِيَةٌ مَضْمُونَةٌ أَوْ عَارِيَةٌ مُؤَدَّاةٌ? قَالَ: بَلْ عَارِيَةٌ مُؤَدَّاةٌ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": " سیدنا یعلیٰ بن امیہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ارشاد فرمایا کہ ”تمہارے پاس جب میرے ایلچی و قاصد آئیں تو ان کو تیس زرہیں دے دینا۔“ میں نے عرض کیا اے اللہ کے رسول! کیا عاریتاً جس میں ضمانت ہو گی یا اس ادھار کے طور پر جو قابل واپسی ہو گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”ایسا ادھار جو ادا کر دیا جائے گا۔“ اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے اور ابن حبان نے صحیح کہا ہے۔ ",
        "english": "Narrated Ya'la bin Umayyah (RA): Allah's Messenger (ﷺ) said to me, 'When my messengers come to you, give them thirty coats of mail.' I asked, 'O Messenger of Allah! Is it a guaranteed loan (for which I will be compensated if lost) or a loan merely for use to be returned?' He (ﷺ) replied, 'Rather, it is a loan merely for use to be returned (to its owner).'"
      }
    },

    {
      "id": 754,
      "name": {
        "arabic": "وَعَنْ صَفْوَانَ بْنِ أُمَيَّةَ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اِسْتَعَارَ مِنْهُ دُرُوعاً يَوْمَ حُنَيْنٍ.‏ فَقَالَ: أَغَصْبٌ يَا مُحَمَّدُ? قَالَ: بَلْ عَارِيَةٌ مَضْمُونَةٌ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا صفوان بن امیہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے جنگ حنین کے موقع پر ان سے کچھ زرہیں عاریتاً لیں۔ انہوں نے کہا: اے محمد (صلی اللہ علیہ وسلم)! کیا آپ زبردستی غصب کر رہے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”نہیں! بلکہ ضمانت کے ساتھ عاریتاً (ادھار) لے رہا ہوں۔“",
        "english": "Narrated Safwan bin Umayyah (RA): On the day of the battle of Hunayn, the Prophet (ﷺ) borrowed some coats of mail from him. He asked: 'Are you taking them by force (usurpation), O Muhammad?' He (ﷺ) replied: 'No, rather it is a guaranteed loan (borrowed for use with a guarantee of return or compensation).'"
      }
    }
  ]
}