{
  "chapId": 21,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 341,
    "to": 353
  },
  "hadiths": [
    {
      "id": 341,
      "name": {
        "arabic": "عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { أَوَّلُ مَا فُرِضَتْ اَلصَّلَاةُ رَكْعَتَيْنِ , فَأُقِرَّتْ صَلَاةُ اَلسَّفَرِ وَأُتِمَّتْ صَلَاةُ اَلْحَضَرِ } مُتَّفَقٌ عَلَيْه وَلِلْبُخَارِيِّ: { ثُمَّ هَاجَرَ, فَفُرِضَتْ أَرْبَعًا, وَأُقِرَّتْ صَلَاةُ اَلسَّفَرِ عَلَى اَلْأَوَّلِ } زَادَ أَحْمَدُ: { إِلَّا اَلْمَغْرِبَ فَإِنَّهَا وِتْرُ اَلنَّهَارِ, وَإِلَّا اَلصُّبْحَ, فَإِنَّهَا تَطُولُ فِيهَا اَلْقِرَاءَةُ }",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ ابتداء میں دو رکعت فرض کی گئی تھیں (سفر و حضر دونوں میں) پھر سفر کی نماز کو برقرار رکھا گیا (یعنی دو رکعات) اور حضر (قیام) کی نماز کو پورا کر دیا گیا (یعنی چار رکعات)۔ بخاری کی ایک روایت میں ہے کہ پھر جب آپ ﷺ نے ہجرت کی تو چار رکعت فرض کر دی گئیں اور سفر کی نماز پہلی حالت پر برقرار رکھی گئی۔ احمد نے اتنا اضافہ کیا ہے: سوائے نمازِ مغرب کے کیونکہ وہ دن کے وتر ہیں اور سوائے صبح کی نماز کے کیونکہ اس میں قرآت لمبی کی جاتی ہے۔",
        "english": "Narrated 'Aishah (RAA): 'When the prayer was first enjoined, it was of two Rak'ahs. Later the prayer in journey was kept as it was (two Rak'ahs), but the prayer of one who is not travelling (resident) was increased (to four).' [Agreed upon]. In Al-Bukhari: 'Then he migrated, and four Rak'ahs were made obligatory, but the prayer of a traveler remained as it originally was.' Ahmad added: 'Except the Maghrib prayer, for it is the Witr of the day, and the Fajr prayer, because the recitation in it is prolonged.'"
      }
    },

    {
      "id": 342,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَقْصُرُ فِي اَلسَّفَرِ وَيُتِمُّ, وَيَصُومُ وَيُفْطِرُ.‏ } رَوَاهُ اَلدَّارَقُطْنِيُّ, وَرُوَاتُهُ ثِقَاتٌ.‏ إِلَّا أَنَّهُ مَعْلُولٌ وَالْمَحْفُوظُ عَنْ عَائِشَةَ مِنْ فِعْلِهَا, وَقَالَتْ: { إِنَّهُ لَا يَشُقُّ عَلَيَّ } أَخْرَجَهُ اَلْبَيْهَقِيُّ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ سفر میں قصر بھی کرتے تھے اور اتمام (پوری نماز) بھی، نیز روزہ رکھتے بھی تھے اور افطار بھی کر لیتے تھے۔ (دارقطنی)۔ اس کے راوی ثقہ ہیں، مگر حدیث معلول ہے اور محفوظ بات یہ ہے کہ یہ سیدہ عائشہ رضی اللہ عنہا کا اپنا ذاتی فعل تھا، انہوں نے فرمایا: ”یہ (پوری نماز پڑھنا) مجھ پر گراں نہیں۔“ اسے بیہقی نے روایت کیا ہے۔",
        "english": "Narrated 'Aisha (RA): The Prophet (ﷺ) used to shorten the prayer while traveling and also pray it in full; and he used to fast and also break the fast. [Reported by ad-Daraqutni, and its narrators are reliable]. However, it is defective (Ma'lul). What is preserved (from authentic sources) is that it was the practice of 'Aisha herself, and she said: \"It is not difficult for me (to pray in full).\" [Reported by al-Baihaqi]."
      }
    },

    {
      "id": 343,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ يُحِبُّ أَنْ تُؤْتَى رُخَصُهُ كَمَا يَكْرَهُ أَنْ تُؤْتَى مَعْصِيَتُهُ } رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ .‏ وَفِي رِوَايَةٍ: { كَمَا يُحِبُّ أَنْ تُؤْتَى عَزَائِمُهُ }",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ کو یہ پسند ہے کہ جن کاموں میں اس نے رخصت (سہولت) عنایت فرمائی ہے، ان پر عمل کیا جائے، جس طرح اسے یہ ناپسند ہے کہ اس کی نافرمانی کی جائے۔“ اسے احمد نے روایت کیا ہے، ابن خزیمہ اور ابن حبان نے اسے صحیح قرار دیا ہے۔ اور ایک روایت میں (ناپسندیدگی کے بجائے) یہ ہے کہ: ”جیسا اللہ تعالیٰ کو پسند ہے کہ اس کے تاکیدی احکام (فرائض) پر عمل کیا جائے۔“",
        "english": "Narrated Ibn 'Umar (RAA): The Messenger of Allah (ﷺ) said: 'Allah loves that His concessions (Rukhas) should be accepted, just as He hates that His disobedience should be committed.' [Reported by Ahmad, and authenticated by Ibn Khuzaimah and Ibn Hibban]. In another narration: 'Just as He loves that His obligatory commands (Aza'im) should be performed.'"
      }
    },

    {
      "id": 344,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ رَضِيَ اَللَّهُ عَنْهُ قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا خَرَجَ مَسِيرَةَ ثَلَاثَةِ أَمْيَالٍ أَوْ فَرَاسِخَ, صَلَّى رَكْعَتَيْنِ } رَوَاهُ مُسْلِمٌ .‏ ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ جب تین میل یا تین فرسخ کی مسافت کے سفر پر نکلتے تو دو رکعتیں (نماز قصر) ادا فرماتے تھے۔ (مسلم)",
        "english": "Narrated Anas (RA): Whenever Allah's Messenger (ﷺ) went out on a journey of three miles or three farsakhs, he used to pray two Rak'ahs (Qasr)."
      }
    },

    {
      "id": 345,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { خَرَجْنَا مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مِنْ اَلْمَدِينَةِ إِلَى مَكَّةَ، فَكَانَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى اَلْمَدِينَةِ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ .‏",
        "urdu": "سیدنا انس رضی اللہ عنہ ہی سے مروی ہے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکل کر مدینہ سے مکہ تک کا سفر کیا، آپ صلی اللہ علیہ وسلم مدینہ واپسی تک (چار رکعت والی نمازیں) دو، دو رکعتیں ہی ادا فرماتے رہے۔ (بخاری و مسلم) البتہ متن حدیث کے الفاظ بخاری کے ہیں۔",
        "english": "Narrated Anas (RAA): 'We went out from Al-Madinah to Makkah with the Messenger of Allah (ﷺ) and he used to pray two Rak'ahs (for each of the four Rak'ah prayers) until we returned to Al-Madinah.' [Agreed upon, and the version is that of Al-Bukhari]."
      }
    },

    {
      "id": 346,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أَقَامَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-تِسْعَةَ عَشَرَ يَقْصُرُ } وَفِي لَفْظٍ: { بِمَكَّةَ تِسْعَةَ عَشَرَ يَوْمًا } رَوَاهُ اَلْبُخَارِيُّ . وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: { سَبْعَ عَشْرَةَ } وَفِي أُخْرَى: { خَمْسَ عَشْرَةَ } وَلَهُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ: { ثَمَانِيَ عَشْرَةَ } وَلَهُ عَنْ جَابِرٍ: { أَقَامَ بِتَبُوكَ عِشْرِينَ يَوْمًا يَقْصُرُ اَلصَّلَاةَ } وَرُوَاتُهُ ثِقَاتٌ, إِلَّا أَنَّهُ اُخْتُلِفَ فِي وَصْلِهِ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے (فتح مکہ کے موقع پر) انیس روز قیام فرمایا اور آپ ﷺ قصر ہی فرماتے رہے۔ (بخاری)۔ ابوداؤد کی ایک روایت میں سترہ اور دوسری میں پندرہ دن کا ذکر ہے۔ عمران بن حصین رضی اللہ عنہ سے مروی ہے کہ آپ ﷺ کی مدتِ قیام اٹھارہ دن تھی۔ سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ آپ ﷺ نے تبوک میں بیس دن قیام فرمایا اور نماز قصر کرتے رہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) stayed for nineteen days (in Makkah) and prayed Qasr. [Reported by al-Bukhari]. In a narration by Abu Dawud, it is seventeen days, and in another, fifteen. Abu Dawud also narrated from 'Imran bin Husain (RA) that the stay was eighteen days. He also narrated from Jabir (RA): \"He stayed in Tabuk for twenty days and shortened the prayer.\""
      }
    },

    {
      "id": 347,
      "name": {
        "arabic": " وَعَنْ أَنَسٍ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا اِرْتَحَلَ قَبْلَ أَنْ تَزِيغَ اَلشَّمْسُ أَخَّرَ اَلظُّهْرَ إِلَى وَقْتِ اَلْعَصْرِ, ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا, فَإِنْ زَاغَتْ اَلشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ صَلَّى اَلظُّهْرَ, ثُمَّ رَكِبَ } مُتَّفَقٌ عَلَيْهِ.‏ وَفِي رِوَايَةِ اَلْحَاكِمِ فِي \"اَلْأَرْبَعِينَ\" بِإِسْنَادِ اَلصَّحِيحِ: { صَلَّى اَلظُّهْرَ وَالْعَصْرَ, ثُمَّ رَكِبَ } وَلِأَبِي نُعَيْمٍ فِي \"مُسْتَخْرَجِ مُسْلِمٍ\": { كَانَ إِذَا كَانَ فِي سَفَرٍ, فَزَالَتْ اَلشَّمْسُ صَلَّى اَلظُّهْرَ وَالْعَصْرَ جَمِيعًا, ثُمَّ اِرْتَحَلَ }",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب زوال آفتاب سے پہلے سفر شروع فرماتے تو ظہر کی نماز کو عصر کے وقت تک مؤخر کر لیتے، پھر (عصر کے وقت) قیام فرما کر دونوں کو جمع کر کے پڑھتے۔ اور اگر روانگی سے پہلے سورج زوال پذیر ہو جاتا تو ظہر کی نماز پڑھ کر سوار ہوتے۔ (بخاری و مسلم)۔ حاکم کی روایت میں ہے کہ (زوال کے بعد) ظہر اور عصر دونوں پڑھ کر روانہ ہوتے۔ ابونعیم کی روایت میں ہے کہ جب آپ سفر میں ہوتے اور زوال ہو جاتا تو ظہر و عصر اکٹھی پڑھ کر کوچ فرماتے۔",
        "english": "Narrated Anas (RAA): 'Whenever the Messenger of Allah (ﷺ) set out on a journey before the sun passed the meridian (Zawal), he would delay the Dhuhr prayer until the time of Asr, then he would dismount and pray them together. But if the sun had passed the meridian before he set out, he would pray Dhuhr and then mount (his camel).' [Agreed upon]. In Al-Hakim's 'Al-Arba'in' with a Sahih chain: 'He prayed Dhuhr and Asr then mounted.' In Abu Nu'aim's 'Mustakhraj' of Muslim: 'When he was on a journey and the sun passed the meridian, he would pray Dhuhr and Asr together and then resume the journey.'"
      }
    },

    {
      "id": 348,
      "name": {
        "arabic": " وَعَنْ مُعَاذٍ ‏- رضى الله عنه ‏- قَالَ: { خَرَجْنَا مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي غَزْوَةِ تَبُوكَ، فَكَانَ يُصَلِّي اَلظُّهْرَ وَالْعَصْرَ جَمِيعًا, وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا } رَوَاهُ مُسْلِمٌ .‏ ",
        "urdu": "سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ ہم غزوہ تبوک کے موقع پر رسول اللہ ﷺ کے ہمراہ نکلے تو آپ ﷺ ظہر اور عصر کی نمازیں اکٹھی پڑھتے اور مغرب و عشاء اکٹھی پڑھتے تھے۔ (مسلم)",
        "english": "Narrated Mu'adh bin Jabal (RA): We went out with Allah's Messenger (ﷺ) on the expedition to Tabuk, and he used to offer the Zuhr and 'Asr prayers together, and the Maghrib and 'Isha prayers together."
      }
    },

    {
      "id": 349,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: { لَا تَقْصُرُوا اَلصَّلَاةَ فِي أَقَلَّ مِنْ أَرْبَعَةِ بُرُدٍ; مِنْ مَكَّةَ إِلَى عُسْفَانَ } رَوَاهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ . وَالصَّحِيحُ أَنَّهُ مَوْقُوفٌ، كَذَا أَخْرَجَهُ اِبْنُ خُزَيْمَةَ.‏",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”چار برد (تقریباً 80 کلومیٹر) سے کم فاصلے کے سفر میں نماز قصر نہ کرو، جیسا کہ مکہ سے عسفان کا فاصلہ ہے۔“ اسے دارقطنی نے ضعیف سند سے روایت کیا ہے، لیکن صحیح بات یہ ہے کہ یہ قول موقوف ہے (یعنی ابن عباس رضی اللہ عنہما کا اپنا قول ہے)۔ ابن خزیمہ نے بھی اسے اسی طرح روایت کیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RAA): The Messenger of Allah (ﷺ) said: 'Do not shorten the prayer for a distance less than four Burud (post stages), such as the distance from Makkah to 'Usfan.' [Reported by ad-Daraqutni with a weak chain; the correct view is that it is Mauquf (a saying of a Companion)]."
      }
    },

    {
      "id": 350,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خَيْرُ أُمَّتِي اَلذِّينَ إِذَا أَسَاءُوا اِسْتَغْفَرُوا, وَإِذَا سَافَرُوا قَصَرُوا وَأَفْطَرُوا } أَخْرَجَهُ اَلطَّبَرَانِيُّ فِي \"اَلْأَوْسَطِ\" بِإِسْنَادٍ ضَعِيفٍ .‏ وَهُوَ فِي مُرْسَلِ سَعِيدِ بْنِ اَلْمُسَيَّبِ عِنْدَ اَلْبَيْهَقِيِّ مُخْتَصَرٌ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میری امت کے بہترین لوگ وہ ہیں کہ جب ان سے کوئی برائی سرزد ہو جائے تو وہ بخشش طلب کرتے ہیں، اور جب سفر پر ہوتے ہیں تو نماز قصر کرتے ہیں اور روزہ افطار کرتے (نہیں رکھتے) ہیں۔“ (طبرانی، بیہقی)",
        "english": "Narrated Jabir (RA): Allah's Messenger (ﷺ) said: 'The best of my Ummah are those who, when they do something wrong, they seek Allah's forgiveness; and when they travel, they shorten the prayer and break the fast (do not fast).'"
      }
    },

    {
      "id": 351,
      "name": {
        "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَتْ بِي بَوَاسِيرُ, فَسَأَلْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَنْ اَلصَّلَاةِ؟ فَقَالَ: \"صَلِّ قَائِمًا, فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا, فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ\" } رَوَاهُ اَلْبُخَارِيُّ.‏",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ مجھے بواسیر کا مرض تھا۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے (ایسی حالت میں) نماز پڑھنے کے بارے میں دریافت کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”کھڑے ہو کر نماز پڑھو، اگر (کھڑے ہونے کی) طاقت نہ ہو تو بیٹھ کر پڑھو، اور اگر اس کی بھی طاقت نہ ہو تو پہلو کے بل لیٹ کر پڑھو۔“ (بخاری)",
        "english": "Narrated ‘Imran bin Husain (RAA): 'I had hemorrhoids (piles), so I asked the Prophet (ﷺ) about the prayer. He said: \"Pray standing; if you are unable, then sit; and if you are unable, then pray lying on your side.\"' [Reported by Al-Bukhari]."
      }
    },

    {
      "id": 352,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ قَالَ: { عَادَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-مَرِيضًا, فَرَآهُ يُصَلِّي عَلَى وِسَادَةٍ, فَرَمَى بِهَا, وَقَالَ: \"صَلِّ عَلَى اَلْأَرْضِ إِنْ اِسْتَطَعْتَ, وَإِلَّا فَأَوْمِ إِيمَاءً, وَاجْعَلْ سُجُودَكَ أَخْفَضَ مِنْ رُكُوعِكَ\" } رَوَاهُ اَلْبَيْهَقِيُّ.‏ وَصَحَّحَ أَبُو حَاتِمٍ وَقْفَهُ.‏",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے ایک مریض کی عیادت فرمائی تو دیکھا کہ وہ تکیہ پر (سر ٹیک کر) سجدہ کر رہا ہے۔ آپ ﷺ نے وہ تکیہ پرے پھینک دیا اور فرمایا: ”اگر تم میں ہمت ہے تو زمین پر (سجدہ کر کے) نماز پڑھو، ورنہ پھر اشارے سے پڑھ لو، اور اپنے سجدے کے اشارے کو رکوع کے اشارے سے زیادہ نیچا کرو۔“ (بیہقی، ابو حاتم نے اس کے موقوف ہونے کو صحیح قرار دیا ہے)۔",
        "english": "Narrated Jabir (RA): The Prophet (ﷺ) visited a sick person and saw him praying (prostrating) on a pillow. He (ﷺ) took it and threw it away and said: \"Pray on the ground if you can, otherwise pray by making gestures (with your head), and make your prostration (Sujud) lower than your bowing (Ruku').\" [Reported by al-Baihaqi, and Abu Hatim graded it as Mauquf]."
      }
    },

    {
      "id": 353,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { رأيتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- يُصَلِّي مُتَرَبِّعًا } رَوَاهُ النَّسَائِيُّ.‏ وَصَحَّحَهُ اَلْحَاكِمُ.‏",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو ”متربعاً“ (چار زانو / پالتی مار کر) بیٹھ کر نماز پڑھتے دیکھا ہے۔ (نسائی، حاکم)",
        "english": "Narrated ‘Aishah (RAA): ‘I saw the Prophet (ﷺ) praying while sitting cross-legged.’ [Reported by an-Nasa'i, and al-Hakim authenticated it]."
      }
    }
  ]
}
