{
  "chapId": 15,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 187,
    "to": 194
  },
  "hadiths": [
    {
      "id": 187,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يُصَلِّيَ اَلرَّجُلُ مُخْتَصِرًا } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ .‏ وَمَعْنَاهُ : أَنْ يَجْعَلَ يَدَهُ عَلَى خَاصِرَتِهِ  وَفِي اَلْبُخَارِيِّ : عَنْ عَائِشَةَ ‏- رَضِيَ اَللَّهُ عَنْهَا‏- أَنَّ ذَلِكَ فِعْلُ اَلْيَهُودِ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے آدمی کو نماز میں اپنے دونوں کولہوں (پہلووں) پر ہاتھ رکھ کر نماز پڑھنے سے منع فرمایا ہے۔ (بخاری و مسلم) الفاظ حدیث مسلم کے ہیں اور بخاری میں سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ یہ یہودیوں کی نماز کا طریقہ ہے۔",
        "english": "Narrated Abū Hurayrah (RA): 'The Messenger of Allah (ﷺ) forbade a man from praying Muḵhtaṣiran (with his hands on his sides/hips).' [Agreed upon (Al-Bukhārī and Muslim)], and the wording is that of Muslim. Its meaning is: that he places his hand on his Khāṣirah (hip/flank). And in Al-Bukhārī, from 'Ā'ishah (RA): that this was the action of the Jews."
      }
    },

    {
      "id": 188,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ‏- رَضِيَ اَللَّهُ عَنْهُ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا قُدِّمَ اَلْعَشَاءُ فَابْدَءُوا بِهِ قَبْلَ أَنْ تُصَلُّوا اَلْمَغْرِبَ } مُتَّفَقٌ عَلَيْهِ .‏ ",
        "urdu": " سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب شام کا کھانا پیش کیا گیا ہو تو مغرب کی نماز ادا کرنے سے پہلے کھانا کھا لو۔ “ (بخاری و مسلم)",
        "english": "Narrated Anas (RA): The Messenger of Allah (ﷺ) said: 'When the dinner (al-'Ashā') is presented, begin with it before you pray Maghrib.' [Agreed upon (Al-Bukhārī and Muslim)]."
      }
    },

    {
      "id": 189,
      "name": {
        "arabic": "وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { إِذَا قَامَ أَحَدُكُمْ فِي اَلصَّلَاةِ فَلَا يَمْسَحِ اَلْحَصَى , فَإِنَّ اَلرَّحْمَةَ تُوَاجِهُهُ } رَوَاهُ اَلْخَمْسَةُ بِإِسْنَادٍ صَحِيحٍ وَزَادَ أَحْمَدُ : \"وَاحِدَةً أَوْ دَعْ\" وَفِي \"اَلصَّحِيحِ\" عَنْ مُعَيْقِيبٍ نَحْوُهُ بِغَيْرِ تَعْلِيلٍ.",
        "urdu": " سیدنا ابوذر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” جب تم میں سے کوئی شخص نماز ادا کر رہا ہو تو (سجدہ گاہ) سے سنگریزوں (کنکریوں) کو اپنے ہاتھ سے نہ ہٹائے۔ کیونکہ (اس وقت) رحمت خداوندی نمازی کی طرف متوجہ ہوتی ہے۔“ اسے پانچوں یعنی احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے صحیح سند کے ساتھ روایت کیا ہے۔ مسند احمد میں اتنا اضافہ ہے کہ (اگر کنکریاں ہٹانا ہی ہیں تو) ” ایک مرتبہ ہٹا دو یا چھوڑ دو۔ “ اور صحیح بخاری میں یہی روایت معیقیب سے مروی ہے اس میں سبب کا بیان نہیں ہے۔ ",
        "english": "Narrated from Abu Dharr (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings be upon him) said: \"If any of you stands for prayer, let him not wipe the pebbles, for Mercy faces him.\" It was narrated by the five (Ahmad, Abu Dawud, At-Tirmidhi, An-Nasa’i, and Ibn Majah) with a sound chain. Ahmad added: \"(Wipe) once or leave it.\" And in 'As-Sahih' (Al-Bukhari) the same narration is reported from Mu'ayqib without mentioning the reason."
      }
    },

    {
      "id": 190,
      "name": {
        "arabic": "عَنْ عَائِشَةَ ‏-‏-رَضِيَ اَللَّهُ عَنْهَا‏-‏- قَالَتْ : { سَأَلْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلِالْتِفَاتِ فِي اَلصَّلَاةِ ? فَقَالَ : \"هُوَ اِخْتِلَاسٌ يَخْتَلِسُهُ اَلشَّيْطَانُ مِنْ صَلَاةِ اَلْعَبْدِ\" } رَوَاهُ اَلْبُخَارِيُّ . وَلِلتِّرْمِذِيِّ : عَنْ أَنَسٍ ‏- وَصَحَّحَهُ ‏- { إِيَّاكَ وَالِالْتِفَاتَ فِي اَلصَّلَاةِ , فَإِنَّهُ هَلَكَةٌ , فَإِنْ كَانَ فَلَا بُدَّ فَفِي اَلتَّطَوُّعِ }",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے نماز کے دوران ادھر ادھر دیکھنے کے بارے میں دریافت کیا۔ ارشاد فرمایا ” یہ تو شیطان کا جھپٹا ہے جس کے ذریعہ شیطان انسان کی نماز کو جھپٹ لیتا ہے۔“ (بخاری) ترمذی کی حدیث، جسے انہوں نے صحیح قرار دیا ہے میں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” نماز میں التفات (ادھر ادھر نظر دوڑانے) سے بچنے کی کوشش کرو یہ موجب ہلاکت ہے۔ اگر شدید اور ناگزیر مجبوری لاحق ہو تو نوافل میں ایسا کیا جا سکتا ہے۔ “ ",
        "english": "Narrated 'Aishah (may Allah be pleased with her): I asked the Messenger of Allah (peace and blessings be upon him) about looking around during prayer. He said: \"It is a snatching away (of the reward) which Satan snatches from the prayer of a servant.\" Reported by Al-Bukhari. And At-Tirmidhi reported from Anas (and he graded it Sahih): \"Beware of turning around in prayer, for it is destruction (ruin). If it must be done, then let it be in voluntary prayers.\""
      }
    },

    {
      "id": 191,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { إِذَا كَانَ أَحَدُكُمْ فِي اَلصَّلَاةِ فَإِنَّهُ يُنَاجِي رَبَّهُ , فَلَا يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلَا عَنْ يَمِينِهِ , وَلَكِنْ عَنْ شِمَالِهِ تَحْتَ قَدَمِهِ } مُتَّفَقٌ عَلَيْهِ وَفِي رِوَايَةٍ : { أَوْ تَحْتَ قَدَمِهِ }",
        "urdu": " سیدنا انس رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب تم میں سے کوئی نماز میں ہوتا ہے تو وہ اپنے پروردگار سے باتیں کر رہا ہوتا ہے (لہذا ایسی حالت میں) اپنے سامنے کی طرف اور دائیں جانب نہ تھوکے بلکہ اپنی بائیں جانب پاؤں کے نیچے (تھوکے)۔ “ (بخاری و مسلم) اور ایک روایت میں ہے کہ بائیں طرف یا اپنے پاؤں کے نیچے۔",
        "english": "Narrated Anas (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"When any of you stands in prayer, he is conversing with his Lord, so let none of you spit in front of him nor to his right, but to his left or under his foot.\" Agreed upon (Al-Bukhari and Muslim). And in one narration: \"Or under his foot.\""
      }
    },

    {
      "id": 192,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : { كَانَ قِرَامٌ لِعَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- سَتَرَتْ بِهِ جَانِبَ بَيْتِهَا فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَمِيطِي عَنَّا قِرَامَكِ هَذَا , فَإِنَّهُ لَا تَزَالُ تَصَاوِيرُهُ تَعْرِضُ لِي فِي صَلَاتِي } رَوَاهُ اَلْبُخَارِيُّ وَاتَّفَقَا عَلَى حَدِيثِهَا فِي قِصَّةِ أَنْبِجَانِيَّةِ أَبِي جَهْمٍ , وَفِيهِ : { فَإِنَّهَا أَلْهَتْنِي عَنْ صَلَاتِي }",
        "urdu": " سیدنا انس رضی اللہ عنہ ہی سے مروی ہے کہ سیدہ عائشہ رضی اللہ عنہا کے پاس ایک زیبائشی چادر (برائے پردہ) تھی جو انہوں نے اپنے حجرے کے ایک طرف لٹکا رکھی تھی۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ” زیبائشی چادر کو میرے سامنے سے ہٹا دو کیونکہ اس کی تصویریں میری نماز میں میرے سامنے آتی ہیں (نماز میں خلل اندازی کا باعث بنتی ہیں)۔ “ بخاری اور مسلم دونوں ابوجہم کی چادر انبجانیہ کے قصہ پر متفق ہیں اس میں ہے کہ ” اس چادر نے مجھے میری نماز سے غافل کر دیا۔ “ ",
        "english": "Narrated from Anas (may Allah be pleased with him): 'Aishah (may Allah be pleased with her) had a patterned curtain (Qiram) with which she covered one side of her room. The Prophet (peace and blessings be upon him) said to her: \"Remove this curtain of yours from before us, for its pictures keep presenting themselves to me during my prayer (disturbing my concentration).\" Reported by Al-Bukhari. And both (Al-Bukhari and Muslim) agreed upon her Hadith regarding the story of Abu Jahm's garment (Anbijaniyyah), in which it states: \"For it diverted my attention from my prayer.\""
      }
    },

    {
      "id": 193,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { لَيَنْتَهِيَنَّ قَوْمٌ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى اَلسَّمَاءِ فِي اَلصَّلَاةِ أَوْ لَا تَرْجِعَ إِلَيْهِمْ } رَوَاهُ مُسْلِمٌ . وَلَهُ : عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- يَقُولُ : { لَا صَلَاةَ بِحَضْرَةِ طَعَامٍ , وَلَا هُوَ يُدَافِعُهُ الْأَخْبَثَانِ }",
        "urdu": " سیدنا جابر بن سمرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” مسلمان قوم نماز میں اپنی نظریں آسمان کی جانب اٹھانے سے باز آ جائے ورنہ ایسا نہ ہو کہ پھر ان کی نظریں واپس ہی نہ آئیں (یعنی نابینا ہو جائیں)۔ “ (مسلم) اور مسلم ہی میں سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ ” جب کھانا حاضر ہو اور قضائے حاجت پیش ہو تو نماز نہیں ہوتی۔ “",
        "english": "Narrated from Jabir ibn Samurah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"Let those people cease raising their eyes towards the sky in prayer, or their eyesight will not return to them (i.e., they will lose their sight).\" Reported by Muslim. And also reported by Muslim from 'Aishah (may Allah be pleased with her) who said: I heard the Messenger of Allah (peace and blessings be upon him) saying: \"There is no prayer in the presence of food, nor (is there a prayer) when one is resisting the two evils (Al-Akhbathan).\""
      }
    },

    {
      "id": 194,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ : { اَلتَّثَاؤُبُ مِنْ اَلشَّيْطَانِ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَكْظِمْ مَا اِسْتَطَاعَ } رَوَاهُ مُسْلِمٌ وَاَلتِّرْمِذِيُّ , وَزَادَ : { فِي اَلصَّلَاةِ }",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جمائی کا آنا شیطانی حرکت ہے۔ تم میں سے اگر کسی کو جمائی آ جائے تو حتیٰ الوسع اسے روکنے کی کوشش کرے۔ “ (مسلم و ترمذی) ترمذی نے اپنی روایت میں 'نماز میں' کا اضافہ نقل کیا ہے۔ ",
        "english": "Narrated from Abu Hurayrah (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"Yawning is from Satan, so if one of you yawns, he should suppress it as much as he can.\" Reported by Muslim and At-Tirmidhi, who added: \"During the prayer.\""
      }
    }
  ]
}
