{
  "chapId": 39,
  "bookId": 6,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 593,
    "to": 606
  },
  "hadiths": [
    {
      "id": 593,
      "name": {
        "arabic": "عَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { مَا أَهَلَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِلَّا مِنْ عِنْدِ اَلْمَسْجِدِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے (احرام باندھنے کے بعد) صرف مسجد کے پاس سے ہی تلبیہ (لبیک) پکارنا شروع کیا۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): The Messenger of Allah (ﷺ) did not raise his voice with the Talbiyah (Ihlal) except from near the mosque (of Dhul-Hulaifah). [Agreed upon]."
      }
    },

    {
      "id": 594,
      "name": {
        "arabic": "وَعَنْ خَلَّادِ بْنِ اَلسَّائِبِ عَنْ أَبِيهِ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- قَالَ: { أَتَانِي جِبْرِيلُ, فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالْإِهْلَالِ } رَوَاهُ اَلْخَمْسَةُ، وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ",
        "urdu": "خلاد بن سائب اپنے باپ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” جبرائیل امین میرے پاس آئے اور مجھے حکم دیا کہ میں اپنے صحابہ کو حکم دوں کہ لبیک کہتے ہوئے اپنی آوازوں کو بلند کریں۔ “ اسے پانچوں نے روایت کیا۔ امام ترمذی اور امام ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Khallad bin as-Sa'ib on the authority of his father (RA): Allah's Messenger (ﷺ) said: 'Jibril (peace be upon him) came to me and commanded me to order my companions to raise their voices with the Talbiyah (shouting Labbayk).'"
      }
    },

    {
      "id": 595,
      "name": {
        "arabic": "وَعَنْ زَيْدِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-تَجَرَّدَ لِإِهْلَالِهِ وَاغْتَسَلَ } رَوَاهُ اَلتِّرْمِذِيُّ وَحَسَّنَهُ",
        "urdu": "سیدنا زید بن ثابت رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے احرام باندھنے کے وقت سلے ہوئے کپڑے اتارے اور غسل کیا۔ اسے ترمذی نے روایت کیا ہے اور اسے حسن کہا ہے۔",
        "english": "Narrated Zaid bin Thabit (RA): The Prophet (ﷺ) took off his (ordinary) clothes and took a bath before raising his voice with the Talbiyah (for Ihram). [Reported by At-Tirmidhi, who graded it Hasan]."
      }
    },

    {
      "id": 596,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم سُئِلَ: مَا يَلْبَسُ اَلْمُحْرِمُ مِنْ اَلثِّيَابِ? فَقَالَ: \" لَا تَلْبَسُوا الْقُمُصَ, وَلَا اَلْعَمَائِمَ, وَلَا السَّرَاوِيلَاتِ, وَلَا اَلْبَرَانِسَ, وَلَا اَلْخِفَافَ, إِلَّا أَحَدٌ لَا يَجِدُ اَلنَّعْلَيْنِ فَلْيَلْبَسْ اَلْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ اَلْكَعْبَيْنِ, وَلَا تَلْبَسُوا شَيْئًا مِنْ اَلثِّيَابِ مَسَّهُ اَلزَّعْفَرَانُ وَلَا اَلْوَرْسُ\" } مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا احرام باندھنے والا کیا لباس پہنے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”وہ قمیص، پگڑی، شلوار و پاجامہ، کٹ ٹوپ اور موزے نہ پہنے۔ لیکن اگر کسی شخص کے پاس جوتے نہیں تو وہ موزے پہن لے اور اسے چاہیئے کہ دونوں کو ٹخنوں کے نیچے سے کاٹ لے اور ایسا کوئی کپڑا نہ پہنے جسے زعفران اور کیسو (ایک زرد رنگ کی خوشبودار بوٹی) لگا ہوا ہو۔“ (بخاری و مسلم) اور یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) was asked, 'What should a Muhrim (one in the state of Ihram) wear?' He replied, 'Do not wear shirts, turbans, trousers, hooded cloaks, or leather socks (Khuffs), unless one cannot find sandals, then he may wear Khuffs but should cut them so that they reach below the ankles. And do not wear any clothing that has been touched by saffron or Wars (a yellow, fragrant plant).' [Agreed upon; wording is Muslim's]."
      }
    },

    {
      "id": 597,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كُنْتُ أُطَيِّبُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ, وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان کے احرام باندھنے سے پہلے خوشبو لگائی، اور جب انہوں نے احرام کھولا (یعنی حلق کروایا) تو بیت اللہ کے طوافِ (افاضہ) سے پہلے دوبارہ خوشبو لگائی۔ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): I used to apply perfume to the Messenger of Allah (ﷺ) when he entered the state of Ihram before he donned the Ihram garments, and when he exited the state of Ihram (Tahallul) before he performed Tawaf of the Ka'bah. [Agreed upon]."
      }
    },

    {
      "id": 598,
      "name": {
        "arabic": "وَعَنْ عُثْمَانَ بْنِ عَفَّانَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَنْكِحُ اَلْمُحْرِمُ, وَلَا يُنْكِحُ, وَلَا يَخْطُبُ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عثمان بن عفان رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”احرام والا نکاح نہ کرے اور نہ نکاح کرائے اور نہ منگنی کرے۔“ (مسلم)",
        "english": "Narrated 'Uthman bin 'Affan (RA): Allah's Messenger (ﷺ) said: 'A Muhrim (one in the state of Ihram) must not marry, or give someone else in marriage, or making a proposal for marriage.' [Reported by Muslim]."
      }
    },

    {
      "id": 599,
      "name": {
        "arabic": " وَعَنْ أَبِي قَتَادَةَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- { فِي قِصَّةِ صَيْدِهِ اَلْحِمَارَ اَلْوَحْشِيَّ, وَهُوَ غَيْرُ مُحْرِمٍ, قَالَ: فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- لِأَصْحَابِهِ, وَكَانُوا مُحْرِمِينَ: \" هَلْ مِنْكُمْ أَحَدٌ أَمَرَهُ أَوْ أَشَارَ إِلَيْهِ بِشَيْءٍ ? \" قَالُوا: لَا.‏ قَالَ: \" فَكُلُوا مَا بَقِيَ مِنْ لَحْمِهِ \" } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا ابوقتادہ انصاری رضی اللہ عنہ سے ان کے جنگلی گدھے کو شکار کرنے کے قصے میں مروی ہے جبکہ وہ خود احرام میں نہیں تھے (اور ان کے ساتھی احرام میں تھے)۔ رسول اللہ صلی اللہ علیہ وسلم نے اپنے ان صحابہ سے فرمایا جو احرام باندھے ہوئے تھے: ”کیا تم میں سے کسی نے اسے (ابوقتادہ کو) شکار کا حکم دیا تھا یا اس کی طرف کسی چیز سے اشارہ کیا تھا؟“ انہوں نے عرض کیا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ”پھر اس کے گوشت سے جو بچ گیا ہے اسے کھاؤ۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Qatadah al-Ansari (RA) regarding the story of his hunting a wild ass while he was not in a state of Ihram: Allah's Messenger (ﷺ) asked his Companions, who were in a state of Ihram, \"Did any of you command him to do that or point it out to him?\" They replied, \"No.\" He (ﷺ) then said, \"Then eat what is left of its meat.\" [Agreed upon]."
      }
    },

    {
      "id": 600,
      "name": {
        "arabic": "وَعَنْ اَلصَّعْبِ بْنِ جَثَّامَةَ اَللَّيْثِيِّ ‏- رضى الله عنه ‏- { أَنَّهُ أَهْدَى لِرَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حِمَارًا وَحْشِيًّا, وَهُوَ بِالْأَبْوَاءِ, أَوْ بِوَدَّانَ، فَرَدَّهُ عَلَيْهِ, وَقَالَ: \" إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلَّا أَنَّا حُرُمٌ \" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا صعب بن جثامہ لیثی رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو ایک وحشی گدھا (گورخر) بطور تحفہ پیش کیا جبکہ آپ صلی اللہ علیہ وسلم مقام ”ابواء“ یا ”ودان“ میں تھے، تو آپ صلی اللہ علیہ وسلم نے وہ واپس کر دیا اور فرمایا: ”ہم نے یہ آپ کو صرف اس لیے واپس کیا ہے کہ ہم احرام کی حالت میں ہیں۔“ (بخاری و مسلم)",
        "english": "Narrated As-Sa'b bin Jaththama al-Laythi (RA): He presented a wild ass (zebra/onager) as a gift to Allah's Messenger (ﷺ) while he was at Al-Abwa' or Waddan. He (the Prophet) returned it to him and said: 'We only returned it to you because we are in the state of Ihram.'"
      }
    },

    {
      "id": 601,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خَمْسٌ مِنَ اَلدَّوَابِّ كُلُّهُنَّ فَاسِقٌ, يُقْتَلْنَ فِي [ اَلْحِلِّ وَ ] اَلْحَرَمِ: اَلْغُرَابُ, وَالْحِدَأَةُ, وَالْعَقْرَبُ, وَالْفَأْرَةُ، وَالْكَلْبُ اَلْعَقُورُ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ جانور ایسے ہیں جو سب کے سب موذی (نقصان پہنچانے والے) ہیں، انہیں حل (حرم سے باہر) اور حرم (سب جگہوں) میں مار دیا جائے: کوا، چیل، بچھو، چوہا اور کاٹ کھانے والا کتا۔“ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): Allah's Messenger (ﷺ) said: \"Five kinds of animals are mischievous and may be killed in the Harām (sanctuary) as well as outside it: the crow, the kite, the scorpion, the mouse and the rabid dog.\""
      }
    },

    {
      "id": 602,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- { اِحْتَجَمَ وَهُوَ مُحْرِمٌ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے سینگی لگوائی (حجامہ کروایا) جبکہ آپ صلی اللہ علیہ وسلم احرام کی حالت میں تھے۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) had himself cupped (Hijamah) while he was in the state of Ihram. [Agreed upon]."
      }
    },

    {
      "id": 603,
      "name": {
        "arabic": "وَعَنْ كَعْبِ بْنِ عُجْرَةَ ‏- رضى الله عنه ‏- قَالَ: { حُمِلْتُ إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي, فَقَالَ: ' مَا كُنْتُ أَرَى اَلْوَجَعَ بَلَغَ بِكَ مَا أَرَى, تَجِدُ شَاةً ? قُلْتُ: لَا.‏ قَالَ:  فَصُمْ ثَلَاثَةَ أَيَّامٍ, أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ, لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ ' } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا کعب بن عجرہ رضی اللہ عنہ سے روایت ہے کہ مجھے رسول اللہ صلی اللہ علیہ وسلم کے پاس (اس حال میں) لایا گیا کہ جوئیں میرے چہرے پر گر رہی تھیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”میرا یہ خیال نہ تھا کہ تکلیف تمہیں اس حد تک پہنچا دے گی جو میں دیکھ رہا ہوں، کیا تمہارے پاس بکری ہے؟“ میں نے عرض کیا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”پھر تین دن کے روزے رکھ لو، یا چھ مسکینوں کو کھانا کھلا دو، ہر مسکین کو آدھا صاع (تقریباً سوا کلو غلہ) دو۔“ (بخاری و مسلم)",
        "english": "Narrated Ka'b bin 'Ujrah (RA): I was carried to the Messenger of Allah (ﷺ) while lice were falling on my face. He (ﷺ) said, \"I did not think that your suffering had reached such an extent as I see. Can you afford a sheep?\" I said, \"No.\" He said, \"Then fast for three days, or feed six poor persons, giving each one half a Sa' (of food).\" [Agreed upon]."
      }
    },

    {
      "id": 604,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { لَمَّا فَتَحَ اَللَّهُ عَلَى رَسُولِهِ ‏- صلى الله عليه وسلم ‏-مَكَّةَ, قَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلنَّاسِ، فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ, ثُمَّ قَالَ: \" إِنَّ اَللَّهَ حَبَسَ عَنْ مَكَّةَ اَلْفِيلَ, وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ, وَإِنَّهَا لَمْ تَحِلَّ لِأَحَدٍ كَانَ قَبْلِي, وَإِنَّمَا أُحِلَّتْ لِي سَاعَةٌ مِنْ نَهَارٍ, وَإِنَّهَا لَنْ تَحِلَّ لِأَحَدٍ بَعْدِي, فَلَا يُنَفَّرُ صَيْدُهَا, وَلَا يُخْتَلَى شَوْكُهَا, وَلَا تَحِلُّ سَاقِطَتُهَا إِلَّا لِمُنْشِدٍ, وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ اَلنَّظَرَيْنِ \" فَقَالَ اَلْعَبَّاسُ: إِلَّا اَلْإِذْخِرَ, يَا رَسُولَ اَللَّهِ, فَإِنَّا نَجْعَلُهُ فِي قُبُورِنَا وَبُيُوتِنَا, فَقَالَ: \" إِلَّا اَلْإِذْخِرَ \" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ جب اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو مکہ کی فتح دی تو رسول اللہ صلی اللہ علیہ وسلم لوگوں کے درمیان کھڑے ہوئے پھر اللہ کی حمد و ثنا بیان کی اور فرمایا ”بیشک اللہ تعالیٰ نے ہاتھیوں کو مکہ سے روک دیا مگر رسول صلی اللہ علیہ وسلم اور مومنوں کو اس پر غلبہ عطا فرمایا اور تحقیق مجھ سے پہلے مکہ کسی پر حلال نہ تھا مگر میرے لئے دن کی ایک گھڑی حلال کر دیا گیا ہے اور یقیناً میرے بعد یہ کسی کیلئے حلال نہیں ہو گا یعنی نہ اس کا شکار بھگایا جائے، نہ اس کا کوئی کانٹے دار درخت کاٹا جائے اور نہ ہی اس کی گری ہوئی چیز سوائے شناخت کرنے والے کے کسی پر حلال ہے اور جس کا کوئی آدمی مارا جائے وہ دو بہتر سوچے ہوئے کاموں میں سے ایک کام میں اختیار رکھتا ہے۔“ تو سیدنا عباس رضی اللہ عنہ نے عرض کیا یا رسول اللہ! اذخر (ایک قسم کی گھاس) کے سوا، کیونکہ اسے ہم اپنی قبروں اور چھتوں میں رکھتے ہیں۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا ”سوائے اذخر کے، (یعنی اسے کاٹنے کی اجازت ہے۔)“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): When Allah gave Victory to His Messenger (ﷺ) over Makkah, Allah's Messenger (ﷺ) stood up among the people, praised and glorified Allah and then said: 'Allah held back the elephant from Makkah and gave His Messenger and the believers authority over it. Verily, it was not made lawful for anyone before me, and it was made lawful for me for only one hour of a day. It will not be made lawful for anyone after me. Its game must not be chased, its thorny bushes must not be uprooted, and its Luqatah (fallen items) must not be picked up except by one who will announce it. If anyone's relative is killed, he has the choice of two things (either blood-money or retaliation).' Al-'Abbas said, 'Except for Idhkhir (a kind of grass), O Messenger of Allah, for we use it in our graves and houses.' The Messenger of Allah (ﷺ) said, 'Except for Idhkhir.' [Agreed upon]."
      }
    },

    {
      "id": 605,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- قَالَ: { إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَدَعَا لِأَهْلِهَا, وَإِنِّي حَرَّمْتُ اَلْمَدِينَةَ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ، وَإِنِّي دَعَوْتُ فِي صَاعِهَا وَمُدِّهَا بِمِثْلَيْ مَا دَعَا إِبْرَاهِيمُ لِأَهْلِ مَكَّةَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عبداللہ بن زید بن عاصم رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیشک ابراہیم علیہ السلام نے مکہ کو حرم قرار دیا اور اس کے رہنے والوں کے لیے دعا فرمائی، اور میں نے مدینہ کو حرم قرار دیا ہے جس طرح ابراہیم علیہ السلام نے مکہ کو حرم قرار دیا تھا، اور میں نے مدینہ کے ”صاع“ اور اس کے ”مد“ (ناپ تول کے پیمانوں) میں ابراہیم علیہ السلام کی مکہ والوں کے لیے کی گئی دعا سے دوگنی برکت کی دعا کی ہے۔“ (بخاری و مسلم)",
        "english": "Narrated 'Abdullah bin Zaid bin 'Asim (RA): Allah's Messenger (ﷺ) said: \"Ibrahim declared Makkah a sanctuary and prayed for its people; and I declare Madinah a sanctuary just as Ibrahim declared Makkah a sanctuary. And I have prayed for its Sa' and Mudd (measures) to have twice as much blessing as Ibrahim prayed for the people of Makkah.\""
      }
    },

    {
      "id": 606,
      "name": {
        "arabic": "وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مدینہ حرم ہے (کوہِ) عیر سے ثور کے درمیان۔“ (مسلم)",
        "english": "Narrated 'Ali bin Abi Talib (RA): Allah's Messenger (ﷺ) said: 'Al-Madinah is a sanctuary between (the mountain of) 'Ayr to Thawr.'"
      }
    }
  ]
}
