{
  "chapId": 6,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 62,
    "to": 76
  },
  "hadiths": [
    {
      "id": 62,
      "name": {
        "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ - رضى الله عنه - قَالَ: { كَانَ أَصْحَابُ رَسُولِ اَللَّهِ - صلى الله عليه وسلم --عَلَى عَهْدِهِ- يَنْتَظِرُونَ اَلْعِشَاءَ حَتَّى تَخْفِقَ رُؤُوسُهُمْ, ثُمَّ يُصَلُّونَ وَلَا  يَتَوَضَّئُونَ } أَخْرَجَهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلدَّارَقُطْنِيّ وَأَصْلُهُ فِي مُسْلِم ٍ ُ  ",
        "urdu": " سیدنا انس رضی اللہ عنہ فرماتے ہیں کہ عہدرسالت مآب صلی اللہ علیہ وسلم میں صحابہ کرام رضی اللہ عنہم نماز عشاء کا اتنا انتظار کرتے کہ غلبہ نیند کی وجہ سے ان کے سر جھک جاتے۔ مگر وہ ازسر نو وضو کئے بغیر نماز پڑھ لیتے۔ ابوداؤد نے روایت کیا ہے۔ دارقطنی نے اسے صحیح قرار دیا ہے اور اس کی اصل مسلم میں ہے۔",
        "english": "Narrated Anas ibn Mālik (may Allah be pleased with him) who said: \"The Companions of the Messenger of Allah (ﷺ), during his era, used to wait for the Ishā prayer until their heads would droop (from sleepiness). Then they would pray without performing Wudu (ablution).\" Narrated by Abu Dawud, authenticated as Sahih by Ad-Dāraquṭnī, and its origin is in Muslim."
      }
    },

    {
      "id": 63,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى اَلنَّبِيِّ  - صلى الله عليه وسلم  -فَقَالَتْ: يَا رَسُولَ اَللَّهِ! إِنِّي اِمْرَأَةٌ أُسْتَحَاضُ فَلَا أَطْهُرُ, أَفَأَدَعُ اَلصَّلَاةَ? قَالَ: 'لَا.  إِنَّمَا ذَلِكَ عِرْقٌ, وَلَيْسَ بِحَيْضٍ, فَإِذَا أَقْبَلَتْ حَيْضَتُكِ فَدَعِي اَلصَّلَاةَ, وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ اَلدَّمَ, ثُمَّ صَلِّي } مُتَّفَقٌ عَلَيْه ِ وَلِلْبُخَارِيِّ: { ثُمَّ تَوَضَّئِي لِكُلِّ صَلَاةٍ } وَأَشَارَ مُسْلِمٌ إِلَى أَنَّهُ حَذَفَهَا عَمْدً ا",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ فاطمہ بنت ابی حبیش رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اس نے عرض کیا یا رسول اللہ! میں ایسی عورت ہوں جو ہمیشہ استخاضہ کے خون میں مبتلا رہتی ہوں، پاک ہوتی ہی نہیں۔ کیا ایسی حالت میں نماز چھوڑ دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں، یہ تو ایک رگ ہے (جو پھٹ جاتی ہے اور خون بہتا رہتا ہے) حیض کا خون نہیں ہے۔ ہاں جب ایام حیض شروع ہوں تو نماز کو چھوڑ دو اور جب یہ ایام پورے ہو جائیں تو خون دھو کر نماز پڑھو۔“ (بخاری و مسلم) اور بخاری میں مزید یہ الفاظ ہیں ”پھر ہر نماز کے لئے وضو کرو“۔ مسلم نے اشارہ کیا ہے کہ اسے انہوں نے عمداً چھوڑا ہے۔ ",
        "english": "Narrated ʿĀ’ishah (may Allah be pleased with her): Fāṭimah bint Abī Ḥubaysh came to the Prophet (ﷺ) and said: \"O Messenger of Allah, I am a woman who suffers from **Istihāḍah (non-menstrual bleeding)**, and I do not become pure. Should I abandon prayer?\" He said: \"No. That is only a vein, and it is not menstruation. When your **menstrual period approaches**, abandon the prayer, and when it **finishes**, wash away the blood from yourself, then pray.\" [Agreed upon by Al-Bukhari and Muslim]. In Al-Bukhari's wording: \"**Then perform Wudu for every prayer.**\" Muslim indicated that he omitted this deliberately."
      }
    },

    {
      "id": 64,
      "name": {
        "arabic": " وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ  - رضى الله عنه  - قَالَ: { كُنْتُ رَجُلاً مَذَّاءً, فَأَمَرْتُ اَلْمِقْدَادَ بْنَ اَلْأَسْوَدِ أَنْ يَسْأَلَ اَلنَّبِيَّ  - صلى الله عليه وسلم  -فَسَأَلَهُ ? فَقَالَ: \"فِيهِ اَلْوُضُوءُ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيّ",
        "urdu": "سیدنا علی رضی اللہ عنہ فرماتے ہیں کہ میں کثرت سے مذی کے خارج ہونے کا مریض تھا۔ میں نے مقداد رضی اللہ عنہ سے کہا کہ وہ نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق دریافت کریں۔ مقداد رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں دریافت کیا (کہ اس کی وجہ سے وضو کرنا ہو گا یا غسل جنابت؟) آپ صلی اللہ علیہ وسلم نے فرمایا ”ایسی حالت میں وضو ہی ہے۔“ (بخاری و مسلم) البتہ یہ الفاظ بخاری کے ہیں۔ ",
        "english": "Narrated ʿAlī ibn Abī Ṭālib (may Allah be pleased with him) who said: \"I was a man who suffered from excessive discharge of **Madhī (pre-seminal fluid)**. So, I commanded Al-Miqdād ibn Al-Aswad to ask the Prophet (ﷺ). He asked him, and the Prophet (ﷺ) replied: **'It requires Wudu (ablution).'**\" [Agreed upon by Al-Bukhari and Muslim, this wording is from Al-Bukhari]"
      }
    },

    {
      "id": 65,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ, رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -قَبَّلَ بَعْضَ نِسَائِهِ, ثُمَّ خَرَجَ إِلَى اَلصَّلَاةِ وَلَمْ يَتَوَضَّأْ } أَخْرَجَهُ أَحْمَدُ, وَضَعَّفَهُ اَلْبُخَارِيّ ُ  ",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے اپنی کسی اہلیہ کا بوسہ لیا اور نماز کے لئے نکل گئے اور وضو نہیں فرمایا۔ اسے احمد نے روایت کیا ہے اور بخاری نے اسے ضعیف قرار دیا ہے۔ ",
        "english": "Narrated ʿĀ’ishah (may Allah be pleased with her): \"The Prophet (ﷺ) **kissed** one of his **wives**, then went out for **prayer** and **did not perform Wudu**.\" Narrated by Ahmad, though Al-Bukhari deemed it weak."
      }
    },

    {
      "id": 66,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا وَجَدَ أَحَدُكُمْ فِي بَطْنِهِ شَيْئًا, فَأَشْكَلَ عَلَيْهِ: أَخَرَجَ مِنْهُ شَيْءٌ, أَمْ لَا? فَلَا يَخْرُجَنَّ مِنْ اَلْمَسْجِدِ حَتَّى يَسْمَعَ صَوْتًا, أَوْ يَجِدَ رِيحًا } أَخْرَجَهُ مُسْلِم ٌ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تم میں سے کوئی اپنے پیٹ میں ہوا کی حرکت محسوس کرے اور فیصلہ کرنا مشکل ہو جائے کہ آیا پیٹ سے کوئی چیز خارج ہوئی ہے یا نہیں تو ایسی صورت میں (وضو کرنے کیلئے) وہ مسجد سے باہر نہ جائے، تاوقتیکہ (یقین نہ ہو جائے) ہوا کے خارج ہونے کی آواز یا بدبو سے محسوس کرے۔“ (مسلم)",
        "english": "Narrated Abū Hurayrah (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"If any of you feels something in his **stomach** and is **doubtful** whether anything has come out of him or not, he must **not leave the mosque** until he hears a **sound** or perceives an **odor**.\" Narrated by Muslim."
      }
    },

    {
      "id": 67,
      "name": {
        "arabic": " وَعَنْ طَلْقِ بْنِ عَلِيٍّ  - رضى الله عنه  - قَالَ: { قَالَ رَجُلٌ: مَسَسْتُ ذَكَرِي أَوْ قَالَ اَلرَّجُلُ يَمَسُّ ذَكَرَهُ فِي اَلصَّلَاةِ, أَعَلَيْهِ وُضُوءٍ ? فَقَالَ اَلنَّبِيُّ  - صلى الله عليه وسلم  -\"لَا, إِنَّمَا هُوَ بَضْعَةٌ مِنْكَ } أَخْرَجَهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ حِبَّانوَقَالَ اِبْنُ اَلْمَدِينِيِّ: هُوَ أَحْسَنُ مِنْ حَدِيثِ بُسْرَةَ. ",
        "urdu": "سیدنا طلق بن علی رضی اللہ عنہ نے بیان کیا کہ ایک شخص نے کہا میں نے اپنی شرمگاہ کو ہاتھ لگایا ہے یا یوں کہا کہ ایک آدمی نماز میں اپنی شرمگاہ کو ہاتھ لگاتا ہے تو کیا اسے نئے سرے سے وضو کرنا چاہیئے؟ تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”نہیں، وہ تو تیرے اپنے جسم کا ایک ٹکڑا ہے۔ اسے پانچوں نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔“ ابن مدینی کہتے ہیں بسرہ کی حدیث سے یہ حدیث بہت بہتر ہے۔  ",
        "english": "Narrated Ṭalq ibn ʿAlī (may Allah be pleased with him) who said: A man asked: \"I touched my private part,\" or he said, \"A man touches his private part during prayer. Does he have to perform Wudu?\" The Prophet (ﷺ) said: **\"No, it is only a piece of flesh from you.\"** Narrated by the five Imāms (Ahmad, Abu Dawud, Tirmidhi, Nasā’ī, Ibn Mājah), and authenticated as Sahih by Ibn Ḥibbān. Ibn al-Madīnī said: \"It is better than the Hadith of Busrah.\""
      }
    },

    {
      "id": 68,
      "name": {
        "arabic": " وَعَنْ بُسْرَةَ بِنْتِ صَفْوَانَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -قَالَ: \"مَنْ مَسَّ ذَكَرَهُ فَلْيَتَوَضَّأْ\" } أَخْرَجَهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّان َ وَقَالَ اَلْبُخَارِيُّ: هُوَ أَصَحُّ شَيْءٍ فِي هَذَا اَلْبَابِ",
        "urdu": " سیدہ بسرہ بنت صفوان رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس نے اپنی شرمگاہ کو ہاتھ لگایا اسے وضو کرنا چاہیئے۔“ اسے پانچوں نے روایت کیا ہے۔ ترمذی اور ابن حبان نے صحیح قرار دیا ہے۔ امام بخاری کی رائے یہ ہے کہ اس باب میں یہ صحیح ترین حدیث ہے۔",
        "english": "Narrated Busrah bint Ṣafwān (may Allah be pleased with her): The Messenger of Allah (ﷺ) said: **\"Whoever touches his private part must perform Wudu (ablution).\"** Narrated by the five Imāms (Ahmad, Abu Dawud, Tirmidhi, Nasā’ī, Ibn Mājah), and authenticated as Sahih by At-Tirmidhī and Ibn Ḥibbān. Al-Bukhari said: **\"It is the soundest thing in this chapter.\"**"
      }
    },

    {
      "id": 69,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ صَلَّى عَلَيْهِ وَسَلَّمَ قَالَ: { مَنْ أَصَابَهُ قَيْءٌ أَوْ رُعَافٌ, أَوْ قَلَسٌ, أَوْ مَذْيٌ فَلْيَنْصَرِفْ فَلْيَتَوَضَّأْ, ثُمَّ لِيَبْنِ عَلَى صَلَاتِهِ, وَهُوَ فِي ذَلِكَ لَا يَتَكَلَّمُ } أَخْرَجَهُ اِبْنُ مَاجَ ه وَضَعَّفَهُ أَحْمَدُ وَغَيْرُهُ. ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کو نماز میں قے آ جائے یا نکسیر پھوٹ پڑے یا پیٹ کے اندر کی چیز منہ کے راستہ سے باہر آ جائے یا مذی کا خروج ہو جائے تو اسے نماز سے نکل کر وضو کرنا چاہیئے اور جہاں سے نماز چھوڑی تھی اسی پر بنا کر لے۔ بشرطیکہ اس دوران میں اس نے گفتگو نہ کی ہو۔“ ابن ماجہ نے اسے روایت کیا ہے اور احمد نے اسے ضعیف قرار دیا ہے۔ ",
        "english": "Narrated ʿĀ’ishah (may Allah be pleased with her): The Messenger of Allah (ﷺ) said: \"Whoever is afflicted with **vomiting (Qay)**, or a **nosebleed (Ruʿāf)**, or **regurgitation (Qalas)**, or **Madhī (pre-seminal fluid)**, should leave the prayer and perform Wudu, then he may continue his prayer from where he left off, provided he **does not speak** during that time.\" Narrated by Ibn Mājah, and deemed weak by Ahmad and others."
      }
    },

    {
      "id": 70,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَجُلاً سَأَلَ اَلنَّبِيَّ  - صلى الله عليه وسلم  -أَتَوَضَّأُ مِنْ لُحُومِ اَلْغَنَمِ? قَالَ: إِنْ شِئْتَ قَالَ: أَتَوَضَّأُ مِنْ لُحُومِ اَلْإِبِلِ ? قَالَ: نَعَمْ } أَخْرَجَهُ مُسْلِم ٌ ",
        "urdu": " سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے دریافت کیا، کیا میں بکری کا گوشت کھاؤں تو بعد میں وضو کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”اگر دل چاہے تو کر لو۔“ اس شخص نے پھر عرض کیا اور اونٹ کے گوشت سے؟ فرمایا ”اونٹ کا گوشت کھانے کے بعد وضو کرنا چاہیئے۔“ (مسلم)",
        "english": "Narrated Jābir ibn Samurah (may Allah be pleased with them both): A man asked the Prophet (ﷺ): \"Should I perform Wudu after eating **sheep meat**?\" He said: \"If you wish.\" He asked: \"Should I perform Wudu after eating **camel meat**?\" He said: **\"Yes.\"** Narrated by Muslim."
      }
    },

    {
      "id": 71,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ مَنْ غَسَّلَ مَيْتًا فَلْيَغْتَسِلْ, وَمَنْ حَمَلَهُ فَلْيَتَوَضَّأْ } أَخْرَجَهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَاَلتِّرْمِذِيُّ وَحَسَّنَه وَقَالَ أَحْمَدُ: لَا يَصِحُّ فِي هَذَا اَلْبَابِ شَيْءٌ ُ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس نے میت کو غسل دیا وہ خود بھی غسل کرے اور جس نے میت کو اٹھایا وہ وضو کرے۔“ اس حدیث کو احمد، نسائی اور ترمذی نے روایت کیا ہے۔ ترمذی نے اسے حسن کہا ہے اور احمد کا قول ہے کہ اس باب میں کوئی بھی حدیث صحیح ثابت نہیں ہے۔ ",
        "english": "It was narrated from Abu Hurairah (May Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: “Whoever washes a dead person, let him perform Ghusl (a full bath), and whoever carries him, let him perform Wudu’ (ablution).” It was narrated by Ahmad, An-Nasa’i, and At-Tirmidhi, and At-Tirmidhi rated it as Hasan (good). Ahmad said: Nothing is sound in this regard."
      }
    },

    {
      "id": 72,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ أَبِي بَكْرٍ رَحِمَهُ اَللَّهُ; { أَنَّ فِي اَلْكِتَابِ اَلَّذِي كَتَبَهُ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -لِعَمْرِو بْنِ حَزْمٍ: أَنْ لَا يَمَسَّ اَلْقُرْآنَ إِلَّا طَاهِرٌ } رَوَاهُ مَالِكٌ مُرْسَلاً, وَوَصَلَهُ النَّسَائِيُّ, وَابْنُ حِبَّانَ, وَهُوَ مَعْلُولٌ.  ",
        "urdu": "عبداللہ بن ابی بکر رحمہ اللہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے عمرو بن حزم رضی اللہ عنہ کے لیے جو خط (کتاب) لکھا تھا، اس میں تھا: 'قرآن کو صرف پاک شخص ہی ہاتھ لگائے۔' اسے مالک نے مرسلاً روایت کیا ہے، اور نسائی اور ابن حبان نے اسے موصولاً روایت کیا ہے، لیکن یہ معلول (ضعف والی) ہے۔",
        "english": "It was narrated from Abdullah ibn Abi Bakr (May Allah have mercy on him) that in the letter written by the Messenger of Allah (peace be upon him) to ‘Amr ibn Hazm, it was stated: “None should touch the Qur’an except one who is in a state of purity (Tahir).” Narrated by Malik as Mursal, and connected (Mawsul) by An-Nasa’i and Ibn Hibban, but it is considered defective (Ma‘lul)."
      }
    },

    {
      "id": 73,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -يُذْكُرُ اَللَّهَ عَلَى كُلِّ أَحْيَانِهِ } رَوَاهُ مُسْلِمٌ, وَعَلَّقَهُ اَلْبُخَارِيّ ُ 1  . ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ ”رسول اللہ صلی اللہ علیہ وسلم ہر حالت میں اللہ تعالیٰ کا ذکر کرتے تھے۔“ اسے مسلم نے روایت کیا اور بخاری نے اس کو تعلیقاً نقل کیا ہے۔  ",
        "english": "It was narrated from 'Aishah (May Allah be pleased with her) who said: “The Messenger of Allah (peace be upon him) used to remember Allah at all times.” Reported by Muslim, and Al-Bukhari reported it subordinately (Ta'liqan)."
      }
    },

    {
      "id": 74,
      "name": {
        "arabic": " وَعَنْ أَنَسِ]بْنِ مَالِكٍ]  - رضى الله عنه  - { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -اِحْتَجَمَ وَصَلَّى, وَلَمْ يَتَوَضَّأْ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ, وَلَيَّنَه ُ ",
        "urdu": " سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے پچھنے لگوائے اور نیا وضو کئے بغیر نماز ادا کی۔“ اسے دارقطنی نے روایت کیا ہے اور اسے کمزور کہا ہے۔",
        "english": "It was narrated from Anas ibn Malik (May Allah be pleased with him) that **the Prophet (peace be upon him) performed cupping (Hijama) and then prayed without performing Wudu' (ablution)**. Reported by Ad-Daraqutni, who ruled it weak (Layyanahu)."
      }
    },

    {
      "id": 75,
      "name": {
        "arabic": "وَعَنْ مُعَاوِيَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ الْعَيْنُ وِكَاءُ السَّهِ, فَإِذَا نَامَتْ اَلْعَيْنَانِ اِسْتَطْلَقَ اَلْوِكَاءُ } رَوَاهُ أَحْمَدُ, وَالطَّبَرَانِيُّ وَزَادَ { وَمَنْ نَامَ فَلْيَتَوَضَّأْ } وَهَذِهِ اَلزِّيَادَةُ فِي هَذَا اَلْحَدِيثِ عِنْدَ أَبِي دَاوُدَ مِنْ حَدِيثِ عَلِيٍّ دُونَ قَوْلِهِ: { اِسْتَطْلَقَ اَلْوِكَاءُ } وَفِي كِلَا الْإِسْنَادَيْنِ ضَعْف ٌ  وَلِأَبِي دَاوُدَ أَيْضًا, عَنْ اِبْنِ عَبَّاسٍ مَرْفُوعًا: { إِنَّمَا اَلْوُضُوءُ عَلَى مَنْ نَامَ مُضْطَجِعًا } وَفِي إِسْنَادِهِ ضَعْفٌ أَيْضً",
        "urdu": "سیدنا معاویہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے **”آنکھوں کا کھلا رہنا ریح خارج ہونے کا بندھن ہے۔ جب آنکھ سونے کی وجہ سے بند ہو جاتی ہے تو بندھن ڈھیلا ہو جاتا ہے۔ (کھل جاتا ہے)** (مسند احمد، طبرانی) طبرانی نے اتنا اضافہ بھی اپنی روایت میں بیان کیا ہے کہ **”جس شخص کو نیند آ جائے وہ ازسرنو وضو کرے۔“** اتنا اضافہ ابوداؤد کی اس روایت میں بھی ہے جسے انہوں نے سیدنا علی رضی اللہ عنہ کے واسطے سے روایت کیا ہے۔ البتہ اس روایت میں «استطلق الوكاء» ”یعنی بندھن کھل جاتا ہے“ والی عبارت نہیں ہے۔ باعتبار سند، دونوں احادیث ضعیف ہیں اور ابوداؤد میں ابن عباس رضی اللہ عنہما کے واسطے سے یہ مرفوع روایت بھی مروی ہے: **”وضو تو اس شخص پر ہے جو لیٹ کر سو جائے۔“** سند کے اعتبار سے یہ حدیث بھی ضعیف ہے۔ ",
        "english": "It was narrated from Mu’awiyah (May Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: **“The eyes are the string (or fastener) of the anus (passage of wind). When the eyes sleep, the string is loosened (or released).”** Narrated by Ahmad and At-Tabarani, who added: **“Whoever sleeps, let him perform Wudu’.”** This addition is also found in the narration of Abu Dawud from 'Ali, without the phrase: **“the string is loosened.”** There is **weakness** in both chains. Abu Dawud also narrated from Ibn Abbas in a Marfu' form: **“Wudu’ is only required for one who sleeps lying down,”** and its chain is also weak."
      }
    },

    {
      "id": 76,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -قَالَ: { يَأْتِي أَحَدَكُمُ الشَّيْطَانُ فِي صَلَاتِهِ, فَيَنْفُخُ فِي مَقْعَدَتِهِ فَيُخَيَّلُ إِلَيْهِ أَنَّهُ أَحْدَثَ, وَلَمْ يُحْدِثْ, فَإِذَا وَجَدَ ذَلِكَ فَلَا يَنْصَرِفُ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا } أَخْرَجَهُ اَلْبَزَّار ُ وَأَصْلُهُ فِي اَلصَّحِيحَيْنِ مِنْ حَدِيثِ عَبْدِ اَللَّهِ بْنِ زَيْد ٍ وَلِمُسْلِمٍ: عَنْ أَبِي هُرَيْرَةَ نَحْوُهُ وَلِلْحَاكِمِ.  عَنْ أَبِي سَعِيدٍ مَرْفُوعًا: { إِذَا جَاءَ أَحَدَكُمُ الشَّيْطَانُ, فَقَالَ: إِنَّكَ أَحْدَثْتَ, فَلْيَقُلْ: كَذَبْتَ } وَأَخْرَجَهُ اِبْنُ حِبَّانَ بِلَفْظِ: { فَلْيَقُلْ فِي نَفْسِهِ } ",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا **”نماز میں تم میں سے کسی کے پاس شیطان آتا ہے اور اس کی مقعد میں پھونک مارتا ہے اور اس کے ذہن میں یہ خیال ڈالا جاتا ہے کہ وہ بےوضو ہو گیا ہے حالانکہ وہ بےوضو نہیں ہوا ہوتا لہٰذا تم میں سے جب کوئی ایسا محسوس کرے تو ریح کے خارج ہونے کی آواز سننے یا اس کی بدبو پانے تک نماز سے نہ پھرے۔“** اسے بزار نے روایت کیا ہے اور اس حدیث کی اصل بخاری میں عبداللہ بن زید رضی اللہ عنہ اور مسلم میں ابوہریرہ رضی اللہ عنہ سے موجود ہے۔ مسلم میں سیدنا ابوہریرہ رضی اللہ عنہ سے ان جیسے ہی الفاظ مروی ہیں۔ اور حاکم نے ابوسعید رضی اللہ عنہ کے واسطے سے مرفوعاً بیان کیا ہے کہ **”جب تم میں سے کسی کے پاس شیطان آئے اور ذہن میں وسواس ڈالے کہ تو بےوضو ہو گیا تو یہ شخص اسے جواب میں کہے کہ تو جھوٹ بولتا ہے۔“** اس کو ابن حبان نے ان الفاظ سے روایت کیا ہے کہ **”وہ شخص اپنے دل میں کہے کہ تو جھوٹا ہے۔“**",
        "english": "It was narrated from Ibn Abbas (May Allah be pleased with them both) that the Messenger of Allah (peace be upon him) said: **“Shaytan (Satan) comes to one of you in his prayer and blows into his rear, making him imagine that he has invalidated his Wudu’, when he has not. If one of you finds this, he should not stop praying unless he hears a sound or finds a smell.”** Reported by Al-Bazzar, and the origin of this Hadith is in the Two Sahihs (Bukhari and Muslim) from the Hadith of Abdullah ibn Zaid. Muslim narrated similar wording from Abu Hurairah. Al-Hakim narrated a Marfu' Hadith from Abu Sa'id: **“If Shaytan comes to one of you and says: 'You have invalidated your Wudu',' then let him say: 'You lie.'”** Ibn Hibban narrated the wording: **“Then let him say in his heart: 'You lie.'”**"
      }
    }
  ]
}