{
  "chapId": 38,
  "bookId": 6,
  "summary": {
    "urdu": [
      "حج کی تین اقسام (تمتع، قران اور افراد) جائز ہیں، جیسا کہ صحابہ کرام نے حجۃ الوداع کے موقع پر اپنی نیت کے مطابق تلبیہ پکارا۔",
      "صرف عمرہ کی نیت کرنے والے ارکانِ عمرہ کی ادائیگی کے بعد احرام کھول کر حلال ہو سکتے ہیں۔",
      "حجِ افراد یا حجِ قران (حج اور عمرہ ایک ساتھ) کرنے والے قربانی کے دن (10 ذوالحجہ) تک احرام کی پابندیوں میں رہتے ہیں۔"
    ],
    "english": [
      "The three types of Hajj (Tamattu', Qiran, and Ifrad) are permissible, as the Companions made their intentions and shouted 'Labbayk' accordingly during the Farewell Pilgrimage.",
      "Those who intend only for 'Umrah can relieve themselves of the Ihram restrictions after completing the 'Umrah rites.",
      "Pilgrims performing Hajj al-Ifrad or Hajj al-Qiran must remain in the state of Ihram until the Day of Sacrifice (10th of Dhul-Hijjah)."
    ]
  },
  "description": {
    "urdu": "یہ باب حج کی مختلف اقسام (افراد، قران اور تمتع) کی نیت اور ان کی ادائیگی کے بعد احرام سے حلال ہونے کے اوقات کی وضاحت کرتا ہے۔",
    "english": "This chapter explains the different types of Hajj intentions and the specific timings for relieving oneself from the state of Ihram."
  },
  "hadithRange": {
    "from": 592,
    "to": 592
  },
  "hadiths": [
    {
      "id": 592,
      "name": {
        "arabic": "عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { خَرَجْنَا مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-عَامَ حَجَّةِ اَلْوَدَاعِ, فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ, وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ, وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ, وَأَهَلَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِالْحَجِّ, فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ, وَأَمَّا مَنْ أَهَلَّ بِحَجٍّ, أَوْ جَمَعَ اَلْحَجَّ وَالْعْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى كَانَ يَوْمَ اَلنَّحْرِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع کے سال نکلے۔ ہم میں سے بعض وہ تھے جنہوں نے عمرہ کے لیے تلبیہ کہا اور ہم میں سے کچھ وہ تھے جنہوں نے حج اور عمرہ کے لیے تلبیہ کہا اور ہم میں سے بعض وہ تھے جنہوں حج کے لیے لبیک پکارا اور رسول اللہ صلی اللہ علیہ وسلم نے صرف حج کے لیے تلبیہ پکارا۔ پھر جنہوں عمرہ کے لیے لبیک کہا تھا وہ حلال ہو گئے اور جنہوں نے حج کے لیے لبیک کہا تھا یا حج اور عمرہ کو جمع کیا تھا وہ حلال نہ ہوئے یہاں تک کہ قربانی کا دن آیا۔",
        "english": "Narrated 'Aishah (RA): We set out with the Prophet (ﷺ) in the year of the Farewell Pilgrimage. Some of us shouted 'Labbayk' for 'Umrah, some for both Hajj and 'Umrah, and some for Hajj alone. The Messenger of Allah (ﷺ) shouted 'Labbayk' for Hajj. As for those who shouted 'Labbayk' for 'Umrah, they relieved themselves of the Ihram (after performing it); but those who shouted 'Labbayk' for Hajj or combined Hajj and 'Umrah did not relieve themselves of the Ihram until the Day of Sacrifice (10th Dhul-Hijjah). [Agreed upon]."
      }
    }
  ]
}
