{
  "chapId": 62,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 818,
    "to": 822
  },
  "hadiths": [
    {
      "id": 818,
      "name": {
        "arabic": "عَنْ اِبْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- ; أَنَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَا حَقُّ اِمْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُرِيدُ أَنْ يُوصِيَ فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی مسلمان کے لیے یہ درست نہیں کہ اس کے پاس کوئی ایسی چیز ہو جس کی وہ وصیت کرنا چاہتا ہو، اور وہ دو راتیں بھی اس طرح گزار دے کہ اس کی وصیت اس کے پاس لکھی ہوئی نہ ہو۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'It is not right for a Muslim who has something to will, to pass two nights without having his will written and kept with him.'"
      }
    },

    {
      "id": 819,
      "name": {
        "arabic": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ : قُلْتُ : { يَا رَسُولَ اَللَّهِ ! أَنَا ذُو مَالٍ , وَلَا يَرِثُنِي إِلَّا اِبْنَةٌ لِي وَاحِدَةٌ , أَفَأَتَصَدَّقُ بِثُلُثَيْ مَالِي? قَالَ : \" لَا \" قُلْتُ : أَفَأَتَصَدَّقُ بِشَطْرِهِ ? قَالَ : \" لَا \" قُلْتُ : أَفَأَتَصَدَّقُ بِثُلُثِهِ ? قَالَ : \" اَلثُّلُثُ , وَالثُّلُثُ كَثِيرٌ , إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ اَلنَّاسَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ میں نے عرض کیا یا رسول اللہ! میں مالدار آدمی ہوں اور میری وارث صرف میری ایک ہی بیٹی ہے۔ تو کیا میں دو تہائی مال کو صدقہ و خیرات کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں“ میں نے دوبارہ، عرض کیا، کیا میں اپنے مال کا نصف حصہ خیرات کر دوں؟ فرمایا ”نہیں“ میں نے تیسری مرتبہ عرض کیا، تو کیا میں تہائی مال صدقہ و خیرات کر سکتا ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں! مگر ایک تہائی بھی بہت ہے۔ تیرا اپنے ورثاء کو غنی چھوڑ جانا اس سے کہیں بہتر ہے کہ تو ان کو محتاج چھوڑے اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں۔“ (بخاری و مسلم)",
        "english": "Narrated Sa'd bin Abi Waqqas (RA): I said, 'O Messenger of Allah, I have wealth and none inherits from me except my only daughter. Shall I give two-thirds of my property as Sadaqah (charity)?' He replied, 'No.' I said, 'Shall I give half of it as Sadaqah?' He replied, 'No.' I said, 'Shall I give one-third of it as Sadaqah?' He replied, 'Give one-third, and even one-third is much. It is better for you to leave your heirs wealthy than to leave them poor, begging from people.'"
      }
    },

    {
      "id": 820,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- { أَنَّ رَجُلاً أَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: يَا رَسُولَ اَللَّهِ ! إِنَّ أُمِّي اُفْتُلِتَتْ نَفْسُهَا وَلَمْ تُوصِ , وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ , أَفَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا ? قَالَ : \" نَعَمْ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا: ”یا رسول اللہ! میری والدہ اچانک وفات پا گئی ہیں اور انہوں نے کوئی وصیت نہیں کی۔ میرا ان کے بارے میں خیال ہے کہ اگر وہ گفتگو کرتیں تو صدقہ ضرور کرتیں۔ کیا انہیں ثواب ملے گا اگر میں ان کی جانب سے صدقہ کر دوں؟“ آپ صلی اللہ علیہ وسلم نے فرمایا: ”ہاں۔“ (بخاری و مسلم) یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated 'Aishah (RA): A man came to the Prophet (ﷺ) and said, 'O Messenger of Allah! My mother died suddenly without making a will. I think that if she could have spoken, she would have given Sadaqah (charity). Will she receive a reward if I give Sadaqah on her behalf?' He (ﷺ) replied, 'Yes.'"
      }
    },

    {
      "id": 821,
      "name": {
        "arabic": "وَعَنْ أَبِي أُمَامَةَ اَلْبَاهِلِيِّ ‏- رضى الله عنه ‏- سَمِعْتُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ : { إِنَّ اَللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ , فَلَا وَصِيَّةَ لِوارِثٍ } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ إِلَّا النَّسَائِيَّ , وَحَسَّنَهُ أَحْمَدُ وَاَلتِّرْمِذِيُّ , وَقَوَّاهُ اِبْنُ خُزَيْمَةَ , وَابْنُ اَلْجَارُودِ وَرَوَاهُ اَلدَّارَقُطْنِيُّ مِنْ حَدِيثِ اِبْنِ عباس ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- , وَزَادَ فِي آخِرِهِ : { إِلَّا أَنْ يَشَاءَ اَلْوَرَثَةُ } وَإِسْنَادُهُ حَسَنٌ ",
        "urdu": "سیدنا ابوامامہ باہلی رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ارشاد فرماتے سنا ہے کہ ”اللہ تعالیٰ نے ہر حقدار کو اس کا حق عطا فرما دیا ہے لہذا اب کسی وارث کے لیے کوئی وصیت نہیں۔“ اسے احمد اور چاروں نے سوائے نسائی کے روایت کیا ہے۔ احمد اور ترمذی نے اسے حسن قرار دیا ہے اور ابن خزیمہ اور ابن جارود نے اسے قوی قرار دیا ہے اور دارقطنی نے ابن عباس رضی اللہ عنہما سے روایت کی ہے اور اس کے آخر میں اتنا اضافہ بھی کیا ہے: ”سوائے اس کے کہ وارث (خود) چاہیں۔“",
        "english": "Narrated Abu Umamah al-Bahili (RA): I heard the Messenger of Allah (ﷺ) saying: 'Allah has appointed for everyone who has a right what is due to him, so no will (wasayah) should be made for an heir.' Reported by Ahmad and the four except An-Nasa'i. Ahmad and At-Tirmidhi graded it Hasan. Ibn Khuzaymah and Ibn al-Jarud strengthened it. Ad-Daraqutni reported it from Ibn 'Abbas (RA) with the addition: 'Unless the heirs wish otherwise.'"
      }
    },

    {
      "id": 822,
      "name": {
        "arabic": "وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ : \" قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ تَصَدَّقَ عَلَيْكُمْ بِثُلُثِ أَمْوَالِكُمْ عِنْدَ وَفَاتِكُمْ ; زِيَادَةً فِي حَسَنَاتِكُمْ } رَوَاهُ اَلدَّارَقُطْنِيُّ وَأَخْرَجَهُ أَحْمَدُ , وَالْبَزَّارُ مِنْ حَدِيثِ أَبِي اَلدَّرْدَاءِ وَابْنُ مَاجَهْ : مِنْ حَدِيثِ أَبِي هُرَيْرَةَ وَكُلُّهَا ضَعِيفَةٌ , لَكِنْ قَدْ يَقْوَى بَعْضُهَا بِبَعْضٍ .‏ وَاَللَّهُ أَعْلَمُ ",
        "urdu": "سیدنا معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے تمہاری موت کے وقت تمہارے تہائی مال کو تمہارے لیے صدقہ کرنے کی اجازت دے کر تم پر احسان فرمایا ہے تاکہ تمہاری نیکیوں میں اضافہ ہو جائے۔“",
        "english": "Narrated Mu'adh bin Jabal (RA): The Prophet (ﷺ) said: 'Allah has been charitable to you by allowing you to give one-third of your wealth (as a bequest) at the time of your death, as an increase in your good deeds.'"
      }
    }
  ]
}