{
  "chapId": 83,
  "bookId": 9,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1027,
    "to": 1033
  },
  "hadiths": [
    {
      "id": 1027,
      "name": {
        "arabic": "عَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ } رَوَاهُ أَبُو دَاوُدَ، وَالنَّسَائِيُّ، وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ",
        "urdu": "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اپنے مال کی حفاظت کرتا ہوا مارا جائے تو وہ شہید ہے۔“ اسے ابوداؤد، نسائی اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے صحیح کہا ہے۔",
        "english": "Narrated ‘Abdullah bin ‘Amr bin al-’As (RA): Allah's Messenger (ﷺ) said: \"He who is killed while protecting his property is a martyr.\""
      }
    },

    {
      "id": 1028,
      "name": {
        "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَاتَلَ يُعْلَى بْنُ أُمِّيَّةَ رَجُلًا, فَعَضَّ أَحَدُهُمَا صَاحِبَهُ, فَنَزَعَ ثَنِيَّتَهُ, فَاخْتَصَمَا إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \"أَيَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ اَلْفَحْلُ? لَا دِيَةَ لَهُ\" } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ.‏",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ یعلیٰ بن امیہ رضی اللہ عنہ کی ایک شخص سے لڑائی ہو گئی۔ ایک نے دوسرے کو دانتوں سے کاٹا تو اس نے اپنا ہاتھ اس کے منہ سے کھینچ کر باہر نکالا تو اس کا سامنے کا دانت ٹوٹ کر گر گیا۔ دونوں اپنا جھگڑا نبی کریم صلی اللہ علیہ وسلم کی عدالت میں لے گئے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”کیا تم ایک دوسرے کو اس طرح کاٹ کھاتے ہو جس طرح نر اونٹ کاٹتا ہے؟ اس کے لیے کوئی دیت نہیں۔“ (بخاری و مسلم)",
        "english": "Narrated ‘Imran bin Husain (RA): Ya'la bin Umayya fought with a man, and one of them bit the other. The one who was bitten pulled his hand out of the other's mouth and in doing so, his front tooth fell out. They took the dispute to the Prophet (ﷺ) who said: \"Does one of you bite his brother as a male camel bites? There is no blood-money (Diyat) for it (the broken tooth).\" [Agreed upon; the wording is Muslim's]."
      }
    },

    {
      "id": 1029,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ أَبُو اَلْقَاسِمِ ‏- صلى الله عليه وسلم ‏-{ لَوْ أَنَّ اِمْرَأً اِطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ, فَحَذَفْتَهُ بِحَصَاةٍ, فَفَقَأْتَ عَيْنَهُ, لَمْ يَكُنْ عَلَيْكَ جُنَاحٌ } مُتَّفَقٌ عَلَيْهِ. وَفِي لَفْظٍ لِأَحْمَدَ, وَالنَّسَائِيِّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ: { فَلَا دِيَةَ لَهُ وَلَا قِصَاصَ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ” اگر کوئی مرد تیرے گھر بغیر اجازت کے جھانکے (نظر ڈالے) اور تو کنکری مار کر اس کی آنکھ پھوڑ دے تو تم پر کوئی گناہ نہیں۔“ (بخاری و مسلم) احمد اور نسائی کے الفاظ ہیں جسے ابن حبان نے صحیح کہا ہے کہ ” نہ اس کی دیت ہے اور نہ قصاص۔“",
        "english": "Narrated Abu Hurairah (RA): Abu al-Qasim (the Prophet ﷺ) said: \"If someone were to look into your house without your permission and you threw a pebble at him and put out his eye, there would be no blame on you.\" (Agreed upon). According to a version by Ahmad and An-Nasa'i, which Ibn Hibban graded as Sahih: \"There is neither blood money (Diyyah) nor retaliation (Qisas) for him.\""
      }
    },

    {
      "id": 1030,
      "name": {
        "arabic": "وَعَنْ اَلْبَرَاءِ بْنِ عَازِبٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَضَى رَسُولُ اَللَّهِ صلى الله عليه وسلم أَنَّ حِفْظَ اَلْحَوَائِطِ بِالنَّهَارِ عَلَى أَهْلِهَا, وَأَنْ حِفْظَ اَلْمَاشِيَةِ بِاللَّيْلِ عَلَى أَهْلِهَا, وَأَنَّ عَلَى أَهْلِ اَلْمَاشِيَةِ مَا أَصَابَتْ مَاشِيَتُهُمْ بِاللَّيْلِ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ إِلَّا اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ وَفِي إِسْنَادِهِ اِخْتِلَافٌ.‏",
        "urdu": "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ ” دن کے اوقات میں باغوں کی حفاظت و نگرانی مالکانِ باغ کریں اور رات کے اوقات میں مویشیوں کی حفاظت مالکانِ مویشی کریں۔ رات کے اوقات میں جس قدر مویشی کسی کا نقصان کریں گے اس کا تاوان مویشیوں کے مالکان پر ہو گا۔“ اس حدیث کو احمد اور چاروں نے روایت کیا ہے سوائے ترمذی کے اور ابن حبان نے اسے صحیح کہا ہے تاہم اس کی سند میں اختلاف ہے۔",
        "english": "Narrated Al-Bara' bin 'Azib (RA): Allah's Messenger (ﷺ) passed a judgment that the owners of gardens are responsible for protecting them during the day, and the owners of livestock are responsible for guarding them during the night. Thus, the owners of the livestock are liable for any damage caused by their animals during the night."
      }
    },

    {
      "id": 1031,
      "name": {
        "arabic": " وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- ‏-فِي رَجُلٍ أَسْلَمَ ثُمَّ تَهَوَّدَ‏-: { لَا أَجْلِسُ حَتَّى يُقْتَلَ, قَضَاءُ اَللَّهِ وَرَسُولِهِ, فَأُمِرَ بِهِ, فَقُتِلَ.‏ مُتَّفَقٌ عَلَيْهِ } .‏ 1‏ .‏ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: { وَكَانَ قَدْ اُسْتُتِيبَ قَبْلَ ذَلِكَ } ",
        "urdu": " سیدنا معاذ بن جبل رضی اللہ عنہ سے ایسے شخص کے متعلق جو پہلے اسلام لایا پھر یہودی ہو گیا تھا مروی ہے کہ میں اس وقت تک نہیں بیٹھوں گا تاوقتیکہ اس کو قتل کر دیا جائے۔ یہ اللہ اور اس کے رسول کا فیصلہ ہے۔ چنانچہ اس کے قتل کا حکم دیا گیا اور اسے قتل کر دیا گیا۔ (بخاری ومسلم) ابوداؤد کی روایت میں ہے کہ اسے قتل سے پہلے توبہ کرنے کے لئے کہا گیا۔",
        "english": "Narrated Mu'adh bin Jabal (RA) regarding a man who had embraced Islam and then reverted to Judaism: \"I will not sit down until he is executed; it is the decree of Allah and His Messenger.\" So the order was given and he was executed. (Agreed upon). In a version by Abu Dawud, it is added: \"He had been asked to repent before that.\""
      }
    },

    {
      "id": 1032,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اپنا دین (اسلام) بدل لے اسے قتل کر دو۔“ (بخاری)",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: \"Whoever changes his religion (drops Islam), kill him.\""
      }
    },

    {
      "id": 1033,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ; { أَنَّ أَعْمَى كَانَتْ لَهُ أُمُّ وَلَدَ تَشْتُمُ اَلنَّبِيَّ - صلى الله عليه وسلم -وَتَقَعُ فِيهِ, فَيَنْهَاهَا, فَلَا تَنْتَهِي, فَلَمَّا كَانَ ذَاتَ لَيْلَةٍ أَخْذَ اَلْمِعْوَلَ, فَجَعَلَهُ فِي بَطْنِهَا, وَاتَّكَأَ عَلَيْهَا فَقَتَلَهَا فَبَلَغَ ذَلِكَ اَلنَّبِيَّ - صلى الله عليه وسلم -فَقَالَ: 'أَلَّا اِشْهَدُوا أَنَّ دَمَهَا هَدَرٌ' } . رَوَاهُ أَبُو دَاوُدَ وَرُوَاتُهُ ثِقَاتٌ. ",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما ہی سے مروی ہے کہ ایک نابینا شخص تھا، اس کی ایک ام ولد لونڈی رسول اللہ صلی اللہ علیہ وسلم کو گالی دیتی اور برا بھلا کہتی تھی۔ وہ نابینا صحابی رضی اللہ عنہ اسے منع کرتے مگر وہ باز نہ آتی۔ ایک رات انہوں نے کدال لے کر اس کے پیٹ پر رکھ کر اس پر اپنا بوجھ ڈال کر دبایا اور اسے قتل کر دیا۔ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا ” تم گواہ رہو اس کا خون رائیگاں اور بیکار گیا۔“ (ابوداؤد) اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Ibn 'Abbas (RA): A blind man had an 'Umm Walad' (slave-mother of his child) who used to insult the Prophet (ﷺ) and disparage him. He forbade her, but she did not stop. One night he took a dagger, placed it on her stomach, and pressed it until he killed her. When the news reached the Prophet (ﷺ), he said: 'Bear witness that her blood is shed in vain (no retaliation or blood money is required).'"
      }
    }
  ]
}
