{
  "chapId": 75,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 945,
    "to": 963
  },
  "hadiths": [
    {
      "id": 945,
      "name": {
        "arabic": "عَنْ اَلْمِسْوَرِ بْنِ مَخْرَمَةَ ‏- رضى الله عنه ‏- { أَنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ, فَجَاءَتْ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَاسْتَأْذَنَتْهُ أَنْ تَنْكِحَ, فَأَذِنَ لَهُ أَزْوَاجُهُ يَكُونُ حَيْثُ شَاءَ , فكان في بيت عائشة } رَوَاهُ اَلْبُخَارِيُّ وَأَصْلُهُ فِي ' اَلصَّحِيحَيْنِ",
        "urdu": "سیدنا مسور بن مخرمہ رضی اللہ عنہ سے روایت ہے کہ سبیعہ اسلمیہ رضی اللہ عنہا نے اپنے شوہر کی وفات کے چند روز بعد بچہ جنا۔ وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور نکاح کی اجازت طلب کی۔ آپ صلی اللہ علیہ وسلم نے اسے نکاح کی اجازت دے دی اور اس نے نکاح کر لیا۔ (بخاری و مسلم)",
        "english": "Narrated Al-Miswar bin Makhramah (RA): Subai'ah al-Aslamiyah gave birth a few nights after the death of her husband. She came to the Prophet (ﷺ) and asked his permission to marry. He gave her permission, and she married."
      }
    },

    {
      "id": 946,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { أُمِرَتْ بَرِيرَةُ أَنْ تَعْتَدَّ بِثَلَاثِ حِيَضٍ } .‏ رَوَاهُ اِبْنُ مَاجَهْ, وَرُوَاتُهُ ثِقَاتٌ, لَكِنَّهُ مَعْلُولٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ بریرہ رضی اللہ عنہا کو حکم دیا گیا کہ وہ (آزادی کے بعد نکاح ختم ہونے پر) تین حیض عدت گزارے۔ اسے ابن ماجہ نے روایت کیا ہے۔ اس کے راوی ثقہ ہیں، لیکن یہ روایت مروایتاً معلول (یعنی اس کی سند میں فنی نقص) ہے۔",
        "english": "Narrated 'Aishah (RA): Barirah (RA) was commanded to observe an Iddah (waiting period) of three menstrual cycles. [Reported by Ibn Majah; its narrators are reliable, but it is Ma'lul (defective)]."
      }
    },

    {
      "id": 947,
      "name": {
        "arabic": " وَعَنْ اَلشَّعْبِيِّ, عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ, { عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-‏-فِي اَلْمُطَلَّقَةِ ثَلَاثًا‏-: \"لَيْسَ لَهَا سُكْنَى وَلَا نَفَقَةٌ\" } رَوَاهُ مُسْلِمٌ ",
        "urdu": "شعبی رحمہ اللہ نے فاطمہ بنت قیس رضی اللہ عنہا سے روایت کی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مطلقہ ثلاثہ (جسے تین طلاقیں دے دی گئی ہوں) کے متعلق فرمایا ہے ”اس کے لیے (سابقہ شوہر کے ذمہ) نہ رہائش ہے نہ نان و نفقہ۔“ (مسلم)",
        "english": "Narrated Ash-Sha'bi: Fatima bint Qais (RA) narrated that the Prophet (ﷺ) said regarding a woman who had been divorced three times (irrevocably): 'There is no lodging or maintenance for her (from her former husband).'"
      }
    },

    {
      "id": 948,
      "name": {
        "arabic": "وَعَنْ أُمِّ عَطِيَّةَ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَحِدَّ اِمْرَأَةٌ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا, وَلَا تَلْبَسْ ثَوْبًا مَصْبُوغًا, إِلَّا ثَوْبَ عَصْبٍ, وَلَا تَكْتَحِلْ, وَلَا تَمَسَّ طِيبًا, إِلَّا إِذَا طَهُرَتْ نُبْذَةً مِنْ قُسْطٍ أَوْ أَظْفَارٍ.‏ } مُتَّفَقٌ عَلَيْهِ, وَهَذَا لَفْظُ مُسْلِمٍ وَلِأَبِي دَاوُدَ, وَالنَّسَائِيِّ مِنْ اَلزِّيَادَةِ: { وَلَا تَخْتَضِبْ } وَلِلنَّسَائِيِّ: \"وَلَا تَمْتَشِطْ\"",
        "urdu": "سیدہ ام عطیہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کوئی عورت کسی میت پر تین دن سے زیادہ سوگ نہ منائے، سوائے خاوند کے۔ اس پر چار ماہ دس دن سوگ منائے۔ سوگ کے زمانے میں رنگین لباس نہ پہنے، لیکن رنگے ہوئے سوت کا کپڑا پہن سکتی ہے۔ سرمہ نہ لگائے، خوشبو استعمال نہ کرے۔ مگر جب ایام حیض سے پاک ہو تو تھوڑی سی عود ہندی (ایک خوشبودار لکڑی) یا اظفار (مشک) استعمال کر سکتی ہے۔“ (بخاری و مسلم) یہ الفاظ مسلم کے ہیں اور ابوداؤد اور نسائی میں اتنا اضافہ ہے کہ مہندی و خضاب نہ لگائے اور نسائی میں ہے کہ کنگھی بھی نہ کرے۔",
        "english": "Narrated Umm 'Atiyyah (RA): Allah's Messenger (ﷺ) said: 'A woman must not observe mourning for a dead person for more than three days, except for her husband, for whom she must observe mourning for four months and ten days. She must not wear dyed clothes except those made of 'Asb (dyed yarn), and she must not apply kohl, nor use perfume, except when she becomes purified (from her menses), a small amount of Qust or Azfar (types of incense/fragrant wood).' [Agreed upon, and this is the wording of Muslim]. Abu Dawud and An-Nasa'i added: 'And she must not use henna/dye,' and An-Nasa'i added: 'nor comb her hair (for decoration).'"
      }
    },

    {
      "id": 949,
      "name": {
        "arabic": " وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { جَعَلْتُ عَلَى عَيْنِي صَبْرًا, بَعْدَ أَنْ تُوُفِّيَ أَبُو سَلَمَةَ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"إِنَّهُ يَشِبُ اَلْوَجْهَ, فَلَا تَجْعَلِيهِ إِلَّا بِاللَّيْلِ, وَانْزِعِيهِ بِالنَّهَارِ, وَلَا تَمْتَشِطِي بِالطِّيبِ, وَلَا بِالْحِنَّاءِ, فَإِنَّهُ خِضَابٌ\".‏ قُلْتُ: بِأَيِّ شَيْءٍ أَمْتَشِطُ? قَالَ: \"بِالسِّدْرِ\".‏ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَإِسْنَادُهُ حَسَنٌ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ ابوسلمہ کی وفات کے بعد میں نے اپنی آنکھوں پر مصبر (ایک قسم کی کڑوی دوا جو چمک پیدا کرتی ہے) کا لیپ کیا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مصبر چہرے کو نکھارتا اور چمکاتا ہے۔ اسے صرف رات کے اوقات میں استعمال کر اور دن کو ہٹا دیا کر۔ خوشبو اور مہندی والی کنگھی نہ کر۔ مہندی تو ایک قسم کا خضاب (زینت) ہے۔“ میں نے عرض کیا: تو پھر کس چیز کے ساتھ کنگھی کروں؟ فرمایا ”بیری کے پتوں کے ساتھ۔“",
        "english": "Narrated Umm Salama (RA): When Abu Salama died, I applied aloes (Sabir) over my eyes. The Messenger of Allah (ﷺ) said: 'It gives the face a glow; so use it only at night and remove it during the day. Do not comb your hair with perfume or henna, for it is a dye.' I asked, 'With what should I comb my hair?' He replied, 'With lote-tree leaves (Sidr).'"
      }
    },

    {
      "id": 950,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ اِمْرَأَةً قَالَتْ: يَا رَسُولَ اَللَّهِ! إِنَّ اِبْنَتِي مَاتَ عَنْهَا زَوْجُهَا, وَقَدْ اِشْتَكَتْ عَيْنَهَا, أَفَنَكْحُلُهَا? قَالَ: \"لَا\".‏ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے مروی ہے کہ ایک عورت نے عرض کیا۔ اے اللہ کے رسول! میری بیٹی کا شوہر وفات پا گیا ہے اور بیٹی آشوب چشم (آنکھوں کی بیماری) میں مبتلا ہو گئی ہے کیا میں اس کی آنکھوں میں (زینت والا) سرمہ لگا سکتی ہوں؟ فرمایا ”نہیں“۔ (بخاری و مسلم)",
        "english": "Narrated Umm Salamah (RA): A woman said, \"O Messenger of Allah! My daughter's husband has died and her eyes are painful. May we apply kohl to them?\" He replied, \"No.\" [Agreed upon]."
      }
    },

    {
      "id": 951,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { طُلِّقَتْ خَالَتِي, فَأَرَادَتْ أَنْ تَجُدَّ نَخْلَهَا فَزَجَرَهَا رَجُلٌ أَنْ تَخْرُجَ, فَأَتَتْ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: بَلْ جُدِّي نَخْلَكِ, فَإِنَّكَ عَسَى أَنْ تَصَدَّقِي, أَوْ تَفْعَلِي مَعْرُوفًا } رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ میری خالہ کو طلاق دی گئی اور انہوں نے دورانِ عدت اپنی کھجور کا پھل اتارنے کے ارادہ سے باہر جانا چاہا تو ایک آدمی نے ان کو ڈانٹا۔ وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں تم اپنے درختوں کا پھل توڑ سکتی ہو۔ عین ممکن ہے کہ تم صدقہ کرو یا اس ذریعہ سے کوئی دوسرا عملِ خیر تمہارے ہاتھ سے انجام پا جائے۔“ (مسلم)",
        "english": "Narrated Jabir (RA): My maternal aunt was divorced and she wanted to harvest the fruit from her palm trees. A man scolded her for going out (during her Iddah). She went to the Prophet (ﷺ) and he said: 'Certainly, harvest your palm trees, for perhaps you may give Sadaqah (charity) or do a good deed.'"
      }
    },

    {
      "id": 952,
      "name": {
        "arabic": " وَعَنْ فُرَيْعَةَ بِنْتِ مَالِكٍ; { أَنَّ زَوْجَهَا خَرَجَ فِي طَلَبِ أَعْبُدٍ لَهُ فَقَتَلُوهُ.‏ قَالَتْ: فَسَأَلْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَنْ أَرْجِعَ إِلَى أَهْلِي; فَإِنَّ زَوْجِي لَمْ يَتْرُكْ لِي مَسْكَنًا يَمْلِكُهُ وَلَا نَفَقَةً, فَقَالَ: \"نَعَمْ\".‏ فَلَمَّا كُنْتُ فِي اَلْحُجْرَةِ نَادَانِي, فَقَالَ: \" اُمْكُثِي فِي بَيْتِكَ حَتَّى يَبْلُغَ اَلْكِتَابُ أَجَلَهُ\".‏ قَالَتْ: فَاعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا, قَالَتْ: فَقَضَى بِهِ بَعْدَ ذَلِكَ عُثْمَانُ } أَخْرَجَهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدہ فریعہ بنت مالک رضی اللہ عنہا سے مروی ہے کہ اس کا شوہر اپنے بھاگے ہوئے غلاموں کی تلاش میں نکلا۔ انہوں نے اسے قتل کر دیا۔ فریعہ کا بیان ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے میکے لوٹ جانے کے متعلق دریافت کیا کیونکہ میرے شوہر نے اپنی ملکیت میں کوئی گھر نہیں چھوڑا اور نہ ہی نفقہ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں! (تم اپنے میکے جا سکتی ہو)“ جب میں حجرے میں پہنچی تو آپ صلی اللہ علیہ وسلم نے مجھے آواز دی اور فرمایا ”تم اپنے پہلے مکان ہی میں اس وقت تک رہو جب تک کہ تمہاری عدت پوری نہ ہو جائے۔“ فریعہ کا بیان ہے کہ میں نے پھر عدت کی مدت چار ماہ دس دن اسی سابقہ مکان میں پوری کی۔ فرماتی ہیں کہ پھر سیدنا عثمان رضی اللہ عنہ نے بھی اس کے بعد اسی کے مطابق فیصلہ دیا۔",
        "english": "Narrated Furai'ah bint Malik (RA): Her husband went out in search of some of his runaway slaves, but they killed him. She said, 'I asked the Messenger of Allah (ﷺ) if I could return to my family (maternal home), for my husband had not left me a house of his own, nor any maintenance.' He replied, 'Yes.' But when I was in the room (leaving), he called me back and said, 'Stay in your house until the prescribed term (Iddah) is reached.' She said, 'So I observed the Iddah there for four months and ten days.' She added, 'Later, 'Uthman (RA) gave judgment in accordance with that (Prophetic ruling).'"
      }
    },

    {
      "id": 953,
      "name": {
        "arabic": "وَعَنْ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ: { يَا رَسُولَ اَللَّهِ! إِنَّ زَوْجِي طَلَّقَنِي ثَلَاثًا, وَأَخَافُ أَنْ يُقْتَحَمَ عَلَيَّ, قَالَ: فَأَمَرَهَا, فَتَحَوَّلَتْ.‏ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے کہ میں نے عرض کیا، اے اللہ کے رسول! میرے خاوند نے مجھے تین طلاقیں دے دی ہیں اور مجھے اندیشہ ہے کہ کوئی میرے پاس بے جا طور پر گھس نہ آئے اور ظلم کرے۔ تو آنحضور صلی اللہ علیہ وسلم نے اسے اجازت مرحمت فرما دی اور وہ وہاں سے منتقل ہو گئی۔ (مسلم)",
        "english": "Narrated Fatima bint Qais (RA): I said, 'O Messenger of Allah! My husband has divorced me three times, and I am afraid that my house may be broken into (or I may be harassed).' He (ﷺ) then commanded her to move, and so she moved to another place."
      }
    },

    {
      "id": 954,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ: { لَا تُلْبِسُوا عَلَيْنَا سُنَّةَ نَبِيِّنَا, عِدَّةُ أُمِّ اَلْوَلَدِ إِذَا تُوُفِّيَ عَنْهَا سَيِّدُهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا } .‏ رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اَلْحَاكِمُ, وَأَعَلَّهُ اَلدَّارَقُطْنِيُّ بِالِانْقِطَاعِ",
        "urdu": "سیدنا عمرو بن العاص رضی اللہ عنہ سے مروی ہے کہ ہمارے نبی کریم صلی اللہ علیہ وسلم کی سنت ہم پر خلط ملط نہ کرو کہ جب ام ولد کا سردار وفات پا جائے تو اس کی عدت چار ماہ اور دس دن ہے۔ اس روایت کو احمد، ابوداؤد اور ابن ماجہ نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے اور دارقطنی نے اسے انقطاع سے معلول کیا ہے۔",
        "english": "Narrated 'Amr bin al-'As (RA): Do not confuse the Sunnah of our Prophet (ﷺ) for us. The Iddah (waiting period) of an Umm al-Walad (a slave-woman who has borne her master a child) whose master dies is four months and ten days. [Reported by Ahmad, Abu Dawud and Ibn Majah. Al-Hakim graded it Sahih, but Ad-Daraqutni marked it as Ma'lul (defective) due to a break in the chain]."
      }
    },

    {
      "id": 955,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { إِنَّمَا اَلْأَقْرَاءُ; اَلْأَطْهَارُ } .‏ أَخْرَجَهُ مَالِكٌ فِي قِصَّةٍ بِسَنَدٍ صَحِيحٍ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ اقراء سے مراد طہر (پاکی کی حالت) ہی ہیں۔ اسے مالک، احمد اور نسائی نے ایک قصہ میں سندِ صحیح کے ساتھ نقل کیا ہے۔",
        "english": "Narrated 'Aisha (RA): 'The periods (Quru') are only the periods of purity (Athar).' Reported by Malik in a story with a Sahih chain."
      }
    },

    {
      "id": 956,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { طَلَاقُ اَلْأَمَةِ تَطْلِيقَتَانِ, وَعِدَّتُهَا حَيْضَتَانِ } رَوَاهُ اَلدَّارَقُطْنِيُّ وَأَخْرَجَهُ مَرْفُوعًا وَضَعَّفَهُ وَأَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ, وَابْنُ مَاجَهْ: مِنْ حَدِيثِ عَائِشَةَ, وَصَحَّحَهُ اَلْحَاكِمُ, وَخَالَفُوهُ, فَاتَّفَقُوا عَلَى ضَعْفِهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ لونڈی کی طلاق دو طلاقیں ہیں اور اس کی عدت دو حیض۔ اسے دارقطنی نے روایت کیا ہے اور انہوں نے اسے مرفوع بھی روایت کیا ہے مگر اسے ضعیف کہا ہے۔ نیز اس روایت کی تخریج ابوداؤد، ترمذی اور ابن ماجہ نے سیدہ عائشہ رضی اللہ عنہا کی روایت سے کی ہے۔ حاکم نے اسے صحیح کہا ہے مگر دوسرے محدثین نے ان کی مخالفت کی ہے، وہ اس کے ضعیف ہونے پر متفق ہیں۔",
        "english": "Narrated Ibn 'Umar (RA): 'The divorce of a slave-woman is two pronouncements, and her Iddah (waiting period) is two menstrual cycles.' [Reported by Ad-Daraqutni, who also narrated it as a Marfu' Hadith but graded it as Da'if. It was also reported by Abu Dawud, At-Tirmidhi, and Ibn Majah from the Hadith of 'Aishah (RA). Al-Hakim graded it Sahih, but other scholars disagreed and reached a consensus on its weakness as a Marfu' report.]"
      }
    },

    {
      "id": 957,
      "name": {
        "arabic": " وَعَنْ رُوَيْفِعِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ اَلْآخِرِ أَنْ يَسْقِيَ مَاءَهُ زَرْعَ غَيْرِهِ .‏ } أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَحَسَّنَهُ اَلْبَزَّارُ ",
        "urdu": " سیدنا رویفع بن ثابت رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جو شخص اللہ اور یوم آخرت پر ایمان رکھتا ہو اس کے لیے حلال نہیں ہے کہ وہ غیر کی کھیتی کو اپنے پانی سے سیراب کرے۔“ (ابوداؤد، ترمذی)",
        "english": "Narrated Ruwaifi' bin Thabit (RA): The Prophet (ﷺ) said: 'It is not lawful for a man who believes in Allah and the Last Day to irrigate the crop of another with his water (i.e., to have intercourse with a pregnant woman who was captured or divorced by someone else).'"
      }
    },

    {
      "id": 958,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- ‏- { فِي اِمْرَأَةِ اَلْمَفْقُودِ‏- تَرَبَّصُ أَرْبَعَ سِنِينَ, ثُمَّ تَعْتَدُّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا } .‏ أَخْرَجَهُ مَالِكٌ, وَالشَّافِعِيُّ",
        "urdu": "سیدنا عمر رضی اللہ عنہ نے اس عورت کے بارے میں جس کا شوہر لاپتہ (مفقود الخبر) ہو گیا ہو فرمایا: وہ چار سال تک انتظار کرے گی، پھر (اس کے بعد) چار ماہ دس دن عدت گزارے گی۔ اسے امام مالک اور امام شافعی نے روایت کیا ہے۔",
        "english": "Narrated 'Umar (RA) concerning the wife of a missing man (Mafqud al-Khabar): 'She is to wait for four years, and then observe an Iddah (waiting period) of four months and ten days.' [Reported by Malik and Ash-Shafi'i]."
      }
    },

    {
      "id": 959,
      "name": {
        "arabic": " وَعَنْ اَلْمُغِيرَةِ بْنِ شُعْبَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اِمْرَأَةُ اَلْمَفْقُودِ اِمْرَأَتُهُ حَتَّى يَأْتِيَهَا اَلْبَيَانُ.‏ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مفقود الخبر (گمشدہ) مرد کی بیوی، اس کی بیوی ہی رہے گی جب تک کہ اس کے متعلق واضح طور پر اطلاع (موت یا طلاق کی) موصول نہ ہو جائے۔“ اسے دارقطنی نے ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated Al-Mughirah bin Shu'bah (RA): The Messenger of Allah (ﷺ) said: 'The wife of a missing man remains his wife until clear news (of his death or a divorce) reaches her.' Reported by Ad-Daraqutni with a weak chain."
      }
    },

    {
      "id": 960,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَبِيتَنَّ رَجُلٌ عِنْدَ اِمْرَأَةٍ, إِلَّا أَنْ يَكُونَ نَاكِحًا, أَوْ ذَا مَحْرَمٍ.‏ } أَخْرَجَهُ مُسْلِمٌ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کوئی شخص کسی عورت کے پاس رات بسر نہ کرے۔ الایہ کہ وہ مرد اس کا شوہر ہو یا محرم ہو۔“ (مسلم)",
        "english": "Narrated Jabir (RA): The Messenger of Allah (ﷺ) said, 'No man should spend the night with a woman (who is not his wife) unless he is married to her or is a Mahram (unmarriageable relative) to her.' [Reported by Muslim]."
      }
    },

    {
      "id": 961,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَخْلُوَنَّ رَجُلٌ بِاِمْرَأَةٍ, إِلَّا مَعَ ذِي مَحْرَمٍ.‏ } أَخْرَجَهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کوئی شخص بھی کسی (غیر محرم) عورت کے ساتھ تنہائی و خلوت اختیار نہ کرے جب تک کہ اس عورت کے ساتھ اس کا محرم نہ ہو۔“ (بخاری)",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: 'No man should stay in seclusion with a woman unless she is accompanied by a Dhu-Mahram (a near relative within the prohibited degrees).'"
      }
    },

    {
      "id": 962,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ فِي سَبَايَا أَوْطَاسٍ: { لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ, وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً } أَخْرَجَهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ وَلَهُ شَاهِدٌ: عَنْ اِبْنِ عَبَّاسٍ فِي اَلدَّارَقُطْنِيِّ ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اوطاس کے قیدیوں کے متعلق فرمایا ”حاملہ عورت جب تک وضع حمل نہ کر لے، اس سے جماع نہ کیا جائے نیز غیر حاملہ سے بھی اس وقت تک وطی نہ کی جائے جب تک اسے ایک ماہواری نہ آ جائے۔“ اس کی تخریج ابوداؤد نے کی ہے اور حاکم نے اسے صحیح قرار دیا ہے۔ دارقطنی میں ابن عباس رضی اللہ عنہما سے بھی اس کا شاہد مروی ہے۔ ",
        "english": "Narrated Abu Sa'id al-Khudri (RA): Regarding the captives of Awtas, the Prophet (ﷺ) said: 'A pregnant woman is not to have sexual intercourse with until she delivers her baby, and one who is not pregnant is not to have sexual intercourse with until she has one menstruation (to ensure she is not pregnant).' [Reported by Abu Dawud, and Al-Hakim graded it Sahih; it has a supporting narration from Ibn 'Abbas in Ad-Daraqutni]."
      }
    },

    {
      "id": 963,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْوَلَدُ لِلْفِرَاشِ, وَلِلْعَاهِرِ اَلْحَجَرُ.‏ } مُتَّفَقٌ عَلَيْهِ مِنْ حَدِيثِهِ وَمِنْ حَدِيثِ عَائِشَةَ فِي قِصَّةٍ وَعَنْ اِبْنِ مَسْعُودٍ, عِنْدَ النَّسَائِيِّ وَعَنْ عُثْمَانَ.‏ عِنْدَ أَبِي دَاوُدَ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”بچہ اس کا ہے جس کے بستر پر پیدا ہوا اور زانی کے لیے پتھر (یعنی محرومی یا سزا) ہے۔“ (بخاری و مسلم) سیدہ عائشہ رضی اللہ عنہا کی حدیث میں ایک قصہ کے متعلق بھی اسی طرح روایت ہے اور سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے نسائی نے اور سیدنا عثمان رضی اللہ عنہ سے ابوداؤد نے یہی روایت بیان کی ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: 'The child belongs to the (owner of the) bed, and for the adulterer is the stone (deprivation).' Agreed upon. It is also narrated by 'Aisha (RA) in a specific story, by Ibn Mas'ud (RA) in An-Nasa'i, and by 'Uthman (RA) in Abu Dawud."
      }
    }
  ]
}
