{
  "chapId": 102,
  "bookId": 16,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1236,
    "to": 1251
  },
  "hadiths": [
    {
      "id": 1236,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ حَقُّ اَلْمُسْلِمِ عَلَى اَلْمُسْلِمِ سِتٌّ: إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ, وَإِذَا دَعَاكَ فَأَجِبْهُ, وَإِذَا اِسْتَنْصَحَكَ فَانْصَحْهُ, وَإِذَا عَطَسَ فَحَمِدَ اَللَّهَ فَسَمِّتْهُ وَإِذَا مَرِضَ فَعُدْهُ, وَإِذَا مَاتَ فَاتْبَعْهُ } رَوَاهُ مُسْلِمٌ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک مسلمان کے دوسرے مسلمان پر چھ حقوق ہیں۔ جب ملاقات ہو تو، تو اسے سلام کہ اور جب وہ تجھے دعوت پر مدعو کرے تو دعوت قبول کر اور جب وہ تجھ سے نصیحت طلب کرے تو اسے نصیحت کر اور جب وہ چھینک مار کر «الحمد الله» کہے تو اس کے جواب میں تو «يرحمك الله» کہ اور جب وہ بیمار ہو جائے تو اس کی عیادت کر اور جب وہ وفات پا جائے تو اس کے جنازہ میں شرکت کر۔“ (مسلم) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"The rights of a Muslim upon another Muslim are six: When you meet him, greet him with Salām; when he invites you, respond to his invitation; when he seeks your advice, advise him; when he sneezes and praises Allah, supplicate for mercy upon him (say: Yarhamuk-Allah); when he becomes ill, visit him; and when he dies, follow his funeral.\""
      }
    },

    {
      "id": 1237,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ انْظُرُوا إِلَى مَنْ هُوَ أَسْفَلَ مِنْكُمْ, وَلَا تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ, فَهُوَ أَجْدَرُ أَنْ لَا تَزْدَرُوا نِعْمَةَ اَللَّهِ عَلَيْكُمْ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہمیشہ اپنے سے (غریب) کو دیکھو اور اپنے سے (امیر) کی طرف نہ دیکھو اور یہ اس کیلئے زیادہ مناسب ہے (اس لیے) کہ تم اللہ کی کسی نعمت کو حقیر نہ سمجھو گے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Look at those who are lower than you (in worldly wealth) but do not look at those who are higher than you, for it is more suitable that you do not disparage (look down upon) the blessings of Allah upon you.'"
      }
    },

    {
      "id": 1238,
      "name": {
        "arabic": " وَعَنْ اَلنَوَّاسِ بْنِ سَمْعَانَ ‏- رضى الله عنه ‏- قَالَ: سأَلْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلْبِرِّ وَالْإِثْمِ? فَقَالَ: { اَلْبِرُّ: حُسْنُ اَلْخُلُقِِ, وَالْإِثْمُ: مَا حَاكَ فِي صَدْرِكَ, وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ اَلنَّاسُ } أَخْرَجَهُ مُسْلِمٌ",
        "urdu": "سیدنا نواس بن سمعان رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے نیکی اور گناہ کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا: ”نیکی اچھے اخلاق کا نام ہے اور گناہ وہ ہے جو تیرے سینے میں کھٹکے اور تو ناپسند سمجھے کہ لوگ اس پر مطلع ہو جائیں۔“ (مسلم)",
        "english": "Narrated An-Nawwas bin Sam'an (RA): I asked Allah's Messenger (ﷺ) about righteousness and sin. He replied, 'Righteousness is good character, and sin is that which wavers in your heart and which you would hate for people to find out about.'"
      }
    },

    {
      "id": 1239,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا كُنْتُمْ ثَلَاثَةً, فَلَا يَتَنَاجَى اِثْنَانِ دُونَ اَلْآخَرِ, حَتَّى تَخْتَلِطُوا بِالنَّاسِ; مِنْ أَجْلِ أَنَّ ذَلِكَ يُحْزِنُهُ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم تین (آدمی) ہو تو دو آدمی تیسرے کو چھوڑ کر آپس میں سرگوشی نہ کریں جب تک کہ تم لوگوں میں گھل مل نہ جاؤ، کیونکہ یہ عمل اس (تیسرے) کو غمگین کر دیتا ہے۔“ (بخاری و مسلم) اور یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) said: 'When there are three of you, two should not hold a secret counsel (whispering) to the exclusion of the third, until you mingle with other people, for that will grieve him.'"
      }
    },

    {
      "id": 1240,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يُقِيمُ اَلرَّجُلُ اَلرَّجُلَ مِنْ مَجْلِسِهِ, ثُمَّ يَجْلِسُ فِيهِ, وَلَكِنْ تَفَسَّحُوا, وَتَوَسَّعُوا } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی آدمی کسی کو اس کی جگہ سے اٹھا کر خود اس کی جگہ نہ بیٹھے۔ (اگر جگہ کی کمی ہو تو) کھل جاؤ اور کشادہ ہو جاؤ۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'A man should not make another man get up from his place and then sit in it himself; but (instead) you should make room and spread out.'"
      }
    },

    {
      "id": 1241,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا, فَلَا يَمْسَحْ يَدَهُ, حَتَّى يَلْعَقَهَا, أَوْ يُلْعِقَهَا } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی کھانا کھائے تو اپنا ہاتھ چاٹنے یا (کسی کو) چٹوانے سے پہلے (رومال وغیرہ سے) صاف نہ کرے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: 'When one of you eats food, he should not wipe his hand until he has licked it himself or has given it to someone else to lick (like a spouse or child).'"
      }
    },

    {
      "id": 1242,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لِيُسَلِّمْ اَلصَّغِيرُ عَلَى اَلْكَبِيرِ, وَالْمَارُّ عَلَى اَلْقَاعِدِ, وَالْقَلِيلُ عَلَى اَلْمُكْثِرِ } مُتَّفَقٌ عَلَيْهِ.‏ وَفِي رِوَايَةٍ لِمُسْلِمٍ: { وَالرَّاكِبُ عَلَى اَلْمَاشِي }",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”چھوٹا بڑے کو، راہ چلتا بیٹھے کو اور تھوڑی تعداد والے زیادہ تعداد والوں کو سلام کیا کریں۔“ (بخاری و مسلم) اور مسلم کی ایک روایت میں ہے کہ ”سوار پیدل چلنے والے کو سلام کرے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'The younger person should greet the older one, the walking person should greet the sitting one, and the small group should greet the large group.' (Agreed upon). In a narration by Muslim: 'And the rider should greet the one walking.'"
      }
    },

    {
      "id": 1243,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يُجْزِئُ عَنْ اَلْجَمَاعَةِ إِذَا مَرُّوا أَنْ يُسَلِّمَ أَحَدُهُمْ, وَيُجْزِئُ عَنْ اَلْجَمَاعَةِ أَنْ يَرُدَّ أَحَدُهُمْ } رَوَاهُ أَحْمَدُ, وَالْبَيْهَقِيُّ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب ایک جماعت کسی کے پاس سے گزرے تو ان میں سے ایک آدمی کا سلام کہہ دینا کافی ہے اور جماعت میں سے ایک آدمی کا جواب دینا کافی ہے۔“ (مسند احمد، سنن بیہقی)",
        "english": "Narrated 'Ali (RA): Allah's Messenger (ﷺ) said: 'It is sufficient for a group of people passing by to have one of them give the greeting (Salam), and it is sufficient for those sitting to have one of them return the greeting.'"
      }
    },

    {
      "id": 1244,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَبْدَؤُوا اَلْيَهُودَ وَالنَّصَارَى بِالسَّلَامِ, وَإِذَا لَقَيْتُمُوهُمْ فِي طَرِيقٍ, فَاضْطَرُّوهُمْ إِلَى أَضْيَقِهِ } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہود و نصاریٰ کو سلام کرنے میں پہل مت کرو، اور جب تم راستے میں ان سے ملو تو انہیں تنگ راستے کی طرف (جانے پر) مجبور کر دو۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Do not greet the Jews and the Christians before they greet you; and when you meet any one of them on the road, force him to go to the narrowest part of it.'"
      }
    },

    {
      "id": 1245,
      "name": {
        "arabic": "وَعَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلْ: اَلْحَمْدُ لِلَّهِ, وَلْيَقُلْ لَهُ أَخُوهُ يَرْحَمُكَ اَللَّهُ, فَإِذَا قَالَ لَهُ: يَرْحَمُكَ اَللَّهُ, فَلْيَقُلْ: يَهْدِيكُمُ اَللَّهُ, وَيُصْلِحُ بَالَكُمْ } أَخْرَجَهُ اَلْبُخَارِيُّ.",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کسی کو چھینک آئے تو اسے «الحمد الله» (سب تعریف اللہ کے لئے ہے) کہنا چاہیئے اور اس کا بھائی اسے «يرحمك الله» (اللہ تجھ پر رحم کرے) کہے۔ پھر چھینک مارنے والا جواباً کہے «يهديكم الله ويصلح بالكم» (اللہ تمہیں ہدایت دے اور تمہارا حال درست فرمائے)۔“ (بخاری)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: 'When one of you sneezes, he should say, \"Al-hamdu lillah\" (Praise be to Allah), and his brother should say to him, \"Yarhamuk-Allah\" (May Allah have mercy on you). When he says this to him, the (one who sneezed) should reply, \"Yahdikum-ullah wa yuslihu balakum\" (May Allah guide you and rectify your condition).'"
      }
    },

    {
      "id": 1246,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَشْرَبَنَّ أَحَدٌ مِنْكُمْ قَائِمًا } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کوئی کھڑے کھڑے ہرگز پانی نہ پئے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'None of you should drink while standing.'"
      }
    },

    {
      "id": 1247,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا اِنْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ, وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ, وَلْتَكُنْ اَلْيُمْنَى أَوَّلَهُمَا تُنْعَلُ, وَآخِرَهُمَا تُنْزَعُ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی جوتا پہننے لگے تو پہلے دائیں پاؤں میں پہنے اور جب اتارے تو پہلے بائیں پاؤں سے اتارے اور چاہیئے کہ دائیں پاؤں میں جوتا پہلے پہنا جائے اور دونوں پاؤں میں سے آخر میں دائیں پاؤں سے جوتا اتارا جائے۔ “ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'When any of you puts on his sandals, he should begin with the right foot, and when he takes them off, he should begin with the left foot. Thus, the right foot should be the first to be put on and the last to be taken off.'"
      }
    },

    {
      "id": 1248,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَمْشِ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ, وَلْيُنْعِلْهُمَا جَمِيعًا, أَوْ لِيَخْلَعْهُمَا جَمِيعًا } مُتَّفَقٌ عَلَيْهِمَا.",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کوئی بھی ایک جوتا پہن کر نہ چلے پھرے یا تو دونوں اکٹھے پہنے یا پھر دونوں اتار دے۔“ (بخاری و مسلم) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'None of you should walk wearing only one shoe; he should either wear a pair or take them both off.'"
      }
    },

    {
      "id": 1249,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَنْظُرُ اَللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ اس شخص کی طرف نظر رحمت سے نہ دیکھے گا جو تکبر سے اپنا کپڑا (پاؤں کے) نیچے گھسیٹتا پھرے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'Allah will not look at him who trails his garment out of pride (arrogance).'"
      }
    },

    {
      "id": 1250,
      "name": {
        "arabic": " وَعَنْهُ أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ, وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ, فَإِنَّ اَلشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ, وَيَشْرَبُ بِشِمَالِهِ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب بھی تم میں سے کوئی کھانا کھائے تو اسے اپنے دائیں ہاتھ سے کھانا چاہیئے اور جب کوئی مشروب نوش کرے تو اسے دائیں ہاتھ سے نوش کرنا چاہیئے۔ اس لئے کہ شیطان اپنے بائیں ہاتھ سے کھاتا ہے اور بائیں ہی سے پیتا ہے۔ “ (مسلم) ",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'When one of you eats, he should eat with his right hand; and when he drinks, he should drink with his right hand, for Shaitan (Satan) eats with his left hand and drinks with his left hand.'"
      }
    },

    {
      "id": 1251,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كُلْ, وَاشْرَبْ, وَالْبَسْ, وَتَصَدَّقْ فِي غَيْرِ سَرَفٍ, وَلَا مَخِيلَةٍ } أَخْرَجَهُ أَبُو دَاوُدَ, وَأَحْمَدُ, وَعَلَّقَهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ نے اپنے باپ سے اور انہوں نے اپنے دادا سے روایت کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کھاؤ، پیو، پہنو اور صدقہ کرو لیکن فضول خرچی اور تکبر کے بغیر۔“",
        "english": "Narrated 'Amr bin Shu'aib (RA) on his father's authority from his grandfather: The Messenger of Allah (ﷺ) said: 'Eat, drink, wear clothes and give Sadaqah (charity) without extravagance or arrogance.'"
      }
    }
  ]
}
