{
  "chapId": 99,
  "bookId": 14,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1210,
    "to": 1219
  },
  "hadiths": [
    {
      "id": 1210,
      "name": {
        "arabic": " عَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ: { \"لَوْ يُعْطَى اَلنَّاسُ بِدَعْوَاهُمْ, لَادَّعَى نَاسٌ دِمَاءَ رِجَالٍ, وَأَمْوَالَهُمْ, وَلَكِنِ اَلْيَمِينُ عَلَى اَلْمُدَّعَى عَلَيْهِ\" } مُتَّفَقٌ عَلَيْه ِ وَلِلْبَيْهَقِيِّ بِإِسْنَادٍ صَحِيحٍ: { \"اَلْبَيِّنَةُ عَلَى اَلْمُدَّعِي, وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ }",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” اگر لوگوں کو محض ان کے دعوے کرنے سے حق دے دیا جائے تو لوگ دوسرے لوگوں کے خون اور ان کے اموال کا دعویٰ کریں گے لیکن مدعا علیہ کے ذمہ قسم لازم ہے۔“ (بخاری و مسلم) اور بیہقی نے صحیح سند سے روایت کیا ہے کہ گواہی (یا دلیل) مدعی کے ذمہ اور قسم اس کے ذمہ جو اس کا انکار کرے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: \"If people were given whatever they claimed, they would claim the lives and property of others; but the oath is upon the defendant.\" (Agreed upon). Al-Bayhaqi reported with a Sahih chain: \"The burden of proof is upon the claimant, and the oath is upon the one who denies (the claim).\""
      }
    },

    {
      "id": 1211,
      "name": {
        "arabic": " وَعَنْ أَبِي أُمَامَةَ اَلْحَارِثِيُّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" مَنْ اِقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ, فَقَدْ أَوْجَبَ اَللَّهُ لَهُ اَلنَّارَ, وَحَرَّمَ عَلَيْهِ اَلْجَنَّةَ\" .‏ فَقَالَ لَهُ رَجُلٌ: وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اَللَّهِ? قَالَ: \"وَإِنْ قَضِيبٌ مِنْ أَرَاكٍ\" } رَوَاهُ مُسْلِم ٌ ",
        "urdu": " سیدنا ابوامامہ حارثی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس کسی نے اپنے مسلمان بھائی کا حق اپنی قسم کے ذریعے مارا۔ اس کے لیے اللہ نے دوزخ واجب کر دی اور اس پر جنت حرام قرار دے دی ہے۔ ایک شخص نے عرض کیا، اے اللہ کے رسول! اگرچہ کوئی حقیر و معمولی چیز ہو؟ آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ ” اگرچہ درخت پیلو کی ایک شاخ ہو۔“ (مسلم) ",
        "english": "Narrated Abu Umama al-Harithi (RA): Allah's Messenger (ﷺ) said, \"If anyone deprives a Muslim of his right by taking an oath, Allah has made Hell compulsory for him and has forbidden Paradise for him.\" A man asked, \"Even if it were something small, O Messenger of Allah?\" He replied, \"Even if it were a twig of an Arak tree.\""
      }
    },

    {
      "id": 1212,
      "name": {
        "arabic": "وَعَنِ الْأَشْعَثِ بْنِ قَيْسٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ حَلَفَ عَلَى يَمِينٍ, يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ, هُوَ فِيهَا فَاجِرٌ, لَقِيَ اَللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا اشعث بن قیس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جو شخص قسم کھا کر کسی دوسرے کا مال اڑا لے اور وہ اس میں جھوٹا ہو تو اللہ تعالیٰ سے ایسی حالت میں ملاقات کرے گا کہ وہ اس پر سخت ناراض ہو گا۔“ (بخاری و مسلم)",
        "english": "Narrated Al-Ash'ath bin Qais (RA): The Messenger of Allah (ﷺ) said: 'Whoever takes an oath to grab the property of a Muslim person while he is a liar in it, will meet Allah while He is angry with him.'"
      }
    },

    {
      "id": 1213,
      "name": {
        "arabic": "وَعَنِ الْأَشْعَثِ بْنِ قَيْسٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ حَلَفَ عَلَى يَمِينٍ, يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ, هُوَ فِيهَا فَاجِرٌ, لَقِيَ اَللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا اشعث بن قیس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جو شخص قسم کھا کر کسی دوسرے کا مال اڑا لے اور وہ اس میں جھوٹا ہو تو اللہ تعالیٰ سے ایسی حالت میں ملاقات کرے گا کہ وہ اس پر سخت ناراض ہو گا۔“ (بخاری و مسلم)",
        "english": "Narrated Al-Ash'ath bin Qais (RA): The Messenger of Allah (ﷺ) said: 'Whoever takes an oath to grab the property of a Muslim person while he is a liar in it, will meet Allah while He is angry with him.'"
      }
    },

    {
      "id": 1214,
      "name": {
        "arabic": " وَعَنْ أَبَى مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَجُلَيْنِ اِخْتَصَمَا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي دَابَّةٍ, لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ, فَقَضَى بِهَا رَسُولُ اَللَّهِ بَيْنَهُمَا نِصْفَيْنِ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ وَهَذَا لَفْظُهُ, وَقَالَ: إِسْنَادُهُ جَيِّد ٌ",
        "urdu": "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روايت ہے كہ دو آدمیوں کا ایک جانور کے بارے میں جھگڑا ہوا۔ ان میں سے کسی کے پاس کوئی دلیل نہیں تھی تو آپ صلی اللہ علیہ وسلم نے اس جانور کو ان دونوں کے درمیان آدھا آدھا دینے کا فیصلہ فرمایا۔ اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے؟ یہ الفاظ نسائی کے ہیں۔ اس کی سند عمدہ ہے۔ ",
        "english": "Narrated Abu Musa al-Ash'ari (RA): Two men brought a dispute before Allah's Messenger (ﷺ) concerning an animal, and neither of them had any proof. So Allah's Messenger (ﷺ) decided that it should be divided equally between them."
      }
    },

    {
      "id": 1215,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ حَلَفَ عَلَى مِنْبَرِي هَذَا بِيَمِينٍ آثِمَةٍ, تَبَوَّأَ مَقْعَدَهُ مِنْ اَلنَّارِ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے میرے منبر پر کھڑے ہو کر جھوٹی قسم کھائی تو اس نے اپنا ٹھکانہ جہنم میں بنا لیا۔“ اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Jabir (RA): The Prophet (ﷺ) said: 'Whoever takes a sinful oath at this pulpit of mine, let him take his seat in the Fire (of Hell).'"
      }
    },

    {
      "id": 1216,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اَللَّهُ يَوْمَ اَلْقِيَامَةِ, وَلَا يَنْظُرُ إِلَيْهِمْ, وَلَا يُزَكِّيهِمْ, وَلَهُمْ عَذَابٌ أَلِيمٌ: رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالْفَلَاةِ, يَمْنَعُهُ مِنْ اِبْنِ اَلسَّبِيلِ; وَرَجُلٌ بَايَعَ رَجُلاً بِسِلْعَةٍ بَعْدَ اَلْعَصْرِ, فَحَلَفَ لَهُ بِاَللَّهِ: لَأَخَذَهَا بِكَذَا وَكَذَا, فَصَدَّقَهُ, وَهُوَ عَلَى غَيْرِ ذَلِكَ; وَرَجُلٌ بَايَعَ إِمَامًا لَا يُبَايِعُهُ إِلَّا لِلدُّنْيَا, فَإِنْ أَعْطَاهُ مِنْهَا, وَفَى, وَإِنْ لَمْ يُعْطِهِ مِنْهَا, لَمْ يَفِ\" } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” تین آدمی ایسے ہیں کہ قیامت کے روز اللہ تعالیٰ ان سے کلام نہیں کرے گا اور نہ ان کی جانب نظر (رحمت) کرے گا اور نہ ان کو گناہوں سے پاک کرے گا بلکہ ان کیلئے دردناک عذاب ہو گا پہلا وہ آدمی جو ایک مسافر کو جنگل میں بچے ہوئے پانی سے روکتا ہے اور دوسرا وہ آدمی جو عصر کے بعد کسی چیز کا دوسرے سے سودا کرتا ہے اور اللہ کی قسم کھاتا ہے کہ اس نے اس چیز کو اتنے اتنے میں خریدا ہے حالانکہ حقیقت ایسے نہ تھی اور وہ خریدار اس کو سچ مان گیا اور تیسرا وہ شخص جس نے دنیاوی غرض کے لئے کسی بادشاہ کی بیعت کی اگر بادشاہ اس کو کچھ دیتا ہے تو وہ وفا کرتا ہے اور اگر وہ اس کو کچھ نہیں دیتا (یعنی دنیا کا مال) تو وہ وفا نہیں کرتا۔“ (بخاری و مسلم) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"There are three types of people whom Allah will neither speak to on the Day of Resurrection, nor will He look at them, nor will He purify them; and they will have a painful punishment: A man who has surplus water in the desert and withholds it from a wayfarer; a man who sells a commodity to another man after the 'Asr prayer and swears by Allah that he bought it for such and such a price, and the other believes him while the truth is otherwise; and a man who gives his pledge of allegiance to an Imam (leader) only for worldly benefits—if the Imam gives him what he wants, he fulfills his pledge, but if he does not give him anything, he does not fulfill it.\""
      }
    },

    {
      "id": 1217,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلَيْنِ اِخْتَصَمَا فِي نَاقَةٍ, فَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا نُتِجَتْ عِنْدِي, وَأَقَامَا بَيِّنَةً, فَقَضَى بِهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- لِمَنْ هِيَ فِي يَدِهِ }",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ دو آدمی ایک اونٹنی کا مقدمہ عدالت نبوی صلی اللہ علیہ وسلم میں لائے۔ ان میں سے ہر ایک کا یہ دعویٰ تھا کہ اونٹنی نے بچہ میرے ہاں جنا ہے اور دونوں نے اپنے اپنے گواہ بھی پیش کئے۔ پس رسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے حق میں فیصلہ صادر فرمایا جس کے قبضہ میں اونٹنی تھی۔",
        "english": "Narrated Jabir (RA): Two men brought a dispute before the Prophet (ﷺ) regarding a she-camel. Each of them claimed that it was born in his place and brought witnesses. The Messenger of Allah (ﷺ) then judged in favor of the one who was in possession of the she-camel."
      }
    },

    {
      "id": 1218,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلَيْنِ اِخْتَصَمَا فِي نَاقَةٍ, فَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا نُتِجَتْ عِنْدِي, وَأَقَامَا بَيِّنَةً, فَقَضَى بِهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- لِمَنْ هِيَ فِي يَدِهِ }",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ دو آدمی ایک اونٹنی کا مقدمہ عدالت نبوی صلی اللہ علیہ وسلم میں لائے۔ ان میں سے ہر ایک کا یہ دعویٰ تھا کہ اونٹنی نے بچہ میرے ہاں جنا ہے اور دونوں نے اپنے اپنے گواہ بھی پیش کئے۔ پس رسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے حق میں فیصلہ صادر فرمایا جس کے قبضہ میں اونٹنی تھی۔",
        "english": "Narrated Jabir (RA): Two men brought a dispute before the Prophet (ﷺ) regarding a she-camel. Each of them claimed that it was born in his place and brought witnesses. The Messenger of Allah (ﷺ) then judged in favor of the one who was in possession of the she-camel."
      }
    },

    {
      "id": 1219,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: دَخَلَ عَلَيَّ رَسُولُ اَللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ مَسْرُورًا, تَبْرُقُ أَسَارِيرُ وَجْهِهِ.‏ فَقَالَ: \"أَلَمْ تَرَيْ إِلَى مُجَزِّزٍ اَلْمُدْلِجِيِّ ? نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ, وَأُسَامَةَ بْنِ زَيْدٍ, فَقَالَ: \" هَذِهِ أَقْدَامٌ بَعْضُهَا مِنْ بَعْضٍ\" مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ ایک روز نبی کریم صلی اللہ علیہ وسلم خوش و خرم میرے ہاں تشریف لائے۔ آپ صلی اللہ علیہ وسلم کا رخ انور چمک رہا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ” کیا تجھے معلوم نہیں کہ مجزز مدلجی نے ابھی زید بن حارثہ اور اسامہ بن زید (رضی اللہ عنہم) کو دیکھ کر کہا ہے کہ یہ پاؤں ایک دوسرے کا جز ہیں۔“ (بخاری و مسلم)",
        "english": "Narrated Aisha (RA): One day Allah's Messenger (ﷺ) entered upon me in a happy mood, with his facial features glowing with joy. He said, 'O Aisha! Did you not see that Mujazziz al-Mudliji saw Zaid bin Harithah and Usama bin Zaid and said: These feet belong to each other (i.e., they have a biological relationship)?'"
      }
    }
  ]
}
