{
  "chapId": 65,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 855,
    "to": 866
  },
  "hadiths": [
    {
      "id": 855,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْعَرَبُ بَعْضُهُمْ أَكْفَاءُ بَعْضٍ , وَالْمَوَالِي بَعْضُهُمْ أَكْفَاءُ بَعْضٍ , إِلَّا حَائِكٌ أَوْ حَجَّامٌ } رَوَاهُ اَلْحَاكِمُ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عرب ایک دوسرے کے لیے کفو (برابر) ہیں اور موالی بھی ایک دوسرے کے لیے کفو ہیں، سوائے جولاہے اور حجام کے۔“ اس روایت کو حاکم نے بیان کیا ہے۔",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: \"The Arabs are compatible with one another (for marriage) and the Mawali (enfranchised slaves) are compatible with one another, except for a weaver or a barber.\""
      }
    },

    {
      "id": 856,
      "name": {
        "arabic": "وَعَنْ فَاطِمَةَ بِنْتِ قَيْسٍ ; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ لَهَا : { اِنْكِحِي أُسَامَةَ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو مشورہ دیا کہ اسامہ (رضی اللہ عنہ) سے نکاح کر لو۔ (مسلم)",
        "english": "Narrated Fatima bint Qais (RA): The Prophet (ﷺ) said to her: 'Marry Usama (bin Zaid).'"
      }
    },

    {
      "id": 857,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ : { يَا بَنِي بَيَاضَةَ , أَنْكِحُوا أَبَا هِنْدٍ , وَانْكِحُوا إِلَيْهِ } وَكَانَ حَجَّامًا } رَوَاهُ أَبُو دَاوُدَ , وَالْحَاكِمُ بِسَنَدٍ جَيِّدٍ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”اے بنی بیاضہ! ابوہند کا نکاح کر دو اور اس کی لڑکیوں سے نکاح کرو۔“ اور ابوہند حجام (پچھنے لگانے والے) تھے۔ اسے ابوداؤد اور حاکم نے عمدہ سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"O Banu Bayadah! Marry Abu Hind (to one of your women) and marry from his (daughters).\" And he was a cupper (barber)."
      }
    },

    {
      "id": 858,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ : { خُيِّرَتْ بَرِيرَةُ عَلَى زَوْجِهَا حِينَ عَتَقَتْ } .‏ مُتَّفَقٌ عَلَيْهِ فِي حَدِيثٍ طَوِيلٍ وَلِمُسْلِمٍ عَنْهَا : { أَنَّ زَوْجَهَا كَانَ عَبْدًا } وَفِي رِوَايَةٍ عَنْهَا : { كَانَ حُرًّا } .‏ وَالْأَوَّلُ أَثْبَتُ وَصَحَّ عَنِ ابْنِ عَبَّاسٍ عِنْدَ اَلْبُخَارِيِّ ; أَنَّهُ كَانَ عَبْدًا ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ سیدہ بریرہ رضی اللہ عنہا کو جب آزادی ملی تو اس وقت ان کو خاوند کے بارے میں اختیار دیا گیا۔ (بخاری و مسلم) یہ لمبی حدیث کا ٹکڑا ہے۔ اور مسلم میں سیدہ عائشہ رضی اللہ عنہا ہی سے مروی ہے کہ بریرہ رضی اللہ عنہا کا خاوند غلام تھا اور ان ہی سے ایک روایت میں ہے کہ وہ آزاد تھا۔ پہلی روایت زیادہ پختہ ہے۔ بخاری میں ابن عباس رضی اللہ عنہا سے صحیح قول یہ ہے کہ وہ غلام تھا۔",
        "english": "Narrated 'Aisha (RA): Barira (RA) was given the choice (to remain married or to leave) her husband when she was set free. [Agreed upon]. A version by Muslim states: 'Her husband was a slave.' Another version by her says: 'He was a free man,' but the first one is more reliable. It is reported as Sahih from Ibn 'Abbas (RA) in Bukhari that he was a slave."
      }
    },

    {
      "id": 859,
      "name": {
        "arabic": "وَعَنِ اَلضَّحَّاكِ بْنِ فَيْرُوزَ الدَّيْلَمِيِّ , عَنْ أَبِيهِ قَالَ : { قُلْتُ : يَا رَسُولَ اَللَّهِ ! إِنِّي أَسْلَمْتُ وَتَحْتِي أُخْتَانِ , فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" طَلِّقْ أَيَّتَهُمَا شِئْتَ \" } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ إِلَّا النَّسَائِيَّ",
        "urdu": "سیدنا ضحاک بن فیروز دیلمی نے اپنے والد سے روایت کی ہے کہ میں نے عرض کیا: یا رسول اللہ! میں اسلام لے آیا ہوں اور میرے نکاح میں دو بہنیں ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ان دونوں میں سے جس کو چاہو (اپنے پاس رکھو اور دوسری کو) طلاق دے دو۔“",
        "english": "Narrated Ad-Dahhak bin Fairuz Ad-Dailami, on the authority of his father: I said, \"O Messenger of Allah! I have embraced Islam and I am married to two sisters.\" Allah's Messenger (ﷺ) said, \"Divorce whichever of them you wish (and keep the other).\""
      }
    },

    {
      "id": 860,
      "name": {
        "arabic": "وَعَنْ سَالِمٍ , عَنْ أَبِيهِ , { أَنَّ غَيْلَانَ بْنَ سَلَمَةَ أَسْلَمَ وَلَهُ عَشْرُ نِسْوَةٍ , فَأَسْلَمْنَ مَعَهُ , فَأَمَرَهُ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏- أَنْ يَتَخَيَّرَ مِنْهُنَّ أَرْبَعًا } رَوَاهُ أَحْمَدُ , وَاَلتِّرْمِذِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ , وَالْحَاكِمُ ، وَأَعَلَّهُ اَلْبُخَارِيُّ , وَأَبُو زُرْعَةَ , وَأَبُو حَاتِمٍ",
        "urdu": "سیدنا سالم نے اپنے باپ (عبداللہ بن عمر رضی اللہ عنہ) سے بیان کیا کہ غیلان بن سلمہ رضی اللہ عنہ نے اسلام قبول کیا تو اس وقت ان کی دس بیویاں تھیں۔ ان سب نے غیلان کے ساتھ اسلام قبول کر لیا۔ پس نبی کریم صلی اللہ علیہ وسلم نے غیلان سے فرمایا کہ ”ان میں سے چار کا انتخاب کر لو (اور باقی کو چھوڑ دو)۔“ اسے احمد اور ترمذی نے روایت کیا ہے۔ ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔ بخاری، ابوزرعہ اور ابوحاتم نے اس (کی سند) میں علت بتائی ہے۔",
        "english": "Narrated Salim, from his father (Ibn 'Umar): Ghailan bin Salama accepted Islam while he had ten wives who also accepted Islam with him. The Prophet (ﷺ) commanded him to choose four of them (and separate from the rest). [Reported by Ahmad and At-Tirmidhi. Ibn Hibban and Al-Hakim graded it Sahih, while Al-Bukhari, Abu Zur'ah, and Abu Hatim found a defect (I'lal) in its chain]."
      }
    },

    {
      "id": 861,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { رَدَّ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-اِبْنَتَهُ زَيْنَبَ عَلَى أَبِي الْعَاصِ بْنِ اَلرَّبِيعِ , بَعْدَ سِتِّ سِنِينَ بِالنِّكَاحِ اَلْأَوَّلِ , وَلَمْ يُحْدِثْ نِكَاحًا } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ إِلَّا النَّسَائِيَّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنی صاحبزادی سیدہ زینب رضی اللہ عنہا کو (ان کے شوہر) ابوالعاص بن ربیع کے پاس چھ سال بعد پہلے نکاح کی بنیاد پر ہی واپس بھیج دیا اور نیا نکاح نہیں پڑھایا۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) returned his daughter Zainab to Abu al-'As bin al-Rabi' after six years based on the first marriage, and he did not perform a new marriage contract."
      }
    },

    {
      "id": 862,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ , عَنْ أَبِيهِ , عَنْ جَدِّهِ { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- رَدَّ اِبْنَتَهُ زَيْنَبَ عَلَى أَبِي الْعَاصِ بِنِكَاحٍ جَدِيدٍ } قَالَ اَلتِّرْمِذِيُّ : حَدِيثُ اِبْنِ عَبَّاسٍ أَجْوَدُ إِسْنَادًا , وَالْعَمَلُ عَلَى حَدِيثِ عَمْرِو بْنِ شُعَيْبٍ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ نے اپنے والد سے انہوں نے اپنے دادا سے روایت کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنی بیٹی سیدہ زینب رضی اللہ عنہا کو ابوالعاص کے پاس جدید نکاح (اور نئے مہر) کے ساتھ واپس بھیجا۔ امام ترمذی نے کہا ہے کہ ابن عباس رضی اللہ عنہما سے مروی حدیث (جس میں پہلے نکاح پر برقرار رکھنے کا ذکر ہے) سند کے اعتبار سے زیادہ عمدہ ہے، مگر عمل عمرو بن شعیب کی حدیث پر ہے۔",
        "english": "Narrated 'Amr bin Shu'aib, from his father, from his grandfather: The Prophet (ﷺ) returned his daughter Zainab (RA) to Abu al-'As bin al-Rabi' with a new marriage contract. At-Tirmidhi said: The Hadith narrated by Ibn 'Abbas has a better chain, but the practice is according to the Hadith of 'Amr bin Shu'aib."
      }
    },

    {
      "id": 863,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { أَسْلَمَتْ اِمْرَأَةٌ , فَتَزَوَّجَتْ , فَجَاءَ زَوْجُهَا , فَقَالَ : يَا رَسُولَ اَللَّهِ ! إِنِّي كُنْتُ أَسْلَمْتُ , وَعَلِمَتْ بِإِسْلَامِي , فَانْتَزَعَهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مِنْ زَوْجِهَا اَلْآخَرِ , وَرَدَّهَا إِلَى زَوْجِهَا اَلْأَوَّلِ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَابْنُ مَاجَهْ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ ایک عورت نے اسلام قبول کیا۔ پھر اس نے (دوسرا) نکاح کر لیا، اتنے میں اس کا پہلا خاوند آ گیا اور عرض کیا: اے اللہ کے رسول! میں (اس سے پہلے ہی) اسلام قبول کر چکا تھا اور اسے میرے اسلام کا علم بھی تھا۔ چنانچہ رسول اللہ ﷺ نے اس عورت کو دوسرے شوہر سے لے کر پہلے خاوند کو واپس لوٹا دیا۔",
        "english": "Narrated Ibn 'Abbas (RA): A woman embraced Islam and then got married. Her first husband came and said: \"O Messenger of Allah! I had embraced Islam (before her) and she knew about my Islam.\" So, Allah's Messenger (ﷺ) took her away from her second husband and returned her to her first husband."
      }
    },

    {
      "id": 864,
      "name": {
        "arabic": "وَعَنْ زَيْدِ بْنِ كَعْبِ بْنِ عُجْرَةَ , عَنْ أَبِيهِ قَالَ : { تَزَوَّجَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلْعَالِيَةَ مِنْ بَنِي غِفَارٍ , فَلَمَّا دَخَلَتْ عَلَيْهِ وَوَضَعَتْ ثِيَابَهَا , رَأَى بِكَشْحِهَا بَيَاضًا فَقَالَ : \" اِلْبَسِي ثِيَابَكِ , وَالْحَقِي بِأَهْلِكِ \" , وَأَمَرَ لَهَا بِالصَّدَاقِ } رَوَاهُ اَلْحَاكِمُ",
        "urdu": "سیدنا زید بن کعب بن عجرہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بنو غفار کی عالیہ نامی خاتون سے نکاح کیا۔ جب وہ حضور صلی اللہ علیہ وسلم کے پاس (خلوت میں) داخل ہوئی تو آپ صلی اللہ علیہ وسلم نے اس کے پہلو میں سفیدی (برص/پھلبہری) کے داغ دیکھے۔ آپ ﷺ نے فرمایا: ”اپنے کپڑے پہن لو اور اپنے گھر والوں کے پاس چلی جاؤ“ اور آپ ﷺ نے اسے مہر دینے کا حکم فرمایا۔",
        "english": "Narrated Zaid bin Ka'b bin 'Ujrah, from his father: The Prophet (ﷺ) married al-'Aliyah of the Banu Ghifar. When she came in to him and he saw whiteness (leprosy/vitiligo) on her flank, he said: 'Put on your clothes and go back to your family.' And he ordered that her dower (Mahr) be given to her."
      }
    },

    {
      "id": 865,
      "name": {
        "arabic": "وَعَنْ سَعِيدِ بْنِ اَلْمُسَيَّبِ ; أَنَّ عُمَرَ بْنَ اَلْخَطَّابِ ‏- رضى الله عنه ‏- قَالَ : { أَيُّمَا رَجُلٍ تَزَوَّجَ اِمْرَأَةً , فَدَخَلَ بِهَا , فَوَجَدَهَا بَرْصَاءَ , أَوْ مَجْنُونَةً , أَوْ مَجْذُومَةً , فَلَهَا اَلصَّدَاقُ بِمَسِيسِهِ إِيَّاهَا , وَهُوَ لَهُ عَلَى مَنْ غَرَّهُ مِنْهَا } أَخْرَجَهُ سَعِيدُ بْنِ مَنْصُورٍ , وَمَالِكٌ , وَابْنُ أَبِي شَيْبَةَ",
        "urdu": "سیدنا سعید بن مسیب سے روایت ہے کہ سیدنا عمر رضی اللہ عنہ نے فرمایا: جو شخص کسی عورت سے نکاح کرے پھر اس سے ہمبستری کرے اور اسے معلوم ہو کہ وہ برص (پھلبہری) میں مبتلا ہے یا دیوانی ہے یا کوڑھ کے مرض میں مبتلا ہے، تو خاوند کے اسے چھونے کی بنا پر وہ پورے مہر کی مستحق ہے، اور خاوند یہ مہر اس شخص سے واپس لے گا جس نے اسے دھوکہ دیا۔ (سعید بن منصور، مالک، ابن ابی شیبہ)",
        "english": "Narrated Sa'id bin al-Musayyab: 'Umar bin al-Khattab (RA) said, \"If a man marries a woman and has intercourse with her, then finds her to be leprous, insane, or afflicted with leucoderma, she is entitled to the dower because of his having had relations with her. That dower is then a liability on the one who deceived him concerning her.\""
      }
    },

    {
      "id": 866,
      "name": {
        "arabic": "وَمِنْ طَرِيقِ سَعِيدِ بْنِ اَلْمُسَيَّبِ أَيْضًا قَالَ : { قَضَى [بِهِ] عُمَرُ فِي اَلْعِنِّينِ , أَنْ يُؤَجَّلَ سَنَةً }",
        "urdu": "اور سعید بن مسیب کے ہی واسطہ سے مروی ہے کہ سیدنا عمر رضی اللہ عنہ نے نامرد (عنین) آدمی کے لئے ایک سال کی مدت کا فیصلہ کیا۔ اس روایت کے راوی ثقہ ہیں۔",
        "english": "Narrated through Sa'id bin al-Musayyib: Umar (RA) gave a verdict in the case of an impotent man (al-Innin) that he should be given a period of one year (to seek treatment or regain potency)."
      }
    }
  ]
}