{
  "chapId": 88,
  "bookId": 10,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1075,
    "to": 1079
  },
  "hadiths": [
    {
      "id": 1075,
      "name": {
        "arabic": " عَنْ أَبِي بُرْدَةَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \" لَا يُجْلَدُ فَوْقَ عَشَرَةِ أَسْوَاطٍ, إِلَّا فِي حَدِّ مِنْ حُدُودِ اَللَّهِ\" } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": " سیدنا ابوبردہ انصاری رضی اللہ عنہ سے مروی ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو ارشاد فرماتے سنا ” حدود اللہ میں سے کسی حد کے سوا دس کوڑوں سے زیادہ سزا نہ دی جائے۔“",
        "english": "Narrated Abu Burdah al-Ansari (RA): He heard the Messenger of Allah (ﷺ) saying: 'No one should be given more than ten lashes of a whip, except in the case of one of the prescribed penalties (Hudud) of Allah.'"
      }
    },

    {
      "id": 1076,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَقِيلُوا ذَوِي اَلْهَيْئَاتِ عَثَرَاتِهِمْ إِلَّا اَلْحُدُودَ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”صاحبِ عزت و شرافت لوگوں کی لغزشوں سے درگزر کیا کرو، سوائے حدود (الٰہی) کے۔“ اسے ابوداؤد اور نسائی نے روایت کیا ہے۔",
        "english": "Narrated 'Aishah (R.A): The Prophet (ﷺ) said: 'Pardon the slips of people of good reputation (those who do not usually commit crimes), except in the case of the Hudud (prescribed legal punishments).'"
      }
    },

    {
      "id": 1077,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: { مَا كُنْتُ لِأُقِيمَ عَلَى أَحَدٍ حَدًّا, فَيَمُوتُ, فَأَجِدُ فِي نَفْسِي, إِلَّا شَارِبَ الْخَمْرِ; فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ } أَخْرَجَهُ اَلْبُخَارِيُّ ",
        "urdu": " سیدنا على رضی اللہ عنہ سے روايت ہے كہ میں کسی پر ایسی حد نافذ نہیں کروں گا کہ وہ اس سے مر جائے اور میں اس کا غم اپنے دل میں محسوس کروں سوائے شرابی کے، اگر وہ سزا کے دوران مر جائے تو میں اس کی دیت ادا کروں گا۔ (بخاری)",
        "english": "Narrated 'Ali (RA): I would not feel sorry for anyone who dies while I am executing a prescribed penalty (Hadd) on him, except for the one who drinks wine; for if he were to die, I would pay blood money (Diyah) for him."
      }
    },

    {
      "id": 1078,
      "name": {
        "arabic": "وَعَنْ سَعِيدِ بْنِ زَيْدٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ } رَوَاهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا سعید بن زید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اپنے مال کی حفاظت کرتا ہوا مارا جائے وہ شہید ہے۔“ اسے چاروں (اصحابِ سنن) نے روایت کیا ہے اور امام ترمذی نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Sa'id bin Zaid (R.A): The Messenger of Allah (ﷺ) said: 'He who is killed while protecting his property is a martyr.'"
      }
    },

    {
      "id": 1079,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ خَبَّابٍ [ قَالَ ]: سَمِعْتَ أَبِي ‏- رضى الله عنه ‏- يَقُولُ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \" تَكُونُ فِتَنٌ, فَكُنْ فِيهَا عَبْدَ اَللَّهِ اَلْمَقْتُولَ, وَلَا تَكُنْ اَلْقَاتِلَ\" } أَخْرَجَهُ ابْنُ أَبِي خَيْثَمَةَ.‏ وَاَلدَّارَقُطْنِيُّ وَأَخْرَجَ أَحْمَدُ نَحْوَهُ: عَنْ خَالِدِ بْنِ عُرْفُطَةَ ‏- رضى الله عنه ‏- ",
        "urdu": "سیدنا عبداللہ بن خباب سے روایت ہے کہ میں نے اپنے والد کو بیان کرتے سنا وہ کہتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ارشاد فرماتے سنا ہے کہ ”عنقریب فتنے رونما ہوں گے۔ اے اللہ کے بندے! تو ان میں مقتول بن جانا، قاتل نہ بننا۔“",
        "english": "Narrated 'Abdullah bin Khabbab: I heard my father (RA) saying that he heard the Messenger of Allah (ﷺ) say: 'There will be tribulations (fitna). In them, be the slain slave of Allah, and do not be the killer.'"
      }
    }
  ]
}
