{
  "chapId": 93,
  "bookId": 12,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1147,
    "to": 1159
  },
  "hadiths": [
    {
      "id": 1147,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنِ اتَّخَذَ كَلْباً, إِلَّا كَلْبَ مَاشِيَةٍ, أَوْ صَيْدٍ, أَوْ زَرْعٍ, اِنْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس کسی نے مال مویشی کے تحفظ کیلئے (رکھے گئے کتے) یا شکاری کتے یا زراعت کی دیکھ بھال و حفاظت کرنے والے کتے کے علاوہ دوسرا کوئی کتا (شوقیہ طور پر) رکھا تو اس کے ثواب میں سے ہر روز ایک قیراط ثواب کم ہو جاتا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'Whoever keeps a dog, except a dog for guarding livestock, hunting, or farming, a Qirat (a large measure) of his reward will be deducted every day.' [Agreed upon]."
      }
    },

    {
      "id": 1148,
      "name": {
        "arabic": "وَعَنْ عَدِيِّ بنِ حَاتِمٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ لِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"إِذَا أَرْسَلَتَ كَلْبَكَ فَاذْكُرِ اسْمَ اَللَّهِ, فَإِنْ أَمْسَكَ عَلَيْكَ فَأَدْرَكْتَهُ حَيًّا فَاذْبَحْهُ, وَإِنْ أَدْرَكْتَهُ قَدْ قُتِلَ وَلَمْ يُؤْكَلْ مِنْهُ فَكُلْهُ, وَإِنْ وَجَدْتَ مَعَ كَلْبِكَ كَلْبًا غَيْرَهُ وَقَدْ قُتِلَ فَلَا تَأْكُلْ: فَإِنَّكَ لَا تَدْرِي أَيَّهُمَا قَتَلَهُ, وَإِنْ رَمَيْتَ سَهْمَكَ فَاذْكُرِ اسْمَ اَللَّهِ, فَإِنْ غَابَ عَنْكَ يَوْماً, فَلَمْ تَجِدْ فِيهِ إِلَّا أَثَرَ سَهْمِكَ, فَكُلْ إِنْ شِئْتَ, وَإِنْ وَجَدْتَهُ غَرِيقاً فِي اَلْمَاءِ, فَلَا تَأْكُلْ\" } مُتَّفَقٌ عَلَيْهِ, وَهَذَا لَفْظُ مُسْلِمٍ",
        "urdu": "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ”جب تو اپنا (شکاری) کتا چھوڑے تو اللہ کا نام لے لیا کر، پھر اگر وہ تیرے لیے شکار پکڑ رکھے اور تو اسے زندہ پا لے تو اسے ذبح کر لے۔ اور اگر تو اسے اس حال میں پائے کہ وہ مارا جا چکا ہو اور کتے نے اس میں سے کچھ نہ کھایا ہو تو اسے کھا لے۔ اور اگر تو اپنے کتے کے ساتھ دوسرا کتا پائے اور شکار مرا ہوا ہو تو اسے نہ کھا، کیونکہ تجھے نہیں معلوم کہ ان میں سے کس نے اسے مارا ہے۔ اور اگر تو اپنا تیر چھوڑے تو اللہ کا نام لے، پھر اگر وہ (شکار) تجھ سے ایک دن اوجھل رہے اور تو اس میں اپنے تیر کے سوا کوئی اور نشان نہ پائے تو اگر چاہے تو اسے کھا لے۔ اور اگر تو اسے پانی میں ڈوبا ہوا پائے تو اسے نہ کھا۔“",
        "english": "Narrated 'Adi bin Hatim (R.A): Allah's Messenger (ﷺ) said to me: 'When you set off your dog, mention the name of Allah. If he catches something for you and you find it alive, then slaughter it. If you find it has been killed and the dog has not eaten any of it, then eat it. But if you find another dog with yours and the game has been killed, do not eat it, for you do not know which of them killed it. And when you shoot your arrow, mention the name of Allah. If the game disappears from you for a day and you find nothing but the mark of your arrow, eat it if you wish. But if you find it drowned in water, do not eat it.'"
      }
    },

    {
      "id": 1149,
      "name": {
        "arabic": "وَعَنْ عَدِيِّ بْنِ حَاتِمٍ رضي الله عنه قَالَ: سَأَلْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ اَلْمِعْرَاضِ فَقَالَ: «إِذَا أَصَبْتَ بِحَدِّهِ فَكُلْ، وَإِذَا أَصَبْتَ بِعَرْضِهِ فَقُتِلَ، فَإِنَّهُ وَقِيذٌ، فَلَا تَأْكُلْ» رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا عدی بن حاتم رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے بغیر پھل کے تیر (معراض) کے شکار کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم اسے اس کی دھار کی جانب سے مارو (اور وہ جانور کو زخمی کر دے) تو اسے کھا لو، اور اگر وہ اسے اپنی چوڑائی کی طرف سے لگے اور جانور مر جائے تو وہ 'موقوذہ' (چوٹ سے مرنے والا) ہے، لہٰذا اسے نہ کھاؤ۔“",
        "english": "Narrated ‘Adi bin Hatim (RA): I asked the Messenger of Allah (SAW) about the game killed by a Mi'rad (a featherless arrow with a sharp point). He said: 'If you hit it with its sharp edge, eat it; but if you hit it with its broad side and it is killed, then it is Waqidh (killed by a heavy blow), so do not eat it.'"
      }
    },

    {
      "id": 1150,
      "name": {
        "arabic": "وَعَنْ أَبِي ثَعْلَبَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" إِذَا رَمَيْتَ بِسَهْمِكَ, فَغَابَ عَنْكَ, فَأَدْرَكْتَهُ فَكُلْهُ, مَا لَمْ يُنْتِنْ\" } أَخْرَجَهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوثعلبہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جب تم اپنا تیر مارو اور وہ (شکار) تم سے اوجھل ہو جائے، پھر تم اسے (مردہ حالت میں) پا لو تو اسے کھا لو، جب تک کہ وہ بدبودار نہ ہوا ہو۔“",
        "english": "Narrated Abu Tha'laba (R.A): The Prophet (ﷺ) said: 'When you shoot your arrow and the game disappears from you, but you later find it (dead), eat it as long as it has not become putrid (rotten).'"
      }
    },

    {
      "id": 1151,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ قَوْمًا قَالُوا لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-إِنَّ قَوْماً يَأْتُونَنَا بِاللَّحْمِ, لَا نَدْرِي أَذُكِرَ اِسْمُ اَللَّهِ عَلَيْهِ أَمْ لَا? فَقَالَ: \" سَمُّوا اَللَّهَ عَلَيْهِ أَنْتُمْ, وَكُلُوهُ\" } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ کچھ لوگوں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ لوگ ہمارے پاس گوشت لاتے ہیں جس کے متعلق ہمیں معلوم نہیں کہ اس پر ذبح کے وقت اللہ کا نام لیا گیا ہے یا نہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تم خود اس پر اللہ کا نام لو (بسم اللہ پڑھو) اور اسے کھا لو۔“ (بخاری)",
        "english": "Narrated 'Aisha (RA): A group of people said to the Prophet (ﷺ), 'Some people bring us meat and we do not know whether they mentioned the name of Allah over it or not.' He replied, 'Mention the name of Allah over it yourselves and eat it.' [Reported by Al-Bukhari]."
      }
    },

    {
      "id": 1152,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بنِ مُغَفَّلٍ الْمُزَنِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنِ اَلْخَذْفِ, وَقَالَ: \"إِنَّهَا لَا تَصِيدُ صَيْدًا, وَلَا تَنْكَأُ عَدُوًّا, وَلَكِنَّهَا تَكْسِرُ اَلسِّنَّ, وَتَفْقَأُ اَلْعَيْنَ\" } مُتَّفَقٌ عَلَيْهِ.‏ وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا عبداللہ بن مغفل مزنی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے کنکریاں مارنے (خَذْف) سے منع فرمایا اور فرمایا: ”نہ تو اس سے شکار کیا جا سکتا ہے اور نہ ہی یہ دشمن کو زخمی کر سکتی ہے، البتہ یہ کسی کا دانت توڑ دیتی ہے یا آنکھ پھوڑ دیتی ہے۔“",
        "english": "Narrated 'Abdullah bin Mughaffal al-Muzani (R.A): Allah's Messenger (ﷺ) forbade Al-Khadhf (flinging small pebbles with the fingers), and said: 'It neither catches game nor injures an enemy, but it breaks teeth and puts out eyes.' [Agreed upon; the wording is Muslim's]."
      }
    },

    {
      "id": 1153,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم قَالَ: «لَا تَتَّخِذُوا شَيْئاً فِيهِ اَلرُّوحُ غَرَضاً» رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”کسی ایسی چیز کو جس میں جان ہو (ذی روح)، نشانہ بنا کر نہ مارو۔“",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (SAW) said: \"Do not take anything which has a soul as a target (for practicing your marksmanship).\""
      }
    },

    {
      "id": 1154,
      "name": {
        "arabic": "وَعَنْ كَعْبِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنّ امْرَأَةً ذَبَحَتْ شَاةً بِحَجَرٍ, فَسُئِلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَنْ ذَلِكَ, فَأَمَرَ بِأَكْلِهَا } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا کعب بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک عورت نے پتھر (کی دھار) سے ایک بکری کو ذبح کر دیا۔ نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا گیا تو آپ ﷺ نے اسے کھانے کا حکم فرمایا۔ (بخاری)",
        "english": "Narrated Ka'b bin Malik (R.A): A woman slaughtered a sheep with a stone. The Prophet (ﷺ) was asked about that and he ordered that it should be eaten. [Reported by al-Bukhari]."
      }
    },

    {
      "id": 1155,
      "name": {
        "arabic": "وَعَنْ رَافِعِ بْنِ خَدِيجٍ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَا أُنْهِرَ اَلدَّمُ, وَذُكِرَ اِسْمُ اَللَّهِ عَلَيْهِ, فَكُلْ لَيْسَ اَلسِّنَّ وَالظُّفْرَ; أَمَّا اَلسِّنُّ; فَعَظْمٌ; وَأَمَّا اَلظُّفُرُ: فَمُدَى اَلْحَبَشِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا رافع بن خدیج رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ ” جو چیز خون کو بہا دے اور اسے اللہ کا نام لے کر ذبح کیا گیا ہو تو اس جانور کو کھا لو۔ ذبح کرنے کا آلہ دانت اور ناخن نہیں ہونا چاہیے کیونکہ دانت تو ہڈی ہے اور ناخن حبشیوں کی چھری ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Rafi' bin Khadij (RA): The Prophet (ﷺ) said: 'Eat what is slaughtered by anything that causes the blood to flow, provided the name of Allah has been mentioned over it. But do not use teeth or nails; for the tooth is a bone and the nail is the knife used by the Ethiopians (Abyssinians).'"
      }
    },

    {
      "id": 1156,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: «نَهَى رَسُولُ اَللَّهِ صلى الله عليه وسلم أَنْ يُقْتَلَ شَيْءٌ مِنَ اَلدَّوَابِّ صَبْراً» رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کسی بھی جانور کو باندھ کر یا روک کر (تڑپا تڑپا کر) قتل کرنے سے منع فرمایا ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): The Messenger of Allah (SAW) forbade that any beast (animal) should be killed while being confined (tied up and used as a target or killed slowly)."
      }
    },

    {
      "id": 1157,
      "name": {
        "arabic": "وَعَنْ شَدَّادِ بْنِ أَوْسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ كَتَبَ اَلْإِحْسَانَ عَلَى كُلِّ شَيْءٍ, فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا اَلْقِتْلَةَ, وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا اَلذِّبْحَةَ, وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ, وَلْيُرِحْ ذَبِيحَتَهُ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا شداد بن اوس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اللہ عزوجل نے ہر چیز پر احسان کرنا فرض قرار دیا ہے لہذا جب تم قتل کرو تو عمدہ و اچھے طریقے سے قتل کرو اور جب تم کسی جانور کو ذبح کرنے لگو تو احسن طریقہ سے ذبح کرو اور تم میں سے ہر کسی کو چاہیئے کہ اپنی چھری کو تیز کر لے اور اپنے ذبیحہ کو آرام پہنچائے۔“ (مسلم)",
        "english": "Narrated Shaddad bin Aws (RA): The Messenger of Allah (ﷺ) said: 'Verily Allah has prescribed Ihsan (proficiency, goodness) in all things. So if you kill, kill well; and if you slaughter, slaughter well. Let each one of you sharpen his blade and let him give ease to the animal he is slaughtering.'"
      }
    },

    {
      "id": 1158,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"ذَكَاةُ اَلْجَنِينِ ذَكَاةُ أُمِّهِ\" } رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”ماں کو ذبح کرنا ہی اس کے پیٹ کے بچے کا ذبح ہونا ہے۔“ (یعنی ماں کا ذبح ہونا بچے کے لیے کافی ہے)۔ اسے احمد نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Abu Sa'id al-Khudri (R.A): The Messenger of Allah (ﷺ) said: 'Slaughtering the mother (of a fetus) serves as slaughtering the fetus too.' [Reported by Ahmad; Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1159,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم قَالَ: «اَلْمُسْلِمُ يَكْفِيهِ اِسْمُهُ، فَإِنْ نَسِيَ أَنْ يُسَمِّيَ حِينَ يَذْبَحُ، فَلْيُسَمِّ، ثُمَّ لِيَأْكُلْ» أَخْرَجَهُ اَلدَّارَقُطْنِيُّ. وَأَخْرَجَهُ عَبْدُ اَلرَّزَّاقِ بِإِسْنَادٍ صَحِيحٍ إِلَى اِبْنِ عَبَّاسٍ مَوْقُوفاً عَلَيْهِ. وَلَهُ شَاهِدٌ عِنْدَ أَبِي دَاوُدَ فِي مَرَاسِيلِهِ بِلَفْظِ: «ذَبِيحَةُ اَلْمُسْلِمِ حَلَالٌ، ذَكَرَ اِسْمَ اَللَّهِ عَلَيْهَا أَوْ لَمْ يَذْكُرْ»",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”مسلم کے لیے اللہ تعالیٰ کا نام (جو اس کے دل میں ہے) ہی کافی ہے۔ پس اگر وہ ذبح کرتے وقت اللہ کا نام لینا بھول جائے، تو (کھاتے وقت) بسم اللہ پڑھ لے اور کھا لے۔“ اسے دارقطنی نے روایت کیا ہے۔ اور عبد الرزاق نے اسے صحیح سند کے ساتھ ابن عباس رضی اللہ عنہما سے موقوفاً روایت کیا ہے۔ اس کا ایک شاہد ابو داؤد کی مراسیل میں ان الفاظ کے ساتھ ہے: ”مسلم کا ذبیحہ حلال ہے، خواہ اس نے اللہ کا نام لیا ہو یا نہ لیا ہو۔“",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (SAW) said: \"The name of Allah which is in the heart of a Muslim is sufficient for him. If he forgets to mention Allah's name while slaughtering, let him mention His name (before eating) and then eat.\" [Reported by ad-Daraqutni]. Abdur-Razzaq reported it with a Sahih chain as a Mauquf narration (statement of Ibn Abbas). It has a supporting narration in the Marasil of Abu Dawud: \"The slaughtered animal of a Muslim is lawful, whether he mentions the name of Allah or not.\""
      }
    }
  ]
}
