{
  "chapId": 12,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 144,
    "to": 159
  },
  "hadiths": [
    {
      "id": 144,
      "name": {
        "arabic": " عَنْ عَبْدِ اَللَّهِ بْنِ زَيْدِ بْنِ عَبْدِ رَبِّهِ ‏- رضى الله عنه ‏- قَالَ: { طَافَ بِي ‏-وَأَنَا نَائِمٌ‏- رَجُلٌ فَقَالَ: تَقُولُ: \"اَللَّهُ أَكْبَرَ اَللَّهُ أَكْبَرُ, فَذَكَرَ اَلْآذَانَ ‏- بِتَرْبِيع اَلتَّكْبِيرِ بِغَيْرِ تَرْجِيعٍ, وَالْإِقَامَةَ فُرَادَى, إِلَّا قَدْ قَامَتِ اَلصَّلَاةُ ‏- قَالَ: فَلَمَّا أَصْبَحْتُ أَتَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \"إِنَّهَا لَرُؤْيَا حَقٍّ.‏.‏.‏\" } اَلْحَدِيثَ.‏ أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ خُزَيْمَةَ  وَزَادَ أَحْمَدُ فِي آخِرِهِ قِصَّةَ قَوْلِ بِلَالٍ فِي آذَانِ اَلْفَجْرِ: { اَلصَّلَاةُ خَيْرٌ مِنَ اَلنَّوْمِ }  وَلِابْنِ خُزَيْمَةَ: عَنْ أَنَسٍ قَالَ: { مِنْ اَلسُّنَّةِ إِذَا قَالَ اَلْمُؤَذِّنُ فِي اَلْفَجْرِ: حَيٌّ عَلَى اَلْفَلَاحِ, قَالَ: اَلصَّلَاةُ خَيْرٌ مِنَ اَلنَّوْمِ }",
        "urdu": " سیدنا عبداللہ بن زید بن عبدربہ رضی اللہ عنہ نے فرمایا کہ خواب میں مجھے ایک آدمی ملا جس نے مجھے کہا کہ کہو «الله أكبر الله أكبر» پھر اس نے ساری اذان کہی، چار مرتبہ «الله أكبر» کہا۔ بغیر ترجیع کے اور اقامت میں صرف ایک ایک مرتبہ کہا، مگر «قد قامت الصلاة» کو دو مرتبہ کہا۔ صبح جب میں بیدار ہوا تو میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا (اور اپنا خواب آپ صلی اللہ علیہ وسلم کو سنایا) آپ صلی اللہ علیہ وسلم نے فرمایا ”یقیناً یہ خواب سچا ہے۔“ اس حدیث کو احمد اور ابوداؤد نے روایت کیا ہے۔ ترمذی اور ابن خزیمہ نے صحیح قرار دیا ہے۔ احمد نے اس روایت کے آخر میں سیدنا بلال رضی اللہ عنہ کی فجر کی اذان میں «الصلاة خير من النوم» کا قصہ بھی مزید بیان کیا ہے اور ابن خزیمہ میں سیدنا انس رضی اللہ عنہ سے ہے کہ انہوں نے فرمایا سنت ہے کہ جب مؤذن صبح کی اذان میں «حي على الفلاح» کہے تو وہ کہے «الصلاة خير من النوم» ۔",
        "english": "Narrated 'Abdullāh ibn Zayd ibn 'Abd Rabbih (RA): He said: 'A man went around me while I was sleeping and said, 'Say: Allāhu Akbar, Allāhu Akbar...' and then mentioned the Adhān (Call to Prayer)—with the Takbīr (Allāhu Akbar) said four times, without Tarjī' (repeating the Shahādah quietly), and the Iqāmah (Call to Stand) said once, except for Qad qāmat aṣ-ṣalāh (Prayer is about to begin) said twice. He said: 'When morning came, I went to the Messenger of Allah (ﷺ), and he said: 'Indeed, it is a true dream...' (the rest of the Hadith).' Reported by Ahmad and Abu Dawud, and authenticated by At-Tirmidhī and Ibn Khuzaymah. Ahmad added at the end the account of Bilāl's saying in the Fajr Adhān: 'Aṣ-ṣalātu khayrun min an-nawm (Prayer is better than sleep).' And for Ibn Khuzaymah, from Anas, who said: 'It is from the Sunnah that when the Mu'adhdhin says Ḥayya 'ala al-falāḥ (Come to success) in the Fajr (dawn) Adhān, he says: Aṣ-ṣalātu khayrun min an-nawm.'"
      }
    },

    {
      "id": 145,
      "name": {
        "arabic": " عَنْ أَبِي مَحْذُورَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَلَّمَهُ اَلْآذَانَ, فَذَكَرَ فِيهِ اَلتَّرْجِيعَ } أَخْرَجَهُ مُسْلِمٌ.‏ وَلَكِنْ ذَكَرَ اَلتَّكْبِيرَ فِي أَوَّلِهِ مَرَّتَيْنِ فَقَطْ  وَرَوَاهُ اَلْخَمْسَةُ فَذَكَرُوهُ مُرَبَّعًا ",
        "urdu": "سیدنا ابومحذورہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو اذان سکھائی۔ اس میں انہوں نے ترجیع کا ذکر کیا ہے۔ مسلم نے روایت کیا ہے لیکن اس میں پہلی دفعہ «الله أكبر» کو صرف دو مرتبہ کہنے کا ذکر ہے۔ ابومحذورہ رضی اللہ عنہ سے مروی حدیث کو پانچوں نے روایت کیا ہے اور انہوں نے «الله أكبر» کو پہلی دفعہ چار مرتبہ کہنے کا ذکر کیا ہے۔  ",
        "english": "Narrated Abu Maḥdhūrah (RA): 'The Prophet (ﷺ) taught him the Adhān, and he mentioned Tarjī' (repetition of the Shahādah) in it.' Reported by Muslim, but he mentioned the Takbīr (Allāhu Akbar) at the beginning only twice. The five compilers (Ahmad, Abu Dawud, At-Tirmidhī, An-Nasa'ī, Ibn Majah) narrated it, and they mentioned the Takbīr as four times (Murabba'an)."
      }
    },

    {
      "id": 146,
      "name": {
        "arabic": " وَعَنْ أَنَسِ]بْنِ مَالِكٍ] ‏- رضى الله عنه ‏- قَالَ: { أُمِرَ بِلَالٌ أَنْ يَشْفَعَ اَلْآذَانَ, وَيُوتِرَ اَلْإِقَامَةَ, إِلَّا اَلْإِقَامَةَ, يَعْنِي قَوْلَهُ: قَدْ قَامَتِ اَلصَّلَاةُ } مُتَّفَقٌ عَلَيْهِ, وَلَمْ يَذْكُرْ مُسْلِمٌ اَلِاسْتِثْنَاءَ  وَلِلنَّسَائِيِّ: { أَمَرَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِلَالاً }",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ بلال رضی اللہ عنہ کو اذان کے کلمات دو، دو مرتبہ اور تکبیر «قد قامت الصلاة» کے علاوہ باقی جملہ کلمات کو ایک، ایک مرتبہ کہنے کا حکم دیا گیا (بخاری و مسلم) البتہ مسلم نے «قد قامت الصلاة» کے استثناء کا ذکر نہیں کیا اور نسائی میں ہے نبی کریم صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ کو حکم دیا تھا۔ ",
        "english": "Narrated Anas ibn Mālik (RA): 'Bilāl (RA) was commanded to say the Adhān phrases twice (Yashfa' al-Adhān), and the Iqāmah phrases once (Yūtir al-Iqāmah), except for the Iqāmah (itself), meaning his saying: Qad qāmat aṣ-ṣalāh (Prayer is about to begin).' [Agreed upon (Al-Bukhārī and Muslim)], but Muslim did not mention the exception. And for An-Nasā'ī: 'The Prophet (ﷺ) commanded Bilāl (RA).'"
      }
    },

    {
      "id": 147,
      "name": {
        "arabic": " عَنْ أَبِي جُحَيْفَةَ ‏- رضى الله عنه ‏- قَالَ: { رَأَيْتُ بِلَالاً يُؤَذِّنُ وَأَتَتَبَّعُ فَاهُ, هَاهُنَا وَهَاهُنَا, وَإِصْبَعَاهُ فِي أُذُنَيْهِ } رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ وَلِابْنِ مَاجَهْ: وَجَعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ وَلِأَبِي دَاوُدَ: { لَوَى عُنُقَهُ, لَمَّا بَلَغَ \"حَيَّ عَلَى اَلصَّلَاةِ \" يَمِينًا وَشِمَالاً وَلَمْ يَسْتَدِرْ } وَأَصْلِهِ فِي اَلصَّحِيحَيْنِ",
        "urdu": " سیدنا ابوجحیفہ رضی اللہ عنہ فرماتے ہیں کہ میں نے بلال رضی اللہ عنہ کو اذان دیتے دیکھا کہ وہ اپنا چہرہ، ادھر ادھر پھیرتے تھے۔ اس وقت ان کی دونوں انگلیاں (انگشت ہائے شہادت) ان کے کانوں میں تھیں۔ احمد اور ترمذی نے اسے روایت کیا ہے اور ترمذی نے اسے صحیح قرار دیا ہے۔ ابن ماجہ کی روایت میں ہے کہ انہوں نے اپنی انگلیاں اپنے کانوں میں داخل کر لیں اور ابوداؤد میں ہے کہ جب «حي على الصلاة» کہتے تو اپنے دائیں بائیں ذرا رخ موڑ لیتے بالکل گھومتے نہیں تھے۔ اس کی اصل صحیحین میں ہے۔ ",
        "english": "Narrated Abū Juḥayfah (RA): 'I saw Bilāl calling the Adhān, and I was following his mouth, turning here and here (left and right), and his fingers were in his ears.' Reported by Ahmad and At-Tirmidhī, and At-Tirmidhī graded it as Sahih (authentic). For Ibn Mājah: 'And he put his fingers into his ears.' And for Abu Dawud: 'He twisted his neck when he reached 'Ḥayya 'ala aṣ-ṣalāh' (Come to prayer) to the right and left, and he did not turn completely.' The origin of this narration is in Al-Ṣaḥīḥayn (Al-Bukhārī and Muslim)."
      }
    },

    {
      "id": 148,
      "name": {
        "arabic": " وَعَنْ أَبِي مَحْذُورَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَعْجَبَهُ صَوْتُهُ, فَعَلَّمَهُ اَلْآذَانَ } رَوَاهُ اِبْنُ خُزَيْمَةَ",
        "urdu": "سیدنا ابومحذورہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کو ان کی آواز بہت پسند آئی۔ چنانچہ آپ صلی اللہ علیہ وسلم نے انہیں (ابومحذورہ رضی اللہ عنہ کو) اذان کی تعلیم خود دی (اذان سکھائی)۔ (ابن خزیمہ)  ",
        "english": "Narrated Abu Maḥdhūrah (RA): 'The Prophet (ﷺ) was impressed by his voice, so he taught him the Adhān.' Reported by Ibn Khuzaymah."
      }
    },

    {
      "id": 149,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { صَلَّيْتُ مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-اَلْعِيدَيْنِ, غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ, بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ } رَوَاهُ مُسْلِمٌ وَنَحْوُهُ فِي اَلْمُتَّفَقِ: عَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, وَغَيْرُهُ  ",
        "urdu": "سیدنا جابر بن سمرہ رضی اللہ عنہ سے مروی ہے کہ میں نے ایک، دو مرتبہ نہیں متعدد مرتبہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز عیدین پڑھی ہے۔ اس کیلئے نہ اذان کہی جاتی تھی اور نہ ہی اقامت۔ اس روایت کو مسلم نے روایت کیا ہے اور بخاری و مسلم میں سیدنا ابن عباس رضی اللہ عنہما سے بھی اسی طرح مروی ہے۔ ",
        "english": "Narrated Jābir ibn Samurah (RA): 'I prayed the two 'Eid prayers with the Prophet (ﷺ), not just once or twice, without an Adhān (Call to Prayer) or an Iqāmah (Call to Stand).' Reported by Muslim. And similar to it is reported in Al-Muttafaq (Al-Bukhārī and Muslim) from Ibn 'Abbās (RA) and others."
      }
    },

    {
      "id": 150,
      "name": {
        "arabic": " وَعَنْ أَبِي قَتَادَةٌ فِي اَلْحَدِيثِ اَلطَّوِيلِ, { فِي نَوْمهُمْ عَنْ اَلصَّلَاةِ ‏- ثُمَّ أَذَّنَ بِلَالٌ, فَصَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَمَا كَانَ يَصْنَعُ كُلَّ يَوْمٍ } رَوَاهُ مُسْلِمٌ وَلَهُ عَنْ جَابِرٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَتَى اَلْمُزْدَلِفَةَ فَصَلَّى بِهَا اَلْمَغْرِبَ وَالْعِشَاءَ, بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ } وَلَهُ عَنْ اِبْنِ عُمَرَ: { جَمَعَ بَيْنَ اَلْمَغْرِبِ وَالْعِشَاءِ بِإِقَامَةٍ وَاحِدَةٍ } زَادَ أَبُو دَاوُدَ: { لِكُلِّ صَلَاةٍ }  وَفِي رِوَايَةِ لَهُ: { وَلَمْ يُنَادِ فِي وَاحِدَةٍ مِنْهُمَا }",
        "urdu": " سیدنا ابوقتادہ رضی اللہ عنہ سے (ایک لمبی حدیث جس میں دوران سفر غلبہ نیند اور تھکاوٹ سفر کی وجہ سے سو جانے کا ذکر ہے) مروی ہے، جب نیند سے بیداری ہوئی تو پھر بلال رضی اللہ عنہ نے اذان کہی اور نبی کریم صلی اللہ علیہ وسلم نے اسی طرح نماز پڑھی جس طرح روزانہ پڑھتے تھے۔ (مسلم) اور مسلم میں سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم مزدلفہ میں پہنچے تو وہاں آپ صلی اللہ علیہ وسلم نے مغرب اور عشاء کی نماز ایک اذان اور دو اقامتوں سے پڑھی اور مسلم ہی میں ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مغرب اور عشاء دونوں نمازیں جمع کر کے ایک ہی اقامت کے ساتھ ادا فرمائیں اور ابوداؤد نے اتنا اضافہ نقل کیا ہے کہ ہر نماز کیلئے تکبیر کہی گئی اور اسی کی ایک روایت میں منقول ہے کہ ان دونوں نمازوں میں سے کسی کے لئے بھی اذان نہیں کہی گئی۔",
        "english": "Narrated Abū Qatādah (RA) in a long Hadith about sleeping through the prayer: '...Then Bilāl called the Adhān, and the Messenger of Allah (ﷺ) prayed as he used to do every day.' Reported by Muslim. And for Muslim, from Jābir (RA): 'The Prophet (ﷺ) came to Al-Muzdalifah and prayed Maghrib and 'Ishā' there with one Adhān and two Iqāmahs.' And for Muslim, from Ibn 'Umar: 'He combined Maghrib and 'Ishā' with one Iqāmah.' Abū Dawūd added: 'for every prayer.' And in a narration for him: 'and he did not call the Adhān for either of them.'"
      }
    },

    {
      "id": 151,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ, وَعَائِشَةَ قَالَا: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ إِنَّ بِلَالاً يُؤَذِّنُ بِلَيْلٍ, فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ اِبْنُ أُمِّ مَكْتُومٍ', وَكَانَ رَجُلاً أَعْمَى لَا يُنَادِي, حَتَّى يُقَالَ لَهُ: أَصْبَحْتَ, أَصْبَحْتَ } مُتَّفَقٌ عَلَيْهِ وَفِي آخِرِهِ إِدْرَاجٌ  ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما اور سیدہ عائشہ رضی اللہ عنہا دونوں سے مروی ہے کہ رسول اللہ صلی اللہ نے فرمایا ”بلال (رضی اللہ عنہ) رات کو اذان کہتا ہے تم لوگ ابن ام مکتوم (رضی اللہ عنہ) کی اذان تک کھا پی لیا کرو۔ “ ابن ام مکتوم (رضی اللہ عنہ) نابینا آدمی تھے جب تک لوگ انہیں یہ نہ کہتے کہ (صبح ہو گئی ‘ صبح ہو گئی) وہ اذان نہ کہتے تھے۔ (بخاری و مسلم)  ",
        "english": "Narrated Ibn 'Umar and 'Ā'ishah (RA): The Messenger of Allah (ﷺ) said: 'Indeed, Bilāl calls the Adhān by night, so eat and drink until Ibn Umm Maktūm calls the Adhān.' And he (Ibn Umm Maktūm) was a blind man who did not call the Adhān until it was said to him: 'The morning has broken! The morning has broken!' [Agreed upon (Al-Bukhārī and Muslim)] and there is an insertion (Idrāj) at the end of it."
      }
    },

    {
      "id": 152,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ; { إِنَّ بِلَالاً أَذَّنَ قَبْلَ اَلْفَجْرِ, فَأَمَرَهُ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَنْ يَرْجِعَ, فَيُنَادِيَ: \"أَلَا إِنَّ اَلْعَبْدَ نَامَ } رَوَاهُ أَبُو دَاوُدَ وَضَعَّفَهُ ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ (ایک روز) بلال رضی اللہ عنہ نے طلوع فجر سے پہلے ہی اذان کہہ دی تو نبی کریم صلی اللہ علیہ و سلم نے انہیں دوبارہ اذان کہنے کا حکم دیا (تو بلال رضی اللہ عنہ نے یہ الفاظ کہہ کر منادی کی) ”خبردار! سنو بندہ کو نیند آ گئی تھی۔“ ابوداؤد نے اسے روایت کیا اور ضعیف قرار دیا۔ ",
        "english": "Narrated Ibn 'Umar (RA): 'Bilāl called the Adhān before Fajr, so the Prophet (ﷺ) commanded him to return and proclaim: 'Verily, the servant has slept (i.e., called the Adhān early).'' Reported by Abū Dāwūd, and he graded it as weak."
      }
    },

    {
      "id": 153,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا سَمِعْتُمْ اَلنِّدَاءَ, فَقُولُوا مِثْلَ مَا يَقُولُ اَلْمُؤَذِّنُ } مُتَّفَقٌ عَلَيْهِ  وَلِلْبُخَارِيِّ: عَنْ مُعَاوِيَةَ وَلِمُسْلِمٍ: { عَنْ عُمَرَ فِي فَضْلِ اَلْقَوْلِ كَمَا يَقُولُ اَلْمُؤَذِّنُ كَلِمَةً كَلِمَةً, سِوَى اَلْحَيْعَلَتَيْنِ, فَيَقُولُ: \"لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاَللَّهِ\" } ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تم اذان سنو تو تم بھی اسی طرح کہتے جاؤ جس طرح مؤذن کہہ رہا ہے۔ “ (بخاری و مسلم) بخاری میں سیدنا معاویہ رضی اللہ عنہ سے بھی اسی طرح روایت ہے۔ اور مسلم نے سیدنا عمر رضی اللہ عنہ سے روایت بیان کی ہے جو مؤذن کے جواب میں اسی طرح ایک ایک کلمہ کہنے کی فضیلت کے بارے میں ہے بجز «حي على الصلاة» اور «حي على الفلاح» کے کہ ان کلمات کی جگہ «لا حول ولا قوة إلا بالله» کہے۔ ",
        "english": "Narrated Abū Sa'īd Al-Khudrī (RA): The Messenger of Allah (ﷺ) said: 'When you hear the call [Adhān], then say as the Mu'adhdhin says.' [Agreed upon (Al-Bukhārī and Muslim)]. And for Al-Bukhārī, from Mu'āwiyah; and for Muslim, from 'Umar, concerning the virtue of repeating the words of the Mu'adhdhin word-for-word, except for the two Ḥay'alatayn (Ḥayya 'ala aṣ-ṣalāh and Ḥayya 'ala al-falāḥ), in which one should say: 'Lā ḥawla wa lā quwwata illā billāh (There is no power and no strength except with Allah).'"
      }
    },

    {
      "id": 154,
      "name": {
        "arabic": " وَعَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ ‏- رضى الله عنه ‏- { أَنَّهُ قَالَ : يَا رَسُولَ اَللَّهِ اِجْعَلْنِي إِمَامَ قَوْمِي .‏ قَالَ : \"أَنْتَ إِمَامُهُمْ , وَاقْتَدِ بِأَضْعَفِهِمْ , وَاِتَّخِذْ مُؤَذِّنًا لَا يَأْخُذُ عَلَى أَذَانِهِ أَجْرًا } أَخْرَجَهُ اَلْخَمْسَةُ , وَحَسَّنَهُ اَلتِّرْمِذِيُّ , وَصَحَّحَهُ اَلْحَاكِمُ .‏",
        "urdu": "سیدنا عثمان بن ابی العاص رضی اللہ عنہ سے مروی ہے انہوں نے عرض کیا یا رسول اللہ! مجھے میری قوم کا امام مقرر فرما دیں۔ ارشاد ہوا ”تم ان کے امام ہو (تمہیں تمہاری قوم کا امام مقرر کر دیا گیا) ان میں کمزور و ضعیف لوگوں کا خیال رکھو اور مؤذن ایسے آدمی کو مقرر کرو جو اذان کہنے کی اجرت نہ طلب کرے۔ “ اس کو احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے اور حاکم نے صحیح کہا ہے۔ ",
        "english": "Narrated 'Uthmān ibn Abī Al-'Āṣ (RA): 'He said: O Messenger of Allah! Appoint me as the Imām of my people. He said: 'You are their Imām, so lead them, follow the condition of the weakest among them, and choose a Mu'adhdhin who does not charge any wages for his Adhān.'' Reported by the five compilers (Ahmad, Abu Dawud, At-Tirmidhī, An-Nasa'ī, Ibn Mājah), and At-Tirmidhī graded it as Ḥasan (good), and Al-Ḥākim graded it as Ṣaḥīḥ (authentic)."
      }
    },

    {
      "id": 155,
      "name": {
        "arabic": "وَعَنْ مَالِكِ بْنِ الْحُوَيْرِثِ ‏- رضى الله عنه ‏- قَالَ : قَالَ لَنَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ وَإِذَا حَضَرَتِ اَلصَّلَاةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ .‏ .‏ .‏ } اَلْحَدِيثَ أَخْرَجَهُ اَلسَّبْعَةُ . ",
        "urdu": " سیدنا مالک بن حویرث رضی اللہ عنہ کا بیان ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ہم سے ارشاد فرمایا ”جب نماز کا وقت آ جائے تو تم میں سے کوئی آدمی تمہیں بلانے کے لیے اذان کہے۔ “ پھر پوری حدیث بیان کی۔ اسے ساتوں یعنی احمد، بخاری، مسلم، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ ",
        "english": "Narrated Mālik ibn Al-Ḥuwayrith (RA): The Prophet (ﷺ) said to us: 'When the time for prayer comes, then let one of you call the Adhān for you...' (the rest of the Hadith). Reported by the seven compilers (Ahmad, Al-Bukhārī, Muslim, Abu Dawud, At-Tirmidhī, An-Nasā'ī, and Ibn Mājah)."
      }
    },

    {
      "id": 156,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ لِبِلَالٍ : { إِذَا أَذَّنْتَ فَتَرَسَّلْ , وَإِذَا أَقَمْتُ فَاحْدُرْ , وَاجْعَلْ بَيْنَ أَذَانِكَ وَإِقَامَتِكَ قَدْرَ مَا يَفْرُغُ اَلْآكِلُ مِنْ أَكْلِهِ } اَلْحَدِيثَ .‏ رَوَاهُ اَلتِّرْمِذِيُّ وَضَعَّفَهُ  وَلَهُ : عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَا يُؤَذِّنُ إِلَّا مُتَوَضِّئٌ } وَضَعَّفَهُ أَيْضًا  وَلَهُ : عَنْ زِيَادِ بْنِ اَلْحَارِثِ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ وَمَنْ أَذَّنَ فَهُوَ يُقِيمُ } وَضَعَّفَهُ أَيْضًا وَلِأَبِي دَاوُدَ: فِي حَدِيثِ عَبْدِ اَللَّهِ بْنِ زَيْدٍ أَنَّهُ قَالَ : أَنَا رَأَيْتُهُ ‏- يَعْنِي : اَلْأَذَانُ ‏- وَأَنَا كُنْتُ أُرِيدُهُ .‏ قَالَ : \"فَأَقِمْ أَنْتَ \" وَفِيهِ ضَعْفٌ أَيْضًا  ",
        "urdu": " سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سیدنا بلال رضی اللہ عنہ سے فرمایا ”جب اذان کہو تو ٹھہر ٹھہر کر کہو (فَتَرَسَّلْ) اور تکبیر ذرا جلدی جلدی کہو (فَاحْدُرْ)۔ اذان اور اقامت کے درمیان اتنا وقفہ کرو کہ کھانا کھانے والا اپنے کھانے سے فارغ ہو کر جماعت میں شریک ہو سکے۔ “ پھر پوری حدیث بیان کی۔ اسے ترمذی نے روایت کیا ہے اور ضعیف قرار دیا ہے۔ اور ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”وضو کے بغیر کوئی اذان نہ کہے۔“ ترمذی نے اسے بھی ضعیف قرار دیا ہے۔ اور ترمذی نے زیاد بن حارث رضی اللہ عنہ سے روایت کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم فرمایا ”جو اذان کہے وہی اقامت کہے۔ “ ترمذی نے اسے بھی ضعیف قرار دیا ہے۔ اور ابوداؤد میں عبداللہ بن زید رضی اللہ عنہ کی روایت میں ہے کہ میں نے اذان کو خواب میں دیکھا تھا۔ میری تمنا تھی کہ مجھے مؤذن مقرر کیا جائے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”تم تکبیر کہا کرو “ اس میں بھی ضعف ہے۔ ",
        "english": "Narrated Jābir (RA): The Messenger of Allah (ﷺ) said to Bilāl: 'When you call the Adhān, do so slowly and deliberately (Fa Tarassal), and when you call the Iqāmah, do so quickly (Faḥdur). And make a pause between your Adhān and your Iqāmah long enough for the eater to finish his meal.' (the rest of the Hadith). Reported by At-Tirmidhī and he graded it as weak. And for him (At-Tirmidhī), from Abū Hurayrah (RA), the Prophet (ﷺ) said: 'None should call the Adhān except one who is in a state of Wuḍū' (ablution).' And he also graded this as weak. And for him, from Ziyād ibn Al-Ḥārith (RA), the Messenger of Allah (ﷺ) said: 'Whoever calls the Adhān, he is the one who calls the Iqāmah.' And he also graded this as weak. And for Abū Dāwūd, in the Hadith of 'Abdullāh ibn Zayd, he said: 'I saw it (the Adhān in a dream), and I wanted to be the Mu'adhdhin.' He said: 'Then you call the Iqāmah.' This also contains weakness."
      }
    },

    {
      "id": 157,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤَذِّنُ أَمْلَكُ بِالْأَذَانِ , وَالْإِمَامُ أَمْلَكُ بِالْإِقَامَةِ } رَوَاهُ اِبْنُ عَدِيٍّ وَضَعَّفَهُ .‏ وَلِلْبَيْهَقِيِّ نَحْوُهُ : عَنْ عَلِيٍّ مِنْ قَوْلِهِ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مؤذن اذان کا زیادہ حقدار ہے اور امام تکبیر (اقامت) کہنے کا زیادہ حق رکھتا ہے۔“ اسے ابن عدی نے روایت کیا ہے اور ضعیف قرار دیا ہے اور بیہقی میں بھی سیدنا علی رضی اللہ عنہ سے اسی طرح منقول ہے۔",
        "english": "Narrated Abū Hurayrah (RA): The Messenger of Allah (ﷺ) said: 'The Mu'adhdhin has the most right (Amalak) regarding the Adhān, and the Imām has the most right regarding the Iqāmah.' Reported by Ibn 'Adī and he graded it as weak. And for Al-Bayhaqī, a similar narration from 'Alī as his own saying (Mauqūf)."
      }
    },

    {
      "id": 158,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يُرَدُّ اَلدُّعَاءُ بَيْنَ اَلْأَذَانِ وَالْإِقَامَةِ } رَوَاهُ النَّسَائِيُّ , وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ .‏ ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے کہ ”اذان اور اقامت کے درمیانی وقفہ میں دعا مسترد نہیں کی جاتی۔“ اسے نسائی نے روایت کیا ہے اور ابن خزیمہ نے صحیح قرار دیا ہے۔  ",
        "english": "Narrated Anas (RA): The Messenger of Allah (ﷺ) said: 'The supplication (Du'ā') made between the Adhān and the Iqāmah is not rejected.' Reported by An-Nasā'ī, and Ibn Khuzaymah graded it as Ṣaḥīḥ (authentic)."
      }
    },

    {
      "id": 159,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ‏- رَضِيَ اَللَّهُ عَنْهُ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَنْ قَالَ حِينَ يَسْمَعُ اَلنِّدَاءَ : اَللَّهُمَّ رَبَّ هَذِهِ اَلدَّعْوَةِ اَلتَّامَّةِ , وَالصَّلَاةِ اَلْقَائِمَةِ , آتِ مُحَمَّدًا اَلْوَسِيلَةَ وَالْفَضِيلَةَ , وَابْعَثْهُ مَقَامًا مَحْمُودًا اَلَّذِي وَعَدْتَهُ , حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ اَلْقِيَامَةِ } أَخْرَجَهُ اَلْأَرْبَعَةُ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس آدمی نے اذان سن کر یہ دعا کی تو اس کے لیے قیامت کے دن میری شفاعت حلال ہو گئی۔ «اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وأبعثه مقاما محمودا الذي وعدته حلت له شفاعتي يوم القيامة» ”اے اللہ! اے اس کامل دعا اور قائم ہونے والی نماز کے مالک! محمد صلی اللہ علیہ وسلم کو وسیلہ (مقام محمود) اور فضیلت عطا فرما اور مقام محمود پر جس کا تو نے ان سے وعدہ فرمایا ہے پہنچا دے (بھیج دے) تو اس کے لیے قیامت کے روز میری شفاعت حلال ہو گئی۔ “ اسے ابوداؤد، ترمذی، نسائی اور ابن ماجہ چاروں نے روایت کیا ہے۔  ",
        "english": "Narrated Jābir (RA): The Messenger of Allah (ﷺ) said: 'Whoever says, upon hearing the call [Adhān]: 'Allāhumma Rabba hādhihi ad-da'wati at-tāmma, waṣ-ṣalāti al-qā'imah, āti Muḥammadan al-wasīlah wal-faḍīlah, wab'ath-hu maqāman maḥmūdan alladhī wa'adtah' (O Allah, Lord of this perfect call and the established prayer, grant Muḥammad the Wasīlah [a high station in Paradise] and the excellence, and raise him to the praised station [Maqāman Maḥmūda] which You have promised him), my intercession (Shafā'ah) will become lawful for him on the Day of Resurrection.' Reported by the four compilers (Abu Dawud, At-Tirmidhī, An-Nasā'ī, and Ibn Mājah)."
      }
    }
  ]
}
