{
  "chapId": 57,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 776,
    "to": 784
  },
  "hadiths": [
    {
      "id": 776,
      "name": {
        "arabic": "عَنْ عُرْوَةَ, عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ عَمَّرَ أَرْضاً لَيْسَتْ لِأَحَدٍ, فَهُوَ أَحَقُّ بِهَا } قَالَ عُرْوَةُ: وَقَضَى بِهِ عُمَرُ فِي خِلَافَتِهِ.‏ رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا عروہ نے سیدہ عائشہ رضی اللہ عنہما سے روایت کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جس کسی نے ایسی زمین کو آباد کیا جو کسی کی ملکیت نہ تھی، تو وہ اس کا زیادہ حقدار ہے۔“ عروہ نے کہا کہ سیدنا عمر رضی اللہ عنہ نے اپنے دورِ خلافت میں اسی کے مطابق فیصلہ فرمایا۔",
        "english": "Narrated 'Urwah on the authority of 'Aishah (RA): The Prophet (ﷺ) said: \"Whoever cultivates land that does not belong to anybody is more rightful to it.\" 'Urwah said: \"'Umar (RA) gave judgment accordingly during his Caliphate.\" [Reported by Al-Bukhari]."
      }
    },

    {
      "id": 777,
      "name": {
        "arabic": " وَعَنْ سَعِيدِ بْنِ زَيْدٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ أَحْيَا أَرْضاً مَيْتَةً فَهِيَ لَهُ } رَوَاهُ اَلثَّلَاثَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ.‏ وَقَالَ: رُوِيَ مُرْسَلاً.‏ وَهُوَ كَمَا قَالَ, وَاخْتُلِفَ فِي صَحَابِيِّهِ, فَقِيلَ: جَابِرٌ, وَقِيلَ: عَائِشَةُ, وَقِيلَ: عَبْدُ اَللَّهِ بْنُ عَمْرٍو, وَالرَّاجِحُ اَلْأَوَّلُ ",
        "urdu": "سیدنا سعید بن زید رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ”جس کسی نے بے آباد بیکار پڑی زمین کو زندہ کیا وہ اسی کی ملکیت ہے۔“ اسے تینوں (ابوداؤد، ترمذی، نسائی) نے روایت کیا ہے اور ترمذی نے اسے حسن کہا ہے۔",
        "english": "Narrated Sa'id bin Zaid (RA): The Prophet (ﷺ) said: \"Whoever brings a dead land to life, it belongs to him.\" [Reported by the three (Abu Dawud, At-Tirmidhi and An-Nasa'i). At-Tirmidhi graded it Hasan]."
      }
    },

    {
      "id": 778,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ; أَنَّ اَلصَّعْبَ بْنَ جَثَّامَةَ ‏- رضى الله عنه ‏- أَخْبَرَهُ أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا حِمَى إِلَّا لِلَّهِ وَلِرَسُولِهِ } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ صعب بن جثامہ لیثی رضی اللہ عنہ نے ان کو بتایا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ اور اس کے رسول کے سوا کسی کے لیے جائز نہیں کہ وہ (عوامی زمین کو) اپنے لیے چراگاہ مخصوص کر لے۔“",
        "english": "Narrated Ibn 'Abbas (RA): As-Sa'b bin Jaththama (RA) told him that the Prophet (ﷺ) said: \"There is no protection (Hima) of a pasture except for Allah and His Messenger.\" [Reported by Al-Bukhari]."
      }
    },

    {
      "id": 779,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا ضَرَرَ وَلَا ضِرَارَ } رَوَاهُ أَحْمَدُ, وَابْنُ مَاجَهْ وَلَهُ مِنْ حَدِيثِ أَبِي سَعِيدٍ مِثْلُهُ, وَهُوَ فِي اَلْمُوَطَّإِ مُرْسَلٌ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نہ کسی کو ابتدائی طور پر نقصان پہنچانا جائز ہے اور نہ ہی نقصان کے بدلے میں نقصان پہنچانا (جو حد سے تجاوز کر جائے) جائز ہے۔“",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: \"There should be neither harming nor reciprocating harm.\" [Reported by Ahmad and Ibn Majah. A similar Hadith is reported from Abu Sa'id, and it is Mursal in Al-Muwatta]."
      }
    },

    {
      "id": 780,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَحَاطَ حَائِطًا عَلَى أَرْضٍ فَهِيَ لَهُ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ اَلْجَارُودِ ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس کسی نے غیر مملوکہ زمین کے اردگرد دیوار بنا لی (اسے گھیر لیا)، تو وہ زمین اسی کی ملکیت ہے۔“ اسے ابوداؤد نے روایت کیا ہے اور ابن جارود نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Samurah bin Jundub (RA): Allah's Messenger (ﷺ) said: \"Whoever surrounds a piece of land with a wall, it belongs to him.\" [Reported by Abu Dawud and graded Sahih by Ibn al-Jarud]."
      }
    },

    {
      "id": 781,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مُغَفَّلٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ حَفَرَ بِئْرًا فَلَهُ أَرْبَعُونَ ذِرَاعًا عَطَنًا لِمَاشِيَتِهِ } رَوَاهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ ضَعِيفٍ ",
        "urdu": "سیدنا عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے (بنجر زمین میں) کنواں کھودا، تو اس کے ارد گرد چالیس ہاتھ زمین اس کے مویشیوں کے بیٹھنے اور آرام کرنے کے لیے اسی کی ملکیت ہے۔“ اسے ابن ماجہ نے ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated 'Abdullah bin Mughaffal (RA): The Prophet (ﷺ) said: \"Whoever digs a well is entitled to forty cubits (around it) as a resting place for his livestock.\" [Reported by Ibn Majah with a weak chain]."
      }
    },

    {
      "id": 782,
      "name": {
        "arabic": " وَعَنْ عَلْقَمَةَ بْنِ وَائِلٍ, عَنْ أَبِيهِ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَقْطَعَهُ أَرْضًا بِحَضْرَمَوْتَ } رَوَاهُ أَبُو دَاوُدَ , وَاَلتِّرْمِذِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا علقمہ بن وائل نے اپنے والد (وائل بن حجر رضی اللہ عنہ) سے روایت بیان کی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو حضرموت میں زمین بطور جاگیر عطا فرمائی۔ اسے ابوداؤد اور ترمذی نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated 'Alqamah bin Wail on the authority of his father (Wail bin Hujr): The Prophet (ﷺ) allotted him a piece of land in Hadramaut. [Reported by Abu Dawud and At-Tirmidhi, and graded Sahih by Ibn Hibban]."
      }
    },

    {
      "id": 783,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَقْطَعَ اَلزُّبَيْرَ حُضْرَ فَرَسِهِ , فَأَجْرَى اَلْفَرَسَ حَتَّى قَامَ , ثُمَّ رَمَى سَوْطَهُ.‏ فَقَالَ : \" أَعْطُوهُ حَيْثُ بَلَغَ اَلسَّوْطُ } رَوَاهُ أَبُو دَاوُدَ وَفِيهِ ضَعْفٌ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے زبیر رضی اللہ عنہ کو ان کے گھوڑے کی دوڑ (کی حد) کے برابر زمین جاگیر کے طور پر عنایت فرمائی۔ جب ان کا گھوڑا ٹھہر گیا تو انہوں نے اپنا کوڑا آگے پھینک دیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”جہاں تک کوڑا گرا وہاں تک زبیر کی زمین ہے۔“",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) allotted to az-Zubair (RA) a piece of land as much as his horse could run. So he ran his horse until it stopped, then he threw his whip. The Prophet (ﷺ) then said: \"Give it to him up to where the whip reached.\" [Reported by Abu Dawud, and it contains weakness]."
      }
    },

    {
      "id": 784,
      "name": {
        "arabic": " وَعَنْ رَجُلٍ مِنْ اَلصَّحَابَةِ ‏- رضى الله عنه ‏- قَالَ: { غَزَوْتُ مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَسَمِعْتُهُ يَقُولُ: اَلنَّاسُ شُرَكَاءُ فِي ثَلَاثٍ : فِي اَلْكَلَأِ ، وَالْمَاءِ ، وَالنَّارِ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَرِجَالُهُ ثِقَاتٌ",
        "urdu": "ایک صحابی رضی اللہ عنہ سے روایت ہے کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں شریک تھا میں نے آپ صلی اللہ علیہ وسلم کو ارشاد فرماتے سنا کہ ”تین چیزیں ایسی ہیں جن میں سب انسان حصہ دار ہیں: گھاس (چراہ گاہ)، پانی اور آگ۔“ اسے احمد و ابوداؤد نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated by a Companion: I accompanied Allah's Messenger (ﷺ) on an expedition and heard him saying: \"People are partners in three things: Pasture, Water, and Fire.\" [Reported by Ahmad and Abu Dawud, and its narrators are reliable]."
      }
    }
  ]
}