{
  "chapId": 97,
  "bookId": 14,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1188,
    "to": 1200
  },
  "hadiths": [
    {
      "id": 1188,
      "name": {
        "arabic": " عَنْ بُرَيْدَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"اَلْقُضَاةُ ثَلَاثَةٌ: اِثْنَانِ فِي اَلنَّارِ, وَوَاحِدٌ فِي اَلْجَنَّةِ.‏ رَجُلٌ عَرَفَ اَلْحَقَّ, فَقَضَى بِهِ, فَهُوَ فِي اَلْجَنَّةِ.‏ وَرَجُلٌ عَرَفَ اَلْحَقَّ, فَلَمْ يَقْضِ بِهِ, وَجَارَ فِي اَلْحُكْمِ, فَهُوَ فِي اَلنَّارِ.‏ وَرَجُلٌ لَمْ يَعْرِفِ اَلْحَقَّ, فَقَضَى لِلنَّاسِ عَلَى جَهْلٍ, فَهُوَ فِي اَلنَّارِ\" } رَوَاهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا بریدہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” قاضی کی تین اقسام ہیں دو دوزخی ہیں اور ایک جنتی۔ ایک وہ شخص جس نے حق کو پہچانا اور اس کے مطابق فیصلہ کیا وہ جنتی ہے اور دوسرا وہ جس نے حق کی پہچان کر لی مگر فیصلہ حق کے ساتھ نہ دیا۔ بلکہ فیصلہ میں ظلم کیا وہ دوزخی ہے اور تیسرا وہ جس نے نہ حق کو پہچانا نہ حق کے ساتھ فیصلہ کیا بلکہ اس نے لوگوں میں جہالت و نادانی سے فیصلہ کیا وہ بھی دوزخی ہے۔“ اسے ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Buraidah (RA): The Messenger of Allah (ﷺ) said: \"Judges are of three types, two are in the Fire and one is in Paradise. A man who knows the truth and judges accordingly, he is in Paradise. A man who knows the truth but deviates from it and judges unjustly, he is in the Fire. And a man who judges for the people out of ignorance, he is in the Fire.\" [Reported by the four, and Al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 1189,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: { مَنْ وَلِيَ اَلْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ } رَوَاهُ اَلْخَمْسَةُ وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ، وَابْنُ حِبَّانَ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص کو منصبِ قضاء (جج یا قاضی) پر فائز کیا گیا (سمجھ لو) کہ اسے بغیر چھری کے ذبح کر دیا گیا۔“ اسے احمد اور چاروں نے روایت کیا ہے اور ابن خزیمہ اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'Whoever is appointed as a judge has been slaughtered without a knife.' Reported by the five (Ahmad and the four) and graded as Sahih by Ibn Khuzaymah and Ibn Hibban."
      }
    },

    {
      "id": 1190,
      "name": {
        "arabic": "وَعَنْهُ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ إِنَّكُمْ سَتَحْرِصُونَ عَلَى اَلْإِمَارَةِ, وَسَتَكُونُ نَدَامَةً يَوْمَ اَلْقِيَامَةِ, فَنِعْمَ اَلْمُرْضِعَةُ, وَبِئْسَتِ اَلْفَاطِمَةُ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ ہی سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بیشک تم لوگ ضرور حکومت کی حرص و خواہش کرو گے اور وہ قیامت کے روز باعث ندامت ہو گی۔ پس اچھی ہے دودھ پلانے والی ماں اور بری ہے دودھ چھڑانے والی ماں۔“ (بخاری)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'You will covet for the office of administration (authority) but it will become a cause of regret on the Day of Resurrection. What a good nursing mother she is and what an evil weaning mother she is!'"
      }
    },

    {
      "id": 1191,
      "name": {
        "arabic": " وَعَنْ عَمْرِو بْنِ الْعَاصِ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \"إِذَا حَكَمَ اَلْحَاكِمُ, فَاجْتَهَدَ, ثُمَّ أَصَابَ, فَلَهُ أَجْرَانِ.‏ وَإِذَا حَكَمَ, فَاجْتَهَدَ, ثُمَّ أَخْطَأَ, فَلَهُ أَجْرٌ\" } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": " سیدنا عمرو بن العاص رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو ارشاد فرماتے ہوئے سنا کہ ” جب کوئی حاکم فیصلہ کرتے وقت پوری جدوجہد کرے اور صحیح فیصلہ کرنے میں کامیاب بھی ہو جائے تو اسے دگنا ثواب ملتا ہے اور جب وہ فیصلہ کرنے میں جدوجہد تو پوری کرے مگر صحیح فیصلہ کرنے میں خطا کر جائے تو اسے ایک اجر ملے گا۔“ (بخاری و مسلم) ",
        "english": "Narrated 'Amr bin al-'As (RA): That he heard Allah's Messenger (ﷺ) saying: \"If a judge passes judgment and strives (to reach the right decision) and is correct, he will have two rewards. And if he passes judgment and strives (to reach the right decision) and is mistaken, he will have one reward.\""
      }
    },

    {
      "id": 1192,
      "name": {
        "arabic": "وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \" لَا يَحْكُمُ أَحَدٌ بَيْنَ اِثْنَيْنِ, وَهُوَ غَضْبَانُ\" } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے ” تم میں سے کوئی بھی دو آدمیوں کے درمیان فیصلہ غصے کی حالت میں نہ کرے۔“ (بخاری و مسلم) ",
        "english": "Narrated Abu Bakra (RA): I heard Allah's Messenger (ﷺ) saying: \"No one should judge between two people while he is angry.\""
      }
    },

    {
      "id": 1193,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا تَقَاضَى إِلَيْكَ رَجُلَانِ, فَلَا تَقْضِ لِلْأَوَّلِ, حَتَّى تَسْمَعَ كَلَامَ اَلْآخَرِ, فَسَوْفَ تَدْرِي كَيْفَ تَقْضِي .‏ قَالَ عَلِيٌّ: فَمَا زِلْتُ قَاضِيًا بَعْدُ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب دو آدمی تیرے پاس فیصلہ کیلئے آئیں تو کسی ایک کے حق میں فیصلہ نہ کرنا جب تک دوسرے کی بات نہ سن لو۔ اس سے تمہیں معلوم ہو جائے گا کہ تم نے فیصلہ کیسے کرنا ہے۔“ سیدنا علی رضی اللہ عنہ نے فرمایا، اس دن سے میں اسی طرح فیصلہ کرتا ہوں۔",
        "english": "Narrated 'Ali (RA): Allah's Messenger (ﷺ) said: 'When two men come to you for judicial decision, do not decide in favor of the first until you have heard the argument of the other; for then you will know how you should judge.' 'Ali (RA) said: 'From that time onwards, I have always been a (competent) judge.'"
      }
    },

    {
      "id": 1194,
      "name": {
        "arabic": " وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ, وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ, فَأَقْضِيَ لَهُ عَلَى نَحْوٍ مِمَّا أَسْمَعُ, مِنْهُ فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا, فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ اَلنَّارِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بیشک تم لوگ اپنے جھگڑے میرے پاس لے کر آتے ہو اور تم میں سے بعض اپنے دلائل بڑی خوبی و چرب زبانی سے بیان کرتا ہے تو میں نے جو کچھ سنا ہوتا ہے اسی کے مطابق اس کے حق میں فیصلہ کر دیتا ہوں۔ پس جسے اس کے بھائی کے حق میں سے کوئی چیز دوں تو میں اس کے لئے آگ کا ٹکرا کاٹ کر دے رہا ہوں۔“ (بخاری و مسلم)  ",
        "english": "Narrated Umm Salama (RA): Allah's Messenger (ﷺ) said: \"You bring your disputes to me, and perhaps some of you are more eloquent in their plea than others, so I judge in their favor according to what I hear from them. So, if I ever judge in favor of someone giving him what is rightfully his brother's, I am only giving him a piece of Hellfire.\""
      }
    },

    {
      "id": 1195,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- يَقُولُ: { كَيْفَ تُقَدَّسُ أُمَّةٌ, لَا يُؤْخَذُ مِنْ شَدِيدِهِمْ لِضَعِيفِهِمْ ? } رَوَاهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ ”وہ امت کیسے پاک (مقدس) ہو سکتی ہے جس میں طاقتور سے کمزور کا حق نہ دلوایا جا سکے۔“",
        "english": "Narrated Jabir (RA): I heard the Prophet (ﷺ) say: 'How can an Ummah (nation) be purified (or blessed) in which the right of the weak is not taken from the strong?'"
      }
    },

    {
      "id": 1196,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \" يُدْعَى بِالْقَاضِي اَلْعَادِلِ يَوْمَ اَلْقِيَامَةِ, فَيَلْقَى مِنْ شِدَّةِ اَلْحِسَابِ مَا يَتَمَنَّى أَنَّهُ لَمْ يَقْضِ بَيْنَ اِثْنَيْنِ فِي عُمْرِهِ\" } رَوَاهُ اِبْنُ حِبَّانَ وَأَخْرَجَهُ اَلْبَيْهَقِيُّ, وَلَفْظُهُ: { فِي تَمْرَةٍ } ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے ” قیامت کے روز عادل قاضی کو حساب کیلئے طلب کیا جائے گا وہ اپنے حساب کی شدت کو محسوس کر کے آرزو کرے گا کہ کاش وہ دنیا میں دو شخصوں کے درمیان اپنی عمر میں ایک فیصلہ بھی نہ کرتا۔“ اسے ابن حبان نے روایت کیا ہے اور بیہقی نے اس کو نقل کیا ہے۔ اس میں اضافہ ہے کہ ” کبھی ایک کھجور کا بھی فیصلہ نہ کرتا۔“ ",
        "english": "Narrated 'Aisha (RA): I heard Allah's Messenger (ﷺ) saying: \"The just judge will be called on the Day of Resurrection and he will face such a severe reckoning that he will wish he had never judged between two people, even regarding a single date, during his entire life.\""
      }
    },

    {
      "id": 1197,
      "name": {
        "arabic": "وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمْ اِمْرَأَةً } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابوبکرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ”ایسی قوم ہرگز فلاح نہیں پا سکتی جو عورت کو اپنا حاکم و فرمانروا بنا لے۔“",
        "english": "Narrated Abu Bakra (RA): The Prophet (ﷺ) said: 'Never will succeed such a nation as makes a woman its ruler.'"
      }
    },

    {
      "id": 1198,
      "name": {
        "arabic": "وَعَنْ أَبِي مَرْيَمَ اَلْأَزْدِيِّ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- قَالَ: { \"مَنْ وَلَّاهُ اَللَّهُ شَيْئًا مِنْ أَمْرِ اَلْمُسْلِمِينَ, فَاحْتَجَبَ عَنْ حَاجَتِهِمْ وَفَقِيرِهِم, اِحْتَجَبَ اَللَّهُ دُونَ حَاجَتِهِ\" } أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ",
        "urdu": "سیدنا ابومریم ازدی رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ” جس شخص کو اللہ تعالیٰ نے مسلمانوں کے کسی کام کا حاکم بنا دیا اور وہ پردہ میں رہا (یعنی لوگوں سے دور رہا)۔ ان کی ضروریات اور ان کی حاجات پوری کرنے میں، تو اللہ تعالیٰ بھی اس کی حاجات پوری کرنے میں رکاوٹ بن جائے گا۔“ (ابوداؤد و ترمذی)",
        "english": "Narrated Abu Maryam al-Azdi (RA): The Prophet (ﷺ) said: \"If Allah puts anyone in a position of authority over the affairs of the Muslims, and he secludes himself (remains inaccessible) from their needs and their poverty, Allah will keep Himself away from his needs.\""
      }
    },

    {
      "id": 1199,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- اَلرَّاشِيَ وَالْمُرْتَشِيَ فِي اَلْحُكْمِ } رَوَاهُ اَلْخَمْسَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے (فیصلے میں) رشوت دینے والے اور رشوت لینے والے پر لعنت فرمائی ہے۔ اسے احمد اور چاروں (سنن) نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے اور ابن حبان نے اس کو صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) cursed the one who bribes and the one who takes a bribe in a judicial decision."
      }
    },

    {
      "id": 1200,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بنِ اَلزُّبَيْرِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّ اَلْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيِ اَلْحَاكِمِ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ  ",
        "urdu": " سیدنا عبداللہ بن زبیر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ ” جھگڑا کرنے والے دونوں حاکم کے روبرو بیٹھیں۔“ اسے ابوداؤد نے روایت کیا ہے اور حاکم نے اس کو صحیح قرار دیا ہے۔",
        "english": "Narrated 'Abdullah bin Az-Zubair (RA): Allah's Messenger (ﷺ) decreed that the two parties to a dispute should sit before the judge."
      }
    }
  ]
}
