{
  "chapId": 60,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 799,
    "to": 804
  },
  "hadiths": [
    {
      "id": 799,
      "name": {
        "arabic": "عَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : { مَرَّ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِتَمْرَةٍ فِي اَلطَّرِيقِ، فَقَالَ : \" لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ مِنَ الصَّدَقَةِ لَأَكَلْتُهَا\" } مُتَّفَقٌ عَلَيْه ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم کا گزر راستے میں (گری پڑی) ایک کھجور پر ہوا تو آپ ﷺ نے فرمایا: ”اگر مجھے یہ خدشہ نہ ہوتا کہ یہ صدقہ کی ہو سکتی ہے، تو میں اسے (اٹھا کر) ضرور کھا لیتا۔“",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) passed by a date lying on the road and said, \"Were it not for the fear that it might be from Sadaqah (charity), I would have eaten it.\""
      }
    },

    {
      "id": 800,
      "name": {
        "arabic": "وَعَنْ زَيْدِ بْنِ خَالِدٍ اَلْجُهَنِيِّ ‏- رضى الله عنه ‏- قَالَ : { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَسَأَلَهُ عَنِ اللُّقَطَةِ ? فَقَالَ : \" اِعْرِفْ عِفَاصَهَا وَوِكَاءَهَا , ثُمَّ عَرِّفْهَا سَنَةً , فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَشَأْنُكَ بِهَا\" .‏ قَالَ : فَضَالَّةُ اَلْغَنَمِ؟ قَالَ : \"هِيَ لَكَ , أَوْ لِأَخِيكَ , أَوْ لِلذِّئْبِ \" .‏ قَالَ : فَضَالَّةُ اَلْإِبِلِ ? قَالَ : \" مَا لَكَ وَلَهَا ? مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا , تَرِدُ اَلْمَاءَ , وَتَأْكُلُ اَلشَّجَرَ , حَتَّى يَلْقَاهَا رَبُّهَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا زید بن خالد جہنی رضی اللہ عنہ سے مروی ہے کہ ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے گری پڑی چیز (لقطہ) کے بارے میں پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اس کے برتن اور اس کے بندھن کو اچھی طرح پہچان لو، پھر سال بھر اس کا اعلان کرو۔ اگر اس کا مالک آ جائے (تو اسے دے دو) ورنہ تم اسے جیسے چاہو استعمال کرو۔“ اس نے گمشدہ بکری کے بارے میں پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”وہ تمہاری ہے یا تمہارے بھائی کی یا پھر بھیڑیے کی۔“ اس نے گمشدہ اونٹ کے بارے میں پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تمہیں اس سے کیا سروکار؟ اس کے پاس اس کا مشکیزہ اور اس کے جوتے (کھر) موجود ہیں۔ وہ خود پانی پی لے گا اور درختوں کے پتے کھا لے گا، یہاں تک کہ اس کا مالک اسے مل جائے۔“",
        "english": "Narrated Zaid bin Khalid al-Juhani (RA): A man asked the Prophet (ﷺ) about picking up a lost property (Luqatah). He said: \"Recognize its container and its string, then make an announcement about it for a year. If its owner comes, give it to him; otherwise, do as you wish with it.\" He then asked about a lost sheep. The Prophet (ﷺ) said: \"It is for you, or for your brother, or for the wolf.\" He then asked about a lost camel. He (ﷺ) said: \"What have you to do with it? It has its own water-bag (stomach) and its feet (hoofs). It can reach water and eat trees until its owner finds it.\" [Agreed upon]."
      }
    },

    {
      "id": 801,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ آوَى ضَالَّةً فَهُوَ ضَالٌّ , مَا لَمْ يُعَرِّفْهَا } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا زید بن خالد جہنی رضی اللہ عنہ سے ہی مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے گمشدہ چیز کو اپنے ہاں پناہ دی اور اس کا اعلان نہ کیا تو وہ خود گمراہ ہے۔“ (مسلم)",
        "english": "Narrated by Zaid bin Khalid Al-Juhani (RA): The Messenger of Allah (ﷺ) said: 'He who shelters a lost animal is himself astray (committing a sin), as long as he does not make a public announcement of it.'"
      }
    },

    {
      "id": 802,
      "name": {
        "arabic": "وَعَنْ عِيَاضِ بْنِ حِمَارٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَوَيْ عَدْلٍ , وَلْيَحْفَظْ عِفَاصَهَا وَوِكَاءَهَا , ثُمَّ لَا يَكْتُمْ , وَلَا يُغَيِّبْ , فَإِنْ جَاءَ رَبُّهَا فَهو أَحَقُّ بِهَا , وَإِلَّا فَهُوَ مَالُ اَللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ إِلَّا اَلتِّرْمِذِيَّ , وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ , وَابْنُ اَلْجَارُودِ , وَابْنُ حِبَّانَ",
        "urdu": "سیدنا عیاض بن حمار رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی کی کوئی گمشدہ چیز کہیں گری پڑی ملے تو اسے چاہیئے کہ دو منصف و عادل آدمیوں کو اس پر گواہ بنا لے اور خود اس کے ڈاٹ اور سربند کو خوب یاد رکھے اور پھر اسے چھپانے اور غائب کرنے کی کوشش نہ کرے۔ پھر اگر اس چیز کا اصل مالک آ جائے تو وہی اس کا زیادہ حقدار ہے۔ اگر نہ آئے تو وہ اللہ کا مال ہے، وہ جسے چاہتا ہے عنایت فرما دیتا ہے۔“ اسے احمد اور چاروں نے روایت کیا ہے سوائے ترمذی کے اور ابن خزیمہ، ابن جارود اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated 'Iyad bin Himar (RA): The Messenger of Allah (ﷺ) said: 'Whoever finds a lost object (Luqatah) should seek two just witnesses and should not conceal it or disappear with it. He should keep its container and its string (descriptions) well in mind. If its owner comes, he has more right to it; otherwise, it is the property of Allah which He gives to whom He wills.'"
      }
    },

    {
      "id": 803,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ لُقَطَةِ اَلْحَاجِّ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عبدالرحمٰن بن عثمان تیمی رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے حجاج کی گری پڑی چیز کو اٹھانے سے منع فرمایا ہے۔ (مسلم)",
        "english": "Narrated 'Abdur-Rahman bin 'Uthman at-Taimi (RA): The Prophet (ﷺ) prohibited (picking up) the lost property of a pilgrim (Al-Hajj)."
      }
    },

    {
      "id": 804,
      "name": {
        "arabic": "وَعَنْ اَلْمِقْدَامِ بْنِ مَعْدِي كَرِبَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَلَا لَا يَحِلُّ ذُو نَابٍ مِنَ السِّبَاعِ , وَلَا اَلْحِمَارُ اَلْأَهْلِيُّ , وَلَا اَللُّقَطَةُ مِنْ مَالِ مُعَاهَدٍ , إِلَّا أَنْ يَسْتَغْنِيَ عَنْهَا } رَوَاهُ أَبُو دَاوُدَ",
        "urdu": "سیدنا مقدام بن معدی کرب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”سن لو! درندوں میں سے کچلیوں والا جانور حلال نہیں اور نہ ہی گھریلو گدھا اور ذمی (معاہد) کی گمشدہ گری پڑی چیز اٹھانا بھی حلال نہیں ہے، الا یہ کہ مالک کے نزدیک اس کی خاص اہمیت و ضرورت نہ ہو۔“",
        "english": "Narrated Al-Miqdam bin Ma'di Karib (RA): The Messenger of Allah (ﷺ) said: 'Beware! Every fanged beast of prey is forbidden, as is the domestic donkey, and the lost property of a Mu'ahid (non-Muslim under state protection) is not permissible except when the owner has no need for it (or leaves it).'"
      }
    }
  ]
}