{
  "chapId": 31,
  "bookId": 4,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 508,
    "to": 519
  },
  "hadiths": [
    {
      "id": 508,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { سَبْعَةٌ يُظِلُّهُمُ اَللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ. . . . } فَذَكَرَ اَلْحَدِيثَ وَفِيهِ: { وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لَا تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا: ”سات قسم کے آدمی ایسے ہیں جن کو اللہ تعالیٰ ایسے روز (قیامت) میں اپنا سایہ عطا فرمائیں گے جس روز اس کے سائے کے سوا کوئی اور سایہ نہ ہو گا۔“ پھر پوری حدیث بیان فرمائی جس میں یہ بھی ہے: ”اور وہ شخص جس نے اس طرح چھپا کر صدقہ دیا کہ اس کے بائیں ہاتھ کو بھی پتہ نہ چلا کہ اس کے دائیں ہاتھ نے کیا خرچ کیا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said, \"Seven people will be shaded by Allah under His shade on the day when there will be no shade except His...\" He mentioned the rest of the Hadith, which says, \"...and a man who gives charity so secretly that his left hand does not know what his right hand has given.\""
      }
    },

    {
      "id": 509,
      "name": {
        "arabic": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ - رضى الله عنه - قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -يَقُولُ: { كُلُّ اِمْرِئٍ فِي ظِلِّ صَدَقَتِهِ حَتَّى يُفْصَلَ بَيْنَ اَلنَّاسِ } رَوَاهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ",
        "urdu": "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو فرماتے سنا ہے کہ ”ہر آدمی (قیامت کے دن) اپنے صدقہ کے سایہ میں ہو گا یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے۔“ (ابن حبان و حاکم)",
        "english": "Narrated 'Uqbah bin 'Amir (RA): I heard the Messenger of Allah (ﷺ) saying: \"Every person will be in the shade of his charity until the cases are decided between the people (on the Day of Judgment).\" [Reported by Ibn Hibban and al-Hakim]."
      }
    },

    {
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ, عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { أَيُّمَا مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا عَلَى عُرْيٍ كَسَاهُ اَللَّهُ مِنْ خُضْرِ اَلْجَنَّةِ, وَأَيُّمَا مُسْلِمٍ أَطْعَمَ مُسْلِمًا عَلَى جُوعٍ أَطْعَمَهُ اَللَّهُ مِنْ ثِمَارِ اَلْجَنَّةِ, وَأَيُّمَا مُسْلِمٍ سَقَى مُسْلِمًا عَلَى ظَمَإٍ سَقَاهُ اَللَّهُ مِنْ اَلرَّحِيقِ اَلْمَخْتُومِ } رَوَاهُ أَبُو دَاوُدَ وَفِي إِسْنَادِهِ لِينٌ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا: ”جو مسلمان کسی برہنہ مسلمان کو کپڑا پہنائے گا، اللہ اسے جنت کے سبز لباس پہنائے گا؛ جو کسی بھوکے مسلمان کو کھانا کھلائے گا، اللہ اسے جنت کے پھل کھلائے گا؛ اور جو کسی پیاسے مسلمان کو پانی پلائے گا، اللہ اسے 'رحیق مختوم' (مہر بند پاکیزہ مشروب) پلائے گا۔“ (ابوداؤد، اس کی سند میں کچھ کمزوری ہے)۔",
        "english": "Narrated Abu Sa'id al-Khudri (RA): The Prophet (ﷺ) said: \"If any Muslim clothes a Muslim when he is naked, Allah will clothe him with some of the green garments of Paradise; if any Muslim feeds a Muslim when he is hungry, Allah will feed him with some of the fruits of Paradise; and if any Muslim gives a Muslim a drink when he is thirsty, Allah will give him some of the sealed nectar (Rahique-al-Makhtum) to drink.\""
      }
    },

    {
      "id": 511,
      "name": {
        "arabic": "وَعَنْ حَكِيمِ بْنِ حِزَامٍ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { اَلْيَدُ اَلْعُلْيَا خَيْرٌ مِنَ اَلْيَدِ اَلسُّفْلَى, وَابْدَأْ بِمَنْ تَعُولُ, وَخَيْرُ اَلصَّدَقَةِ عَنْ ظَهْرِ غِنًى, وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اَللَّهُ, وَمَنْ يَسْتَغْنِ يُغْنِهِ اَللَّهُ. } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا حکیم بن حزام رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا: ”اوپر والا ہاتھ نیچے والے ہاتھ سے بہتر ہے۔ (صدقہ کی) شروعات ان سے کر جن کی تو کفالت کرتا ہے، اور بہترین صدقہ وہ ہے جو ضرورت سے زائد مال میں سے دیا جائے۔ جو شخص سوال سے بچے گا اللہ اسے پاک دامن رکھے گا، اور جو بے نیازی اختیار کرے گا اللہ اسے غنی کر دے گا۔“ (بخاری و مسلم، الفاظ بخاری کے ہیں)",
        "english": "Narrated Hakim bin Hizam (RA): The Prophet (ﷺ) said: \"The upper hand (the one that gives) is better than the lower hand (the one that takes). One should start giving to his dependents. And the best charity is that which is given by a wealthy person (from the money left after his expenses). And whoever abstains from asking others for financial help, Allah will provide for him and save him from asking others, and whoever is satisfied with what Allah has given him, Allah will make him self-sufficient.\""
      }
    },

    {
      "id": 512,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: { قِيلَ يَا رَسُولَ اَللَّهِ: أَيُّ اَلصَّدَقَةِ أَفْضَلُ? قَالَ: \"جُهْدُ اَلْمُقِلِّ, وَابْدَأْ بِمَنْ تَعُولُ\" } أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ سے پوچھا گیا کہ کون سا صدقہ افضل ہے؟ آپ ﷺ نے ارشاد فرمایا: ”کم مال والے کی محنت (کی کمائی) کا صدقہ، اور صدقہ کی ابتدا ان سے کر جن کی تو کفالت کرتا ہے۔“ (اسے احمد اور ابوداؤد نے روایت کیا اور ابن خزیمہ، ابن حبان اور حاکم نے صحیح قرار دیا ہے)۔",
        "english": "Narrated Abu Hurairah (RA): It was said, \"O Messenger of Allah (ﷺ)! Which charity is the best?\" He replied, \"That which is given by one who has little (but struggles to give), and start with those who are your dependents.\""
      }
    },

    {
      "id": 513,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { \"تَصَدَّقُوا\" فَقَالَ رَجُلٌ: يَا رَسُولَ اَللَّهِ، عِنْدِي دِينَارٌ؟ قَالَ: \"تَصَدَّقْ بِهِ عَلَى نَفْسِكَ\" قَالَ: عِنْدِي آخَرُ، قَالَ: \"تَصَدَّقْ بِهِ عَلَى وَلَدِكَ\" قَالَ: عِنْدِي آخَرُ، قَالَ: \"تَصَدَّقْ بِهِ عَلَى زَوْجَتِكَ\" قَالَ: عِنْدِي آخَرُ، قَالَ: \"تَصَدَّقْ بِهِ عَلَى خَادِمِكَ\" قَالَ: عِنْدِي آخَرُ، قَالَ: \"أَنْتَ أَبْصَرُ\". } رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ، وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ ہی سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”صدقہ کرو۔“ ایک آدمی نے کہا: یا رسول اللہ! میرے پاس ایک دینار ہے۔ آپ ﷺ نے فرمایا: ”اسے اپنی ذات پر خرچ کر۔“ وہ بولا: میرے پاس ایک اور بھی ہے۔ آپ ﷺ نے فرمایا: ”اسے اپنی اولاد پر خرچ کر۔“ اس نے عرض کیا: میرے پاس ایک اور بھی ہے۔ آپ ﷺ نے فرمایا: ”اسے اپنی اہلیہ پر خرچ کر۔“ اس نے پھر عرض کیا: میرے پاس ایک اور بھی ہے۔ آپ ﷺ نے فرمایا: ”اسے اپنے خادم پر خرچ کر۔“ وہ بولا: میرے پاس ایک اور بھی ہے۔ آپ ﷺ نے فرمایا: ”اب تو زیادہ بہتر جانتا ہے (کہ کہاں خرچ کرنا ہے)۔“",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said, \"Give charity.\" A man said, \"O Messenger of Allah, I have a Dinar.\" He replied, \"Spend it on yourself.\" He said, \"I have another.\" He replied, \"Spend it on your children.\" He said, \"I have another.\" He replied, \"Spend it on your wife.\" He said, \"I have another.\" He replied, \"Spend it on your servant.\" He said, \"I have another.\" He replied, \"You know better (where to spend it).\" [Reported by Abu Dawud and an-Nasa'i; Ibn Hibban and al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 514,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ اَلنَّبِيُّ - صلى الله عليه وسلم -{ إِذَا أَنْفَقَتِ اَلْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا, غَيْرَ مُفْسِدَةٍ, كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا اِكْتَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ, وَلَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا } مُتَّفَقٌ عَلَيْهِ. ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے فرمایا: ”جب عورت اپنے گھر کے (ذخیرہ شدہ) کھانے میں سے فضول خرچی اور بگاڑ پیدا کیے بغیر خرچ کرے، تو اسے خرچ کرنے کی وجہ سے ثواب ملے گا، اس کے شوہر کو کمانے کی وجہ سے ثواب ملے گا اور اسی طرح خزانچی کو بھی اتنا ہی اجر ملے گا۔ ان میں سے کوئی بھی کسی دوسرے کے اجر میں کمی نہیں کرے گا۔“ (بخاری و مسلم)",
        "english": "Narrated 'Aishah (RA): The Prophet (ﷺ) said: \"When a woman gives in charity from the food of her house, without wasting or being extravagant, she will have her reward for what she gave, and her husband will have his reward for what he earned, and the storekeeper (khazin) will have a similar reward. The reward of any of them will not diminish the reward of the others in the least.\""
      }
    },

    {
      "id": 515,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ - رضى الله عنه - قَالَ: { جَاءَتْ زَيْنَبُ اِمْرَأَةُ اِبْنِ مَسْعُودٍ, فَقَالَتْ: يَا رَسُولَ اَللَّهِ, إِنَّكَ أَمَرْتَ اَلْيَوْمَ بِالصَّدَقَةِ, وَكَانَ عِنْدِي حُلِيٌّ لِي, فَأَرَدْتُ أَنْ أَتَصَدَّقَ بِهِ, فَزَعَمَ اِبْنُ مَسْعُودٍ أَنَّهُ وَوَلَدُهُ أَحَقُّ مَنْ تَصَدَّقْتُ بِهِ عَلَيْهِمْ, فَقَالَ اَلنَّبِيُّ - صلى الله عليه وسلم - \"صَدَقَ اِبْنُ مَسْعُودٍ, زَوْجُكِ وَوَلَدُكِ أَحَقُّ مَنْ تَصَدَّقْتِ بِهِ عَلَيْهِمْ\". } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ عبداللہ بن مسعود رضی اللہ عنہما کی اہلیہ زینب رضی اللہ عنہا آئیں اور عرض کیا یا رسول اللہ! آپ نے آج صدقہ کرنے کا حکم ارشاد فرمایا ہے۔ میرے پاس میرا ذاتی زیور ہے میں اسے صدقہ کرنا چاہتی ہوں۔ عبداللہ بن مسعود رضی اللہ عنہما کا خیال ہے کہ وہ اور ان کی اولاد میرے صدقے کے زیادہ حقدار ہیں آپ ﷺ نے فرمایا: ”ابن مسعود نے ٹھیک کہا ہے، تیرا شوہر اور اس کی اولاد تیرے صدقے کے زیادہ مستحق ہیں۔“",
        "english": "Narrated Abu Sa'id al-Khudri (RA): Zainab, the wife of Ibn Mas'ud (RA), came and said, \"O Messenger of Allah (ﷺ)! Today you ordered us to give charity. I have some jewelry and I want to give it as charity, but Ibn Mas'ud claims that he and his children are the most deserving of it.\" The Prophet (ﷺ) said, \"Ibn Mas'ud has spoken the truth; your husband and your children are the most deserving of your charity.\""
      }
    },

    {
      "id": 516,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ اَلنَّبِيُّ صلى الله عليه وسلم: { مَا يَزَالُ اَلرَّجُلُ يَسْأَلُ اَلنَّاسَ حَتَّى يَأْتِيَ يَوْمَ اَلْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةُ لَحْمٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”جو شخص لوگوں سے ہمیشہ مانگتا رہتا ہے، وہ قیامت کے دن اس حال میں آئے گا کہ اس کے چہرے پر گوشت کا ایک ٹکڑا بھی نہیں ہوگا۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) said, \"A man continues to beg from people until he comes on the Day of Resurrection with no piece of flesh on his face.\""
      }
    },

    {
      "id": 517,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ مَنْ سَأَلَ اَلنَّاسَ أَمْوَالَهُمْ تَكَثُّرًا, فَإِنَّمَا يَسْأَلُ جَمْرًا, فَلْيَسْتَقِلَّ أَوْ لِيَسْتَكْثِرْ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”جو آدمی اپنا مال بڑھانے کی غرض سے لوگوں سے مانگتا ہے، تو وہ درحقیقت (جہنم کے) انگاروں کا سوال کر رہا ہے۔ اب اس کی مرضی ہے کہ وہ ان انگاروں کو کم جمع کرے یا زیادہ۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"He who begs from people to increase his wealth is asking only for live coals (of Hell). So let him ask for little or much.\""
      }
    },

    {
      "id": 518,
      "name": {
        "arabic": "وَعَنِ اَلزُّبَيْرِ بْنِ اَلْعَوَّامِ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { لَأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ, فَيَأْتِي بِحُزْمَةِ اَلْحَطَبِ عَلَى ظَهْرِهِ, فَيَبِيعَهَا, فَيَكُفَّ اَللَّهُ بِهَا وَجْهَهُ, خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ اَلنَّاسَ أَعْطَوهُ أَوْ مَنَعُوهُ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا زبیر بن عوام رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا: ”اگر تم میں سے کوئی رسی لے کر لکڑیوں کا گٹھا اپنی پیٹھ پر اٹھا کر لائے، پھر اسے فروخت کر دے تو (اللہ تعالی) اس کی وجہ سے اس کی آبرو محفوظ رکھتا ہے۔ یہ کام اس کے لیے اس سے بہتر ہے کہ وہ لوگوں سے مانگتا پھرے، چاہے وہ اسے دیں یا نہ دیں۔“ (بخاری)",
        "english": "Narrated Az-Zubair bin al-'Awwam (RA): The Prophet (ﷺ) said: \"It is better for one of you to take a rope, bring a bundle of firewood on his back and sell it, so that Allah preserves his dignity thereby, than to beg from people who may give him or may not give him.\""
      }
    },

    {
      "id": 519,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - { اَلْمَسْأَلَةُ كَدٌّ يَكُدُّ بِهَا اَلرَّجُلُ وَجْهَهُ, إِلَّا أَنْ يَسْأَلَ اَلرَّجُلُ سُلْطَانًا, أَوْ فِي أَمْرٍ لَا بُدَّ مِنْهُ } رَوَاهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”سوال کرنا ایک زخم ہے جس سے انسان اپنے چہرے کو زخمی (بدنما) کرتا ہے، سوائے اس کے کہ وہ شخص بادشاہ (حکومت) سے اپنا حق مانگے یا کسی ایسی مجبوری میں مبتلا ہو جس کے بغیر چارہ نہ ہو۔“ (ترمذی)",
        "english": "Narrated Samurah bin Jundub (RA): The Messenger of Allah (ﷺ) said: \"Begging is a scratch (or wound) with which a man scratches his own face, except when one asks from a ruler or in a case of dire necessity.\""
      }
    }
  ]
}
