{
  "chapId": 101,
  "bookId": 15,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1229,
    "to": 1235
  },
  "hadiths": [
    {
      "id": 1229,
      "name": {
        "arabic": "عَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلًا مِنْ اَلْأَنْصَارِ أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ, لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ, فَبَلَغَ ذَلِكَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَ: \"مَنْ يَشْتَرِيهِ مِنِّي?\" فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اَللَّهِ بِثَمَانِمَائَةِ دِرْهَمٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ ایک انصاری نے اپنا ایک غلام مرتے وقت آزاد کر دیا۔ اس کی ملکیت صرف یہی مال تھا۔ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا ” کون ہے جو اس غلام کہ مجھ سے خریدتا ہے۔“ نعیم بن عبداللہ نے آپ صلی اللہ علیہ وسلم سے اسے آٹھ سو درہم میں خرید لیا (بخاری و مسلم) اور بخاری کے الفاظ یہ ہیں ” پس وہ محتاج ہوا۔“ اور نسائی کی روایت میں ہے کہ ” اس پر قرض تھا پس آپ صلی اللہ علیہ وسلم نے اسے آٹھ سو درہم کے عوض فروخت کیا اور اسے دے کر فرمایا اپنا قرض ادا کر۔“ ",
        "english": "Narrated Jabir (RA): An Ansari man manumitted a slave of his to take effect after his death (Mudabbar), but he had no other property. When the Prophet (ﷺ) heard about it, he said, 'Who will buy him from me?' Nu'aim bin 'Abdullah bought him for eight hundred Dirhams. A version in Al-Bukhari adds: 'For he (the master) was in need.' In An-Nasa'i: 'He was in debt, so the Prophet (ﷺ) sold him for eight hundred Dirhams, gave him the money and said: Pay your debt.'"
      }
    },

    {
      "id": 1230,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- قَالَ: { \" اَلْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتَبَتِهِ دِرْهَمٌ\" } أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَنٍ ",
        "urdu": "سیدنا عمرو بن شعیب اپنے باپ سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” مکاتب (وہ غلام جس نے آزادی کے لیے رقم کا معاہدہ کیا ہو) اس وقت تک غلام ہی ہے جب تک اس کی مکاتبت کی رقم سے ایک درہم بھی باقی ہے۔“ اسے ابوداؤد نے حسن سند سے روایت کیا ہے۔",
        "english": "Narrated 'Amr bin Shu'aib, from his father, from his grandfather (RA): The Prophet (ﷺ) said: \"A slave who has made a contract for his freedom (Mukatab) remains a slave as long as a single Dirham of the agreed price remains unpaid.\""
      }
    },

    {
      "id": 1231,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { إِذَا كَانَ لِإِحْدَاكُنَّ مُكَاتَبٌ, وَكَانَ عِنْدَهُ مَا يُؤَدِّي, فَلْتَحْتَجِبْ مِنْهُ } رَوَاهُ اَلْخَمْسَةُ وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کسی عورت کا کوئی مکاتب غلام ہو اور اس کے پاس بدلِ کتابت (آزادی کی رقم) ادا کرنے کے لیے مال موجود ہو، تو اس عورت کو چاہیے کہ اس غلام سے پردہ کرے۔“",
        "english": "Narrated Umm Salama (RA): Allah's Messenger (ﷺ) said: 'If any of you has a Mukatab (a slave who has a contract to buy his freedom), and he has enough money to pay off the contract, she must observe Hijab (veil) before him.'"
      }
    },

    {
      "id": 1232,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { يُودَى اَلْمُكَاتَبُ بِقَدْرِ مَا عَتَقَ مِنْهُ دِيَةَ اَلْحُرِّ, وَبِقَدْرِ مَا رَقَّ مِنْهُ دِيَةَ اَلْعَبْدِ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ” مکاتب جتنا آزاد ہو چکا ہے اس قدر آزاد کی دیت وصول کرے گا اور جتنا ابھی غلام باقی ہے اس قدر غلام کی دیت دی جائے گی۔ “ اسے احمد، نسائی اور ابوداؤد نے روایت کیا ہے۔ ",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: \"The blood money (Diyah) for a Mukatab (a slave with a freedom contract) is paid according to the portion of him that is free as the Diyah of a free man, and according to the portion of him that is still enslaved as the Diyah of a slave.\""
      }
    },

    {
      "id": 1233,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ اَلْحَارِثِ‏- أَخِي جُوَيْرِيَةَ أُمِّ اَلْمُؤْمِنِينَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { مَا تَرَكَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عِنْدَ مَوْتِهِ دِرْهَمًا, وَلَا دِينَارًا, وَلَا عَبْدًا, وَلَا أَمَةً, وَلَا شَيْئًا, إِلَّا بَغْلَتَهُ اَلْبَيْضَاءَ, وَسِلَاحَهُ, وَأَرْضًا جَعَلَهَا صَدَقَةً } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا عمرو بن حارث رضی اللہ عنہ (ام المؤمنین سیدہ جویریہ رضی اللہ عنہا کے بھائی) سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی وفات کے وقت نہ کوئی درہم میراث میں چھوڑا اور نہ دینار، اور نہ کوئی غلام اور نہ لونڈی اور نہ کوئی اور چیز؛ سوائے اپنے سفید خچر، اپنے اسلحہ جنگ اور تھوڑی سی زمین کے جسے آپ صلی اللہ علیہ وسلم پہلے ہی صدقہ کر چکے تھے۔",
        "english": "Narrated 'Amr bin al-Harith (RA), the brother of Juwairiyah (the Mother of the Believers): When the Messenger of Allah (ﷺ) died, he left neither a Dirham nor a Dinar, nor a male slave nor a female slave, nor anything else except his white mule, his weapon, and a piece of land which he had given as Sadaqah (charity)."
      }
    },

    {
      "id": 1234,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَيُّمَا أَمَةٍ وَلَدَتْ مِنْ سَيِّدِهَا, فَهِيَ حُرَّةٌ بَعْدَ مَوْتِهِ } أَخْرَجَهُ اِبْنُ مَاجَهْ, وَالْحَاكِمُ بِإِسْنادٍ ضَعِيفٍ وَرَجَّحَ جَمَاعَةٌ وَقْفَهُ عَلَى عُمَرَ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس لونڈی نے اپنے آقا و مالک کے نطفہ سے بچہ جنا تو وہ مالک کی وفات کے بعد آزاد ہے۔ “ اس کی روایت ابن ماجہ اور حاکم نے ضعیف سند سے کی ہے اور ایک جماعت نے اس کے سیدنا عمر رضی اللہ عنہ پر موقوف ہونے کو ترجیح دی ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: 'Any female slave who gives birth to a child from her master, she is free after his death.' Reported by Ibn Majah and al-Hakim with a weak chain of narrators; and a group of scholars preferred it to be a statement of 'Umar (RA)."
      }
    },

    {
      "id": 1235,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ حُنَيْفٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ أَعَانَ مُجَاهِدًا فِي سَبِيلِ اَللَّهِ, أَوْ غَارِمًا فِي عُسْرَتِهِ, أَوْ مُكَاتَبًا فِي رَقَبَتِهِ, أَظَلَّهُ اَللَّهُ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ } رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا سہل بن حنیف رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے اللہ کی راہ میں کسی مجاہد کی مدد کی، یا کسی تنگ دست مقروض کی مالی اعانت کی، یا کسی مکاتب غلام کو اس کی آزادی کی رقم (بدلِ کتابت) کی ادائیگی میں مدد دی، تو اللہ تعالیٰ اسے اس دن اپنا سایہ نصیب فرمائے گا جس دن اس کے سائے کے علاوہ کوئی سایہ نہ ہو گا۔“",
        "english": "Narrated Sahl bin Hunaif (RA): The Messenger of Allah (ﷺ) said: 'He who helps a Mujahid (fighter in the cause of Allah), or a debtor in his difficulty, or a slave (Mukatab) who has a contract to buy his freedom, Allah will shade him on the Day when there will be no shade but His.'"
      }
    }
  ]
}
