{
  "chapId": 42,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 648,
    "to": 691
  },
  "hadiths": [
    {
      "id": 648,
      "name": {
        "arabic": " عَنْ رِفَاعَةَ بْنِ رَافِعٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-سُئِلَ: أَيُّ اَلْكَسْبِ أَطْيَبُ? قَالَ: { عَمَلُ اَلرَّجُلِ بِيَدِهِ, وَكُلُّ بَيْعٍ مَبْرُورٍ } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا رفاعہ بن رافع رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم سے پوچھا گیا کہ کون سی کمائی پاکیزہ تر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”آدمی کی اپنے ہاتھ کی محنت کی کمائی اور ہر وہ تجارت (بیع) جو نیکی اور سچائی پر مبنی ہو (یعنی دھوکے سے پاک ہو)۔“",
        "english": "Narrated Rifa'ah bin Rafi' (R.A): The Prophet (peace be upon him) was asked: \"Which type of earning is best?\" He replied: \"A man's work with his hands and every business transaction which is Mab rur (accepted/honest).\""
      }
    },

    {
      "id": 649,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ عَامَ اَلْفَتْحِ, وَهُوَ بِمَكَّةَ: { إِنَّ اَللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ اَلْخَمْرِ, وَالْمَيْتَةِ, وَالْخِنْزِيرِ, وَالْأَصْنَامِ.‏ فَقِيلَ: يَا رَسُولَ اَللَّهِ ! أَرَأَيْتَ شُحُومَ اَلْمَيْتَةِ, فَإِنَّهُ تُطْلَى بِهَا اَلسُّفُنُ, وَتُدْهَنُ بِهَا اَلْجُلُودُ, وَيَسْتَصْبِحُ بِهَا اَلنَّاسُ? فَقَالَ: \" لَا.‏ هُوَ حَرَامٌ \", ثُمَّ قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عِنْدَ ذَلِكَ: \" قَاتَلَ اَللَّهُ اَلْيَهُودَ, إِنَّ اَللَّهَ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا جَمَلُوهُ, ثُمَّ بَاعُوهُ, فَأَكَلُوا ثَمَنَهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو مکہ میں فتح مکہ کے سال یہ فرماتے سنا کہ ”بیشک اللہ اور اس کے رسول ( صلی اللہ علیہ وسلم ) نے شراب کی خرید و فروخت، مردار اور خنزیر کی خرید و فروخت اور بتوں کی تجارت کو حرام کر دیا ہے۔“ آپ صلی اللہ علیہ وسلم سے پوچھا گیا کہ اے اللہ کے رسول! مردار کی چربی کے متعلق کیا حکم ہے؟ اس لئے کہ اس سے کشتیوں کو طلاء کیا جاتا ہے اور چمڑوں کو چکنا کیا جاتا ہے اور لوگ اسے جلا کر روشنی حاصل کرتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں! وہ بھی حرام ہے۔“ پھر اس کے ساتھ ہی فرمایا ”اللہ تعالیٰ یہود کو غارت کرے، کہ جب اللہ تعالیٰ نے چربیوں کو یہود کے لئے حرام کر دیا تو انہوں نے اسے پگھلا کر فروخت کیا اور اس کی قیمت کھائی۔“ (بخاری و مسلم)",
        "english": "Narrated Jabir bin 'Abdullah (RA): He heard Allah's Messenger (ﷺ) saying in Makkah in the year of the Conquest: 'Allah and His Messenger have forbidden the sale of wine, dead animals, pigs, and idols.' It was said, 'O Messenger of Allah, what about the fat of dead animals, for it is used for caulking ships, greasing skins, and people use it for lamps?' He replied, 'No, it is forbidden.' Then Allah's Messenger (ﷺ) said, 'May Allah curse the Jews! When Allah forbade them from using the fat (of animals), they melted it down, sold it, and consumed its price.'"
      }
    },

    {
      "id": 650,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِذَا اِخْتَلَفَ اَلْمُتَبَايِعَانِ لَيْسَ بَيْنَهُمَا بَيِّنَةٌ, فَالْقَوْلُ مَا يَقُولُ رَبُّ اَلسِّلْعَةِ أَوْ يَتَتَارَكَانِ } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: ”جب خرید و فروخت کرنے والوں میں اختلاف ہو جائے اور ان کے درمیان کوئی گواہ (ثبوت) نہ ہو، تو اس وقت مال کے مالک (بیچنے والے) کی بات معتبر ہوگی یا پھر وہ دونوں اس سودے کو منسوخ کر دیں۔“",
        "english": "Narrated Ibn Mas'ud (R.A): I heard Allah's Messenger (peace be upon him) saying: \"When two parties to a transaction disagree and there is no evidence between them, the word of the owner of the goods (seller) is to be accepted, or they should cancel the transaction.\""
      }
    },

    {
      "id": 651,
      "name": {
        "arabic": "وَعَنْ أَبِي مَسْعُودٍ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ ثَمَنِ اَلْكَلْبِ, وَمَهْرِ الْبَغِيِّ, وَحُلْوَانِ اَلْكَاهِنِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابومسعود انصاری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت، بدکار و فاحشہ عورت کی اجرت و کمائی اور کاہن (نجومی) کی مٹھائی یا نذرانے سے منع فرمایا۔",
        "english": "Narrated Abu Mas'ud al-Ansari (RA): Allah's Messenger (ﷺ) forbade the price paid for a dog, the earnings of a prostitute, and the gift (money) given to a soothsayer."
      }
    },

    {
      "id": 652,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ أَعْيَا.‏ فَأَرَادَ أَنْ يُسَيِّبَهُ.‏ قَالَ: فَلَحِقَنِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَدَعَا لِي, وَضَرَبَهُ، فَسَارَ سَيْراً لَمْ يَسِرْ مِثْلَهُ, قَالَ: \" بِعْنِيهِ بِوُقِيَّةٍ \" قُلْتُ: لَا.‏ ثُمَّ قَالَ: \" بِعْنِيهِ \" فَبِعْتُهُ بِوُقِيَّةٍ, وَاشْتَرَطْتُ حُمْلَانَهُ إِلَى أَهْلِي, فَلَمَّا بَلَغْتُ أَتَيْتُهُ بِالْجَمَلِ, فَنَقَدَنِي ثَمَنَهُ, ثُمَّ رَجَعْتُ فَأَرْسَلَ فِي أَثَرِي.‏ فَقَالَ: \" أَتُرَانِي مَاكَسْتُكَ لِآخُذَ جَمَلَكَ? خُذْ جَمَلَكَ وَدَرَاهِمَكَ.‏ فَهُوَ لَكْ } مُتَّفَقٌ عَلَيْهِ , وَهَذَا اَلسِّيَاقُ لِمُسْلِمٍ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ وہ اپنے ایک درماندہ تھکے ماندے اونٹ پر سفر کر رہے تھے۔ انہوں نے اسے چھوڑنے کا ارادہ کر لیا۔ سیدنا جابر رضی اللہ عنہ کا بیان ہے کہ اتنے میں پیچھے سے نبی کریم صلی اللہ علیہ وسلم مجھے آ ملے۔ آپ صلی اللہ علیہ وسلم نے میرے لئے دعا فرمائی اور اونٹ کو مارا تو وہ ایسی تیز روی سے چلنے لگا کہ اس سے پہلے ایسی تیز رفتاری سے نہیں چلا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”مجھے یہ اونٹ ایک اوقیہ چاندی کے عوض فروخت کر دو۔“ میں نے عرض کیا نہیں۔ آپ صلی اللہ علیہ وسلم نے پھر دوبارہ فرمایا ”مجھے یہ اونٹ بیچ دو۔“ تو میں نے اسے آپ صلی اللہ علیہ وسلم کو بیچ دیا اور شرط یہ طے کی کہ اپنے گھر والوں تک (میں) سوار ہو کر جاؤں گا۔ پس جونہی (مدینہ) پہنچا تو میں وہ اونٹ لے کر آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو گیا۔ آپ صلی اللہ علیہ وسلم نے اس کی نقد قیمت مجھے ادا فرما دی۔ پھر میں (رقم وصول کر کے) واپس آ گیا۔ آپ صلی اللہ علیہ وسلم نے میرے پیچھے (اونٹ) بھیج دیا اور فرمایا کہ ”تیرا خیال ہے کہ میں نے اونٹ کی قیمت کم کی تاکہ تیرا اونٹ لے لوں؟ اپنا اونٹ لے لو اور رقم بھی اپنے پاس رکھو یہ تیرے لئے ہے۔“ (بخاری و مسلم) یہ سیاق مسلم میں ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): He was riding a camel which had become tired, so he wanted to let it go loose. He said: The Prophet (ﷺ) caught up with me and supplicated for me and struck the camel, and it started to move as it had never moved before. He (ﷺ) said, 'Sell it to me for an Uqiyah (of silver).' I said, 'No.' He again said, 'Sell it to me,' so I sold it for an Uqiyah but made a condition that I could ride it to my family. When I reached (Medina), I brought the camel to him and he paid me its price in cash. Then I left, but he sent someone after me and said, 'Do you think I bargained with you to take your camel? Take your camel and your dirhams; they are yours.'"
      }
    },

    {
      "id": 653,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { أَعْتَقَ رَجُلٌ مِنَّا عَبْداً لَهُ عَنْ دُبُرٍ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ.‏ فَدَعَا بِهِ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَبَاعَهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ ہم میں سے ایک شخص نے اپنے ایک غلام کو ’مدبر‘ کر دیا (یعنی یہ وصیت کی کہ میرے مرنے کے بعد یہ آزاد ہے)۔ اس کے پاس اس غلام کے سوا کوئی اور مال نہ تھا۔ نبی کریم صلی اللہ علیہ وسلم نے اس غلام کو منگوایا اور اسے فروخت کر دیا (تاکہ اس کی قیمت اس کے مالک کو مل سکے)۔",
        "english": "Narrated Jabir bin 'Abdullah (R.A): A man among us declared his slave to be free after his death (Mudabbar), and he had no other property besides him. So the Prophet (peace be upon him) called for the slave and sold him."
      }
    },

    {
      "id": 654,
      "name": {
        "arabic": "وَعَنْ مَيْمُونَةَ زَوْجِ اَلنَّبِيِّ صلى الله عليه وسلم: { أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ, فَمَاتَتْ فِيهِ, فَسُئِلَ اَلنَّبِيُّ صلى الله عليه وسلم عَنْهَا.‏ فَقَالَ: \" أَلْقُوهَا وَمَا حَوْلَهَا, وَكُلُوهُ \" } رَوَاهُ اَلْبُخَارِيُّ وَزَادَ أَحْمَدُ وَالنَّسَائِيُّ: فِي سَمْنٍ جَامِدٍ",
        "urdu": "سیدہ میمونہ رضی اللہ عنہا زوجہ رسول مقبول صلی اللہ علیہ وسلم سے روایت ہے کہ ایک چوہیا گھی میں گر کر مر گئی۔ اس کے متعلق نبی کریم صلی اللہ علیہ وسلم سے دریافت کیا گیا۔ (جواب میں) آپ صلی اللہ علیہ وسلم نے فرمایا: ”اسے نکال کر باہر پھینک دو اور اس کے اردگرد کا گھی بھی باہر ڈال دو اور (بقیہ) استعمال کر لو۔“ (بخاری) نسائی اور احمد نے اتنا اضافہ نقل کیا ہے: ”منجمد (جمے ہوئے) گھی میں۔“",
        "english": "Narrated Maimunah (RA): A mouse fell into some clarified butter (Ghee) and died in it. The Prophet (ﷺ) was asked about it and he said: 'Throw it and what is around it away, and eat the rest.' Reported by Al-Bukhari, and Ahmad and An-Nasa'i added: 'In solid clarified butter.'"
      }
    },

    {
      "id": 655,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا وَقَعَتْ اَلْفَأْرَةُ فِي اَلسَّمْنِ, فَإِنْ كَانَ جَامِداً فَأَلْقُوهَا وَمَا حَوْلَهَا, وَإِنْ كَانَ مَايِعًا فَلَا تَقْرَبُوهُ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَقَدْ حَكَمَ عَلَيْهِ اَلْبُخَارِيُّ وَأَبُو حَاتِمٍ بِالْوَهْمِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب چوہا گھی میں گر جائے، تو اگر گھی جما ہوا ہو تو چوہے کو اور اس کے ارد گرد کے گھی کو نکال کر پھینک دو، اور اگر وہ مائع (پگھلا ہوا) ہو تو اس کے قریب بھی نہ جاؤ (یعنی اسے استعمال نہ کرو)۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) said: \"If a mouse falls into clarified butter (Ghee), and it is solid, throw the mouse and the butter around it away; but if it is liquid, do not go near it (do not use it).\""
      }
    },

    {
      "id": 656,
      "name": {
        "arabic": "وَعَنْ أَبِي اَلزُّبَيْرِ قَالَ: سَأَلْتُ جَابِرًا عَنْ ثَمَنِ اَلسِّنَّوْرِ وَالْكَلْبِ? فَقَالَ: { زَجَرَ اَلنَّبِيُّ صلى الله عليه وسلم عَنْ ذَلِكَ } رَوَاهُ مُسْلِمٌ وَالنَّسَائِيُّ وَزَادَ: { إِلَّا كَلْبَ صَيْدٍ }",
        "urdu": "سیدنا ابوالزبیر رحمہ اللہ سے روایت ہے کہ میں نے سیدنا جابر رضی اللہ عنہ سے بلی اور کتے کی قیمت کے متعلق پوچھا، تو انہوں نے جواب دیا کہ نبی کریم صلی اللہ علیہ وسلم نے اس بارے میں زجر و توبیخ فرمائی ہے (یعنی سختی سے منع فرمایا ہے)۔ (مسلم و نسائی) اور نسائی میں اتنا اضافہ ہے کہ ”شکاری کتے کے علاوہ۔“",
        "english": "Narrated Abu az-Zubair: I asked Jabir (RA) about the price of a cat and a dog. He said, 'The Prophet (ﷺ) forbade that.' [Reported by Muslim and an-Nasa'i, and the latter added: 'except for a hunting dog']."
      }
    },

    {
      "id": 657,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: { جَاءَتْنِي بَرِيرَةُ, فَقَالَتْ: كَاتَبْتُ أَهْلِي عَلَى تِسْعٍ أُوَاقٍ, فِي كُلِّ عَامٍ أُوقِيَّةٌ, فَأَعِينِينِي.‏ فَقُلْتُ: إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ, فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا.‏ فَقَالَتْ لَهُمْ; فَأَبَوْا عَلَيْهَا, فَجَاءَتْ مِنْ عِنْدِهِمْ, وَرَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-جَالِسٌ.‏ فَقَالَتْ: إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ فَأَبَوْا إِلَّا أَنْ يَكُونَ اَلْوَلَاءُ لَهُمْ, فَسَمِعَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَأَخْبَرَتْ عَائِشَةُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَ: خُذِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ, فَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ فَفَعَلَتْ عَائِشَةُ, ثُمَّ قَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلنَّاسِ [ خَطِيباً ], فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ.‏ ثُمَّ قَالَ: \" أَمَّا بَعْدُ, مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطاً لَيْسَتْ فِي كِتَابِ اَللَّهِ عَزَّ وَجَلَّ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اَللَّهِ فَهُوَ بَاطِلٌ, وَإِنْ كَانَ مِائَةَ شَرْطٍ, قَضَاءُ اَللَّهِ أَحَقُّ, وَشَرْطُ اَللَّهِ أَوْثَقُ, وَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ \" } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ.",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ بریرہ رضی اللہ عنہا میرے پاس آئیں اور کہا: میں نے اپنے مالکوں سے نو اوقیہ چاندی پر مکاتبت کی ہے، ہر سال ایک اوقیہ ادا کروں گی، آپ میری مدد فرمائیں۔ میں نے کہا: اگر تمہارے مالک چاہیں تو میں یہ رقم یکمشت ادا کر دوں گی بشرطیکہ 'ولاء' میرا ہو۔ مالکوں نے انکار کیا اور کہا کہ ولاء ہمارا ہی رہے گا۔ نبی ﷺ نے یہ سن کر فرمایا: تم اسے خرید کر آزاد کر دو اور ولاء کی شرط ان کو کرنے دو، کیونکہ ولاء اسی کا حق ہے جو آزاد کرے۔ پھر آپ ﷺ نے خطبہ دیا اور فرمایا: ان لوگوں کا کیا حال ہے جو ایسی شرطیں لگاتے ہیں جو کتاب اللہ میں نہیں، ایسی ہر شرط باطل ہے چاہے وہ سو شرطیں ہی کیوں نہ ہوں۔",
        "english": "Narrated 'Aishah (R.A): Barira came to me and said, \"I have entered into a contract of manumission with my masters for nine Uqiyas (of silver), one Uqiya to be paid each year, so help me.\" I said, \"If your masters agree that I should pay them the whole amount and the right of inheritance (Wala') should be mine, I will do so.\" Her masters refused. Allah's Messenger (PBUH) heard this and said, \"Buy her and manumit her, and let them have the Wala', for the Wala' belongs only to the one who manumits.\" Then he stood and addressed the people, saying, \"What is the matter with people who lay down conditions which are not in Allah's Book? Any condition which is not in Allah's Book is invalid, even if there were a hundred such conditions.\""
      }
    },

    {
      "id": 658,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى عُمَرُ عَنْ بَيْعِ أُمَّهَاتِ اَلْأَوْلَادِ فَقَالَ: لَا تُبَاعُ, وَلَا تُوهَبُ, وَلَا تُورَثُ, لِيَسْتَمْتِعْ بِهَا مَا بَدَا لَهُ، فَإِذَا مَاتَ فَهِيَ حُرَّةٌ } رَوَاهُ مَالِكٌ, وَالْبَيْهَقِيُّ, وَقَالَ: رَفَعَهُ بَعْضُ اَلرُّوَاةِ, فَوَهِمَ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ سیدنا عمر رضی اللہ عنہ نے ام ولد (وہ لونڈی جس سے اس کے مالک کی اولاد پیدا ہو) کو فروخت کرنے سے منع کیا اور فرمایا کہ نہ یہ فروخت ہو سکتی ہے، نہ ہبہ کی جا سکتی ہے اور نہ ہی وراثت میں تقسیم ہو سکتی ہے۔ مالک جب تک زندہ ہے اس سے فائدہ اٹھائے، اور جب وہ فوت ہو جائے تو وہ آزاد ہے۔ اسے مالک اور بیہقی نے روایت کیا ہے اور کہا ہے کہ بعض راویوں نے اسے مرفوع (نبی ﷺ کا فرمان) کہا ہے مگر وہ وہم ہے۔",
        "english": "Narrated Ibn 'Umar (RA): 'Umar (RA) forbade the sale of the mothers of children (Ummhat al-Awlad) and said: 'They are neither to be sold, nor given as a gift, nor inherited. Their master may enjoy them as long as he lives, and when he dies, they are free.' Reported by Malik and al-Bayhaqi, who noted that some narrators attributed it to the Prophet (ﷺ), but that was an error."
      }
    },

    {
      "id": 659,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { كُنَّا نَبِيعُ سَرَارِيَنَا, أُمَّهَاتِ اَلْأَوْلَادِ, وَالنَّبِيُّ ‏- صلى الله عليه وسلم ‏-حَيٌّ, لَا نَرَى بِذَلِكَ بَأْسًا } رَوَاهُ النَّسَائِيُّ, وَابْنُ مَاجَهْ وَاَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ ہم اپنی ان لونڈیوں کو جو صاحبِ اولاد (ام ولد) ہو چکی ہوتی تھیں، نبی کریم صلی اللہ علیہ وسلم کی زندگی میں فروخت کر دیا کرتے تھے اور ہم اس میں کوئی حرج محسوس نہیں کرتے تھے۔ اسے نسائی، ابن ماجہ اور دارقطنی نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Jabir (R.A): We used to sell our slave-girls who had borne children (Ummahat al-Awlad) while the Prophet (peace be upon him) was alive, and we did not see any harm in that."
      }
    },

    {
      "id": 660,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ فَضْلِ اَلْمَاءِ } رَوَاهُ مُسْلِمٌ وَزَادَ فِي رِوَايَةٍ: { وَعَنْ بَيْعِ ضِرَابِ اَلْجَمَلِ }",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے زائد از ضرورت پانی کو فروخت کرنے سے منع فرمایا ہے۔ (مسلم) اور ایک روایت میں یہ اضافہ ہے کہ اونٹ کی جفتی (نسل کشی کے لیے نر اونٹ کے استعمال) کا معاوضہ لینا بھی ممنوع ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): Allah's Messenger (ﷺ) forbade the sale of excess water. [Reported by Muslim]. In another narration, there is an addition: 'And he forbade the sale of the camel's stallion hire (mating).'"
      }
    },

    {
      "id": 661,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ عَسْبِ اَلْفَحْلِ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے نر جانور کی جفتی کے معاوضہ (کرایہ) لینے سے منع فرمایا ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): Allah's Messenger (peace be upon him) forbade the price of a stud-camel's (or any male animal's) hire."
      }
    },

    {
      "id": 662,
      "name": {
        "arabic": "وَعَنْ ابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ اَلْحَبَلَةِ, وَكَانَ بَيْعاً يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ: كَانَ اَلرَّجُلُ يَبْتَاعُ اَلْجَزُورَ إِلَى أَنْ تُنْتَجَ اَلنَّاقَةُ, ثُمَّ تُنْتَجُ اَلَّتِي فِي بَطْنِهَا } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حبل الحبلہ کی بیع سے منع فرمایا ہے اور یہ بیع دور جاہلیت میں رائج تھی کہ آدمی اونٹنی اس شرط پر خریدتا کہ اس کی قیمت اس وقت دے گا جب اونٹنی بچہ جنے، پھر وہ بچہ جو ابھی پیدا نہیں ہوا بڑا ہو کر آگے بچہ جنے۔ (بخاری و مسلم) اور یہ الفاظ بخاری کے ہیں۔",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) forbade the sale of 'Habal al-Habalah' which was a type of sale practiced in the pre-Islamic period of ignorance (Jahiliyyah). A man would buy a camel (on credit) until a she-camel gives birth, and then the offspring in its womb itself gives birth."
      }
    },

    {
      "id": 663,
      "name": {
        "arabic": "وَعَنْهُ; { أَنَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْوَلَاءُ, وَعَنْ هِبَتِهِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے ہی مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ولاء (آزاد کردہ غلام کی وراثت کا حق) فروخت کرنے اور اسے ہبہ (تحفہ میں دینے) سے منع فرمایا ہے۔",
        "english": "Narrated the same narrator (Ibn 'Umar): Allah's Messenger (peace be upon him) forbade the sale of the right of inheritance (Wala') of a freed slave and also giving it as a gift."
      }
    },

    {
      "id": 664,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ اَلْحَصَاةِ, وَعَنْ بَيْعِ اَلْغَرَرِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کنکری پھینک کر تجارت کرنے اور دھوکے کی تجارت سے منع فرمایا ہے۔ (مسلم) (نوٹ: کنکری والی تجارت سے مراد یہ ہے کہ خریدنے والا کچھ روپے کے بدلے میں کنکری پھینکتا اور وہ کنکری جس چیز کو لگتی وہ لے جاتا۔)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) forbade transaction by tossing stones (al-Hasah) and also type of transaction which involves uncertainty (al-Gharar)."
      }
    },

    {
      "id": 665,
      "name": {
        "arabic": "وَعَنْهُ: أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنِ اِشْتَرَى طَعَاماً فَلَا يَبِعْهُ حَتَّى يَكْتَالَهُ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کوئی غلہ (اناج) خریدا، وہ اسے اس وقت تک فروخت نہ کرے جب تک کہ اسے ماپ (ناپ) نہ لے۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) said: \"Whoever buys food grain, he should not sell it until he has measured it.\""
      }
    },

    {
      "id": 666,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ } رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ وَلِأَبِي دَاوُدَ: { مَنْ بَاعَ بَيْعَتَيْنِ فِي بَيْعَةٍ فَلَهُ أَوَكَسُهُمَا, أَوْ اَلرِّبَا }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ ہی سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک بیع میں دو بیعوں سے منع فرمایا ہے۔ (احمد و نسائی) اور ترمذی اور ابن حبان نے اسے صحیح قرار دیا ہے اور ابوداؤد کی روایت میں ہے کہ جس کسی نے ایک چیز کی دو قیمتیں مقرر کیں، وہ یا تو کم قیمت لے لے، یا پھر وہ سود ہو گا۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) forbade two transactions in one. [Reported by Ahmad and an-Nasa'i, and at-Tirmidhi and Ibn Hibban graded it Sahih]. In the version of Abu Dawud: 'He who makes two transactions in one, shall have the lower of the two prices, otherwise it will be usury (Riba).'"
      }
    },

    {
      "id": 667,
      "name": {
        "arabic": "وَعَنْ عَمْرِوِ بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَحِلُّ سَلَفٌ وَبَيْعٌ وَلَا شَرْطَانِ فِي بَيْعٍ, وَلَا رِبْحُ مَا لَمْ يُضْمَنْ, وَلَا بَيْعُ مَا لَيْسَ عِنْدَكَ } رَوَاهُ اَلْخَمْسَةُ",
        "urdu": "سیدنا عمرو بن شعیب نے اپنے والد سے اور انھوں نے اپنے دادا سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قرض اور بیع ایک ساتھ حلال نہیں، اور نہ ایک بیع میں دو شرطیں حلال ہیں، اور نہ اس چیز کا نفع حلال ہے جو (تمہارے قبضے میں نہ ہونے کی وجہ سے) تمہارے ضمان (ذمہ داری) میں نہ ہو، اور جو چیز تمہارے پاس موجود نہ ہو اسے فروخت کرنا بھی جائز نہیں۔“",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority from his grandfather, that Allah's Messenger (peace be upon him) said: \"The combination of a loan and a sale is not lawful, nor are two conditions in one sale, nor is the profit on something which is not under one's responsibility (guaranteed), nor is the sale of what you do not possess.\""
      }
    },

    {
      "id": 668,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- عَنْ بَيْعِ اَلْعُرْبَانِ } رَوَاهُ مَالِكٌ, قَالَ: بَلَغَنِي عَنْ عَمْرِو بْنِ شُعَيْبٍ, بِهِ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع عربان (بیعانہ ضبط کرنے والی تجارت) سے منع فرمایا۔ اسے امام مالک نے روایت کیا ہے اور فرمایا کہ مجھے یہ روایت عمرو بن شعیب سے پہنچی ہے۔",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority from his grandfather: 'Allah's Messenger (ﷺ) forbade the 'Arban sale (earnest money sale).' [Reported by Malik, who said: 'It has reached me from 'Amr bin Shu'aib'].'"
      }
    },

    {
      "id": 669,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { اِبْتَعْتُ زَيْتاً فِي اَلسُّوقِ, فَلَمَّا اِسْتَوْجَبْتُهُ لَقِيَنِي رَجُلٌ فَأَعْطَانِي بِهِ رِبْحاً حَسَناً، فَأَرَدْتُ أَنْ أَضْرِبَ عَلَى يَدِ اَلرَّجُلِ، فَأَخَذَ رَجُلٌ مِنْ خَلْفِي بِذِرَاعِي، فَالْتَفَتُّ, فَإِذَا هُوَ زَيْدُ بْنُ ثَابِتٍ, فَقَالَ: لَا تَبِعْهُ حَيْثُ اِبْتَعْتَهُ حَتَّى تَحُوزَهُ إِلَى رَحْلِكَ; فَإِنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى أَنْ تُبَاعَ اَلسِّلَعُ حَيْثُ تُبْتَاعُ, حَتَّى يَحُوزَهَا اَلتُّجَّارُ إِلَى رِحَالِهِمْ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ وَاللَّفْظُ لَهُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ میں نے بازار سے تیل خریدا۔ جب میں نے اسے وصول کر لیا تو ایک شخص مجھے ملا اور اس نے مجھے بہت اچھے منافع کی پیشکش کی۔ میں نے اس کے ہاتھ پر ہاتھ مار کر سودا پکا کرنے کا ارادہ کیا ہی تھا کہ پیچھے سے ایک آدمی نے میرا بازو پکڑ لیا۔ مڑ کر دیکھا تو وہ سیدنا زید بن ثابت رضی اللہ عنہ تھے۔ انہوں نے کہا: اسے اسی جگہ نہ بیچنا جہاں سے تم نے خریدا ہے یہاں تک کہ تم اسے اپنے ٹھکانے پر منتقل نہ کر لو، کیونکہ رسول اللہ ﷺ نے منع فرمایا ہے کہ سامان کو وہیں بیچ دیا جائے جہاں سے خریدا گیا ہے جب تک کہ تاجر اسے اپنے قبضے میں لے کر اپنی جگہ پر نہ لے جائیں۔",
        "english": "Narrated Ibn 'Umar (R.A): I bought some olive oil in the market, and when it became my possession, a man met me and offered me a good profit for it. I intended to strike a bargain with the man, but a man from behind me caught hold of my arm. I turned around and saw that he was Zaid bin Thabit. He said: \"Do not sell it where you bought it until you take it to your own place, for Allah's Messenger (peace be upon him) forbade that goods should be sold where they are bought until the traders take them to their own dwellings.\""
      }
    },

    {
      "id": 670,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! إِنِّي أَبِيعُ بِالْبَقِيعِ, فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ اَلدَّرَاهِمَ, وَأَبِيعُ بِالدَّرَاهِمِ وَآخُذُ اَلدَّنَانِيرَ, آخُذُ هَذَا مِنْ هَذِهِ وَأُعْطِي هَذِهِ مِنْ هَذَا? فَقَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: لَا بَأْسَ أَنْ تَأْخُذَهَا بِسِعْرِ يَوْمِهَا مَا لَمْ تَتَفَرَّقَا وَبَيْنَكُمَا شَيْءٌ } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے ہی روایت ہے کہ ”میں نے عرض کی اے اللہ کے رسول! میں بقیع میں اونٹوں کی تجارت کرتا ہوں۔ دینار میں فروخت کر کے درہم وصول کرتا ہوں اور (کبھی ایسا بھی ہوتا ہے کہ) میں فروخت تو درہم میں کرتا ہوں اور دینار وصول کرتا ہوں (یعنی) دینار کے بدلے میں درہم اور درہم کے بدلے میں دینار لیتا ہوں۔ اس کے عوض وہ لیتا ہوں اور اس کے بدلے میں یہ دیتا ہوں۔“ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر اسی روز کے بھاؤ سے ان کا تبادلہ کر لو اور خرید و فروخت کرنے والوں کے ایک دوسرے سے جدا ہونے سے پہلے رقم کا کوئی حصہ کسی کے ذمہ باقی نہ رہے تو جائز ہے۔“ اسے پانچوں نے روایت کیا ہے اور حاکم نے صحیح کہا ہے۔",
        "english": "Narrated Ibn 'Umar (RA): I said, 'O Messenger of Allah! I sell camels at al-Baqi'. I sell them for Dinar (gold) and take Dirhams (silver) instead, and I sell for Dirhams and take Dinars instead. I take this for that and give that for this.' Allah's Messenger (ﷺ) said, 'There is no harm in your taking them at the current rate of the day as long as you do not separate from each other while something is still outstanding between you.'"
      }
    },

    {
      "id": 671,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ النَّجْشِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے 'نجش' (مصنوعی طور پر قیمت بڑھانے) سے منع فرمایا ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): Allah's Messenger (peace be upon him) forbade Najsh (artificially inflating the price of a commodity)."
      }
    },

    {
      "id": 672,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ اَلْمُحَاقَلَةِ, وَالْمُزَابَنَةِ, وَالْمُخَابَرَةِ, وَعَنْ اَلثُّنْيَا, إِلَّا أَنْ تُعْلَمَ } رَوَاهُ اَلْخَمْسَةُ إِلَّا اِبْنَ مَاجَهْ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع محاقلہ، مزابنہ، مخابرہ اور استثنا (سودے میں سے کچھ حصہ الگ رکھنے) سے منع فرمایا ہے، مگر یہ کہ اس استثنا کی مقدار معلوم کر لی جائے۔ اسے ابن ماجہ کے علاوہ پانچوں نے روایت کیا ہے اور ترمذی نے صحیح قرار دیا ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): The Prophet (ﷺ) forbade Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah, and Ath-Thunya (making an exception in a sale), unless the exception is known."
      }
    },

    {
      "id": 673,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ اَلْمُحَاقَلَةِ, وَالْمُخَاضَرَةِ, وَالْمُلَامَسَةِ, وَالْمُنَابَذَةِ, وَالْمُزَابَنَةِ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع محاقلہ، مخاضرہ، ملامسہ، منابذہ اور مزابنہ سے منع فرمایا ہے۔",
        "english": "Narrated Anas (R.A): Allah's Messenger (peace be upon him) forbade Al-Muhaqalah, Al-Mukhadharah, Al-Mulamasah, Al-Munabadhah and Al-Muzabanah."
      }
    },

    {
      "id": 674,
      "name": {
        "arabic": " وَعَنْ طَاوُسٍ, عَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَلَقَّوْا اَلرُّكْبَانَ, وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ \".‏ قُلْتُ لِابْنِ عَبَّاسٍ: مَا قَوْلُهُ: \" وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ? \" قَالَ: لَا يَكُونُ لَهُ سِمْسَارًا } مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا طاؤس نے سیدنا ابن عباس رضی اللہ عنہما سے روایت بیان کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سامانِ تجارت لے کر آنے والے قافلوں کو آگے جا کر نہ ملو اور کوئی شہری کسی دیہاتی کا سامان نہ بیچے۔“ طاؤس کہتے ہیں کہ میں نے ابن عباس سے پوچھا: ”شہری دیہاتی کا سامان فروخت نہ کرے“ کا کیا مطلب ہے؟ انہوں نے جواب دیا: ”وہ اس کا دلال (Middleman) نہ بنے۔“",
        "english": "Narrated Tawus: Ibn 'Abbas (R.A) said that Allah's Messenger (peace be upon him) said: \"Do not go out to meet the riders (caravans), and a town-dweller must not sell for a desert-dweller.\" I asked Ibn 'Abbas, \"What does it mean: a town-dweller must not sell for a desert-dweller?\" He said: \"He should not be a broker for him.\""
      }
    },

    {
      "id": 675,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَلَقَّوا اَلْجَلَبَ، فَمَنْ تُلُقِّيَ فَاشْتُرِيَ مِنْهُ, فَإِذَا أَتَى سَيِّدُهُ اَلسُّوقَ فَهُوَ بِالْخِيَارِ } .‏ رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”باہر سے مال لانے والے قافلوں کا آگے بڑھ کر استقبال نہ کرو (یعنی راستے میں سودا نہ کرو)۔ جس کسی کا آگے بڑھ کر استقبال کیا گیا اور اس سے سامان خرید لیا گیا، تو جب اس مال کا مالک منڈی پہنچے گا تو اسے اختیار ہوگا (کہ وہ چاہے تو سودا برقرار رکھے یا اسے منسوخ کر دے)۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) said: \"Do not go out to meet the riders (the trade caravans) to meet them on the way for business. If anyone meets them and buys something from them, the owner of the goods has the option (to cancel the deal) when he reaches the market.\""
      }
    },

    {
      "id": 676,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُ قَالَ: { نَهَى رَسُولُ اَللَّهِ صلى الله عليه وسلم أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ, وَلَا تَنَاجَشُوا, وَلَا يَبِيعُ اَلرَّجُلُ عَلَى بَيْعِ أَخِيهِ, وَلَا يَخْطُبُ عَلَى خِطْبَةِ أَخِيهِ, وَلَا تُسْأَلُ اَلْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْفَأَ مَا فِي إِنَائِهَا } مُتَّفَقٌ عَلَيْهِ وَلِمُسْلِمٍ: { لَا يَسُمِ اَلْمُسْلِمُ عَلَى سَوْمِ اَلْمُسْلِمِ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ ہی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ ”شہری دیہاتی کا سامان بیچے اور (خریدنے کا ارادہ نہیں تو محض دھوکہ دینے کے لیے) بھاؤ مت بڑھاؤ (نجش)۔ کوئی شخص اپنے بھائی کے سودے پر سودا نہ کرے اور کوئی اپنے بھائی کے پیغامِ نکاح پر اپنا پیغام نہ دے اور کوئی عورت اپنی دوسری (مسلمان) بہن کی طلاق کا مطالبہ نہ کرے تاکہ جو اس کے برتن میں ہے وہ خود حاصل کر لے۔“ (بخاری و مسلم) اور صحیح مسلم کی ایک روایت میں ہے کہ ”کوئی مسلمان اپنے کسی مسلمان بھائی کے بھاؤ پر اپنا بھاؤ نہ لگائے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) forbade that a townsman should sell for a desert-dweller. Do not practice Najsh (bidding high without intending to buy). A man should not make an offer over the offer of his brother, and he should not propose (marriage) over the proposal of his brother. A woman should not ask for the divorce of her sister (another woman) so as to take for herself what is in her bowl (empty her bowl for her own benefit). [Agreed upon]. Muslim has: 'A Muslim should not bid against the bid of a Muslim.'"
      }
    },

    {
      "id": 677,
      "name": {
        "arabic": "وَعَنْ أَبِي أَيُّوبَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ فَرَّقَ بَيْنَ وَالِدَةٍ وَوَلَدِهَا, فَرَّقَ اَللَّهُ بَيْنَهُ وَبَيْنَ أَحِبَّتِهِ يَوْمَ اَلْقِيَامَةِ } رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ",
        "urdu": "سیدنا ابوایوب انصاری رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: ”جس نے (خرید و فروخت یا کسی اور ذریعے سے) ماں اور اس کے بچے کے درمیان جدائی ڈالی، اللہ تعالیٰ قیامت کے روز اس کے اور اس کے پیاروں کے درمیان جدائی ڈال دے گا۔“",
        "english": "Narrated Abu Aiyub al-Ansari (R.A): I heard Allah's Messenger (peace be upon him) saying: \"Whoever separates a mother from her child, Allah will separate him from his loved ones on the Day of Resurrection.\""
      }
    },

    {
      "id": 678,
      "name": {
        "arabic": "وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏- رضى الله عنه ‏- قَالَ: { أَمَرَنِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ أَبِيعَ غُلَامَيْنِ أَخَوَيْنِ, فَبِعْتُهُمَا, فَفَرَّقْتُ بَيْنَهُمَا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: أَدْرِكْهُمَا, فَارْتَجِعْهُمَا, وَلَا تَبِعْهُمَا إِلَّا جَمِيعًا } رَوَاهُ أَحْمَدُ, وَرِجَالُهُ ثِقَاتٌ, وَقَدْ صَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ, وَالطَّبَرَانِيُّ, وَابْنُ اَلْقَطَّانِ",
        "urdu": "سیدنا علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ میں دو غلام بھائیوں کو فروخت کروں۔ میں نے ان دونوں کو الگ الگ آدمیوں کے ہاتھ فروخت کر دیا اور پھر آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا ”دونوں کو جا کر واپس لے آؤ اور اکٹھا ہی فروخت کرو۔“ اسے احمد نے روایت کیا ہے۔ اس کے راوی ثقہ ہیں اور اسے ابن خزیمہ، ابن جارود، ابن حبان، حاکم، طبرانی اور ابن قطان نے صحیح قرار دیا ہے۔",
        "english": "Narrated 'Ali bin Abi Talib (RA): Allah's Messenger (ﷺ) commanded me to sell two brothers (who were slaves). I sold them separately (to different people) and then mentioned that to the Prophet (ﷺ). He said, 'Go and get them back, and do not sell them except together.'"
      }
    },

    {
      "id": 679,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ - رضى الله عنه - قَالَ: { غَلَا اَلسِّعْرُ بِالْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -فَقَالَ اَلنَّاسُ: يَا رَسُولَ اَللَّهِ ! غَلَا اَلسِّعْرُ, فَسَعِّرْ لَنَا, فَقَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -إِنَّ اَللَّهَ هُوَ اَلْمُسَعِّرُ, اَلْقَابِضُ, اَلْبَاسِطُ, الرَّازِقُ, وَإِنِّي لَأَرْجُو أَنْ أَلْقَى اَللَّهَ-تَعَالَى-, وَلَيْسَ أَحَدٌ مِنْكُمْ يَطْلُبُنِي بِمَظْلِمَةٍ فِي دَمٍ وَلَا مَالٍ } رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں مدینہ منورہ میں چیزوں کا بھاؤ چڑھ گیا۔ لوگوں نے عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم ! اشیاء کے نرخ تیز ہو گئے ہیں، آپ ہمارے لئے نرخ مقرر فرما دیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نرخ کا تعین کرنے والا اللہ تعالیٰ ہے، وہی تنگی کرنے والا، وہی کشادگی کرنے والا اور روزی دینے والا ہے اور میں چاہتا ہوں کہ اللہ تعالیٰ سے اس حال میں ملاقات کروں کہ کوئی شخص تم میں سے مجھ سے خون یا مال میں کسی ظلم کا مطالبہ کرنے والا نہ ہو۔“",
        "english": "Narrated Anas bin Malik (R.A): Prices became high in Al-Madinah during the time of the Messenger of Allah (peace be upon him). The people said: \"O Messenger of Allah, prices have become high, so fix them for us.\" The Messenger of Allah (peace be upon him) replied: \"Allah is the One Who fixes prices, He is the One Who withholds, the One Who gives in abundance, and the One Who provides. I hope to meet Allah with no one among you having a claim against me for an injustice regarding blood or property.\""
      }
    },

    {
      "id": 680,
      "name": {
        "arabic": "وَعَنْ مَعْمَرِ بْنِ عَبْدِ اَللَّهِ ‏- رضى الله عنه ‏- عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحْتَكِرُ إِلَّا خَاطِئٌ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا معمر بن عبداللہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”خطاکار کے سوا ذخیرہ اندوزی کوئی نہیں کرتا۔“ (مسلم)",
        "english": "Narrated Ma'mar bin 'Abdullah (RA): Allah's Messenger (ﷺ) said: 'No one hoards (goods) but a sinner.'"
      }
    },

    {
      "id": 681,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَصُرُّوا اَلْإِبِلَ وَالْغَنَمَ, فَمَنِ اِبْتَاعَهَا بَعْدُ فَإِنَّهُ بِخَيْرِ اَلنَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا, إِنْ شَاءَ أَمْسَكَهَا, وَإِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ تَمْرٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اونٹوں اور بھیڑ بکریوں کے تھنوں میں دودھ روک کر نہ رکھو (تاکہ وہ زیادہ دودھ دینے والی نظر آئیں)۔ جس کسی نے ایسا جانور خریدا تو اسے دودھ دوہنے کے بعد دو باتوں میں سے بہتر کے اختیار کرنے کا حق حاصل ہے، چاہے تو اسے اپنے پاس رکھ لے اور چاہے تو ایک صاع کھجور ساتھ دے کر اسے واپس کر دے۔“",
        "english": "Narrated Abu Hurairah (R.A): The Prophet (peace be upon him) said: \"Do not withhold the milk in the udders of camels and sheep (to deceive the buyer). If anyone buys such an animal, he has the better of two choices after milking it: if he is satisfied, he may keep it, but if he is dissatisfied, he may return it along with a Sa' (measure) of dates.\""
      }
    },

    {
      "id": 682,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ رَضِيَ اَللَّهُ عَنْهُ قَالَ: { مَنِ اِشْتَرَى شَاةً مَحَفَّلَةً, فَرَدَّهَا, فَلْيَرُدَّ مَعَهَا صَاعًا } رَوَاهُ اَلْبُخَارِيُّ وَزَادَ اَلْإِسْمَاعِيلِيُّ: مِنْ تَمْرٍ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہ سے روایت ہے کہ جو شخص ایسی بکری خریدے جس کا دودھ تھنوں میں روک دیا گیا ہو (تاکہ وہ خریدار کو زیادہ دودھ دینے والی لگے)، پھر (عیب معلوم ہونے پر) وہ اسے واپس کرے تو اسے چاہیے کہ اس بکری کے ساتھ ایک صاع (غلہ) واپس کرے۔ (بخاری) اور اسماعیلی نے اتنا اضافہ نقل کیا ہے کہ: ”ایک صاع کھجوریں۔“",
        "english": "Narrated Ibn Mas'ud (RA): 'Whoever buys a goat whose milk has been left to collect in the udders (to deceive the buyer), and then returns it, he must return with it a Sa' (of grain).' Reported by Al-Bukhari, and al-Isma'ili added: 'of dates.'"
      }
    },

    {
      "id": 683,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مَرَّ عَلَى صُبْرَةِ طَعَامٍ, فَأَدْخَلَ يَدَهُ فِيهَا, فَنَالَتْ أَصَابِعُهُ بَلَلًا , فَقَالَ: \" مَا هَذَا يَا صَاحِبَ اَلطَّعَامِ? \" قَالَ: أَصَابَتْهُ اَلسَّمَاءُ يَا رَسُولَ اَللَّهِ.‏ فَقَالَ: أَفَلَا جَعَلْتَهُ فَوْقَ اَلطَّعَامِ; كَيْ يَرَاهُ اَلنَّاسُ? مَنْ غَشَّ فَلَيْسَ مِنِّي } رَوَاهُ اَلْخَمْسَةُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا گزر اناج کے ایک ڈھیر پر ہوا۔ آپ صلی اللہ علیہ وسلم نے اپنا ہاتھ اس ڈھیر کے اندر ڈالا تو آپ کی انگلیوں کو نمی محسوس ہوئی۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اے غلے کے مالک! یہ کیا ہے؟“ اس نے عرض کیا: اللہ کے رسول! اس پر بارش پڑ گئی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تم نے اس نمی والے حصے کو اوپر کیوں نہ رکھا تاکہ لوگ اسے دیکھ لیتے؟ جس نے دھوکہ دیا اس کا مجھ سے کوئی تعلق نہیں۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) happened to pass by a heap of food grain. He thrust his hand into it and his fingers felt some dampness. He said, \"What is this, O owner of the food grain?\" He replied, \"It was hit by the rain, O Messenger of Allah.\" He (PBUH) said, \"Why did you not put the damp part on top so that people could see it? Whoever deceives has nothing to do with me.\""
      }
    },

    {
      "id": 684,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ بُرَيْدَةَ, عَنْ أَبِيهِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ حَبَسَ اَلْعِنَبَ أَيَّامَ اَلْقِطَافِ, حَتَّى يَبِيعَهُ مِمَّنْ يَتَّخِذُهُ خَمْراً, فَقَدَ تَقَحَّمَ اَلنَّارَ عَلَى بَصِيرَةٍ } .‏ رَوَاهُ اَلطَّبَرَانِيُّ فِي \" اَلْأَوْسَطِ \" بِإِسْنَادٍ حَسَنٍ",
        "urdu": "سیدنا عبداللہ بن بریدہ اپنے والد (بریدہ رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے انگور اتارنے کے ایام میں ان کو روک لیا، تاکہ اسے کسی ایسے شخص کے ہاتھ فروخت کرے جو اس سے شراب بنائے، تو وہ جانتے بوجھتے آگ (جہنم) میں گر گیا۔“ اسے طبرانی نے اوسط میں حسن سند سے روایت کیا ہے۔",
        "english": "Narrated 'Abdullah bin Buraidah (RA) on the authority of his father: Allah's Messenger (ﷺ) said: 'Whoever withholds grapes during the harvest season until he sells them to someone who will take them to make wine, has certainly leaped into the Fire with open eyes (knowingly).'"
      }
    },

    {
      "id": 685,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْخَرَاجُ بِالضَّمَانِ } رَوَاهُ اَلْخَمْسَةُ, وَضَعَّفَهُ اَلْبُخَارِيُّ, وَأَبُو دَاوُدَ وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ, وَابْنُ اَلْقَطَّانِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”آمدن (نفع) ضمان (نقصان کی ذمہ داری) کے بدلے ہے۔“",
        "english": "Narrated 'Aishah (R.A): Allah's Messenger (peace be upon him) said: \"The profit (obtained from an item) is for the one who bears the responsibility (for any loss involving it).\""
      }
    },

    {
      "id": 686,
      "name": {
        "arabic": "وَعَنْ عُرْوَةَ الْبَارِقِيِّ رَضِيَ اَللَّهُ عَنْهُ أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ دِينَارًا يَشْتَرِي بِهِ أُضْحِيَّةً, أَوْ شَاةً, فَاشْتَرَى شَاتَيْنِ, فَبَاعَ إِحْدَاهُمَا بِدِينَارٍ, فَأَتَاهُ بِشَاةٍ وَدِينَارٍ, فَدَعَا لَهُ بِالْبَرَكَةِ فِي بَيْعِهِ, فَكَانَ لَوْ اِشْتَرَى تُرَابًا لَرَبِحَ فِيهِ } رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ",
        "urdu": "سیدنا عروہ بارقی رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو قربانی کا جانور یا بکری خریدنے کیلئے ایک دینار عطا فرمایا۔ انہوں نے ایک دینار کے عوض دو بکریاں خریدیں۔ پھر ان دو میں سے ایک کو ایک دینار کے عوض فروخت کر دیا اور ایک بکری اور ایک دینار لے کر آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ آپ صلی اللہ علیہ وسلم نے ان کیلئے ان کی تجارت میں برکت کی دعا فرمائی۔ پس وہ ایسے تھے کہ اگر مٹی بھی خرید لیتے تو اس میں بھی انہیں ضرور منافع حاصل ہوتا۔",
        "english": "Narrated 'Urwah al-Bariqi (RA): The Prophet (ﷺ) gave him a Dinar to buy a sacrificial animal or a sheep. He bought two sheep for him with the Dinar, sold one of them for a Dinar, and brought him a sheep and a Dinar. The Prophet (ﷺ) supplicated for blessing in his business dealings, and (as a result), even if he had bought dust, he would have made a profit from it."
      }
    },

    {
      "id": 687,
      "name": {
        "arabic": "وَعَنِ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ شِرَاءِ مَا فِي بُطُونِ اَلْأَنْعَامِ حَتَّى تَضَعَ, وَعَنْ بَيْعِ مَا فِي ضُرُوعِهَا, وَعَنْ شِرَاءِ اَلْعَبْدِ وَهُوَ آبِقٌ, وَعَنْ شِرَاءِ اَلْمَغَانِمِ حَتَّى تُقْسَمَ, وَعَنْ شِرَاءِ اَلصَّدَقَاتِ حَتَّى تُقْبَضَ, وَعَنْ ضَرْبَةِ اَلْغَائِصِ } رَوَاهُ اِبْنُ مَاجَهْ, وَالْبَزَّارُ, وَاَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے چوپایوں کے پیٹ میں موجود بچے کو اس کی پیدائش سے پہلے خریدنے سے، تھنوں میں موجود دودھ کو دوہنے سے پہلے فروخت کرنے سے، بھاگے ہوئے غلام کو خریدنے سے، مالِ غنیمت کو تقسیم سے پہلے خریدنے سے، صدقات کے مال کو قبضے سے پہلے خریدنے سے، اور غواص (غوطہ خور) کے ایک غوطے کے نتیجے کو (پہلے سے قیمت طے کر کے) خریدنے سے منع فرمایا ہے۔",
        "english": "Narrated Abu Sa'id al-Khudri (R.A): The Prophet (peace be upon him) forbade the purchase of what is in the wombs of cattle until they give birth, the sale of what is in their udders, the purchase of a slave who has bolted, the purchase of spoils of war until they are distributed, the purchase of Sadaqat (charity) until they are received, and the transaction based on the stroke of a diver."
      }
    },

    {
      "id": 688,
      "name": {
        "arabic": "وَعَنِ اِبْنِ مَسْعُودٍ رَضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { لَا تَشْتَرُوا اَلسَّمَكَ فِي اَلْمَاءِ; فَإِنَّهُ غَرَرٌ } رَوَاهُ أَحْمَدُ, وَأَشَارَ إِلَى أَنَّ اَلصَّوَابَ وَقْفُهُ ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانی میں موجود مچھلی کو نہ خریدو، کیونکہ یہ دھوکا (غرر) ہے۔“ اسے امام احمد نے روایت کیا ہے اور اس طرف اشارہ بھی کر دیا ہے کہ اس روایت کا موقوف (صحابی کا قول) ہونا زیادہ صحیح ہے۔",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) said: 'Do not buy fish in the water, for it is Gharar (uncertainty/deception).' [Reported by Ahmad, who noted that its status as a Mauquf narration is more correct]."
      }
    },

    {
      "id": 689,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ تُبَاعَ ثَمَرَةٌ حَتَّى تُطْعَمَ, وَلَا يُبَاعَ صُوفٌ عَلَى ظَهْرٍ, وَلَا لَبَنٌ فِي ضَرْعٍ } رَوَاهُ اَلطَّبَرَانِيُّ فِي \" اَلْأَوْسَطِ \" وَاَلدَّارَقُطْنِيُّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے پھلوں کے پکنے اور کھانے کے قابل ہونے سے پہلے انہیں فروخت کرنے سے منع فرمایا، نیز جانور کی پیٹھ پر لگے ہوئے اون اور تھنوں میں موجود دودھ کی (الگ سے) فروخت کو منع فرمایا ہے۔",
        "english": "Narrated Ibn 'Abbas (R.A): Allah's Messenger (peace be upon him) forbade the sale of fruits until they are fit to be eaten, and the sale of wool (still) on the back (of the animal), and the sale of milk (still) in the udder."
      }
    },

    {
      "id": 690,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُ أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ اَلْمَضَامِينِ, وَالْمَلَاقِيحِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مضامین اور ملاقیح کی خرید و فروخت سے منع فرمایا ہے۔ (مضامین سے مراد نر جانور کی پیٹھ کا مادہ منویہ اور ملاقیح سے مراد حاملہ جانور کے پیٹھ کا بچہ ہے)۔",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) forbade the sale of 'Al-Madhamin' (what is in the loins of the male camels) and 'Al-Malaqih' (what is in the wombs of the female camels)."
      }
    },

    {
      "id": 691,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَقَالَ مُسْلِماً بَيْعَتَهُ, أَقَالَهُ اَللَّهُ عَثْرَتَهُ } رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی مسلمان کا (پشیمانی کی بنا پر) سودا منسوخ کر دے، اللہ تعالیٰ قیامت کے دن اس کی لغزشیں (گناہ) معاف فرما دے گا۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) said: \"If anyone cancels a transaction with a Muslim (who regrets it), Allah will forgive his slips (sins) on the Day of Resurrection.\""
      }
    }
  ]
}
