{
  "chapId": 84,
  "bookId": 10,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1034,
    "to": 1048
  },
  "hadiths": [
    {
      "id": 1034,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - وَزَيْدِ بْنِ خَالِدٍ اَلْجُهَنِيِّ رَضِيَ اَللَّهُ عنهما { أَنَّ رَجُلًا مِنَ اَلْأَعْرَابِ أَتَى رَسُولُ اَللَّهِ - صلى الله عليه وسلم -. فَقَالَ: يَا رَسُولَ اَللَّهِ! أَنْشُدُكَ بِاَللَّهِ إِلَّا قَضَيْتَ لِي بِكِتَابِ اَللَّهِ, فَقَالَ اَلْآخَرُ - وَهُوَ أَفْقَهُ مِنْهُ - نَعَمْ. فَاقَضِ بَيْنَنَا بِكِتَابِ اَللَّهِ, وَأْذَنْ لِي, فَقَالَ: \"قُلْ\". قَالَ: إنَّ اِبْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِاِمْرَأَتِهِ, وَإِنِّي أُخْبِرْتُ أَنْ عَلَى اِبْنِي اَلرَّجْمَ, فَافْتَدَيْتُ مِنْهُ بِمَائَةِ شَاةٍ وَوَلِيدَةٍ, فَسَأَلَتُ أَهْلَ اَلْعِلْمِ, فَأَخْبَرُونِي: أَنَّمَا عَلَى اِبْنِيْ جَلْدُ مَائَةٍ وَتَغْرِيبُ عَامٍ, وَأَنَّ عَلَى اِمْرَأَةِ هَذَا اَلرَّجْمَ, فَقَالَ رَسُولُ ا للَّهِ - صلى الله عليه وسلم -\"وَالَّذِي نَفْسِي بِيَدِهِ, لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اَللَّهِ, اَلْوَلِيدَةُ وَالْغَنَمُ رَدٌّ عَلَيْكَ, وَعَلَى اِبْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ, وَاغْدُ يَا أُنَيْسُ إِلَى اِمْرَأَةِ هَذَا, فَإِنْ اِعْتَرَفَتْ فَارْجُمْهَا\" } مُتَّفَقٌ عَلَيْهِ, هَذَا وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ اور زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے کہ ایک دیہاتی آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا، اے اللہ کے رسول! میں آپ کو اللہ کی قسم دے کر عرض کرتا ہوں کہ آپ کتاب اللہ کے مطابق میرا فیصلہ فرمائیں اور دوسرا جو اس کے مقابل میں زیادہ سمجھدار اور دانا تھا، نے بھی کہا کہ ہمارے درمیان آپ صلی اللہ علیہ وسلم کتاب اللہ کے مطابق فیصلہ فرمائیں اور مجھے کچھ عرض کرنے کی اجازت دیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” بیان کرو۔ “ وہ بولا میرا بیٹا اس کے ہاں مزدوری پر کام کرتا تھا اس کی اہلیہ سے زنا کا مرتکب ہو گیا اور مجھے خبر دی گئی کہ میرے بیٹے پر رجم کی سزا ہے تو میں نے اس کے فدیے میں (بدلے میں) ایک سو بکریاں اور ایک لونڈی دے کر اس کی جان چھڑائی۔ اس کے بعد میں نے اہل علم حضرات سے دریافت کیا تو انہوں نے مجھے بتایا کہ میرے بیٹے کی سزا سو کوڑے اور ایک سال کی جلا وطنی ہے اور اس عورت کو سزائے رجم ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! میں تم دونوں کے درمیان کتاب اللہ کے عین مطابق ہی فیصلہ کروں گا۔ لونڈی اور بکریاں تمہیں واپس لوٹائی جائیں گی اور تیرے بیٹے کی سزا سو کوڑے اور سال بھر کی جلا وطنی ہے۔ اے انیس! تم اس آدمی کی اہلیہ کے پاس جاؤ (اور اس سے پوچھو) اگر وہ اس کا اعتراف کر لے تو اسے سنگسار کر دو۔ “ (بخاری و مسلم) اور یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated Abu Hurairah and Zaid bin Khalid al-Juhani (RA): An Arab from the desert came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger! I adjure you by Allah to judge between us according to Allah's Book.\" The other man, who was wiser than him, said, \"Yes, judge between us according to Allah's Book, and allow me to speak.\" He said, \"Speak.\" He said, \"My son was a laborer working for this man and he committed adultery with his wife. I was informed that my son was to be stoned to death, so I ransomed him with a hundred sheep and a slave girl. Then I asked the people of knowledge, and they informed me that my son is to be lashed a hundred times and exiled for one year, and the woman is to be stoned to death.\" Allah's Messenger (ﷺ) said, \"By Him in Whose Hand is my soul, I will certainly judge between you according to Allah's Book. The slave girl and the sheep are to be returned to you. Your son is to be lashed a hundred times and exiled for one year. And O Unais! Go to this man's wife, and if she confesses, stone her to death.\""
      }
    },

    {
      "id": 1035,
      "name": {
        "arabic": " وَعَنْ عُبَادَةَ بْنِ اَلصَّامِتِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خُذُوا عَنِّي, خُذُوا عَنِّي, فَقَدْ جَعَلَ اَللَّهُ لَهُنَّ سَبِيلاً, اَلْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ, وَنَفْيُ سَنَةٍ, وَالثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ, وَالرَّجْمُ } رَوَاهُ مُسْلِمٌ.‏ ",
        "urdu": " سیدنا عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” (احکام شریعت) مجھ سے حاصل کر لو۔ (احکام معاشرت) مجھ سے حاصل کر لو۔ اللہ تعالیٰ نے ان عورتوں کیلئے راستہ واضح کر دیا ہے۔ کنوارہ لڑکا، کنواری لڑکی سے زنا کرے تو اس کی سزا سو کوڑے اور ایک سال بھر کی جلا وطنی اور اگر شادی شدہ مرد کے ساتھ شادی شدہ عورت زنا کرے تو اس کی سزا سو کوڑے اور رجم (سنگسار کرنا) ہے۔ “ (مسلم)",
        "english": "Narrated ‘Ubadah bin As-Samit (RA): Allah’s Messenger (ﷺ) said, “Take from me, take from me! Allah has now made a way out for them (women). For unmarried persons (committing adultery with each other), the punishment is a hundred lashes and expulsion from the country for one year. For married persons, the punishment is a hundred lashes and stoning to death (Rajm).”"
      }
    },

    {
      "id": 1036,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { أَتَى رَجُلٌ مِنْ اَلْمُسْلِمِينَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-‏-وَهُوَ فِي اَلْمَسْجِدِ‏- فَنَادَاهُ فَقَالَ: يَا رَسُولَ اَللَّهِ! إِنِّي زَنَيْتُ, فَأَعْرَضَ عَنْهُ, فَتَنَحَّى تِلْقَاءَ وَجْهِهِ, فَقَالَ: يَا رَسُولَ اَللَّهِ! إِنِّي زَنَيْتُ, فَأَعْرَضَ عَنْهُ, حَتَّى ثَنَّى ذَلِكَ عَلَيْهِ أَرْبَعَ مَرَّاتٍ, فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ.‏ دَعَاهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ \"أَبِكَ جُنُونٌ?\" قَالَ.‏ لَا.‏ قَالَ: \"فَهَلْ أَحْصَنْتَ?\".‏ قَالَ: نَعَمْ.‏ فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"اِذْهَبُوا بِهِ فَارْجُمُوهُ\" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک مسلمان آدمی (ماعز بن مالک) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ اس وقت آپ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے۔ اس نے پکار کر عرض کیا: اے اللہ کے رسول! میں نے زنا کیا ہے۔ آپ صلی اللہ علیہ وسلم نے اس سے منہ پھیر لیا۔ وہ گھوم کر پھر سامنے آیا اور اعتراف کیا، آپ نے پھر رخ موڑ لیا۔ جب اس نے چار مرتبہ اپنے خلاف گواہی دے دی تو آپ ﷺ نے پوچھا: ”کیا تو پاگل ہے؟“ اس نے کہا: نہیں۔ آپ ﷺ نے پوچھا: ”کیا تو شادی شدہ ہے؟“ اس نے کہا: جی ہاں۔ آپ ﷺ نے حکم دیا: ”اسے لے جاؤ اور سنگسار کر دو۔“",
        "english": "Narrated Abu Hurairah (RA): A man from among the Muslims (Ma'iz bin Malik) came to Allah's Messenger (ﷺ) while he was in the mosque and called out to him, \"O Allah's Messenger! I have committed adultery.\" The Prophet (ﷺ) turned away from him. The man moved to the other side to face him and repeated his confession. This happened four times. When he had witnessed against himself four times, the Prophet (ﷺ) called him and asked, \"Are you insane?\" He replied, \"No.\" The Prophet (ﷺ) then asked, \"Are you married?\" He said, \"Yes.\" The Prophet (ﷺ) then ordered, \"Take him and stone him to death.\""
      }
    },

    {
      "id": 1037,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { لَمَّا أَتَى مَاعِزُ بْنُ مَالِكٍ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ لَهُ: \"لَعَلَّكَ قَبَّلْتَ, أَوْ غَمَزْتَ, أَوْ نَظَرْتَ?\" قَالَ: لَا يَا رَسُولَ اَللَّهِ.‏ } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ ماعز بن مالک جب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے اس سے دریافت فرمایا ” شاید تو نے بوس و کنار کیا ہو یا چھیڑ چھاڑ کی ہو اور نظر بد ڈالی ہو۔“ اس نے کہا نہیں اے اللہ کے رسول! (بخاری) ",
        "english": "Narrated Ibn 'Abbas (RA): When Ma'iz bin Malik came to the Prophet (ﷺ) (to confess to illegal sexual intercourse), he (ﷺ) said to him, \"Perhaps you only kissed (her), or winked, or looked?\" He replied, \"No, O Messenger of Allah.\""
      }
    },

    {
      "id": 1038,
      "name": {
        "arabic": "وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- { أَنَّهُ خَطَبَ فَقَالَ: إِنَّ اَللَّهَ بَعَثَ مُحَمَّدًا بِالْحَقِّ, وَأَنْزَلَ عَلَيْهِ اَلْكِتَابَ, فَكَانَ فِيمَا أَنْزَلَ اَللَّهُ عَلَيْهِ آيَةُ اَلرَّجْمِ.‏ قَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا, فَرَجَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَرَجَمْنَا بَعْدَهُ, فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ: مَا نَجِدُ اَلرَّجْمَ فِي كِتَابِ اَللَّهِ, فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اَللَّهُ, وَإِنَّ اَلرَّجْمَ حَقٌّ فِي كِتَابِ اَللَّهِ عَلَى مَنْ زَنَى, إِذَا أُحْصِنَ مِنْ اَلرِّجَالِ وَالنِّسَاءِ, إِذَا قَامَتْ اَلْبَيِّنَةُ, أَوْ كَانَ اَلْحَبَلُ, أَوْ اَلِاعْتِرَافُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عمر بن خطاب رضی اللہ عنہ سے مروی ہے کہ انہوں نے خطاب فرمایا اور کہا کہ محمد صلی اللہ علیہ وسلم کو اللہ تعالیٰ نے حق و صداقت دے کر مبعوث فرمایا اور ان پر کتاب نازل فرمائی۔ جو کچھ آپ صلی اللہ علیہ وسلم پر نازل فرمایا اس میں رجم کی آیت بھی نازل فرمائی تھی۔ ہم نے خود اسے پڑھا ہے اور اسے یاد بھی رکھا ہے اور اسے خوب سمجھا اور دل و دماغ میں محفوظ بھی رکھا ہے۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے رجم کیا اور آپ صلی اللہ علیہ وسلم کے بعد ہم نے بھی رجم کیا۔ مجھے اندیشہ ہے کہ کچھ زمانہ گزرنے کے بعد کہنے والے کہیں گے کہ کتاب اللہ میں ہم رجم کی سزا کا ذکر نہیں پاتے۔ اس طرح وہ ایسے فرض کے تارک ہو کر جسے اللہ تعالیٰ نے نازل فرمایا تھا، گمراہ ہو جائیں گے۔ حالانکہ رجم کی سزا کتاب میں حق ہے اس شخص کیلئے جس نے زنا کیا ہو۔ اس حالت میں جبکہ وہ شادی شدہ ہو، وہ خواہ مرد ہوں یا عورتیں جبکہ دلیل قائم ہو جائے یا حمل ہو یا خود اقرار کرے۔",
        "english": "Narrated 'Umar bin al-Khattab (RA) that he stood up to deliver a sermon and said: \"Indeed Allah sent Muhammad (ﷺ) with the truth and revealed to him the Book. Among what Allah revealed to him was the verse of stoning (Rajm). We read it, understood it, and memorized it. Allah's Messenger (ﷺ) carried out the penalty of stoning, and we carried it out after him. I fear that with the passage of time, someone might say, 'We do not find the verse of stoning in the Book of Allah,' and thus they would go astray by abandoning an obligation revealed by Allah. Indeed, stoning in the Book of Allah is a duty (Haqq) against those who commit adultery, if they are married (Muhsan), whether men or women, when proof is established, or pregnancy occurs, or a confession is made.\""
      }
    },

    {
      "id": 1039,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ, فَتَبَيَّنَ زِنَاهَا, فَلْيَجْلِدْهَا اَلْحَدَّ, وَلَا يُثَرِّبْ عَلَيْهَا, ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا اَلْحَدَّ, وَلَا يُثَرِّبْ عَلَيْهَا, ثُمَّ إِنْ زَنَتِ اَلثَّالِثَةَ, فَتَبَيَّنَ زِنَاهَا, فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ } مُتَّفَقٌ عَلَيْهِ وَهَذَا لَفْظُ مُسْلِمٍ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا فرماتے تھے کہ ” جب تم میں سے کسی کی لونڈی زنا کی مرتکب ہو اور اس کا زنا نمایاں و ظاہر ہو جائے تو اسے چاہیے کہ اس لونڈی پر حد لگائے اور ملامت نہ کرے۔ (اس کے بعد) پھر اگر لونڈی زنا کا ارتکاب کرے تو اسے چاہیے کہ اس لونڈی پر حد لگائے اور ملامت نہ کرے۔ (اس کے بعد) پھر اگر وہ لونڈی تیسری مرتبہ زنا کرے اور اس کا زنا ظاہر و نمایاں ہو جائے تو اسے فروخت کر دے خواہ بالوں سے بٹی ہوئی ایک رسی کے عوض میں ہی کیوں نہ ہو۔“ (بخاری و مسلم) اور یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated Abu Hurairah (RA): I heard Allah's Messenger (ﷺ) saying: \"If the slave-girl of any one of you commits illegal sexual intercourse and her offense is clearly established, he should lash her according to the prescribed penalty (Had), and should not reproach her. If she commits it again, he should lash her and not reproach her. If she commits it a third time and her offense is clearly established, he should sell her, even if it is for a rope of hair.\""
      }
    },

    {
      "id": 1040,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَقِيمُوا اَلْحُدُودَ عَلَى مَا مَلَكَتْ أَيْمَانُكُمْ } رَوَاهُ أَبُو دَاوُدَ. وَهُوَ فِي \"مُسْلِمٍ\" مَوْقُوفٌ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تمہارے زیرِ قبضہ لونڈی غلاموں (کے جرائم) پر شرعی حدیں قائم کرو۔“ اسے ابوداؤد نے روایت کیا ہے اور مسلم میں یہ روایت موقوف (یعنی علی رضی اللہ عنہ کے اپنے قول کے طور پر) مروی ہے۔",
        "english": "Narrated ‘Ali (RA): Allah's Messenger (ﷺ) said: \"Establish the prescribed legal penalties (Hudud) on those whom your right hands possess (your slaves).\" [Reported by Abu Dawud, and it is Mauquf (a statement of Ali) in Muslim]."
      }
    },

    {
      "id": 1041,
      "name": {
        "arabic": "وَعَنْ عِمْرَانَ بْنِ حَصِينٍ ‏- رضى الله عنه ‏- { أَنَّ اِمْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ نَبِيَّ اَللَّهِ ‏- صلى الله عليه وسلم ‏-‏-وَهِيَ حُبْلَى مِنْ اَلزِّنَا‏-فَقالتْ: يَا نَبِيَّ اَللَّهِ! أَصَبْتُ حَدًّا, فَأَقِمْهُ عَلَيَّ, فَدَعَا نَبِيُّ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَلِيَّهَا.‏ فَقَالَ: \"أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَائْتِنِي بِهَا\" فَفَعَلَ.‏ فَأَمَرَ بِهَا فَشُكَّتْ عَلَيْهَا ثِيَابُهَا, ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ, ثُمَّ صَلَّى عَلَيْهَا, فَقَالَ عُمَرُ: أَتُصَلِّي عَلَيْهَا يَا نَبِيَّ اَللَّهِ وَقَدْ زَنَتْ? فَقَالَ: \"لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِّمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ اَلْمَدِينَةِ لَوَسِعَتْهُمْ, وَهَلْ وَجَدَتْ أَفَضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ? } ",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ جہنی قبیلہ کی ایک عورت نبی کریم صلی اللہ علیہ وسلم کے پاس آئی اور وہ اس وقت زنا سے حاملہ تھی۔ اس نے کہا اے اللہ کے نبی! میں حد کی مستحق ہوں لہذا آپ مجھ پر حد نافذ فرمائیں۔ رسول اللہ صلی اللہ علیہ وسلم نے اس کے سرپرست کو بلوایا اور فرمایا: ”اس کے ساتھ حسن سلوک کرو، جب بچہ پیدا ہو جائے تو اسے میرے پاس لے آنا۔“ اس نے ایسا ہی کیا۔ پھر آپ کے حکم سے اس کے کپڑے مضبوطی سے باندھ دیے گئے، پھر اسے سنگسار کیا گیا، پھر آپ نے اس کی نماز جنازہ پڑھی۔ سیدنا عمر نے عرض کیا: اے اللہ کے نبی! کیا آپ اس کی نماز پڑھتے ہیں حالانکہ اس نے زنا کیا؟ آپ نے فرمایا: ”اس نے ایسی توبہ کی ہے کہ اگر مدینہ کے ستر آدمیوں پر تقسیم کر دی جائے تو ان سب کے لیے کافی ہو جائے۔ کیا تم نے اس سے بہتر کوئی پایا ہے جس نے اللہ کے لیے اپنی جان قربان کر دی؟“",
        "english": "Narrated ‘Imran bin Husain (RA): A woman from the Juhainah tribe came to the Prophet (ﷺ) while she was pregnant as a result of adultery. She said, \"O Messenger of Allah, I have committed a crime punishable by Had, so execute it upon me.\" The Messenger of Allah (ﷺ) called her guardian and said, \"Treat her well, and when she delivers, bring her to me.\" He did so. The Prophet (ﷺ) then ordered that her clothes be tied tightly around her and she was stoned to death. He then prayed the funeral prayer over her. ‘Umar (RA) asked, \"O Prophet of Allah, do you pray over her though she committed adultery?\" He (ﷺ) replied, \"She has repented such a repentance that if it were divided among seventy of the people of Madinah, it would suffice them. Have you found any better (person) than one who sacrificed her soul for Allah?\""
      }
    },

    {
      "id": 1042,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { رَجَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَجُلًا مَنْ أَسْلَمَ, وَرَجُلًا مِنْ اَلْيَهُودِ, وَاِمْرَأَةً } رَوَاهُ مُسْلِمٌ. وَقِصَّةُ رَجْمِ اَلْيَهُودِيَّيْنِ فِي \"اَلصَّحِيحَيْنِ\" مِنْ حَدِيثِ اِبْنِ عُمَرَ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے قبیلہ اسلم کے ایک آدمی (ماعز بن مالک) کو رجم کیا اور ایک یہودی مرد اور ایک (یہودی) عورت کو بھی رجم کیا۔ (مسلم) اور یہودی مرد و عورت کے رجم کا واقعہ صحیحین میں سیدنا ابن عمر رضی اللہ عنہما سے (تفصیل کے ساتھ) مروی ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): Allah's Messenger (ﷺ) stoned to death a man from the tribe of Aslam (Ma'iz bin Malik), and a Jewish man and a woman. [Reported by Muslim]. The story of the two Jews is reported in the Sahihain (Bukhari and Muslim) on the authority of Ibn 'Umar (RA)."
      }
    },

    {
      "id": 1043,
      "name": {
        "arabic": " ",
        "urdu": " ",
        "english": " "
      }
    },

    {
      "id": 1044,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ, فَاقْتُلُوا اَلْفَاعِلَ وَالْمَفْعُولَ بِهِ, وَمَنْ وَجَدْتُمُوهُ وَقَعَ عَلَى بَهِيمَةٍ, فَاقْتُلُوهُ وَاقْتُلُوا اَلْبَهِيمَةَ } رَوَاهُ أَحْمَدُ وَالْأَرْبَعَةُ, وَرِجَالُهُ مُوَثَّقُونَ, إِلَّا أَنَّ فِيهِ اِخْتِلَافًا ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص کو تم پاؤ کہ وہ قوم لوط کے فعل (ہم جنس پرستی) کا مرتکب ہو رہا ہے، تو فاعل اور مفعول دونوں کو قتل کر دو۔ اور جس کسی کو پاؤ کہ وہ جانور کے ساتھ بدفعلی کر رہا ہے، تو اس شخص کو بھی قتل کر دو اور اس جانور کو بھی مار ڈالو۔“ اسے احمد اور چاروں نے روایت کیا ہے، اس کے راوی ثقہ ہیں مگر اس (کے وصل و ارسال) میں اختلاف ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: \"Whomever you find committing the act of the people of Lut (homosexuality), kill the one who does it and the one to whom it is done. and whomever you find having intercourse with an animal, kill him and kill the animal.\""
      }
    },

    {
      "id": 1045,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-ضَرَبَ وَغَرَّبَ وَأَنَّ أَبَا بَكْرٍ ضَرَبَ وَغَرَّبَ.‏ } رَوَاهُ اَلتِّرْمِذِيُّ, وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّهُ اخْتُلِفَ فِي رَفْعِهِ, وَوَقْفِهِ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہا سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے زانی کو مارا بھی اور جلا وطن بھی کیا اور ابوبکر رضی اللہ عنہ نے مارا بھی اور جلا وطن بھی کیا۔ اسے ترمذی نے روایت کیا ہے۔ اس کے راوی ثقہ ہیں مگر اس کے موقوف اور مرفوع ہونے کے متعلق اختلاف ہے۔",
        "english": "Narrated Ibn ‘Umar (RA): The Prophet (ﷺ) lashed (an unmarried person who committed illegal sexual intercourse) and exiled him. Abu Bakr (RA) also lashed and exiled (such a person). Reported by At-Tirmidhi; its narrators are reliable, but there is disagreement as to whether it is Marfu' or Mawquf."
      }
    },

    {
      "id": 1046,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: لَعَنَ رَسُولُ اَللَّهِ صلى الله عليه وسلم اَلْمُخَنَّثِينَ مِنْ اَلرِّجَالِ, وَالْمُتَرَجِّلَاتِ مِنْ اَلنِّسَاءِ, وَقَالَ: { أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان مردوں پر لعنت فرمائی جو عورتوں کی مشابہت اختیار کریں اور ان عورتوں پر جو مردوں کی مشابہت اختیار کریں، اور فرمایا: ”ان کو اپنے گھروں سے نکال دو۔“ (بخاری)",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) cursed the men who act like women and the women who act like men, and he said: \"Expel them from your houses.\""
      }
    },

    {
      "id": 1047,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اِدْفَعُوا اَلْحُدُودَ, مَا وَجَدْتُمْ لَهَا مَدْفَعًا } أَخْرَجَهُ اِبْنُ مَاجَهْ, وَإِسْنَادُهُ ضَعِيفٌ وَأَخْرَجَهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ: مِنْ حَدِيثِ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا بِلَفْظِ { ادْرَأُوا اَلْحُدُودَ عَنْ اَلْمُسْلِمِينَ مَا اِسْتَطَعْتُمْ } وَهُوَ ضَعِيفٌ أَيْضًا وَرَوَاهُ اَلْبَيْهَقِيُّ: عَنْ عَلِيٍّ ‏- رضى الله عنه ‏- (مِنْ)‏ قَوْلِهِ بِلَفْظِ: { ادْرَأُوا اَلْحُدُودَ بِالشُّبُهَاتِ } ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” حدود کو دفع کرو جہاں تک اس کے دفع کرنے کی گنجائش پاؤ۔“ اسے ابن ماجہ نے نکالا ہے اور اس کی سند ضعیف ہے اور اس کو ترمذی اور حاکم نے سیدہ عائشہ رضی اللہ عنہا کے واسطہ سے بیان کیا ہے۔ جس کے الفاظ ہیں۔ ” مسلمانوں سے جہاں تک حدود کو ہٹا سکتے ہو ہٹاؤ۔“ یہ بھی ضعیف ہے اور بیہقی نے اسے سیدنا علی رضی اللہ عنہ کے واسطہ سے روایت کیا ہے اس کے الفاظ ہیں۔ ” شبہات کی وجہ سے حدود کو دفع کرو۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"Avert the legal penalties (Hudud) as much as you can find a way to do so.\" (Reported by Ibn Majah with a weak chain). At-Tirmidhi and Al-Hakim reported it from 'Aishah (RA) with the wording: \"Avert the legal penalties from the Muslims as much as you are able.\" (It is also weak). Al-Baihaqi reported it from 'Ali (RA) as his own saying with the wording: \"Avert the legal penalties by means of doubts.\""
      }
    },

    {
      "id": 1048,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اِجْتَنِبُوا هَذِهِ اَلْقَاذُورَاتِ اَلَّتِي نَهَى اَللَّهُ تَعَالَى عَنْهَا, فَمَنْ أَلَمَّ بِهَا فَلْيَسْتَتِرْ بِسِتْرِ اَللَّهِ تَعَالَى, وَلِيَتُبْ إِلَى اَللَّهِ تَعَالَى, فَإِنَّهُ مَنْ يَبْدِ لَنَا صَفْحَتَهُ نُقِمْ عَلَيْهِ كِتَابَ اَللَّهِ عَزَّ وَجَلَّ } رَوَاهُ اَلْحَاكِمُ, وَهُوَ فِي \"اَلْمُوْطَّإِ\" مِنْ مَرَاسِيلِ زَيْدِ بْنِ أَسْلَمَ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ان گندے کاموں (فواحش) سے بچو جن سے اللہ تعالیٰ نے منع فرمایا ہے، اور جو شخص ان میں سے کسی میں مبتلا ہو جائے تو اسے اللہ کے ڈالے ہوئے پردے میں چھپا رہنا چاہیے اور اللہ سے (پوشیدہ طور پر) توبہ کر لینی چاہیے، کیونکہ جو شخص اپنی پیٹھ (اپنا گناہ) ہمارے سامنے ظاہر کر دے گا، ہم اس پر اللہ عزوجل کی کتاب (کے مطابق حد) قائم کر دیں گے۔“",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: \"Avoid these filthy actions which Allah has forbidden. If anyone commits any of them, he should conceal himself with the veil of Allah and repent to Allah. For indeed, whoever reveals his actions to us, we will carry out against him the punishment prescribed in the Book of Allah, the Mighty and Sublime.\""
      }
    }
  ]
}
