{
  "chapId": 4,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 29,
    "to": 52
  },
  "hadiths": [
    {
      "id": 29,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - عَنْ رَسُولِ اَللَّهِ  - صلى الله عليه وسلم  -قَالَ: { لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ } أَخْرَجَهُ مَالِكٌ, وأَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے کہ ”اگر مجھے اپنی امت کو مشقت و تکلیف میں مبتلا کرنے کا اندیشہ نہ ہوتا تو میں ہر وضو کے ساتھ مسواک کرنے کا حکم دیتا۔“ اسے مالک، احمد اور نسائی نے روایت کیا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے اور بخاری نے اس کو تعلیقاً نقل کیا ہے۔ ",
        "english": "Narrated Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"Were it not that I would place a burden upon my Ummah, I would have commanded them to use the Siwāk (tooth-stick) with every Wudu (ablution).\" Narrated by Malik, Ahmad, and An-Nasa’i, and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 30,
      "name": {
        "arabic": " وَعَنْ حُمْرَانَ; { أَنَّ عُثْمَانَ  - رضى الله عنه  - دَعَا بِوَضُوءٍ, فَغَسَلَ كَفَّيْهِ ثَلَاثَ مَرَّاتٍ, ثُمَّ مَضْمَضَ, وَاسْتَنْشَقَ, وَاسْتَنْثَرَ, ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مَرَّاتٍ, ثُمَّ غَسَلَ يَدَهُ اَلْيُمْنَى إِلَى اَلْمِرْفَقِِ ثَلَاثَ مَرَّاتٍ, ثُمَّ اَلْيُسْرَى مِثْلَ ذَلِكَ, ثُمَّ مَسَحَ بِرَأْسِهِ, ثُمَّ غَسَلَ رِجْلَهُ اَلْيُمْنَى إِلَى اَلْكَعْبَيْنِ ثَلَاثَ مَرَّاتٍ, ثُمَّ اَلْيُسْرَى مِثْلَ ذَلِكَ, ثُمَّ قَالَ: رَأَيْتُ رَسُولَ اَللَّهِ صَلَّى عَلَيْهِ وَسَلَّمَ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا.  } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا حمران مولی عثمان رضی اللہ عنہ روایت کرتے ہیں کہ سیدنا عثمان رضی اللہ عنہ نے وضو کا پانی طلب فرمایا پہلے اپنے ہاتھوں کی ہتھیلیاں تین مرتبہ دھوئیں۔ پھر منہ میں پانی ڈال کر کلی کی پھر ناک میں پانی چڑھایا اور اسے جھاڑ کر صاف کیا۔ پھر تین مرتبہ اپنا چہرہ دھویا۔ پھر دایاں ہاتھ کہنی تک تین مرتبہ دھویا۔ پھر اسی طرح بایاں ہاتھ کہنی تک تین مرتبہ دھویا۔ پھر اپنے سر کا مسح کیا۔ پھر اپنا دایاں اور بایاں پاؤں ٹخنوں تک تین، تین مرتبہ دھویا۔ پھر فرمایا کہ ”میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح وضو کرتے دیکھا ہے جس طرح ابھی میں نے وضو کیا ہے۔“  ",
        "english": "Narrated Humran (Mawla of Uthman): Uthman (may Allah be pleased with him) called for water for Wudu (ablution). He washed his hands three times, then rinsed his mouth, put water in his nose, and then blew it out. Then he washed his face three times, then his right hand up to the elbow three times, and then the left hand likewise. Then he wiped his head, then washed his right foot up to the ankles three times, and then the left foot likewise. Then he said: \"I saw the Messenger of Allah (ﷺ) performing Wudu like this Wudu of mine.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 31,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ  - رضى الله عنه  -  -فِي صِفَةِ وُضُوءِ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ - قَالَ: { وَمَسَحَ بِرَأْسِهِ وَاحِدَةً.  } أَخْرَجَهُ أَبُو دَاوُد َ",
        "urdu": "سیدنا علی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے وضو کے متعلق بیان کرتے ہوئے فرمایا کہ ”آپ صلی اللہ علیہ وسلم نے اپنے سر کا مسح ایک مرتبہ کیا۔“ اسے ابوداؤد، نسائی اور ترمذی نے صحیح سند کے ساتھ روایت کیا ہے بلکہ ترمذی نے تو یہاں تک کہا ہے کہ اس باب میں یہ حدیث سب سے زیادہ صحیح ہے۔ ",
        "english": "Narrated Ali (may Allah be pleased with him), describing the Wudu of the Prophet (ﷺ), he said: \"He wiped his head **once**.\" Narrated by Abu Dawud."
      }
    },

    {
      "id": 32,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ يَزِيدَ بْنِ عَاصِمٍ  - رضى الله عنه  -  -فِي صِفَةِ اَلْوُضُوءِ - قَالَ: { وَمَسَحَ  - صلى الله عليه وسلم  -بِرَأْسِهِ, فَأَقْبَلَ بِيَدَيْهِ وَأَدْبَرَ.  } مُتَّفَقٌ عَلَيْه ِ وَفِي لَفْظٍ: { بَدَأَ بِمُقَدَّمِ رَأْسِهِ, حَتَّى ذَهَبَ بِهِمَا إِلَى قَفَاهُ, ثُمَّ رَدَّهُمَا إِلَى اَلْمَكَانِ اَلَّذِي بَدَأَ مِنْهُ }",
        "urdu": "سیدنا عبداللہ بن زید بن عاصم رضی اللہ عنہ سے وضو کے متعلق مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے سر کا مسح اس طرح کیا کہ دونوں ہاتھ سر کے آگے سے پیچھے کی طرف لے گئے اور پھر پیچھے سے آگے کی جانب واپس لے آئے۔ ایک روایت میں جسے بخاری و مسلم نے روایت کیا ہے اس طرح ہے کہ آپ صلی اللہ علیہ وسلم سر کے اگلے حصہ سے شروع کر کے ہاتھوں کو سر کے پچھلے حصہ یعنی گدی تک لے گئے اور پھر اسی طرح دونوں ہاتھوں کو سر کے بالوں کا مسح کرتے ہوئے اسی جگہ واپس لے آئے جہاں سے مسح کا آغاز کیا تھا۔ ",
        "english": "Narrated Abdullah bin Zaid bin Asim (may Allah be pleased with him), describing the Wudu: The Prophet (ﷺ) wiped his head by bringing his hands forward and backward. In another narration: He began with the front of his head, running them to the nape of his neck, then brought them back to the place where he had started. [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 33,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو رَضِيَ اَللَّهُ عَنْهُمَا  -فِي صِفَةِ اَلْوُضُوءِ - قَالَ: { ثُمَّ مَسَحَ  - صلى الله عليه وسلم  -بِرَأْسِهِ, وَأَدْخَلَ إِصْبَعَيْهِ اَلسَّبَّاحَتَيْنِ فِي أُذُنَيْهِ, وَمَسَحَ بِإِبْهَامَيْهِ ظَاهِرَ أُذُنَيْهِ.  } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے وضو کی کیفیت کے بارے میں روایت ہے کہ آپ صلی اللہ علیہ وسلم نے اپنے سر کا مسح کیا اور اپنے ہاتھوں کی دونوں شہادت والی انگلیوں کو کانوں میں داخل کیا اور انگوٹھوں سے کانوں کے باہر کا مسح کیا۔ اس روایت کو ابوداؤد اور نسائی نے روایت کیا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Abdullah bin Amr (may Allah be pleased with them both), describing the Wudu: The Prophet (ﷺ) then wiped his head, inserted his two index fingers into his ears, and wiped the back of his ears with his two thumbs. Narrated by Abu Dawud and An-Nasa'i, and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 34,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا اِسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ فَلْيَسْتَنْثِرْ ثَلَاثًا, فَإِنَّ اَلشَّيْطَانَ يَبِيتُ عَلَى خَيْشُومِهِ } مُتَّفَقٌ عَلَيْه ِ 1  . ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روايت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے جب کوئی نیند سے بیدار ہو تو تین مرتبہ اپنا ناک جھاڑ کر صاف کرے اس لئے کہ شیطان ناک کے نتھنوں کی ہڈی پر رات بسر کرتا ہے۔“",
        "english": "Narrated Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"When any of you wakes up from his sleep, he should clean his nose by blowing out water three times, for the devil spends the night on the interior bridge of his nose.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 35,
      "name": {
        "arabic": "وَعَنْهُ: { إِذَا اِسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلَا يَغْمِسُ يَدَهُ فِي اَلْإِنَاءِ حَتَّى يَغْسِلَهَا ثَلَاثًا فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدَهُ } مُتَّفَقٌ عَلَيْهِ.  وَهَذَا لَفْظُ مُسْلِم ٍ",
        "urdu": "یہ روایت بھی سیدنا ابوہریرہ رضی اللہ عنہ ہی سے ہے جس میں مذکور ہے کہ ”تم میں سے جب کوئی نیند سے بیدار ہو تو تین مرتبہ دھونے سے پہلے اپنا ہاتھ پانی کے برتن میں نہ ڈالے۔ کیونکہ اسے یہ معلوم نہیں کہ رات بھر ہاتھ کہاں کہاں گردش کرتا رہا (اور کس کس چیز کو چھوتا اور مس کرتا رہا)۔“ بخاری و مسلم، مذکورہ بالا حدیث میں مزکورہ الفاظ مسلم کے ہیں۔ ",
        "english": "Also narrated from Abu Hurayrah (may Allah be pleased with him): \"When any of you wakes up from his sleep, he must not dip his hand into the vessel of water until he has washed it three times, for he does not know where his hand spent the night (i.e., what impurities it may have touched).\" [Agreed upon by Al-Bukhari and Muslim, this is the wording of Muslim]"
      }
    },

    {
      "id": 36,
      "name": {
        "arabic": "وَعَنْ لَقِيطِ بْنُ صَبْرَةَ,  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ أَسْبِغْ اَلْوُضُوءَ, وَخَلِّلْ بَيْنَ اَلْأَصَابِعِ, وَبَالِغْ فِي اَلِاسْتِنْشَاقِ, إِلَّا أَنْ تَكُونَ صَائِمًا } أَخْرَجَهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ 1  . وَلِأَبِي دَاوُدَ فِي رِوَايَةٍ: { إِذَا تَوَضَّأْتَ فَمَضْمِضْ }",
        "urdu": " سیدنا لقیط بن صبرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”وضو اچھی طرح پورا کرو اور انگلیوں کا خلال کرو، ناک میں پانی اچھی طرح چڑھایا کرو مگر روزے کی حالت میں (ایسا نہ کرو)۔“ اس روایت کو ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے ابن خزیمہ نے اسے صحیح قرار دیا ہے۔ ابوداؤد کی ایک روایت کے الفاظ ہیں ”جب تو وضو کرے تو کلی کر۔“ ",
        "english": "Narrated Laqīṭ ibn Ṣabirah (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"Perform Wudu thoroughly, thread your fingers (interlace/clean between the fingers), and be thorough in rinsing the nose, unless you are fasting.\" Narrated by the four Imams (Abu Dawud, Tirmidhi, Nasā’ī, Ibn Mājah) and authenticated as Sahih by Ibn Khuzaymah. A narration from Abu Dawud adds: \"When you perform Wudu, rinse your mouth.\""
      }
    },

    {
      "id": 37,
      "name": {
        "arabic": " وَعَنْ عُثْمَانَ  - رضى الله عنه  - { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -كَانَ يُخَلِّلُ لِحْيَتَهُ فِي اَلْوُضُوءِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ",
        "urdu": " سیدنا عثمان رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم وضو کرتے ہوئے اپنی داڑھی کا خلال کیا کرتے تھے۔ ترمذی اور ابن خزیمہ نے صحیح قرار دیا ہے۔",
        "english": "Narrated Uthman (may Allah be pleased with him): The Prophet (ﷺ) used to **interlace (thread)** his beard during Wudu (ablution). Narrated by At-Tirmidhi and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 38,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ زَيْدٍ  - رضى الله عنه  - { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -أَتَى بِثُلُثَيْ مُدٍّ, فَجَعَلَ يَدْلُكُ ذِرَاعَيْهِ } أَخْرَجَهُ أَحْمَدُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة",
        "urdu": " سیدنا عبداللہ بن زید رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں دو تہائی مد پانی پیش کیا گیا تو آپ صلی اللہ علیہ وسلم نے دھونے کیلئے بازوؤں کو ملنا شروع کیا۔ احمد نے اسے روایت کیا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abdullah bin Zaid (may Allah be pleased with him): The Prophet (ﷺ) was brought two-thirds of a Mudd of water, and he started **rubbing (Dalk)** his forearms (up to the elbows with it). Narrated by Ahmad and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 39,
      "name": {
        "arabic": "وَعَنْهُ, { أَنَّهُ رَأَى اَلنَّبِيَّ  - صلى الله عليه وسلم  -يَأْخُذُ لِأُذُنَيْهِ مَاءً خِلَافَ اَلْمَاءِ اَلَّذِي أَخَذَ لِرَأْسِهِ.  } أَخْرَجَهُ اَلْبَيْهَقِيّ ُوَهُوَ عِنْدَ \"مُسْلِمٍ\" مِنْ هَذَا اَلْوَجْهِ بِلَفْظٍ: وَمَسَحَ بِرَأْسِهِ بِمَاءٍ غَيْرَ فَضْلِ يَدَيْهِ, وَهُوَ اَلْمَحْفُوظ ُ",
        "urdu": "سیدنا عبداللہ بن زید رضی اللہ عنہما سے مروی ہے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا آپ صلی اللہ علیہ وسلم جو پانی سر کے مسح کے لئے لیتے تھے، کانوں کے مسح کے لئے اس سے الگ لیتے تھے۔ اسے بیہقی نے روایت کیا ہے اور کہا ہے کہ اس کی سند صحیح ہے اور ترمذی نے بھی اسے صحیح قرار دیا ہے۔ اور مسلم کے ہاں اسی سند سے یہ روایت بایں الفاظ منقول ہے کہ ”آپ صلی اللہ علیہ وسلم نے سر کا مسح کیا مگر وہ ہاتھوں سے بچا ہوا پانی نہیں تھا۔“ یعنی نیا پانی استعمال کیا اور یہی مسلم کی روایت محفوظ ہے۔  ",
        "english": "Also narrated from him (Abdullah bin Zaid): That he saw the Prophet (ﷺ) take **new water** for his ears, separate from the water he took for his head. Narrated by Al-Bayhaqi, who said its chain is Sahih. It is also found in Muslim through this route with the wording: \"He wiped his head with water, not the excess from his hands,\" and this is the confirmed wording."
      }
    },

    {
      "id": 40,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -يَقُولُ: {إِنَّ أُمَّتِي يَأْتُونَ يَوْمَ اَلْقِيَامَةِ غُرًّا مُحَجَّلِينَ, مِنْ أَثَرِ اَلْوُضُوءِ, فَمَنْ اِسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ.  } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِم ٍ 1",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ ”قیامت کے روز میری امت کہ لوگ ایسی حالت میں آئیں گے کہ وضو کے اثرات کی وجہ سے ان کے ہاتھ پاؤں چمکتے ہوں گے۔ تم میں سے جو شخص اس چمک اور روشنی کو زیادہ بڑھا سکتا ہو اسے ضرور بڑھانی چاہیئے۔“ (بخاری و مسلم) اور الفاظ مسلم کے ہیں۔",
        "english": "Narrated Abu Hurayrah (may Allah be pleased with him): I heard the Messenger of Allah (ﷺ) say: \"Indeed, my Ummah will come on the Day of Resurrection with bright faces (Ghurran) and bright limbs (Muhajjalīn) due to the traces of Wudu (ablution). So, whoever among you is able to extend the brightness of his parts, let him do so.\" [Agreed upon by Al-Bukhari and Muslim, this is the wording of Muslim]"
      }
    },

    {
      "id": 41,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ اَلنَّبِيُّ  - صلى الله عليه وسلم  -يُعْجِبُهُ اَلتَّيَمُّنُ فِي تَنَعُّلِهِ, وَتَرَجُّلِهِ, وَطُهُورِهِ, وَفِي شَأْنِهِ كُلِّهِ.  } مُتَّفَقٌ عَلَيْه",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ ”رسول اللہ صلی اللہ علیہ وسلم جوتا پہننے، بالوں میں کنگھی کرنے اور وضو کرنے بلکہ ہر کام کیلئے دائیں جانب کو پسند فرماتے تھے۔“ (بخاری و مسلم)",
        "english": "Narrated Aisha (may Allah be pleased with her): \"The Prophet (ﷺ) liked to start with the right side (Tayamum) in putting on his shoes, combing his hair, performing his ritual purification (Ṭahūr), and in all his affairs.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 42,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا تَوَضَّأْتُمْ فابدأوا بِمَيَامِنِكُمْ } أَخْرَجَهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تم وضو کرنے لگو تو اپنے دائیں جانب سے ابتداء کیا کرو۔“ اسے ابوداؤد، ترمذی، نسائی اور ابن ماجہ چاروں نے روایت کیا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"When you perform Wudu (ablution), begin with your right side.\" Narrated by the four Imams (Abu Dawud, Tirmidhi, Nasā’ī, Ibn Mājah) and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 43,
      "name": {
        "arabic": "عَنْ اَلْمُغِيرَةِ بْنِ شُعْبَةٍ  - رضى الله عنه  - { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -تَوَضَّأَ, فَمَسَحَ بِنَاصِيَتِهِ, وَعَلَى اَلْعِمَامَةِ وَالْخُفَّيْنِ.  } أَخْرَجَهُ مُسْلِم ٌ",
        "urdu": "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے وضو کیا تو اپنی پیشانی کے بالوں، پگڑی اور موزوں پر مسح کیا۔ ",
        "english": "Narrated Al-Mughīrah ibn Shuʿbah (may Allah be pleased with him): \"The Prophet (ﷺ) performed Wudu (ablution) and wiped over his **forelock (Nāṣiyah)**, his **turban (ʿImāmah)**, and his **leather socks (Khuffayn).\"** Narrated by Muslim."
      }
    },

    {
      "id": 44,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا  -فِي صِفَةِ حَجِّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ - قَالَ  - صلى الله عليه وسلم  -{ اِبْدَؤُوا بِمَا بَدَأَ اَللَّهُ بِهِ } أَخْرَجَهُ النَّسَائِيُّ, هَكَذَا بِلَفْظِ اَلْأَمْر ِ 1  وَهُوَ عِنْدَ مُسْلِمٍ بِلَفْظِ اَلْخَبَر ِ ",
        "urdu": " سیدنا جابر بن عبداللہ رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم کے حج کی تفصیل بیان کرتے ہوئے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”آغاز اسی طرح کرو جس طرح اللہ تعالیٰ نے آغاز کیا ہے۔“ نسائی نے امر کے صیغہ کے ساتھ روایت کیا ہے یعنی حکماً فرمایا کہ ”ابتداء کرو“ جبکہ امام مسلم نے جملہ خبریہ میں اسے بیان کیا ہے یعنی ہم شروع کرتے ہیں۔",
        "english": "Narrated Jābir ibn ʿAbdillāh (may Allah be pleased with them both), describing the Prophet's Hajj: The Prophet (ﷺ) said: \"Begin with what Allah has begun with.\" Narrated by An-Nasā’ī with the commanding tense. It is in Muslim with the reporting tense."
      }
    },

    {
      "id": 45,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { كَانَ اَلنَّبِيَّ  - صلى الله عليه وسلم  -إِذَا تَوَضَّأَ أَدَارَ اَلْمَاءَ عَلَى مُرْفَقَيْهِ.  } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادِ ضَعِيف ٍ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما ہی سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم جب وضو کرتے تو اپنی کہنیوں پر اچھی طرح پانی ڈالتے۔ اسے دارقطنی نے روایت کیا ہے اس کی سند ضعیف ہے۔ ",
        "english": "Also narrated from him (Jābir ibn ʿAbdillāh): \"When the Prophet (ﷺ) performed Wudu (ablution), he made the water run over his elbows (Māqafayn).\" Narrated by Ad-Dāraquṭnī with a weak chain of narration."
      }
    },

    {
      "id": 46,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ لَا وُضُوءَ لِمَنْ لَمْ يَذْكُرِ اِسْمَ اَللَّهِ عَلَيْهِ } أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ,  وَابْنُ مَاجَهْ, بِإِسْنَادٍ ضَعِيف ٍ وَلِلترْمِذِيِّ: عَنْ سَعِيدِ بْنِ زَيْد ٍ وَأَبِي سَعِيدٍ نَحْوُه قَالَ أَحْمَدُ: لَا يَثْبُتُ فِيهِ شَيْء ٌ ُ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے: ”وضو کا آغاز کرتے وقت جس نے پہلے «بسم الله» نہ پڑھی اس کا کوئی وضو نہیں۔“ اس حدیث کو احمد، ابوداؤد، ابن ماجہ نے روایت کیا ہے مگر ان کی بیان کردہ سند ضعیف ہے، اور ترمذی نے یہ حدیث سعید بن زید سے روایت کی ہے اور اسی طرح اسے ابوسعید سے بھی روایت کیا ہے۔ امام احمد بن حنبل رحمہ اللہ کا قول ہے کہ اس بارے میں کوئی چیز ثابت نہیں۔ ",
        "english": "Narrated Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"There is no Wudu (ablution) for the one who does not mention the name of Allah upon it.\" Narrated by Ahmad, Abu Dawud, and Ibn Majah with a weak chain. At-Tirmidhi narrated similarly from Sa'īd ibn Zayd and Abu Sa'īd. Imām Aḥmad said: \"Nothing is established (as authentic) concerning this.\""
      }
    },

    {
      "id": 47,
      "name": {
        "arabic": "وَعَنْ طَلْحَةَ بْنِ مُصَرِّفٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: { رَأَيْتُ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -يَفْصِلُ بَيْنَ اَلْمَضْمَضَةِ وَالِاسْتِنْشَاقِ.  } أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادِ ضَعِيف ٍ",
        "urdu": " سیدنا طلحہ بن مصرف رحمہ اللہ اپنے باپ سے وہ اپنے دادا سے روایت کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو بچشم خود دیکھا ہے آپ صلی اللہ علیہ وسلم کلی اور ناک کے لئے الگ الگ پانی لیتے تھے۔ اس روایت کو ابوداؤد نے ضعیف سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Ṭalḥah ibn Muṣarrif, from his father, from his grandfather: \"I saw the Messenger of Allah (ﷺ) separate the water for rinsing his mouth (Maḍmaḍah) and rinsing his nose (Istinshāq).\" Narrated by Abū Dāwūd with a weak chain of narration."
      }
    },

    {
      "id": 48,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ  - رضى الله عنه  -  -فِي صِفَةِ اَلْوُضُوءِ - { ثُمَّ تَمَضْمَضَ  - صلى الله عليه وسلم  -وَاسْتَنْثَرَ ثَلَاثًا, يُمَضْمِضُ وَيَنْثِرُ مِنْ اَلْكَفِّ اَلَّذِي يَأْخُذُ مِنْهُ اَلْمَاءَ } أَخْرَجَهُ أَبُو دَاوُدَ وَالنَّسَائِيّ ُ",
        "urdu": " سیدنا علی رضی اللہ عنہ سے وضو کے بیان کے بارے میں روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے تین بار کلی کی اور ناک میں پانی ڈالا۔ آپ صلی اللہ علیہ وسلم کلی اور ناک میں پانی اسی ہاتھ سے داخل کرتے جس سے پانی لیتے تھے (ابوداؤد، نسائی)",
        "english": "Narrated Ali (may Allah be pleased with him), describing the Wudu: \"Then the Prophet (ﷺ) rinsed his mouth (Maḍmaḍah) and cleaned his nose (Istinthār) three times, rinsing his mouth and nose from **the same scoop (Kaff)** of water he took.\" Narrated by Abu Dawud and An-Nasā’ī."
      }
    },

    {
      "id": 49,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ زَيْدٍ  - رضى الله عنه  -  -فِي صِفَةِ اَلْوُضُوءِ - { ثُمَّ أَدْخَلَ  - صلى الله عليه وسلم  -يَدَهُ, فَمَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفٍّ وَاحِدَةٍ, يَفْعَلُ ذَلِكَ ثَلَاثًا } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": " سیدنا عبداللہ بن زید رضی اللہ عنہما سے وضو کے سلسلہ بیان میں مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنا ہاتھ پانی میں ڈالا، پھر کلی کی اور ناک میں پانی چڑھایا، ایک ہی چلو سے، ایسا آپ صلی اللہ علیہ وسلم نے تین مرتبہ کیا۔ (بخاری و مسلم)",
        "english": "Narrated Abdullah bin Zaid (may Allah be pleased with him), describing the Wudu: \"Then the Prophet (ﷺ) put his hand in the water, rinsed his mouth (Maḍmaḍah) and drew water into his nose (Istinshāq) from **one single scoop (Kaff)**, doing that three times.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 50,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ  - رضى الله عنه  - قَالَ: { رَأَى اَلنَّبِيُّ  - صلى الله عليه وسلم  -رَجُلًا, وَفِي قَدَمِهِ مِثْلُ اَلظُّفْرِ لَمْ يُصِبْهُ اَلْمَاءُ.  فَقَالَ: \"اِرْجِعْ فَأَحْسِنْ وُضُوءَكَ\" } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيّ ُ",
        "urdu": "سیدنا انس رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم کی نظر ایک ایسے آدمی پر پڑی جس کے پاؤں کی ناخن برابر جگہ پر پانی نہ پہنچا (یعنی خشک رہ گئی)۔ آپ صلی اللہ علیہ وسلم نے اسے حکم دیا کہ ”واپس جاؤ اور اچھی طرح عمدہ طریق سے وضو کرو۔“ اسے ابوداؤد اور نسائی نے روایت کیا ہے۔ ",
        "english": "Narrated Anas (may Allah be pleased with him): \"The Prophet (ﷺ) saw a man, and on his foot was a spot the size of a fingernail that water had not reached. He commanded him: 'Go back and perform your Wudu perfectly.'\" Narrated by Abu Dawud and An-Nasā’ī."
      }
    },

    {
      "id": 51,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ  - رضى الله عنه  - قَالَ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -يَتَوَضَّأُ بِالْمُدِّ, وَيَغْتَسِلُ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": " سیدنا انس رضی اللہ عنہ سے یہ روایت بھی ہے کہ رسول اللہ صلی اللہ علیہ وسلم ”مد“ پانی سے وضو اور ”صاع“ (یعنی چار) سے پانچ ”مد“ تک پانی سے غسل کر لیا کرتے تھے۔ (بخاری و مسلم) ",
        "english": "Narrated Anas (may Allah be pleased with him): \"The Messenger of Allah (ﷺ) used to perform Wudu with one **Mudd** (unit of volume) of water, and perform Ghusl (major ablution) with one **Sā'** (four Mudds) up to five **Mudds** of water.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 52,
      "name": {
        "arabic": "وَعَنْ عُمَرَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ مَا مِنْكُمْ مِنْ أَحَدٍ يَتَوَضَّأُ, فَيُسْبِغُ اَلْوُضُوءَ, ثُمَّ يَقُولُ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ, وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ, إِلَّا فُتِحَتْ لَهُ أَبْوَابُ اَلْجَنَّةِ } أَخْرَجَهُ مُسْلِم ٌ  وَاَلتِّرْمِذِيُّ, وَزَادَ: { اَللَّهُمَّ اِجْعَلْنِي مِنْ اَلتَّوَّابِينَ, وَاجْعَلْنِي مِنْ اَلْمُتَطَهِّرِينَ }",
        "urdu": "سیدنا عمر رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا ”تم میں سے کوئی بھی ایسا نہیں کہ وضو کرے اور خوب اچھی طرح کرے پھر یوں کہے «أشهد أن لا إله إلا الله، وحده لا شريك له، وأشهد أن محمدا عبده ورسوله» کہ میں اس بات کی شہادت دیتا ہوں کہ اللہ کے سوا کوئی الٰہ نہیں، اس کا کوئی ساجھی و شریک نہیں اور نیز میں اس بات کی بھی شہادت دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں مگر اس کیلئے جنت کے آٹھوں دروازے کھول دیئے جاتے ہیں کہ اب جس دروازے سے چاہے داخل جنت ہو۔“ (مسلم، ترمذی) اور ترمذی نے اتنا اضافہ کیا ہے کہ ”اے اللہ! مجھے توبہ کرنے اور پاک رہنے والوں میں سے کر دے۔“ ",
        "english": "Narrated ʿUmar (may Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"There is none among you who performs Wudu (ablution) and performs it perfectly (yusbighu al-wuḍū'), and then says: **'Ash-hadu an lā ilāha illallāhu waḥdahu lā sharīka lahu, wa ash-hadu anna muḥammadan ʿabduhu wa rasūluhu'** (I bear witness that there is no god but Allah alone, He has no partner, and I bear witness that Muhammad is His slave and His Messenger), except that the gates of Paradise are opened for him.\" Narrated by Muslim. At-Tirmidhi added: **'Allāhumma ijʿalnī min at-tawwābīna wajʿalnī min al-mutaṭahhirīn'** (O Allah, make me among those who repent and make me among those who purify themselves)."
      }
    }
  ]
}