{
  "chapId": 80,
  "bookId": 9,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1009,
    "to": 1019
  },
  "hadiths": [
    {
      "id": 1009,
      "name": {
        "arabic": "عَنْ أَبِي بَكْرٍ بْنِ مُحَمَّدٍ بْنِ عَمْرِوِ بْنِ حَزْمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَتَبَ إِلَى أَهْلِ اَلْيَمَنِ.‏.‏.‏ فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ: { أَنَّ مَنْ اِعْتَبَطَ مُؤْمِنًا قَتْلاً عَنْ بَيِّنَةٍ, فَإِنَّهُ قَوَدٌ, إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ اَلْمَقْتُولِ, وَإِنَّ فِي اَلنَّفْسِ اَلدِّيَةَ مِائَةً مِنْ اَلْإِبِلِ, وَفِي اَلْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ اَلدِّيَةُ, وَفِي اَللِّسَانِ اَلدِّيَةُ, وَفِي اَلشَّفَتَيْنِ اَلدِّيَةُ, وَفِي اَلذِّكْرِ اَلدِّيَةُ, وَفِي اَلْبَيْضَتَيْنِ اَلدِّيَةُ, وَفِي اَلصُّلْبِ اَلدِّيَةُ, وَفِي اَلْعَيْنَيْنِ اَلدِّيَةُ, وَفِي اَلرِّجْلِ اَلْوَاحِدَةِ نِصْفُ اَلدِّيَةِ, وَفِي الْمَأْمُومَةِ ثُلُثُ اَلدِّيَةِ, وَفِي اَلْجَائِفَةِ ثُلُثُ اَلدِّيَةِ, وَفِي اَلْمُنَقِّلَةِ خَمْسَ عَشْرَةَ مِنْ اَلْإِبِلِ, وَفِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ اَلْيَدِ وَالرِّجْلِ عَشْرٌ مِنْ اَلْإِبِلِ, وَفِي اَلسِّنِّ خَمْسٌ مِنْ اَلْإِبِلِ وَفِي اَلْمُوضِحَةِ خَمْسٌ مِنْ اَلْإِبِلِ, وَإِنَّ اَلرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ, وَعَلَى أَهْلِ اَلذَّهَبِ أَلْفُ دِينَارٍ } أَخْرَجَهُ أَبُو دَاوُدَ فِي \"اَلْمَرَاسِيلِ\" وَالنَّسَائِيُّ, وَابْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَأَحْمَدُ, وَاخْتَلَفُوا فِي صِحَّتِهِ",
        "urdu": "سیدنا ابوبکر بن محمد بن عمرو بن حزم نے اپنے باپ کے حوالہ سے اپنے دادا سے روایت کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اہل یمن کو لکھا، پھر حدیث بیان کی جس میں یہ تحریر تھا جس کسی نے ایک بےگناہ مسلمان کو قتل کیا اور اس قتل کے گواہ ہوں تو اس پر قصاص لازم ہے۔ الایہ کہ مقتول کے ورثاء راضی ہوں تو ایک جان کے قتل کی دیت سو اونٹ ہے اور ناک میں بھی پوری دیت ہے جبکہ اسے جڑ سے کاٹ دے اور دونوں آنکھوں اور زبان اور دونوں ہونٹوں کے عوض بھی پوری دیت ہے۔ اسی طرح عضو مخصوص اور دو خصیہ میں پوری دیت ہے اور پشت میں بھی پوری دیت ہے اور ایک پاؤں کی صورت میں آدھی دیت ہے اور دماغ کے زخم اور پیٹ کے زخم میں تہائی دیت ہے اور وہ زخم جس سے ہڈی ٹوٹ جائے اس میں پندرہ اونٹ اور ہاتھ اور پاؤں کی ہر ایک انگلی میں دس دس اونٹ دیت ہے اور ایک دانت کی دیت پانچ اونٹ اور ایسے زخم میں جس سے ہڈی نظر آنے لگے پانچ اونٹ دیت ہے اور مرد کو عورت کے بدلہ قتل کیا جائے گا اور جن کے پاس اونٹ نہ ہوں اور سونا ہو تو ان سے ایک ہزار دینار وصول کئے جائیں گے۔ ابوداؤد نے اسے اپنی مراسیل میں لکھا ہے اور نسائی، ابن خزیمہ، ابن جارود، ابن حبان اور احمد نے روایت کیا ہے اور اس کی صحت میں انہوں نے اختلاف کیا ہے۔",
        "english": "Narrated Abu Bakr bin Muhammad bin 'Amr bin Hazm on the authority of his father from his grandfather: The Prophet (ﷺ) wrote a letter to the people of Yemen which contained: \"Whoever kills a believer unjustly, without a cause, shall be subject to retaliation (Qisas) unless the next of kin of the murdered person are satisfied. The blood money for a life is a hundred camels. For the nose, if completely cut off, the full blood money is to be paid. For the tongue, the lips, the genitals, the testicles, the backbone, and the eyes, the full blood money is to be paid. For one foot, half of the blood money is to be paid. For a wound in the head reaching the brain, one-third of the blood money is to be paid. For a deep stomach wound, one-third of the blood money. For a wound that shifts a bone, fifteen camels. For every finger and toe, ten camels. For a tooth, five camels. For a wound that exposes the bone, five camels. A man is to be killed for (killing) a woman, and those who possess gold must pay one thousand Dinars.\""
      }
    },

    {
      "id": 1010,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { دِيَةُ اَلْخَطَأَ أَخْمَاسًا: عِشْرُونَ حِقَّةً, وَعِشْرُونَ جَذَعَةً, وَعِشْرُونَ بَنَاتِ مَخَاضٍ, وَعِشْرُونَ بَنَاتِ لَبُونٍ, وَعِشْرُونَ بَنِي لَبُونٍ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ.‏ وَأَخْرَجَهُ اَلْأَرْبَعَةُ, بِلَفْظٍ: { وَعِشْرُونَ بِنِي مَخَاضٍ } , بَدَلَ: { بُنِيَ لَبُونٍ } .‏ وَإِسْنَادُ اَلْأَوَّلِ أَقْوَى.‏ وَأَخْرَجَهُ اِبْنُ أَبِي شَيْبَةَ مِنْ وَجْهٍ آخَرَ مَوْقُوفًا, وَهُوَ أَصَحُّ مِنْ اَلْمَرْفُوعِ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا ” قتل خطا کی صورت میں پانچ قسم کے اونٹ دیت میں وصول کئے جائیں گے۔ بیس ایسے اونٹ جن کی عمر تین سال ہو اور بیس اونٹ جن کی عمر چار سال ہو اور بیس مادہ اونٹ جن کی عمر دو سال ہو اور بیس مادہ اونٹ جن کی عمر ایک ایک سال ہو اور بیس نر اونٹ جن کی عمر ایک سال ہو۔“ (سنن دارقطنی) اور چاروں نے ان الفاظ سے ذکر کیا ہے کہ بیس نر اونٹ ایک سال عمر کے بدلے دو سال عمر کے اور پہلی کی سند قوی ہے اور ابن ابی شیبہ نے ایک اور طریق سے موقوفاً روایت کیا ہے اور اس کی سند اس مرفوع سے زیادہ صحیح ہے۔",
        "english": "Narrated Ibn Mas'ud (RA): The Prophet (ﷺ) said: 'The blood-money for accidental homicide is paid in five categories: twenty Hiqqahs (three-year-old she-camels), twenty Jadha'ahs (four-year-old she-camels), twenty Bint Makhads (one-year-old she-camels), twenty Bint Labuns (two-year-old she-camels), and twenty Bani Labuns (two-year-old male camels).' [Reported by ad-Daraqutni. The four reported it with the words 'twenty Bani Makhads' instead of 'Bani Labuns']. The first chain is stronger. Ibn Abi Shaibah reported it through another chain as Mauquf, which is more authentic than the Marfu' version."
      }
    },

    {
      "id": 1011,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ أَعْتَى اَلنَّاسِ عَلَى اَللَّهِ ثَلَاثَةٌ: مَنْ قَتَلَ فِي حَرَمَ اَللَّهِ, أَوْ قَتَلَ غَيْرَ قَاتِلِهِ, أَوْ قَتَلَ لِذَحْلِ اَلْجَاهِلِيَّةِ } أَخْرَجَهُ اِبْنُ حِبَّانَ فِي حَدِيثٍ صَحَّحَهُ وَأَصْلُهُ فِي اَلْبُخَارِيِّ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا ” اللہ تعالیٰ کے ہاں سب سے زیادہ سرکشی کرنے والے لوگ تین قسم کے ہیں: (ایک) وہ جو اللہ کے حرم میں قتل کرے، (دوسرا) وہ جو اپنے (اصل) قاتل کے علاوہ کسی اور کو (بدلے میں) قتل کرے، (تیسرا) وہ جو جاہلیت کی دشمنی یا انتقام کی بنا پر قتل کرے۔“",
        "english": "Narrated 'Abdullah bin 'Amr (RA): The Prophet (ﷺ) said: \"The most insolent/transgressing of people to Allah are three: One who kills in the Sacred Precincts (Haram) of Allah, one who kills someone other than the actual killer (in retaliation), or one who kills for the sake of Jahiliyyah (pre-Islamic) vendetta/revenge.\""
      }
    },

    {
      "id": 1012,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَلَا إِنَّ دِيَةَ اَلْخَطَأِ شِبْهِ اَلْعَمْدِ ‏-مَا كَانَ بِالسَّوْطِ وَالْعَصَا‏- مَائَةٌ مِنَ اَلْإِبِلِ, مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” خبردار! قتلِ خطا جو شبہ عمد ہو (یعنی جو کوڑے اور لاٹھی سے مارا گیا ہو) اس کی دیت سو اونٹ ہے۔ ان میں سے چالیس اونٹنیاں ایسی ہوں گی جو حاملہ ہوں گی (جن کے پیٹ میں بچے ہوں گے)۔“ اسے ابوداؤد، نسائی اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated ‘Abdullah bin ‘Amr bin al-’As (RA): Allah's Messenger (ﷺ) said: \"Behold! The blood-money for accidental homicide which is like intentional (quasi-intentional) — that which is committed with a whip or a stick — is one hundred camels, forty of which are pregnant.\""
      }
    },

    {
      "id": 1013,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { هَذِهِ وَهَذِهِ سَوَاءٌ ‏-يَعْنِي: اَلْخُنْصَرَ وَالْإِبْهَامَ } رَوَاهُ اَلْبُخَارِيُّ وَلِأَبِي دَاوُدَ وَاَلتِّرْمِذِيَّ: { دِيَةُ اَلْأَصَابِعِ سَوَاءٌ, وَالْأَسْنَانُ سَوَاءٌ: اَلثَّنِيَّةُ وَالضِّرْسُ سَوَاءٌ } وَلِابْنِ حِبَّانَ: { دِيَةُ أَصَابِعِ اَلْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاءٌ, عَشَرَةٌ مِنْ اَلْإِبِلِ لِكُلِّ إصْبَعٍ }",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” یہ اور یہ یعنی چھنگلی اور انگوٹھا (دیت میں) برابر ہیں۔“ (بخاری) اور ابوداؤد اور ترمذی کی روایت میں ہے ” سب انگلیاں برابر اور سارے دانت برابر، ثنیہ (سامنے کے دانت) اور داڑھ (دیت میں) برابر ہیں۔“ اور ابن حبان میں روایت ہے ” ہاتھوں اور پاؤں کی انگلیوں کی دیت برابر ہے۔ ہر انگلی کے بدلہ دس اونٹ دیت ہے۔“",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: \"This and this are equal,\" meaning the little finger and the thumb. (Bukhari). In a narration by Abu Dawud and At-Tirmidhi: \"The blood money for all fingers is equal, and for all teeth is equal; the incisor and the molar are equal.\" Ibn Hibban narrated: \"The blood money for the fingers of the hands and the toes of the feet is the same: ten camels for each finger or toe.\""
      }
    },

    {
      "id": 1014,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ رَفَعَهُ قَالَ: { مَنْ تَطَبَّبَ ‏-وَلَمْ يَكُنْ بِالطِّبِّ مَعْرُوفًا‏- فَأَصَابَ نَفْسًا فَمَا دُونَهَا, فَهُوَ ضَامِنٌ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ, وَهُوَ عِنْدَ أَبِي دَاوُدَ, وَالنَّسَائِيِّ وَغَيْرِهِمَا; إِلَّا أَنَّ مَنْ أَرْسَلَهُ أَقْوَى مِمَّنْ وَصَلَهُ.",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ نے اپنے باپ سے اور انہوں نے اپنے دادا سے مرفوع روایت بیان کی ہے کہ ” جو شخص اپنے آپ طبیب بن کر کسی کو دوائی دیتا ہے حالانکہ اسے طبابت میں مہارت نہیں اور اس (کے غلط علاج) سے کوئی آدمی قتل ہو جائے یا کوئی نقصان کسی کو پہنچ جائے تو وہ اس کا ضامن ہے۔“ اسے دارقطنی نے روایت کیا ہے اور حاکم نے صحیح قرار دیا ہے۔ ابوداؤد اور نسائی وغیرہ کے ہاں بھی یہ روایت منقول ہے مگر جن راویوں نے اس روایت کو مرسل بیان کیا ہے وہ ان راویوں سے زیادہ قوی ہیں جنہوں نے اسے موصول بیان کیا ہے۔",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority from his grandfather (RA) that the Messenger of Allah (ﷺ) said: \"Whoever practices medicine without being known for it (having no medical knowledge), and causes death or any (other) harm (to a patient), he is held responsible (liable for Diyat).\" [Reported by ad-Daraqutni and Al-Hakim graded it Sahih. It is also found in Abu Dawud and An-Nasa'i]."
      }
    },

    {
      "id": 1015,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { فِي الْمَوَاضِحِ خَمْسٌ, خَمْسٌ مِنْ اَلْإِبِلِ } رَوَاهُ أَحْمَدُ.‏ وَالْأَرْبَعَةُ.‏ وَزَادَ أَحْمَدُ: { وَالْأَصَابِعُ سَوَاءٌ, كُلُّهُنَّ عَشْرٌ, عَشْرٌ مِنَ اَلْإِبِلِ } وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ ",
        "urdu": "عمرو بن شعیب رحمہ اللہ نے اپنے والد سے، انہوں نے اپنے دادا سے روایت کی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جن زخموں سے ہڈی کھل جائے ان کی دیت پانچ اونٹ ہیں۔“ اسے احمد اور چاروں نے روایت کیا ہے اور احمد میں اتنا اضافہ ہے ” تمام انگلیوں کی دیت برابر ہے، ہر انگلی کی دیت دس دس اونٹ ہے۔“ اس روایت کو ابن خزیمہ اور ابن جارود نے صحیح قرار دیا ہے۔ ",
        "english": "Narrated 'Amr bin Shu'aib, on the authority of his father from his grandfather (RA): The Prophet (ﷺ) said: \"The blood money for a wound that exposes the bone (Al-Mudihah) is five camels.\" Reported by Ahmad and the four (Sunan compilers). Ahmad added: \"And all fingers are equal (in blood money); for each one, ten camels are to be paid.\" Ibn Khuzaimah and Ibn al-Jarud graded it Sahih."
      }
    },

    {
      "id": 1016,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَقْلُ أَهْلِ اَلذِّمَّةِ نِصْفُ عَقْلِ اَلْمُسْلِمِينَ } رَوَاهُ أَحْمَدُ وَالْأَرْبَعَةُ .‏ وَلَفْظُ أَبِي دَاوُدَ: { دِيَةُ اَلْمُعَاهِدِ نِصْفُ دِيَةِ اَلْحُرِّ } وَلِلنِّسَائِيِّ: { عَقْلُ اَلْمَرْأَةِ مِثْلُ عَقْلِ اَلرَّجُلِ, حَتَّى يَبْلُغَ اَلثُّلُثَ مِنْ دِيَتِهَا } وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ.‏",
        "urdu": "سیدنا عمرو بن شعیب سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ذمیوں (غیر مسلم شہریوں) کی دیت مسلمانوں کی دیت کا نصف ہے۔“ اسے احمد اور چاروں نے روایت کیا ہے۔ ابوداؤد کے الفاظ ہیں: ”معاہد کی دیت آزاد کے مقابلے میں آدھی ہے۔“ اور نسائی کی روایت میں ہے: ”عورت کی دیت کے زخموں کا بدلہ مرد کی دیت کی مانند ہے، یہاں تک کہ وہ اس کی مکمل دیت کے تہائی حصے تک پہنچ جائے۔“ اسے ابن خزیمہ نے صحیح قرار دیا ہے۔",
        "english": "Narrated ‘Amr bin Shu’aib, on his father’s authority from his grandfather: The Messenger of Allah (ﷺ) said: 'The blood-money for the People of the Covenant (Dhimmis) is half that of the Muslims.' [Reported by Ahmad and the four]. Abu Dawud's version is: 'The blood-money of a person under a covenant is half that of a free man.' An-Nasa'i's version states: 'The compensation for a woman's injury is equal to that of a man until it reaches one-third of her full blood-money.' [Ibn Khuzaimah graded it Sahih]."
      }
    },

    {
      "id": 1017,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَقْلُ شِبْهِ اَلْعَمْدِ مُغَلَّظٌ مِثْلُ عَقْلِ اَلْعَمْدِ, وَلَا يُقْتَلُ صَاحِبُهُ, وَذَلِكَ أَنْ يَنْزُوَ اَلشَّيْطَانُ, فَتَكُونُ دِمَاءٌ بَيْنَ اَلنَّاسِ فِي غَيْرِ ضَغِينَةٍ, وَلَا حَمْلِ سِلَاحٍ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ وَضَعَّفَهُ",
        "urdu": "سیدنا عمرو بن شعیب ہی اس کے بھی راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” قتل شبہ کی دیت قتل عمد کی طرح دیت مغلظہ ہے۔ اس لئے قاتل کو قتل نہیں کیا جائے گا۔ ہو سکتا ہے کہیں شیطان درمیان میں دخل اندازی کرے اور بغیر کسی دشمنی اور بغیر ہتھیاروں کے کسی اور وجہ سے قتل عام شروع ہو جائے۔“ اس کی دارقطنی نے تخریج کی ہے اور اسے ضعیف قرار دیا ہے۔",
        "english": "Narrated 'Amr bin Shu'aib on the authority of his father from his grandfather (RA): The Messenger of Allah (ﷺ) said: 'The blood money for semi-intentional murder (Shibhu al-'Amd) is heavy (Mughallazah) like that of intentional murder, but the perpetrator is not to be killed. This happens when the devil incites (bitterness), leading to bloodshed among people without any (prior) enmity or the use of weapons.'"
      }
    },

    {
      "id": 1018,
      "name": {
        "arabic": "عَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَتَلَ رَجُلٌ رَجُلًا عَلَى عَهْدِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- فَجَعَلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-دِيَتَهُ اِثْنَيْ عَشَرَ أَلْفًا } رَوَاهُ اَلْأَرْبَعَةُ, وَرَجَّحَ النَّسَائِيُّ وَأَبُو حَاتِمٍ إِرْسَالَهُ.‏",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں ایک آدمی نے دوسرے آدمی کو قتل کر دیا تو نبی کریم صلی اللہ علیہ وسلم نے اس کی دیت بارہ ہزار (درہم) طے فرمائی۔ اسے چاروں نے روایت کیا ہے، نسائی اور ابوحاتم نے اس روایت کے مرسل ہونے کو ترجیح دی ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): A man killed another man during the time of the Prophet (ﷺ), so the Prophet (ﷺ) fixed his blood-money (Diyat) at twelve thousand (Dirhams). [Reported by the four (Imams); An-Nasa'i and Abu Hatim preferred the Mursal version of it]."
      }
    },

    {
      "id": 1019,
      "name": {
        "arabic": "وَعَنْ أَبِي رِمْثَةَ قَالَ: { أَتَيْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَمَعِي اِبْنِي .‏ فَقَالَ: \"مَنْ هَذَا?\" قُلْتُ: اِبْنِي.‏ أَشْهَدُ بِهِ.‏ قَالَ: \"أَمَّا إِنَّهُ لَا يَجْنِي عَلَيْكَ, وَلَا تَجْنِي عَلَيْهِ } رَوَاهُ النَّسَائِيُّ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ ",
        "urdu": "سیدنا ابورمثہ رضی اللہ عنہ سے روایت ہے کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ میرے ساتھ میرا بیٹا بھی تھا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ” یہ کون ہے؟“ میں نے عرض کیا۔ میرا بیٹا ہے لہذا آپ صلی اللہ علیہ وسلم اس پر گواہ رہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” بیشک یہ تیرے گناہ و جرم کا ذمہ دار نہیں اور نہ تو اس کے گناہ و جرم کا ذمہ دار۔“ اسے نسائی اور ابوداؤد نے روایت کیا ہے اور ابن خزیمہ اور ابن جارود نے اسے صحیح کہا ہے۔ ",
        "english": "Narrated Abu Rimthah (RA): I went to the Prophet (ﷺ) with my son. He asked, \"Who is this?\" I replied, \"He is my son; I bear witness to it.\" He (ﷺ) said, \"Truly, he is not responsible for your offense, nor are you responsible for his offense.\""
      }
    }
  ]
}
