{
  "chapId": 90,
  "bookId": 11,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1123,
    "to": 1129
  },
  "hadiths": [
    {
      "id": 1123,
      "name": {
        "arabic": "عَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عَوْفٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَخَذَهَا ‏- يَعْنِي: اَلْجِزْيَةُ ‏- مِنْ مَجُوسِ هَجَرَ } رَوَاهُ اَلْبُخَارِيّ ُ .‏ وَلَهُ طَرِيقٌ فِي \"اَلْمَوْطَأِ\" فِيهَا اِنْقِطَاع ٍ ",
        "urdu": "سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے حجر (بحرین) کے مجوسیوں (آتش پرستوں) سے جزیہ لیا تھا۔ اسے بخاری نے روایت کیا ہے اور موطا میں اس حدیث کی ایک اور سند ہے جس میں انقطاع ہے۔",
        "english": "Narrated 'Abdur-Rahman bin 'Auf (RA): The Prophet (ﷺ) took Jizyah from the Magians (Zoroastrians) of Hajar (Bahrain)."
      }
    },

    {
      "id": 1124,
      "name": {
        "arabic": "وَعَنْ عَاصِمِ بْنِ عُمَرَ, عَنْ أَنَسٍ, وَعَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بَعَثَ خَالِدَ بْنَ اَلْوَلِيدِ إِلَى أُكَيْدِرِ دُومَةَ, فَأَخَذُوهُ , فَحَقَنَ دَمَهُ, وَصَالَحَهُ عَلَى اَلْجِزْيَةِ } رَوَاهُ أَبُو دَاوُدَ ",
        "urdu": "عاصم بن عمر رحمہ اللہ، سیدنا انس رضی اللہ عنہ اور سیدنا عثمان بن ابی سلیمان رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کو دومۃ الجندل کے حکمران اکیدر کے پاس بھیجا۔ خالد رضی اللہ عنہ کے ساتھیوں نے اسے گرفتار کر لیا اور اسے (نبی ﷺ کے پاس) لے آئے۔ آپ ﷺ نے اس کا خون محفوظ کر دیا (یعنی قتل نہیں کیا) اور اس سے جزیہ پر صلح کر لی۔ (ابوداؤد)",
        "english": "Narrated 'Asim bin 'Umar, on the authority of Anas (R.A) and 'Uthman bin Abi Sulaiman: The Prophet (ﷺ) sent Khalid bin al-Walid to Ukaidir of Dumah. They captured him and brought him to the Prophet (ﷺ). He spared his life and made peace with him on the condition that he pays Jizyah. [Reported by Abu Dawud]."
      }
    },

    {
      "id": 1125,
      "name": {
        "arabic": " وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ: { بَعَثَنِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-إِلَى اَلْيَمَنِ, وَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ حَالِمٍ دِينَاراً, أَوْ عَدْلَهُ معافرياً } أَخْرَجَهُ اَلثَّلَاثَةِ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِم ُ",
        "urdu": "سیدنا معاذ بن جبل رضی اللہ عنہ روایت کرتے ہیں کہ مجھے نبی کریم صلی اللہ علیہ وسلم نے یمن کی طرف بھیجا اور حکم دیا کہ ” میں ہر بالغ سے ایک دینار بطور جزیہ وصول کروں یا پھر اس کے برابر قیمت کا معافری کپڑا لوں۔“",
        "english": "Narrated Mu'adh bin Jabal (RA): The Prophet (ﷺ) sent me to Yemen and commanded me to take one Dinar as Jizyah from every male who has reached puberty, or its equivalent in Ma'afiri cloth."
      }
    },

    {
      "id": 1126,
      "name": {
        "arabic": "وَعَنْ عَائِذِ بْنِ عَمْرِوِ الْمُزَنِيِّ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"اَلْإِسْلَامِ يَعْلُو, وَلَا يُعْلَى\" } أَخْرَجَهُ اَلدَّارَقُطْنِيّ ُ",
        "urdu": "سیدنا عائذ بن عمرو المزنی رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”اسلام ہمیشہ غالب رہتا ہے اور مغلوب نہیں ہوتا۔“ (دارقطنی)",
        "english": "Narrated 'Aidh bin 'Amr al-Muzani (R.A): The Prophet (ﷺ) said: 'Islam is always superior and should never be surpassed (or treated as inferior).'"
      }
    },

    {
      "id": 1127,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" لَا تَبْدَؤُوا اَلْيَهُودَ وَالنَّصَارَى بِالسَّلَامِ, وَإِذَا لَقِيتُمْ أَحَدَهُمْ فِي طَرِيقٍ, فَاضْطَرُّوهُ إِلَى أَضْيَقِهِ\" } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہود و نصاریٰ کو سلام کرنے میں پہل نہ کرو، اور جب راستے میں ان سے سامنا ہو تو انہیں (وقار برقرار رکھتے ہوئے) راستے کے تنگ حصے کی طرف مائل کر دو۔“",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'Do not be the first to greet the Jews and the Christians with peace (Salam), and when you meet one of them on the road, force him to its narrowest part.'"
      }
    },

    {
      "id": 1128,
      "name": {
        "arabic": "وَعَنْ اَلْمِسْوَرِ بْنِ مَخْرَمَةَ.‏ وَمَرْوَانُ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-خَرَجَ عَامَ اَلْحُدَيْبِيَةِ.‏ ….‏.‏ فَذَكِّرْ اَلْحَدِيثَ بِطُولِهِ, وَفِيهِ: \" هَذَا مَا صَالَحَ عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اَللَّهِ سُهَيْلِ بْنِ عَمْرِوٍ: عَلَى وَضْعِ اَلْحَرْبِ عَشْرِ سِنِينَ, يَأْمَنُ فِيهَا اَلنَّاسُ, وَيَكُفُّ بَعْضُهُمْ عَنْ بَعْضِ\" } أَخْرَجَهُ أَبُو دَاوُدَ .‏ وَأَصْلِهِ فِي اَلْبُخَارِيّ ِ وَأَخْرُجَ مُسْلِمٍ بَعْضِهِ مِنْ حَدِيثِ أَنَسٍ, وَفِيهِ: { أَنَّ مَنْ جَاءَ مِنْكُمْ لَمْ نَرُدْهُ عَلَيْكُمْ, وَمَنْ جَاءَكُمْ مِنَّا رَدَدْتُمُوهُ عَلَيْنَا.‏ فَقَالُوا: أَنَكْتُبُ هَذَا يَا رَسُولُ اَللَّهُ? قَالَ: \"نَعَمْ.‏ إِنَّهُ مَنْ ذَهَبَ مِنَّا إِلَيْهِمْ فَأَبْعَدَهُ اَللَّهُ, وَمَنْ جَاءَنَا مِنْهُمْ, فَسَيَجْعَلُ اَللَّهُ لَهُ فَرَجاً وَمُخْرِجاً\" }",
        "urdu": "سیدنا مسور بن مخرمہ اور مروان بن حکم رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ صلح حدیبیہ والے سال نکلے۔۔۔ (راوی نے لمبی حدیث بیان کی) جس میں یہ مذکور ہے کہ: ”یہ وہ دستاویز ہے جس پر محمد بن عبداللہ (ﷺ) نے سہیل بن عمرو سے صلح کی ہے کہ دس سال تک جنگ بند رہے گی، اس دوران لوگ امن سے رہیں گے اور ایک دوسرے پر ہاتھ نہیں اٹھائیں گے۔“ (ابوداؤد و بخاری)۔ اور مسلم کی روایت میں (حضرت انس سے) مروی ہے کہ: ”(مشرکین نے شرط رکھی کہ) جو شخص آپ کے پاس سے ہمارے پاس آئے گا ہم اسے واپس نہیں کریں گے، اور جو ہمارا آدمی آپ کے پاس آئے گا آپ اسے واپس لوٹا دیں گے۔“ صحابہ نے عرض کیا: اے اللہ کے رسول! کیا ہم یہ (سخت شرط) لکھ لیں؟ آپ ﷺ نے فرمایا: ”ہاں! جو ہم میں سے ان کے پاس چلا گیا اسے اللہ نے (اپنی رحمت سے) دور کر دیا، اور جو ان میں سے ہمارے پاس آئے گا اللہ اس کے لیے جلد ہی کوئی راستہ اور خلاصی کی صورت نکال دے گا۔“",
        "english": "Narrated Al-Miswar bin Makhrama and Marwan: The Prophet (ﷺ) set out in the year of Al-Hudaibiya... (the long Hadith mentions): 'This is what Muhammad bin 'Abdullah has agreed with Suhail bin 'Amr: to stop fighting for ten years, during which time the people will be secure and will not attack each other.' [Reported by Abu Dawud and Bukhari]. Muslim reported part of it from Anas (R.A) which states: 'Whoever comes to us (Makkans) from you, we will not return him; but whoever comes to you (Muslims) from us, you must return him to us.' The Sahaba said: 'O Messenger of Allah! Shall we write this down?' He replied: 'Yes, for whoever goes from us to them, may Allah keep him away; and whoever comes to us from them, Allah will soon provide for him relief and a way out.'"
      }
    },

    {
      "id": 1129,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو ٍ عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"مَنْ قَتَلَ مُعَاهِداً لَمْ يَرَحْ رَائِحَةَ اَلْجَنَّةِ, وَإِنَّ رِيحَهَا لِيُوجَدَ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامّاً\" } أَخْرَجَهُ اَلْبُخَارِيّ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے کہ ”جس کسی نے عہدی (جس سے امن کا معاہدہ ہو) کو قتل کیا وہ جنت کی خوشبو نہیں پائے گا، حالانکہ جنت کی خوشبو چالیس برس کی مسافت سے بھی محسوس کی جا سکتی ہے۔“",
        "english": "Narrated 'Abdullah bin 'Amr (RA): The Prophet (ﷺ) said: 'Whoever kills a Mu'ahid (a non-Muslim under a pledge of protection) will not smell the fragrance of Paradise, even though its fragrance can be detected from a distance of forty years.'"
      }
    }
  ]
}
