{
  "chapId": 33,
  "bookId": 5,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 527,
    "to": 551
  },
  "hadiths": [
    {
      "id": 527,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ لَا تَقَدَّمُوا رَمَضَانَ بِصَوْمِ يَوْمٍ وَلَا يَوْمَيْنِ, إِلَّا رَجُلٌ كَانَ يَصُومُ صَوْمًا, فَلْيَصُمْهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”تم میں سے کوئی بھی رمضان سے پہلے ایک یا دو روزے نہ رکھے (تاکہ رمضان کے روزوں کے ساتھ خلط ملط نہ ہو)، مگر وہ شخص جو (پہلے سے کوئی خاص) روزہ رکھتا آ رہا ہو (جیسے پیر یا جمعرات کا روزہ) تو وہ اس دن کا روزہ رکھ لے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"Do not precede Ramadan by fasting a day or two before it, except for a person who habitually observes particular fasts; in that case, he may fast on that day.\""
      }
    },

    {
      "id": 528,
      "name": {
        "arabic": " وَعَنْ عَمَّارِ بْنِ يَاسِرٍ  - رضى الله عنه  - قَالَ: { مَنْ صَامَ اَلْيَوْمَ اَلَّذِي يُشَكُّ فِيهِ فَقَدْ عَصَى أَبَا اَلْقَاسِمِ  - صلى الله عليه وسلم  -} وَذَكَرَهُ اَلْبُخَارِيُّ تَعْلِيقًا, وَوَصَلَهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ ",
        "urdu": "سیدنا عمار بن یاسر رضی اللہ عنہ سے مروی ہے کہ جس شخص نے مشکوک دن (شعبان کی 30 تاریخ جب چاند نظر نہ آیا ہو) میں روزہ رکھا، اس نے یقیناً ابوالقاسم ﷺ کی نافرمانی کی۔ (بخاری نے اسے تعلیقاً اور پانچوں محدثین نے اسے موصولاً ذکر کیا ہے اور ابن حبان نے اسے صحیح کہا ہے)۔",
        "english": "Narrated Ammar bin Yasir (RA): \"He who observes the fast on the day of doubt (Yaum-ush-Shakk) has disobeyed Abul-Qasim (ﷺ).\" [Mentioned by al-Bukhari as Mu'allaq, and related by the five with a complete chain. Ibn Khuzaymah and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 529,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم يَقُولُ: { إِذَا رأَيْتُمُوهُ فَصُومُوا، وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا، فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ } مُتَّفَقٌ عَلَيْهِ. وَلِمُسْلِمٍ: { فَإِنْ أُغْمِيَ عَلَيْكُمْ فَاقْدُرُوا لَهُ ثَلَاثِينَ }. وَلِلْبُخَارِيِّ: { فَأَكْمِلُوا اَلْعِدَّةَ ثَلَاثِينَ } وَلَهُ فِي حَدِيثِ أَبِي هُرَيْرَةَ رضي الله عنه { فَأَكْمِلُوا عِدَّةَ شَعْبَانَ ثَلَاثِينَ }",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ”جب تم چاند دیکھ لو تو روزہ رکھو اور (عید کے لیے) چاند دیکھ لو تو افطار کر دو۔ اگر مطلع ابر آلود ہو تو اس کے لیے اندازہ لگا لو۔“ (متفق علیہ) مسلم کے الفاظ ہیں: ”اگر مطلع ابر آلود ہو تو تیس دن کی گنتی پوری کرو۔“ بخاری کے الفاظ ہیں: ”پھر تیس روز کی تعداد پوری کرو۔“ اور بخاری ہی میں ابوہریرہ رضی اللہ عنہ سے روایت ہے: ”پھر تم شعبان کے تیس دن پورے کرو۔“",
        "english": "Narrated Ibn 'Umar (RA): I heard Allah's Messenger (ﷺ) saying, \"When you see it (the new moon) fast, and when you see it, break your fast (for Eid), and if it is obscured from you, then calculate (the days for) it.\" [Agreed upon]. Muslim has: \"If it is obscured from you, then count thirty days.\" Al-Bukhari has: \"Complete the number to thirty.\" Also in Al-Bukhari, from Abu Hurairah (RA): \"Complete the number of Sha'ban to thirty.\""
      }
    },

    {
      "id": 530,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { تَرَاءَى اَلنَّاسُ اَلْهِلَالَ, فَأَخْبَرْتُ رَسُولَ اَللَّهِ صلى الله عليه وسلم أَنِّي رَأَيْتُهُ, فَصَامَ, وَأَمَرَ اَلنَّاسَ بِصِيَامِهِ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ لوگوں نے چاند دیکھنے کی کوشش کی تو میں نے رسول اللہ ﷺ کو اطلاع دی کہ میں نے چاند دیکھ لیا ہے۔ آپ ﷺ نے (میری خبر پر) خود بھی روزہ رکھا اور لوگوں کو بھی روزہ رکھنے کا حکم دیا۔ (اسے ابوداؤد نے روایت کیا ہے اور حاکم اور ابن حبان نے اسے صحیح قرار دیا ہے)۔",
        "english": "Narrated Ibn 'Umar (RA): The people were looking for the new moon (of Ramadan) and I informed the Messenger of Allah (ﷺ) that I had sighted it. He (ﷺ) observed the fast and commanded the people to fast."
      }
    },

    {
      "id": 531,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ أَعْرَابِيًّا جَاءَ إِلَى اَلنَّبِيِّ صلى الله عليه وسلم فَقَالَ: { إِنِّي رَأَيْتُ اَلْهِلَالَ، فَقَالَ: \"أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ؟\" قَالَ: نَعَمْ. قَالَ: \"أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اَللَّهِ؟\" قَالَ: نَعَمْ. قَالَ: \"فَأَذِّنْ فِي اَلنَّاسِ يَا بِلَالُ أَنْ يَصُومُوا غَدًا\" } رَوَاهُ اَلْخَمْسَةُ، وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ، وَابْنُ حِبَّانَ، وَرَجَّحَ النَّسَائِيُّ إِرْسَالَهُ",
        "urdu": "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ ایک اعرابی (دیہاتی) نبی کریم ﷺ کی خدمت میں حاضر ہوا اور عرض کیا کہ میں نے چاند دیکھا ہے۔ آپ ﷺ نے اس سے دریافت فرمایا: ”کیا تو اس بات کی شہادت دیتا ہے کہ اللہ کے سوا کوئی الٰہ نہیں؟“ اس نے کہا: ہاں۔ آپ ﷺ نے فرمایا: ”کیا تو اس بات کی گواہی دیتا ہے کہ محمد اللہ کے رسول ہیں؟“ اس نے کہا: ہاں۔ آپ ﷺ نے فرمایا: ”اے بلال! لوگوں میں اعلان کر دو کہ وہ کل روزہ رکھیں۔“",
        "english": "Narrated Ibn 'Abbas (RA): A desert Arab came to the Prophet (ﷺ) and said, \"I have sighted the new moon (of Ramadan).\" He (the Prophet) asked, \"Do you bear witness that there is no god but Allah?\" He replied, \"Yes.\" He asked, \"Do you bear witness that Muhammad is the Messenger of Allah?\" He replied, \"Yes.\" He (the Prophet) then said, \"O Bilal! Announce to the people that they should fast tomorrow.\""
      }
    },

    {
      "id": 532,
      "name": {
        "arabic": "وَعَنْ حَفْصَةَ أُمِّ اَلْمُؤْمِنِينَ رَضِيَ اَللَّهُ عَنْهَا, عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { مَنْ لَمْ يُبَيِّتِ اَلصِّيَامَ قَبْلَ اَلْفَجْرِ فَلَا صِيَامَ لَهُ } رَوَاهُ اَلْخَمْسَةُ, وَمَالَ النَّسَائِيُّ وَاَلتِّرْمِذِيُّ إِلَى تَرْجِيحِ وَقْفِهِ, وَصَحَّحَهُ مَرْفُوعًا اِبْنُ خُزَيْمَةَ وَابْنُ حِبَّانَ . وَلِلدَّارَقُطْنِيِّ: { لَا صِيَامَ لِمَنْ لَمْ يَفْرِضْهُ مِنَ اَللَّيْلِ }",
        "urdu": "ام المؤمنین سیدہ حفصہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے فرمایا: ”جس شخص نے فجر (صبح صادق) سے پہلے روزے کی نیت نہ کی اس کا کوئی روزہ نہیں۔“ اسے پانچوں محدثین نے روایت کیا ہے۔ ترمذی اور نسائی نے اسے موقوف (صحابی کا قول) قرار دینے کی طرف میلان ظاہر کیا ہے جبکہ ابن خزیمہ اور ابن حبان نے اس کے مرفوع (نبی کا قول) ہونے کو صحیح قرار دیا ہے۔ دارقطنی کے الفاظ ہیں: ”اس شخص کا روزہ نہیں جس نے رات ہی سے اسے اپنے اوپر واجب (نیت) نہ کر لیا ہو۔“",
        "english": "Narrated Hafsah, Mother of the Believers (RA): The Prophet (ﷺ) said: \"Whoever does not intend to fast before dawn (Fajr), there is no fast for him.\" [Reported by the five. An-Nasa'i and At-Tirmidhi weighed towards it being Mauquf, but Ibn Khuzaymah and Ibn Hibban graded it Sahih as Marfu']. Ad-Daraqutni has: \"There is no fast for one who does not make it obligatory (by intention) during the night.\""
      }
    },

    {
      "id": 533,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ عَلَيَّ اَلنَّبِيُّ صلى الله عليه وسلم ذَاتَ يَوْمٍ. فَقَالَ: \" هَلْ عِنْدَكُمْ شَيْءٌ? \" قُلْنَا: لَا. قَالَ: \" فَإِذًا أَنَا صَائِمٌ \" ثُمَّ أَتَانَا يَوْمًا آخَرَ, فَقُلْنَا: أُهْدِيَ لَنَا حَيْسٌ, فَقَالَ: \" أَرِينِيهِ, فَلَقَدْ أَصْبَحْتُ صَائِمًا \" فَأَكَلَ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ ایک روز نبی کریم ﷺ میرے پاس تشریف لائے اور دریافت فرمایا: ”کیا تمہارے پاس (کھانے کی) کوئی چیز ہے؟“ ہم نے عرض کیا: نہیں۔ تو آپ ﷺ نے فرمایا: ”اچھا تو میں روزے سے ہوں۔“ اس کے بعد پھر ایک روز تشریف لائے تو ہم نے عرض کیا کہ ہمیں 'حیس' (کھجور، پنیر اور گھی سے بنا حلوہ) کا تحفہ دیا گیا ہے۔ آپ ﷺ نے فرمایا: ”ذرا مجھے دکھاؤ، میں نے صبح روزے کی نیت سے کی تھی۔“ (یہ فرما کر) آپ ﷺ نے وہ تناول فرما لیا۔",
        "english": "Narrated 'Aishah (RA): The Prophet (ﷺ) came to me one day and asked, \"Do you have anything (to eat)?\" We replied, \"No.\" He said, \"In that case, I am fasting.\" Then he came to us on another day and we said, \"We have been given a gift of Hais (a mixture of dates and ghee).\" He said, \"Show it to me, for I had begun the day fasting,\" and then he ate it."
      }
    },

    {
      "id": 534,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اَللَّهُ عَنْهُمَا, أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: { لَا يَزَالُ اَلنَّاسُ بِخَيْرٍ مَا عَجَّلُوا اَلْفِطْرَ } مُتَّفَقٌ عَلَيْهِ. وَلِلتِّرْمِذِيِّ: مِنْ حَدِيثِ أَبِي هُرَيْرَةَ رضي الله عنه عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: { قَالَ اَللَّهُ عَزَّ وَجَلَّ أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فِطْرًا }",
        "urdu": "سیدنا سہل بن سعد رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”لوگ اس وقت تک بھلائی پر قائم رہیں گے جب تک وہ روزہ افطار کرنے میں جلدی کریں گے۔“ (بخاری و مسلم) اور ترمذی میں ابوہریرہ رضی اللہ عنہ کی روایت میں ہے کہ اللہ تعالی نے فرمایا: ”میرے بندوں میں مجھے سب سے زیادہ محبوب وہ ہیں جو افطار میں جلدی کرنے والے ہیں۔“",
        "english": "Narrated Sahl bin Sa'd (RA): Allah's Messenger (ﷺ) said: \"The people will continue to be on the right path (in goodness) as long as they hasten the breaking of the fast.\" [Agreed upon]. At-Tirmidhi reported from Abu Hurairah (RA) that the Prophet (ﷺ) said: \"Allah (the Mighty and Sublime) said: 'The most beloved of My servants to Me are those who are quickest to break their fast.'\""
      }
    },

    {
      "id": 535,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ - رضي الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { تَسَحَّرُوا فَإِنَّ فِي اَلسَّحُورِ بَرَكَةً } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”سحری کھایا کرو، کیونکہ سحری کھانے میں برکت ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Anas bin Malik (RA): Allah's Messenger (ﷺ) said: \"Take Suhoor (pre-dawn meal), for there is a blessing in Suhoor.\""
      }
    },

    {
      "id": 536,
      "name": {
        "arabic": "وَعَنْ سَلْمَانَ بْنِ عَامِرٍ اَلضَّبِّيِّ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ, فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ, فَإِنَّهُ طَهُورٌ } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ وَابْنُ حِبَّانَ وَالْحَاكِمُ ",
        "urdu": "سیدنا سلمان بن عامر ضبی رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا: ”جب تم میں سے کوئی روزہ افطار کرے تو اسے کھجور سے افطار کرنا چاہیے، اگر کھجور نہ ملے تو پانی سے افطار کرے، کیونکہ وہ پاک (اور پاک کرنے والا) ہے۔“",
        "english": "Narrated Salman bin 'Amir al-Dhabbi (RA): The Prophet (ﷺ) said: \"When one of you breaks his fast, let him break it with dates; if he cannot find any, let him break it with water, for it is pure.\""
      }
    },

    {
      "id": 537,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: { نَهَى رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -عَنِ اَلْوِصَالِ, فَقَالَ رَجُلٌ مِنَ اَلْمُسْلِمِينَ: فَإِنَّكَ يَا رَسُولَ اَللَّهِ تُوَاصِلُ? قَالَ: \" وَأَيُّكُمْ مِثْلِي? إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي \".  فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنِ اَلْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا, ثُمَّ يَوْمًا, ثُمَّ رَأَوُا اَلْهِلَالَ, فَقَالَ: \" لَوْ تَأَخَّرَ اَلْهِلَالُ لَزِدْتُكُمْ \" كَالْمُنَكِّلِ لَهُمْ حِينَ أَبَوْا أَنْ يَنْتَهُوا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے 'وصال' (بغیر افطار کے مسلسل روزے رکھنے) سے منع فرمایا۔ ایک مسلمان نے عرض کیا: اللہ کے رسول! آپ تو وصال کرتے ہیں؟ آپ ﷺ نے فرمایا: ”تم میں سے کون میری طرح ہے؟ میں تو اس حال میں رات گزارتا ہوں کہ میرا رب مجھے کھلاتا اور پلاتا ہے۔“ پھر جب لوگ وصال سے باز نہ آئے تو آپ ﷺ نے ان کے ساتھ ایک دن، پھر دوسرے دن وصال کیا، پھر انہوں نے (عید کا) چاند دیکھ لیا۔ آپ ﷺ نے فرمایا: ”اگر چاند (نظر آنے میں) تاخیر ہو جاتی تو میں تمہارے لیے (روزوں کی تعداد) اور بڑھا دیتا۔“ یہ آپ ﷺ نے انہیں تنبیہ (سزا) کے طور پر فرمایا جب وہ باز نہ آئے۔ (متفق علیہ)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) forbade Al-Wisal (fasting for more than one day continuously without breaking it). A man from among the Muslims said, \"But you, O Messenger of Allah, observe Al-Wisal?\" He (ﷺ) replied, \"Who among you is like me? I spend the night while my Lord feeds me and gives me drink.\" When they refused to stop Al-Wisal, he fasted with them for a day, then another day, then they saw the crescent (of Eid). He (ﷺ) then said, \"If the crescent had been delayed, I would have increased it (the fasts) for you,\" as a sort of punishment for them because they had refused to stop."
      }
    },

    {
      "id": 538,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { مَنْ لَمْ يَدَعْ قَوْلَ اَلزُّورِ وَالْعَمَلَ بِهِ, وَالْجَهْلَ, فَلَيْسَ لِلَّهِ حَاجَةٌ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ } رَوَاهُ اَلْبُخَارِيُّ, وَأَبُو دَاوُدَ وَاللَّفْظُ لَهُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”جس شخص نے جھوٹ بولنا اور اس پر عمل کرنا نہ چھوڑا اور حماقت و نادانی (کے کاموں) کو ترک نہ کیا، تو اللہ تعالیٰ کو اس کے کھانا پینا چھڑانے کی کوئی ضرورت نہیں۔“ (بخاری و ابوداؤد، الفاظ ابوداؤد کے ہیں)۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"Whoever does not abandon falsehood in word and action, and ignorance (sinful behavior), Allah has no need that he should leave his food and drink.\""
      }
    },

    {
      "id": 539,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - يُقَبِّلُ وَهُوَ صَائِمٌ، وَيُبَاشِرُ وَهُوَ صَائِمٌ، وَلَكِنَّهُ أَمْلَكُكُمْ لِإِرْبِهِ } مُتَّفَقٌ عَلَيْهِ، وَاللَّفْظُ لِمُسْلِمٍ. وَزَادَ فِي رِوَايَةٍ: { فِي رَمَضَانَ }",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم روزے کی حالت میں اپنی بیوی کا بوسہ لے لیتے تھے اور معانقہ بھی فرما لیتے تھے لیکن آپ صلی اللہ علیہ وسلم تمہاری نسبت اپنی طبیعت پر زیادہ کنٹرول اور ضبط کرنے والے تھے۔ (بخاری و مسلم) یہ الفاظ مسلم کے ہیں اور ایک روایت میں اتنا اضافہ ہے کہ آپ صلی اللہ علیہ وسلم یہ دونوں فعل رمضان میں کرتے تھے۔",
        "english": "Narrated 'Aisha (RA): The Messenger of Allah (ﷺ) used to kiss and touch (his wives) while he was fasting, but he was the most able of you to control his desire. [Agreed upon, and the wording is Muslim's]. In another narration, it adds: 'In Ramadan'."
      }
    },

    {
      "id": 540,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - يُقَبِّلُ وَهُوَ صَائِمٌ, وَيُبَاشِرُ وَهُوَ صَائِمٌ, وَلَكِنَّهُ أَمْلَكُكُمْ لِإِرْبِهِ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ . وَزَادَ فِي رِوَايَةٍ: { فِي رَمَضَانَ }",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم روزے کی حالت میں اپنی بیوی کا بوسہ لے لیتے تھے اور معانقہ بھی فرما لیتے تھے لیکن آپ صلی اللہ علیہ وسلم تمہاری نسبت اپنی طبیعت پر زیادہ کنٹرول اور ضبط کرنے والے تھے۔ (بخاری و مسلم) یہ الفاظ مسلم کے ہیں اور ایک روایت میں اتنا اضافہ ہے کہ آپ صلی اللہ علیہ وسلم یہ دونوں فعل رمضان میں کرتے تھے۔",
        "english": "Narrated 'Aishah (RA): The Messenger of Allah (ﷺ) used to kiss and embrace (his wives) while fasting, but he had more control over his desires than any of you. [Agreed upon; the wording is Muslim's]. In another narration (of Muslim), it adds: \"In Ramadan.\""
      }
    },

    {
      "id": 541,
      "name": {
        "arabic": " وَعَنْ شَدَّادِ بْنِ أَوْسٍ - رضى الله عنه - { أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم - أَتَى عَلَى رَجُلٍ بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ فِي رَمَضَانَ. فَقَالَ: \" أَفْطَرَ اَلْحَاجِمُ وَالْمَحْجُومُ \" } رَوَاهُ اَلْخَمْسَةُ إِلَّا اَلتِّرْمِذِيَّ، وَصَحَّحَهُ أَحْمَدُ، وَابْنُ خُزَيْمَةَ، وَابْنُ حِبَّانَ ",
        "urdu": "سیدنا شداد بن اوس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم بقیع میں ایک ایسے شخص کے پاس تشریف لائے جو رمضان میں پچھنے (حجامہ) لگوا رہا تھا۔ اس کو دیکھ کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ”سینگی لگانے اور لگوانے والے دونوں کا روزہ ٹوٹ گیا۔“ (بجز ترمذی اسے پانچوں نے روایت کیا ہے۔ احمد، ابن خزیمہ اور ابن حبان نے اسے صحیح قرار دیا ہے)۔",
        "english": "Narrated Shaddad bin Aus (RA): Allah's Messenger (ﷺ) came across a man at Al-Baqi' who was having cupping (Hijama) done in Ramadan. He (ﷺ) said: 'The cupper and the one for whom cupping is being done both break their fast.' [Reported by the five except At-Tirmidhi. Ahmad, Ibn Khuzaimah and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 542,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ - رضى الله عنه - قَالَ: { أَوَّلُ مَا كُرِهَتِ اَلْحِجَامَةُ لِلصَّائِمِ; أَنَّ جَعْفَرَ بْنَ أَبِي طَالِبٍ اِحْتَجَمَ وَهُوَ صَائِمٌ, فَمَرَّ بِهِ اَلنَّبِيُّ - صلى الله عليه وسلم - فَقَالَ: \" أَفْطَرَ هَذَانِ \", ثُمَّ رَخَّصَ اَلنَّبِيُّ - صلى الله عليه وسلم - بَعْدُ فِي اَلْحِجَامَةِ لِلصَّائِمِ, وَكَانَ أَنَسٌ يَحْتَجِمُ وَهُوَ صَائِمٌ } رَوَاهُ اَلدَّارَقُطْنِيُّ وَقَوَّاهُ",
        "urdu": "سیدنا انس رضی اللہ عنہ فرماتے ہیں کہ سب سے پہلے روزہ دار کے لئے سینگی لگوانا اس لئے مکروہ ہوئی کہ جعفر بن ابی طالب رضی اللہ عنہ نے روزہ کی حاجت میں سینگی لگوائی، نبی کریم صلی اللہ علیہ وسلم ان کے پاس سے گزرے تو آپ صلی اللہ علیہ وسلم نے فرمایا ”ان دونوں کا روزہ ٹوٹ گیا۔“ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے روزہ دار کے لئے سینگی لگوانے کی رخصت دے دی اور انس رضی اللہ عنہ روزہ کی حالت میں سینگی لگواتے تھے۔ اسے دارقطنی نے روایت کیا ہے اور اس کو قوی کہا ہے۔",
        "english": "Narrated Anas bin Malik (RA): The first time cupping was disapproved for a fasting person was when Ja'far bin Abi Talib had himself cupped while he was fasting. The Prophet (ﷺ) passed by him and said: 'These two have broken their fast.' Afterwards, the Prophet (ﷺ) granted a concession for a fasting person to be cupped. Anas used to have himself cupped while he was fasting."
      }
    },

    {
      "id": 543,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا, { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم - اِكْتَحَلَ فِي رَمَضَانَ, وَهُوَ صَائِمٌ } رَوَاهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ ضَعِيفٍ . قَالَ اَلتِّرْمِذِيُّ: لَا يَصِحُّ فِيهِ شَيْءٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے رمضان میں روزہ کی حالت میں سرمہ لگایا۔ اسے ابن ماجہ نے بیان کیا ہے اور امام ترمذی رحمہ اللہ نے فرمایا ہے کہ اس بارے میں کوئی حدیث بھی صحیح نہیں۔",
        "english": "Narrated 'Aisha (RA): The Prophet (ﷺ) applied kohl (to his eyes) in Ramadan while he was fasting. [Reported by Ibn Majah with a weak chain of narrators]. At-Tirmidhi said: 'Nothing (authentic) has been reported on this topic.'"
      }
    },

    {
      "id": 544,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - { مَنْ نَسِيَ وَهُوَ صَائِمٌ, فَأَكَلَ أَوْ شَرِبَ, فَلْيُتِمَّ صَوْمَهُ, فَإِنَّمَا أَطْعَمَهُ اَللَّهُ وَسَقَاهُ } مُتَّفَقٌ عَلَيْهِ وَلِلْحَاكِمِ: { مَنْ أَفْطَرَ فِي رَمَضَانَ نَاسِيًا فَلَا قَضَاءَ عَلَيْهِ وَلَا كَفَّارَةَ } وَهُوَ صَحِيحٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو روزہ دار بھول کر کچھ کھایا پی لے تو اسے چاہیئے کہ اپنا روزہ پورا کر لے کیونکہ اسے اللہ تعالیٰ نے کھلایا پلایا ہے“ (بخاری و مسلم) اور امام حاکم سے یوں روایت ہے کہ ”اگر کوئی بھول کر رمضان میں روزہ کھول لے تو اس پر قضاء اور کفارہ نہیں۔“ اور یہ حدیث صحیح ہے۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Whoever forgets he is fasting and eats or drinks, let him complete his fast, for it was Allah Who fed him and gave him drink.' [Agreed upon]. Al-Hakim reported: 'Whoever breaks his fast in Ramadan out of forgetfulness, there is no Qada (making up) or Kaffarah (expiation) required of him.' [This is Sahih]."
      }
    },

    {
      "id": 545,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - { مَنْ ذَرَعَهُ اَلْقَيْءُ فَلَا قَضَاءَ عَلَيْهِ، وَمَنْ اسْتَقَاءَ فَعَلَيْهِ اَلْقَضَاءُ } رَوَاهُ اَلْخَمْسَةُ. وَأَعَلَّهُ أَحْمَدُ. وَقَوَّاهُ اَلدَّارَقُطْنِيُّ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جسے خود بخود قے آ جائے تو اس پر (روزہ کی) قضاء نہیں اور جو جان بوجھ کر قے کرے اس پر قضاء ہے۔“ اسے پانچوں نے روایت کیا ہے، امام احمد نے اس کو معلول (سند میں نقص) کہا ہے جبکہ امام دارقطنی نے اسے قوی قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'If anyone is overcome by vomiting, he does not have to make up for the fast (Qada), but whoever vomits intentionally must make up for it.' [Reported by the five. Ahmad graded it Ma'lul (defective), while Ad-Daraqutni graded it strong]."
      }
    },

    {
      "id": 546,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -خَرَجَ عَامَ اَلْفَتْحِ إِلَى مَكَّةَ فِي رَمَضَانَ, فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ, فَصَامَ اَلنَّاسُ, ثُمَّ دَعَا بِقَدَحٍ مِنْ مَاءٍ فَرَفَعَهُ, حَتَّى نَظَرَ اَلنَّاسُ إِلَيْهِ, ثُمَّ شَرِبَ, فَقِيلَ لَهُ بَعْدَ ذَلِكَ: إِنَّ بَعْضَ اَلنَّاسِ قَدْ صَامَ. قَالَ: \"أُولَئِكَ اَلْعُصَاةُ, أُولَئِكَ اَلْعُصَاةُ\" } وَفِي لَفْظٍ: { فَقِيلَ لَهُ: إِنَّ اَلنَّاسَ قَدْ شَقَّ عَلَيْهِمُ اَلصِّيَامُ, وَإِنَّمَا يَنْظُرُونَ فِيمَا فَعَلْتَ، فَدَعَا بِقَدَحٍ مِنْ مَاءٍ بَعْدَ اَلْعَصْرِ، فَشَرِبَ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے سال مکہ مکرمہ کی طرف رمضان میں نکلے تو آپ صلی اللہ علیہ وسلم نے روزہ رکھا یہاں تک کہ آپ صلی اللہ علیہ وسلم کراع الغمیم پہنچے۔ اس دن لوگوں نے بھی روزہ رکھا۔ آپ صلی اللہ علیہ وسلم نے پانی کا پیالہ منگوایا اور اس کو اتنا اونچا کیا کہ لوگوں نے دیکھ لیا۔ پھر آپ صلی اللہ علیہ وسلم نے اسے پی لیا۔ پھر اس کے بعد آپ صلی اللہ علیہ وسلم سے کہا گیا کہ بعض لوگوں نے روزہ رکھا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” یہی لوگ نافرمان ہیں، یہی لوگ نافرمان ہیں۔ “ اور ایک حدیث کے الفاظ یوں ہیں کہ آپ صلی اللہ علیہ وسلم سے کہا گیا کہ بیشک لوگوں کو روزہ نے مشقت میں ڈال دیا ہے اور وہ آپ کے عمل کا انتظار کر رہے ہیں تو آپ صلی اللہ علیہ وسلم نے عصر کے بعد پانی کا پیالہ منگوایا اور پی لیا۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): In the year of the Conquest (of Makkah), Allah's Messenger (ﷺ) left for Makkah in Ramadan. He fasted until he reached Kura' al-Ghamim, and the people also fasted. He then called for a cup of water and raised it so that the people could see it, and then he drank it. Afterwards, he was told that some people had continued to fast, and he said, 'Those are the disobedient ones; those are the disobedient ones.' In another version: 'It was said to him: The people are finding the fast difficult, and they are waiting to see what you do. So he called for a cup of water after 'Asr and drank it.' [Reported by Muslim]."
      }
    },

    {
      "id": 547,
      "name": {
        "arabic": " وَعَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ رِضَى اَللَّهُ عَنْهُ; أَنَّهُ قَالَ: { يَا رَسُولَ اَللَّهِ! أَجِدُ بِي قُوَّةً عَلَى اَلصِّيَامِ فِي اَلسَّفَرِ, فَهَلْ عَلَيَّ جُنَاحٌ? فَقَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - \" هِيَ رُخْصَةٌ مِنَ اَللَّهِ, فَمَنْ أَخَذَ بِهَا فَحَسَنٌ, وَمَنْ أَخَذَ بِهَا فَحَسَنٌ, وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلَا جُنَاحَ عَلَيْهِ \" } رَوَاهُ مُسْلِمٌ وَأَصْلُهُ فِي \" اَلْمُتَّفَقِِ \" مِنْ حَدِيثِ عَائِشَةَ",
        "urdu": "سیدنا حمزہ بن عمرو اسلمی رضی اللہ عنہ سے مروی ہے کہ انہوں نے اللہ کے رسول صلی اللہ علیہ وسلم سے کہا میں سفر میں روزہ رکھنے کی طاقت رکھتا ہوں (اگر میں روزہ رکھ لوں) تو کیا مجھ پر کوئی حرج ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”یہ اللہ تعالیٰ کی طرف سے رخصت ہے جو اس کو لے لے تو بہتر ہے اور جو کوئی روزہ رکھنا پسند کرے تو اس پر کوئی حرج نہیں۔“ (مسلم) اور اس حدیث کا اصل سیدہ عائشہ رضی اللہ عنہا کی متفق علیہ حدیث میں بھی موجود ہے۔",
        "english": "Narrated Hamzah bin 'Amr al-Aslami (RA): He said, 'O Messenger of Allah! I find within myself the strength to fast while traveling. Is there any sin upon me (if I do so)?' The Messenger of Allah (ﷺ) replied, 'It is a concession (Rukhsah) from Allah. Whoever takes it, it is good; and whoever likes to fast, there is no sin upon him.' [Reported by Muslim. Its origin is in Sahih Bukhari and Muslim from a Hadith of 'Aisha (RA)]."
      }
    },

    {
      "id": 548,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ -رَضِيَ اَللَّهُ عَنْهُمَا - قَالَ: { رُخِّصَ لِلشَّيْخِ اَلْكَبِيرِ أَنْ يُفْطِرَ, وَيُطْعِمَ عَنْ كُلِّ يَوْمٍ مِسْكِينًا, وَلَا قَضَاءَ عَلَيْهِ } رَوَاهُ اَلدَّارَقُطْنِيُّ, وَالْحَاكِمُ, وَصَحَّحَاهُ",
        "urdu": "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ بڑی عمر والے بوڑھے کو رخصت دی گئی ہے کہ وہ افطار کرے اور ہر دن کے بدلے ایک مسکین کو کھانا کھلائے اور اس پر قضاء نہیں ہے۔ اسے دارقطنی اور حاکم نے روایت کیا ہے اور دونوں نے اسے صحیح کہا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): A concession was granted to the aged man to break his fast, provided he feeds a needy person for every day, and he is not required to make up for it (Qada)."
      }
    },

    {
      "id": 549,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ - صلى الله عليه وسلم - فَقَالَ: هَلَكْتُ يَا رَسُولَ اَللَّهِ. قَالَ: \" وَمَا أَهْلَكَكَ ? \" قَالَ: وَقَعْتُ عَلَى اِمْرَأَتِي فِي رَمَضَانَ، فَقَالَ: \" هَلْ تَجِدُ مَا تَعْتِقُ رَقَبَةً? \" قَالَ: لَا. قَالَ: \" فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ? \" قَالَ: لَا. قَالَ: \" فَهَلْ تَجِدُ مَا تُطْعِمُ سِتِّينَ مِسْكِينًا? \" قَالَ: لَا, ثُمَّ جَلَسَ, فَأُتِي اَلنَّبِيُّ - صلى الله عليه وسلم - بِعَرَقٍ فِيهِ تَمْرٌ. فَقَالَ: \" تَصَدَّقْ بِهَذَا \", فَقَالَ: أَعَلَى أَفْقَرَ مِنَّا? فَمَا بَيْنَ لَابَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ إِلَيْهِ مِنَّا, فَضَحِكَ اَلنَّبِيُّ - صلى الله عليه وسلم - حَتَّى بَدَتْ أَنْيَابُهُ، ثُمَّ قَالَ: \"اذْهَبْ فَأَطْعِمْهُ أَهْلَكَ \" } رَوَاهُ اَلسَّبْعَةُ, وَاللَّفْظُ لِمُسْلِمٍ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ایک آدمی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہنے لگا کہ اے اللہ کے رسول! میں ہلاک ہو گیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”کس چیز نے تجھے ہلاک کیا؟“ اس نے کہا میں رمضان میں اپنی عورت سے مباشرت کر بیٹھا۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا ”کیا تجھ میں اتنی طاقت ہے کہ ایک گردن کو آزاد کر دے؟“ اس نے کہا نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”کیا تو طاقت رکھتا ہے کہ دو ماہ کے متواتر روزے رکھے؟“ اس نے کہا، نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”کیا تیرے پاس اتنا مال ہے کہ ساٹھ مسکینوں کو کھانا کھلا سکے؟“ اس نے کہا نہیں۔ پھر وہ بیٹھ گیا۔ تو نبی کریم صلی اللہ علیہ وسلم کے پاس ایک ٹوکرا لایا گیا جس میں کھجوریں تھیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”ان کو خیرات کر دو۔“ اس نے کہا کیا اپنے سے زیادہ محتاج پر (خیرات کروں)؟ کیونکہ دو سنگلاخ پہاڑوں (مدینہ) کے مابین کوئی گھر والا ہم سے زیادہ محتاج نہیں۔ تو نبی کریم صلی اللہ علیہ وسلم مسکرائے یہاں تک کہ آپ صلی اللہ علیہ وسلم کی داڑھیں ظاہر ہو گئیں۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ”جاؤ اسے اپنے گھر والوں کو کھلا دو۔“ اسے ساتوں نے روایت کیا ہے اور الفاظ مسلم کے ہیں۔",
        "english": "Narrated Abu Hurairah (RA): A man came to the Prophet (ﷺ) and said, 'O Messenger of Allah! I am ruined.' He (ﷺ) asked, 'What has ruined you?' He replied, 'I had sexual intercourse with my wife in Ramadan.' He (ﷺ) asked, 'Can you afford to free a slave?' He said, 'No.' He asked, 'Can you fast for two successive months?' He said, 'No.' He asked, 'Can you afford to feed sixty poor persons?' He said, 'No.' Then the man sat down. A basket of dates was brought to the Prophet (ﷺ), and he said, 'Give this in charity.' The man said, 'To someone poorer than us? Between the two lava plains of Medina, there is no family poorer than mine.' Thereupon the Prophet (ﷺ) laughed until his molars were visible, and said, 'Go and feed it to your family.' [Reported by the Seven, and the wording is Muslim's]."
      }
    },

    {
      "id": 550,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ وَأُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -كَانَ يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ, ثُمَّ يَغْتَسِلُ وَيَصُومُ } مُتَّفَقٌ عَلَيْهِ. زَادَ مُسْلِمٌ فِي حَدِيثِ أُمِّ سَلَمَةَ: [ وَ ] لَا يَقْضِي",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا اور سیدہ ام سلمہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم جماع سے جنبی ہوتے تو صبح ہونے پر آپ صلی اللہ علیہ وسلم غسل کرتے اور روزہ رکھتے۔ (بخاری و مسلم) اور مسلم نے ام سلمہ رضی اللہ عنہا کی حدیث میں یہ زائد کیا کہ قضاء نہیں دیتے تھے۔",
        "english": "Narrated 'Aishah and Umm Salamah (RA): The Prophet (ﷺ) used to wake up in the morning in a state of Janaba (ritual impurity) from sexual intercourse, then he would perform Ghusl (ritual bath) and fast. [Agreed upon]. Muslim added in the Hadith of Umm Salamah: 'And he would not make up for that day (perform Qada).'"
      }
    },

    {
      "id": 551,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم - قَالَ: { مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو شخص فوت ہو جائے اور اس پر روزہ لازم ہو تو اس کی طرف سے اس کا ولی روزہ رکھے۔“ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): Allah's Messenger (ﷺ) said: 'Whoever dies while he still has some fasts to be fulfilled (as a debt), his heir (Wali) should fast on his behalf.'"
      }
    }
  ]
}
