{
  "chapId": 77,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 975,
    "to": 986
  },
  "hadiths": [
    {
      "id": 975,
      "name": {
        "arabic": " عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَتْ هِنْدُ بِنْتُ عُتْبَةَ ‏-اِمْرَأَةُ أَبِي سُفْيَانَ‏- عَلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَتْ: يَا رَسُولَ اَللَّهِ! إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ لَا يُعْطِينِي مِنْ اَلنَّفَقَةِ مَا يَكْفِينِي وَيَكْفِي بَنِيَّ, إِلَّا مَا أَخَذْتُ مِنْ مَالِهِ بِغَيْرِ عِلْمِهِ, فَهَلْ عَلَِيَّ فِي ذَلِكَ مِنْ جُنَاحٍ? فَقَالَ: \"خُذِي مِنْ مَالِهِ بِالْمَعْرُوفِ مَا يَكْفِيكِ, وَيَكْفِي بَنِيكِ\".‏ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا نے فرمایا کہ ہند بنت عتبہ، ابوسفیان کی بیوی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کیا، اے اللہ کے رسول! ابوسفیان ایک کنجوس آدمی ہے۔ مجھے وہ اتنا خرچ نہیں دیتا جو میرے اور میرے بچوں کیلئے کافی ہو مگر یہ کہ میں پوشیدہ طور پر کچھ لے لوں تو ایسا کرنے میں مجھ پر کوئی گناہ ہو گا؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ”بھلے طریقے سے تم اتنا مال لے سکتی ہو جو تمہارے اور تمہارے بچوں کیلئے کافی ہو۔“ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (R.A): Hind bint 'Utbah, the wife of Abu Sufyan, came to the Messenger of Allah (ﷺ) and said, \"O Messenger of Allah! Abu Sufyan is a stingy man. He does not give me enough maintenance for me and my children, except what I take from his wealth without his knowledge. Is there any sin upon me for doing that?\" He (ﷺ) said, \"Take from his wealth what is reasonably sufficient for you and your children.\""
      }
    },

    {
      "id": 976,
      "name": {
        "arabic": " وَعَنْ طَارِقِ الْمُحَارِبِيِّ قَالَ: { قَدِمْنَا اَلْمَدِينَةَ, فَإِذَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَائِمٌ يَخْطُبُ وَيَقُولُ: \"يَدُ اَلْمُعْطِي اَلْعُلْيَا, وَابْدَأْ بِمَنْ تَعُولُ: أُمَّكَ وَأَبَاكَ, وَأُخْتَكَ وَأَخَاكَ, ثُمَّ أَدْنَاكَ أَدْنَاكَ\".‏ } رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَاَلدَّارَقُطْنِيُّ",
        "urdu": "سیدنا طارق محاربی رضی اللہ عنہ کا بیان ہے کہ ہم مدینہ میں آئے تو رسول اللہ صلی اللہ علیہ وسلم منبر پر کھڑے لوگوں سے خطاب فرما رہے تھے۔ فرماتے تھے ”دینے والا ہاتھ بالا و بلند ہوتا ہے۔ اور ان سے شروع کر جو تمہاری کفالت میں ہیں۔ ان میں تیری ماں، تیرا باپ، تیری بہن اور تیرا بھائی شامل ہیں پھر درجہ بدرجہ اپنے سب سے زیادہ قریبی کو دے۔“ اسے نسائی نے روایت کیا ہے اور ابن حبان اور دارقطنی نے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Tariq al-Muharibi: We came to Madinah and found the Messenger of Allah (ﷺ) standing on the pulpit addressing the people, saying, 'The hand of the giver is the upper hand. Start with those for whom you are responsible: your mother and father, your sister and brother, and then those who are closer and closer to you.'"
      }
    },

    {
      "id": 977,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ, وَلَا يُكَلَّفُ مِنْ اَلْعَمَلِ إِلَّا مَا يُطِيقُ.‏ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”غلام کا کھانا پینا اور لباس مہیا کرنا مالک پر واجب ہے اور طاقت سے بڑھ کر کام کی تکلیف نہ دی جائے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (R.A): The Messenger of Allah (ﷺ) said: 'The slave is entitled to his food and clothing, and he should not be burdened with more work than he can bear.'"
      }
    },

    {
      "id": 978,
      "name": {
        "arabic": " وَعَنْ حَكِيمِ بْنِ مُعَاوِيَةَ اَلْقُشَيْرِيِّ, عَنْ أَبِيهِ قَالَ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! مَا حَقُّ زَوْجَةِ أَحَدِنَا عَلَيْهِ? قَالَ: \"أَنْ تُطْعِمَهَا إِذَا طَعِمْتَ, وَتَكْسُوَهَا إِذَا اِكْتَسَيْتَ, وَلَا تَضْرِبِ اَلْوَجْهَ, وَلَا تُقَبِّحْ…]\".‏ } اَلْحَدِيثُ.‏ وتَقَدَّمَ فِي عِشْرَةِ اَلنِّسَاءِ",
        "urdu": "سیدنا حکیم بن معاویہ قشیری رحمہ اللہ کی اپنے باپ سے روایت ہے کہ میں نے عرض کیا اے اللہ کے رسول! ہم میں سے ہر ایک پر اس کی اہلیہ کا کیا حق ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”جب خود کھاؤ تو اس کو بھی کھلاؤ۔ جب خود پہنو تو اس کو بھی پہناؤ اور اس کے منہ پر نہ مارو اور اسے قبیح نہ کہو۔“ لمبی حدیث ہے جو «عشرة النساء» کے باب میں پہلے گزر چکی ہے۔",
        "english": "Narrated Hakim bin Mu'awiya al-Qushairi on the authority of his father (Mu'awiya bin Haidah): I asked, 'O Messenger of Allah! What is the right of the wife of one of us upon him?' He (ﷺ) replied, 'That you should feed her when you eat, clothe her when you clothe yourself, do not strike her on the face, and do not revile her...'"
      }
    },

    {
      "id": 979,
      "name": {
        "arabic": "وَعَنْ جَابِر بْنِ عَبْدِ اَللَّهِ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-‏-فِي حَدِيثِ اَلْحَجِّ بِطُولِهِ‏- قَالَ فِي ذِكْرِ اَلنِّسَاءِ: { وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ.‏ } أَخْرَجَهُ مُسْلِمٌ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے حج کے بارے میں لمبی حدیث میں بیان کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے عورتوں کے بارے میں فرمایا ”تم پر تمہاری بیویوں کا یہ حق ہے کہ ان کو کھانا پینا اور لباس بھلے طریقہ سے دیا کرو۔“ (مسلم)",
        "english": "Narrated Jabir bin 'Abdullah (R.A): In the long Hadith about the Hajj, the Prophet (ﷺ) mentioned concerning women: 'And their right upon you is that you provide them with food and clothing in a reasonable manner.'"
      }
    },

    {
      "id": 980,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كَفَى بِالْمَرْءِ إِثْمًا أَنْ يُضَيِّعَ مَنْ يَقُوتُ.‏ } رَوَاهُ النَّسَائِيُّ.‏ وَهُوَ عِنْدَ مُسْلِمٍ بِلَفْظِ: \"أَنْ يَحْبِسَ عَمَّنْ يَمْلِكُ قُوتَهُ\"",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک انسان کے لیے یہی گناہ کافی ہے کہ وہ ان لوگوں کو ضائع (بے سہارا) کر دے جن کی روزی کا وہ ذمہ دار ہے۔“ (نسائی) اور مسلم میں یہ الفاظ ہیں: ”کہ وہ اس شخص کی خوراک روک لے جس کا وہ مالک (کفیل) ہے۔“",
        "english": "Narrated ‘Abdullah bin ‘Amr (R.A): The Messenger of Allah (ﷺ) said: \"It is sufficient sin for a man that he neglects those whom he is responsible to feed.\" (Reported by An-Nasa'i). In the version of Sahih Muslim, the wording is: \"It is enough sin for a person to withhold the food from one whose sustenance he possesses.\""
      }
    },

    {
      "id": 981,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏-يَرْفَعُهُ, فِي اَلْحَامِلِ اَلْمُتَوَفَّى عَنْهَا‏- قَالَ: { لَا نَفَقَةَ لَهَا } أَخْرَجَهُ اَلْبَيْهَقِيُّ, وَرِجَالُهُ ثِقَاتٌ, لَكِنْ قَالَ: اَلْمَحْفُوظُ وَقْفُهُ وَثَبَتَ نَفْيُ اَلنَّفَقَةِ فِي حَدِيثِ فَاطِمَةَ بِنْتِ قَيْسٍ كَمَا تَقَدَّمَ.‏ رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ نے اس حاملہ کے بارے میں جس کا شوہر فوت ہو گیا ہو مرفوعاً روایت کیا ہے کہ اس کے لئے نفقہ نہیں ہے۔ اس کو بیہقی نے نکالا۔ اس کے راوی ثقہ ہیں لیکن امام بیہقی نے کہا ہے کہ اس کا موقوف ہونا ہی محفوظ ہے۔ نفقہ کی نفی فاطمہ بنت قیس رضی اللہ عنہا کی حدیث سے ثابت ہے جو پہلے گزر چکی ہے۔ اسے مسلم نے روایت کیا ہے۔",
        "english": "Narrated Jabir (RA) that the Prophet (ﷺ) said regarding a pregnant woman whose husband has died: 'There is no maintenance (nafaqah) for her.' Reported by Al-Bayhaqi, and its narrators are reliable, but he said: 'What is preserved is that it is Mauquf (stopped at the companion).' The negation of maintenance is established in the Hadith of Fatima bint Qais as mentioned previously. Narrated by Muslim."
      }
    },

    {
      "id": 982,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْيَدِ اَلْعُلْيَا خَيْرٌ مِنْ اَلْيَدِ اَلسُّفْلَى, وَيَبْدَأُ أَحَدُكُمْ بِمَنْ يَعُولُ.‏ تَقُولُ اَلْمَرْأَةُ: أَطْعِمْنِي, أَوْ طَلِّقْنِي.‏ } رَوَاهُ اَلدَّارَقُطْنِيُّ, وَإِسْنَادُهُ حَسَنٌ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اوپر والا ہاتھ (دینے والا) نیچے والے ہاتھ (لینے والے) سے بہتر ہے۔ اور تم میں سے ہر ایک اسے پہلے دے جس کی وہ کفالت کرتا ہے۔ بیوی کہتی ہے: مجھے کھانا کھلاؤ ورنہ مجھے طلاق دے دو۔“ اسے دارقطنی نے روایت کیا ہے اور اس کی سند حسن ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'The upper hand (that gives) is better than the lower hand (that takes). One should start giving to those who are under his care. A woman says: Feed me or divorce me.'"
      }
    },

    {
      "id": 983,
      "name": {
        "arabic": "وَعَنْ سَعِيدِ بْنِ اَلْمُسَيَّبِ ‏-فِي اَلرَّجُلِ لَا يَجِدُ مَا يُنْفِقُ عَلَى أَهْلِهِ‏- قَالَ: { يُفَرَّقُ بَيْنَهُمَا } .‏ أَخْرَجَهُ سَعِيدُ بْنُ مَنْصُورٍ: عَنْ سُفْيَانَ, عَنْ أَبِي اَلزِّنَادِ, عَنْهُ.‏ قَالَ: { فَقُلْتُ لِسَعِيدِ بْنِ اَلْمُسَيَّبِ: سُنَّةٌ? فَقَالَ: سُنَّةٌ } .‏ وَهَذَا مُرْسَلٌ قَوِيَ",
        "urdu": "سیدنا سعید بن مسیب رحمہ اللہ سے ایسے آدمی کے متعلق مروی ہے جو اپنی بیوی کو نان و نفقہ نہ دے سکے کہ ان کے درمیان علیحدگی کر دی جائے گی۔ اس روایت کو سعید بن منصور نے سفیان سے اور انہوں نے ابوالزناد سے روایت کیا ہے کہ میں نے سعید بن مسیب سے پوچھا کیا یہ سنت ہے؟ تو انہوں نے جواب دیا کہ ہاں سنت ہے۔ یہ روایت مرسل قوی ہے۔",
        "english": "Narrated Sa'id bin al-Musayyab (RA) regarding a man who cannot find enough to spend on his wife: 'They are to be separated (by divorce).' Reported by Sa'id bin Mansur from Sufyan, from Abu az-Zinad, from him. He (Abu az-Zinad) said: 'I asked Sa'id bin al-Musayyab: Is it a Sunnah?' He replied: 'It is a Sunnah.' This is a strong Mursal (chain)."
      }
    },

    {
      "id": 984,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- { أَنَّهُ كَتَبَ إِلَى أُمَرَاءِ اَلْأَجْنَادِ فِي رِجَالٍ غَابُوا عَنْ نِسَائِهِمْ: أَنْ يَأْخُذُوهُمْ بِأَنَّ يُنْفِقُوا أَوْ يُطَلِّقُوا, فَإِنْ طَلَّقُوا بَعَثُوا بِنَفَقَةِ مَا حَبَسُوا } .‏ أَخْرَجَهُ اَلشَّافِعِيُّ.‏ ثُمَّ اَلْبَيْهَقِيّ بِإِسْنَادِ حَسَنٌ",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے مروی ہے کہ انہوں نے امراء لشکر کو ایسے مردوں کے بارے میں تحریر فرمایا جو فوج میں شریک رہنے کی وجہ سے اپنی بیویوں سے غائب تھے کہ وہ اپنی بیویوں کو نفقہ روانہ کریں ورنہ طلاق دے دیں۔ اگر طلاق دیں تو جتنی مدت انہوں نے روکے رکھا ہے اس کا نفقہ روانہ کریں۔ اسے امام شافعی رحمہ اللہ اور بیہقی نے عمدہ سند سے روایت کیا ہے۔",
        "english": "Narrated ‘Umar (RA): He wrote to the commanders of the army concerning men who stayed away from their wives (for a long time), that they should be ordered to either provide maintenance for them or divorce them. If they divorced them, they must also send maintenance for the period during which they had kept them in suspense. [Reported by ash-Shafi'i and then al-Baihaqi with a Hasan chain of narrators]."
      }
    },

    {
      "id": 985,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: يَا رَسُولَ اَللَّهِ! عِنْدِي دِينَارٌ? قَالَ: \"أَنْفِقْهُ عَلَى نَفْسِكَ\".‏ قَالَ: عِنْدِي آخَرُ? قَالَ: \"أَنْفِقْهُ عَلَى وَلَدِكَ\".‏ قَالَ: عِنْدِي آخَرُ? قَالَ: \"أَنْفِقْهُ عَلَى أَهْلِكَ\".‏ قَالَ: عِنْدِي آخَرُ, قَالَ: \"أَنْفِقُهُ عَلَى خَادِمِكَ\".‏ قَالَ عِنْدِي آخَرُ, قَالَ: \"أَنْتَ أَعْلَمَ\".‏ } أَخْرَجَهُ اَلشَّافِعِيُّ وَاللَّفْظُ لَهُ, وَأَبُو دَاوُدَ, وَأَخْرَجَهُ النَّسَائِيُّ وَالْحَاكِمُ بِتَقْدِيمِ اَلزَّوْجَةِ عَلَى اَلْوَلَدِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کیا، اے اللہ کے رسول! میرے پاس ایک دینار ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اپنے آپ پر خرچ کرو۔“ اس نے عرض کیا میرے پاس ایک اور ہے؟ فرمایا ”اپنی اولاد پر خرچ کرو۔“ وہ پھر بولا میرے پاس ایک اور ہے۔ فرمایا ”اپنی بیوی پر خرچ کرو۔“ اس نے عرض کیا میرے پاس اور ہے فرمایا ”اپنے خادم پر خرچ کرو۔“ وہ بولا میرے پاس اور ہے۔ فرمایا ”تجھے خوب علم ہے کہ تو اسے کہاں خرچ کرے۔“ اس کی شافعی اور ابوداؤد نے تخریج کی ہے اور یہ الفاظ ابوداؤد کے ہیں اور نسائی اور حاکم نے بھی اس کی تخریج کی ہے۔ اس میں ولد سے پہلے زوجہ کا ذکر ہے۔",
        "english": "Narrated Abu Hurairah (RA): A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah, I have a Dinar.' He (ﷺ) said: 'Spend it on yourself.' He said: 'I have another.' He (ﷺ) said: 'Spend it on your children.' He said: 'I have another.' He (ﷺ) said: 'Spend it on your wife.' He said: 'I have another.' He (ﷺ) said: 'Spend it on your servant.' He said: 'I have another.' He (ﷺ) said: 'You know best (to whom to give it).'"
      }
    },

    {
      "id": 986,
      "name": {
        "arabic": "وَعَنْ بَهْزِ بْنِ حَكِيمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! مَنْ أَبَرُّ? قَالَ: \"أُمَّكَ\".‏ قُلْتُ: ثُمَّ مِنْ? قَالَ: \"أُمَّكَ\".‏ قُلْتُ: ثُمَّ مِنْ \"? قَالَ: \"أُمَّكَ\".‏ قُلْتُ: ثُمَّ مِنْ? قَالَ: \"أَبَاكَ, ثُمَّ اَلْأَقْرَبَ فَالْأَقْرَبَ\".‏ } أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَحُسَّنَهُ",
        "urdu": "سیدنا بھز بن حکیم رحمہ اللہ نے اپنے باپ کے واسطہ سے اپنے دادا سے روایت کیا ہے کہ میں نے عرض کیا، اے اللہ کے رسول! میں حسن سلوک اور بھلائی کس کے ساتھ کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”اپنی والدہ کے ساتھ۔“ میں نے پھر عرض کیا۔ پھر کس سے؟ آپ صلی اللہ علیہ وسلم نے پھر فرمایا ”اپنی والدہ سے۔“ میں نے پھر عرض کیا پھر کس سے؟ فرمایا ”اپنی والدہ سے۔“ میں نے پھر عرض کیا۔ پھر کس سے؟ فرمایا ”اپنے والد سے۔“ اس کے بعد پھر درجہ بدرجہ زیادہ قریبی رشتہ دار سے۔ اسے ابوداؤد اور ترمذی نے تخریج کیا اور ترمذی نے اسے حسن قرار دیا ہے۔",
        "english": "Narrated Bahz bin Hakim, on his father's authority from his grandfather (Mu'awiyah bin Haidah) who said: I asked, \"O Messenger of Allah! To whom should I show goodness?\" He replied, \"Your mother.\" I asked, \"Then who?\" He replied, \"Your mother.\" I asked, \"Then who?\" He replied, \"Your mother.\" I asked, \"Then who?\" He replied, \"Your father, then your next closest relative and then the next.\""
      }
    }
  ]
}
