{
  "chapId": 53,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 755,
    "to": 759
  },
  "hadiths": [
    {
      "id": 755,
      "name": {
        "arabic": " عَنْ سَعِيدِ بْنِ زَيْدٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ اِقْتَطَعَ شِبْرًا مِنْ اَلْأَرْضِ ظُلْماً طَوَّقَهُ اَللَّهُ إِيَّاهُ يَوْمَ اَلْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": " سیدنا سعید بن زید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس شخص نے ایک بالشت بھر زمین کسی سے چھین لی، اللہ تعالیٰ قیامت کے روز اتنا حصہ زمیں، ساتوں زمینوں سے اس کے گلے میں طوق بنا کر ڈال دے گا۔“ (بخاری و مسلم)",
        "english": "Narrated Sa'id bin Zaid (RA): Allah's Messenger (ﷺ) said: 'If anyone unjustly takes even a hand-span of land, Allah will make him wear it as a collar around his neck from seven earths on the Day of Resurrection.' [Agreed upon]."
      }
    },

    {
      "id": 756,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ عِنْدَ بَعْضِ نِسَائِهِ، فَأَرْسَلَتْ إِحْدَى أُمَّهَاتِ اَلْمُؤْمِنِينَ مَعَ خَادِمٍ لَهَا بِقَصْعَةٍ فِيهَا طَعَامٌ، فَكَسَرَتِ اَلْقَصْعَةَ، فَضَمَّهَا, وَجَعَلَ فِيهَا اَلطَّعَامَ.‏ وَقَالَ: \" كُلُوا \" وَدَفَعَ اَلْقَصْعَةَ اَلصَّحِيحَةَ لِلرَّسُولِ, وَحَبَسَ اَلْمَكْسُورَةَ } رَوَاهُ اَلْبُخَارِيُّ وَاَلتِّرْمِذِيُّ, وَسَمَّى اَلضَّارِبَةَ عَائِشَةَ, وَزَادَ: فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ طَعَامٌ بِطَعَامٍ, وَإِنَاءٌ بِإِنَاءٍ } وَصَحَّحَهُ ",
        "urdu": " سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم اپنی ازواج مطہرات میں سے کسی کے ہاں تشریف فرما تھے۔ کسی دوسری ام المؤمنین رضی اللہ عنہا نے اپنے خادم کے ذریعہ ایک پیالہ بھیجا جس میں کچھ کھانا تھا تو اس بیوی نے اپنا ہاتھ مارا کہ وہ پیالہ ٹوٹ گیا۔ آپ صلی اللہ علیہ وسلم نے اس پیالہ کو جوڑ کر اس میں کھانا ڈال دیا اور فرمایا کہ ”کھاؤ اور لانے والے کے ہاتھ سالم پیالہ بھیج دیا اور ٹوٹا ہوا اپنے پاس رکھ لیا۔“ (بخاری و ترمذی) ہاتھ مار کر پیالہ توڑنے والی کا نام عائشہ رضی اللہ عنہا لیا گیا ہے۔ اور ترمذی نے اتنا اضافہ کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کھانے کے بدلہ میں کھانا اور برتن کے بدلہ میں برتن“ اور ترمذی نے اسے صحیح کہا ہے۔",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) was with one of his wives when another of the Mothers of the Believers sent a servant with a bowl containing food. The wife (at whose house the Prophet was) struck the bowl and it broke. The Prophet (ﷺ) gathered the broken pieces and put the food back into it, saying: 'Eat.' He then gave the sound bowl to the messenger and kept the broken one. [Reported by Al-Bukhari and At-Tirmidhi]. In At-Tirmidhi's version, the wife is named as 'Aisha (RA), and the Prophet (ﷺ) said: 'Food for food, and a bowl for a bowl.'"
      }
    },

    {
      "id": 757,
      "name": {
        "arabic": "وَعَنْ رَافِعِ بْنِ خَدِيجٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ, فَلَيْسَ لَهُ مِنْ اَلزَّرْعِ شَيْءٌ, وَلَهُ نَفَقَتُهُ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ إِلَّا النَّسَائِيَّ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ وَيُقَالُ: إِنَّ اَلْبُخَارِيَّ ضَعَّفَهُ ",
        "urdu": "سیدنا رافع بن خدیج رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے دوسرے لوگوں کی زمین میں ان کی اجازت کے بغیر زراعت کی تو اسے اس زراعت میں سے کوئی حصہ نہیں ملے گا۔ اسے صرف وہ اخراجات ملیں گے جو اس نے خرچ کئے ہیں۔“ اسے احمد اور نسائی کے علاوہ چاروں نے روایت کیا ہے اور ترمذی نے اسے حسن کہا ہے اور کہا جاتا ہے کہ بخاری نے اسے ضعیف قرار دیا ہے۔ ",
        "english": "Narrated Rafi' bin Khadij (RA): Allah's Messenger (ﷺ) said: 'If anyone sows in other people's land without their permission, he has no right to any of the crop, but he is entitled to his expenses.' [Reported by Ahmad and the four except an-Nasa'i. At-Tirmidhi graded it Hasan, and it is said that al-Bukhari graded it Da'if]."
      }
    },

    {
      "id": 758,
      "name": {
        "arabic": "وَعَنْ عُرْوَةَ بْنِ اَلزُّبَيْرِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيْسَ لِعِرْقٍ ظَالِمٍ حَقٌّ } رَوَاهُ أَبُو دَاوُدَ, وَإِسْنَادُهُ حَسَنٌ",
        "urdu": "سیدنا عروہ بن زبیر رضی اللہ عنہ سے روایت ہے کہ ایک صحابی رسول نے بتایا کہ دو آدمی نبی کریم صلی اللہ علیہ وسلم کے پاس ایک زمین کا جھگڑا لے کر آئے۔ زمین ایک کی تھی اور کھجور کے درخت دوسرے نے لگا دیئے تھے تو آپ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ ”زمین مالک کی ہے اور کھجور کے درخت لگانے والا اپنے درخت اکھاڑ لے“ اور فرمایا ”ظالم کی رگ کا کوئی حق نہیں۔“",
        "english": "Narrated 'Urwa bin az-Zubair: A companion of Allah's Messenger (ﷺ) said: Two men brought a dispute before Allah's Messenger (ﷺ) regarding land. One had planted date-palms in it, while the land belonged to the other. Allah's Messenger (ﷺ) judged that the land belonged to its owner and ordered the owner of the palms to remove his trees, saying: 'There is no right for an unjust root.'"
      }
    },

    {
      "id": 759,
      "name": {
        "arabic": " وَعَنْ أَبِي بَكْرَةَ; ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: فِي خُطْبَتِهِ يَوْمَ اَلنَّحْرِ بِمِنًى { إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ, كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے قربانی کے روز منٰی میں اپنے خطبہ کے دوران فرمایا کہ ” بیشک تمہارے خون اور اموال اور تمہاری آبروئیں تم پر اسی طرح حرام ہیں جس طرح تمہارا آج کا یہ دن حرمت والا ہے جو تمہارے اس شہر میں اور تمہارے اس مہینے میں واقع ہوا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Bakra (RA): In his sermon on the Day of Sacrifice (10th Dhul-Hijjah) at Mina, the Prophet (ﷺ) said: 'Indeed, your blood, your property, and your honor are as sacred as the sanctity of this day of yours, in this city of yours, and in this month of yours.' [Agreed upon]."
      }
    }
  ]
}