{
  "chapId": 23,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 379,
    "to": 384
  },
  "hadiths": [
    {
      "id": 379,
      "name": {
        "arabic": "عَنْ صَالِحِ بْنِ خَوَّاتٍ, { عَمَّنْ صَلَّى مَعَ رَسُولِ اَللَّهِ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ اَلرِّقَاعِ صَلَاةَ اَلْخَوْفِ: أَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةٌ وِجَاهَ اَلْعَدُوِّ, فَصَلَّى بِاَلَّذِينَ مَعَهُ رَكْعَةً, ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لِأَنْفُسِهِمْ, ثُمَّ اِنْصَرَفُوا فَصَفُّوا وِجَاهَ اَلْعَدُوِّ, وَجَاءَتِ اَلطَّائِفَةُ اَلْأُخْرَى, فَصَلَّى بِهِمْ اَلرَّكْعَةَ اَلَّتِي بَقِيَتْ, ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لِأَنْفُسِهِمْ, ثُمَّ سَلَّمَ بِهِمْ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا صالح بن خوات رحمہ اللہ نے ایسے شخص سے روایت کی ہے جس نے ذات الرقاع کے دن نبی کریم صلی اللہ علیہ وسلم کے ساتھ صلوٰۃ خوف پڑھی تھی۔ ایک گروہ نے آپ ﷺ کے ساتھ نماز پڑھی اور دوسرا گروہ دشمن کے سامنے رہا۔ آپ ﷺ نے پہلے گروہ کو ایک رکعت پڑھائی، پھر آپ ﷺ کھڑے رہے اور انہوں نے اپنی نماز خود مکمل کی اور دشمن کے سامنے چلے گئے۔ پھر دوسرا گروہ آیا، آپ ﷺ نے انہیں دوسری رکعت پڑھائی اور تشہد میں بیٹھے رہے یہاں تک کہ انہوں نے اپنی نماز مکمل کی، پھر آپ ﷺ نے ان کے ساتھ سلام پھیرا۔",
        "english": "Narrated Salih bin Khawat (RA) from someone who prayed the Fear Prayer (Salat-ul-Khawf) with the Messenger of Allah (PBUH) on the day of Dhat-ur-Riqa': One group formed a row with him and another group faced the enemy. He prayed one Rak'ah with the group that was with him, then remained standing while they finished the prayer by themselves. Then they left and formed a row facing the enemy. Then the other group came and he prayed the remaining Rak'ah with them, then he remained sitting while they finished the prayer by themselves, and then he led them in the taslim (salutation)."
      }
    },

    {
      "id": 380,
      "name": {
        "arabic": " وَعَنِ ابْنِ عُمَرَ قَالَ: { غَزَوْتُ مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قِبَلَ نَجْدٍ, فَوَازَيْنَا اَلْعَدُوَّ, فَصَافَفْنَاهُمْ, فَقَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُصَلِّي بِنَا, فَقَامَتْ طَائِفَةٌ مَعَهُ, وَأَقْبَلَتْ طَائِفَةٌ عَلَى اَلْعَدُوِّ, وَرَكَعَ بِمَنْ مَعَهُ, وَسَجَدَ سَجْدَتَيْنِ, ثُمَّ انْصَرَفُوا مَكَانَ اَلطَّائِفَةِ الَّتِي لَمْ تُصَلِّ فَجَاءُوا, فَرَكَعَ بِهِمْ رَكْعَةً, وَسَجَدَ سَجْدَتَيْنِ, ثُمَّ سَلَّمَ, فَقَامَ كُلُّ وَاحِدٍ مِنْهُمْ, فَرَكَعَ لِنَفْسِهِ رَكْعَةً, وَسَجَدَ سَجْدَتَيْنِ } مُتَّفَقٌ عَلَيْهِ، وَهَذَا لَفْظُ اَلْبُخَارِيِّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ میں نجد کی طرف نبی کریم صلی اللہ علیہ وسلم کی معیت میں کسی غزوہ میں گیا۔ ہم دشمن کے بالکل مقابل صف بستہ تھے کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور ہمیں نماز پڑھائی۔ ایک جماعت نماز ادا کرنے آپ صلی اللہ علیہ وسلم کے ساتھ کھڑی ہو گئی اور ایک جماعت دشمن کے سامنے صفیں باندھ کر کھڑی ہو گئی۔ جو جماعت آپ صلی اللہ علیہ وسلم کے ساتھ نماز میں شریک تھی اس نے آپ صلی اللہ علیہ وسلم کے ساتھ ایک رکوع اور دو سجدے کئے اور اس گروہ کی جگہ واپس چلی گئی جس نے ابھی تک نماز نہیں پڑھی تھی۔ اس جماعت کے افراد آئے آپ صلی اللہ علیہ وسلم نے ان کو بھی ایک رکعت پڑھائی دو سجدوں کے ساتھ۔ پھر آپ صلی اللہ علیہ وسلم نے سلام پھیر دیا تو دونوں گروہوں نے اٹھ کر الگ الگ پوری کی۔ (بخاری و مسلم) متن حدیث کے الفاظ بخاری کے ہیں۔",
        "english": "Narrated Ibn 'Umar (RA): I participated in an expedition with the Messenger of Allah (ﷺ) towards Najd. We faced the enemy and formed ranks. The Messenger of Allah (ﷺ) stood up to lead us in prayer, and one group stood with him while another group faced the enemy. He performed one Rak'ah and two prostrations with the group that was with him, then they moved away to take the place of the group that had not yet prayed. That group came and he performed one Rak'ah and two prostrations with them. Then he performed the Taslim (concluded the prayer), and each member of the two groups stood up and performed one Rak'ah and two prostrations for themselves. (Agreed upon, and this is the version of Al-Bukhari)."
      }
    },

    {
      "id": 381,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ قَالَ: { شَهِدْتُ مَعَ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -صَلَاةَ اَلْخَوْفِ، فَصَفَّنَا صَفَّيْنِ: صَفٌّ خَلْفَ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -وَالْعَدُوُّ بَيْنَنَا وَبَيْنَ اَلْقِبْلَةِ... } رَوَاهُ مُسْلِمٌ. وَلِأَبِي دَاوُدَ: عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ مِثْلُهُ, وَزَادَ: { أَنَّهَا كَانَتْ بِعُسْفَانَ }.",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز خوف میں حاضر تھا۔ ہم نے دو صفیں بنائیں ایک صف رسول اللہ صلی اللہ علیہ وسلم کے پیچھے کھڑی ہوئی جبکہ دشمن ہمارے اور قبلہ کے درمیان میں تھا۔ آپ ﷺ نے سجدہ کیا تو آپ ﷺ کے ساتھ پہلی صف نے بھی سجدہ کیا اور جب وہ سب کھڑے ہو گئے تو دوسری صف سجدے میں چلی گئی اور پہلی صف پیچھے ہٹ گئی اور دوسری صف آگے آ گئی۔ (مسلم)۔ ابو داؤد کی روایت میں اضافہ ہے کہ یہ واقعہ 'عسفان' میں پیش آیا۔",
        "english": "Narrated Jabir (RA): I participated in the Fear Prayer (Salat al-Khawf) with the Messenger of Allah (ﷺ). He arranged us in two rows behind him, while the enemy was between us and the Qiblah. The Prophet (ﷺ) said Takbir and we all said it. He bowed and we all bowed. Then he prostrated with the first row while the second row remained standing facing the enemy. When he stood up, the second row prostrated. Then the rows swapped positions. (Reported by Muslim). Abu Dawud added from Abu 'Ayyash al-Zuraqi that this occurred at 'Usfan."
      }
    },

    {
      "id": 382,
      "name": {
        "arabic": "وَعَنْ حُذَيْفَةَ: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-صَلَّى صَلَاةَ اَلْخَوْفِ بِهَؤُلَاءِ رَكْعَةً, وَبِهَؤُلَاءِ رَكْعَةً, وَلَمْ يَقْضُوا } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ وَمِثْلُهُ عِنْدَ ابْنِ خُزَيْمَةَ: عَنِ ابْنِ عَبَّاسٍ",
        "urdu": "سیدنا حذیفہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو بھی ایک رکعت پڑھائی اور ان کو بھی ایک ہی رکعت۔ انہوں نے نماز کو پورا نہیں کیا۔ اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔ ابن خزیمہ نے ابن عباس رضی اللہ عنہما کے حوالہ سے بھی اسی طرح کی حدیث نقل کی ہے۔",
        "english": "Narrated Hudhaifa: The Prophet (ﷺ) offered the Fear Prayer with one group as one rak'a, and with another group as one rak'a, and they did not offer any more (to complete their prayer). Reported by Ahmad, Abu Dawud and an-Nasa'i; and Ibn Hibban graded it Sahih. A similar Hadith was reported by Ibn Khuzaima on the authority of Ibn 'Abbas."
      }
    },

    {
      "id": 383,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ صَلَاةُ اَلْخَوْفِ رَكْعَةٌ عَلَى أَيِّ وَجْهٍ كَانَ } رَوَاهُ اَلْبَزَّارُ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”نماز خوف ایک رکعت ہی ہے جس طرح بھی ادا ہو جائے۔“ اسے بزار نے ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated Ibn 'Umar: The Messenger of Allah (ﷺ) said: 'The Fear Prayer is one rak'a, in whatever way it is offered.' Reported by al-Bazzar with a weak chain of narrators."
      }
    },

    {
      "id": 384,
      "name": {
        "arabic": "وَعَنْهُ مَرْفُوعًا: { لَيْسَ فِي صَلَاةِ اَلْخَوْفِ سَهْوٌ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مرفوعاَ مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”نماز خوف میں سجدہ سہو نہیں ہے۔“ اسے دارقطنی نے ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated Ibn 'Umar: The Messenger of Allah (ﷺ) said: 'There is no Sujud as-Sahw (prostration of forgetfulness) in the Fear Prayer.' Reported by ad-Daraqutni with a weak chain."
      }
    }
  ]
}
