{
  "chapId": 76,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 964,
    "to": 974
  },
  "hadiths": [
    {
      "id": 964,
      "name": {
        "arabic": "عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تُحَرِّمُ اَلْمَصَّةُ وَالْمَصَّتَانِ.‏ } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک یا دو دفعہ دودھ چوسنے سے (رضاعت کی) حرمت ثابت نہیں ہوتی۔“ (مسلم)",
        "english": "Narrated 'Aishah (RA): The Messenger of Allah (ﷺ) said, 'One or two sucks do not make (marriage) unlawful.' [Reported by Muslim]."
      }
    },

    {
      "id": 965,
      "name": {
        "arabic": " وَعَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اُنْظُرْنَ مَنْ إِخْوَانُكُنَّ, فَإِنَّمَا اَلرَّضَاعَةُ مِنْ اَلْمَجَاعَةِ.‏ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”ضرور غور کر لیا کرو کہ تمہارے (رضاعی) بھائی کون ہیں، کیونکہ رضاعت اسی وقت معتبر ہوتی ہے جب دودھ بھوک مٹانے کے لیے پیا جائے۔“ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): Allah's Messenger (ﷺ) said, 'Be careful about who your (foster) brothers are, for fosterage is only valid if it is because of hunger (i.e. within the age of breastfeeding).'"
      }
    },

    {
      "id": 966,
      "name": {
        "arabic": " وَعَنْهَا قَالَتْ: { جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ.‏ فَقَالَتْ: يَا رَسُولَ اَللَّهِ! إِنَّ سَالِمًا مَوْلَى أَبِي حُذَيْفَةَ مَعَنَا فِي بَيْتِنَا, وَقَدْ بَلَغَ مَا يَبْلُغُ اَلرِّجَالُ.‏ قَالَ: \"أَرْضِعِيهِ.‏ تَحْرُمِي عَلَيْهِ\".‏ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ سھلہ بنت سہیل رضی اللہ عنہا آئیں اور عرض کیا: اے اللہ کے رسول! سالم، جو ابوحذیفہ کا آزاد کردہ غلام ہے، ہمارے گھر میں ہمارے ساتھ ہی رہتا ہے اور اب وہ مردوں کی طرح بلوغت کو پہنچ گیا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اسے اپنا دودھ پلا دو، تو اس پر (محرم ہونے کی وجہ سے) حرام ہو جائے گی۔“ (مسلم)",
        "english": "Narrated 'Aishah (RA): Sahlah bint Suhail came and said, \"O Messenger of Allah! Salim, the freed slave of Abu Hudhaifah, lives with us in our house, and he has reached manhood as men do (reached puberty).\" He (ﷺ) said, \"Suckle him and you will become forbidden for him (as a Mahram).\" [Reported by Muslim]."
      }
    },

    {
      "id": 967,
      "name": {
        "arabic": "وَعَنْهَا: { أَنْ أَفْلَحَ ‏-أَخَا أَبِي الْقُعَيْسِ‏- جَاءَ يَسْتَأْذِنُ عَلَيْهَا بَعْدَ اَلْحِجَابِ.‏ قَالَتْ: فَأَبَيْتُ أَنْ آذَنَ لَهُ, فَلَمَّا جَاءَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَخْبَرْتُهُ بِاَلَّذِي صَنَعْتُ, فَأَمَرَنِي أَنْ آذَنَ لَهُ عَلَيَّ.‏ وَقَالَ: \"إِنَّهُ عَمُّكِ\".‏ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ ابوالقعیس کا بھائی افلح حجاب (کے احکامات نازل ہونے) کے بعد سیدہ عائشہ رضی اللہ عنہا کے ہاں آنے کے لیے اجازت طلب کرنے لگا۔ سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے انہیں اندر آنے کی اجازت دینے سے انکار کر دیا۔ جب رسول اللہ ﷺ تشریف لائے تو میں نے سارا واقعہ سنایا۔ آپ ﷺ نے مجھے حکم دیا کہ انہیں اپنے پاس آنے کی اجازت دے دیا کرو اور فرمایا: ”وہ تمہارا (رضاعی) چچا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): Aflah, the brother of Abu al-Qu'ais, came and asked permission to visit her after the verse of Hijab had been revealed. She said: \"I refused to give him permission. When Allah's Messenger (ﷺ) came, I told him what I had done. He commanded me to give him permission and said: 'He is your uncle (by fosterage).'\" (Agreed upon)"
      }
    },

    {
      "id": 968,
      "name": {
        "arabic": "وَعَنْهَا قَالَتْ: { كَانَ فِيمَا أُنْزِلُ فِي اَلْقُرْآنِ: عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ يُحَرِّمْنَ, ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ, فَتُوُفِّيَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَهِيَ فِيمَا يُقْرَأُ مِنَ اَلْقُرْآنِ } .‏ رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ قرآن میں (ابتداءً) یہ حکم نازل کیا گیا تھا کہ دس بار معلوم (پیٹ بھر کر) دودھ پینا نکاح کو حرام کرتا ہے۔ پھر یہ حکم پانچ بار معلوم (دودھ پینے کے حکم) سے منسوخ کر دیا گیا۔ پھر جب رسول اللہ ﷺ نے وفات پائی، تو یہ (پانچ رضعات والی آیت) ان آیات میں شامل تھی جو قرآن میں پڑھی جاتی تھیں۔ (مسلم)",
        "english": "Narrated 'Aishah (RA): Among the things revealed in the Qur'an was that ten known sucklings made marriage unlawful. Then it was abrogated by five known sucklings. When the Messenger of Allah (ﷺ) passed away, these (verses) were among the things recited in the Qur'an. [Reported by Muslim]."
      }
    },

    {
      "id": 969,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أُرِيدُ عَلَى اِبْنَةِ حَمْزَةَ.‏ فَقَالَ: \"إِنَّهَا لَا تَحِلُّ لِي; إِنَّهَا اِبْنَةُ أَخِي مِنْ اَلرَّضَاعَةِ } وَيَحْرُمُ مِنْ اَلرَّضَاعَةِ مَا يَحْرُمُ مِنْ اَلنَّسَبِ.‏ مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم کو پیشکش کی گئی کہ آپ اپنے (چچا) حمزہ رضی اللہ عنہ کی بیٹی سے نکاح کر لیں۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”وہ میرے لیے حلال نہیں ہے، کیونکہ وہ میرے رضاعی بھائی کی بیٹی ہے۔ اور رضاعت سے بھی وہی رشتے حرام ہو جاتے ہیں جو نسب (خونی رشتے) سے حرام ہوتے ہیں۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) was offered the daughter of Hamza (RA) in marriage, but he said: 'She is not lawful for me, for she is the daughter of my foster brother; and fosterage makes unlawful what lineage makes unlawful.'"
      }
    },

    {
      "id": 970,
      "name": {
        "arabic": " وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يُحَرِّمُ مِنْ اَلرَّضَاعَةِ إِلَّا مَا فَتَقَ اَلْأَمْعَاءَ, وَكَانَ قَبْلَ اَلْفِطَامِ.‏ } رَوَاهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ هُوَ وَالْحَاكِمُ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”رضاعت (دودھ پینا) حرمت ثابت نہیں کرتی مگر وہ جو انتڑیوں کو بھر دے (یعنی پیٹ بھر کر پیا جائے) اور وہ دودھ چھڑانے کی مدت سے پہلے ہو۔“",
        "english": "Narrated Umm Salama (RA): Allah's Messenger (ﷺ) said: 'Fosterage does not make marriage unlawful except that which reaches the intestines (satisfies hunger) and is before the time of weaning.'"
      }
    },

    {
      "id": 971,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { لَا رَضَاعَ إِلَّا فِي اَلْحَوْلَيْنِ } رَوَاهُ اَلدَّارَقُطْنِيُّ وَابْنُ عَدِيٍّ مَرْفُوعًا وَمَوْقُوفًا، وَرَجَّحَا اَلْمَوْقُوفَ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما نے فرمایا کہ کوئی رضاعت معتبر نہیں سوائے اس رضاعت کے جو دو سال کے دوران میں ہو۔ اسے دارقطنی اور ابن عدی نے مرفوع اور موقوف روایت کیا ہے مگر ترجیح دونوں نے موقوف کو دی ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: 'Breastfeeding is not valid (for establishing mahram relationship) except what occurs within the first two years (of the child's life).' [Reported by ad-Daraqutni and Ibn 'Adi as Marfu' (traceable to the Prophet) and Mawquf (as a saying of the companion), and they both graded the Mawquf version as more authentic]."
      }
    },

    {
      "id": 972,
      "name": {
        "arabic": "وَعَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا رَضَاعَ إِلَّا مَا أَنْشَزَ اَلْعَظْمَ, وَأَنْبَتَ اَللَّحْمَ.‏ } رَوَاهُ أَبُو دَاوُدَ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”رضاعت وہی معتبر ہے جو ہڈیوں کی نشوونما کرے اور گوشت پیدا کرے۔“ (ابوداؤد)",
        "english": "Narrated Ibn Mas'ud (RA): The Messenger of Allah (SAW) said: 'There is no (legal) suckling except that which strengthens the bone and makes the flesh grow.' (Reported by Abu Dawud)"
      }
    },

    {
      "id": 973,
      "name": {
        "arabic": "وَعَنْ عُقْبَةَ بْنِ اَلْحَارِثِ; { أَنَّهُ تَزَوَّجَ أُمَّ يَحْيَى بِنْتَ أَبِي إِهَابٍ, فَجَاءَتْ اِمْرَأَةٌ.‏ فَقَالَتْ: قَدْ أَرْضَعْتُكُمَا, فَسَأَلَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \"كَيْفَ وَقَدْ قِيلَ? \" فَفَارَقَهَا عُقْبَةُ.‏ وَنَكَحَتْ زَوْجًا غَيْرَهُ.‏ } أَخْرَجَهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا عقبہ بن حارث رضی اللہ عنہ سے مروی ہے کہ انہوں نے ام یحییٰ بنت ابی اھاب رضی اللہ عنہا سے نکاح کر لیا تو ایک عورت آئی اور کہنے لگی کہ میں نے تم دونوں کو دودھ پلایا ہے۔ عقبہ نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا ”اب تم اسے کس طرح اپنے نکاح میں رکھ سکتے ہو جبکہ رضاعت کی اطلاع دے دی گئی ہے۔“ چنانچہ عقبہ نے اس عورت کو جدا کر دیا اور اس خاتون نے دوسرے آدمی سے نکاح کر لیا۔ (بخاری)",
        "english": "Narrated 'Uqba bin Al-Harith: That he married the daughter of Abi Ihab bin 'Aziz. A woman came and said, 'I have suckled both 'Uqba and the woman whom he has married.' 'Uqba said to her, 'I do not know that you have suckled me, and you did not inform me.' He then rode to Allah's Messenger (ﷺ) and asked him. Allah's Messenger (ﷺ) said: 'How can you keep her as a wife when it has been said (that she is your foster-sister)?' So 'Uqba divorced her and she married another man."
      }
    },

    {
      "id": 974,
      "name": {
        "arabic": "وَعَنْ زِيَادِ اَلسَّهْمِيِّ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ تُسْتَرْضَعَ اَلْحَمْقَى.‏ } أَخْرَجَهُ أَبُو دَاوُدَ وَهُوَ مُرْسَلٌ, وَلَيْسَتْ لِزِيَادٍ صُحْبَةٌ ",
        "urdu": "سیدنا زیاد سہمی رحمہ اللہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے احمق و کم عقل عورتوں کا دودھ پلانے سے منع فرمایا ہے۔ اسے ابوداؤد نے نکالا ہے اور یہ مرسل ہے کیونکہ زیاد کو صحابی ہونے کا شرف حاصل نہیں۔",
        "english": "Narrated Ziyad as-Sahmi: The Messenger of Allah (ﷺ) forbade that foolish (or mentally deficient) women should be engaged to suckle (children). [Reported by Abu Dawud, and it is Mursal (disconnected), as Ziyad did not have the status of a Companion]."
      }
    }
  ]
}
