{
  "chapId": 92,
  "bookId": 12,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1135,
    "to": 1146
  },
  "hadiths": [
    {
      "id": 1135,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { كُلِّ ذِي نَابٍ مِنْ اَلسِّبَاعِ, فَأَكَلَهُ حَرَامٌ } رَوَاهُ مُسْلِمٌ.‏ (1726)‏ . وَأَخْرَجَهُ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ بِلَفْظٍ: نَهَى.‏ وَزَادَ: { وَكُلُّ ذِي مِخْلَبٍ مِنْ اَلطَّيْرِ } (1727)",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا ” درندوں میں سے ہر کچلی والے کا کھانا حرام ہے۔ “ (مسلم) ابن عباس رضی اللہ عنہما کی روایت میں جسے مسلم نے روایت کیا ہے یہ الفاظ ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا ہے اور اتنا اضافہ ہے کہ ” پرندوں میں ہر اس پرندے کا کھانا حرام ہے جو پنجوں میں گرفت کر کے کھائے۔ “",
        "english": "Abu Hurairah (RA) narrated that the Prophet (ﷺ) said: 'The eating of every fanged beast of prey is prohibited.' (Reported by Muslim). It was also reported from the Hadith of Ibn 'Abbas (RA) with the wording 'He prohibited,' and added: 'And every bird with a talon (claws).'"
      }
    },

    {
      "id": 1136,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَوْمَ خَيْبَرَ عَنْ لُحُومِ اَلْحُمُرِ اَلْأَهْلِيَّةِ, وَأَذِنَ فِي لُحُومِ اَلْخَيْلِ } مُتَّفَقٌ عَلَيْهِ.‏ وَفِي لَفْظِ اَلْبُخَارِيِّ: { وَرَخَّصَ } ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن گھریلو گدھوں کا گوشت کھانے سے منع فرما دیا اور گھوڑوں کے گوشت کی اجازت دی۔ (بخاری و مسلم)۔ بخاری کے الفاظ میں 'اذن' (اجازت دی) کے بجائے 'رخص' (رخصت دی) کا لفظ ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (R.A): On the day of Khaibar, Allah's Messenger (ﷺ) forbade the eating of domestic donkeys and allowed the eating of horse flesh. [Agreed upon]. In the version of al-Bukhari, the word 'licensed' (Rakh-khasa) is used instead of 'allowed'."
      }
    },

    {
      "id": 1137,
      "name": {
        "arabic": " وَعَنْ اِبْنِ أَبِي أَوْفَى قَالَ: { غَزَوْنَا مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سَبْعَ غَزَوَاتٍ, نَأْكُلُ اَلْجَرَادَ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا عبداللہ بن ابی اوفی رضی اللہ عنہ سے مروی ہے کہ ہم نے رسول اللہ ﷺ کے ساتھ سات غزوات لڑے ہیں، (ان میں) ہم ٹڈی کھایا کرتے تھے۔",
        "english": "Narrated Ibn Abi Awfa (RA): 'We participated with the Messenger of Allah (ﷺ) in seven expeditions, and we used to eat locusts.'"
      }
    },

    {
      "id": 1138,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- فِي قِصَّةِ اَلْأَرْنَبِ ‏- { قَالَ: فَذَبَحَهَا, فَبَعَثَ بِوَرِكِهَا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَبِلَهُ } مُتَّفَقٌ عَلَيْهِ.‏ ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے خرگوش کے قصہ کے متعلق روایت ہے کہ (ابوطلحہ رضی اللہ عنہ) نے اسے ذبح کیا اور اس کی ران رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں (بطورِ ہدیہ) بھیجی، جسے آپ ﷺ نے قبول فرما لیا۔ (بخاری و مسلم)",
        "english": "Narrated Anas (R.A) regarding the story of the rabbit: He (Abu Talha) slaughtered it and sent its haunch to the Messenger of Allah (ﷺ), and he accepted it. [Agreed upon]."
      }
    },

    {
      "id": 1139,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ قَتْلِ أَرْبَعِ مِنْ اَلدَّوَابِّ: اَلنَّمْلَةُ, وَالنَّحْلَةُ, وَالْهُدْهُدُ, وَالصُّرَدُ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ.‏",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جانوروں میں سے چار کو مارنے سے منع فرمایا ہے: چیونٹی، شہد کی مکھی، ہدہد اور صرد (ممولا)۔ اسے احمد اور ابوداؤد نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Messenger of Allah (ﷺ) prohibited the killing of four creatures: the ant, the bee, the hoopoe (Hudhud), and the shrike (Surad). [Reported by Ahmad and Abu Dawud; Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1140,
      "name": {
        "arabic": "وَعَنْ اِبْنِ أَبِي عَمَّارٍ قَالَ: { قُلْتُ لِجَابِرٍ: اَلضَّبُعُ صَيْدٌ هِيَ؟ قَالَ: نَعَمْ.‏ قُلْتُ: قَالَهُ رَسُولُ اَللَّهِ صلى الله عليه وسلم؟ قَالَ: نَعَمْ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَصَحَّحَهُ اَلْبُخَارِيُّ, وَابْنُ حِبَّانَ.",
        "urdu": "سیدنا ابن ابی عمار رحمہ اللہ سے روایت ہے کہ میں نے سیدنا جابر رضی اللہ عنہ سے دریافت کیا: کیا بجو (چرگ) شکار ہے؟ انہوں نے کہا: ہاں! میں نے پوچھا: کیا رسول اللہ ﷺ نے ایسا فرمایا ہے؟ انہوں نے جواب دیا: ہاں! اسے احمد اور چاروں (سنن) نے روایت کیا ہے، اور امام بخاری اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn Abi 'Ammar: I asked Jabir (R.A): \"Is the hyena considered game (to be hunted)?\" He replied: \"Yes.\" I asked: \"Did the Messenger of Allah (ﷺ) say so?\" He replied: \"Yes.\" [Reported by Ahmad and the four Sunan; Al-Bukhari and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1141,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ - رضي الله عنهما - أَنَّهُ سُئِلَ عَنْ اَلْقُنْفُذِ، فَقَالَ: ( قُلْ لَا أَجِدُ فِي مَا أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَى طَاعِمٍ ) فَقَالَ شَيْخٌ عِنْدَهُ: سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ: ذُكِرَ عِنْدَ اَلنَّبِيِّ - صلى الله عليه وسلم - فَقَالَ: «خِبْثَةٌ مِنَ اَلْخَبَائِثِ» . أَخْرَجَهُ أَحْمَدُ، وَأَبُو دَاوُدَ، وَإِسْنَادُهُ ضَعِيفٌ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ ان سے سیہ (خار پشت) کے متعلق دریافت کیا گیا۔ انہوں نے جواب میں اللہ کا فرمان سنایا: ”(اے رسول!) کہہ دیجئے کہ میں اس میں کوئی حرام چیز نہیں پاتا جو میری طرف وحی کی گئی ہے۔“ ان کے پاس ایک بزرگ بیٹھے تھے، انہوں نے کہا: میں نے سیدنا ابوہریرہ رضی اللہ عنہ سے سنا ہے کہ اس کا ذکر نبی کریم صلی اللہ علیہ وسلم کے پاس کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”یہ خبیث (گندے) جانوروں میں سے ایک خبیث جانور ہے۔“ اس کی روایت احمد اور ابوداؤد نے کی ہے اور اس کی سند ضعیف ہے۔",
        "english": "Narrated Ibn ‘Umar (RA): He was asked about the hedgehog, and he replied by reciting the verse: 'Say: I find not in that which has been inspired to me anything forbidden to be eaten...' (6:145). An old man who was with him said: 'I heard Abu Hurairah (RA) saying: It was mentioned to the Prophet (SAW) and he said: It is one of the loathsome (evil) things.' [Reported by Ahmad and Abu Dawud, and its chain is weak]."
      }
    },

    {
      "id": 1142,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلْجَلَّالَةِ وَأَلْبَانِهَا } أَخْرَجَهُ اَلْأَرْبَعَةُ إِلَّا النَّسَائِيُّ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے گندگی خور جانور (جلالہ) کا گوشت کھانے اور اس کا دودھ پینے سے منع فرمایا ہے۔ اسے نسائی کے علاوہ چاروں (احمد، ابوداؤد، ترمذی، ابن ماجہ) نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): Allah's Messenger (ﷺ) forbade the eating of Al-Jallalah (an animal that eats dung/filth) and drinking its milk. [Reported by the four except An-Nasa'i; At-Tirmidhi graded it Hasan]."
      }
    },

    {
      "id": 1143,
      "name": {
        "arabic": "وَعَنْ أَبِي قَتَادَةٌ ‏- رضى الله عنه ‏- { ‏-فِي قِصَّةِ اَلْحِمَارِ اَلْوَحْشِيِّ‏- فَأَكَلَ مِنْهُ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-} مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابو قتادہ رضی اللہ عنہ سے حمار وحشی (جنگلی گدھے) کے قصہ کے سلسلہ میں مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اس کا گوشت تناول فرمایا۔ (بخاری و مسلم)",
        "english": "Narrated Abu Qatadah (RA) regarding the story of the onager (wild donkey): The Prophet (ﷺ) ate some of its meat. [Agreed upon]."
      }
    },

    {
      "id": 1144,
      "name": {
        "arabic": "وَعَنْ أَسْمَاءِ بِنْتِ أَبِي بَكْرٍ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { نَحَرْنَا عَلَى عَهْدِ رَسُولِ اَللَّهِ صلى الله عليه وسلم فَرَساً, فَأَكَلْنَاهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ اسماء بنت ابی بکر رضی اللہ عنہا سے روایت ہے کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک گھوڑا ذبح کیا اور اسے ہم نے کھایا۔ (بخاری و مسلم)",
        "english": "Narrated Asma' bint Abi Bakr (R.A): We slaughtered a horse during the lifetime of Allah's Messenger (ﷺ) and we ate it. [Agreed upon]."
      }
    },

    {
      "id": 1145,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أُكِلَ اَلضَّبُّ عَلَى مَائِدَةِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے دسترخوان پر ضب (سانڈا) کھایا گیا۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): 'Dabb (lizard) was eaten at the table of the Messenger of Allah (ﷺ).'"
      }
    },

    {
      "id": 1146,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عُثْمَانَ اَلْقُرَشِيُّ ‏- رضى الله عنه ‏- { أَنَّ طَبِيباً سَأَلَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- عَنْ اَلضِّفْدَعِ يَجْعَلُهَا فِي دَوَاءٍ, فَنَهَى عَنْ قَتْلِهَا } أَخْرَجَهُ أَحْمَدُ, وَصَحَّحَهُ اَلْحَاكِمُ ",
        "urdu": "سیدنا عبدالرحمٰن بن عثمان قرشی رضی اللہ عنہ سے مروی ہے کہ ایک طبیب نے رسول اللہ ﷺ سے مینڈک کے بارے میں دریافت کیا کہ اسے دوا میں استعمال کیا جائے، تو آپ ﷺ نے مینڈک کو قتل کرنے سے منع فرما دیا۔",
        "english": "Narrated 'Abdur-Rahman bin 'Uthman al-Qurashi (R.A): A physician asked Allah's Messenger (ﷺ) about putting frogs in medicine, but he (ﷺ) forbade killing them. [Reported by Ahmad; al-Hakim graded it Sahih]."
      }
    }
  ]
}
