{
  "chapId": 91,
  "bookId": 11,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1130,
    "to": 1134
  },
  "hadiths": [
    {
      "id": 1130,
      "name": {
        "arabic": "عَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { سَابَقَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بِالْخَيْلِ اَلَّتِي قَدْ أُضْمِرَتْ, مِنْ الْحَفْيَاءِ, وَكَانَ أَمَدُهَا ثَنِيَّةِ اَلْوَدَاعِ.‏ وَسَابَقَ بَيْنَ اَلْخَيْلِ اَلَّتِي لَمْ تُضَمَّرْ مِنْ اَلثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ, وَكَانَ اِبْنُ عُمَرَ فِيمَنْ سَابَقَ } مُتَّفَقٌ عَلَيْهِ. زَادَ اَلْبُخَارِيُّ, قَالَ سُفْيَانُ: مِنْ الْحَفْيَاءِ إِلَى ثَنِيَّةِ اَلْوَدَاعُ خَمْسَةِ أَمْيَالٍ, أَوْ سِتَّةَ, وَمِنْ اَلثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ مِيلٌ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے تیار شدہ (دبلے پتلے کیے گئے) گھوڑوں کی حفیاء سے ثنیہ الوداع تک دوڑ کرائی اور جو گھوڑے تیار نہیں تھے ان کو ثنیہ سے لے کر بنی زریق کی مسجد تک دوڑایا اور ابن عمر رضی اللہ عنہما بھی اس مقابلے میں شریک تھے۔ (بخاری و مسلم)۔ بخاری میں یہ اضافہ ہے کہ سفیان نے بیان کیا: حفیاء سے ثنیہ الوداع کا فاصلہ پانچ یا چھ میل ہے اور ثنیہ سے مسجد بنی زریق تک کا فاصلہ ایک میل ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): The Prophet (ﷺ) organized a race of the horses that had been specially prepared (lean and trained), from Al-Hafya' to Thaniyat-al-Wada'. And he organized a race of the horses that had not been prepared (untrained) from Ath-Thaniya to the mosque of Banu Zuraiq. Ibn 'Umar was among those who took part in the race. [Agreed upon]. Al-Bukhari added: Sufyan said: 'The distance between Al-Hafya' and Thaniyat-al-Wada' is five or six miles, and the distance between Ath-Thaniya and the mosque of Banu Zuraiq is one mile.'"
      }
    },

    {
      "id": 1131,
      "name": {
        "arabic": "وَعَنْهُ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-سَبْقَ بَيْنَ اَلْخَيْلِ, وَفَضَّلَ اَلْقَرْحَ فِي اَلْغَايَةِ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّان ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے گھوڑوں کے درمیان دوڑ کا مقابلہ کرایا اور عمر رسیدہ (سدھائے ہوئے) گھوڑوں کے لیے فاصلے (حد) میں فرق ملحوظ رکھا۔",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) arranged a horse race and gave a preference (in terms of distance) to the 'Qarh' (horses that have entered their fifth year)."
      }
    },

    {
      "id": 1132,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"لَا سَبْقَ إِلَّا فِي خُفِّ, أَوْ نَصْلٍ, أَوْ حَافِرٍ\" } رَوَاهُ أَحْمَدُ, وَالثَّلَاثَةَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”انعامی مقابلہ صرف اونٹوں کی دوڑ، تیر اندازی یا گھڑ دوڑ میں ہی جائز ہے۔“ اسے احمد اور تینوں (ابوداؤد، ترمذی، نسائی) نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Abu Hurairah (R.A): The Messenger of Allah (ﷺ) said: 'Prizes (for competitions) are only allowed in camel racing, archery, or horse racing.' [Reported by Ahmad and the three; Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1133,
      "name": {
        "arabic": " وَعَنْهُ, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" مَنْ أَدْخُلُ فَرَساً بَيْنَ فَرَسَيْنِ ‏- وَهُوَ لَا يَأْمَنُ أَنْ يَسْبِقَ ‏- فَلَا بَأْسَ بِهِ, وَإِنْ أَمِنَ فَهُوَ قِمَارٌ\" } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَإِسْنَادُهُ ضَعِيف ٌ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے دو گھوڑوں (جن پر شرط لگی ہو) کے درمیان تیسرا گھوڑا داخل کیا اس حال میں کہ اسے یہ یقین نہ ہو کہ وہ جیت جائے گا، تو اس میں کوئی حرج نہیں، لیکن اگر اسے جیت کا یقین ہو تو یہ جوا بن جائے گا۔“",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: 'If anyone enters a horse in a race with two other horses (on which bets have been made) while he is not certain that it will win, there is no harm; but if he is certain (it will win), it is gambling (Qimar).'"
      }
    },

    {
      "id": 1134,
      "name": {
        "arabic": "وَعَنْ عَقَبَةَ بْنِ عَامِرٍ - رضى الله عنه - قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -وَهُوَ عَلَى اَلْمِنْبَرِ يَقْرَأُ: ﴿ وَأَعِدُّوا لَهُمْ مَا اِسْتَطَعْتُمْ مِنْ قُوَّةٍ ﴾ 'أَلَا إِنَّ اَلْقُوَّةَ اَلرَّمْيُ, أَلَا إِنَّ اَلْقُوَّةَ اَلرَّمْيُ, أَلَا إِنَّ اَلْقُوَّةَ اَلرَّمْيُ } . رَوَاهُ مُسْلِمٌ .",
        "urdu": "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر یہ آیت تلاوت کرتے ہوئے سنا: «وأعدوا لهم ما استطعتم من قوة» (اور ان کے مقابلے کے لیے جس قدر تم سے ہو سکے قوت تیار رکھو)۔ پھر آپ ﷺ نے فرمایا: ”خبردار! قوت تیر اندازی ہے، خبردار! قوت تیر اندازی ہے، خبردار! قوت تیر اندازی ہے۔“ (مسلم)",
        "english": "Narrated 'Uqbah bin 'Amir (R.A): I heard the Messenger of Allah (ﷺ) while he was on the pulpit, reciting: 'And make ready against them all you can of power...' (8:60). He then said: 'Behold! Power is archery; behold! Power is archery; behold! Power is archery.'"
      }
    }
  ]
}
