{
  "chapId": 79,
  "bookId": 9,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 993,
    "to": 1008
  },
  "hadiths": [
    {
      "id": 993,
      "name": {
        "arabic": "عَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَحِلُّ دَمُ اِمْرِئٍ مُسْلِمٍ; يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ, وَأَنِّي رَسُولُ اَللَّهِ, إِلَّا بِإِحْدَى ثَلَاثٍ: اَلثَّيِّبُ اَلزَّانِي, وَالنَّفْسُ بِالنَّفْسِ, وَالتَّارِكُ لِدِينِهِ; اَلْمُفَارِقُ لِلْجَمَاعَةِ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے مروی ہے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی مسلمان کا خون حلال نہیں ہے جو شہادت دیتا ہو کہ اللہ کے سوا اور کوئی معبود نہیں اور میں اللہ کا رسول ہوں مگر تین شخص اس سے مستثنیٰ ہیں۔ شادی شدہ زانی اور جان کے بدلہ میں جان اور اپنے دین کو چھوڑ کر مسلمانوں کی جماعت سے علیحدہ ہونے والا۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) said, \"The blood of a Muslim who testifies that there is no god but Allah and that I am the Messenger of Allah, is not lawful to shed except in three cases: a married person who commits adultery, a life for a life, and one who reverts from his religion (Islam) and abandons the community.\""
      }
    },

    {
      "id": 994,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا, عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحِلُّ قَتْلُ مُسْلِمٍ إِلَّا فِي إِحْدَى ثَلَاثِ خِصَالٍ: زَانٍ مُحْصَنٌ فَيُرْجَمُ, وَرَجُلٌ يَقْتُلُ مُسْلِمًا مُتَعَمِّدًا فَيُقْتَلُ, وَرَجُلٌ يَخْرُجُ مِنْ اَلْإِسْلَامِ فَيُحَارِبُ اَللَّهَ وَرَسُولَهُ, فَيُقْتَلُ, أَوْ يُصْلَبُ, أَوْ يُنْفَى مِنْ اَلْأَرْضِ .‏ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی مسلمان آدمی کا قتل حلال نہیں بجز تین صورتوں میں سے کسی ایک کے۔ شادی شدہ زانی، پس اسے سنگسار کیا جائے اور وہ آدمی جو دیدہ دانستہ کسی مسلمان بھائی کو قتل کرے پس اسے قتل کیا جائے گا اور ایک وہ آدمی جو دائرہ اسلام سے خارج ہو جائے اور اللہ اور اس کے رسول سے (لڑائی) شروع کر دے۔ پس اسے قتل کیا جائے گا یا سولی دی جائے گی یا اسے جلا وطن کیا جائے گا۔“ اسے ابوداؤد اور نسائی نے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے۔",
        "english": "Narrated ‘Aisha (RA): Allah's Messenger (ﷺ) said: \"The blood of a Muslim who confesses that none has the right to be worshipped but Allah and that I am His Messenger, cannot be shed except in three cases: A married person who commits adultery (Zina), he is to be stoned; a man who kills a Muslim intentionally, he is to be killed in retaliation; and a man who leaves Islam and fights against Allah and His Messenger, he is to be killed, or crucified, or exiled from the land.\""
      }
    },

    {
      "id": 995,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَوَّلُ مَا يُقْضَى بَيْنَ اَلنَّاسِ يَوْمَ اَلْقِيَامَةِ فِي اَلدِّمَاءِ .‏ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”قیامت کے روز لوگوں کے درمیان سب سے پہلے جن مقدمات کا فیصلہ کیا جائے گا وہ خون کے مقدمات ہوں گے۔“ (بخاری و مسلم)",
        "english": "Narrated 'Abdullah bin Mas'ud (RA): Allah's Messenger (ﷺ) said: \"The first cases to be decided among the people on the Day of Resurrection will be those of blood (bloodshed).\""
      }
    },

    {
      "id": 996,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ, وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ, وَهُوَ مِنْ رِوَايَةِ اَلْحَسَنِ اَلْبَصْرِيِّ عَنْ سَمُرَةَ, وَقَدْ اُخْتُلِفَ فِي سَمَاعِهِ مِنْهُ .‏ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ, وَالنَّسَائِيِّ: { وَمَنْ خَصَى عَبْدُهُ خَصَيْنَاهُ } .‏ وَصَحَّحَ اَلْحَاكِمُ هَذِهِ اَلزِّيَادَةَ",
        "urdu": "سیدنا سمرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس مالک نے اپنے غلام کو قتل کیا ہم اسے قتل کریں گے اور جس نے اس کا ناک، کان کاٹا ہم اس کا ناک، کان کاٹ دیں گے۔“ اسے احمد اور چاروں نے روایت کیا ہے اور ترمذی نے اسے حسن کہا ہے۔ یہ سمرہ سے حسن بصری کی روایت ہے اور سمرہ سے حسن بصری کے سماع میں اختلاف ہے اور ابوداؤد اور نسائی کی روایت میں ہے کہ ”جس مالک نے اپنے غلام کو خصی کیا ہم اسے خصی کر دیں گے۔“ اس اضافہ کو حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated Samurah (RA): Allah's Messenger (ﷺ) said: \"Whoever kills his slave, we shall kill him; and whoever mutilates (his slave by cutting off his ear or nose), we shall mutilate him.\" [Reported by Ahmad and the four Imams, and At-Tirmidhi graded it Hasan]. In a narration by Abu Dawud and An-Nasa'i: \"And whoever castrates his slave, we shall castrate him.\" [Al-Hakim graded this addition as Sahih]."
      }
    },

    {
      "id": 997,
      "name": {
        "arabic": "وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { لَا يُقَادُ اَلْوَالِدُ بِالْوَلَدِ } رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ اَلْجَارُودِ وَالْبَيْهَقِيُّ, وَقَالَ اَلتِّرْمِذِيُّ: إِنَّهُ مُضْطَرِبٌ",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ ”باپ سے بیٹے کا قصاص نہیں لیا جائے گا۔“ اسے احمد، ترمذی اور ابن ماجہ نے روایت کیا ہے اور ابن جارود اور بیہقی نے صحیح قرار دیا ہے اور ترمذی نے کہا ہے کہ اس حدیث میں اضطراب ہے۔",
        "english": "Narrated 'Umar bin al-Khattab (RA): I heard Allah's Messenger (ﷺ) saying: \"A father is not to be killed (in retaliation) for (killing) his son.\""
      }
    },

    {
      "id": 998,
      "name": {
        "arabic": "وَعَنْ أَبِي جُحَيْفَةَ قَالَ: { قُلْتُ لَعَلِيٍّ رَضِيَ اَللَّهُ عَنْهُمَا: هَلْ عِنْدَكُمْ شَيْءٌ مِنْ اَلْوَحْيِ غَيْرَ اَلْقُرْآنِ? قَالَ: لَا وَاَلَّذِي فَلَقَ اَلْحَبَّةَ وَبَرَأَ اَلنِّسْمَةَ, إِلَّا فَهْمٌ يُعْطِيهِ اَللَّهُ رَجُلًا فِي اَلْقُرْآنِ, وَمَا فِي هَذِهِ اَلصَّحِيفَةِ.‏ قُلْتُ: وَمَا فِي هَذِهِ اَلصَّحِيفَةِ? قَالَ: \"اَلْعَقْلُ, وَفِكَاكُ اَلْأَسِيرِ, وَلَا يُقْتَلُ مُسْـلِمٌ بِكَافِرٍ } .‏ رَوَاهُ اَلْبُخَارِيُّ وَأَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ: مِنْ وَجْهٍ آخَرَ عَنْ عَلِيٍّ وَقَالَ فِيهِ: { اَلْمُؤْمِنُونَ تَتَكَافَأُ دِمَاؤُهُمْ, وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ, وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ, وَلَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ, وَلَا ذُو عَهْدٍ فِي عَهْدِهِ } .‏ وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا ابوحجیفہ رضی اللہ عنہ سے روایت ہے کہ میں نے سیدنا علی رضی اللہ عنہ سے دریافت کیا، کیا آپ لوگوں کے پاس قرآن کے علاوہ وحی کے ذریعہ نازل شدہ کوئی اور چیز بھی ہے؟ انہوں نے جواب دیا۔ نہیں! اس ذات کی قسم! جس نے دانہ و غلہ اگایا اور جان کو پیدا فرمایا سوائے اس فہم کے جسے اللہ تعالیٰ کسی انسان کو قرآن کے بارے میں عطا فرماتا ہے اور جو کچھ اس صحیفہ میں تحریر ہے (میرے پاس کچھ نہیں) میں نے سوال کیا کہ اس صحیفہ میں کیا ہے؟ انہوں نے بتایا کہ دیت کے احکام، قیدی کو آزاد کرنے کا حکم اور یہ کہ کسی مسلمان کو کافر کے بدلہ میں قتل نہیں کیا جائے گا۔ (بخاری) سیدنا علی رضی اللہ عنہ کی اس روایت کو احمد، ابوداؤد اور نسائی نے ایک دوسری سند سے بیان کیا ہے اور اس میں ہے کہ ”سب مومنوں کے خون برابر ہیں اور ان میں سے ادنی آدمی کی ذمہ داری کی حیثیت بڑے آدمی کے برابر ہے اور اپنے سوا وہ غیر مسلموں کے مقابلہ میں سب ایک دوسرے کے ساتھ متحد ہیں اور کوئی مومن کسی کافر کے عوض قتل نہیں کیا جائے گا اور نہ کسی معاہد (ذمی) کو اس کے زمانہ عہد میں قتل کیا جا سکتا ہے۔“ اس روایت کو حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Juhaifa: I asked Ali, \"Do you have any Divine Revelation besides what is in the Quran?\" Ali replied, \"No, by Him Who caused the grain to split and created the soul, except for an understanding that Allah gives to a man regarding the Quran, and what is in this document.\" I asked, \"What is in this document?\" He said, \"The regulations of blood-money (Diyat), the freeing of captives, and the ruling that a Muslim should not be killed in retaliation for a disbeliever.\" [Reported by Al-Bukhari]. Ahmad, Abu Dawud, and An-Nasa'i reported it via another route from Ali, which includes: \"The lives of all Muslims are equal in value; the protection granted by the lowest of them is binding on all of them; they are one hand against others; and a believer should not be killed for a disbeliever, nor should a person with a covenant be killed during the term of his covenant.\""
      }
    },

    {
      "id": 999,
      "name": {
        "arabic": " وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ جَارِيَةً وُجَدَ رَأْسُهَا قَدْ رُضَّ بَيْنَ حَجَرَيْنِ, فَسَأَلُوهَا: مَنْ صَنَعَ بِكِ هَذَا? فُلَانٌ.‏ فُلَانٌ.‏ حَتَّى ذَكَرُوا يَهُودِيًّا.‏ فَأَوْمَأَتْ بِرَأْسِهَا, فَأُخِذَ اَلْيَهُودِيُّ, فَأَقَرَّ, فَأَمَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يُرَضَّ رَأْسُهُ بَيْنَ حَجَرَيْنِ.‏ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": " سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک لونڈی ایسی حالت میں پائی گئی کہ اس کا سر دو پتھروں کے درمیان رکھ کر کچل دیا گیا تھا۔ صحابہ رضی اللہ عنہم نے اس سے دریافت کیا کہ تمہارے ساتھ ایسا کس نے کیا ہے؟ پھر خود ہی کہا کہ فلاں نے، فلاں نے، اس طرح نام لیتے ہوئے ایک یہودی کے نام پر پہنچے تو اس نے سر کے اشارہ سے کہا۔ ہاں! یہودی گرفتار کر لیا گیا۔ اس نے اس جرم کا اقرار کیا تو رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ ”اس کا سر بھی دو پتھروں کے درمیان رکھ کر کچل دیا جائے۔“ (بخاری و مسلم) یہ الفاظ مسلم میں ہیں۔ ",
        "english": "Narrated Anas bin Malik (RA): A young girl was found with her head crushed between two stones. They asked her, \"Who did this to you? Was it so-and-so? Was it so-and-so?\" until they mentioned a Jew, and she nodded her head. The Jew was seized and he confessed, so Allah's Messenger (ﷺ) ordered that his head be crushed between two stones."
      }
    },

    {
      "id": 1000,
      "name": {
        "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏- رضى الله عنه ‏- { أَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ, فَأَتَوا اَلنِّبِيَّ ‏- صلى الله عليه وسلم ‏-فَلَمْ يَجْعَلْ لَهُمْ شَيْئًا.‏ } رَوَاهُ أَحْمَدُ, وَالثَّلَاثَةُ, بِإِسْنَادٍ صَحِيحٍ",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ فقراء لوگوں کے ایک غلام نے امراء لوگوں کے غلام کا کان کاٹ لیا تو یہ لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس آئے تو آپ صلی اللہ علیہ وسلم نے ان کیلئے کوئی چیز مقرر نہ فرمائی۔ اسے احمد اور تینوں نے صحیح سند سے روایت کیا ہے۔",
        "english": "Narrated ‘Imran bin Husain (RA): A slave belonging to poor people cut off the ear of a slave belonging to rich people. They came to the Prophet (ﷺ), but he did not appoint anything (compensation or retaliation) for them. [Reported by Ahmad and the three (Abu Dawud, An-Nasa'i, and Ibn Majah) with a Sahih chain]."
      }
    },

    {
      "id": 1001,
      "name": {
        "arabic": " وَعَنْ عَمْرِوِ بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; ‏- رضى الله عنه ‏- { أَنَّ رَجُلًا طَعَنَ رَجُلًا بِقَرْنٍ فِي رُكْبَتِهِ, فَجَاءَ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: أَقِدْنِي.‏ فَقَالَ: \"حَتَّى تَبْرَأَ\".‏ ثُمَّ جَاءَ إِلَيْهِ.‏ فَقَالَ: أَقِدْنِي, فَأَقَادَهُ, ثُمَّ جَاءَ إِلَيْهِ.‏ فَقَالَ: يَا رَسُولَ اَللَّهِ! عَرِجْتُ, فَقَالَ: \"قَدْ نَهَيْتُكَ فَعَصَيْتَنِي, فَأَبْعَدَكَ اَللَّهُ, وَبَطَلَ عَرَجُكَ\".‏ ثُمَّ نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"أَنْ يُقْتَصَّ مِنْ جُرْحٍ حَتَّى يَبْرَأَ صَاحِبُهُ\" } رَوَاهُ أَحْمَدُ, وَاَلدَّارَقُطْنِيُّ, وَأُعِلَّ بِالْإِرْسَالِ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ نے اپنے والد اور انہوں نے اپنے دادا سے روایت کیا ہے کہ ایک شخص نے دوسرے کے گھٹنے میں سینگ چبھو دیا تو وہ نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا مجھے اس سے قصاص لے کر دیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” زخم مندمل ہونے کے بعد آنا۔“ وہ پھر آپ صلی اللہ علیہ وسلم کے پاس آیا اور بولا مجھے قصاص دلوائیے آپ صلی اللہ علیہ وسلم نے اسے قصاص دلوایا اس کے بعد پھر آیا اور کہنے لگا اے اللہ کے رسول! میں لنگڑا ہو گیا ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” میں نے تجھے منع کیا تھا لیکن تو نے میری بات نہ مانی۔ اللہ تعالیٰ نے تجھے دور کر دیا اور تیرے لنگڑے پن کو باطل کر دیا۔“ پھر آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ ” زخموں کا قصاص اس وقت تک لینا ممنوع ہے کہ جب تک زخمی آدمی صحت مند و تندرست نہ ہو جائے۔“ اس روایت کو احمد اور دارقطنی نے روایت کیا ہے اور اسے مرسل ہونے کی وجہ سے معلول کہا ہے۔ ",
        "english": "Narrated 'Amr bin Shu'aib, on the authority of his father, from his grandfather (RA): A man stabbed another with a horn in his knee. He came to the Prophet (ﷺ) and said, \"Grant me retaliation.\" He (ﷺ) said, \"Until you are healed.\" Later, he came again and said, \"Grant me retaliation,\" so the Prophet (ﷺ) allowed him. Later he came back and said, \"O Messenger of Allah! I have become lame.\" He (ﷺ) said, \"I forbade you but you disobeyed me. May Allah keep you away, and your lameness is void (of further compensation).\" Then the Messenger of Allah (ﷺ) forbade that retaliation be taken for a wound until the victim is completely healed."
      }
    },

    {
      "id": 1002,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { اِقْتَتَلَتِ اِمْرَأَتَانِ مِنْ هُذَيْلٍ, فَرَمَتْ إِحْدَاهُمَا اَلْأُخْرَى بِحَجَرٍ, فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا, فَاخْتَصَمُوا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّ دِيَةَ جَنِينِهَا: غُرَّةٌ; عَبْدٌ أَوْ وَلِيدَةٌ, وَقَضَى بِدِيَةِ اَلْمَرْأَةِ عَلَى عَاقِلَتِهَا.‏ وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ.‏ فَقَالَ حَمَلُ بْنُ اَلنَّابِغَةِ اَلْهُذَلِيُّ: يَا رَسُولَ اَللَّهِ! كَيْفَ يَغْرَمُ مَنْ لَا شَرِبَ, وَلَا أَكَلَ, وَلَا نَطَقَ, وَلَا اِسْتَهَلَّ, فَمِثْلُ ذَلِكَ يُطَلُّ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- \"إِنَّمَا هَذَا مِنْ إِخْوَانِ اَلْكُهَّانِ\"; مِنْ أَجْلِ سَجْعِهِ اَلَّذِي سَجَعَ.‏ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ہذیل قبیلہ کی دو عورتیں آپس میں لڑ پڑیں اور ایک نے دوسری پر پتھر دے مارا۔ اس پتھر سے وہ عورت اور اس کے پیٹ کا بچہ مر گیا تو اس کے وارث مقدمہ نبی کریم صلی اللہ علیہ وسلم کی عدالت میں لائے۔ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا ” جنین کے بدلے ایک لونڈی یا غلام ہے اور عورت کے بدلے قاتل کے وارثوں پر دیت عائد فرما دی اور اس کے خون بہا کا وارث اس کی اولاد کو بنایا اور ان وارثوں کو بھی جو ان کے ساتھ تھے۔“ حمل بن نابغہ ھذلی نے کہا ” اے اللہ کے رسول ( صلی اللہ علیہ وسلم ) ہم ایسے بچے کا بدلہ کیسے دیں جس نے نہ پیا، نہ کھایا، نہ بولا اور نہ چیخا۔ اس طرح کا حکم تو قابل اعتبار نہیں۔“ آپ صلی اللہ علیہ وسلم نے فرمایا ” یہ تو کاہنوں کا بھائی معلوم ہوتا ہے کیونکہ اس نے تو کاہنوں کی سی قافیہ بندی کی ہے۔“",
        "english": "Narrated Abu Hurairah (RA): Two women of the tribe of Hudhail fought with each other, and one of them threw a stone at the other, killing her and what was in her womb. They took the matter to Allah's Messenger (ﷺ), who gave a verdict that the Diyat (blood-money) for her unborn child was a 'Ghurra' (a male or female slave). He also decided that the blood-money for the woman should be paid by her paternal relatives (Asaba). He made her children and those with them her heirs. Hamal bin an-Nabigha al-Hudhaili said, \"O Allah's Messenger! How should I pay blood-money for one who has not drunk, nor eaten, nor spoken, nor cried? Such a case should be dismissed.\" Allah's Messenger (ﷺ) said, \"He is only one of the brothers of the soothsayers,\" because of the rhymed speech he used. [Agreed upon]."
      }
    },

    {
      "id": 1003,
      "name": {
        "arabic": " وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلرُّبَيِّعَ بِنْتَ اَلنَّضْرِ ‏-عَمَّتَهُ‏- كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ, فَطَلَبُوا إِلَيْهَا اَلْعَفْوَ, فَأَبَوْا, فَعَرَضُوا اَلْأَرْشَ, فَأَبَوْا, فَأَتَوْا رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَأَبَوْا إِلَّا اَلْقِصَاصَ, فَأَمَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِالْقِصَاصِ, فَقَالَ أَنَسُ بْنُ اَلنَّضْرِ: يَا رَسُولَ اَللَّهِ! أَتُكْسَرُ ثَنِيَّةُ اَلرُّبَيِّعِ? لَا, وَاَلَّذِي بَعَثَكَ بِالْحَقِّ, لَا تُكْسَرُ ثَنِيَّتُهَا, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"يَا أَنَسُ! كِتَابُ اَللَّهِ: اَلْقِصَاصُ\".‏ فَرَضِيَ اَلْقَوْمُ, فَعَفَوْا, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: \"إِنَّ مِنْ عِبَادِ اَللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اَللَّهِ لَأَبَرَّهُ\".‏ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ ",
        "urdu": " سیدنا انس رضی اللہ عنہ سے روایت ہے کہ ان کی پھوپھی ربیع بنت نضر نے ایک انصاری لڑکی کے دانت توڑ دئیے۔ ربیع کے رشتہ داروں نے اس سے معافی طلب کی تو انہوں نے انکار کر دیا۔ پھر انہوں نے دیت دینے کی پیش کش کی۔ اسے بھی انہوں نے رد کر دیا اور رسول اللہ صلی اللہ علیہ وسلم کی عدالت میں آئے اور قصاص کا مطالبہ کیا اور قصاص کے سوا کسی بھی چیز کو لینے سے انکار کر دیا تو رسول اللہ صلی اللہ علیہ وسلم نے قصاص کا فیصلہ فرما دیا۔ یہ سن کر سیدنا انس بن نضر نے عرض کیا اے اللہ کے رسول! کیا ربیع کا دانت توڑا جائے گا؟ نہیں، اس ذات اقدس کی قسم جس نے آپ صلی اللہ علیہ وسلم کو حق دے کر مبعوث فرمایا ہے اس کا دانت نہیں توڑا جائے گا۔ یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اے انس! اللہ کا نوشتہ تو قصاص ہی ہے۔ اتنے میں وہ لوگ اس پر رضامند ہو گئے اور پھر معافی دے دی۔“ پس رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اللہ کے بندے ایسے بھی ہیں کہ اگر وہ اللہ کی قسم کھا لیتے ہیں تو اللہ تعالیٰ ان کی قسم کو پورا فرما دیتا ہے۔“ (بخاری و مسلم) اور یہ الفاظ بخاری کے ہیں۔ ",
        "english": "Narrated Anas (RA): His paternal aunt Ar-Rubai' bint an-Nadr broke the incisor tooth of a girl. Her people (Ar-Rubai's family) asked the girl's people to forgive her, but they refused. Then they offered them the Arsh (blood money for a wound), but they refused. So they came to Allah's Messenger (ﷺ) and they refused everything except retaliation (Qisas). So Allah's Messenger (ﷺ) ordered Qisas. Anas bin an-Nadr (RA) said, \"O Messenger of Allah, will Ar-Rubai's incisor tooth be broken? No, by Him Who has sent you with the Truth, her incisor tooth will not be broken!\" Thereupon Allah's Messenger (ﷺ) said, \"O Anas, the Book of Allah ordains Qisas.\" Then the people (of the girl) became pleased and forgave her. Then Allah's Messenger (ﷺ) said, \"Among the servants of Allah there are some who, if they were to take an oath by Allah, He would fulfill it.\""
      }
    },

    {
      "id": 1004,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قُتِلَ فِي عِمِّيَّا أَوْ رِمِّيَّا بِحَجَرٍ, أَوْ سَوْطٍ, أَوْ عَصًا, فَعَلَيْهِ عَقْلُ اَلْخَطَإِ, وَمِنْ قُتِلَ عَمْدًا فَهُوَ قَوَدٌ, وَمَنْ حَالَ دُونَهُ فَعَلَيْهِ لَعْنَةُ اَللَّهِ } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَابْنُ مَاجَهْ, بِإِسْنَادٍ قَوِيٍّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جو شخص اندھا دھند لڑائی میں قتل ہو جائے یا پتھر پھینکنے سے قتل ہو جائے یا کوڑے اور لاٹھی سے مر جائے تو اس کی دیت، خطا کی دیت ہو گی۔ جو شخص عمداً قتل کیا جائے گا تو اس کا قصاص ہے اور جو شخص قصاص لینے میں حائل ہوا تو ایسے شخص پر اللہ کی لعنت ہے۔“ اس حدیث کو ابوداؤد اور نسائی نے قوی سند سے روایت کیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: \"Whoever is killed in a blind fray or by stones thrown (at one another), or by a whip or a stick, his blood-money is that for accidental homicide. But whoever is killed intentionally, he is subject to retaliation (Qisas). And whoever stands in the way of it (retaliation), on him is the curse of Allah.\""
      }
    },

    {
      "id": 1005,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا أَمْسَكَ اَلرَّجُلُ اَلرَّجُلَ, وَقَتَلَهُ اَلْآخَرُ, يُقْتَلُ اَلَّذِي قَتَلَ, وَيُحْبَسُ اَلَّذِي أَمْسَكَ } رَوَاهُ اَلدَّارَقُطْنِيُّ مَوْصُولًا وَمُرْسَلًا, وَصَحَّحَهُ اِبْنُ اَلْقَطَّانِ, وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّ اَلْبَيْهَقِيَّ رَجَّحَ اَلْمُرْسَلَ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جب ایک آدمی دوسرے آدمی کو پکڑ رکھے اور دوسرا آدمی پکڑے ہوئے آدمی کو قتل کر دے تو قاتل کو قتل کیا جائے گا اور پکڑنے والے کو قید کر دیا جائے گا۔“ اسے دارقطنی نے موصولاً اور مرسلاً روایت کیا ہے اور ابن قطان نے اسے صحیح قرار دیا۔ اس کے راوی ثقہ ہیں۔ مگر بیہقی نے اس کے مرسل ہونے کو ترجیح دی ہے۔ ",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) said: 'When a man holds another man and a third one kills him, the one who killed is to be killed, and the one who held him is to be imprisoned.'"
      }
    },

    {
      "id": 1006,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَتَلَ مُسْلِمًا بِمَعَاهِدٍ.‏ وَقَالَ: \"أَنَا أَوْلَى مَنْ وَفَى بِذِمَّتِهِ } .‏ أَخْرَجَهُ عَبْدُ اَلرَّزَّاقِ هَكَذَا مُرْسَلًا.‏ وَوَصَلَهُ اَلدَّارَقُطْنِيُّ, بِذِكْرِ اِبْنِ عُمَرَ فِيهِ, وَإِسْنَادُ اَلْمَوْصُولِ وَاهٍ",
        "urdu": "سیدنا عبدالرحمٰن بن بیلمانی سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک معاہد (غیر مسلم شہری) کے بدلے ایک مسلمان کو قصاص میں قتل کیا اور فرمایا: ”میں اپنے عہد کو پورا کرنے والوں میں سب سے زیادہ حقدار ہوں۔“ اسے عبدالرزاق نے مرسل روایت کیا ہے اور دارقطنی نے اسے ابن عمر کے واسطے سے موصل بیان کیا ہے، مگر اس کی موصل سند نہایت کمزور ہے۔",
        "english": "Narrated ‘Abdur-Rahman bin al-Bailamani: The Prophet (ﷺ) killed a Muslim in retaliation for a Mu'ahad (a non-Muslim living under a peace treaty) and said, \"I am the most bound of those to fulfill their obligations.\" [Reported by ‘Abdur-Razzaq as Mursal. Ad-Daraqutni reported it as Mawsul (connected) through Ibn 'Umar, but its connected chain is very weak]."
      }
    },

    {
      "id": 1007,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قُتِلَ غُلَامٌ غِيلةً، فَقَالَ عُمَرُ: لَوْ اِشْتَرَكَ فِيهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ بِهِ } .‏ أَخْرَجَهُ اَلْبُخَارِيُّ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ دھوکہ سے ایک غلام کو قتل کر دیا گیا۔ تو سیدنا عمر رضی اللہ عنہ نے فرمایا ” اگر اس کے قتل میں سارے اہل صنعاء شریک ہوتے تو میں ان سب کو قتل کر ڈالتا۔“ (بخاری)",
        "english": "Narrated Ibn 'Umar (RA): A young boy was killed by trickery (Ghilah). 'Umar (RA) said: 'If all the people of San'a' had collectively taken part in it, I would have killed them all in retaliation.'"
      }
    },

    {
      "id": 1008,
      "name": {
        "arabic": "وَعَنْ أَبِي شُرَيْحٍ اَلْخُزَاعِيِّ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ فَمَنْ قُتِلَ لَهُ قَتِيلٌ بَعْدَ مَقَالَتِي هَذِهِ, فَأَهْلُهُ بَيْنَ خِيَرَتَيْنِ: إِمَّا أَنْ يَأْخُذُوا اَلْعَقْلِ.‏ أَوْ يَقْتُلُوا } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ وَأَصْلُهُ فِي \"اَلصَّحِيحَيْنِ\" مِنْ حَدِيثِ أَبِي هُرَيْرَةَ بِمَعْنَاهُ",
        "urdu": "سیدنا ابوشریح خزاعی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” میرے اس خطبہ کے بعد اگر کسی کا کوئی آدمی مارا جائے تو متوفی کے ورثاء کو دو اختیار ہیں یا تو دیت لے لیں یا قاتل کو مقتول کے بدلہ میں قتل کر دیں۔“ اسے ابوداؤد اور نسائی نے روایت کیا ہے اور اس روایت کا اصل اس کے ہم معنی صحیحین میں سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے۔",
        "english": "Narrated Abu Shuraih al-Khuza'i (RA): Allah's Messenger (ﷺ) said: \"If anyone has a relative killed after this speech of mine, his family has a choice between two options: either they take blood-money (Diyat) or they kill (the murderer in retaliation).\" [Reported by Abu Dawud and An-Nasa'i; its origin is in the Sahihain from the Hadith of Abu Hurairah (RA)]."
      }
    }
  ]
}
