{
  "chapId": 41,
  "bookId": 6,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 645,
    "to": 647
  },
  "hadiths": [
    {
      "id": 645,
      "name": {
        "arabic": "عَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَدْ أُحْصِرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَحَلَقَ رَأْسَهُ وَجَامَعَ نِسَاءَهُ, وَنَحَرَ هَدْيَهُ, حَتَّى اِعْتَمَرَ عَامًا قَابِلًا } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو (حدیبیہ کے مقام پر) بیت اللہ تک پہنچنے سے روک دیا گیا تو آپ صلی اللہ علیہ وسلم نے اپنا سر منڈوایا، اپنی قربانی ذبح کی اور اپنی ازواج سے تعلق قائم کیا، یہاں تک کہ آپ صلی اللہ علیہ وسلم نے اگلے سال اس کی قضا میں عمرہ کیا۔",
        "english": "Narrated Ibn 'Abbas (R.A): Allah's Messenger (peace be upon him) was once prevented from reaching the Ka'bah, so he shaved his head, had sexual relations with his wives and sacrificed his animal (Hady), until he performed 'Umrah in the following year."
      }
    },

    {
      "id": 646,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ اَلنَّبِيُّ صلى الله عليه وسلم عَلَى ضُبَاعَةَ بِنْتِ اَلزُّبَيْرِ بْنِ عَبْدِ اَلْمُطَّلِبِ رَضِيَ اَللَّهُ عَنْهَا, فَقَالَتْ: يَا رَسُولَ اَللَّهِ! إِنِّي أُرِيدُ اَلْحَجَّ, وَأَنَا شَاكِيَةٌ، فَقَالَ اَلنَّبِيُّ صلى الله عليه وسلم: حُجِّي وَاشْتَرِطِي: أَنَّ مَحَلِّي حَيْثُ حَبَسْتَنِي } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم ضباعہ بنت زبیر بن عبدالمطلب رضی اللہ عنہا کے ہاں تشریف لے گئے۔ انہوں نے عرض کیا: اے اللہ کے رسول! میں حج کرنے کا ارادہ رکھتی ہوں مگر میں بیمار ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں فرمایا: ”حج کرو مگر یہ شرط کر لو کہ (اے اللہ!) میرے احرام کھولنے کی جگہ وہی ہو گی جہاں تو نے مجھے (بیماری یا کسی رکاوٹ کی وجہ سے) روک دیا۔“",
        "english": "Narrated 'Aisha (RA): The Prophet (ﷺ) entered upon Duba'a bint az-Zubair bin 'Abdul-Muttalib (RA) and she said, 'O Messenger of Allah, I intend to perform Hajj but I am ill.' The Prophet (ﷺ) said, 'Perform Hajj and make a condition, saying: O Allah, my place of coming out of Ihram shall be where You hinder me.'"
      }
    },

    {
      "id": 647,
      "name": {
        "arabic": "وَعَنْ عِكْرِمَةَ, عَنْ اَلْحَجَّاجِ بْنِ عَمْرٍو اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ كُسِرَ, أَوْ عُرِجَ, فَقَدَ حَلَّ وَعَلَيْهِ اَلْحَجُّ مِنْ قَابِلٍ قَالَ عِكْرِمَةُ.‏ فَسَأَلْتُ اِبْنَ عَبَّاسٍ وَأَبَا هُرَيْرَةَ عَنْ ذَلِكَ? فَقَالَا: صَدَقَ } رَوَاهُ اَلْخَمْسَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا حجاج بن عمرو انصاری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”جس (محرم) کی ہڈی ٹوٹ جائے یا وہ لنگڑا (زخمی) ہو جائے، تو وہ حلال ہو گیا (یعنی اس کا احصار ہو گیا) اور اس پر اگلے سال حج کرنا لازم ہے۔“ عکرمہ رحمہ اللہ کہتے ہیں کہ میں نے اس بارے میں ابن عباس اور ابوہریرہ رضی اللہ عنہما سے پوچھا تو انہوں نے کہا: حجاج نے سچ کہا ہے۔ (اسے پانچوں نے روایت کیا اور ترمذی نے اسے حسن قرار دیا)۔",
        "english": "Narrated Al-Hajjaj bin 'Amr al-Ansari (RA): Allah's Messenger (ﷺ) said: \"Whoever suffers a broken bone or becomes lame (due to injury) has indeed exited the state of Ihram (because of being prevented), and he must perform Hajj the following year.\" 'Ikrimah (RA) said: I asked Ibn 'Abbas and Abu Hurairah (RA) about that and they both said: \"He (Hajjaj) has spoken the truth.\" [Reported by the Five; At-Tirmidhi graded it Hasan]."
      }
    }
  ]
}
