{
  "chapId": 98,
  "bookId": 14,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1201,
    "to": 1209
  },
  "hadiths": [
    {
      "id": 1201,
      "name": {
        "arabic": "عَنْ زَيْدِ بْنِ خَالِدٍ اَلْجُهَنِيِّ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَلَا أُخْبِرُكُمْ بِخَيْرِ اَلشُّهَدَاءِ? اَلَّذِي يَأْتِي بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” کیا میں تمہیں خبر نہ دوں کہ بہترین گواہ کون سے ہیں؟ وہ جو گواہی طلب کیے جانے سے پہلے خود ہی گواہی دے۔“ (مسلم)",
        "english": "Narrated Zaid bin Khalid al-Juhani (RA): The Messenger of Allah (ﷺ) said: 'Shall I not inform you of the best of witnesses? It is the one who brings his testimony before he is asked for it.'"
      }
    },

    {
      "id": 1202,
      "name": {
        "arabic": " وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"إِنَّ خَيْرَكُمْ قَرْنِي, ثُمَّ اَلَّذِينَ يَلُونَهُمْ, ثُمَّ اَلَّذِينَ يَلُونَهُمْ, ثُمَّ يَكُونُ قَوْمٌ يَشْهَدُونَ وَلَا يُسْتَشْهَدُونَ, وَيَخُونُونَ وَلَا يُؤْتَمَنُونَ, وَيَنْذُرُونَ وَلَا يُوفُونَ, وَيَظْهَرُ فِيهِمْ اَلسِّمَنُ\" } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” میرا زمانہ تمہارے تمام زمانوں سے بہتر ہے۔ پھر اس کے بعد والا، پھر اس کے بعد والا، اس کے بعد ایسے لوگ پیدا ہوں گے جو گواہی دیں گے اور ان سے گواہی طلب نہیں کی جائے گی۔ وہ خائن ہوں گے، امین نہیں ہوں گے۔ نذر مانیں گے مگر پوری نہیں کریں گے اور ان میں موٹاپا ظاہر و نمایاں ہو گا۔“ (بخاری و مسلم) ",
        "english": "Narrated 'Imran bin Husain (RA): Allah's Messenger (ﷺ) said, \"The best of you are my generation, then those who follow them, then those who follow them. After that, there will come a people who will bear witness without being asked to do so, they will be treacherous and not be trusted, they will make vows and not fulfill them, and obesity will appear among them.\""
      }
    },

    {
      "id": 1203,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { لَا تَجُوزُ شَهَادَةُ خَائِنٍ, وَلَا خَائِنَةٍ, وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ, وَلَا تَجُوزُ شَهَادَةُ اَلْقَانِعِ لِأَهْلِ اَلْبَيْتِ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خائن مرد اور خائن عورت کی گواہی جائز نہیں، اور نہ ہی کینہ پرور شخص کی اپنے بھائی کے خلاف گواہی جائز ہے، اور نہ ہی گھر کے زیر کفالت خادم کی گواہی اپنے مالکان کے حق میں جائز ہے۔“ (احمد، ابوداؤد)",
        "english": "Narrated 'Abdullah bin 'Amr (RA): Allah's Messenger (ﷺ) said: 'The testimony of a treacherous man or woman is not admissible, nor is that of one who harbors rancor against his brother, nor is the testimony of a dependent (servant) in favor of the people of the house (his masters).'"
      }
    },

    {
      "id": 1204,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ\" } رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَه",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ ” صحرا نورد بدو (دیہاتی) کی گواہی شہری کے حق میں قابل قبول نہیں۔“ (ابوداؤد و ابن ماجہ) ",
        "english": "Narrated Abu Hurairah (RA): That he heard Allah's Messenger (ﷺ) saying, \"The testimony of a nomad (bedouin) against a dweller of a town is not permissible.\""
      }
    },

    {
      "id": 1205,
      "name": {
        "arabic": "وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- أَنَّهُ خَطَبَ فَقَالَ: إِنَّ أُنَاسًا كَانُوا يُؤْخَذُونَ بِالْوَحْيِ فِي عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- وَإِنَّ اَلْوَحْيَ قَدْ اِنْقَطَعَ, وَإِنَّمَا نَأْخُذُكُمُ اَلْآنَ بِمَا ظَهَرَ لَنَا مِنْ أَعْمَالِكُمْ",
        "urdu": "سیدنا عمر بن خطاب رضی اللہ عنہ سے مروی ہے کہ انہوں نے خطبہ دیا اور فرمایا کہ ” عہد نبوی صلی اللہ علیہ وسلم میں لوگوں کا مواخذہ وحی کے ذریعہ ہوتا تھا۔ اب وحی کا نزول بند ہو چکا ہے اب ہم تمہارا مواخذہ تمہارے ان اعمال کے مطابق کریں گے جو ہمیں بظاہر نظر آئیں گے۔“ (بخاری)",
        "english": "Narrated Umar bin Al-Khattab (RA) during a sermon: 'In the time of the Messenger of Allah (ﷺ), people were judged by Revelation (Wahy), but now Revelation has ceased. We now judge you by what is apparent to us from your deeds.'"
      }
    },

    {
      "id": 1206,
      "name": {
        "arabic": "وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ عَدَّ شَهَادَةَ اَلزُّورِ فِي أَكْبَرِ اَلْكَبَائِرِ مُتَّفَقٌ عَلَيْهِ فِي حَدِيثٍ",
        "urdu": "سیدنا ابوبکرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے جھوٹی گواہی کو بڑے گناہوں (کبیرہ گناہوں) میں شمار کیا ہے۔ (بخاری و مسلم کی لمبی حدیث میں ہے)۔",
        "english": "Narrated Abu Bakra (RA): The Prophet (ﷺ) mentioned false testimony among the greatest of the major sins. (Agreed upon, within a longer Hadith)."
      }
    },

    {
      "id": 1207,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم قَالَ لِرَجُلٍ: \"تَرَى اَلشَّمْسَ ?\" قَالَ: نَعَمْ.‏ قَالَ: \"عَلَى مِثْلِهَا فَاشْهَدْ, أَوْ دَعْ\"",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی سے فرمایا: ”کیا تو سورج کو دیکھتا ہے؟“ اس نے عرض کیا: جی ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا: ”اگر اس طرح کی (واضح اور روشن) شہادت ہو تو گواہی دے ورنہ چھوڑ دے۔“",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said to a man, 'Do you see the sun?' He replied, 'Yes.' He (ﷺ) then said, 'Give testimony on the like of it (on such clear evidence), or else leave it.'"
      }
    },

    {
      "id": 1208,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَضَى بِيَمِينٍ وَشَاهِدٍ } أَخْرَجَهُ مُسْلِمٌ.‏ وَأَبُو دَاوُدَ.‏ وَالنَّسَائِيُّ وَقَالَ: إِسْنَادُ [ هُ ] جَيِّد ٌ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما ہی اس کے راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک قسم اور ایک گواہ کی بنیاد پر فیصلہ فرمایا۔ اسے مسلم، ابوداؤد اور نسائی نے روایت کیا ہے اور کہا ہے کہ اس کی سند عمدہ ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) passed a judgment on the basis of an oath (from the claimant) and a single witness."
      }
    },

    {
      "id": 1209,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- مِثْلَهُ.‏ أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے بھی اسی طرح کی ایک روایت ہے (جس میں ہے کہ رسول اللہ ﷺ نے ایک گواہ اور قسم کے ساتھ فیصلہ فرمایا)۔ اسے ابوداؤد اور ترمذی نے نکالا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Abu Hurairah (RA): A similar tradition was reported. (Meaning: The Prophet ﷺ passed a judgment on the basis of an oath along with a single witness). [Reported by Abu Dawud and At-Tirmidhi, and Ibn Hibban graded it Sahih]."
      }
    }
  ]
}
