{
  "chapId": 44,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 695,
    "to": 711
  },
  "hadiths": [
    {
      "id": 695,
      "name": {
        "arabic": "عَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-آكِلَ اَلرِّبَا, وَمُوكِلَهُ, وَكَاتِبَهُ, وَشَاهِدَيْهِ, وَقَالَ: \" هُمْ سَوَاءٌ \" } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سود کھانے والے (لینے والے)، سود کھلانے والے (دینے والے)، اس کے لکھنے والے (کلرک) اور اس کے دونوں گواہوں پر لعنت فرمائی ہے، اور فرمایا: ”وہ سب (گناہ میں) برابر ہیں۔“",
        "english": "Narrated Jabir bin 'Abdullah (R.A): Allah's Messenger (peace be upon him) cursed the one who accepted usury (Riba), the one who paid it, the one who recorded it, and the two witnesses to it, saying, \"They are all alike (in sin).\""
      }
    },

    {
      "id": 696,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلرِّبَا ثَلَاثَةٌ وَسَبْعُونَ بَابًا أَيْسَرُهَا مِثْلُ أَنْ يَنْكِحَ اَلرَّجُلُ أُمَّهُ, وَإِنَّ أَرْبَى اَلرِّبَا عِرْضُ اَلرَّجُلِ اَلْمُسْلِمِ } رَوَاهُ اِبْنُ مَاجَهْ مُخْتَصَراً, وَالْحَاكِمُ بِتَمَامِهِ وَصَحَّحَهُ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”سود کے تہتر درجے (یا ابواب) ہیں۔ سب سے کم تر درجہ اس گناہ کے مثل ہے کہ کوئی آدمی اپنی ماں کے ساتھ نکاح کرے، اور سب سے بڑھ کر سود کسی مسلمان کی آبرو ریزی کرنا ہے۔“ اسے ابن ماجہ نے مختصراً اور حاکم نے مکمل بیان کیا ہے اور اسے صحیح قرار دیا ہے۔",
        "english": "Narrated 'Abdullah bin Mas'ud (RA): The Prophet (ﷺ) said: 'Usury (Riba) has seventy-three gates (types). The least of them is as bad as a man marrying his own mother, and the worst form of usury is violation of a Muslim man’s honor.'"
      }
    },

    {
      "id": 697,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَبِيعُوا اَلذَّهَبَ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ, وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ, وَلَا تَبِيعُوا اَلْوَرِقَ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ, وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ, وَلَا تَبِيعُوا مِنْهَا غَائِباً بِنَاجِزٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سونے کو سونے کے بدلے میں فروخت نہ کرو مگر برابر برابر، اور ایک دوسرے پر زیادتی نہ کرو۔ اور چاندی کو چاندی کے بدلے میں فروخت نہ کرو مگر برابر برابر، اور ایک دوسرے پر زیادتی نہ کرو۔ اور ان میں سے ادھار (غیر موجود) کو نقد (موجود) کے بدلے فروخت نہ کرو۔“",
        "english": "Narrated Abu Sa'id al-Khudri (R.A): Allah's Messenger (peace be upon him) said: \"Do not sell gold for gold except like for like, and do not increase one part over another; and do not sell silver for silver except like for like, and do not increase one part over another; and do not sell that which is away (from the spot) for that which is present.\""
      }
    },

    {
      "id": 698,
      "name": {
        "arabic": "وَعَنْ عُبَادَةَ بْنِ اَلصَّامِتِ رَضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { اَلذَّهَبُ بِالذَّهَبِ, وَالْفِضَّةُ بِالْفِضَّةِ, وَالْبُرُّ بِالْبُرِّ, وَالشَّعِيرُ بِالشَّعِيرِ, وَالتَّمْرُ بِالتَّمْرِ, وَالْمِلْحُ بِالْمِلْحِ, مِثْلًا بِمِثْلٍ, سَوَاءً بِسَوَاءٍ, يَدًا بِيَدٍ, فَإِذَا اِخْتَلَفَتْ هَذِهِ اَلْأَصْنَافُ فَبِيعُوا كَيْفَ شِئْتُمْ إِذَا كَانَ يَدًا بِيَدٍ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”سونا، سونے کے عوض اور چاندی، چاندی کے عوض اور گندم، گندم کے عوض اور جو، جو کے عوض اور کھجور، کھجور کے عوض اور نمک، نمک کے عوض ایک دوسرے کی طرح برابر برابر اور نقد بنقد (فروخت کئے جائیں) اگر اجناس میں اختلاف ہو تو پھر جس طرح چاہیں فروخت کریں، مگر قیمت کی ادائیگی نقد ہو۔“",
        "english": "Narrated 'Ubada bin as-Samit (RA): Allah's Messenger (ﷺ) said: 'Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like and equal for equal, payment being made hand to hand. If these classes differ, then sell as you wish if payment is made hand to hand.'"
      }
    },

    {
      "id": 699,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلذَّهَبُ بِالذَّهَبِ وَزْناً بِوَزْنٍ مِثْلًا بِمِثْلٍ، وَالْفِضَّةُ بِالْفِضَّةِ وَزْناً بِوَزْنٍ مِثْلًا بِمِثْلٍ, فَمَنْ زَادَ أَوْ اِسْتَزَادَ فَهُوَ رِبًا } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سونا سونے کے بدلے میں وزن میں برابر برابر اور ایک جیسا ہو، اور چاندی چاندی کے بدلے میں وزن میں برابر برابر اور ایک جیسی ہو۔ پس جس نے (وزن میں) اضافہ کیا یا اضافے کا مطالبہ کیا تو وہ سود ہے۔“",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) said: \"Gold is to be paid for with gold, raw weight and like for like, and silver is to be paid for with silver, raw weight and like for like. He who made an addition or demanded an addition (in weight), then it is usury (Riba).\""
      }
    },

    {
      "id": 700,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ, وَأَبِي هُرَيْرَةَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم اِسْتَعْمَلَ رَجُلًا عَلَى خَيْبَرٍ, فَجَاءَهُ بِتَمْرٍ جَنِيبٍ, فَقَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: \" أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا? \" فَقَالَ: لَا, وَاَللَّهِ يَا رَسُولَ اَللَّهِ, إِنَّا لَنَأْخُذُ اَلصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالثَّلَاثَةِ، فَقَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: \" لَا تَفْعَلْ، بِعِ اَلْجَمْعَ بِالدَّرَاهِمِ, ثُمَّ اِبْتَعْ بِالدَّرَاهِمِ جَنِيبًا \" وَقَالَ فِي اَلْمِيزَانِ مِثْلَ ذَلِكَ.‏ مُتَّفَقٌ عَلَيْهِ وَلِمُسْلِمٍ: \" وَكَذَلِكَ اَلْمِيزَانُ \"",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ اور سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو خیبر پر عامل مقرر کیا۔ پس وہ آپ صلی اللہ علیہ وسلم کی خدمت میں بہت عمدہ کھجوریں (جنیب) لے کر حاضر ہوا۔ رسول اللہ صلی اللہ علیہ وسلم نے اس سے دریافت فرمایا کہ ”کیا خیبر میں پیدا ہونے والی سب کھجوریں اسی طرح کی ہوتی ہیں؟“ اس نے عرض کیا، نہیں! اے اللہ کے رسول! خدا کی قسم! ہم (دوسری گھٹیا) کھجوریں دو صاع اور تین صاع دے کر یہ عمدہ کھجوریں ایک صاع لیتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”ایسا نہ کرو۔ گھٹیا کھجوروں کو دراہم کے عوض فروخت کر کے (پھر ان) درہموں کے عوض عمدہ کھجوریں خریدو“ اور فرمایا ”تولنے والی اشیاء بھی اسی کی مانند ہیں۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Sa'id al-Khudri and Abu Hurairah (RA): Allah's Messenger (ﷺ) appointed a man as governor of Khaibar, and he brought him some high-quality dates (Janib). Allah's Messenger (ﷺ) asked, 'Are all the dates of Khaibar like this?' He replied, 'No, by Allah, O Messenger of Allah! We take one Sa' of these for two Sa's of (common) dates, and two Sa's for three.' Thereupon Allah's Messenger (ﷺ) said, 'Do not do that. Sell the mixed quality dates for Dirhams and then buy the high-quality dates with the Dirhams.' He also said that anything weighed is treated similarly."
      }
    },

    {
      "id": 701,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ اَلصُّبْرَةِ مِنَ اَلتَّمْرِ لا يُعْلَمُ مَكِيلُهَا بِالْكَيْلِ اَلْمُسَمَّى مِنَ اَلتَّمْرِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کھجور کے ایسے ڈھیر کو جس کی مقدار (ناپ) معلوم نہ ہو، کھجوروں کی ایک معلوم اور معین مقدار کے بدلے فروخت کرنے سے منع فرمایا ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (R.A): Allah's Messenger (peace be upon him) forbade the sale of a heap of dates whose measurement (volume) is unknown, in exchange for a specified volume of dates."
      }
    },

    {
      "id": 702,
      "name": {
        "arabic": "وَعَنْ مَعْمَرِ بْنِ عَبْدِ اَللَّهِ ‏- رضى الله عنه ‏- قَالَ: إِنِّي كُنْتُ أَسْمَعُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { اَلطَّعَامُ بِالطَّعَامِ مِثْلاً بِمِثْلٍ } وَكَانَ طَعَامُنَا يَوْمَئِذٍ اَلشَّعِيرَ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا معمر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا کرتا تھا کہ ”طعام (غلہ) کا تبادلہ طعام کے ساتھ برابر برابر (ایک جیسی مقدار میں) ہو۔“ اور ان دنوں ہمارا کھانا 'جو' ہوتا تھا۔",
        "english": "Narrated Ma'mar bin 'Abdullah (RA): I used to hear Allah's Messenger (ﷺ) saying: 'Food for food must be exchanged like for like (in equal quantity).' And our food in those days was barley."
      }
    },

    {
      "id": 703,
      "name": {
        "arabic": "وَعَنْ فَضَالَةَ بْنِ عُبَيْدٍ ‏- رضى الله عنه ‏- قَالَ: { اِشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً بِاِثْنَيْ عَشَرَ دِينَاراً, فِيهَا ذَهَبٌ وَخَرَزٌ، فَفَصَلْتُهَا فَوَجَدْتُ فِيهَا أَكْثَرَ مِنْ اِثْنَيْ عَشَرَ دِينَاراً, فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \" لَا تُبَاعُ حَتَّى تُفْصَلَ \" } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا فضالہ بن عبید رضی اللہ عنہ سے روایت ہے کہ میں نے خیبر (کی فتح) کے دن ایک ہار بارہ دینار میں خریدا جس میں سونا اور نگینے (موتی) جڑے ہوئے تھے۔ پھر میں نے انہیں الگ الگ کیا تو اس میں بارہ دینار سے زائد کا سونا نکلا۔ میں نے اس کا ذکر نبی کریم ﷺ سے کیا تو آپ ﷺ نے فرمایا: ”جب تک ان کو الگ الگ نہ کر لیا جائے، اسے فروخت نہ کیا جائے۔“",
        "english": "Narrated Fadalah bin 'Ubaid (R.A): On the day of Khaibar, I bought a necklace for twelve Dinars. It contained gold and gems. I separated them and found that the gold was worth more than twelve Dinars. I mentioned that to the Prophet (peace be upon him) and he said, \"It (the necklace) must not be sold until its contents are separated.\""
      }
    },

    {
      "id": 704,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضي الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ اَلْجَارُودِ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے حیوان کو حیوان کے بدلے میں ادھار فروخت کرنا ممنوع قرار دیا ہے۔ اسے پانچوں نے روایت کیا ہے۔ ترمذی اور ابن جارود نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Samura bin Jundub (RA): The Prophet (ﷺ) forbade the sale of an animal for an animal on credit."
      }
    },

    {
      "id": 705,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِذَا تَبَايَعْتُمْ بِالْعِينَةِ, وَأَخَذْتُمْ أَذْنَابَ اَلْبَقَرِ, وَرَضِيتُمْ بِالزَّرْعِ, وَتَرَكْتُمْ اَلْجِهَادَ, سَلَّطَ اَللَّهُ عَلَيْكُمْ ذُلًّا لَا يَنْزِعُهُ حَتَّى تَرْجِعُوا إِلَى دِينِكُمْ } رَوَاهُ أَبُو دَاوُدَ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جب تم عینہ (سودی تجارت) کرنے لگو گے، اور بیلوں کی دمیں پکڑ لو گے (یعنی صرف کھیتی باڑی میں مگن ہو جاؤ گے)، اور زراعت ہی پر راضی ہو جاؤ گے، اور جہاد کو چھوڑ دو گے، تو اللہ تعالیٰ تم پر ایسی ذلت مسلط کر دے گا جسے اس وقت تک تم سے دور نہیں کرے گا جب تک کہ تم اپنے دین کی طرف واپس نہ لوٹ آؤ۔“",
        "english": "Narrated Ibn 'Umar (R.A): I heard Allah's Messenger (peace be upon him) saying: \"When you enter into the 'Inah transaction (a form of usurious sale), and follow the tails of oxen (farming), and become content with agriculture, and give up Jihad (struggle in the way of Allah), Allah will make disgrace prevail over you and will not withdraw it until you return to your religion.\""
      }
    },

    {
      "id": 706,
      "name": {
        "arabic": "وَعَنْ أَبِي أُمَامَةَ رَضِيَ اَللَّهُ عَنْهُ عَنِ اَلنَّبِيِّ صلى الله عليه وسلم قَالَ: { مَنْ شَفَعَ لِأَخِيهِ شَفَاعَةً, فَأَهْدَى لَهُ هَدِيَّةً, فَقَبِلَهَا, فَقَدْ أَتَى بَابًا عَظِيماً مِنْ أَبْوَابِ اَلرِّبَا } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَفِي إِسْنَادِهِ مَقَالٌ",
        "urdu": "سیدنا ابوامامہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا: ”جس کسی نے اپنے بھائی کے لیے کوئی سفارش کی (جس سے اس کا کوئی جائز کام بن گیا) پھر اس نے بدلے میں اسے کوئی تحفہ دیا اور اس نے اسے قبول کر لیا، تو وہ سود کے بہت ہی بڑے دروازوں میں سے ایک دروازے پر پہنچ گیا۔“ اسے احمد اور ابوداؤد نے روایت کیا ہے اور اس کی سند میں کلام ہے۔",
        "english": "Narrated Abu Umamah (RA): The Prophet (ﷺ) said: 'If anyone intercedes for his brother and the latter gives him a gift for it, which he accepts, he has committed a serious type of usury (Riba).'"
      }
    },

    {
      "id": 707,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلرَّاشِي وَالْمُرْتَشِيَ } رَوَاهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ",
        "urdu": "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے رشوت دینے والے (راشی) اور رشوت لینے والے (مرتشی) دونوں پر لعنت فرمائی ہے۔",
        "english": "Narrated Abdullah bin 'Amr bin al-'As (R.A): Allah's Messenger (peace be upon him) cursed the one who bribes and the one who takes a bribe."
      }
    },

    {
      "id": 708,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَمَرَهُ أَنْ يُجَهِّزَ جَيْشًا فَنَفِدَتْ اَلْإِبِلُ، فَأَمَرَهُ أَنْ يَأْخُذَ عَلَى قَلَائِصِ اَلصَّدَقَةِ.‏ قَالَ: فَكُنْتُ آخُذُ اَلْبَعِيرَ بِالْبَعِيرَيْنِ إِلَى إِبِلِ اَلصَّدَقَةِ } رَوَاهُ اَلْحَاكِمُ وَالْبَيْهَقِيُّ, وَرِجَالُهُ ثِقَاتٌ ",
        "urdu": "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں ایک لشکر کی تیاری کا حکم دیا۔ اونٹ ختم ہو گئے، تو آپ ﷺ نے انہیں صدقہ کے اونٹوں پر (ادھار اونٹ) لینے کا حکم ارشاد فرمایا۔ راوی کہتے ہیں: میں ایک اونٹ، صدقہ کے دو اونٹوں کے بدلے (ادھار پر) لیتا تھا۔ اسے حاکم اور بیہقی نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated 'Abdullah bin 'Amr bin al-As (RA): Allah's Messenger (ﷺ) commanded him to equip an army, but the camels were exhausted (insufficient). He (the Prophet) then commanded him to take camels on credit against the young she-camels of the Zakat (to be collected later). He said: I used to take one camel for two camels to be paid from the Zakat camels."
      }
    },

    {
      "id": 709,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ الْمُزَابَنَةِ; أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ إِنْ كَانَ نَخْلاً بِتَمْرٍ كَيْلاً, وَإِنْ كَانَ كَرْماً أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً, وَإِنْ كَانَ زَرْعاً أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ, نَهَى عَنْ ذَلِكَ كُلِّهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع مزابنہ سے منع فرمایا ہے، اور وہ یہ ہے کہ کوئی اپنے باغ کی تازہ کھجوروں کو (جو ابھی درخت پر ہوں) خشک کھجوروں کے بدلے ناپ کر بیچے، یا تازہ انگوروں کو خشک انگوروں (کشمش) کے بدلے ناپ کر بیچے، یا کھڑی فصل (اناج) کو کٹے ہوئے اناج کے بدلے ناپ کر بیچے، آپ ﷺ نے ان سب صورتوں سے منع فرمایا ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): Allah's Messenger (peace be upon him) forbade Al-Muzabanah, which is selling the fresh fruits of one's orchard for dry dates by measure if it is a palm-tree; or if it is a vineyard, for raisins by measure; or if it is a field of corn, for a measure of grain. He (peace be upon him) forbade all such transactions."
      }
    },

    {
      "id": 710,
      "name": {
        "arabic": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ: { سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سُئِلَ عَنِ اِشْتِرَاءِ اَلرُّطَبِ بِالتَّمْرِ.‏ فَقَالَ: أَيَنْقُصُ اَلرُّطَبُ إِذَا يَبِسَ? \" قَالُوا: نَعَمَ.‏ فَنَهَى عَنْ ذَلِكَ } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ اَلْمَدِينِيِّ, وَاَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ ",
        "urdu": "سیدنا سعد بن ابی وقاص رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ آپ صلی اللہ علیہ وسلم سے سوال کیا جا رہا تھا کہ تازہ کھجوریں (رطب) خشک کھجوروں (تمر) کے بدلے میں (برابر وزن پر) فروخت کی جا سکتی ہیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”کیا تازہ کھجوریں خشک ہو کر وزن میں کم رہ جاتی ہیں؟“ لوگوں نے کہا: جی ہاں! تو آپ صلی اللہ علیہ وسلم نے اس سے منع فرما دیا۔",
        "english": "Narrated Sa'd bin Abi Waqqas (RA): I heard Allah's Messenger (ﷺ) being asked about buying fresh dates (Rutab) for dry dates (Tamr). He asked, 'Do fresh dates decrease in weight when they become dry?' The people replied in the affirmative. Thereupon he forbade that."
      }
    },

    {
      "id": 711,
      "name": {
        "arabic": "وَعَنِ اِضْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْكَالِئِ بِالْكَالِئِ, يَعْنِي: اَلدَّيْنِ بِالدَّيْنِ } رَوَاهُ إِسْحَاقُ, وَالْبَزَّارُ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے 'بیع کالی بالکالی' یعنی ادھار کے بدلے ادھار (قرض کے بدلے قرض) بیچنے سے منع فرمایا ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): The Prophet (peace be upon him) forbade the sale of 'Kali bi al-Kali', meaning the sale of a debt for a debt."
      }
    }
  ]
}
