{
  "chapId": 106,
  "bookId": 16,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1314,
    "to": 1331
  },
  "hadiths": [
    {
      "id": 1314,
      "name": {
        "arabic": "عَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَلَيْكُمْ بِالصِّدْقِ, فَإِنَّ اَلصِّدْقَ يَهْدِي إِلَى اَلْبِرِّ, وَإِنَّ اَلْبِرَّ يَهْدِي إِلَى اَلْجَنَّةِ, وَمَا يَزَالُ اَلرَّجُلُ يَصْدُقُ, وَيَتَحَرَّى اَلصِّدْقَ, حَتَّى يُكْتَبَ عِنْدَ اَللَّهِ صِدِّيقًا, وَإِيَّاكُمْ وَالْكَذِبَ, فَإِنَّ اَلْكَذِبَ يَهْدِي إِلَى اَلْفُجُورِ, وَإِنَّ اَلْفُجُورَ يَهْدِي إِلَى اَلنَّارِ, وَمَا يَزَالُ اَلرَّجُلُ يَكْذِبُ, وَيَتَحَرَّى اَلْكَذِبَ, حَتَّى يُكْتَبَ عِنْدَ اَللَّهِ كَذَّابًا } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سچائی کو لازم پکڑو کیونکہ سچ نیکی کی طرف لے جاتا ہے اور نیکی جنت کا راستہ دکھاتی ہے۔ آدمی ہمیشہ سچ بولتا ہے اور سچ کی تلاش میں رہتا ہے یہاں تک کہ اللہ کے ہاں اسے 'صدیق' لکھ دیا جاتا ہے۔ اور جھوٹ سے بچو، کیونکہ جھوٹ گناہ کی طرف لے جاتا ہے اور گناہ جہنم کی آگ کی طرف لے جاتا ہے۔ آدمی ہمیشہ جھوٹ بولتا رہتا ہے اور جھوٹ ہی کی تلاش میں رہتا ہے یہاں تک کہ اللہ کے ہاں اسے 'کذاب' (سخت جھوٹا) لکھ دیا جاتا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) said: 'You must be truthful, for truthfulness leads to righteousness and righteousness leads to Paradise. A man keeps on telling the truth and seeking it until he is written before Allah as a Siddiq (truthful). And beware of lying, for lying leads to wickedness and wickedness leads to the Hellfire. A man keeps on telling lies and seeking lies until he is written before Allah as a Kadhdhab (liar).'"
      }
    },

    {
      "id": 1315,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِيَّاكُمْ وَالظَّنَّ, فَإِنَّ اَلظَّنَّ أَكْذَبُ اَلْحَدِيثِ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بدگمانی سے بچو۔ بدگمانی سب سے بڑا جھوٹ ہے۔“ (بخاری و مسلم) ",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'Beware of suspicion, for suspicion is the worst of false tales (the biggest lie).'"
      }
    },

    {
      "id": 1316,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِيَّاكُمْ وَالْجُلُوسَ بِالطُّرُقَاتِ.‏ قَالُوا: يَا رَسُولُ اَللَّهِ! مَا لَنَا بُدٌّ مِنْ مَجَالِسِنَا; نَتَحَدَّثُ فِيهَا.‏ قَالَ \" فَأَمَّا إِذَا أَبَيْتُمْ, فَأَعْطُوا اَلطَّرِيقَ حَقَّهُ.‏ قَالُوا: وَمَا حَقُّهُ? قَالَ:\" غَضُّ اَلْبَصَرِ, وَكَفُّ اَلْأَذَى, وَرَدُّ اَلسَّلَامِ, وَالْأَمْرُ بِالْمَعْرُوفِ, وَالنَّهْيُ عَنْ اَلْمُنْكَرِ.‏ } مُتَّفَقٌ عَلَيْهِ .‏ ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”راستوں پر بیٹھنے سے بچو۔“ صحابہ کرام رضی اللہ عنہم نے عرض کیا: اے اللہ کے رسول! ہماری مجالس تو وہیں ہوتی ہیں جہاں بیٹھ کر ہم باتیں کرتے ہیں (ان کے بغیر ہمارا گزارہ نہیں)۔ آپ ﷺ نے فرمایا: ”اگر تم نہیں مانتے (اور وہاں بیٹھنا ہی ہے) تو پھر راستے کا حق ادا کرو۔“ انہوں نے عرض کیا: راستے کا حق کیا ہے؟ فرمایا: ”نظریں نیچی رکھنا، کسی کو تکلیف نہ دینا، سلام کا جواب دینا، نیکی کا حکم دینا اور برائی سے روکنا۔“ (متفق علیہ)",
        "english": "Narrated Abu Sa'id al-Khudri (RA): Allah's Messenger (ﷺ) said: 'Avoid sitting on the roads.' They (the Companions) said, 'O Messenger of Allah! We cannot help but hold our meetings there to talk.' He (ﷺ) said: 'If you insist on sitting there, then give the road its due right.' They asked, 'What is its due right?' He replied: 'Lowering the gaze, refraining from (causing) annoyance, returning the Salām (greetings), enjoining what is good and forbidding what is evil.'"
      }
    },

    {
      "id": 1317,
      "name": {
        "arabic": "وَعَنْ مُعَاوِيَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ يُرِدِ اَللَّهُ بِهِ خَيْرًا, يُفَقِّهْهُ فِي اَلدِّينِ } مُتَّفَقٌ عَلَيْهِ .‏ ",
        "urdu": "سیدنا معاویہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اللہ تعالیٰ جس شخص سے بھلائی و خیر کا ارادہ فرماتا ہے اسے دین کی سمجھ (فقہ) عطا فرماتا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Mu'awiyah (RAA): The Messenger of Allah (ﷺ) said: 'If Allah wants to do good to a person, He makes him comprehend the religion (the understanding of Fiqh).'"
      }
    },

    {
      "id": 1318,
      "name": {
        "arabic": "وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا مِنْ شَيْءٍ فِي اَلْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ اَلْخُلُقِ } أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ . ",
        "urdu": "سیدنا ابوالدرداء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میزان (ترازو) میں حسنِ اخلاق سے زیادہ وزنی کوئی چیز نہیں ہے۔“ (ابوداؤد اور ترمذی، اور ترمذی نے اسے صحیح قرار دیا ہے)۔",
        "english": "Narrated Abu ad-Darda' (RA): Allah's Messenger (ﷺ) said: 'There is nothing heavier in the Scales than good character.' Reported by Abu Dawud and At-Tirmidhi, and the latter graded it Sahih."
      }
    },

    {
      "id": 1319,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْحَيَاءُ مِنْ اَلْإِيمَانِ } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” حیاء ایمان کا حصہ ہے۔ “ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RAA): The Messenger of Allah (ﷺ) said: 'Modesty (Al-Haya) is a part of Faith.'"
      }
    },

    {
      "id": 1320,
      "name": {
        "arabic": "وَعَنْ أَبِي مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ مِمَّا أَدْرَكَ اَلنَّاسُ مِنْ كَلَامِ اَلنُّبُوَّةِ اَلْأُولَى: إِذَا لَمْ تَسْتَحِ, فَاصْنَعْ مَا شِئْتَ } أَخْرَجَهُ اَلْبُخَارِيُّ .‏",
        "urdu": "سیدنا ابومسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پہلی نبوت کے کلام میں سے لوگوں کو جو کچھ ملا ہے، اس میں سے یہ بھی ہے کہ جب تم میں شرم و حیا نہ رہے تو جو جی چاہے کرو۔“ (بخاری)",
        "english": "Narrated Abu Mas'ud (RA): Allah's Messenger (ﷺ) said: 'Among the words people obtained from the First Prophecy are: If you feel no shame, then do as you wish.'"
      }
    },

    {
      "id": 1321,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤْمِنُ اَلْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اَللَّهِ مِنْ اَلْمُؤْمِنِ اَلضَّعِيفِ, وَفِي كُلٍّ خَيْرٌ, اِحْرِصْ عَلَى مَا يَنْفَعُكَ, وَاسْتَعِنْ بِاَللَّهِ, وَلَا تَعْجَزْ, وَإِنْ أَصَابَكَ شَيْءٌ فَلَا تَقُلْ: لَوْ أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا, وَلَكِنْ قُلْ: قَدَّرَ اَللَّهُ وَمَا شَاءَ فَعَلَ; فَإِنَّ لَوْ تَفْتَحُ عَمَلَ اَلشَّيْطَانِ } أَخْرَجَهُ مُسْلِمٌ .",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” قوی مومن اللہ کے ہاں زیادہ محبوب ہے ضعیف و کمزور مومن کی نسبت سے۔ ہر مومن میں بھلائی اور اچھائی ہے۔ جو چیز تیرے لئے منافع بخش ہے اس کی حرص و لالچ کر۔ مدد صرف اللہ سے طلب کر، عاجز و درماندہ بن کر نہ بیٹھ اور اگر تجھے کوئی تکلیف پہنچے تو اس طرح مت کہو کہ اگر میں نے اس طرح کیا ہوتا تو یہ اور یہ ہوتا۔ بلکہ اس طرح کہا کرو کہ اللہ تعالیٰ نے مقدر فرمایا اور اس نے جو چاہا وہ کیا، کیونکہ لفظ «لو» (یعنی اگر) شیطان کے عمل کا دروازہ کھولتا ہے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone. Cherish that which gives you benefit (in the Hereafter) and seek help from Allah and do not lose heart (or give up), and if anything (in the form of trouble) befalls you, do not say: 'If I had done that, it would have been such and such', but say: 'Allah has ordained it, and He does what He wills', for the word 'if' opens the door for the actions of Satan.' [Reported by Muslim]"
      }
    },

    {
      "id": 1322,
      "name": {
        "arabic": "وَعَنْ عِيَاضِ بْنِ حِمَارٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا, حَتَّى لَا يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ, وَلَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ } أَخْرَجَهُ مُسْلِمٌ .‏ ",
        "urdu": "سیدنا عیاض بن حمار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بے شک اللہ تعالیٰ نے میری طرف وحی بھیجی ہے کہ عاجزی (انکساری) اختیار کرو، یہاں تک کہ کوئی دوسرے پر زیادتی نہ کرے اور نہ کوئی دوسرے پر فخر کرے۔“ (مسلم)",
        "english": "Narrated 'Iyad bin Himar (RA): Allah's Messenger (ﷺ) said: 'Allah has revealed to me that you should be humble towards one another, so that no one wrongs another and no one boasts to another.'"
      }
    },

    {
      "id": 1323,
      "name": {
        "arabic": " وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ رَدَّ عَنْ عِرْضِ أَخِيهِ بِالْغَيْبِ, رَدَّ اَللَّهُ عَنْ وَجْهِهِ اَلنَّارَ يَوْمَ اَلْقِيَامَةِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَحَسَّنَهُ  وَلِأَحْمَدَ, مِنْ حَدِيثِ أَسْمَاءَ بِنْتِ يَزِيدَ نَحْوُهُ .",
        "urdu": "سیدنا ابوالدرداء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس شخص نے اپنے بھائی کی عدم موجودگی میں اس کی آبرو کی حفاظت کی اللہ تعالیٰ قیامت کے روز اس کے چہرے کو آتش جہنم سے محفوظ رکھے گا۔“ اس کو ترمذی نے روایت کیا ہے اور حسن قرار دیا ہے اور مسند احمد میں اسماء بنت یزید کی حدیث بھی اسی طرح ہے۔",
        "english": "Narrated Abu ad-Darda' (RAA): The Messenger of Allah (ﷺ) said: 'Whoever defends his brother's honor in his absence, Allah will keep the Fire away from his face on the Day of Resurrection.' [Reported by at-Tirmidhi, who graded it Hasan. Ahmad reported a similar Hadith from Asma' bint Yazid]."
      }
    },

    {
      "id": 1324,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ, وَمَا زَادَ اَللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا, وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ } أَخْرَجَهُ مُسْلِمٌ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ مال میں کمی نہیں کرتا، اور بندے کے معاف کر دینے سے اللہ اس کی عزت ہی بڑھاتا ہے، اور جو کوئی بھی اللہ کے لیے عاجزی اختیار کرتا ہے اللہ اسے بلند ہی کرتا ہے۔“ (مسلم) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Charity does not diminish wealth; and Allah increases the honor of him who forgives; and no one humbles himself before Allah but Allah raises him (in status).'"
      }
    },

    {
      "id": 1325,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ سَلَّامٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَا أَيُّهَا اَلنَّاسُ! أَفْشُوا اَلسَّلَام, وَصِلُوا اَلْأَرْحَامَ, وَأَطْعِمُوا اَلطَّعَامَ, وَصَلُّوا بِاللَّيْلِ وَالنَّاسُ نِيَامٌ, تَدْخُلُوا اَلْجَنَّةَ بِسَلَامٍ } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ",
        "urdu": "سیدنا عبداللہ بن سلام رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” لوگو! سلام کو عام کرو اور صلہ رحمی کرو اور کھانا کھلاؤ۔ رات کو قیام کرو جب دوسرے لوگ سوتے ہوں، جنت میں سلامتی کے ساتھ داخل ہو جاؤ گے۔“ اسے ترمذی نے نکالا ہے اور صحیح کہا ہے۔",
        "english": "Narrated ‘Abdullah bin Salam (RAA): The Messenger of Allah (ﷺ) said: 'O people, spread the greeting of Salam (peace), feed others, maintain family ties, and pray at night while people are sleeping, and you will enter Paradise in peace.' [Reported by at-Tirmidhi who graded it Sahih]."
      }
    },

    {
      "id": 1326,
      "name": {
        "arabic": " وَعَنْ تَمِيمٍ الدَّارِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ ‏- صلى الله عليه وسلم ‏-{ اَلدِّينُ اَلنَّصِيحَةُ \" ثَلَاثًا.‏ قُلْنَا: لِمَنْ يَا رَسُولُ اَللَّهِ? قَالَ:\" لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ اَلْمُسْلِمِينَ وَعَامَّتِهِمْ } أَخْرَجَهُ مُسْلِمٌ .‏",
        "urdu": "سیدنا تمیم داری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”دین سراسر خیر خواہی کا نام ہے۔“ آپ ﷺ نے یہ بات تین مرتبہ دہرائی۔ ہم نے عرض کیا: اے اللہ کے رسول! کس کے لیے؟ آپ ﷺ نے فرمایا: ”اللہ کے لیے، اس کی کتاب کے لیے، اس کے رسول کے لیے، مسلمانوں کے ائمہ (حکمرانوں و علماء) کے لیے اور تمام عام مسلمانوں کے لیے۔“ (مسلم)",
        "english": "Narrated Tamim ad-Dari (RA): Allah's Messenger (ﷺ) said: 'Religion is sincerity (Nasihah).' He said it three times. We asked, 'To whom, O Messenger of Allah?' He replied, 'To Allah, His Book, His Messenger, the leaders of the Muslims, and their common folk.'"
      }
    },

    {
      "id": 1327,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَكْثَرُ مَا يُدْخِلُ اَلْجَنَّةَ تَقْوى اَللَّهِ وَحُسْنُ اَلْخُلُقِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو چیز اکثر جنت میں داخلے کا سبب بنے گی وہ اللہ کا ڈر (تقویٰ) اور حسنِ اخلاق ہے۔“ اسے ترمذی نے نکالا ہے اور حاکم نے اسے صحیح کہا ہے۔",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'The things that will cause most people to enter Paradise are Taqwa (piety/consciousness of Allah) and good character.' [Reported by at-Tirmidhi and authenticated by al-Hakim]."
      }
    },

    {
      "id": 1328,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّكُمْ لَا تَسَعُونَ اَلنَّاسَ بِأَمْوَالِكُمْ, وَلَكِنْ لِيَسَعْهُمْ بَسْطُ اَلْوَجْهِ, وَحُسْنُ اَلْخُلُقِ } أَخْرَجَهُ أَبُو يَعْلَى, وَصَحَّحَهُ اَلْحَاكِمُ .‏",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم اپنے مالوں کے ذریعے تمام لوگوں کو خوش نہیں کر سکتے (ان کا احاطہ نہیں کر سکتے)، بلکہ تمہاری طرف سے خندہ پیشانی اور حسنِ اخلاق ان کے لیے کافی ہونا چاہیے۔“ (ابو یعلیٰ و حاکم) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'You cannot satisfy all people with your wealth; but a cheerful face and good character should be sufficient for them from you.'"
      }
    },

    {
      "id": 1329,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤْمِنُ مِرْآةُ اَلْمُؤْمِنِ } أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَنٍ .‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مومن اپنے مومن بھائی کا آئینہ ہے۔“ (ابوداؤد)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'A believer is a mirror to his (fellow) believer.' [Reported by Abu Dawud with a Hasan chain]."
      }
    },

    {
      "id": 1330,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤْمِنُ اَلَّذِي يُخَالِطُ اَلنَّاسَ, وَيَصْبِرُ عَلَى أَذَاهُمْ خَيْرٌ مِنْ اَلذِّي لَا يُخَالِطُ اَلنَّاسَ وَلَا يَصْبِرُ عَلَى أَذَاهُمْ } أَخْرَجَهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ حَسَنٍ, وَهُوَ عِنْدَ اَلتِّرْمِذِيِّ: إِلَّا أَنَّهُ لَمْ يُسَمِّ اَلصِّحَابِيَّ .‏ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو مومن لوگوں سے میل جول رکھتا ہے اور ان کی طرف سے پہنچنے والی اذیت پر صبر کرتا ہے، وہ اس مومن سے بہتر ہے جو لوگوں سے میل جول نہیں رکھتا اور ان کی اذیت پر صبر نہیں کرتا۔“ (ابن ماجہ، ترمذی)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'The believer who mixes with people and endures their insults (harassment) is better than the believer who does not mix with people and does not endure their insults.'"
      }
    },

    {
      "id": 1331,
      "name": {
        "arabic": "وَعَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي, فَحَسِّنْ خُلُقِي } رَوَاهُ أَحْمَدُ وَصَحَّحَهُ اِبْنُ حِبَّان",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” الٰہی جس طرح تو نے میری تخلیق (جسمانی ساخت) کو خوب اچھا بنایا ہے۔ اس طرح میرے اخلاق کو بھی اچھا اور حسین بنا دے۔“ اسے احمد نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Ibn Mas'ud (RAA): The Messenger of Allah (ﷺ) used to say: 'O Allah, as You have made my physical shape beautiful, make my character beautiful as well.' [Reported by Ahmad and authenticated by Ibn Hibban]."
      }
    }
  ]
}
