{
  "chapId": 27,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 415,
    "to": 424
  },
  "hadiths": [
    {
      "id": 415,
      "name": {
        "arabic": "عَنْ أَبِي عَامِرٍ اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيَكُونَنَّ مِنْ أُمَّتِي أَقْوَامٌ يَسْتَحِلُّونَ اَلْحِرَ وَالْحَرِيرَ } رَوَاهُ أَبُو دَاوُدَ، وَأَصْلُهُ فِي اَلْبُخَارِيِّ",
        "urdu": "سیدنا ابوعامر اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” میری امت میں لازماً کچھ ایسی قومیں ہوں گی جو (زنا) اور ریشم کو حلال سمجھیں گی۔ “ اسے ابوداؤد نے روایت کیا ہے اور اس کی اصل بخاری میں ہے۔",
        "english": "Narrated Abu 'Amir al-Ash'ari (RA): The Messenger of Allah (ﷺ) said: 'There will be some people among my Ummah who will consider illegal sexual intercourse (zina) and silk to be lawful.' Reported by Abu Dawud, and its origin is in Al-Bukhari."
      }
    },

    {
      "id": 416,
      "name": {
        "arabic": " وَعَنْ حُذَيْفَةَ ‏- رضى الله عنه ‏- قَالَ: { نَهَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَنْ نَشْرَبَ فِي آنِيَةِ اَلذَّهَبِ وَالْفِضَّةِ, وَأَنْ نَأْكُلَ فِيهَا, وَعَنْ لُبْسِ اَلْحَرِيرِ وَالدِّيبَاجِ, وَأَنْ نَجْلِسَ عَلَيْهِ } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا حذیفہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سونے چاندی کے برتنوں میں کھانے پینے، باریک اور موٹا ریشم پہننے اور ان پر بیٹھنے سے منع فرمایا ہے۔ (بخاری)",
        "english": "Narrated Hudhaifa (RA): The Prophet (PBUH) forbade us to drink or eat in gold and silver vessels, and to wear silk and Dibaj (thick silk) or to sit on them. (Reported by Al-Bukhari)"
      }
    },

    {
      "id": 417,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { نَهَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَنْ لُبْسِ اَلْحَرِيرِ إِلَّا مَوْضِعَ إِصْبَعَيْنِ, أَوْ ثَلَاثٍ, أَوْ أَرْبَعٍ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا عمر رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ریشم پہننے سے منع فرمایا، سوائے دو یا تین یا چار انگشت (کے برابر جگہ پر)۔ (بخاری و مسلم) اور متن حدیث کے الفاظ مسلم کے ہیں۔",
        "english": "Narrated ‘Umar (RA): The Prophet (ﷺ) forbade the wearing of silk (for men) except for the extent of two, three or four fingers. (Agreed upon, and the wording is Muslim's)."
      }
    },

    {
      "id": 418,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-رَخَّصَ لِعَبْدِ اَلرَّحْمَنِ بْنِ عَوْفٍ, وَالزُّبَيْرِ فِي قَمِيصِ اَلْحَرِيرِ, فِي سَفَرٍ, مِنْ حَكَّةٍ كَانَتْ بِهِمَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے دوران سفر عبدالرحمٰن بن عوف رضی اللہ عنہ اور زبیر بن عوام رضی اللہ عنہ کو ریشمی قمیص پہننے کی اجازت مرحمت فرمائی۔ اس وجہ سے کہ ان کو خارش تھی۔ (بخاری ومسلم)",
        "english": "Narrated Anas (RA): The Prophet (PBUH) granted a concession to 'Abdur-Rahman bin 'Awf and Az-Zubair (RA) to wear silk shirts during a journey because they were suffering from an itch. (Agreed Upon)"
      }
    },

    {
      "id": 419,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: { كَسَانِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-حُلَّةً سِيَرَاءَ, فَخَرَجْتُ فِيهَا, فَرَأَيْتُ اَلْغَضَبَ فِي وَجْهِهِ, فَشَقَقْتُهَا بَيْنَ نِسَائِي } مُتَّفَقٌ عَلَيْهِ, وَهَذَا لَفْظُ مُسْلِمٍ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے سیراء کا پٹے دار ریشمی جوڑا عنایت فرمایا۔ میں اسے پہن کر باہر نکلا تو میں نے حضور صلی اللہ علیہ وسلم کے رخ انور پر غصہ اور ناراضگی کے آثار دیکھے، تو میں نے اسے ٹکڑے ٹکڑے کر کے اپنی عورتوں میں تقسیم کر دیا۔ (بخاری و مسلم) متن حدیث کے الفاظ مسلم کے ہیں۔",
        "english": "Narrated 'Ali (RA): The Prophet (ﷺ) gave me a suit of 'Siyara' silk to wear. I went out wearing it, but I saw anger on his face. I then tore it into pieces and divided it among my women. (Agreed upon, and this is the wording of Muslim)."
      }
    },

    {
      "id": 420,
      "name": {
        "arabic": "وَعَنْ أَبِي مُوسَى ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- قَالَ: { أُحِلَّ اَلذَّهَبُ وَالْحَرِيرُ لِإِنَاثِ أُمَّتِي, وَحُرِّمَ عَلَى ذُكُورِهِمْ.‏ } رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ",
        "urdu": "سیدنا ابوموسیٰ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سونا اور ریشم میری امت کی عورتوں کے لئے حلال کر دیا گیا ہے اور ان کے مردوں پر حرام۔“ اسے احمد، نسائی اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Musa (RA): Allah's Messenger (PBUH) said: \"Gold and silk have been permitted for the females of my Ummah and forbidden for their males.\""
      }
    },

    {
      "id": 421,
      "name": {
        "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ اَللَّهَ يُحِبُّ إِذَا أَنْعَمَ عَلَى عَبْدٍ أَنْ يَرَى أَثَرَ نِعْمَتِهِ عَلَيْهِ } رَوَاهُ اَلْبَيْهَقِيُّ",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” اللہ تعالیٰ کو یہ پسند و محبوب ہے کہ جب وہ اپنے کسی بندہ پر انعام فرمائے تو اس نعمت کا اثر اس پر دیکھا جائے۔ “",
        "english": "Narrated ‘Imran bin Husain (RA): The Messenger of Allah (ﷺ) said: 'Allah loves to see the result of His favors upon His slave (when He bestows a blessing on him).'"
      }
    },

    {
      "id": 422,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّه ‏- صلى الله عليه وسلم ‏- نَهَى عَنْ لُبْسِ الْقَسِيِّ وَالْمُعَصْفَرِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے قسی (ریشم ملے ہوئے) کپڑے اور عصفر (زرد رنگ) میں رنگے ہوئے کپڑے پہننے سے منع فرمایا۔ (مسلم)",
        "english": "Narrated 'Ali (RA): The Messenger of Allah (PBUH) forbade the wearing of Al-Qassi (garments containing silk) and Al-Mu'asfar (garments dyed with safflower)."
      }
    },

    {
      "id": 423,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ رَضِيَ اَللَّهُ عَنْهُمَا, قَالَ: { رَأَى عَلَيَّ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-ثَوْبَيْنِ مُعَصْفَرَيْنِ, فَقَالَ: \"أُمُّكَ أَمَرَتْكَ بِهَذَا?\" } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے میرے جسم پر کسم (زرد/سرخ رنگ) سے رنگے ہوئے دو کپڑے دیکھے تو فرمایا: ”کیا تمہاری ماں نے تمہیں یہ پہننے کا حکم دیا ہے؟“",
        "english": "Narrated ‘Abdullah bin ‘Amr (RA): The Prophet (ﷺ) saw me wearing two clothes dyed with saffron (Mu'asfar), and he said: 'Did your mother command you to do this?'"
      }
    },

    {
      "id": 424,
      "name": {
        "arabic": " وَعَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّهَا أَخْرَجَتْ جُبَّةَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مَكْفُوفَةَ اَلْجَيْبِ وَالْكُمَّيْنِ وَالْفَرْجَيْنِ, بِالدِّيبَاجِ } رَوَاهُ أَبُو دَاوُدَ وَأَصْلُهُ فِي \"مُسْلِمٍ\", وَزَادَ: { كَانَتْ عِنْدَ عَائِشَةَ حَتَّى قُبِضَتْ, فَقَبَضْتُهَا, وَكَانَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَلْبَسُهَا, فَنَحْنُ نَغْسِلُهَا لِلْمَرْضَى نَسْتَشْفِي بِهَا } وَزَادَ اَلْبُخَارِيُّ فِي \"اَلْأَدَبِ اَلْمُفْرَدِ\".‏ { وَكَانَ يَلْبَسُهَا لِلْوَفْدِ وَالْجُمُعَةِ }",
        "urdu": "سیدہ اسماء بنت ابی بکر رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کا ایک چوغا نکالا جس کی آستینوں، گریبان اور چاک پر دبیز ریشم کا حاشیہ تھا۔ اسے ابوداؤد نے روایت کیا ہے اور اس کی اصل مسلم میں ہے۔ مسلم نے اتنا اضافہ نقل کیا ہے کہ وہ جبہ سیدہ عائشہ رضی اللہ عنہا کی تحویل میں تھا کہ وہ وفات پا گئیں تو میں نے اسے اپنے قبضے میں لے لیا۔ نبی کریم صلی اللہ علیہ وسلم اسے زیب تن فرمایا کرتے تھے اور ہم اسے دھو کر مریضوں کو پلاتے تھے اور شفاء طلب کرتے تھے۔ اور بخاری نے الادب المفرد میں یہ اضافہ کیا ہے کہ حضور صلی اللہ علیہ وسلم اسے وفود کی آمد پر اور نماز جمعہ کے لیے پہنتے تھے۔",
        "english": "Asma' bint Abi Bakr (RA) brought out a cloak (Jubbah) belonging to the Messenger of Allah (PBUH), the collar, sleeves, and slits of which were hemmed with silk brocade. (Abu Dawud and Muslim). Muslim added: 'It was with 'Aishah until she passed away, then I took it. The Prophet (PBUH) used to wear it, and we used to wash it for the sick to seek healing through it.' Al-Bukhari added in Al-Adab al-Mufrad: 'He used to wear it for (receiving) delegations and on Fridays.'"
      }
    }
  ]
}