{
  "chapId": 28,
  "bookId": 3,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 425,
    "to": 482
  },
  "hadiths": [
    {
      "id": 425,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ أَكْثِرُوا ذِكْرَ هَاذِمِ اَللَّذَّاتِ: اَلْمَوْتِ } رَوَاهُ اَلتِّرْمِذِيُّ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”لذتوں کو توڑ دینے، کاٹ دینے والی کا ذکر کثرت سے کیا کرو (یعنی موت کا)“ اسے ترمذی اور نسائی نے روایت کیا ہے اور ابن حبان نے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"Remember often the destroyer of pleasures: Death.\" [Reported by at-Tirmidhi and an-Nasa'i, and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 426,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ لَا يَتَمَنَّيَنَّ أَحَدُكُمُ اَلْمَوْتَ لِضُرٍّ يَنْزِلُ بِهِ, فَإِنْ كَانَ لَا بُدَّ مُتَمَنِّيًا فَلْيَقُلْ: اَللَّهُمَّ أَحْيِنِي مَا كَانَتِ اَلْحَيَاةُ خَيْرًا لِي, وَتَوَفَّنِي إِذَا كَانَتِ اَلْوَفَاةُ خَيْرًا لِي } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ وسلم نے فرمایا ”تم میں سے کسی کو اس مصیبت و تکلیف کی وجہ سے جو اس پر نازل ہوئی ہو موت کی تمنا و خواہش ہرگز نہیں کرنی چاہئیے اور اگر اس کی تمنا ضروری ہو تو پھر اس طرح کہنا چاہیئے «اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي» اے اللہ! جب تک جینا میرے لئے بہتر ہو اس وقت تک مجھے زندگی عطا فرما اور جب موت میرے لئے بہتر ہو تو مجھے وفات دیدے۔“",
        "english": "Narrated Anas (RA): Allah's Messenger (ﷺ) said: 'None of you should wish for death because of a calamity that has befallen him; but if he must wish for death, let him say: O Allah! Keep me alive as long as life is better for me, and take my life if death is better for me.'"
      }
    },

    {
      "id": 427,
      "name": {
        "arabic": "وَعَنْ بُرَيْدَةَ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { اَلْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ } رَوَاهُ اَلثَّلَاثَةُ وَصَحَّحَهُ ابْنُ حِبَّانَ",
        "urdu": "سیدنا بریدہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا ”مومن کی موت کے وقت اس کی پیشانی پر پسینہ رونما ہو جاتا ہے۔“ اس روایت کو تینوں یعنی ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Buraidah (RA): The Prophet (ﷺ) said: \"A believer dies with sweat on his forehead.\" [Reported by the three (at-Tirmidhi, an-Nasa'i, and Ibn Majah) and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 428,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَا: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اَللَّهُ } رَوَاهُ مُسْلِمٌ، وَالْأَرْبَعَةُ",
        "urdu": "سیدنا ابوسعید رضی اللہ عنہ اور سیدنا ابوہریرہ رضی اللہ عنہ سے مروی کہ رسول اللہ صلی اللہ وسلم نے فرمایا ”قریب المرگ آدمی کو «لا إله إلا الله» کی تلقین کرو۔“ اسے مسلم اور چاروں یعنی ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔",
        "english": "Narrated Abu Sa'id al-Khudri and Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Exhort your dying ones to say: La ilaha illallah (There is no god but Allah).'"
      }
    },

    {
      "id": 429,
      "name": {
        "arabic": " وَعَنْ مَعْقِلِ بْنِ يَسَارٍ - رضى الله عنه - أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ: { اقْرَأُوا عَلَى مَوْتَاكُمْ يس } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ ",
        "urdu": "سیدنا معقل بن یسار رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اپنے مرنے والوں کے قریب سورۃ «يس» پڑھا کرو۔“ اسے ابوداؤد، نسائی نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ma'qil bin Yasar (RA): The Prophet (ﷺ) said: \"Recite Surah Ya-Sin over those of you who are dying.\" [Reported by Abu Dawud and an-Nasa'i, and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 430,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -عَلَى أَبِي سَلَمَةَ - رضى الله عنه - وَقَدْ شُقَّ بَصَرُهُ فَأَغْمَضَهُ, ثُمَّ قَالَ: 'إِنَّ اَلرُّوحَ إِذَا قُبِضَ, اتَّبَعَهُ الْبَصَرُ' فَضَجَّ نَاسٌ مِنْ أَهْلِهِ, فَقَالَ: 'لَا تَدْعُوا عَلَى أَنْفُسِكُمْ إِلَّا بِخَيْرٍ. فَإِنَّ اَلْمَلَائِكَةَ تُؤَمِّنُ عَلَى مَا تَقُولُونَ'. ثُمَّ قَالَ: 'اَللَّهُمَّ اغْفِرْ لِأَبِي سَلَمَةَ, وَارْفَعْ دَرَجَتَهُ فِي اَلْمَهْدِيِّينَ, وَافْسِحْ لَهُ فِي قَبْرِهِ, وَنَوِّرْ لَهُ فِيهِ, وَاخْلُفْهُ فِي عَقِبِهِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم ابوسلمہ رضی اللہ عنہ کی موت کے وقت تشریف لائے اس وقت ان کی آنکھ کھلی ہوئی تھی آپ صلی اللہ علیہ وسلم نے اسے بند کر دیا اور پھر فرمایا کہ ”جب روح بدن سے نکل جاتی ہے تو آنکھ اس کا پیچھا کرتی ہے۔“ اتنے میں گھر کے لوگ آہ و بکا کرنے لگے، چیخنے لگے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا ”اپنے لیے اچھی اور بہتر دعا کرنا کیونکہ جو کچھ تم کہتے ہو اس پر فرشتے آمین کہتے ہیں۔“ پھر آپ صلی اللہ علیہ وسلم نے دعا فرمائی «اللهم اغفر لأبي سلمة وارفع درجته في المهديين وافسح له في قبره ونور له فيه واخلفه في عقبه» ”الٰہی! ابوسلمہ کی مغفرت فرما دے۔ ہدایت یافتہ لوگوں میں اس کا درجہ و مرتبہ بلند فرما اور اس کی قبر کشادہ و وسیع فرما دے اور اسے منور فرما دے اور اس کے پیچھے رہنے والوں میں نائب و قائم مقام ہو جا۔“",
        "english": "Umm Salama (RA) reported: The Messenger of Allah (ﷺ) came to Abu Salama (RA) when his eyes were fixedly open. He closed them and said: 'When the soul is taken, the sight follows it.' Some of his family members wept and wailed, so he said: 'Do not pray for yourselves anything but good, for the angels say Amen to what you say.' He then said: 'O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a large grave, enlighten it for him and provide a good successor for those he has left behind.'"
      }
    },

    {
      "id": 431,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -حِينَ تُوُفِّيَ سُجِّيَ بِبُرْدٍ حِبَرَةٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم جب فوت ہوئے تو آپ صلی اللہ علیہ وسلم کو ایک دھاری دار چادر سے ڈھانپ دیا گیا۔ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): When the Messenger of Allah (ﷺ) passed away, he was covered with a Hibara Burd (a green square decorated garment from Yemen). [Agreed upon]."
      }
    },

    {
      "id": 432,
      "name": {
        "arabic": "وَعَنْهَا { أَنَّ أَبَا بَكْرٍ اَلصِّدِّيقَ - رضى الله عنه - قَبَّلَ اَلنَّبِيَّ - صلى الله عليه وسلم -بَعْدَ مَوْتِهِ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ سیدنا ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کی وفات کے بعد آپ صلی اللہ علیہ وسلم (کی پیشانی) کا بوسہ لیا تھا۔ (بخاری)",
        "english": "Narrated 'Aishah (RA): Abu Bakr As-Siddiq (RA) kissed the Prophet (ﷺ) after his death."
      }
    },

    {
      "id": 433,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { نَفْسُ اَلْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ, حَتَّى يُقْضَى عَنْهُ } رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مومن کی روح قرض کے ساتھ اس وقت تک معلق (لٹکی) رہتی ہے جب تک اسے ادا نہیں کر دیا جاتا۔“ احمد اور ترمذی نے اسے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"The soul of a believer remains suspended by his debt until it is paid off on his behalf.\" [Reported by Ahmad and at-Tirmidhi, who graded it Hasan]."
      }
    },

    {
      "id": 434,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ فِي اَلَّذِي سَقَطَ عَنْ رَاحِلَتِهِ فَمَاتَ: { اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ, وَكَفِّنُوهُ فِي ثَوْبَيْنِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اس آدمی کے متعلق جو اپنی سواری سے گر کر جاں بحق ہو گیا فرمایا کہ ”اسے پانی اور بیری کے پتوں سے غسل دو اور اسی کے دو کپڑوں میں کفن دے دو۔“",
        "english": "Narrated Ibn 'Abbas (RA): Regarding a man who fell from his mount and died (while in a state of Ihram), the Prophet (ﷺ) said: 'Wash him with water and Sidr (lote-tree leaves) and shroud him in his two garments (of Ihram).'"
      }
    },

    {
      "id": 435,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { لَمَّا أَرَادُوا غَسْلَ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالُوا: وَاَللَّهُ مَا نَدْرِي, نُجَرِّدُ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -كَمَا نُجَرِّدُ مَوْتَانَا, أَمْ لَا?…. . } اَلْحَدِيثَ، رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ جب صحابہ کرام رضی اللہ عنہم نے نبی کریم صلی اللہ علیہ وسلم کو غسل دینے کا ارادہ کیا تو انہوں نے کہا: اللہ کی قسم! ہمیں علم نہیں کہ ہم نبی کریم صلی اللہ علیہ وسلم کے کپڑے اتاریں جس طرح ہم اپنے مرنے والوں کے کپڑے اتارتے ہیں یا نہ اتاریں؟ (پھر اللہ نے انہیں نیند دے دی اور غیبی آواز کے ذریعے حکم دیا کہ آپ ﷺ کو کپڑوں سمیت غسل دیں)۔",
        "english": "Narrated 'Aisha (RA): When they intended to wash the Prophet (ﷺ), they said: \"By Allah, we do not know whether we should take off the clothes of the Messenger of Allah (ﷺ) as we take off the clothes of our dead, or not?\" [Reported by Ahmad and Abu Dawud]."
      }
    },

    {
      "id": 436,
      "name": {
        "arabic": "وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ عَلَيْنَا اَلنَّبِيُّ - صلى الله عليه وسلم -وَنَحْنُ نُغَسِّلُ ابْنَتَهُ، فَقَالَ: \"اغْسِلْنَهَا ثَلَاثًا, أَوْ خَمْسًا, أَوْ أَكْثَرَ مِنْ ذَلِكَ، إِنْ رَأَيْتُنَّ ذَلِكَ, بِمَاءٍ وَسِدْرٍ, وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا, أَوْ شَيْئًا مِنْ كَافُورٍ\"، فَلَمَّا فَرَغْنَا آذَنَّاهُ, فَأَلْقَى إِلَيْنَا حِقْوَهُ. فَقَالَ: \"أَشْعِرْنَهَا إِيَّاهُ\" } مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: { ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ اَلْوُضُوءِ مِنْهَا }. وَفِي لَفْظٍ ِللْبُخَارِيِّ: { فَضَفَّرْنَا شَعْرَهَا ثَلَاثَةَ قُرُونٍ, فَأَلْقَيْنَاهُ خَلْفَهَا }",
        "urdu": "سیدہ ام عطیہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم ہمارے پاس اس وقت تشریف لائے جب ہم آپ صلی اللہ علیہ وسلم کی صاحبزادی کو غسل دے رہی تھیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اسے تین یا پانچ مرتبہ، یا اس سے بھی زیادہ مرتبہ غسل دو۔ اگر ضرورت محسوس کرو، غسل پانی اور بیری کے پتوں سے دو، آخر میں کافور یا فرمایا کچھ کافور ڈالو“ جب ہم فارغ ہوئیں تو ہم نے آپ صلی اللہ علیہ وسلم کو اطلاع بھجوا دی آپ صلی اللہ علیہ وسلم نے اپنا تہ بند اتار کر ہماری طرف پھینک دیا اور فرمایا ”اسے جسم کے ساتھ لگا دو۔“ (بخاری و مسلم) اور ایک روایت میں ہے کہ غسل دائیں طرف سے اور وضو کے اعضاء سے شروع کرنا۔ بخاری کی ایک روایت میں ہے کہ ہم نے ان کے سر کے بالوں کو تین حصوں میں تقسیم کر دیا اور ان کو پشت پر ڈال دیا۔",
        "english": "Narrated Umm 'Atiyyah (RA): Allah's Messenger (ﷺ) came to us while we were washing his daughter and said, 'Wash her three, five, or more times if you think it necessary, with water and Sidr (lote-tree leaves), and at the end put some camphor. When we had finished, we informed him and he gave us his lower garment and said, 'Wrap her in it as the inner garment (next to her body).' In another narration: 'Start with the right side and the parts of the body used in Wudu.' A version in Al-Bukhari says: 'We braided her hair into three plaits and placed them behind her back.'"
      }
    },

    {
      "id": 437,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كُفِّنَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ, لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ. } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو سحولیہ کے بنے ہوئے سوتی سفید رنگ کے تین کپڑوں میں کفن دیا گیا تھا۔ جس میں قمیص اور پگڑی نہیں تھی۔ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): The Messenger of Allah (ﷺ) was shrouded in three white Sahuliyya cotton garments, among which there was neither a shirt nor a turban. [Agreed upon]."
      }
    },

    {
      "id": 438,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ -رَضِيَ اَللَّهُ عَنْهُمَا - قَالَ: { لَمَّا تُوُفِّيَ عَبْدُ اَللَّهِ بْنِ أُبَيٍّ جَاءٍ اِبْنُهُ إِلَى رَسُولِ اَللَّهِ - صلى الله عليه وسلم -. فَقَالَ: أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ, فَأَعْطَاهُ إِيَّاهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما نے بتایا کہ عبداللہ بن ابی جب فوت ہوا تو اس کا بیٹا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا آپ صلی اللہ علیہ وسلم اپنی قمیص عنایت فرما دیں کہ میں اس میں اسے کفن دے دوں۔ آپ صلی اللہ علیہ وسلم نے اپنی قمیص اتار کر عنایت فرما دی۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): When Abdullah bin Ubayy (the chief of hypocrites) died, his son came to Allah's Messenger (ﷺ) and said, 'Give me your shirt so that I may shroud him in it.' So, he (the Prophet) gave it to him."
      }
    },

    {
      "id": 439,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ: { الْبَسُوا مِنْ ثِيَابِكُمُ الْبَيَاضَ, فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ, وَكَفِّنُوا فِيهَا مَوْتَاكُمْ } رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”سفید لباس زیب تن کیا کرو یہ تمہارے ملبوسات میں بہترین اور عمدہ لباس ہے اور اپنے مرنے والوں کو بھی اس میں کفن دیا کرو۔“ نسائی کے علاوہ اسے پانچوں نے روایت کیا ہے اور ترمذی نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: \"Wear white clothes, for they are the best of your clothes, and shroud your dead in them.\" [Reported by the five except an-Nasa'i, and at-Tirmidhi graded it Sahih]."
      }
    },

    {
      "id": 440,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فَلْيُحْسِنْ كَفَنَهُ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے جب کوئی اپنے بھائی کو کفن دے تو اسے اچھا کفن دینا چاہیئے۔“ (مسلم)",
        "english": "Narrated Jabir (RA): Allah's Messenger (ﷺ) said: 'When one of you shrouds his brother, he should shroud him well.'"
      }
    },

    {
      "id": 441,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: { كَانَ اَلنَّبِيُّ - صلى الله عليه وسلم -يَجْمَعُ بَيْنَ اَلرَّجُلَيْنِ مِنْ قَتْلَى أُحَدٍ فِي ثَوْبٍ وَاحِدٍ, ثُمَّ يَقُولُ: \"أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ?\", فَيُقَدِّمُهُ فِي اَللَّحْدِ, وَلَمْ يُغَسَّلُوا, وَلَمْ يُصَلِّ عَلَيْهِمْ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "اور انہی (سیدنا جابر رضی اللہ عنہ) سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم شہداء احد کے دو دو آدمیوں کو ایک لباس میں جمع کرتے تھے پھر فرمایا ”ان میں سے قرآن کس کو زیادہ یاد تھا۔ جسے زیادہ یاد ہوتا، اسے لحد میں پہلے اتارتے۔ نہ تو ان شہداء کو غسل دیا گیا اور نہ ہی ان کی نماز جنازہ پڑھی گئی۔“ (بخاری)",
        "english": "Narrated Jabir (RA): The Prophet (ﷺ) used to wrap two men from the martyrs of Uhud in a single garment, then he would ask, \"Which of them knew more of the Qur'an?\" When one was pointed out, he would put him first in the lahd (niche in the grave). They were not washed, nor was the funeral prayer offered for them."
      }
    },

    {
      "id": 442,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ - رضى الله عنه - قَالَ: { سَمِعْتُ اَلنَّبِيَّ - صلى الله عليه وسلم -يَقُولُ: \"لَا تُغَالُوا فِي اَلْكَفَنِ, فَإِنَّهُ يُسْلُبُ سَرِيعًا\" } رَوَاهُ أَبُو دَاوُدَ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو فرماتے سنا کہ ”(بہت) قیمتی کفن نہ دیا کرو۔ وہ تو بہت جلد بوسیدہ ہو جاتا ہے۔“ (ابوداؤد)",
        "english": "Narrated 'Ali (RA): I heard the Prophet (ﷺ) saying: 'Do not go to extremes in the cost of the shroud, for it will soon be taken away (wither away).'"
      }
    },

    {
      "id": 443,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا ; أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ لَهَا: { لَوْ مُتِّ قَبْلِي فَغَسَّلْتُكِ } اَلْحَدِيثَ. رَوَاهُ أَحْمَدُ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ ابْنُ حِبَّانَ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ نبی کریم صلی اللہ علیہ وسلم نے انہیں فرمایا کہ ”اگر تو مجھ سے پہلے فوت ہو جائے تو میں تمہیں غسل دوں گا۔“ اسے احمد اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated 'Aisha (RA): The Prophet (ﷺ) said to her: \"If you were to die before me, I would wash you (myself).\" [Reported by Ahmad and Ibn Majah, and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 444,
      "name": {
        "arabic": "وَعَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّ فَاطِمَةَ عَلَيْهَا اَلسَّلَامُ أَوْصَتْ أَنْ يُغَسِّلَهَا عَلِيٌّ رَضِيَ اَللَّهُ تَعَالَى عَنْهُ } رَوَاهُ اَلدَّارَقُطْنِيُّ",
        "urdu": "سیدہ اسماء بنت عمیس رضی اللہ عنہا سے مروی ہے کہ سیدہ فاطمہ رضی اللہ عنہا نے خود یہ وصیت کی تھی کہ سیدنا علی رضی اللہ عنہ خود ان کو غسل دیں۔ (سنن دارقطنی)",
        "english": "Narrated Asma' bint 'Umais (RA): Fatimah (AS) bequeathed (in her will) that she should be washed by (her husband) 'Ali (RA). (Reported by Ad-Daraqutni)"
      }
    },

    {
      "id": 445,
      "name": {
        "arabic": " وَعَنْ بُرَيْدَةَ - رضى الله عنه - -فِي قِصَّةِ الْغَامِدِيَّةِ اَلَّتِي أَمَرَ اَلنَّبِيُّ - صلى الله عليه وسلم -بِرَجْمِهَا فِي اَلزِّنَا - قَالَ: { ثُمَّ أَمَرَ بِهَا فَصُلِّيَ عَلَيْهَا وَدُفِنَتْ } رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا بریدہ رضی اللہ عنہ سے غامدیہ کے قصہ میں مروی ہے جسے رسول اللہ صلی اللہ علیہ وسلم نے ارتکاب زنا کی پاداش میں رجم و سنگساری کا حکم دیا تھا کہ آپ صلی اللہ علیہ وسلم نے اس کی نماز جنازہ ادا کرنے کا حکم دیا پھر اس کی نماز جنازہ پڑھی گئی اور اسے دفن کیا گیا۔ (مسلم)",
        "english": "Narrated Buraidah (RA) in the story of the Ghamidiyah woman whom the Prophet (ﷺ) ordered to be stoned to death for adultery: \"Then he (the Prophet) gave orders concerning her, so the funeral prayer was offered for her and she was buried.\" [Reported by Muslim]."
      }
    },

    {
      "id": 446,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أُتِيَ اَلنَّبِيُّ - صلى الله عليه وسلم -بِرَجُلٍ قَتَلَ نَفْسَهُ بِمَشَاقِصَ, فَلَمْ يُصَلِّ عَلَيْهِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر بن سمرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک آدمی لایا گیا جس نے چوڑے پھل والے تیر (مشقص) سے خودکشی کی تھی۔ آپ صلی اللہ علیہ وسلم نے (زجر و توبیخ کے طور پر) اس کی نماز جنازہ نہ پڑھی۔ (مسلم)",
        "english": "Narrated Jabir bin Samura (RA): A man was brought to the Prophet (ﷺ) who had killed himself with a broad-headed arrow (Mashaqis), and the Prophet (ﷺ) did not offer the funeral prayer for him."
      }
    },

    {
      "id": 447,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - -فِي قِصَّةِ اَلْمَرْأَةِ اَلَّتِي كَانَتْ تَقُمُّ اَلْمَسْجِدَ - قَالَ: { فَسَأَلَ عَنْهَا اَلنَّبِيُّ - صلى الله عليه وسلم - فَقَالُوا: مَاتَتْ, فَقَالَ: \"أَفَلَا كُنْتُمْ آذَنْتُمُونِي\"? فَكَأَنَّهُمْ صَغَّرُوا أَمْرَهَا فَقَالَ: \"دُلُّونِي عَلَى قَبْرِهَا\", فَدَلُّوهُ, فَصَلَّى عَلَيْهَا } مُتَّفَقٌ عَلَيْهِ . وَزَادَ مُسْلِمٌ, ثُمَّ قَالَ: { إِنَّ هَذِهِ اَلْقُبُورَ مَمْلُوءَةٌ ظُلْمَةً عَلَى أَهْلِهَا, وَإِنَّ اَللَّهَ يُنَوِّرُهَا لَهُمْ بِصَلَاتِي عَلَيْهِمْ }",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے اس عورت کے بارے میں جو مسجد میں جھاڑو دیا کرتی تھی، روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اس کے متعلق صحابہ کرام رضی اللہ عنہم سے دریافت فرمایا تو صحابہ کرام رضی اللہ عنہم نے جواب دیا کہ وہ فوت ہو چکی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”تم نے مجھے اطلاع کیوں دی؟“ گویا انہوں نے اس کے معاملہ وفات کو معمولی خیال کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”مجھے اس کی قبر کا راستہ بتاؤ۔“ انہوں نے آپ صلی اللہ علیہ وسلم کو اس کی قبر کا راستہ بتا دیا۔ آپ صلی اللہ علیہ وسلم نے وہاں جا کر قبر پر نماز جنازہ پڑھی۔ (بخاری و مسلم) اور مسلم نے اتنا اضافہ نقل کیا ہے پھر آپ صلی اللہ علیہ وسلم نے فرمایا ”یہ قبریں اہل قبور کے لئے اندھیروں سے بھری ہوئی ہیں اور میری نماز سے ان کی قبروں میں روشنی ہو جاتی ہے۔“",
        "english": "Narrated Abu Hurairah (RA) regarding the woman who used to clean the mosque: The Prophet (ﷺ) asked about her and was told that she had died. He said: \"Why did you not inform me?\" It appeared as if they had considered her matter insignificant. He then said: \"Show me her grave.\" So they showed it to him and he offered the funeral prayer over it. [Agreed upon]. Muslim added: He then said: \"These graves are full of darkness for their occupants, and Allah illuminates them for them by my prayer over them.\""
      }
    },

    {
      "id": 448,
      "name": {
        "arabic": "وَعَنْ حُذَيْفَةَ - رضى الله عنه - { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -كَانَ يَنْهَى عَنِ اَلنَّعْيِ } رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ",
        "urdu": "سیدنا حذیفہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم موت کے لئے کھلے عام منادی (شور و غل کے ساتھ اعلان) سے منع فرمایا کرتے تھے۔ اسے احمد اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے۔",
        "english": "Narrated Hudhaifah (RA): The Prophet (ﷺ) used to forbid the public announcement of death (an-Na'i)."
      }
    },

    {
      "id": 449,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -نَعَى اَلنَّجَاشِيَّ فِي اَلْيَوْمِ اَلَّذِي مَاتَ فِيهِ, وَخَرَجَ بِهِمْ مِنَ الْمُصَلَّى، فَصَفَّ بِهِمْ, وَكَبَّرَ عَلَيْهِ أَرْبَعًا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے نجاشی کی خبر وفات اسی روز دی جس روز وہ فوت ہوا تھا۔ آپ صلی اللہ علیہ وسلم صحابہ کرام رضی اللہ عنہم کو لے کر جنازہ گاہ کی طرف تشریف لے گئے۔ صف بندی کروائی اور اس پر چار تکبیریں کہیں۔ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) announced the death of An-Najashi (the King of Ethiopia) on the very day he died. He took them out to the place of prayer, arranged them in rows, and offered the funeral prayer with four Takbirs. [Agreed upon]."
      }
    },

    {
      "id": 450,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: سَمِعْتُ اَلنَّبِيَّ - صلى الله عليه وسلم -يَقُولُ: { مَا مِنْ رَجُلٍ مُسْلِمٍ يَمُوتُ, فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلًا, لَا يُشْرِكُونَ بِاَللَّهِ شَيْئًا, إِلَّا شَفَّعَهُمْ اَللَّهُ فِيهِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ ”کوئی مسلمان نہیں مرتا کہ اس کے جنازے میں ایسے چالیس آدمی شریک ہوں جو اللہ تعالیٰ کے ساتھ کسی بھی چیز کو شریک نہیں ٹھہراتے۔ مگر اللہ تعالیٰ اس مرنے والے کے حق میں ان کی شفاعت قبول فرما لیتا ہے۔“ (مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): I heard Allah's Messenger (ﷺ) saying: 'If any Muslim dies and forty men who do not associate anything with Allah perform his funeral prayer, Allah will accept their intercession for him.'"
      }
    },

    {
      "id": 451,
      "name": {
        "arabic": " وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ - رضى الله عنه - قَالَ: { صَلَّيْتُ وَرَاءَ اَلنَّبِيِّ - صلى الله عليه وسلم -عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا, فَقَامَ وَسْطَهَا } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے مروی ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے پیچھے ایک ایسی عورت کی نماز جنازہ پڑھی جو حالت نفاس میں فوت ہوئی تھی۔ آپ صلی اللہ علیہ وسلم اس کے درمیان میں کھڑے ہوئے تھے۔ (بخاری و مسلم)",
        "english": "Narrated Samurah bin Jundub (RA): I offered the funeral prayer behind the Prophet (ﷺ) for a woman who died during childbirth (Nifas), and he stood opposite her waist. [Agreed upon]."
      }
    },

    {
      "id": 452,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { وَاَللَّهِ لَقَدْ صَلَّى رَسُولُ اَللَّهِ - صلى الله عليه وسلم -عَلَى اِبْنَيْ بَيْضَاءَ فِي اَلْمَسْجِدِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم نے بیضاء کے دونوں بیٹوں کی نماز جنازہ مسجد میں ادا فرمائی۔ (مسلم)",
        "english": "Narrated 'Aishah (RA): By Allah! Allah's Messenger (ﷺ) offered the funeral prayer for the two sons of Baida' in the Mosque."
      }
    },

    {
      "id": 453,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ: { كَانَ زَيْدُ بْنُ أَرْقَمَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا, وَإِنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا, فَسَأَلْتُهُ فَقَالَ: كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -يُكَبِّرُهَا } رَوَاهُ مُسْلِمٌ وَالْأَرْبَعَةُ",
        "urdu": "سیدنا عبدالرحمٰن بن ابی لیلٰی سے روایت ہے کہ زید بن ارقم رضی اللہ عنہ ہمارے جنازوں پر چار تکبیریں کہتے تھے مگر (خلاف معمول) ایک مرتبہ انہوں نے پانچ تکبیریں کہیں تو میں نے ان سے دریافت کیا، انہوں نے جواب دیا کہ نبی کریم صلی اللہ علیہ وسلم بھی پانچ تکبیریں کہتے تھے۔ اسے مسلم اور چاروں (ابوداؤد، ترمذی، نسائی اور ابن ماجہ) نے روایت کیا ہے۔",
        "english": "Narrated 'Abdur-Rahman bin Abi Laila: Zaid bin Arqam (RA) used to say four Takbirs in our funeral prayers, but once he said five Takbirs for a funeral. I asked him about it and he said: \"The Messenger of Allah (ﷺ) used to say them (five Takbirs).\" [Reported by Muslim and the four]."
      }
    },

    {
      "id": 454,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ - رضى الله عنه - { أَنَّهُ كَبَّرَ عَلَى سَهْلِ بْنِ حُنَيْفٍ سِتًّا, وَقَالَ: إِنَّهُ بَدْرِيٌّ } رَوَاهُ سَعِيدُ بْنُ مَنْصُورٍ . وَأَصْلُهُ فِي اَلْبُخَارِيِّ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ انہوں نے سہل بن حنیف رضی اللہ عنہ کی نماز جنازہ میں چھ تکبیریں کہیں اور فرمایا کہ وہ بدری (جنگ بدر کے شریک) تھے۔ اسے سعید بن منصور نے روایت کیا ہے اور اس کی اصل بخاری میں ہے۔",
        "english": "Narrated 'Ali (RA): He said six Takbirs in the funeral prayer of Sahl bin Hunaif (RA) and said: 'He was one of those who participated in the Battle of Badr.'"
      }
    },

    {
      "id": 455,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ - رضى الله عنه - قَالَ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَيَقْرَأُ بِفَاتِحَةِ اَلْكِتَابِ فِي اَلتَّكْبِيرَةِ اَلْأُولَى } رَوَاهُ اَلشَّافِعِيُّ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے جنازوں پر چار تکبیریں کہا کرتے تھے اور پہلی تکبیر میں سورۃ «فاتحه» (بھی) پڑھتے تھے۔ اسے شافعی نے ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated Jabir (RA): The Messenger of Allah (ﷺ) used to say four Takbirs over our funerals and recite Surat al-Fatihah after the first Takbir. [Reported by ash-Shafi'i with a weak chain]."
      }
    },

    {
      "id": 456,
      "name": {
        "arabic": "وَعَنْ طَلْحَةَ بْنِ عَبْدِ اَللَّهُ بْنِ عَوْفٍ قَالَ: { صَلَّيْتُ خَلَفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ, فَقَرَأَ فَاتِحَةَ الكْتِابِ فَقَالَ: \"لِتَعْلَمُوا أَنَّهَا سُنَّةٌ\" } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا طلحہ بن عبداللہ بن عوف رحمہ اللہ سے مروی ہے کہ میں نے ابن عباس رضی اللہ عنہما کے پیچھے نماز جنازہ پڑھی۔ انہوں نے اس میں سورۃ «فاتحه» پڑھی اور فرمایا (میں نے اس لئے سورۃ «فاتحه» پڑھی ہے) تاکہ تمہیں معلوم ہو جائے کہ یہ سنت ہے۔ (بخاری)",
        "english": "Narrated Talha bin 'Abdullah bin 'Aun (RA): I offered the funeral prayer behind Ibn 'Abbas (RA) and he recited Fatihat-ul-Kitab (Surat al-Fatiha) and said: 'It is so that you may know that it is a Sunnah.'"
      }
    },

    {
      "id": 457,
      "name": {
        "arabic": "وَعَنْ عَوْفِ بْنِ مَالِكٍ - رضى الله عنه - قَالَ: { صَلَّى رَسُولُ اَللَّهِ - صلى الله عليه وسلم -عَلَى جَنَازَةٍ، فَحَفِظْتُ مِنْ دُعَائِهِ: 'اَللَّهُمَّ اغْفِرْ لَهُ, وَارْحَمْهُ وَعَافِهِ, وَاعْفُ عَنْهُ, وَأَكْرِمْ نُزُلَهُ, وَوَسِّعْ مُدْخَلَهُ, وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ, وَنَقِّهِ مِنْ اَلْخَطَايَا كَمَا نَقَّيْتَ اَلثَّوْبَ اَلْأَبْيَضَ مِنَ الدَّنَسِ, وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ, وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ, وَأَدْخِلْهُ اَلْجَنَّةَ, وَقِهِ فِتْنَةَ اَلْقَبْرِ وَعَذَابَ اَلنَّارِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عوف بن مالک رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک جنازہ پر نماز پڑھائی۔ میں نے آپ صلی اللہ علیہ وسلم کی دعا میں سے اتنا حصہ یاد کر لیا «اللهم اغفر له، ‏‏‏‏ ‏‏‏‏ وارحمه، ‏‏‏‏ ‏‏‏‏ وعافه، ‏‏‏‏ ‏‏‏‏ واعف عنه، ‏‏‏‏ ‏‏‏‏ وأكرم نزله، ‏‏‏‏ ‏‏‏‏ ووسع مدخله، ‏‏‏‏ ‏‏‏‏ واغسله بالماء، ‏‏‏‏ ‏‏‏‏ والثلج، ‏‏‏‏ ‏‏‏‏ والبرد، ‏‏‏‏ ‏‏‏‏ ونقه من الخطايا، ‏‏‏‏ ‏‏‏‏ كما ينقى الثوب الأبيض من الدنس، ‏‏‏‏ ‏‏‏‏ وأبدله دارا خيرا من داره، ‏‏‏‏ ‏‏‏‏ وأهلا خيرا من أهله، ‏‏‏‏ ‏‏‏‏ وأدخله الجنة، ‏‏‏‏وقه فتنة القبر، ‏‏‏‏ ‏‏‏‏ وعذاب النار» ”اے اللہ! اس کی مغفرت فرما دے، اس پر رحم فرما، اسے عافیت و آرام سے رکھ، اس سے درگزر فرما، اس کی مہمان نوازی اچھی فرما، اس کی قبر کشادہ و فراخ کر دے، اسے پانی، برف اور ژالوں (اولوں) سے دھو دے (بالکل صاف کر دے) اسے گناہوں سے ایسا صاف کر دے جیسا کہ سفید کپڑا میل کچیل سے صاف کیا جاتا ہے۔ اور اسے دنیاوی گھر سے بہتر اور عمدہ گھر اور اہل و عیال سے بہتر اہل و عیال عطا فرما، اسے جنت میں داخل فرما، اسے قبر کے فتنہ و آزمائش اور عذاب دوزخ سے محفوظ رکھ۔ (مسلم)",
        "english": "Narrated 'Auf bin Malik (RA): The Messenger of Allah (ﷺ) offered a funeral prayer, and I memorized this part of his supplication: \"O Allah! Forgive him and have mercy on him, keep him safe and sound and pardon him; honor his rest and make his entrance wide; wash him with water, snow, and hail, and cleanse him of sin as a white garment is cleansed of dirt. Exchange his home for a better home, and his family for a better family. Admit him into Paradise and protect him from the trial of the grave and the punishment of Hell-fire.\" [Reported by Muslim]."
      }
    },

    {
      "id": 458,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: { كَانَ رَسُولُ اَللَّه ِ - صلى الله عليه وسلم -إِذَا صَلَّى عَلَى جَنَازَةٍ يَقُولُ: اَللَّهُمَّ اغْفِرْ لِحَيِّنَا, وَمَيِّتِنَا, وَشَاهِدِنَا, وَغَائِبِنَا, وَصَغِيرِنَا, وَكَبِيرِنَا, وَذَكَرِنَا, وَأُنْثَانَا, اَللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى اَلْإِسْلَامِ, وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى اَلْإِيمَانِ, اَللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ, وَلَا تُضِلَّنَا بَعْدَهُ } رَوَاهُ مُسْلِمٌ, وَالْأَرْبَعَةُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی کی نماز جنازہ پڑھتے تو یہ دعا مانگتے «اللهم اغفر لحينا وميتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذكرنا وأنثانا اللهم من أحييته منا فأحيه على الإسلام ومن توفيته منا فتوفه على الإيمان اللهم لا تحرمنا أجره ولا تضلنا بعده» ”اے اللہ! ہمارے زندوں اور مردوں، ہمارے حاضر و غائب، ہمارے چھوٹوں اور بڑوں، ہمارے مردوں اور عورتوں کی مغفرت فرما دے! الٰہی! ہم میں سے جسے تو زندہ رکھے اسے اسلام پر زندہ رکھ اور جسے تو موت دے اسے ایمان کی موت سے سرفراز فرما! الٰہی! ہمیں اس کے اجر و ثواب سے محروم نہ رکھ اور نہ ہمیں اس کے بعد گمراہ ہونے دے۔“",
        "english": "Narrated Abu Hurairah (RA): When Allah's Messenger (ﷺ) offered a funeral prayer, he would say: 'O Allah, forgive our living and our dead, those who are present and those who are absent, our young and our old, our males and our females. O Allah, whomever You keep alive from us, keep him alive upon Islam, and whomever You take unto Yourself, take him upon faith. O Allah, do not deprive us of his reward and do not lead us astray after him.'"
      }
    },

    {
      "id": 459,
      "name": {
        "arabic": " وَعَنْهُ أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ: { إِذَا صَلَّيْتُمْ عَلَى اَلْمَيِّتِ فَأَخْلِصُوا لَهُ اَلدُّعَاءَ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ ابْنُ حِبَّانَ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب تم کسی میت کی نماز جنازہ پڑھو تو خوب خلوص دل سے اس کے لئے دعا کرو۔“ اسے ابوداؤد نے روایت کیا ہے اور ابن حبان نے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"When you offer the funeral prayer for the deceased, make your supplication for him sincere.\" [Reported by Abu Dawud, and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 460,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { أَسْرِعُوا بِالْجَنَازَةِ, فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ, وَإِنْ تَكُ سِوَى ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جنازہ لے جانے میں جلدی کیا کرو۔ اس لئے کہ اگر مرنے والا صالح اور نیک آدمی تھا تو اس کے لئے بہتر ہو گا کہ اسے بہتر جگہ کی طرف جلدی لے جاؤ اور اگر دوسرا ہے (برا آدمی ہے) تو اپنی گردن سے اتار کر رکھ دو۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: 'Hasten with the funeral, for if it is a good one, you are sending it to something better, and if it is otherwise, then it is an evil you are removing from your necks.'"
      }
    },

    {
      "id": 461,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ مَنْ شَهِدَ اَلْجِنَازَةَ حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ, وَمَنْ شَهِدَهَا حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ }. قِيلَ: وَمَا اَلْقِيرَاطَانِ? قَالَ: \"مِثْلُ اَلْجَبَلَيْنِ اَلْعَظِيمَيْنِ\" مُتَّفَقٌ عَلَيْهِ . وَلِمُسْلِمٍ: { حَتَّى تُوضَعَ فِي اَللَّحْدِ } وَلِلْبُخَارِيِّ: { مَنْ تَبِعَ جَنَازَةَ مُسْلِمٍ إِيمَانًا وَاحْتِسَابًا, وَكَانَ مَعَهُ حَتَّى يُصَلَّى عَلَيْهَا وَيُفْرَغَ مِنْ دَفْنِهَا فَإِنَّهُ يَرْجِعُ بِقِيرَاطَيْنِ, كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو شخص جنازہ کے ساتھ جائے یہاں تک کہ اس کی نماز پڑھی جائے اسے ایک قیراط کے برابر ثواب ملے گا اور جو شخص دفن ہونے کے وقت تک حاضر رہے اسے دو قیراط کے برابر اجر ملے گا۔“ دریافت کیا گیا کہ دو قیراط سے کیا مراد ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”دو قیراط دو بڑے پہاڑوں کے برابر۔“ (بخاری ومسلم) اور مسلم کی روایت میں ہے ”میت کو قبر میں اتارے جانے تک حاضر رہے۔“ اور بخاری کی روایت میں ہے ”جس نے کسی مسلمان کے جنازے میں ایمان اور حصول ثواب کی نیت سے شرکت کی اور نماز جنازہ کے اختتام تک اس کے ساتھ بھی رہا اور تدفین سے فراغت کے بعد واپس لوٹا تو وہ دو قیراط لے کر واپس لوٹا۔ ہر قیراط احد پہاڑ کے برابر ہے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"Whoever attends the funeral procession until he offers the funeral prayer for it, will get a reward equal to one Qirat, and whoever accompanies it until it is buried, will get a reward equal to two Qirats.\" It was asked, \"What are two Qirats?\" He replied, \"Like two huge mountains.\" [Agreed upon]. Muslim has: \"Until it is placed in the Lahd (niche in the grave).\" Al-Bukhari has: \"Whoever follows the funeral of a Muslim out of faith and seeking reward, and remains with it until the prayer is offered and the burial is completed, will return with two Qirats, each Qirat being like Mount Uhud.\""
      }
    },

    {
      "id": 462,
      "name": {
        "arabic": "وَعَنْ سَالِمٍ, عَنْ أَبِيهِ - رضى الله عنه - { أَنَّهُ رَأَى اَلنَّبِيَّ - صلى الله عليه وسلم -وَأَبَا بَكْرٍ وَعُمَرَ, يَمْشُونَ أَمَامَ الْجَنَازَةِ } رَوَاهُ اَلْخَمْسَةُ، وَصَحَّحَهُ ابْنُ حِبَّانَ, وَأَعَلَّهُ النَّسَائِيُّ وَطَائِفَةٌ بِالْإِرْسَالِ",
        "urdu": "سیدنا سالم اپنے والد (سیدنا عبداللہ بن عمر رضی اللہ عنہما) سے روایت کرتے ہیں کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم، سیدنا ابوبکر اور عمر رضی اللہ عنہما کو جنازے کے آگے چلتے دیکھا ہے۔ اس کو پانچوں یعنی احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے صحیح قرار دیا ہے۔",
        "english": "Narrated Salim via his father (Ibn 'Umar): He saw the Prophet (ﷺ), Abu Bakr and 'Umar walking in front of the bier (funeral procession)."
      }
    },

    {
      "id": 463,
      "name": {
        "arabic": " وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: { نُهِينَا عَنِ اتِّبَاعِ الْجَنَائِزِ, وَلَمْ يُعْزَمْ عَلَيْنَا } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": "سیدہ ام عطیہ رضی اللہ عنہا سے مروی ہے کہ ہمیں جنازوں میں شرکت سے منع کر دیا گیا مگر یہ ممانعت ہم پر لازمی قرار نہیں دی گئی۔ (بخاری و مسلم)",
        "english": "Narrated Umm 'Atiyyah (RA): We were forbidden from following funeral processions, but it was not made absolute for us. [Agreed upon]."
      }
    },

    {
      "id": 464,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ - رضى الله عنه - أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -قَالَ: { إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا, فَمَنْ تَبِعَهَا فَلَا يَجْلِسْ حَتَّى تُوضَعَ } مُتَّفَقٌ عَلَيْه",
        "urdu": "سیدنا ابوسعید رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تم کسی جنازے کو آتے دیکھو تو کھڑے ہو جاؤ۔ نیز جو شخص جنازے کے ساتھ ہو وہ جنازے کے زمین پر رکھے جانے سے پہلے نہ بیٹھے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Sa'id al-Khudri (RA): Allah's Messenger (ﷺ) said: 'When you see a funeral procession, stand up; and he who accompanies it should not sit down until it is placed (on the ground).'"
      }
    },

    {
      "id": 465,
      "name": {
        "arabic": " وَعَنْ أَبِي إِسْحَاقَ, أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ - رضى الله عنه - { أَدْخَلَ الْمَيِّتَ مِنْ قِبَلِ رِجْلَيِ الْقَبْرَ، وَقَالَ: هَذَا مِنَ السُّنَّةِ } أَخْرَجَهُ أَبُو دَاوُدَ ",
        "urdu": "ابواسحٰق رحمہ اللہ سے مروی ہے کہ عبداللہ بن یزید رضی اللہ عنہ نے میت کو اس کے پاؤں کی طرف سے قبر میں اتارا اور کہا کہ سنت طریقہ یہی ہے۔ (ابوداؤد)",
        "english": "Narrated Abu Ishaq: 'Abdullah bin Yazid (RA) inserted the deceased from the side of the feet of the grave and said, \"This is from the Sunnah.\""
      }
    },

    {
      "id": 466,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا, عَنِ النَّبِيِّ - صلى الله عليه وسلم -قَالَ: { إِذَا وَضَعْتُمْ مَوْتَاكُمْ فِي الْقُبُورِ, فَقُولُوا: بِسْمِ اللَّهِ, وَعَلَى مِلَّةِ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -. } أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے کہ ”جب اپنے مرنے والوں کو قبروں میں اتارو تو «بسم الله وعلى مله رسول الله» (اللہ کے نام کے ساتھ اور رسول اللہ کے دین پر) کہو۔“",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) said: 'When you place your dead in the graves, say: In the name of Allah and after the religion of Allah's Messenger (ﷺ).'"
      }
    },

    {
      "id": 467,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -قَالَ: { كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا } رَوَاهُ أَبُو دَاوُدَ بِإِسْنَادٍ عَلَى شَرْطِ مُسْلِمٍ وَزَادَ ابْنُ مَاجَهْ مِنْ حَدِيثِ أُمِّ سَلَمَةَ: { فِي الْإِثْمِ } ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی مردے کی ہڈی توڑنے (کا گناہ) زندہ انسان کی ہڈی توڑنے کے گناہ کی طرح ہے۔“ اسے ابوداؤد نے مسلم کی شرط کی سند سے روایت کیا ہے اور ابن ماجہ نے ام سلمہ رضی اللہ عنہا سے مروی روایت میں اتنا اضافہ نقل کیا ہے کہ ”گناہ میں۔‏‏‏‏“",
        "english": "Narrated 'Aisha (RA): The Messenger of Allah (ﷺ) said: \"Breaking the bone of a deceased person is like breaking it while he is alive.\" [Reported by Abu Dawud with a chain according to Muslim's conditions. Ibn Majah added from the Hadith of Umm Salamah (RA): \"...in terms of sin.\"]"
      }
    },

    {
      "id": 468,
      "name": {
        "arabic": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ - رضى الله عنه - قَالَ: { أَلْحَدُوا لِي لَحْدًا, وَانْصِبُوا عَلَيَّ اللَّبِنَ نُصْبًا, كَمَا صُنِعَ بِرَسُولِ اللَّهِ - صلى الله عليه وسلم - } رَوَاهُ مُسْلِمٌ. وَلِلْبَيْهَقِيِّ عَنْ جَابِرٍ نَحْوُهُ, وَزَادَ: { وَرُفِعَ قَبْرُهُ عَنِ الْأَرْضِ قَدْرَ شِبْرٍ } وَصَحَّحَهُ ابْنُ حِبَّانَ. وَلِمُسْلِمٍ عَنْهُ: { نَهَى رَسُولُ اَللَّهِ - صلى الله عليه وسلم - أَنْ يُجَصَّصَ الْقَبْرُ, وَأَنْ يُقْعَدَ عَلَيْهِ, وَأَنْ يُبْنَى عَلَيْهِ }",
        "urdu": "سیدنا سعد بن ابی وقاص رضی اللہ عنہ نے فرمایا کہ میرے لیے بغلی لحد والی قبر بنانا اور مجھ پر کچی اینٹیں نصب کرنا جس طرح رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کیا گیا۔ (مسلم) اور بیہقی نے جابر رضی اللہ عنہ سے روایت کیا کہ آپ ﷺ کی قبر زمین سے ایک بالشت برابر اونچی بنائی گئی۔ اور مسلم میں جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے قبر کو پختہ کرنے، اس پر بیٹھنے اور اس پر عمارت تعمیر کرنے سے منع فرمایا۔",
        "english": "Narrated Sa'd bin Abi Waqqas (RA): 'Dig a Lahd (niche) for me and place unburnt bricks over me as was done with Allah's Messenger (ﷺ).' (Muslim). Al-Bayhaqi reported from Jabir (RA) that the Prophet's grave was raised one span above the ground. Muslim reported from Jabir (RA) that the Prophet (ﷺ) forbade plastering graves, sitting on them, or building over them."
      }
    },

    {
      "id": 469,
      "name": {
        "arabic": "وَعَنْ عَامِرِ بْنِ رَبِيعَةَ - رضى الله عنه - { أَنَّ النَّبِيَّ - صلى الله عليه وسلم -صَلَّى عَلَى عُثْمَانَ بْنِ مَظْعُونٍ, وَأَتَى الْقَبْرَ, فَحَثَى عَلَيْهِ ثَلَاثَ حَثَيَاتٍ, وَهُوَ قَائِمٌ } رَوَاهُ اَلدَّارَقُطْنِيّ",
        "urdu": "سیدنا عامر بن ربیعہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے عثمان بن مظعون رضی اللہ عنہ کی نماز جنازہ پڑھی اور ان کی قبر پر تشریف لائے اور کھڑے کھڑے تین لپ مٹی ڈالی۔ (سنن دارقطنی)",
        "english": "Narrated ‘Amir bin Rabi’ah (RA): The Prophet (ﷺ) offered the funeral prayer for ‘Uthman bin Maz’un (RA), then he went to the grave and threw three handfuls of earth over it while he was standing. [Reported by ad-Daraqutni]."
      }
    },

    {
      "id": 470,
      "name": {
        "arabic": "وَعَنْ عُثْمَانَ - رضى الله عنه - قَالَ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -إِذَا فَرَغَ مِنْ دَفْنِ الْمَيِّتِ وَقَفَ عَلَيْهِ وَقَالَ: \"اِسْتَغْفِرُوا لِأَخِيكُمْ وَسَلُوا لَهُ التَّثْبِيتَ, فَإِنَّهُ الْآنَ يُسْأَلُ\" } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ الْحَاكِمُ",
        "urdu": "سیدنا عثمان رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب میت کی تدفین سے فارغ ہو جاتے تو قبر پر کھڑے ہو جاتے اور فرماتے کہ ”اپنے بھائی کیلئے بخشش مانگو اور ثابت قدم رہنے کی دعا کرو کیونکہ اب اس سے بازپرس کی جائے گی۔“",
        "english": "Narrated 'Uthman (RA): Whenever the Prophet (ﷺ) finished burying the dead, he would stay by him and say, 'Seek forgiveness for your brother and ask for steadfastness for him, for he is being questioned now.'"
      }
    },

    {
      "id": 471,
      "name": {
        "arabic": " وَعَنْ ضَمْرَةَ بْنِ حَبِيبٍ أَحَدِ التَّابِعِينَ قَالَ: { كَانُوا يَسْتَحِبُّونَ إِذَا سُوِّيَ عَلَى الْمَيِّتِ قَبْرُهُ, وَانْصَرَفَ اَلنَّاسُ عَنْهُ, أَنْ يُقَالَ عِنْدَ قَبْرِهِ: يَا فُلَانُ! قُلْ: لَا إِلَهَ إِلَّا اَللَّهَ. ثَلَاثُ مَرَّاتٍ, يَا فُلَانُ! قُلْ: رَبِّيَ اللَّهُ, وَدِينِيَ الْإِسْلَامُ, وَنَبِيِّ مُحَمَّدٌ - صلى الله عليه وسلم -} رَوَاهُ سَعِيدُ بْنُ مَنْصُورٍ مَوْقُوفًا . وَلِلطَّبَرَانِيِّ نَحْوُهُ مِنْ حَدِيثِ أَبِي أُمَامَةَ مَرْفُوعًا مُطَوَّلًا",
        "urdu": "سیدنا ضمرہ بن حبیب رحمہ اللہ جو ایک تابعی ہیں، سے مروی ہے کہ لوگ مستحب سمجھتے تھے کہ جب میت کی قبر برابر و ہموار کر دی جاتی اور لوگ جب جانے لگتے تو قبر کے پاس کھڑے ہو کر میت کو مخاطب ہو کر یوں کہا جائے ”اے فلاں! «لا إله إلا الله» کہو اللہ کے سوا کوئی معبود برحق نہیں“ اس کو تین مرتبہ کہے ”اے فلاں! «ربي الله وديني الإسلام ونبيي محمد» کہو میرا رب اللہ ہے، میرا دین اسلام ہے اور محمد صلی اللہ علیہ وسلم میرے نبی ہیں۔“ سعید بن منصور نے اسے موقوف بیان کیا ہے اور طبرانی نے اسی طرح کی ابوامامہ رضی اللہ عنہ کی لمبی مرفوع حدیث بیان کی ہے۔",
        "english": "Narrated Damrah bin Habib (a Tabi'i): They used to recommend that when the grave had been leveled over the deceased and the people had left, it should be said by the side of the grave: \"O so-and-so, say: There is no god but Allah\" (three times). \"O so-and-so, say: My Lord is Allah, my religion is Islam, and my Prophet is Muhammad (ﷺ).\" [Reported by Sa'id bin Mansur in a Muwquf form, and al-Tabarani reported something similar from Abu Umama in a lengthy Marfu' form]."
      }
    },

    {
      "id": 472,
      "name": {
        "arabic": "وَعَنْ بُرَيْدَةَ بْنِ الْحَصِيبِ الْأَسْلَمِيِّ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا } رَوَاهُ مُسْلِمٌ. زَادَ اَلتِّرْمِذِيُّ: { فَإِنَّهَا تُذَكِّرُ الْآخِرَةَ } زَادَ ابْنُ مَاجَهْ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ: { وَتُزَهِّدُ فِي الدُّنْيَا }",
        "urdu": "سیدنا بریدہ بن حصیب اسلمی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے تمہیں قبروں کی زیارت سے منع کیا تھا۔ اب ان کی زیارت کرو۔“ (مسلم) ترمذی نے اتنا اضافہ کیا ہے کہ ”قبروں کی زیارت آخرت کی یاد دلاتی ہے۔“ اور ابن ماجہ نے ابن مسعود رضی اللہ عنہما کی روایت میں اتنا اضافہ کیا ہے کہ ”یہ زیارت دنیا سے بے رغبت بنا دیتی ہے۔“",
        "english": "Narrated Buraidah bin al-Haseeb al-Aslami (RA): Allah's Messenger (ﷺ) said: 'I used to forbid you from visiting graves, but now you may visit them.' (Reported by Muslim). At-Tirmidhi added: 'For they remind you of the Hereafter.' Ibn Majah added from the Hadith of Ibn Mas'ud: 'And they make one indifferent to the world.'"
      }
    },

    {
      "id": 473,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - { أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -لَعَنَ زَائِرَاتِ الْقُبُورِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ .",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبروں کی زیارت کرنے والی خواتین پر لعنت فرمائی ہے۔ اسے ترمذی نے نکالا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) cursed women who frequently visit graves. [Reported by at-Tirmidhi, and Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 474,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ - رضى الله عنه - قَالَ : { لَعَنَ رَسُولُ اللَّهِ - صلى الله عليه وسلم -اَلنَّائِحَةَ , وَالْمُسْتَمِعَةَ } أَخْرَجَهُ أَبُو دَاوُدَ .",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے نوحہ کرنے والی اور اسے (غور سے) سننے والی پر لعنت فرمائی ہے۔",
        "english": "Narrated Abu Sa'id al-Khudri (RA): Allah's Messenger (ﷺ) cursed the woman who wails over the dead and the woman who listens to her."
      }
    },

    {
      "id": 475,
      "name": {
        "arabic": "وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: { أَخَذَ عَلَيْنَا رَسُولُ اَللَّهِ - صلى الله عليه وسلم -أَنْ لَا نَنُوحَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ ام عطیہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے بیعت کے موقع پر یہ عہد لیا تھا کہ ہم میت پر نوحہ نہیں کریں گی۔ (بخاری و مسلم)",
        "english": "Narrated Umm 'Atiyyah (RA): Allah's Messenger (ﷺ) made us take a pledge that we would not wail (over the dead). [Agreed upon]."
      }
    },

    {
      "id": 476,
      "name": {
        "arabic": "وَعَنْ ابْن عُمَرَ - رضى الله عنه - عَنِ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { اَلْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِمَا نِيحَ عَلَيْهِ } مُتَّفَقٌ عَلَيْه ِ وَلَهُمَا: نَحْوُهُ عَنِ الْمُغِيرَةِ بْنِ شُعْبَة",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مرنے والے کو اس پر نوحہ کرنے والوں کے سبب سے قبر میں عذاب دیا جاتا ہے۔“ (بخاری و مسلم) نیز ان دونوں نے مغیرہ بن شعبہ رضی اللہ عنہ کے واسطہ سے اسی طرح روایت بیان کی ہے۔",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) said: 'The deceased is punished in his grave because of the wailing done over him.' [Agreed upon]. Al-Bukhari and Muslim also narrated something similar from al-Mughirah bin Shu'bah (RA)."
      }
    },

    {
      "id": 477,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ - رضى الله عنه - قَالَ: { شَهِدْتُ بِنْتًا لِلنَّبِيِّ - صلى الله عليه وسلم -تُدْفَنُ , وَرَسُولُ اَللَّهِ - صلى الله عليه وسلم -جَالِسٌ عِنْدَ اَلْقَبْرِ، فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ } رَوَاهُ اَلْبُخَارِيّ ُ ",
        "urdu": "سیدنا انس رضی اللہ عنہ کا بیان ہے کہ میں نبی کریم صلی اللہ علیہ وسلم کی ایک صاحبزادی کی تدفین کے موقع پر حاضر تھا۔ رسول اللہ صلی اللہ علیہ وسلم قبر کے پاس بیٹھے ہوئے تھے کہ میں نے دیکھا آپ صلی اللہ علیہ وسلم کی دونوں آنکھوں سے آنسو جاری تھے۔ (بخاری)",
        "english": "Narrated Anas (RA): I attended the funeral of one of the daughters of the Prophet (ﷺ) while the Messenger of Allah (ﷺ) was sitting by the grave. I saw his eyes shedding tears. [Reported by Al-Bukhari]."
      }
    },

    {
      "id": 478,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ - رضى الله عنه - أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ: { لَا تَدْفِنُوا مَوْتَاكُمْ بِاللَّيْلِ إِلَّا أَنْ تُضْطَرُّوا } أَخْرَجَهُ ابْنُ مَاجَهْ. وَأَصْلُهُ فِي \"مُسْلِمٍ\", لَكِنْ قَالَ: زَجَرَ أَنْ يُقْبَرَ اَلرَّجُلُ بِاللَّيْلِ, حَتَّى يُصَلَّى عَلَيْهِ.",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ”اپنے مرنے والوں کو رات کے اوقات میں دفن نہ کرو الایہ کہ تم اس کے لئے مجبور ہو جاؤ۔“ (ابن ماجہ) اس کی اصل مسلم میں ہے لیکن اسی میں ہے کہ آپ صلی اللہ علیہ وسلم نے رات کو دفن کرنے پر ڈانٹا الایہ کہ نماز جنازہ پڑھ لی جائے۔",
        "english": "Narrated Jabir (RA): The Prophet (ﷺ) said: 'Do not bury your dead at night unless you are forced to do so.' (Reported by Ibn Majah). Its origin is in Muslim, which states that the Prophet (ﷺ) rebuked that a man should be buried at night until the funeral prayer had been offered for him."
      }
    },

    {
      "id": 479,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ جَعْفَرٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { لَمَّا جَاءَ نَعْيُ جَعْفَرٍ -حِينَ قُتِلَ - قَالَ اَلنَّبِيُّ - صلى الله عليه وسلم - \"اصْنَعُوا لِآلِ جَعْفَرٍ طَعَامًا, فَقَدْ أَتَاهُمْ مَا يَشْغَلُهُمْ\" } أَخْرَجَهُ الْخَمْسَةُ, إِلَّا النَّسَائِيّ َ ",
        "urdu": " سیدنا عبداللہ بن جعفر رضی اللہ عنہ سے روایت ہے کہ جب جعفر بن ابی طالب رضی اللہ عنہ کی شہادت کی خبر موصول ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ”جعفر کے گھر والوں کے لئے کھانا تیار کرو۔ ان کو ایسی تکلیف دہ اطلاع ملی ہے جو ان کو کھانا پکانے سے مشغول رکھے گی۔“ نسائی کے علاوہ اسے پانچوں نے روایت کیا ہے۔",
        "english": "Narrated ‘Abdullah bin Ja’far (RA): When the news of the death of Ja’far (RA) was received, the Prophet (ﷺ) said: \"Prepare some food for the family of Ja’far, for indeed there has come to them that which keeps them busy (from making food for themselves).\" [Reported by the five, except an-Nasa'i]."
      }
    },

    {
      "id": 480,
      "name": {
        "arabic": "وَعَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى اَلمَقَابِرِ: { اَلسَّلَامُ عَلَى أَهْلِ اَلدِّيَارِ مِنَ اَلْمُؤْمِنِينَ وَالْمُسْلِمِينَ, وَإِنَّا إِنْ شَاءَ اَللَّهُ بِكُمْ لَلَاحِقُونَ, أَسْأَلُ اَللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا سلیمان بن بریدہ رحمہ اللہ اپنے والد سے روایت کرتے ہیں کہ صحابہ کرام رضی اللہ عنہم اجمعین جب قبرستان جاتے تو رسول اللہ صلی اللہ علیہ وسلم ان کو سکھلاتے کہ یوں کہو «السلام على أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله بكم للاحقون أسأل الله لنا ولكم العافية» ”اہل دیار مومنوں اور مسلمانوں پر سلام ہو! یقیناً، انشاء اللہ ہم بھی آپ کے ساتھ ملنے والے ہیں اور ہم اپنے لیے اور آپ کے لیے اللہ سے عافیت مانگتے ہیں۔“ (مسلم)",
        "english": "Narrated Sulaiman bin Buraidah via his father: Allah's Messenger (ﷺ) used to teach them when they went out to the graveyards to say: 'Peace be upon you, O inhabitants of the abodes of believers and Muslims. We shall, if Allah wills, join you. I beg of Allah well-being for us and for you.'"
      }
    },

    {
      "id": 481,
      "name": {
        "arabic": "وَعَنْ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { مَرَّ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -بِقُبُورِ اَلْمَدِينَةِ, فَأَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ: \"اَلسَّلَامُ عَلَيْكُمْ يَا أَهْلَ اَلْقُبُورِ, يَغْفِرُ اَللَّهُ لَنَا وَلَكُمْ, أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ\" } رَوَاهُ اَلتِّرْمِذِيُّ, وَقَالَ: حَسَنٌ",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا گزر مدینہ کے قبرستان سے ہوا۔ آپ صلی اللہ علیہ وسلم ان کی طرف متوجہ ہوئے اور فرمایا «السلام عليكم يا أهل القبور يغفر الله لنا ولكم، ‏‏‏‏‏‏‏‏ أنتم سلفنا، ‏‏‏‏‏‏‏‏ ونحن بالأثر» ”اے اہل قبور! تم پر سلام ہو! اللہ ہماری اور تمہاری مغفرت فرمائے! تم ہمارے پیش رو ہو ہم تمہارے پیچھے چلے آ رہے ہیں۔“ اسے ترمذی نے روایت کیا اور حسن قرار دیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Messenger of Allah (ﷺ) passed by some graves in Madinah. He turned his face towards them and said: \"Peace be upon you, O people of the graves! May Allah forgive us and you. You are our predecessors, and we are following in your footsteps.\""
      }
    },

    {
      "id": 482,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ لَا تَسُبُّوا الْأَمْوَاتَ, فَإِنَّهمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا } رَوَاهُ اَلْبُخَارِيُّ وَرَوَى اَلتِّرْمِذِيُّ عَنِ اَلمُغِيرَةِ نَحْوَهُ, لَكِنْ قَالَ: { فَتُؤْذُوا الْأَحْيَاءَ }",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” مردوں کو گالی مت دو کیونکہ وہ اس تک پہنچ چکے ہیں جو انہوں نے آگے بھیجا۔ “ (بخاری) ترمذی نے مغیرہ کے حوالہ سے اسی طرح روایت کیا ہے لیکن اس میں «فتؤذوا الأحياء» ‏‏‏‏ ہے یعنی تم (گالی دے کر) زندہ لوگوں کو تکلیف دیتے ہو۔",
        "english": "Narrated 'Aishah (RA): Allah's Messenger (ﷺ) said: 'Do not abuse the dead, for they have reached what they sent forward (their deeds).' (Reported by Al-Bukhari). At-Tirmidhi reported something similar from Al-Mughirah, but with the wording: 'Lest you hurt the living.'"
      }
    }
  ]
}
