{
  "chapId": 50,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 742,
    "to": 749
  },
  "hadiths": [
    {
      "id": 742,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ قَالَ اَللَّهُ: أَنَا ثَالِثُ اَلشَّرِيكَيْنِ مَا لَمْ يَخُنْ أَحَدُهُمَا صَاحِبَهُ, فَإِذَا خَانَ خَرَجْتُ مِنْ بَيْنِهِمَا } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” اللہ جل شانہ کا ارشاد گرامی ہے کہ دو شراکت کرنے والوں میں، میں تیسرا ہوتا ہوں تاوقتیکہ کوئی ایک دوسرے سے خیانت نہ کرے جونہی ان میں سے کوئی ایک خیانت کا مرتکب ہوتا ہے تو میں ان کے درمیان میں سے نکل جاتا ہوں۔ ”ابوداؤد نے اسے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"Allah the Exalted says: 'I am the third of two partners as long as one of them does not betray his companion. But when he betrays him, I depart from them.'\" [Reported by Abu Dawud, and Al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 743,
      "name": {
        "arabic": "وَعَنْ اَلسَّائِبِ اَلْمَخْزُومِيِّ { أَنَّهُ كَانَ شَرِيكَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَبْلَ اَلْبَعْثَةِ, فَجَاءَ يَوْمَ اَلْفَتْحِ, فَقَالَ: \" مَرْحَباً بِأَخِي وَشَرِيكِي } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَابْنُ مَاجَةَ ",
        "urdu": "سیدنا سائب مخزومی رضی اللہ عنہ سے مروی ہے کہ وہ نبی کریم ﷺ کی بعثت (نبوت) سے پہلے آپ ﷺ کے تجارتی شریک (پارٹنر) تھے۔ جب وہ فتح مکہ کے دن حاضر ہوئے تو آپ ﷺ نے (انہیں دیکھ کر) فرمایا: ”خوش آمدید اے میرے بھائی اور میرے شریک!۔“",
        "english": "Narrated As-Sa'ib al-Makhzumi (R.A): He was the Prophet's partner in business before his mission. On the day of the Conquest of Makkah, he came to the Prophet (peace be upon him), who said: \"Welcome, O my brother and my partner!\""
      }
    },

    {
      "id": 744,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: { اِشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ فِيمَا نُصِيبُ يَوْمَ بَدْرٍ.‏.‏ } اَلْحَدِيثَ.‏ رَوَاهُ النَّسَائِيُّ وَغَيْرُهُ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے روایت ہے کہ میں نے، عمار بن یاسر اور سعد رضی اللہ عنہم نے شراکت کی ان چیزوں میں جو ہمیں بدر کے روز حاصل ہوئیں۔ اس حدیث کا آخری حصہ یوں ہے کہ سعد رضی اللہ عنہ اس روز دو قیدی لے کر آئے، میں اور عمار رضی اللہ عنہ کوئی بھی چیز نہ لائے۔ اسے نسائی وغیرہ نے روایت کیا ہے۔",
        "english": "Narrated 'Abdullah bin Mas'ud (RA): Ammar, Sa'd and I entered into a partnership regarding what we would receive on the day of Badr. Sa'd brought two prisoners, while 'Ammar and I brought nothing. [Reported by an-Nasa'i and others]."
      }
    },

    {
      "id": 745,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: أَرَدْتُ اَلْخُرُوجَ إِلَى خَيْبَرَ, فَأَتَيْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: { إِذَا أَتَيْتَ وَكِيلِي بِخَيْبَرَ, فَخُذْ مِنْهُ خَمْسَةَ عَشَرَ وَسْقًا } رَوَاهُ أَبُو دَاوُدَ وَصَحَّحَهُ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ میں نے (تجارت یا کسی کام سے) خیبر جانے کا ارادہ کیا تو میں نبی کریم ﷺ کی خدمت میں حاضر ہوا۔ آپ ﷺ نے فرمایا: ”جب تم خیبر میں میرے وکیل (نمائندے) کے پاس پہنچو، تو اس سے پندرہ وسق (غلہ یا کھجور) وصول کر لینا۔“",
        "english": "Narrated Jabir bin 'Abdullah (R.A): I intended to go to Khaibar, so I came to the Prophet (peace be upon him) and he said: \"When you come to my agent (Wakil) in Khaibar, take from him fifteen Wasaqs (of dates or grain).\""
      }
    },

    {
      "id": 746,
      "name": {
        "arabic": "وَعَنْ عُرْوَةَ الْبَارِقِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بَعَثَ مَعَهُ بِدِينَارٍ يَشْتَرِي لَهُ أُضْحِيَّةً.‏.‏ } اَلْحَدِيثَ.‏ رَوَاهُ اَلْبُخَارِيُّ فِي أَثْنَاءِ حَدِيثٍ, وَقَدْ تَقَدَّمَ",
        "urdu": "سیدنا عروہ بارقی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے ایک دینار دے کر بھیجا تاکہ آپ صلی اللہ علیہ وسلم کیلئے قربانی کا جانور خرید کر لائے۔ بخاری نے اسے حدیث کی ایک طویل روایت کے دوران بیان کیا ہے، جو پہلے بھی گزر چکی ہے۔",
        "english": "Narrated 'Urwah al-Bariqi (RA): The Messenger of Allah (ﷺ) sent him with a Dinar to buy a sacrificial animal for him. [Reported by al-Bukhari as part of a longer Hadith mentioned previously]."
      }
    },

    {
      "id": 747,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { بَعَثَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عُمَرَ عَلَى اَلصَّدَقَةِ.‏.‏ } اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے عمر رضی اللہ عنہ کو زکوٰۃ وصول کرنے پر تحصیلدار (وکیل/نمائندہ) مقرر فرما کر بھیجا۔ (الحدیث)",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) sent 'Umar to collect Sadaqah (Zakat)... (to the end of the Hadith)."
      }
    },

    {
      "id": 748,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ رَضِيَ اَللَّهُ عَنْهُ { أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم نَحَرَ ثَلَاثًا وَسِتِّينَ, وَأَمَرَ عَلِيًّا أَنْ يَذْبَحَ اَلْبَاقِيَ } اَلْحَدِيثَ. رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے (حجۃ الوداع کے موقع پر) تریسٹھ (63) اونٹ خود اپنے ہاتھ سے نحر کیے اور سیدنا علی رضی اللہ عنہ کو حکم دیا کہ باقی (سینتیس) اونٹ وہ ذبح کریں۔",
        "english": "Narrated Jabir (RA): The Prophet (ﷺ) sacrificed sixty-three (camels) with his own hand and commanded 'Ali (RA) to sacrifice the remainder."
      }
    },

    {
      "id": 749,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- فِي قِصَّةِ اَلْعَسِيفِ.‏ قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ وَاغْدُ يَا أُنَيْسُ عَلَى اِمْرَأَةِ هَذَا, فَإِنْ اِعْتَرَفَتْ فَارْجُمْهَا.‏.‏ } اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مزدور کے قصہ میں ارشاد فرمایا تھا کہ ”اے انیس! اس عورت کے پاس جاؤ اگر وہ تسلیم کر لے تو اسے سنگسار کر دو۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Regarding the story of the hired servant, the Prophet (ﷺ) said: 'O Unais, go to this man's wife, and if she confesses (to adultery), then stone her to death.' [Agreed upon]"
      }
    }
  ]
}
