{
  "chapId": 74,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 936,
    "to": 944
  },
  "hadiths": [
    {
      "id": 936,
      "name": {
        "arabic": "عَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { سَأَلَ فُلَانٌ فَقَالَ: يَا رَسُولَ اَللَّهِ! أَرَأَيْتَ أَنْ لَوْ وَجَدَ أَحَدُنَا اِمْرَأَتَهُ عَلَى فَاحِشَةٍ, كَيْفَ يَصْنَعُ? إِنْ تَكَلَّمَ تَكَلَّمَ بِأَمْرٍ عَظِيمٍ, وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ! فَلَمْ يُجِبْهُ, فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ, فَقَالَ: إِنَّ اَلَّذِي سَأَلْتُكَ عَنْهُ قَدِ ابْتُلِيتُ بِهِ, فَأَنْزَلَ اَللَّهَ اَلْآيَاتِ فِي سُورَةِ اَلنِّسَاءِ (سورۃ النور), فَتَلَاهُنَّ عَلَيْهِ وَوَعَظَهُ وَذَكَّرَهُ، وَأَخْبَرَهُ أَنَّ عَذَابَ اَلدُّنْيَا أَهْوَنُ مِنْ عَذَابِ اَلْآخِرَةِ.‏ قَالَ: لَا, وَاَلَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ عَلَيْهَا, ثُمَّ دَعَاهَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَوَعَظَهَا كَذَلِكَ, قَالَتْ: لَا, وَاَلَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ, فَبَدَأَ بِالرَّجُلِ, فَشَهِدَ أَرْبَعَ شَهَادَاتٍ, ثُمَّ ثَنَّى بِالْمَرْأَةِ, ثُمَّ فَرَّقَ بَيْنَهُمَا.‏ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ فلاں صاحب نے سوال کیا اے اللہ کے رسول! بتائیے اگر ہم میں سے کوئی اپنی اہلیہ کو فاحشہ فعل میں مبتلا پائے تو وہ کیا کرے؟ اگر وہ اسے دوسروں سے بیان کرتا ہے تو یہ نہایت قبیح فعل ہے اور اگر خاموش رہتا ہے تو یہ بھی نہایت قبیح فعل ہے۔ آپ صلی اللہ علیہ وسلم نے اس کا کوئی جواب نہ دیا۔ پھر بعد میں جب وہ آیا تو اس نے کہا کہ تحقیق جو کچھ میں نے آپ صلی اللہ علیہ وسلم سے پوچھا ہے، میں خود ہی اس میں مبتلا ہوں۔ پس اللہ تعالیٰ نے سورۃ النور کی آیات نازل فرمائیں۔ آپ صلی اللہ علیہ وسلم نے وہ آیات اس کے سامنے پڑھیں اور اسے نصیحت فرمائی اور اللہ کی سزا یاد کرائی اور فرمایا کہ ”دنیا کا عذاب آخرت کے عذاب سے بہت ہلکا ہے۔ وہ بولا نہیں قسم ہے اس ذات کی جس نے آپ صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث فرمایا ہے، میں نے اس پر جھوٹا الزام نہیں لگایا ہے۔“ پھر رسول اللہ صلی اللہ علیہ وسلم نے اس عورت کو بلوایا اور اسے بھی اسی طرح نصیحت فرمائی۔ وہ بھی بولی نہیں اس خدا کی قسم! جس نے آپ صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث فرمایا ہے یقیناً وہ مرد جھوٹا ہے۔ پھر آپ صلی اللہ علیہ وسلم نے اس مرد سے آغاز فرمایا۔ اس مرد نے چار قسمیں کھائیں پھر آپ صلی اللہ علیہ وسلم نے عورت سے بھی قسمیں لیں اور دونوں کے درمیان تفریق فرما دی۔ (مسلم)",
        "english": "Narrated Ibn 'Umar (RA): A person asked, \"O Messenger of Allah! What do you think if one of us finds his wife committing adultery, what should he do? If he speaks, he speaks of a grave matter, and if he remains silent, he remains silent on such (a grave matter).\" The Prophet (ﷺ) did not answer him. Later the man came and said, \"The matter about which I asked you, I have been afflicted with it.\" Then Allah revealed the verses in Surah An-Nur. The Prophet (ﷺ) recited them to him, exhorted him, and reminded him that the punishment of this world is lighter than the punishment of the Hereafter. The man said, \"No, by Him Who sent you with the truth, I have not lied against her.\" Then the Prophet (ﷺ) called the woman and exhorted her similarly. She said, \"No, by Him Who sent you with the truth, he is a liar.\" The Prophet (ﷺ) then started with the man, who testified four times, then with the woman, and finally, he separated them. [Reported by Muslim]."
      }
    },

    {
      "id": 937,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ أَيْضًا { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ لِلْمُتَلَاعِنَيْنِ: \"حِسَابُكُمَا عَلَى اَللَّهِ تَعَالَى, أَحَدُكُمَا كَاذِبٌ, لَا سَبِيلَ لَكَ عَلَيْهَا\" قَالَ: يَا رَسُولَ اَللَّهِ! مَالِي? قَالَ: \"إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا, فَهُوَ بِمَا اِسْتَحْلَلْتَ مِنْ فَرْجِهَا, وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا, فَذَاكَ أَبْعَدُ لَكَ مِنْهَا\" } مُتَّفَقٌ عَلَيْه",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے لعان کرنے والے زوجین سے فرمایا ”تم دونوں کا حساب اللہ کے ذمہ ہے۔ دونوں میں سے ایک تو جھوٹا ہے، اب تیرا اس عورت پر کوئی حق نہیں۔“ اس نے عرض کیا اے اللہ کے رسول! میرا مال (مہر) مجھے دلوا دیجئیے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اگر تو نے اس پر سچا الزام لگایا ہے تو پھر یہ مال اس لذت صحبت کا معاوضہ ہے جو حلال کر کے تو نے اس سے حاصل کی ہے اور اگر تو نے اس پر جھوٹا الزام لگایا ہے تو مال تجھ سے اور بھی دور ہو گیا۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said to a couple who had engaged in Li'an (oath of condemnation): 'Your account is with Allah. One of you is a liar. You have no more right over her.' The man asked, 'O Messenger of Allah, what about my money (Mahr)?' He replied, 'If you told the truth, the money is for the intimacy you enjoyed with her. If you lied, it is even further beyond your reach.'"
      }
    },

    {
      "id": 938,
      "name": {
        "arabic": "وَعَنِ أَنَسٍ, أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَبْصِرُوهَا, فَإِنْ جَاءَتْ بِهِ أَبْيَضَ سَبِطًا فَهُوَ لِزَوْجِهَا, وَإِنْ جَاءَتْ بِهِ أَكْحَلَ جَعْدًا, فَهُوَ اَلَّذِي رَمَاهَا بِهِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”عورت پر نظر رکھو اگر اس نے سفید رنگ کا سیدھے بالوں والا بچہ جنم دیا تو وہ اس کے شوہر کا ہے اور اگر اس نے ایسا بچہ جنم دیا جس کی آنکھیں سرمگیں اور بال گھونگھریالے ہوں تو پھر وہ بچہ اس کا ہو گا جس کے متعلق شوہر نے اس پر تہمت لگائی۔“ (بخاری و مسلم)",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) said, \"Observe her; if she gives birth to a white child with straight hair, then it belongs to her husband; but if she gives birth to a child with black eyes and curly hair, then it belongs to the man he (the husband) accused her of.\" [Agreed upon]."
      }
    },

    {
      "id": 939,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَمَرَ رَجُلاً أَنْ يَضَعَ يَدَهُ عِنْدَ اَلْخَامِسَةِ عَلَى فِيهِ, وَقَالَ: \"إِنَّهَا مُوجِبَةٌ\" } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَرِجَالُهُ ثِقَاتٌ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو حکم دیا کہ ”وہ پانچویں قسم کے وقت (لعان کرنے والے کے) منہ پر ہاتھ رکھ دے۔“ اور آپ صلی اللہ علیہ وسلم نے فرمایا ”یہ پانچویں قسم (اللہ کے غضب یا لعنت کو) واجب کرنے والی ہے۔“ ابوداؤد و نسائی، اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) commanded a man to place his hand over the mouth of the person performing Li'an at the fifth testimony, and he (ﷺ) said, 'Indeed, it (the fifth oath) is the one that brings (the punishment/curse).'"
      }
    },

    {
      "id": 940,
      "name": {
        "arabic": " وَعَنْ سَهْلِ بْنِ سَعْدٍ ‏-فِي قِصَّةِ اَلْمُتَلَاعِنَيْنِ‏- قَالَ: { فَلَمَّا فَرَغَا مِنْ تَلَاعُنِهِمَا قَالَ: كَذَبْتُ عَلَيْهَا يَا رَسُولَ اَللَّهِ! إِنْ أَمْسَكْتُهَا, فَطَلَّقَهَا ثَلَاثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-} مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا سہل بن سعد رضی اللہ عنہ سے لعان کرنے والوں کے قصہ میں مروی ہے کہ جب دونوں لعان سے فارغ ہو گئے تو مرد بولا: اے اللہ کے رسول! اگر میں اب اسے اپنے پاس روک لوں تو اس کا مطلب یہ ہوگا کہ میں نے اس پر جھوٹا الزام لگایا تھا۔ پھر اس نے رسول اللہ ﷺ کے حکم دینے سے پہلے ہی اسے تین طلاقیں دے دیں۔ (بخاری و مسلم)",
        "english": "Narrated Sahl bin Sa'd (RA) regarding the story of those who performed Li'an: When they both finished their Li'an, the man said, 'O Messenger of Allah! I would be lying against her if I kept her.' So he divorced her three times before the Messenger of Allah (ﷺ) could command him. [Agreed upon]."
      }
    },

    {
      "id": 941,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ رَجُلاً جَاءَ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: إِنَّ اِمْرَأَتِي لَا تَرُدُّ يَدَ لَامِسٍ.‏ قَالَ: \"غَرِّبْهَا\".‏ قَالَ: أَخَافُ أَنْ تَتْبَعَهَا نَفْسِي.‏ قَالَ: \"فَاسْتَمْتِعْ بِهَا\".‏ } رَوَاهُ أَبُو دَاوُدَ, وَالْبَزَّارُ, وَرِجَالُهُ ثِقَاتٌ.‏وَأَخْرَجَهُ النَّسَائِيُّ مِنْ وَجْهٍ آخَرَ: عَنِ اِبْنِ عَبَّاسٍ بِلَفْظٍ { قَالَ: طَلِّقْهَا.‏ قَالَ: لَا أَصْبِرُ عَنْهَا.‏ قَالَ: \"فَأَمْسِكْهَا }",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا۔ اے اللہ کے رسول! میری بیوی کسی چھونے والے کا ہاتھ نہیں روکتی (یعنی اس کی عفت مشکوک ہے)۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اسے اپنے سے جدا کر دو۔“ وہ بولا مجھے اندیشہ ہے کہ میرا دل اس کے پیچھے لگا رہے گا (یعنی میں اس سے شدید محبت کرتا ہوں)۔ تو آپ ﷺ نے فرمایا ”پھر اس سے فائدہ اٹھاتا رہ۔“ اسے ابوداؤد اور بزار نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔ نسائی کے الفاظ ہیں: ”اسے طلاق دے دو۔“ اس نے کہا: میں اس کے بغیر صبر نہیں کر سکتا۔ آپ ﷺ نے فرمایا: ”پھر اسے اپنے پاس روکے رکھو۔“",
        "english": "Narrated Ibn 'Abbas (RA): A man came to the Prophet (ﷺ) and said, 'My wife does not repel the hand of any toucher (indicating she is very loose or unchaste).' The Prophet (ﷺ) said, 'Separate from her (divorce her).' He said, 'I fear that my soul will follow her (I love her too much).' The Prophet (ﷺ) then said, 'Then enjoy her.' Reported by Abu Dawud and al-Bazzar with reliable narrators. An-Nasa'i reported it with the wording: 'Divorce her.' He said, 'I cannot bear to be without her.' He (ﷺ) said, 'Then keep her.'"
      }
    },

    {
      "id": 942,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ ‏-حِينَ نَزَلَتْ آيَةُ اَلْمُتَلَاعِنَيْنِ‏-: \"أَيُّمَا اِمْرَأَةٍ أَدْخَلَتْ عَلَى قَوْمٍ مَنْ لَيْسَ مِنْهُمْ, فَلَيْسَتْ مِنْ اَللَّهِ فِي شَيْءٍ, وَلَنْ يُدْخِلَهَا اَللَّهُ جَنَّتَهُ, وَأَيُّمَا رَجُلٍ جَحَدَ وَلَدَهُ ‏-وَهُوَ يَنْظُرُ إِلَيْهِ‏- اِحْتَجَبَ اَللَّهُ عَنْهُ, وَفَضَحَهُ اَللَّهُ عَلَى رُءُوسِ اَلْخَلَائِقِ اَلْأَوَّلِينَ وَالْآخِرِينَ } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ جب لعان کرنے والوں کے بارے میں آیت نازل ہوئی تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم فرماتے تھے ”جو عورت کسی قوم میں ایسا بچہ لا داخل کرے جو اس میں سے نہ ہو (یعنی زنا کے ذریعے غیر کا بچہ اپنے شوہر کے سر تھوپ دے) تو اس عورت کا اللہ تعالیٰ سے کوئی تعلق نہیں اور اللہ تعالیٰ ایسی عورت کو ہرگز اپنی جنت میں داخل نہیں کرے گا اور جس مرد نے اپنے بچہ کا انکار کیا (یعنی تہمت لگا کر اپنا بیٹا ہونے سے مکر گیا) جبکہ وہ بچہ اس کی طرف دیکھ رہا ہو تو قیامت کے روز اللہ تعالیٰ اس سے پردہ فرما لے گا اور اسے اپنی پہلی اور پچھلی ساری مخلوق کے سامنے رسوا و ذلیل کرے گا۔“ اسے ابوداؤد، نسائی اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Abu Hurairah (RA): When the verse of Li'an was revealed, the Messenger of Allah (ﷺ) said: 'Any woman who introduces into a people one who does not belong to them (by attributing an illegitimate child to her husband), she has no connection with Allah, and Allah will never admit her into His Paradise. And any man who denies his child while looking at him, Allah will veil Himself from him on the Day of Resurrection and disgrace him in front of all creation, from the beginning to the end.' [Reported by Abu Dawud, An-Nasa'i, and Ibn Majah; Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 943,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { مَنْ أَقَرَّ بِوَلَدٍ طَرْفَةَ عَيْنٍ, فَلَيْسَ لَهُ أَنْ يَنْفِيَهُ } .‏ أَخْرَجَهُ اَلْبَيْهَقِيُّ, وَهُوَ حَسَنٌ مَوْقُوفٌ",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے روایت ہے کہ جس شخص نے ایک لمحہ بھر اپنے بچہ کا اقرار کیا پھر اسے اس کی نفی کرنے کا کوئی اختیار نہیں ہے۔ اسے بیہقی نے روایت کیا ہے اور یہ روایت حسن موقوف ہے۔",
        "english": "Narrated 'Umar (RA): 'Whoever acknowledges a child even for the blink of an eye, he has no right to later deny (disown) him.' Reported by Al-Bayhaqi, and it is a Hasan Mauquf narration."
      }
    },

    {
      "id": 944,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اَللَّهِ! إِنَّ اِمْرَأَتِي وَلَدَتْ غُلَامًا أَسْوَدَ? قَالَ: \"هَلْ لَكَ مِنْ إِبِلٍ?\" قَالَ: نَعَمْ.‏ قَالَ: \"فَمَا أَلْوَانُهَا?\" قَالَ: حُمْرٌ.‏ قَالَ: \"هَلْ فِيهَا مَنْ أَوْرَقَ?\", قَالَ: نَعَمْ.‏ قَالَ: \"فَأَنَّى ذَلِكَ?\", قَالَ: لَعَلَّهُ نَزَعَهُ عِرْقٌ.‏ قَالَ: \"فَلَعَلَّ اِبْنَكَ هَذَا نَزَعَهُ عِرْقٌ\".‏ } مُتَّفَقٌ عَلَيْهِ . وَفِي رِوَايَةٍ لِمُسْلِمٍ: { وَهُوَ يُعَرِّضُ بِأَنْ يَنْفِيَهُ } , وَقَالَ فِي آخِرِهِ: { وَلَمْ يُرَخِّصْ لَهُ فِي اَلِانْتِفَاءِ مِنْهُ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ایک شخص نے عرض کیا، اے اللہ کے رسول! میری بیوی نے کالے رنگ کا بچہ جنا ہے۔ آپ صلی اللہ علیہ وسلم نے اس سے پوچھا ”کیا تمہارے پاس کچھ اونٹ ہیں؟“ تو اس نے کہا ہاں! آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”ان کے رنگ کیا ہیں؟“ اس نے کہا سرخ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”ان میں کوئی خاکستری رنگ کا بھی ہے؟“ اس نے کہا ہاں! آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”وہ کہاں سے آ گیا؟“ وہ بولا کوئی رگ اسے کھینچ لائی ہو گی۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا ”پھر تیرے اس بیٹے کو بھی کوئی رگ کھینچ لائی ہو گی۔“ (بخاری و مسلم) اور مسلم کی ایک روایت میں ہے کہ وہ اس بچے کی نفی (انکار) کی طرف اشارہ کر رہا تھا اور آپ ﷺ نے اسے انکار کی اجازت نہ دی۔",
        "english": "Narrated Abu Hurairah (RA): A man came to the Messenger of Allah (ﷺ) and said, \"O Messenger of Allah! My wife has given birth to a black boy (whereas we are not black).\" The Prophet (ﷺ) asked, \"Do you have camels?\" He said, \"Yes.\" He asked, \"What color are they?\" He said, \"Red.\" He asked, \"Is there any grey (dust-colored) among them?\" He said, \"Yes.\" He asked, \"How did that happen?\" The man said, \"Perhaps it is a strain (heredity/genetic trait) that pulled it.\" The Prophet (ﷺ) said, \"Perhaps this son of yours was pulled by a strain (heredity) as well.\" [Agreed upon]. In Muslim's version, the man was hinting at disowning the child, but the Prophet (ﷺ) did not allow him to do so."
      }
    }
  ]
}
