{
  "chapId": 67,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 881,
    "to": 891
  },
  "hadiths": [
    {
      "id": 881,
      "name": {
        "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ , عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-{ أَنَّهُ أَعْتَقَ صَفِيَّةَ , وَجَعَلَ عِتْقَهَا صَدَاقَهَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے سیدہ صفیہ رضی اللہ عنہا کو (غلامی سے) آزاد کیا اور ان کی اسی آزادی کو ان کا مہر قرار دیا۔ (بخاری و مسلم)",
        "english": "Narrated Anas bin Malik (RA): The Prophet (ﷺ) enfranchised Safiyyah (RA) and made her manumission her dower (Mahr)."
      }
    },

    {
      "id": 882,
      "name": {
        "arabic": "وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ اَلرَّحْمَنِ ; أَنَّهُ قَالَ : { سَأَلْتُ عَائِشَةَ زَوْجَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- كَمْ كَانَ صَدَاقُ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- قَالَتْ : كَانَ صَدَاقُهُ لِأَزْوَاجِهِ ثِنْتَيْ عَشْرَةَ أُوقِيَّةً وَنَشًّا .‏ قَالَتْ : أَتَدْرِي مَا اَلنَّشُّ ? قَالَ : قُلْتُ : لَا .‏ قَالَتْ : نِصْفُ أُوقِيَّةٍ .‏ فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ , فَهَذَا صَدَاقُ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- لِأَزْوَاجِهِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوسلمہ بن عبدالرحمٰن سے روایت ہے کہ میں نے سیدہ عائشہ رضی اللہ عنہا سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم (کی بیویوں) کا مہر کتنا تھا؟ فرمایا آپ صلی اللہ علیہ وسلم کی ازواج مطہرات کا مہر بارہ اوقیہ اور ایک نش تھا، پھر انہوں نے فرمایا، کیا تو جانتا ہے کہ نش کتنا ہوتا ہے؟ میں نے کہا نہیں، انہوں نے فرمایا آدھا اوقیہ۔ اس طرح یہ کل پانچ سو درہم ہوئے۔ بس یہ تھا رسول اللہ صلی اللہ علیہ وسلم کی اکثر ازواج مطہرات کا حق مہر۔ (صحیح مسلم)",
        "english": "Narrated Abu Salama bin 'Abdur-Rahman: I asked 'Aisha (RA), the wife of the Prophet (ﷺ), 'How much was the dower (Mahr) given by Allah's Messenger (ﷺ)?' She said, 'His dower to his wives was twelve Uqiyah and a Nash.' She then asked, 'Do you know what a Nash is?' I said, 'No.' She said, 'It is half an Uqiyah.' That total makes five hundred Dirhams. Such was the dower of Allah's Messenger (ﷺ) to his wives."
      }
    },

    {
      "id": 883,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { لَمَّا تَزَوَّجَ عَلِيٌّ فَاطِمَةَ ‏-عَلَيْهِمَا اَلسَّلَامُ‏- .‏ قَالَ لَهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" أَعْطِهَا شَيْئًا \" , قَالَ : مَا عِنْدِي شَيْءٌ .‏ قَالَ : \" فَأَيْنَ دِرْعُكَ الحُطَمِيَّةُ ? } رَوَاهُ أَبُو دَاوُدَ , وَالنَّسَائِيُّ , وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ جب سیدنا علی رضی اللہ عنہ نے سیدہ فاطمہ رضی اللہ عنہا سے نکاح کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اسے (بطور مہر) کچھ دو۔“ سیدنا علی رضی اللہ عنہ نے عرض کیا: میرے پاس کچھ بھی نہیں۔ آپ ﷺ نے فرمایا: ”تمہاری وہ حطمی زرہ کہاں ہے؟“",
        "english": "Narrated Ibn 'Abbas (RA): When 'Ali (RA) married Fatimah (RA), Allah's Messenger (ﷺ) said to him, \"Give her something.\" He replied, \"I have nothing.\" He (ﷺ) asked, \"Where is your Hutamiyyah armor?\""
      }
    },

    {
      "id": 884,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ , عَنْ أَبِيهِ , عَنْ جَدِّهِ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { أَيُّمَا اِمْرَأَةٍ نَكَحَتْ عَلَى صَدَاقٍ , أَوْ حِبَاءٍ , أَوْ عِدَةٍ , قَبْلَ عِصْمَةِ اَلنِّكَاحِ , فَهُوَ لَهَا, وَمَا كَانَ بَعْدَ عِصْمَةِ اَلنِّكَاحِ , فَهُوَ لِمَنْ أُعْطِيَهُ, وَأَحَقُّ مَا أُكْرِمَ اَلرَّجُلُ عَلَيْهِ اِبْنَتُهُ , أَوْ أُخْتُهُ } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ إِلَّا اَلتِّرْمِذِيَّ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ نے اپنے باپ سے، انہوں نے اپنے دادا سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس عورت کا نکاح مہر، کسی عطیے یا نکاح سے پہلے کسی وعدے کی بنیاد پر کیا جائے تو وہ (سب کچھ) اس عورت کا حق ہے، اور جو عطیہ نکاح کے بعد دیا جائے تو وہ اسی کا ہے جسے دیا گیا ہو۔ اور وہ سب سے بہترین چیز جس پر کسی مرد کی تکریم (تحفہ دے کر) کی جائے، وہ اس کی بیٹی یا اس کی بہن (کا رشتہ) ہے۔“ اسے احمد اور ترمذی کے علاوہ چاروں نے روایت کیا ہے۔",
        "english": "Narrated 'Amr bin Shu'aib, from his father, from his grandfather: The Messenger of Allah (ﷺ) said: 'Any woman who is married on a dower (Mahr), a gift (Hiba'), or a promise ('Idah) before the marriage contract is concluded, it belongs to her. Whatever is given after the marriage contract is concluded, it belongs to the one to whom it was given. And the most deserving thing for which a man is honored (by being given a gift) is his daughter or his sister.'"
      }
    },

    {
      "id": 885,
      "name": {
        "arabic": "وَعَنْ عَلْقَمَةَ , عَنِ ابْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- { أَنَّهُ سُئِلَ عَنْ رَجُلٍ تَزَوَّجَ اِمْرَأَةً , وَلَمْ يَفْرِضْ لَهَا صَدَاقًا , وَلَمْ يَدْخُلْ بِهَا حَتَّى مَاتَ , فَقَالَ اِبْنُ مَسْعُودٍ : لَهَا مِثْلُ صَدَاقِ نِسَائِهَا , لَا وَكْسَ , وَلَا شَطَطَ , وَعَلَيْهَا اَلْعِدَّةُ , وَلَهَا اَلْمِيرَاثُ، فَقَامَ مَعْقِلُ بْنُ سِنَانٍ الْأَشْجَعِيُّ فَقَالَ : قَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي بِرْوَعَ بِنْتِ وَاشِقٍ ‏- اِمْرَأَةٍ مِنَّا ‏- مِثْلَ مَا قَضَيْتَ , فَفَرِحَ بِهَا اِبْنُ مَسْعُودٍ } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ , وَصَحَّحَهُ اَلتِّرْمِذِيُّ وَالْجَمَاعَةُ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہ سے ایسے شخص کے بارے میں پوچھا گیا جس نے کسی عورت سے نکاح کیا لیکن اس کے لیے مہر مقرر نہیں کیا تھا اور ہمبستری (دخول) سے پہلے ہی وہ فوت ہو گیا۔ ابن مسعود رضی اللہ عنہ نے فرمایا: اس عورت کو اس کے خاندان کی عورتوں کے برابر مہر (مہرِ مثل) ملے گا، جس میں نہ کمی ہوگی نہ زیادتی۔ اس پر عدت گزارنا لازم ہے اور وہ میراث کی بھی حقدار ہے۔ یہ سن کر معقل بن سنان اشجعی رضی اللہ عنہ کھڑے ہوئے اور فرمایا: رسول اللہ ﷺ نے ہماری ایک خاتون 'بروع بنت واشق' کے بارے میں بالکل ویسا ہی فیصلہ فرمایا تھا جیسا آپ نے کیا ہے۔ یہ سن کر ابن مسعود رضی اللہ عنہ بہت خوش ہوئے۔",
        "english": "Narrated Alqama on the authority of Ibn Mas'ud (RA): He was asked about a man who married a woman but did not fix a dower for her and died before consummating the marriage. Ibn Mas'ud said, \"She is entitled to a dower like that of the women of her family (Mahr al-Mithl), without any decrease or excess. She must observe the Iddah (waiting period) and she is entitled to a share of the inheritance.\" Then Ma'qil bin Sinan al-Ashja'i stood up and said, \"Allah's Messenger (ﷺ) gave a similar judgment regarding Baru' bint Washia, a woman from us.\" Ibn Mas'ud was delighted with that judgment. [Reported by Ahmad and the four, and At-Tirmidhi and a group of scholars graded it Sahih]."
      }
    },

    {
      "id": 886,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ : \" مَنْ أَعْطَى فِي صَدَاقِ اِمْرَأَةٍ سَوِيقًا , أَوْ تَمْرًا , فَقَدْ اِسْتَحَلَّ } أَخْرَجَهُ أَبُو دَاوُدَ , وَأَشَارَ إِلَى تَرْجِيحِ وَقْفِهِ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جس کسی نے مہر میں عورت کو (دو مٹھی) ستو یا کھجوریں دے دیں، اس نے اسے (اپنے لیے) حلال کر لیا۔“ اسے ابوداؤد نے روایت کیا ہے اور اس کے موقوف (صحابی کا اپنا قول) ہونے کی طرف اشارہ کیا ہے اور اسی کو ترجیح دی ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): The Prophet (ﷺ) said: 'If anyone gives as a dower (Mahr) to his wife (as much as) some mush (Sawiq) or dates, he has made her lawful for himself.' [Reported by Abu Dawud, who indicated that the preferred view is that it is Mauquf (a saying of the companion)]."
      }
    },

    {
      "id": 887,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ , عَنْ أَبِيهِ { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَجَازَ نِكَاحَ اِمْرَأَةٍ عَلَى نَعْلَيْنِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ , وَخُولِفَ فِي ذَلِكَ",
        "urdu": "سیدنا عبداللہ بن عامر بن ربیعہ اپنے والد (عامر بن ربیعہ رضی اللہ عنہ) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے ایک عورت کے نکاح کو دو جوتیوں کے مہر پر جائز قرار دیا۔ اسے ترمذی نے روایت کیا ہے اور اسے صحیح کہا ہے، تاہم اس کی تصحیح میں محدثین نے اختلاف کیا ہے۔",
        "english": "Narrated 'Abdullah bin 'Amir bin Rabi'ah, on the authority of his father (RA): The Prophet (ﷺ) approved the marriage of a woman for a dower of two sandals. [Reported by At-Tirmidhi who graded it Sahih, but this was disputed]."
      }
    },

    {
      "id": 888,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { زَوَّجَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-رَجُلاً اِمْرَأَةً بِخَاتَمٍ مِنْ حَدِيدٍ } أَخْرَجَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا سہل بن سعد رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک مرد کا نکاح ایک عورت کے ساتھ لوہے کی ایک انگوٹھی مہر میں دے کر کیا۔ اسے حاکم نے روایت کیا ہے۔",
        "english": "Narrated Sahl bin Sa'd (RA): The Prophet (ﷺ) married a man to a woman for a dower (Mahr) consisting of an iron ring. [Reported by Al-Hakim]."
      }
    },

    {
      "id": 889,
      "name": {
        "arabic": "وَعَنْ عَلَيٍّ ‏- رضى الله عنه ‏- قَالَ : { لَا يَكُونُ اَلْمَهْرُ أَقَلَّ مِنْ عَشَرَةِ دَرَاهِمَ } .‏ أَخْرَجَهُ اَلدَّارَقُطْنِيُّ مَوْقُوفًا , وَفِي سَنَدِهِ مَقَالٌ",
        "urdu": "سیدنا علی رضی اللہ عنہ نے فرمایا کہ مہر دس درہم سے کم نہیں ہوتا۔ اسے دارقطنی نے موقوف روایت کیا ہے اور اس کی سند میں کلام (کمزوری) ہے۔",
        "english": "Narrated 'Ali (RA): \"The dower (Mahr) should not be less than ten dirhams.\" [Reported by Ad-Daraqutni as a Mauquf Hadith, and its chain of narrators is subject to criticism]."
      }
    },

    {
      "id": 890,
      "name": {
        "arabic": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { خَيْرُ اَلصَّدَاقِ أَيْسَرُهُ } أَخْرَجَهُ أَبُو دَاوُدَ , وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بہترین مہر وہ ہے جو (ادائیگی میں) سب سے زیادہ آسان ہو۔“ اسے ابوداؤد نے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے۔",
        "english": "Narrated 'Uqba bin 'Amir (RA): Allah's Messenger (ﷺ) said: 'The best dower (Mahr) is that which is easiest (to provide).'"
      }
    },

    {
      "id": 891,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ -رَضِيَ اَللَّهُ عَنْهَا- { أَنَّ عَمْرَةَ بِنْتَ اَلْجَوْنِ تَعَوَّذَتْ مِنْ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -حِينَ أُدْخِلَتْ عَلَيْهِ - تَعْنِي: لَمَّا تَزَوَّجَهَا - فَقَالَ : \" لَقَدْ عُذْتِ بِمَعَاذٍ \" , فَطَلَّقَهَا , وَأَمَرَ أُسَامَةَ فَمَتَّعَهَا بِثَلَاثَةِ أَثْوَابٍ } أَخْرَجَهُ اِبْنُ مَاجَهْ , وَفِي إِسْنَادِهِ رَاوٍ مَتْرُوكٌ وَأَصْلُ اَلْقِصَّةِ فِي \" اَلصَّحِيحِ \" مِنْ حَدِيثِ أَبِي أُسَيْدٍ اَلسَّاعِدِيِّ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ عمرہ بنت الجون نے رسول اللہ صلی اللہ علیہ وسلم سے اس وقت (اللہ کی) پناہ طلب کی جب اسے آپ ﷺ کے پاس (خلوت میں) لایا گیا (یعنی جب آپ ﷺ نے اس سے نکاح کیا تھا)۔ تو رسول اللہ ﷺ نے فرمایا: ”بیشک تو نے ایک بڑی پناہ دینے والی ہستی کی پناہ لی ہے۔“ چنانچہ آپ ﷺ نے اسے طلاق دے دی اور اسامہ رضی اللہ عنہ کو حکم دیا کہ اسے تین کپڑے 'متعہ' (تحفہ) کے طور پر دے دیں۔",
        "english": "Narrated 'Aishah (RA): 'Amrah bint al-Jawn sought refuge in Allah from Allah's Messenger (ﷺ) when she was brought to him (after their marriage). He said, \"You have sought refuge in the Mighty One.\" He then divorced her and commanded Usamah to give her three garments as a gift (Mut'ah)."
      }
    }
  ]
}