{
  "chapId": 29,
  "bookId": 4,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 483,
    "to": 504
  },
  "hadiths": [
    {
      "id": 483,
      "name": {
        "arabic": "عَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -بَعَثَ مُعَاذًا - رضى الله عنه - إِلَى اَلْيَمَنِ. . . } فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ: { أَنَّ اَللَّهَ قَدِ اِفْتَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ, تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ, فَتُرَدُّ فِي فُقَرَائِهِمْ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے سیدنا معاذ بن جبل رضی اللہ عنہ کو یمن کی طرف روانہ فرمایا، پھر ساری حدیث بیان کی جس میں ہے ”اللہ تعالیٰ کی طرف سے ان پر زکوٰۃ فرض کی گئی ہے، جو ان کے مالداروں سے وصول کی جائے اور انہیں کے محتاجوں اور غریبوں میں تقسیم کر دی جائے۔“ (بخاری)",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) sent Mu'adh (RA) to Yemen... and he (the Prophet) mentioned the Hadith, and in it he said: \"Allah has made Zakat obligatory upon them, to be taken from their rich and given to their poor.\" [Agreed upon, and the version belongs to Al-Bukhari]."
      }
    },

    {
      "id": 484,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ - رضى الله عنه - أَنَّ أَبَا بَكْرٍ اَلصِّدِّيقَ - رضى الله عنه - كَتَبَ لَهُ { هَذِهِ فَرِيضَةُ اَلصَّدَقَةِ اَلَّتِي فَرَضَهَا رَسُولُ اَللَّهِ - صلى الله عليه وسلم -عَلَى اَلْمُسْلِمِينَ, وَاَلَّتِي أَمَرَ اَللَّهُ بِهَا رَسُولَهُ فِي أَرْبَعٍ وَعِشْرِينَ مِنَ اَلْإِبِلِ فَمَا دُونَهَا اَلْغَنَمُ فِي كُلِّ خَمْسٍ شَاةٌ, فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلَاثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَى فَإِنْ لَمْ تَكُنْ فَابْنُ لَبُونٍ ذَكَرٍ فَإِذَا بَلَغَتْ سِتًّا وَثَلَاثِينَ إِلَى خَمْسٍ وَأَرْبَعِينَ فَفِيهَا بِنْتُ لَبُونٍ أُنْثَى, فَإِذَا بَلَغَتْ سِتًّا وَأَرْبَعِينَ إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ اَلْجَمَلِ فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ إِلَى خَمْسٍ وَسَبْعِينَ فَفِيهَا جَذَعَةٌ فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ إِلَى تِسْعِينَ فَفِيهَا بِنْتَا لَبُونٍ, فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا اَلْجَمَلِ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ, وَفِي كُلِّ خَمْسِينَ حِقَّةٌ, وَمَنْ لَمْ يَكُنْ مَعَهُ إِلَّا أَرْبَعٌ مِنَ اَلْإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. وَفِي صَدَقَةِ اَلْغَنَمِ سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةِ شَاةٍ شَاةٌ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ فَفِيهَا شَاتَانِ, فَإِذَا زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلَاثمِائَةٍ فَفِيهَا ثَلَاثُ شِيَاهٍ فَإِذَا زَادَتْ عَلَى ثَلَاثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ، فَإِذَا كَانَتْ سَائِمَةُ اَلرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةٍ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ, إِلَّا أَنْ يَشَاءَ رَبُّهَا. وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ اَلصَّدَقَةِ, وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ, وَلَا يُخْرَجُ فِي اَلصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ, إِلَّا أَنْ يَشَاءَ اَلْمُصَّدِّقُ، وَفِي اَلرِّقَةِ رُبُعُ اَلْعُشْرِ, فَإِنْ لَمْ تَكُنْ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا, وَمَنْ بَلَغَتْ عِنْدَهُ مِنَ اَلْإِبِلِ صَدَقَةُ اَلْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْحِقَّةُ, وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اِسْتَيْسَرَتَا لَهُ, أَوْ عِشْرِينَ دِرْهَمًا, وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ اَلْحِقَّةِ وَلَيْسَتْ عِنْدَهُ اَلْحِقَّةُ, وَعِنْدَهُ اَلْجَذَعَةُ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْجَذَعَةُ, وَيُعْطِيهِ اَلْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ سیدنا ابوبکر رضی اللہ عنہ نے انہیں فریضہ زکوٰۃ کے متعلق یہ تحریر لکھ کر دی جسے رسول اللہ ﷺ نے مسلمانوں پر مقرر فرمایا تھا: اونٹوں کی چوبیس یا اس سے کم تعداد پر ہر پانچ اونٹ پر ایک بکری ہے۔ جب 25 سے 35 ہو جائیں تو ایک سالہ اونٹنی (بنت مخاض)، اگر وہ نہ ہو تو دو سالہ نر اونٹ (ابن لبون)۔ 36 سے 45 پر دو سالہ اونٹنی (بنت لبون)۔ 46 سے 60 پر تین سالہ اونٹنی (حقہ) جو جفتی کے قابل ہو۔ 61 سے 75 پر چار سالہ اونٹنی (جذعہ)۔ 76 سے 90 پر دو عدد دو سالہ اونٹنیاں۔ 91 سے 120 پر دو عدد تین سالہ اونٹنیاں۔ 120 سے زائد پر ہر 40 پر ایک دو سالہ اور ہر 50 پر ایک تین سالہ اونٹنی۔ بکریوں کا نصاب (جو چرنے والی ہوں) 40 سے 120 تک ایک بکری، 121 سے 200 تک دو، 201 سے 300 تک تین، اور 300 سے اوپر ہر سو پر ایک بکری۔ چاندی میں چالیسواں حصہ (2.5%) زکوٰۃ ہے۔ زکوٰۃ کے ڈر سے نہ تو متفرق مال کو اکٹھا کیا جائے اور نہ اکٹھے مال کو الگ کیا جائے۔",
        "english": "Narrated Anas (RA): Abu Bakr (RA) wrote to him this document regarding the obligatory charity (Zakat) which Allah's Messenger (ﷺ) had made obligatory on the Muslims: For 24 camels or less, a sheep is to be given for every five camels. From 25 to 35 camels, a one-year-old she-camel (Bint Makhad) is due. From 36 to 45, a two-year-old she-camel (Bint Labun). From 46 to 60, a three-year-old she-camel (Hiqqah). From 61 to 75, a four-year-old she-camel (Jadha'ah). From 76 to 90, two Bint Labun. From 91 to 120, two Hiqqah. Above 120, for every 40, one Bint Labun and for every 50, one Hiqqah. For pasturing sheep, from 40 to 120, one sheep is due... In silver, one-fortieth (2.5%) is due. Neither separate properties should be gathered together nor a single property should be divided to avoid Zakat. [Reported by Al-Bukhari]."
      }
    },

    {
      "name": {
        "arabic": " وَعَنْ مُعَاذِ بْنِ جَبَلٍ - رضى الله عنه - { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -بَعَثَهُ إِلَى اَلْيَمَنِ, فَأَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ ثَلَاثِينَ بَقَرَةً تَبِيعًا أَوْ تَبِيعَةً, وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً, وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عَدْلَهُ مُعَافِرَ } رَوَاهُ اَلْخَمْسَةُ, وَاللَّفْظُ لِأَحْمَدَ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ وَأَشَارَ إِلَى اِخْتِلَافٍ فِي وَصْلِهِ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ",
        "urdu": " سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو یمن کی طرف (عامل مقرر کر کے) بھیجا۔ ان کو حکم دیا کہ وہ ہر تیس گائیوں پر ایک سالہ مادہ گائے یا نر بچھڑا (تبيع) وصول کریں اور ہر چالیس کی تعداد پر ایک دو سالہ مادہ بچھیا (مسنة) لی جائے اور ہر بالغ سے ایک دینار یا اس کی قیمت کا معافری کپڑا (جزیہ کے طور پر) لیا جائے۔",
        "english": "Narrated Mu'adh bin Jabal (RA): The Prophet (ﷺ) sent him to Yemen and commanded him to take a Tabi' (a one-year-old male) or a Tabi'ah (a one-year-old female) cow for every thirty cows, and a Musinnah (a two-year-old female cow) for every forty, and one Dinar or its equivalent in Ma'afiri (Yemeni cloth) from every adult (as Jizyah)."
      }
    },

    {
      "id": 486,
      "name": {
        "arabic": " وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ تُؤْخَذُ صَدَقَاتُ اَلْمُسْلِمِينَ عَلَى مِيَاهِهِمْ } رَوَاهُ أَحْمَدُ وَلِأَبِي دَاوُدَ: { وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ } ",
        "urdu": " سیدنا عمرو بن شعیب رحمہ اللہ اپنے باپ سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے ”مسلمانوں سے زکوٰۃ ان کے پانی پلانے کی جگہوں پر وصول کی جائے گی۔“ احمد، اور ابوداؤد کی روایت میں ہے کہ مسلمانوں کے صدقات ان کے گھروں ہی پر حاصل کیے جائیں گے۔",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority, from his grandfather (RA) who said: Allah's Messenger (ﷺ) said: \"The Zakat of the Muslims should be collected at their watering places.\" [Reported by Ahmad]. Abu Dawud's version says: \"Their Zakat should not be taken except in their dwellings (areas).\""
      }
    },

    {
      "id": 487,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ لَيْسَ عَلَى اَلْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ } رَوَاهُ اَلْبُخَارِيُّ . وَلِمُسْلِمٍ: { لَيْسَ فِي اَلْعَبْدِ صَدَقَةٌ إِلَّا صَدَقَةُ اَلْفِطْرِ } ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان پر اس کے غلام اور اس کے گھوڑے میں (زکوٰۃ) صدقہ نہیں ہے۔“ اور مسلم کی روایت میں ہے کہ ”غلام میں کوئی صدقہ (زکوٰۃ) نہیں ہے سوائے صدقہ فطر کے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"A Muslim is not obliged to pay Zakat on his slave or his horse.\" [Reported by Al-Bukhari]. Muslim's version has: \"There is no Zakat due on a slave except Sadaqat-ul-Fitr.\""
      }
    },

    {
      "id": 488,
      "name": {
        "arabic": "وَعَنْ بَهْزِ بْنِ حَكِيمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ فِي كُلِّ سَائِمَةِ إِبِلٍ: فِي أَرْبَعِينَ بِنْتُ لَبُونٍ, لَا تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا, مَنْ أَعْطَاهَا مُؤْتَجِرًا بِهَا فَلَهُ أَجْرُهُ, وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ مَالِهِ, عَزْمَةً مِنْ عَزَمَاتِ رَبِّنَا, لَا يَحِلُّ لِآلِ مُحَمَّدٍ مِنْهَا شَيْءٌ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ, وَعَلَّقَ اَلشَّافِعِيُّ اَلْقَوْلَ بِهِ عَلَى ثُبُوتِه ِ ",
        "urdu": " سیدنا بہز بن حکیم رحمہ اللہ اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ علیہ وسلم نے فرمایا کہ ” چرنے والے تمام اونٹوں میں چالیس پر ایک، دو سالہ اونٹنی ہے اور اونٹوں کو ان کے حساب سے جدا نہ کیا جائے گا اور جو شخص حصول ثواب کی نیت سے زکوٰۃ ادا کرے گا اس کو اس کا ثواب بھی ملے گا اور جس نے زکوٰۃ روک لی تو ہم زکوٰۃ زبردستی وصول کریں گے اور اس کے مال کا نصف (بطور جرمانہ) بھی، یہ ہمارے پروردگار کے فرائض میں سے ایک لازمی حکم ہے، ان میں سے کوئی چیز بھی آل محمد صلی اللہ علیہ وسلم کیلئے حلال نہیں ہے۔ “ اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Bahz bin Hakim, from his father, on the authority of his grandfather (RA): Allah's Messenger (ﷺ) said: \"For every forty pasturing camels, one two-year-old she-camel (Bint Labun) is due. Camels are not to be separated from their reckoning. He who pays it seeking a reward will have his reward; and he who withholds it, we shall take it and half of his property, as one of the absolute commands of our Lord. Nothing of it is lawful for the family of Muhammad (ﷺ).\" [Reported by Ahmad, Abu Dawud and an-Nasa'i; al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 489,
      "name": {
        "arabic": " وَعَنْ عَلِيٍّ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ إِذَا كَانَتْ لَكَ مِائَتَا دِرْهَمٍ -وَحَالَ عَلَيْهَا اَلْحَوْلُ - فَفِيهَا خَمْسَةُ دَرَاهِمَ, وَلَيْسَ عَلَيْكَ شَيْءٌ حَتَّى يَكُونَ لَكَ عِشْرُونَ دِينَارًا, وَحَالَ عَلَيْهَا اَلْحَوْلُ, فَفِيهَا نِصْفُ دِينَارٍ, فَمَا زَادَ فَبِحِسَابِ ذَلِكَ, وَلَيْسَ فِي مَالٍ زَكَاةٌ حَتَّى يَحُولَ عَلَيْهِ اَلْحَوْلُ } رَوَاهُ أَبُو دَاوُدَ, وَهُوَ حَسَنٌ, وَقَدِ اِخْتُلِفَ فِي رَفْعِهِ وَلِلتِّرْمِذِيِّ; عَنِ اِبْنِ عُمَرَ: { مَنِ اِسْتَفَادَ مَالًا, فَلَا زَكَاةَ عَلَيْهِ حَتَّى يَحُولَ اَلْحَوْلُ } وَالرَّاجِحُ وَقْفُهُ ",
        "urdu": " سیدنا علی رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تیرے پاس دو سو درہم ہوں اور ان پر پورا سال گذر جائے تو ان میں پانچ درہم زکوٰۃ ہے۔ جب تک تیرے پاس بیس دینار نہ ہوں اور ان پر پورا سال گزر نہ جائے، اس وقت تک تجھ پر کوئی چیز نہیں (واجب نہیں)۔ جب بیس دینار ہوں تو ان میں نصف دینار زکوٰۃ ہے۔ جو اس سے زیادہ ہو گا تو اسی حساب سے زکوٰۃ ہو گی۔ کسی بھی مال پر اس وقت تک زکوٰۃ نہیں جب تک اس پر پورا سال نہ گزر جائے۔“ ابوداؤد نے اسے روایت کیا ہے اور یہ حسن ہے۔ اور ترمذی میں ابن عمر رضی اللہ عنہما سے منقول ہے کہ جو مال حاصل کرے اس پر زکوٰۃ نہیں جب تک سال نہ گزر جائے، اور راجح یہ ہے کہ یہ موقوف ہے۔",
        "english": "Narrated ‘Ali (RA): Allah's Messenger (ﷺ) said: \"When you possess two hundred Dirhams and one year passes over them, five Dirhams are due on them as Zakat. You are not obliged to pay anything (on gold) until you possess twenty Dinars and a year passes over them, then half a Dinar is due on them. Whatever is in excess of that should be calculated accordingly. And no Zakat is due on property until a year passes over it.\" [Reported by Abu Dawud; it is Hasan]. At-Tirmidhi reported from Ibn ‘Umar (RA): \"Whoever acquires wealth, there is no Zakat due on it until a year passes over it.\" [The correct view is that it is Muwquf]."
      }
    },

    {
      "id": 490,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ - رضى الله عنه - قَالَ: { لَيْسَ فِي اَلْبَقَرِ اَلْعَوَامِلِ صَدَقَةٌ } رَوَاهُ أَبُو دَاوُدَ, وَاَلدَّارَقُطْنِيُّ, وَالرَّاجِحُ وَقْفُهُ أَيْضًا",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ (نبی کریم ﷺ نے فرمایا): ”کام کرنے والے بیلوں (مویشیوں) پر زکوٰۃ واجب نہیں۔“ اسے ابوداؤد اور دارقطنی نے روایت کیا ہے اور راجح یہ ہے کہ یہ موقوف (یعنی سیدنا علی کا اپنا قول) ہے۔",
        "english": "Narrated ‘Ali (RA): \"There is no Zakat due on working oxen (livestock used for labor).\" [Reported by Abu Dawud and ad-Daraqutni, and the correct view is that it is Muwquf (a statement of the companion)]."
      }
    },

    {
      "id": 491,
      "name": {
        "arabic": " وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ; أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -قَالَ: { مِنْ وَلِيَ يَتِيمًا لَهُ مَالٌ, فَلْيَتَّجِرْ لَهُ, وَلَا يَتْرُكْهُ حَتَّى تَأْكُلَهُ اَلصَّدَقَةُ } رَوَاهُ اَلتِّرْمِذِيُّ, وَاَلدَّارَقُطْنِيُّ, وَإِسْنَادُهُ ضَعِيفٌ وَلَهُ شَاهِدٌ مُرْسَلٌ عِنْدَ اَلشَّافِعِيِّ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ اپنے والد اور وہ اپنے دادا عبداللہ بن عمرو رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو شخص کسی ایسے یتیم کا سرپرست بنے جس کے پاس مال ہو، تو اسے چاہیے کہ اس مال سے تجارت کرے، اور اسے (بیکار) نہ چھوڑے کہ زکوٰۃ اسے کھا جائے (یعنی زکوٰۃ کٹ کٹ کر مال ختم ہو جائے)۔“ اسے ترمذی اور دارقطنی نے روایت کیا ہے، اس کی سند ضعیف ہے مگر امام شافعی کے ہاں ایک مرسل روایت اس کی شاہد ہے۔",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority from his grandfather 'Abdullah bin 'Amr (RA): Allah's Messenger (ﷺ) said: \"Whoever is the guardian of an orphan who has property, should trade with it and should not leave it until Sadaqah (Zakat) consumes it.\" [Reported by at-Tirmidhi and ad-Daraqutni with a weak chain; it has a Mursal supporting narration in ash-Shafi'i]."
      }
    },

    {
      "id": 492,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ أَبِي أَوْفَى - رضى الله عنه - قَالَ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ: \"اَللَّهُمَّ صَلِّ عَلَيْهِمْ\" } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا عبداللہ بن ابی اوفی رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں جب لوگ زکوٰۃ لے کر حاضر ہوتے تو آپ صلی اللہ علیہ وسلم ان کے لیے یوں دعا فرماتے «اللهم صل عليهم» ”یا اللہ! ان پر رحم و کرم فرما (اور اپنی رحمتیں نازل فرما)۔“ (بخاری و مسلم)",
        "english": "Narrated ‘Abdullah bin Abi Awfa (RA): When a people brought their Zakat to Allah's Messenger (ﷺ), he would say, \"O Allah! Bless them (send Your Mercy upon them).\" [Agreed upon]."
      }
    },

    {
      "id": 493,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ - رضى الله عنه - أَنَّ اَلْعَبَّاسَ - رضى الله عنه - { سَأَلَ اَلنَّبِيَّ - صلى الله عليه وسلم -فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ, فَرَخَّصَ لَهُ فِي ذَلِكَ } رَوَاهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ سیدنا عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے دریافت کیا کہ آیا زکوٰۃ اپنے مقررہ وقت سے پہلے ادا ہو سکتی ہے؟ تو آپ صلی اللہ علیہ وسلم نے ان کو اس کی اجازت دے دی۔ (ترمذی، مستدرک حاکم)",
        "english": "Narrated ‘Ali (RA): Al-Abbas (RA) asked the Prophet (ﷺ) about paying his Sadaqah (Zakat) in advance before it became due, and he (the Prophet) gave him permission to do that. [Reported by at-Tirmidhi and al-Hakim]."
      }
    },

    {
      "id": 494,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا عَنْ رَسُولِ اَللَّهِ صلى الله عليه وسلم قَالَ: { لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ اَلْوَرِقِ صَدَقَةٌ, وَلَيْسَ فِيمَا دُونَ خَمْسٍ ذَوْدٍ مِنَ اَلْإِبِلِ صَدَقَةٌ, وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ اَلتَّمْرِ صَدَقَةٌ } رَوَاهُ مُسْلِمٌ . وَلَهُ مِنْ حَدِيثِ أَبِي سَعِيدٍ: { لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنْ تَمْرٍ وَلَا حَبٍّ صَدَقَةٌ } . وَأَصْلُ حَدِيثِ أَبِي سَعِيدٍ مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”پانچ اوقیہ سے کم چاندی میں زکوٰۃ نہیں ہے، اور پانچ سے کم اونٹوں میں زکوٰۃ نہیں ہے، اور پانچ وسق سے کم کھجوروں میں زکوٰۃ نہیں ہے۔“ (مسلم)۔ اور مسلم ہی میں ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ: ”پانچ وسق سے کم کھجوروں یا غلے میں زکوٰۃ نہیں ہے۔“ اور ابوسعید کی حدیث کی اصل بخاری و مسلم دونوں میں ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): Allah's Messenger (ﷺ) said: \"No Zakat is due on less than five Uqiyah of silver, and no Zakat is due on less than five camels, and no Zakat is due on less than five Wasqs of dates.\" [Reported by Muslim]. In Muslim's narration from Abu Sa'id (RA): \"No Zakat is due on less than five Wasqs of dates or grains.\" The origin of Abu Sa'id's Hadith is agreed upon."
      }
    },

    {
      "id": 495,
      "name": {
        "arabic": " وَعَنْ سَالِمِ بْنِ عَبْدِ اَللَّهِ, عَنْ أَبِيهِ, عَنْ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ: { فِيمَا سَقَتِ اَلسَّمَاءُ وَالْعُيُونُ, أَوْ كَانَ عَثَرِيًّا: اَلْعُشْرُ, وَفِيمَا سُقِيَ بِالنَّضْحِ: نِصْفُ اَلْعُشْرِ. } رَوَاهُ اَلْبُخَارِيُّ . وَلِأَبِي دَاوُدَ: { أَوْ كَانَ بَعْلًا: اَلْعُشْرُ, وَفِيمَا سُقِيَ بِالسَّوَانِي أَوِ اَلنَّضْحِ: نِصْفُ اَلْعُشْرِ }",
        "urdu": " سیدنا سالم بن عبداللہ رحمہ اللہ اپنے والد سے روایت کرتے ہیں، انہوں نے نبی کریم ﷺ سے بیان کیا کہ آپ ﷺ نے فرمایا: ”جو زمین آسمانی بارش اور چشموں سے سیراب ہوتی ہو یا جو (رطوبت کی وجہ سے) خود بخود سیراب ہو جائے، اس میں دسواں حصہ (10٪ عشر) ہے، اور جسے پانی کھینچ کر (مشقت سے) سیراب کیا گیا ہو اس میں بیسواں حصہ (5٪ نصف عشر) ہے۔“ (بخاری)۔ ابوداؤد کی روایت میں ہے کہ جو زمین 'بعل' (بارشی) ہو اس میں عشر ہے اور جو جانوروں یا ڈول کے ذریعے سیراب کی جائے اس میں نصف عشر ہے۔",
        "english": "Narrated Salim bin 'Abdullah on his father's authority: The Prophet (ﷺ) said: \"On that which is watered by the sky (rain) and springs or is 'Athari (watered by its own roots), a tenth (10%) is due; and on that which is watered by irrigation (pumping or artificial lifting), a twentieth (5%) is due.\" [Reported by Al-Bukhari]. Abu Dawud's version says: \"On 'Ba'l' (land watered by rain) a tenth is due, and on that which is watered by Saniyah (camels/animals lifting water) or Nadh (irrigation), a half-tenth is due.\""
      }
    },

    {
      "id": 496,
      "name": {
        "arabic": " وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ; وَمُعَاذٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيِّ - صلى الله عليه وسلم -قَالَ لَهُمَا: { لَا تَأْخُذَا فِي اَلصَّدَقَةِ إِلَّا مِنْ هَذِهِ اَلْأَصْنَافِ اَلْأَرْبَعَةِ: اَلشَّعِيرِ, وَالْحِنْطَةِ, وَالزَّبِيبِ, وَالتَّمْرِ } رَوَاهُ اَلطَّبَرَانِيُّ, وَالْحَاكِمُ وَلِلدَّارَقُطْنِيِّ, عَنْ مُعَاذٍ: { فَأَمَّا اَلْقِثَّاءُ, وَالْبِطِّيخُ, وَالرُّمَّانُ, وَالْقَصَبُ, فَقَدْ عَفَا عَنْهُ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -} وَإِسْنَادُهُ ضَعِيفٌ",
        "urdu": "سیدنا ابوموسٰی اشعری اور معاذ بن جبل رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے ان سے فرمایا: ”ان چار اصناف (قسموں) کے علاوہ کسی چیز سے زکوٰۃ وصول نہ کرو: جو، گندم، منقی (کشمش) اور کھجور۔“ (طبرانی، حاکم)۔ اور دارقطنی کی روایت میں سیدنا معاذ رضی اللہ عنہ سے مروی ہے کہ: ”کھیرا، تربوز، انار اور گنے میں رسول اللہ ﷺ نے زکوٰۃ معاف فرمائی ہے۔“ مگر اس کی سند ضعیف ہے۔",
        "english": "Narrated Abu Musa al-Ash'ari and Mu'adh (RA) that the Prophet (ﷺ) said to them: \"Do not collect Zakat except from these four commodities: barley, wheat, dried grapes (raisins), and dates.\" [Reported by at-Tabarani and al-Hakim]. Ad-Daraqutni reported from Mu'adh (RA): \"As for cucumbers, watermelons, pomegranates, and sugarcane, Allah's Messenger (ﷺ) exempted them.\" Its chain of narrators is weak."
      }
    },

    {
      "id": 497,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ -رَضِيَ اَللَّهُ عَنْهُمَا - قَالَ: أَمَرَنَا رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ إِذَا خَرَصْتُمْ, فَخُذُوا, وَدَعُوا اَلثُّلُثَ, فَإِنْ لَمْ تَدَعُوا اَلثُّلُثَ, فَدَعُوا اَلرُّبُعَ } رَوَاهُ اَلْخَمْسَةُ إِلَّا اِبْنَ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ",
        "urdu": "سیدنا سہل بن ابی حثمہ رضی اللہ عنہ سے مروی ہے کہ ہمیں رسول اللہ ﷺ نے حکم دیا: ”جب تم (پھلوں یا غلے کا) تخمینہ اور اندازہ لگاؤ تو (زکوٰۃ لیتے وقت) ایک تہائی چھوڑ دیا کرو، اگر تہائی نہ چھوڑ سکو تو چوتھائی چھوڑ دیا کرو۔“",
        "english": "Narrated Sahl bin Abi Hathma (RA): Allah's Messenger (ﷺ) commanded us: \"When you estimate (the Zakat on fruits), take (the Zakat) but leave a third; and if you do not leave a third, leave a quarter.\""
      }
    },

    {
      "id": 498,
      "name": {
        "arabic": " وَعَنْ عَتَّابِ بنِ أُسَيْدٍ - رضى الله عنه - قَالَ: أَمَرَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ أَنْ يُخْرَصَ اَلْعِنَبُ كَمَا يُخْرَصُ اَلنَّخْلُ, وَتُؤْخَذَ زَكَاتُهُ زَبِيبًا } رَوَاهُ اَلْخَمْسَةُ, وَفِيهِ اِنْقِطَاعٌ",
        "urdu": "سیدنا عتاب بن اسید رضی اللہ عنہ کہتے ہیں کہ ہمیں رسول اللہ ﷺ نے حکم فرمایا کہ ”انگوروں کا تخمینہ (اندازہ) بھی اسی طرح لگایا جائے جس طرح کھجوروں کا لگایا جاتا ہے، اور اس کی زکوٰۃ خشک انگور (کشمش) کی صورت میں وصول کی جائے۔“ اسے پانچوں (احمد اور اصحاب سنن) نے روایت کیا ہے، مگر اس کی سند میں انقطاع (ٹوٹنا) ہے۔",
        "english": "Narrated 'Attab bin Usaid (RA): Allah's Messenger (ﷺ) commanded that grapes should be estimated (as to the amount of produce) just as dates are estimated, and its Zakat should be collected in the form of raisins (dried grapes)."
      }
    },

    {
      "id": 499,
      "name": {
        "arabic": " وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; { أَنَّ اِمْرَأَةً أَتَتِ اَلنَّبِيَّ - صلى الله عليه وسلم -وَمَعَهَا اِبْنَةٌ لَهَا, وَفِي يَدِ اِبْنَتِهَا مِسْكَتَانِ مِنْ ذَهَبٍ, فَقَالَ لَهَا: \"أَتُعْطِينَ زَكَاةَ هَذَا?\" قَالَتْ: لَا. قَالَ: \"أَيَسُرُّكِ أَنْ يُسَوِّرَكِ اَللَّهُ بِهِمَا يَوْمَ اَلْقِيَامَةِ سِوَارَيْنِ مِنْ نَارٍ?\". فَأَلْقَتْهُمَا. } رَوَاهُ اَلثَّلَاثَةُ, وَإِسْنَادُهُ قَوِيٌّ وَصَحَّحَهُ اَلْحَاكِمُ: مِنْ حَدِيثِ عَائِشَةَ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ اپنے باپ اور وہ اپنے دادا سے روایت کرتے ہیں کہ ایک خاتون نبی کریم ﷺ کی خدمت میں حاضر ہوئی۔ اس کے ہمراہ اس کی بیٹی بھی تھی جس کے ہاتھ میں سونے کے دو موٹے کنگن تھے۔ آپ ﷺ نے اس سے فرمایا: ”کیا تو اس کی زکوٰۃ دیتی ہے؟“ اس نے عرض کیا: نہیں۔ آپ ﷺ نے فرمایا: ”کیا تجھے یہ پسند ہے کہ قیامت کے روز اللہ تعالیٰ ان کے بدلے تجھے آگ کے دو کنگن پہنائے؟“ یہ سن کر اس خاتون نے فوراً دونوں کنگن اتار کر پھینک دیئے (کہ یہ اللہ اور اس کے رسول کے لیے ہیں)۔",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority from his grandfather (RA): A woman came to the Prophet (ﷺ) accompanied by her daughter who had two heavy gold bangles on her hand. He said to her, \"Do you pay Zakat on them?\" She replied, \"No.\" He then said, \"Would it please you that Allah should encircle you with two bangles of Fire on the Day of Resurrection?\" Thereupon she took them off and threw them down. [Reported by the three (Abu Dawud, At-Tirmidhi, An-Nasa'i) with a strong chain; Al-Hakim graded it Sahih from the Hadith of Aisha]."
      }
    },

    {
      "id": 500,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّهَا كَانَتْ تَلْبَسُ أَوْضَاحًا مِنْ ذَهَبٍ فَقَالَتْ: يَا رَسُولَ اَللَّهِ! أَكَنْزٌ هُوَ? فَقَالَ: \"إِذَا أَدَّيْتِ زَكَاتَهُ, فَلَيْسَ بِكَنْزٍ\". } رَوَاهُ أَبُو دَاوُدَ, وَاَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ . ",
        "urdu": " سیدہ ام سلمہ رضی اللہ عنہا سے مروی ہے کہ انہوں نے سونے کا زیور (کنگن وغیرہ) پہن رکھا تھا۔ انہوں نے دریافت کیا: یا رسول اللہ! کیا یہ 'کنز' (وہ خزانہ جس پر عذاب کی وعید ہے) ہے؟ آپ ﷺ نے فرمایا: ”جب تو نے اس کی زکوٰۃ ادا کر دی تو پھر یہ کنز نہیں ہے۔“",
        "english": "Narrated Umm Salamah (RA): She was wearing gold ornaments and asked, \"O Messenger of Allah (ﷺ)! Is this 'Kanz' (hoarded wealth)?\" He replied, \"If you pay the Zakat due on it, then it is not 'Kanz'.\" [Reported by Abu Dawud and ad-Daraqutni; al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 501,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ - رضى الله عنه - قَالَ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -يَأْمُرُنَا; أَنْ نُخْرِجَ اَلصَّدَقَةَ مِنَ اَلَّذِي نَعُدُّهُ لِلْبَيْعِ. } رَوَاهُ أَبُو دَاوُدَ, وَإِسْنَادُهُ لَيِّنٌ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں اس (مال) سے زکوٰۃ نکالنے کا حکم دیا کرتے تھے جسے ہم فروخت کرنے کے لیے تیار کرتے تھے۔ (یعنی سامانِ تجارت)۔ اسے ابوداؤد نے روایت کیا ہے اور اس کی سند میں کچھ کمزوری ہے۔",
        "english": "Narrated Samurah bin Jundub (RA): Allah's Messenger (ﷺ) used to command us to pay Zakat from that which we prepared for sale (trade goods)."
      }
    },

    {
      "id": 502,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - { أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -قَالَ: \"وَفِي اَلرِّكَازِ: اَلْخُمُسُ\". } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”رکاز (زمین میں دبے ہوئے قدیم خزانے) میں خمس یعنی پانچواں حصہ (بیس فیصد زکوٰۃ) ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'One-fifth (Khums) is to be paid on Rikaz (buried treasure).'"
      }
    },

    {
      "id": 503,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -قَالَ -فِي كَنْزٍ وَجَدَهُ رَجُلٌ فِي خَرِبَةٍ -: \"إِنْ وَجَدْتَهُ فِي قَرْيَةٍ مَسْكُونَةٍ, فَعَرِّفْهُ, وَإِنْ وَجَدْتَهُ فِي قَرْيَةٍ غَيْرِ مَسْكُونَةٍ, فَفِيهِ وَفِي اَلرِّكَازِ: اَلْخُمُسُ \". } أَخْرَجَهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ حَسَنٍ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اس خزانے کے بارے میں جو کسی آدمی کو ویرانے سے ملا ہو، فرمایا: ”اگر تم نے یہ خزانہ کسی آباد بستی سے پایا ہے تو اس کا (مالک کی تلاش کے لیے) اعلان کرو، اور اگر تم نے اسے کسی غیر آباد جگہ سے پایا ہے تو اس میں اور رکاز (قدیم دفینے) میں خمس (پانچواں حصہ) ہے۔“",
        "english": "Narrated 'Amr bin Shu'aib via his father and grandfather: Regarding a treasure found by a man in a ruin, the Prophet (ﷺ) said: 'If you find it in an inhabited village, make it known (announce it to find the owner). But if you find it in an uninhabited place, then for it and for Rikaz (buried treasure), the Khums (one-fifth) is due.'"
      }
    },

    {
      "id": 504,
      "name": {
        "arabic": "وَعَنْ بِلَالِ بْنِ اَلْحَارِثِ - رضى الله عنه - { أَنَّ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -أَخَذَ مِنَ اَلْمَعَادِنِ اَلْقَبَلِيَّةِ اَلصَّدَقَةَ. } رَوَاهُ أَبُو دَاوُدَ",
        "urdu": "سیدنا بلال بن حارث رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبل (جگہ کا نام) میں واقع کانوں سے زکوٰۃ وصول کی۔ (ابوداؤد)",
        "english": "Narrated Bilal bin al-Harith (RA): Allah's Messenger (ﷺ) took Zakat from the mines of al-Qabaliyah."
      }
    }
  ]
}
