{
  "chapId": 9,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 109,
    "to": 117
  },
  "hadiths": [
    {
      "id": 109,
      "name": {
        "arabic": " عَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -قَالَ: { أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ أَحَدٌ قَبْلِي: نُصِرْتُ بِالرُّعْبِ مَسِيرَةَ شَهْرٍ, وَجُعِلَتْ لِي اَلْأَرْضُ مَسْجِدًا وَطَهُورًا, فَأَيُّمَا رَجُلٍ أَدْرَكَتْهُ اَلصَّلَاةُ فَلْيُصَلِّ } وَذَكَرَ اَلْحَدِيث َ وَفِي حَدِيثِ حُذَيْفَةَ عِنْدَ مُسْلِمٍ: { وَجُعِلَتْ تُرْبَتُهَا لَنَا طَهُورًا, إِذَا لَمْ نَجِدِ اَلْمَاءَ }  وَعَنْ عَلِيٍّ  - رضى الله عنه  - عِنْدَ أَحْمَدَ: { وَجُعِلَ اَلتُّرَابُ لِي طَهُورًا } ",
        "urdu": " سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مجھے پانچ ایسی چیزیں عطا فرمائی گئی ہیں جو مجھ سے پہلے کسی (نبی و رسول) کو بھی نہیں دی گئیں: میری ایک مہینہ کی مسافت سے (دشمن پر) رعب و دبدبے سے مدد دی گئی ہے، ساری زمین میرے لئے سجدہ گاہ اور طہارت و پاکیزگی کا ذریعہ بنائی گئی ہے، اب جس آدمی کو (جہاں بھی) نماز کا وقت آ جائے اسے نماز پڑھ لینی چاہیئے۔“ اور آگے پوری حدیث ذکر کی۔ مسلم میں سیدنا حذیفہ رضی اللہ عنہ سے مروی ہے کہ ”جب ہمیں پانی دستیاب نہ ہو تو زمین کی مٹی ہمارے لئے حصول طہارت و پاکیزگی کیلئے پاک بنا دی گئی ہے۔“ مسند احمد میں سیدنا علی رضی اللہ عنہ سے منقول ہے کہ ”مٹی میرے لئے حصول طہارت کا ذریعہ بنا دی گئی ہے۔“",
        "english": "Narrated Jabir bin 'Abdullah (May Allah be pleased with them both): The Prophet (Peace and Blessings be upon him) said: 'I have been given five things which were not given to any one of the Prophets before me: I was supported with fear (cast into the hearts of my enemies) up to a distance of one month's travel, the whole earth has been made a place of prayer (Masjid) and a source of purification (Tahir) for me. So, whenever the time of prayer comes to any man, he should pray (wherever he is).' And he mentioned the rest of the Hadith. In the Hadith of Hudhayfah reported by Muslim: 'Its dust has been made a purifier for us when we do not find water.' And from 'Ali (RA) reported by Ahmad: 'And the dust has been made a purifier for me.'"
      }
    },

    {
      "id": 110,
      "name": {
        "arabic": " وَعَنْ عَمَّارِ بْنِ يَاسِرٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { بَعَثَنِي اَلنَّبِيُّ  - صلى الله عليه وسلم  -فِي حَاجَةٍ, فَأَجْنَبْتُ, فَلَمْ أَجِدِ اَلْمَاءَ, فَتَمَرَّغْتُ فِي اَلصَّعِيدِ كَمَا تَمَرَّغُ اَلدَّابَّةُ, ثُمَّ أَتَيْتُ اَلنَّبِيَّ  - صلى الله عليه وسلم  -فَذَكَرْتُ ذَلِكَ لَهُ, فَقَالَ: \"إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ بِيَدَيْكَ هَكَذَا\" ثُمَّ ضَرَبَ بِيَدَيْهِ اَلْأَرْضَ ضَرْبَةً وَاحِدَةً, ثُمَّ مَسَحَ اَلشِّمَالَ عَلَى اَلْيَمِينِ, وَظَاهِرَ كَفَّيْهِ وَوَجْهَهُ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِم ٍ وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: وَضَرَبَ بِكَفَّيْهِ اَلْأَرْضَ, وَنَفَخَ فِيهِمَا, ثُمَّ مَسَحَ بِهِمَا وَجْهَهُ وَكَفَّيْه ِ",
        "urdu": " سیدنا عمار بن یاسر رضی اللہ عنہما روایت کرتے ہیں کہ مجھے نبی کریم صلی اللہ علیہ وسلم نے کسی ضرورت و حاجت کے سلسلے میں بھیجا۔ میں جنبی ہو گیا اور پانی مجھے دستیاب نہ ہو سکا تو میں مٹی میں اس طرح لوٹ پوٹ ہوا جس طرح چوپایہ لوٹ پوٹ ہوتا ہے۔ (ضرورت سے فارغ ہو کر) میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور سارا واقعہ آپ صلی اللہ علیہ وسلم سے ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”تجھے اپنے ہاتھ سے اس طرح کر لینا ہی کافی تھا۔“ پھر آپ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھوں کو ایک مرتبہ زمین پر مارا پھر بائیں کو دائیں پر ملا اپنے ہاتھوں کی پشت اور چہرے پر۔ (بخاری اور مسلم) اور متن حدیث کے الفاظ مسلم کے ہیں۔ اور بخاری کی روایت میں ہے کہ اپنی دونوں ہتھیلیاں زمین پر ماریں اور پھونک مار کر گرد و غبار اڑا دیا پھر ان کو اپنے چہرے اور ہاتھوں پر مل لیا۔",
        "english": "Narrated 'Ammar bin Yasir (May Allah be pleased with them both): The Prophet (Peace and Blessings be upon him) sent me on a mission. I became Junub (major ritual impurity) and could not find water, so I rolled myself in the dust (Sa'id) just as an animal rolls. Then I came to the Prophet (PBUH) and mentioned that to him. He said: 'It would have been sufficient for you to do like this with your hands.' Then he struck the ground with his hands once, then wiped the left hand over the right, the back of his hands, and his face. Agreed upon, and the wording is that of Muslim. In a narration by Al-Bukhari: 'He struck the earth with his palms, blew into them, and then wiped his face and his palms with them.'"
      }
    },

    {
      "id": 111,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ التَّيَمُّمُ ضَرْبَتَانِ ضَرْبَةٌ لِلْوَجْهِ, وَضَرْبَةٌ لِلْيَدَيْنِ إِلَى اَلْمِرْفَقَيْنِ } رَوَاهُ اَلدَّارَقُطْنِيُّ, وَصَحَّحَ اَلْأَئِمَّةُ وَقْفَه ُ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ وسلم کا ارشاد گرامی ہے ”تیمم دو ضربوں سے (مکمل) ہوتا ہے، ایک ضرب چہرے کے لیے اور ایک دونوں ہاتھوں کے لیے کہنیوں تک۔“ اسے دارقطنی نے روایت کیا ہے اور ائمہ نے اس کے موقوف کو صحیح کہا ہے۔",
        "english": "Narrated Ibn 'Umar (May Allah be pleased with them both): The Messenger of Allah (Peace and Blessings be upon him) said: 'Tayammum is two strikes: one strike for the face, and one strike for the hands up to the elbows.' Reported by Ad-Daraqutni, and the Imams authenticated it as a statement of Ibn 'Umar (Mauquf)."
      }
    },

    {
      "id": 112,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ اَلصَّعِيدُ وُضُوءُ اَلْمُسْلِمِ, وَإِنْ لَمْ يَجِدِ اَلْمَاءَ عَشْرَ سِنِينَ, فَإِذَا وَجَدَ اَلْمَاءَ فَلْيَتَّقِ اَللَّهَ, وَلْيُمِسَّهُ بَشَرَتَهُ } رَوَاهُ اَلْبَزَّارُ, وَصَحَّحَهُ اِبْنُ اَلْقَطَّانِ, وَلَكِنْ صَوَّبَ اَلدَّارَقُطْنِيُّ إِرْسَالَه ُ وَلِلتِّرْمِذِيِّ: عَنْ أَبِي ذَرٍّ نَحْوُهُ, وَصَحَّحَه ُ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مٹی (پاک زمین) مومن مسلمان کا وضو ہے خواہ دس برس تک اسے پانی نہ ملے۔ مگر جب پانی دستیاب ہو جائے تو پھر اللہ سے ڈرنا چاہیئے اور اسے اپنے جسم پر پانی پہنچانا چاہیئے۔“ اسے بزار نے روایت کیا ہے اور ابن قطان نے صحیح قرار دیا ہے، تاہم دارقطنی نے اس کے مرسل (صحابی کا نام حذف) ہونے کو درست اور قرین صواب کہا ہے۔ ترمذی میں سیدنا ابوذر رضی اللہ عنہ سے بھی اسی طرح مروی ہے، اسے ترمذی نے صحیح قرار دیا ہے اور حاکم نے بھی صحیح کہا ہے۔",
        "english": "Narrated Abu Hurayrah (May Allah be pleased with him): The Messenger of Allah (Peace and Blessings be upon him) said: 'Clean earth (Sa'id) is the purification (Wudu') for a Muslim, even if he does not find water for ten years. Then, when he finds water, let him fear Allah and let him touch his skin with it (i.e., perform Wudu' or Ghusl).' Reported by Al-Bazzar and authenticated by Ibn Al-Qattan, but Ad-Daraqutni judged it to be Mursal (missing Companion). Al-Tirmidhi reported a similar narration from Abu Dharr and authenticated it."
      }
    },

    {
      "id": 113,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ  - رضى الله عنه  - قَالَ: { خَرَجَ رَجُلَانِ فِي سَفَرٍ, فَحَضَرَتْ اَلصَّلَاةَ  -وَلَيْسَ مَعَهُمَا مَاءٌ - فَتَيَمَّمَا صَعِيدًا طَيِّبًا, فَصَلَّيَا, ثُمَّ وَجَدَا اَلْمَاءَ فِي اَلْوَقْتِ.  فَأَعَادَ أَحَدُهُمَا اَلصَّلَاةَ وَالْوُضُوءَ, وَلَمْ يُعِدِ اَلْآخَرُ, ثُمَّ أَتَيَا رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -فَذَكَرَا ذَلِكَ لَهُ, فَقَالَ لِلَّذِي لَمْ يُعِدْ: \"أَصَبْتَ اَلسُّنَّةَ وَأَجْزَأَتْكَ صَلَاتُكَ\" وَقَالَ لِلْآخَرِ: \"لَكَ اَلْأَجْرُ مَرَّتَيْنِ\" } رَوَاهُ أَبُو دَاوُدَ, ]و] النَّسَائِيّ ُ ",
        "urdu": " سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ دو آدمی سفر پر نکلے۔ نماز کا وقت آ گیا، مگر ان کے پاس پانی نہیں تھا۔ دونوں نے پاک مٹی سے تیمم کیا اور نماز پڑھ لی۔ پھر پانی بھی دستیاب ہو گیا اور ابھی نماز ادا کرنے کا وقت باقی تھا۔ ان میں سے ایک صاحب نے وضو کیا اور دوبارہ نماز ادا کی، مگر دوسرے صاحب نے نہ تو وضو کیا اور نہ ہی نماز دہرائی۔ سفر سے واپسی پر وہ دونوں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور اپنا واقعہ سنایا۔ آپ صلی اللہ علیہ وسلم نے اس شخص کو جس نے دوبارہ نماز نہیں پڑھی تھی فرمایا ”تو نے سنت کے مطابق عمل کیا اور تیری نماز کافی ہو گئی۔“ پھر آپ صلی اللہ علیہ وسلم نے دوسرے سے فرمایا ”تجھے دو گنا اجر ملے گا۔“ (ابوداؤد و نسائی)",
        "english": "Narrated Abu Sa'id Al-Khudri (may Allah be pleased with him): Two men went on a journey. The time for prayer came while they had no water. They performed Tayammum (dry ablution) with clean earth and prayed. Then they found water within the time of the prayer. One of them repeated the prayer and Wudu (ablution), while the other did not repeat the prayer. They then came to the Messenger of Allah (peace and blessings be upon him) and mentioned that to him. He said to the one who did not repeat the prayer, \"You acted according to the Sunnah, and your prayer was sufficient for you.\" And he said to the other, \"You will have double the reward.\" (Reported by Abu Dawud and An-Nasa'i)"
      }
    },

    {
      "id": 114,
      "name": {
        "arabic": " وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا فِي قَوْلِهِ عَزَّ وَجَلَّ ﴿ وَإِنْ كُنْتُمْ مَرْضَى أَوْ عَلَى سَفَرٍ ﴾ 1  قَالَ: \"إِذَا كَانَتْ بِالرَّجُلِ اَلْجِرَاحَةُ فِي سَبِيلِ اَللَّهِ وَالْقُرُوحُ, فَيُجْنِبُ, فَيَخَافُ أَنْ يَمُوتَ إِنْ اِغْتَسَلَ: تَيَمَّمَ\" .  رَوَاهُ اَلدَّارَقُطْنِيُّ مَوْقُوفًا, وَرَفَعَهُ اَلْبَزَّارُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَالْحَاكِم ُ ",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ ان سے اللہ تعالیٰ کے ارشاد «وإن كنتم مرضى أو على سفر» کے متعلق دریافت کیا گیا تو انہوں نے جواب دیا کہ جب کسی شخص کو راہ خدا میں زخم اور گھاؤ لگے اور اسی حالت میں اسے جنابت لاحق ہو جائے اور غسل کرنے کی صورت میں مر جانے کا اندیشہ ہو تو وہ تیمم کر لے۔ اس روایت کو دارقطنی نے موقوف، بزار نے مرفوع اور ابن خزیمہ اور حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn Abbas (may Allah be pleased with them both), regarding the saying of Allah, the Exalted: \"And if you are ill or on a journey...\" [Qur'an 4:43], he said: \"If a man has wounds in the way of Allah or sores, and he becomes Junub (in a state of major ritual impurity) and fears that he will die if he performs Ghusl (ritual bath), he should perform Tayammum (dry ablution).\" Reported by Ad-Daraqutni as Mawquf (stopped at the Companion), and Al-Bazzar transmitted it as Marfu' (traced back to the Prophet), and Ibn Khuzaymah and Al-Hakim graded it Sahih (authentic)."
      }
    },

    {
      "id": 115,
      "name": {
        "arabic": " وَعَنْ عَلِيٍّ  - رضى الله عنه  - قَالَ: { اِنْكَسَرَتْ إِحْدَى زَنْدَيَّ فَسَأَلَتْ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -فَأَمَرَنِي أَنْ أَمْسَحَ عَلَى اَلْجَبَائِرِ } رَوَاهُ اِبْنُ مَاجَه بِسَنَدٍ وَاهٍ جِدًّ ا",
        "urdu": " سیدنا علی رضی اللہ عنہ نے بیان کیا کہ میرا گٹ ٹوٹ گیا تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے وضو کے بارے میں پوچھا (کہ اب میں کیا کروں؟) تو آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا ”پٹیوں پر مسح کر لیا کرو۔“ اسے ابن ماجہ نے نہایت ہی کمزور و ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated 'Ali (may Allah be pleased with him): 'One of my forearms was broken, so I asked the Messenger of Allah (peace and blessings be upon him) [about Wudu in this condition], and he commanded me to wipe over the bandages (splints).' Reported by Ibn Majah with a very weak chain (Isnad Wahin Jiddan)."
      }
    },

    {
      "id": 116,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ]بْنُ عَبْدِ اَللَّهِ] رَضِيَ اَللَّهُ عَنْهُمَا فِي اَلرَّجُلِ اَلَّذِي شُجَّ, فَاغْتَسَلَ فَمَاتَ  -: \"إِنَّمَا كَانَ يَكْفِيهِ أَنْ يَتَيَمَّمَ, وَيَعْصِبَ عَلَى جُرْحِهِ خِرْقَةً, ثُمَّ يَمْسَحَ عَلَيْهَا وَيَغْسِلَ سَائِرَ جَسَدِهِ\" } رَوَاهُ أَبُو دَاوُدَ بِسَنَدٍ فِيهِ ضَعْفٌ, وَفِيهِ اِخْتِلَافٌ عَلَى رُوَاتِه",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے اس شخص کے بارے میں جس کے سر پر زخم آیا تھا اور اسی حالت میں اس نے غسل کر لیا اور وفات پا گیا، کہ اسے تو تیمم کر لینا ہی کافی تھا۔ اپنے زخم پر پٹی باندھ کر مسح کرتا اور باقی بدن کو دھو لیتا۔ اس روایت کو ضعیف سند کے ساتھ ابوداؤد نے روایت کیا ہے اور اس کے راویوں میں بھی اختلاف ہے۔  ",
        "english": "Narrated Jabir ibn Abdullah (may Allah be pleased with them both), concerning the man who suffered a head injury (Shujj) and died after performing Ghusl (ritual bath): [The Prophet ﷺ said:] 'It would have been sufficient for him to perform Tayammum, and to tie a rag over his wound, and then wipe over it, and wash the rest of his body.' Reported by Abu Dawud with a weak chain of narration, and there is also a disagreement among its narrators."
      }
    },

    {
      "id": 117,
      "name": {
        "arabic": " وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { مِنْ اَلسُّنَّةِ أَنْ لَا يُصَلِّيَ اَلرَّجُلُ بِالتَّيَمُّمِ إِلَّا صَلَاةً وَاحِدَةً, ثُمَّ يَتَيَمَّمُ لِلصَّلَاةِ اَلْأُخْرَى } رَوَاهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ جِدًّ ا",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما کہتے ہیں کہ سنت یہی ہے کہ تیمم کرنے والا شخص تیمم سے ایک ہی نماز پڑھے اور دوسری نماز کیلئے ازسرنو (دوبارہ سے) تیمم کرے۔ اس کو دارقطنی نے بہت ہی ضعیف سند سے روایت کیا ہے۔",
        "english": "Narrated Ibn Abbas (may Allah be pleased with them both): 'It is part of the Sunnah that a man should not perform more than one prayer with Tayammum, and he should perform Tayammum again for the next prayer.' Reported by Ad-Daraqutni with a very weak chain of narration (Isnad Da'if Jiddan)."
      }
    }
  ]
}