{
  "chapId": 104,
  "bookId": 16,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1266,
    "to": 1276
  },
  "hadiths": [
    {
      "id": 1266,
      "name": {
        "arabic": " عَنْ اَلنُّعْمَانِ بْنِ بَشِيرٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ‏- وَأَهْوَى اَلنُّعْمَانُ بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ: { إِنَّ اَلْحَلَالَ بَيِّنٌ, وَإِنَّ اَلْحَرَامَ بَيِّنٌ, وَبَيْنَهُمَا مُشْتَبِهَاتٌ, لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ اَلنَّاسِ, فَمَنِ اتَّقَى اَلشُّبُهَاتِ, فَقَدِ اِسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ, وَمَنْ وَقَعَ فِي اَلشُّبُهَاتِ وَقَعَ فِي اَلْحَرَامِِ, كَالرَّاعِي يَرْعَى حَوْلَ اَلْحِمَى, يُوشِكُ أَنْ يَقَعَ فِيهِ, أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى, أَلَا وَإِنَّ حِمَى اَللَّهِ مَحَارِمُهُ, أَلَا وَإِنَّ فِي اَلْجَسَدِ مُضْغَةً, إِذَا صَلَحَتْ, صَلَحَ اَلْجَسَدُ كُلُّهُ, وَإِذَا فَسَدَتْ فَسَدَ اَلْجَسَدُ كُلُّهُ, أَلَا وَهِيَ اَلْقَلْبُ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا نعمان بن بشیر رضی اللہ عنہما سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا اور نعمان اپنی دونوں انگلیوں کو اپنے کانوں کی طرف لے گئے ” حلال بھی واضح ہے اور حرام بھی ان دونوں کے درمیان شبہات ہیں۔ لوگوں کی اکثریت ان کو نہیں جانتی۔ پس جو کوئی شبہات سے بچ گیا تو اس نے اپنے دین اور اپنی عزت و آبرو کو بچا لیا اور جو شبہات میں پڑ گیا وہ حرام میں پھنس گیا۔ جیسے چرواہا کہ چراگاہ کے گرد مویشی چراتا ہو تو کبھی نہ کبھی مویشی چراگاہ میں چلے جاتے ہیں۔ خبردار! ہر بادشاہ کی چراگاہ ہوتی ہے۔ خبردار! حرام چیزیں اللہ کی چراگاہ ہیں۔ خبردار! جسم میں گوشت کا ایک ٹکڑا ہے جب وہ درست ہو تو سارا جسم درست ہوتا ہے اور جب وہ بگڑ جائے تو سارا جسم بگڑ جاتا ہے۔ سن لو! وہ ٹکڑا دل ہے۔“ (بخاری و مسلم) ",
        "english": "Narrated An-Nu'man bin Bashir (RA): I heard Allah's Messenger (ﷺ) saying - and Nu'man pointed with his two fingers to his ears: 'What is lawful is clear and what is unlawful is clear, but between them are doubtful matters which many people do not know. So whoever avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters falls into what is unlawful, like the shepherd who pastures around a sanctuary, all but grazing therein. Truly every king has a sanctuary, and truly Allah's sanctuary is His prohibitions. Truly in the body there is a morsel of flesh which, if it be whole, all the body is whole and which, if it be diseased, all of it is diseased. Truly it is the heart.'"
      }
    },

    {
      "id": 1267,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تَعِسَ عَبْدُ اَلدِّينَارِ, وَالدِّرْهَمِ, وَالْقَطِيفَةِ, إِنْ أُعْطِيَ رَضِيَ, وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ } أَخْرَجَهُ الْبُخَارِيُّ.",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”برباد ہو گیا دینار (سونے کے سکے) کا بندہ، درہم (چاندی کے سکے) کا بندہ اور مخملی چادر کا بندہ؛ اگر اسے یہ چیزیں مل جائیں تو وہ راضی رہتا ہے اور اگر نہ دی جائیں تو وہ ناراض ہو جاتا ہے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Wretched is the slave of the Dinar, the slave of the Dirham, and the slave of the Khamisa (fine garment). If he is given (of these things), he is pleased, and if he is not given, he is displeased.'"
      }
    },

    {
      "id": 1268,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: أَخَذَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِمَنْكِبِي, فَقَالَ: { كُنْ فِي اَلدُّنْيَا كَأَنَّكَ غَرِيبٌ, أَوْ عَابِرُ سَبِيلٍ } وَكَانَ اِبْنُ عُمَرَ يَقُولُ: إِذَا أَمْسَيْتَ فَلَا تَنْتَظِرِ اَلصَّبَاحَ, وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرِ اَلصَّبَاحَ, وَخُذْ مِنْ صِحَّتِكَ لِسَقَمِكَ, وَمِنْ حَيَاتِكَ لِمَوْتِكَ.‏ أَخْرَجَهُ اَلْبُخَارِيُّ.‏",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے میرے کندھے پکڑ کر فرمایا: ”دنیا میں ایسے رہو جیسے تم ایک اجنبی ہو یا ایک راہ چلتے مسافر ہو۔“ اور ابن عمر رضی اللہ عنہما کہا کرتے تھے: جب تم شام کرو تو صبح کا انتظار نہ کرو، اور جب صبح کرو تو شام کا انتظار نہ کرو، اور اپنی تندرستی کو بیماری کے لیے (غنیمت جانو) اور اپنی زندگی کو موت کے لیے (ذخیرہ بناؤ)۔ (بخاری)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) took hold of my shoulders and said, 'Be in this world as if you were a stranger or a traveler on a path.' And Ibn 'Umar used to say, 'In the evening, do not expect to see the morning, and in the morning, do not expect to see the evening. Take from your health for your sickness and from your life for your death.'"
      }
    },

    {
      "id": 1269,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَشَبَّهَ بِقَوْمٍ, فَهُوَ مِنْهُمْ } أَخْرَجَهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ.‏ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس کسی نے کسی دوسری قوم سے مشابہت اختیار کی، پس وہ انہی میں سے ہے۔“ اسے ابوداؤد نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'Whoever imitates a people is one of them.'"
      }
    },

    {
      "id": 1270,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ قَالَ: كُنْتُ خَلْفَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَوْمًا, فَقَالَ: { يَا غُلَامُ! اِحْفَظِ اَللَّهَ يَحْفَظْكَ, اِحْفَظِ اَللَّهَ تَجِدْهُ تُجَاهَكَ, وَإِذَا سَأَلْتَ فَاسْأَلْ اَللَّهَ, وَإِذَا اِسْتَعَنْتَ فَاسْتَعِنْ بِاَللَّهِ } رَوَاهُ اَلتِّرْمِذِيُّ, وَقَالَ: حَسَنٌ صَحِيحٌ.‏",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ ایک دن میں نبی کریم صلی اللہ علیہ وسلم کے پیچھے (سوار) تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اے لڑکے! تو اللہ (کے احکام) کی حفاظت کر، اللہ تیری حفاظت کرے گا۔ تو اللہ کی یاد کی حفاظت کر تو اسے اپنے سامنے پائے گا۔ جب تو کچھ مانگے تو اللہ سے مانگ اور جب تو مدد چاہے تو اللہ ہی سے مدد طلب کر۔“ (ترمذی)",
        "english": "Narrated Ibn 'Abbas (RA): One day I was (riding) behind the Prophet (ﷺ) and he said to me: 'O young man, be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. When you ask (for anything), ask it from Allah; and if you seek help, seek help from Allah.'"
      }
    },

    {
      "id": 1271,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: يَا رَسُولُ اَللَّهِ! دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ أَحَبَّنِي اَللَّهُ, وَأَحَبَّنِي اَلنَّاسُ.‏ [فـ] قَالَ: اِزْهَدْ فِي اَلدُّنْيَا يُحِبُّكَ اَللَّهُ, وَازْهَدْ فِيمَا عِنْدَ اَلنَّاسِ يُحِبُّكَ اَلنَّاسُ } رَوَاهُ اِبْنُ مَاجَه, وَسَنَدُهُ حَسَنٌ",
        "urdu": "سیدنا سہل بن سعد رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا۔ اے اللہ کے رسول! مجھے ایسا عمل ارشاد فرمائیے کہ جب میں وہ عمل کروں تو اللہ مجھے اپنا محبوب بنا لے اور لوگ بھی مجھ سے محبت کریں۔ آپ صلی اللہ علیہ وسلم نے اس کے جواب میں فرمایا ” دنیا سے بے نیاز و بے رغبت ہو جا اللہ تجھے محبوب رکھے گا اور لوگوں کے پاس جو کچھ ہے اس سے بھی بے نیاز ہو جا لوگ بھی تجھے محبوب رکھیں گے اور پسند کریں گے۔“ اسے ابن ماجہ وغیرہ نے روایت کیا ہے اور اس کی سند حسن ہے۔",
        "english": "Sahl bin Sa'd narrated: A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah, guide me to an action which, if I do it, Allah will love me and the people will also love me.' He (ﷺ) said: 'Be detached from this world (Zuhd) and Allah will love you, and be detached from what the people have and the people will love you.'"
      }
    },

    {
      "id": 1272,
      "name": {
        "arabic": " وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِنَّ اَللَّهَ يُحِبُّ اَلْعَبْدَ اَلتَّقِيَّ, اَلْغَنِيَّ, اَلْخَفِيَّ } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": "سیدنا سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ارشاد فرماتے سنا: ”اللہ تعالیٰ ایسے بندے کو محبوب رکھتا ہے جو پرہیزگار ہو، (دل کا) غنی ہو اور گمنام (ریا کاری سے دور) ہو۔“ (مسلم)",
        "english": "Narrated Sa'd bin Abi Waqqas (RA): I heard Allah's Messenger (ﷺ) saying: 'Allah loves the slave who is God-fearing (pious), rich (contented in heart), and unknown (who stays away from fame and ostentation).'"
      }
    },

    {
      "id": 1273,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { مِنْ حُسْنِ إِسْلَامِ اَلْمَرْءِ, تَرْكُهُ مَا لَا يَعْنِيهِ } رَوَاهُ اَلتِّرْمِذِيُّ, وَقَالَ حَسَنٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” آدمی کا بے مقصد چیزوں کو چھوڑ دینا اس کے اسلام کے اچھا ہونے کی دلیل ہے۔“ اسے ترمذی نے روایت کیا ہے اور اسے حسن قرار دیا ہے۔",
        "english": "Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said: 'Part of the perfection of one's Islam is his leaving that which does not concern him.' [Reported by At-Tirmidhi, who graded it as Hasan]"
      }
    },

    {
      "id": 1274,
      "name": {
        "arabic": "وَعَنْ اَلْمِقْدَامِ بْنِ مَعْدِيكَرِبَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { مَا مَلَأَ ابْنُ آدَمَ وِعَاءً شَرًّا مِنْ بَطْنٍ } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَحَسَّنَهُ.",
        "urdu": "سیدنا مقدام بن معد یکرب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” وہ بدترین برتن جو انسان بھرتا ہے، (انسان کا) پیٹ ہے۔“ اسے ترمذی نے روایت کیا ہے اور اسے حسن قرار دیا ہے۔",
        "english": "Narrated Al-Miqdam bin Ma'dikarib: The Messenger of Allah (ﷺ) said: 'The son of Adam does not fill any vessel worse than his stomach.'"
      }
    },

    {
      "id": 1275,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { كُلُّ بَنِي آدَمَ خَطَّاءٌ, وَخَيْرُ اَلْخَطَّائِينَ اَلتَّوَّابُونَ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَابْنُ مَاجَهْ, وَسَنَدُهُ قَوِيٌّ.",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” آدم کا ہر بیٹا خطاکار ہے اور بہترین خطاکار وہ ہیں جو بہت زیادہ توبہ کرنے والے ہوں گے۔“ اسے ترمذی اور ابن ماجہ نے روایت کیا ہے۔",
        "english": "Narrated Anas (RAA): The Messenger of Allah (ﷺ) said: 'Every son of Adam is a sinner, and the best of sinners are those who repent.'"
      }
    },

    {
      "id": 1276,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلصَّمْتُ حِكْمَةٌ, وَقَلِيلٌ فَاعِلُهُ } أَخْرَجَهُ اَلْبَيْهَقِيُّ فِي \" اَلشُّعَبِ\" بِسَنَدٍ ضَعِيفٍ. وَصَحَّحَ أَنَّهُ مَوْقُوفٌ مِنْ قَوْلِ لُقْمَانَ اَلْحَكِيمِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” خاموشی حکمت و دانائی ہے لیکن اس پر عمل پیرا ہونے والے تھوڑے ہی ہوتے ہیں۔“ اسے بیہقی نے شعب الایمان میں ضعیف سند کے ساتھ روایت کیا ہے اور صحیح بات یہ ہے کہ یہ لقمان حکیم کا قول ہے۔",
        "english": "Narrated Anas (RAA): The Messenger of Allah (ﷺ) said: 'Silence is wisdom, but few are those who practice it.' [Reported by al-Baihaqi in Ash-Shu'ab with a weak chain]. The correct view is that it is a saying of Luqman al-Hakim."
      }
    }
  ]
}
