{
  "chapId": 66,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 867,
    "to": 880
  },
  "hadiths": [
    {
      "id": 867,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَلْعُونٌ مَنْ أَتَى اِمْرَأَةً فِي دُبُرِهَا } رَوَاهُ أَبُو دَاوُدَ , وَالنَّسَائِيُّ وَاللَّفْظُ لَهُ , وَرِجَالُهُ ثِقَاتٌ , وَلَكِنْ أُعِلَّ بِالْإِرْسَالِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ملعون (لعنتی) ہے وہ شخص جو اپنی بیوی کے ساتھ پاخانہ والی جگہ (دبر) میں جماع کرے۔“ اسے ابوداؤد اور نسائی نے روایت کیا ہے، یہ الفاظ نسائی کے ہیں اور اس کے تمام راوی ثقہ ہیں، اگرچہ بعض نے اسے مرسل ہونے کی وجہ سے معلول قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"Cursed is he who has intercourse with a woman in her rectum (anal sex).\" Reported by Abu Dawud and An-Nasa'i, and the wording is from the latter. Its narrators are reliable, but it was pointed out to have a defect (Irsal)."
      }
    },

    {
      "id": 868,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَنْظُرُ اَللَّهُ إِلَى رَجُلٍ أَتَى رَجُلاً أَوْ اِمْرَأَةً فِي دُبُرِهَا } رَوَاهُ اَلتِّرْمِذِيُّ , وَالنَّسَائِيُّ , وَابْنُ حِبَّانَ , وَأُعِلَّ بِالْوَقْفِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ ایسے شخص کی طرف (رحمت کی نظر سے) نہیں دیکھے گا جس نے کسی مرد کے ساتھ بدفعلی کی ہو یا کسی عورت کے ساتھ غیر فطری راستہ (دبر) سے جماع کیا ہو۔“ اسے ترمذی، نسائی اور ابن حبان نے روایت کیا ہے، اور بعض نے اسے موقوف ہونے کی وجہ سے معلول قرار دیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: 'Allah will not look at a man who commits sodomy with a man or has intercourse with a woman in her back (rectum).' [Reported by At-Tirmidhi, An-Nasa'i, and Ibn Hibban. It was graded as Da'if due to being Mauquf by some, but it has authentic supporting narrations]."
      }
    },

    {
      "id": 869,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ اَلْآخِرِ فَلَا يُؤْذِي جَارَهُ , وَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا , فَإِنَّهُنَّ خُلِقْنَ مِنْ ضِلَعٍ , وَإِنَّ أَعْوَجَ شَيْءٍ فِي اَلضِّلَعِ أَعْلَاهُ , فَإِنْ ذَهَبْتَ تُقِيمَهُ كَسَرْتَهُ , وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ , فَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ : { فَإِنْ اِسْتَمْتَعْتَ بِهَا اِسْتَمْتَعْتَ وَبِهَا عِوَجٌ , وَإِنْ ذَهَبْتَ تُقِيمُهَا كَسَرْتَهَا , وَكَسْرُهَا طَلَاقُهَا }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہے وہ اپنے ہمسایہ کو اذیت نہ پہنچائے اور عورتوں کے بارے میں بھلائی کی وصیت قبول کرو، بیشک ان کو پسلی سے پیدا کیا گیا ہے اور پسلی کا زیادہ ٹیڑھا حصہ اس کا اوپر والا ہوتا ہے۔ لہذا اگر کوئی اسے سیدھا کرنے کی کوشش کرے گا تو اسے توڑ بیٹھے گا اور اگر اس کو اس کے حال پر چھوڑ دے گا تو وہ ہمیشہ ٹیڑھی رہے گی۔ پس عورتوں کے حق میں ہمیشہ بھلائی کی وصیت قبول کرو۔“ (بخاری و مسلم) یہ الفاظ بخاری کے ہیں اور مسلم کی روایت میں ہے: ”اگر تو اس سے فائدہ حاصل کرنا چاہتا ہے تو اس کے ٹیڑھے پن کے باوجود اس سے فائدہ اٹھا سکے گا اور اگر تو نے اسے سیدھا کرنے کی کوشش کی تو اسے توڑ بیٹھے گا اور اس کا توڑنا اسے طلاق دینا ہے۔“",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day should not harm his neighbor. And treat women kindly, for they were created from a rib, and the most crooked part of a rib is its upper part. If you attempt to straighten it, you will break it, and if you leave it, it will remain crooked. So treat women kindly.\" [Agreed upon]. Muslim's version says: \"If you wish to enjoy her, you can enjoy her despite her crookedness, but if you try to straighten her, you will break her, and breaking her is divorcing her.\""
      }
    },

    {
      "id": 870,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ : { كُنَّا مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- فِي غَزَاةٍ , فَلَمَّا قَدِمْنَا اَلْمَدِينَةَ , ذَهَبْنَا لِنَدْخُلَ .‏ فَقَالَ : \" أَمْهِلُوا حَتَّى تَدْخُلُوا لَيْلًا ‏- يَعْنِي : عِشَاءً ‏- لِكَيْ تَمْتَشِطَ اَلشَّعِثَةُ , وَتَسْتَحِدَّ اَلْمَغِيبَةُ } مُتَّفَقٌ عَلَيْهِ وَفِي رِوَايَةٍ لِلْبُخَارِيِّ : { إِذَا أَطَالَ أَحَدُكُمُ الْغَيْبَةَ , فَلَا يَطْرُقْ أَهْلَهُ لَيْلاً }",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ ایک غزوہ میں ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے۔ جب ہم مدینہ واپس پہنچ کر اپنے اپنے گھروں میں جانے لگے تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”ذرا ٹھہر جاؤ۔ رات کے وقت گھروں میں داخل ہونا (مراد عشاء کا وقت تھا)، تاکہ پراگندہ بالوں والی اپنے بالوں میں کنگھی کر لے اور جس کا خاوند غائب تھا وہ (صفائی کر کے) تیار ہو جائے۔“ (بخاری و مسلم) بخاری کی ایک روایت میں ہے: ”جب تم میں سے کوئی لمبی مدت کے بعد آئے تو رات کو اچانک گھر نہ پہنچے۔“",
        "english": "Narrated Jabir (RA): We were with Allah's Messenger (ﷺ) in an expedition. When we reached Madinah and were about to enter our houses, he said: 'Wait so that you may enter at night (i.e., at the time of 'Isha) so that the woman with unkempt hair may comb it and the one whose husband has been away may shave her private parts.' [Agreed upon]. A version in Bukhari says: 'If one of you is away for a long time, he should not come to his family at night.'"
      }
    },

    {
      "id": 871,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ شَرَّ اَلنَّاسِ مَنْزِلَةً عِنْدَ اَللَّهِ يَوْمَ اَلْقِيَامَةِ ; اَلرَّجُلُ يُفْضِي إِلَى اِمْرَأَتِهِ وَتُفْضِي إِلَيْهِ , ثُمَّ يَنْشُرُ سِرَّهَا } أَخْرَجَهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن اللہ تعالیٰ کے نزدیک مرتبے کے اعتبار سے بدترین انسان وہ ہو گا جو اپنی بیوی کے پاس (خلوت میں) جائے اور بیوی اس کے پاس آئے، پھر وہ اس کے راز (پوشیدہ باتوں) کو عام کرے۔“ (مسلم)",
        "english": "Narrated Abu Sa'id al-Khudri (RA): Allah's Messenger (ﷺ) said: \"Among the worst people in the sight of Allah on the Day of Resurrection is the man who confides in his wife and she confides in him, and then he reveals her secret.\""
      }
    },

    {
      "id": 872,
      "name": {
        "arabic": "وَعَنْ حَكِيمِ بْنِ مُعَاوِيَةَ , عَنْ أَبِيهِ قَالَ : { قُلْتُ : يَا رَسُولُ اَللَّهِ ! مَا حَقُّ زَوْجِ أَحَدِنَا عَلَيْهِ ? قَالَ : \" تُطْعِمُهَا إِذَا أَكَلْتَ , وَتَكْسُوهَا إِذَا اِكْتَسَيْتَ , وَلَا تَضْرِبِ الْوَجْهَ , وَلَا تُقَبِّحْ , وَلَا تَهْجُرْ إِلَّا فِي اَلْبَيْتِ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَالنَّسَائِيُّ , وَابْنُ مَاجَهْ، وَعَلَّقَ اَلْبُخَارِيُّ بَعْضَهُ، وَصَحَّحَهُ اِبْنُ حِبَّانَ , وَالْحَاكِمُ",
        "urdu": "سیدنا حکیم بن معاویہ نے اپنے باپ سے بیان کیا وہ کہتے ہیں کہ میں نے عرض کیا یا رسول اللہ! ہماری بیویوں کا ہم پر کیا حق ہے؟ ارشاد ہوا کہ ”جب تو کھائے تو اسے بھی کھلا، جب تو پہنے تو اسے بھی پہنا، اس کے چہرے پر نہ مار، اسے گالی گلوچ نہ دے اور (ناراضگی کی صورت میں) گھر کے علاوہ اسے کہیں اور تنہا نہ چھوڑ۔“",
        "english": "Narrated Hakim bin Mu'awiya on the authority of his father: I asked, 'O Messenger of Allah (ﷺ), what is the right of the wife of one of us upon him?' He replied, 'That you should feed her when you eat, clothe her when you clothe yourself, do not strike her on the face, do not revile her, and do not separate from her except within the house.'"
      }
    },

    {
      "id": 873,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { كَانَتِ الْيَهُودُ تَقُولُ : إِذَا أَتَى اَلرَّجُلُ اِمْرَأَةَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا , كَانَ اَلْوَلَدُ أَحْوَلَ .‏ فَنَزَلَتْ : \"نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوْا حَرْثَكُمْ أَنَّى شِئْتُمْ\" [اَلْبَقَرَة : 223] } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ یہود کہتے تھے کہ مرد جب اپنی بیوی سے پچھلی جانب سے (مگر) اگلی شرمگاہ میں جماع کرتا ہے تو بچہ بھینگا پیدا ہوتا ہے۔ اس موقع پر اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ ”تمہاری عورتیں تمہاری کھیتی ہیں، پس تم اپنی کھیتی میں جس طرح چاہو آؤ۔“ (بخاری و مسلم) یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): The Jews used to say that if a man had intercourse with his wife from behind (in the vagina), the child would be born cross-eyed (squint). Then the verse was revealed: \"Your wives are a tilth for you, so go to your tilth as you will.\" (Al-Baqarah: 223)"
      }
    },

    {
      "id": 874,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ : بِسْمِ اَللَّهِ .‏ اَللَّهُمَّ جَنِّبْنَا اَلشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا ; فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ , لَمْ يَضُرَّهُ اَلشَّيْطَانُ أَبَدًا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم میں سے کوئی اپنی بیوی کے پاس (جماع کے ارادے سے) جاتے وقت یہ دعا پڑھے: «بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا» (اللہ کے نام کے ساتھ، اے اللہ! ہمیں شیطان سے بچا اور شیطان کو اس اولاد سے بھی دور رکھ جو تو ہمیں عطا فرمائے)۔ تو اگر اس جماع کے نتیجے میں ان کے مقدر میں اولاد لکھی ہو گی، تو شیطان اسے کبھی نقصان نہیں پہنچا سکے گا۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: 'If anyone of you, when he intends to have sexual intercourse with his wife, says: \"In the name of Allah. O Allah, keep the devil away from us and keep the devil away from what You bestow on us (children),\" and if it is ordained that they should have a child as a result of that, the devil will never be able to harm that child.'"
      }
    },

    {
      "id": 875,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا دَعَا اَلرَّجُلُ اِمْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ أَنْ تَجِيءَ , لَعَنَتْهَا اَلْمَلَايِكَةُ حَتَّى تُصْبِحَ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ : { كَانَ اَلَّذِي فِي اَلسَّمَاءِ سَاخِطًا عَلَيْهَا حَتَّى يَرْضَى عَنْهَا }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جب مرد اپنی بیوی کو اپنے بستر پر (جماع کے لیے) بلائے اور وہ آنے سے انکار کر دے، تو فرشتے صبح تک اس پر لعنت بھیجتے رہتے ہیں۔“ (بخاری و مسلم) اور مسلم کی ایک روایت میں ہے: ”وہ ذات جو آسمان میں ہے (اللہ تعالیٰ) اس عورت سے ناراض رہتی ہے یہاں تک کہ اس کا خاوند اس سے راضی ہو جائے۔“",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"When a man calls his wife to his bed and she refuses to come, the angels curse her until the morning.\" [Agreed upon]. Muslim's version has: \"The One Who is in the heaven is displeased with her until her husband is pleased with her.\""
      }
    },

    {
      "id": 876,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- لَعَنَ اَلْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ , وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے سر میں مصنوعی بال جوڑنے والی اور جڑوانے والی، اور جسم پر گود کر نشان (ٹیٹو) بنانے والی اور بنوانے والی پر لعنت فرمائی ہے۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) cursed the woman who joins (her or another's) hair with artificial hair and the woman who asks for it to be joined, and the woman who tattoos and the woman who asks to be tattooed. [Agreed upon]."
      }
    },

    {
      "id": 877,
      "name": {
        "arabic": "وَعَنْ جُذَامَةَ بِنْتِ وَهْبٍ -رَضِيَ اَللَّهُ عَنْهَا- قَالَتْ : { حَضَرْتُ رَسُولَ اَللَّهِ - صلى الله عليه وسلم -فِي أُنَاسٍ , وَهُوَ يَقُولُ : لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ , فَنَظَرْتُ فِي اَلرُّومِ وَفَارِسَ , فَإِذَا هُمْ يُغِيلُونَ أَوْلَادَهُمْ فَلَا يَضُرُّ ذَلِكَ أَوْلَادَهُمْ شَيْئًا . ثُمَّ سَأَلُوهُ عَنِ الْعَزْلِ ? فَقَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم - \"ذَلِكَ اَلْوَأْدُ اَلْخَفِيُّ\" } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ جدامہ بنت وھب رضی اللہ عنہا سے روایت ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی، اس وقت آپ ﷺ فرما رہے تھے کہ: ”میں نے غیلہ (دورانِ رضاعت ہمبستری) سے منع کرنے کا ارادہ کیا، پھر میں نے روم و فارس کی طرف دیکھا کہ وہ غیلہ کرتے ہیں اور ان کی اولاد کو اس سے کوئی نقصان نہیں پہنچتا۔“ پھر لوگوں نے عزل (انزال باہر کرنا) کے بارے میں پوچھا تو آپ ﷺ نے فرمایا: ”یہ زندہ درگور کرنے کا پوشیدہ طریقہ ہے۔“ (مسلم)",
        "english": "Judama bint Wahb (RA) reported: I was with the Messenger of Allah (ﷺ) when he said: \"I intended to prohibit Ghalah (intercourse during the period of lactation), but I saw that the Romans and Persians do it and it does not harm their children.\" Then they asked him about Azl (withdrawing before ejaculation), and he replied: \"That is the hidden burying of a child alive.\""
      }
    },

    {
      "id": 878,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَجُلاً قَالَ : يَا رَسُولَ اَللَّهِ ! إِنَّ لِي جَارِيَةً , وَأَنَا أَعْزِلُ عَنْهَا , وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ , وَأَنَا أُرِيدُ مَا يُرِيدُ اَلرِّجَالُ , وَإِنَّ اَلْيَهُودَ تُحَدِّثُ: أَنَّ اَلْعَزْلَ المَوْؤُدَةُ اَلصُّغْرَى .‏ قَالَ : \" كَذَبَتْ يَهُودُ , لَوْ أَرَادَ اَللَّهُ أَنْ يَخْلُقَهُ مَا اِسْتَطَعْتَ أَنْ تَصْرِفَهُ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ وَاللَّفْظُ لَهُ , وَالنَّسَائِيُّ , وَاَلطَّحَاوِيُّ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے کہا، اے اللہ کے رسول! میری ایک لونڈی ہے۔ میں اس سے عزل کرتا ہوں اور اس کا حاملہ ہونا مجھے پسند نہیں اور میں وہی چاہتا ہوں جو مرد چاہتے ہیں۔ یہودی کہتے ہیں کہ عزل تو چھوٹا زندہ درگور کرنا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”یہود نے جھوٹ بولا ہے۔ اگر اللہ تعالیٰ اسے پیدا کرنا چاہے تو تم اسے روک نہیں سکتے۔“",
        "english": "Narrated Abu Sa'id al-Khudri (RA): A man said, 'O Messenger of Allah! I have a slave-girl and I practice Coitus Interruptus (Azl) with her. I do not want her to become pregnant, but I desire what men desire. The Jews say that Azl is minor infanticide.' The Prophet (ﷺ) replied, 'The Jews have lied. If Allah wishes to create it, you cannot prevent it.'"
      }
    },

    {
      "id": 879,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ : { كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَالْقُرْآنُ يَنْزِلُ , وَلَوْ كَانَ شَيْئًا يُنْهَى عَنْهُ لَنَهَانَا عَنْهُ اَلْقُرْآنُ } مُتَّفَقٌ عَلَيْهِ وَلِمُسْلِمٍ : { فَبَلَغَ ذَلِكَ نَبِيَّ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَلَمْ يَنْهَنَا }",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے عہد میں عزل کرتے تھے اور قرآن اس وقت نازل ہو رہا تھا۔ اگر یہ ایسی چیز ہوتی جس سے منع کرنا مقصود ہوتا تو قرآن ہمیں اس سے لازماً منع کر دیتا۔ (بخاری و مسلم) اور صحیح مسلم کی ایک روایت میں ہے کہ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی مگر آپ ﷺ نے ہمیں اس سے منع نہیں فرمایا۔",
        "english": "Narrated Jabir (RA): \"We used to practice 'Azl (coitus interruptus) during the lifetime of Allah's Messenger (ﷺ) while the Qur'an was being revealed. Had it been something to be forbidden, the Qur'an would have forbidden us from doing it.\" [Agreed upon]. Muslim added: \"This (news) reached the Prophet (ﷺ) and he did not forbid us.\""
      }
    },

    {
      "id": 880,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- كَانَ يَطُوفُ عَلَى نِسَائِهِ بِغُسْلٍ وَاحِدٍ } أَخْرَجَاهُ , وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم ایک ہی غسل سے اپنی تمام ازواجِ مطہرات کے پاس چلے جایا کرتے تھے۔ (بخاری و مسلم) یہ الفاظ صحیح مسلم کے ہیں۔",
        "english": "Narrated Anas bin Malik (RA): The Prophet (ﷺ) used to go round (having sexual relations with) all his wives with a single Ghusl (bath). [Reported by Al-Bukhari and Muslim, and the wording is Muslim's]."
      }
    }
  ]
}