{
  "chapId": 81,
  "bookId": 9,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1020,
    "to": 1021
  },
  "hadiths": [
    {
      "id": 1020,
      "name": {
        "arabic": "عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ, عَنْ رِجَالٍ مِنْ كُبَرَاءِ قَوْمِهِ, أَنَّ عَبْدَ اَللَّهِ بْنَ سَهْلٍ ومُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ, فَأُتِيَ مَحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اَللَّهِ بْنِ سَهْلِ قَدْ قُتِلَ, وَطُرِحَ فِي عَيْنٍ, فَأَتَى يَهُودَ, فَقَالَ: أَنْتُمْ وَاَللَّهِ قَتَلْتُمُوهُ.‏ قَالُوا: وَاَللَّهِ مَا قَتَلْنَاهُ, فَأَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ اَلرَّحْمَنِ بْنِ سَهْلٍ, فَذَهَبَ مُحَيِّصَةُ لَيَتَكَلَّمَ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"كَبِّرْ كَبِّرْ\" يُرِيدُ: اَلسِّنَّ, فَتَكَلَّمَ حُوَيِّصَةُ, ثُمَّ تَكَلَّمَ مُحَيِّصَةُ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"إِمَّا أَنْ يَدُوا صَاحِبَكُمْ, وَإِمَّا أَنْ يَأْذَنُوا بِحَرْبٍ\".‏ فَكَتَبَ إِلَيْهِمْ فِي ذَلِكَ [كِتَابًا].‏ فَكَتَبُوا: إِنَّا وَاَللَّهِ مَا قَتَلْنَاهُ, فَقَالَ لِحُوَيِّصَةَ, وَمُحَيِّصَةُ, وَعَبْدِ اَلرَّحْمَنِ بْنَ سَهْلٍ: \"أَتَحْلِفُونَ, وَتَسْتَحِقُّونَ دَمَ صَاحِبَكُمْ?\" قَالُوا: لَا.‏ قَالَ: \"فَتَحْلِفُ لَكُمْ يَهُودُ?\" قَالُوا: لَيْسُوا مُسْلِمِينَ فَوَدَاهُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مِنْ عِنْدِهِ, فَبَعَثَ إِلَيْهِمْ مَائَةَ نَاقَةٍ.‏ قَالَ سَهْلٌ: فَلَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ",
        "urdu": "سیدنا سہل بن ابی حثمہ نے اپنی قوم کے بزرگوں سے روایت کیا ہے کہ عبداللہ بن سہل اور محیصہ بن مسعود خیبر گئے، وہاں عبداللہ بن سہل کو قتل کر کے ایک چشمے میں پھینک دیا گیا۔ محیصہ نے یہودیوں پر الزام لگایا مگر انہوں نے انکار کیا۔ جب یہ معاملہ نبی ﷺ کے پاس پہنچا تو آپ ﷺ نے فرمایا: ”بڑے کو بات کرنے دو“ (یعنی عمر میں بڑے کو ترجیح دی)۔ آپ ﷺ نے یہودیوں کو لکھا کہ یا دیت دیں یا جنگ کے لیے تیار ہوں۔ انہوں نے انکار کیا تو آپ ﷺ نے مدعیوں سے فرمایا: ”کیا تم پچاس قسمیں کھا کر اپنے ساتھی کے خون کے حقدار بنو گے؟“ انہوں نے انکار کیا اور یہودیوں کی قسم پر بھی اعتبار نہ کیا (کیونکہ وہ کافر تھے)۔ چنانچہ رسول اللہ ﷺ نے خود بیت المال سے سو اونٹ دیت ادا کر دی تاکہ فتنہ ختم ہو۔",
        "english": "Narrated Sahl bin Abi Hathma: Abdullah bin Sahl and Muhayyisa bin Mas'ud went to Khaybar. Abdullah was killed and thrown into a spring. Muhayyisa accused the Jews, but they denied it. When they brought the case to the Prophet (ﷺ), he said: \"Let the eldest speak first.\" He then gave the Jews the choice to either pay the blood-money or face war. They denied the killing under oath. The Prophet (ﷺ) then asked the relatives of the deceased: \"Will you take fifty oaths and establish your right to the blood of your companion?\" They refused, and also refused to accept the oaths of the Jews. Consequently, the Prophet (ﷺ) paid the Diyat of 100 camels from the state treasury (Bayt al-Mal) himself."
      }
    },

    {
      "id": 1021,
      "name": {
        "arabic": "وَعَنْ رَجُلٍ مِنْ اَلْأَنْصَارِ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَقَرَّ اَلْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِي اَلْجَاهِلِيَّةِ, وَقَضَى بِهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بَيْنَ نَاسٍ مِنَ اَلْأَنْصَارِ فِي قَتِيلٍ اِدَّعَوْهُ عَلَى اَلْيَهُودِ } رَوَاهُ مُسْلِمٌ. ",
        "urdu": " ایک انصاری صحابی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے زمانہ جاہلیت کی قسامت کو برقرار رکھا اور آپ صلی اللہ علیہ وسلم نے اس کا فیصلہ انصار کے کچھ لوگوں کے درمیان ایک مقتول کے حق میں دیا۔ جس کا دعویٰ یہودیوں پر کیا گیا تھا۔ (مسلم)",
        "english": "Narrated by a man from the Ansar: Allah's Messenger (ﷺ) approved of the system of Al-Qasamah (oath-taking) as it was practiced in the days of Jahiliyyah (pre-Islamic period). And Allah's Messenger (ﷺ) judged by it between some people of the Ansar concerning a slain man for whose death they had accused the Jews."
      }
    }
  ]
}
