{
  "chapId": 64,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 824,
    "to": 854
  },
  "hadiths": [
    {
      "id": 824,
      "name": {
        "arabic": "عَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ لَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { يَا مَعْشَرَ اَلشَّبَابِ ! مَنِ اسْتَطَاعَ مِنْكُمُ اَلْبَاءَةَ فَلْيَتَزَوَّجْ , فَإِنَّهُ أَغَضُّ لِلْبَصَرِ , وَأَحْصَنُ لِلْفَرْجِ , وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ ; فَإِنَّهُ لَهُ وِجَاءٌ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فرمایا ”اے نوجوانوں کی جماعت! تم میں سے جسے نکاح کرنے کی استطاعت ہو اسے نکاح کرنا چاہیئے کیونکہ نکاح نگاہ کو بچانے والا اور شرمگاہ کو محفوظ رکھنے والا ہے، اور جسے اس کی استطاعت نہ ہو، اس کے لیے روزے کا اہتمام و التزام ضروری ہے، اس لیے کہ روزہ اس کے لیے ڈھال ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abdullah ibn Mas'ud: Allah's Messenger (ﷺ) said to us, 'O young men, those among you who can support a wife should marry, for it restrains eyes (from casting evil glances) and preserves one from immorality; but he who cannot afford it should observe fast, for it is a means of controlling the sexual desire.'"
      }
    },

    {
      "id": 825,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-حَمِدَ اَللَّهَ , وَأَثْنَى عَلَيْهِ , وَقَالَ : \" لَكِنِّي أَنَا أُصَلِّي وَأَنَامُ , وَأَصُومُ وَأُفْطِرُ , وَأَتَزَوَّجُ اَلنِّسَاءَ , فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اللہ کی حمد و ثنا بیان کی اور فرمایا: ”لیکن میں نماز بھی ادا کرتا ہوں، سوتا بھی ہوں، روزے رکھتا بھی ہوں اور چھوڑ بھی دیتا ہوں اور میں عورتوں سے نکاح بھی کرتا ہوں۔ لہٰذا جس کسی نے میری سنت سے منہ پھیرا اس کا مجھ سے کوئی تعلق نہیں۔“ (بخاری و مسلم)",
        "english": "Narrated Anas bin Malik (RA): The Prophet (ﷺ) praised Allah and extolled Him, and said: \"But I pray and sleep, I fast and I break my fast, and I marry women. So whoever turns away from my Sunnah is not of me.\""
      }
    },

    {
      "id": 826,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَأْمُرُ بِالْبَاءَةِ , وَيَنْهَى عَنِ التَّبَتُّلِ نَهْيًا شَدِيدًا , وَيَقُولُ :\" تَزَوَّجُوا اَلْوَدُودَ اَلْوَلُودَ .‏ إِنِّي مُكَاثِرٌ بِكُمُ اَلْأَنْبِيَاءَ يَوْمَ اَلْقِيَامَةِ } رَوَاهُ أَحْمَدُ , وَصَحَّحَهُ اِبْنُ حِبَّانَ ",
        "urdu": "سیدنا انس رضی اللہ عنہ ہی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ہمیشہ نکاح کرنے کا حکم ارشاد فرماتے اور تجرد کی زندگی سے سختی سے منع فرماتے اور فرماتے تھے کہ ”بہت محبت کرنے اور چاہنے والی، بہت بچے جننے والی خواتین سے نکاح کرو۔ اس لئے کہ میں تمہاری کثرت کی بدولت قیامت کے روز دوسرے انبیاِء (علیہم السلام) پر فخر کرنے والا ہوں،“ اسے احمد نے روایت کیا ہے اور ابن حبان نے صحیح کہا ہے۔",
        "english": "Narrated Anas bin Malik: The Messenger of Allah (ﷺ) used to order us to marry and severely forbid celibacy (monasticism) saying: 'Marry those who are loving and fertile, for I will be proud of your great numbers before the other Prophets on the Day of Resurrection.'"
      }
    },

    {
      "id": 827,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { تُنْكَحُ اَلْمَرْأَةُ لِأَرْبَعٍ : لِمَالِهَا , وَلِحَسَبِهَا , وَلِجَمَالِهَا , وَلِدِينِهَا , فَاظْفَرْ بِذَاتِ اَلدِّينِ تَرِبَتْ يَدَاكَ } مُتَّفَقٌ عَلَيْهِ مَعَ بَقِيَّةِ اَلسَّبْعَةِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”عورت سے نکاح چار اسباب و وجوہ سے کیا جاتا ہے: اس کے مال کی وجہ سے، اس کے خاندان کی وجہ سے، اس کے حسن و جمال کی وجہ سے اور اس کے دین کی بنا پر۔ پس تو دیندار کو حاصل کر کے کامیاب ہو جا (ورنہ) تیرے دونوں ہاتھ خاک آلود ہوں۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"A woman is married for four reasons: for her wealth, for her lineage, for her beauty, and for her religion. So choose the one who is religious, may your hands be rubbed with dust (i.e., may you prosper).\""
      }
    },

    {
      "id": 828,
      "name": {
        "arabic": "وَعَنْهُ ; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا رَفَّأَ إِنْسَانًا إِذَا تَزَوَّجَ قَالَ : { بَارَكَ اَللَّهُ لَكَ , وَبَارَكَ عَلَيْكَ , وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ , وَصَحَّحَهُ اَلتِّرْمِذِيُّ , وَابْنُ خُزَيْمَةَ , وَابْنُ حِبَّانَ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم جب کسی شخص کو دیکھتے کہ اس نے شادی کی ہے تو (اسے مبارکباد دیتے ہوئے) فرماتے: ”اللہ تعالیٰ تجھے برکت عطا فرمائے اور تجھ پر برکت نازل فرمائے اور تم دونوں کو بھلائی و خیر پر جمع رکھے۔“ اسے احمد اور چاروں نے روایت کیا ہے۔ ترمذی، ابن خزیمہ اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Hurairah: When the Prophet (ﷺ) congratulated a man on his marriage, he said: 'May Allah bless for you, and may He bless on you, and may He unite the both of you in goodness (Barakallahu laka, wa baraka 'alaika, wa jama'a bainakuma fii khair).'"
      }
    },

    {
      "id": 829,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ : { عَلَّمَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلتَّشَهُّدَ فِي اَلْحَاجَةِ : \" إِنَّ اَلْحَمْدَ لِلَّهِ , نَحْمَدُهُ , وَنَسْتَعِينُهُ , وَنَسْتَغْفِرُهُ , وَنَعُوذُ بِاَللَّهِ مِنْ شُرُورِ أَنْفُسِنَا , مَنْ يَهْدِهِ اَللَّهُ فَلَا مُضِلَّ لَهُ , وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ , وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَيَقْرَأُ ثَلَاثَ آيَاتٍ\".‏ } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ , وَحَسَّنَهُ اَلتِّرْمِذِيُّ , وَالْحَاكِمُ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حاجت و ضرورت میں یہ تشہد (خطبہ) سکھایا کہ: ”سب تعریفیں اللہ ہی کے لیے ہیں۔ ہم اس کی حمد کرتے ہیں، اسی سے مدد مانگتے ہیں اور اسی سے بخشش طلب کرتے ہیں۔ ہم اپنے نفسوں کی برائیوں سے اللہ کی پناہ چاہتے ہیں۔ جسے اللہ ہدایت دے اسے کوئی گمراہ کرنے والا نہیں، اور جسے وہ گمراہ کر دے اسے کوئی ہدایت دینے والا نہیں۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور محمد (صلی اللہ علیہ وسلم) اس کے بندے اور رسول ہیں۔“ پھر آپؐ تین آیات تلاوت فرماتے تھے۔ اسے احمد اور چاروں (سنن) نے روایت کیا ہے اور ترمذی و حاکم نے اسے حسن کہا ہے۔",
        "english": "Narrated 'Abdullah bin Mas'ud (RA): Allah's Messenger (ﷺ) taught us the Tashahhud (sermon) for a need (Khutbat-ul-Hajah): \"All praise is due to Allah, we praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils of our souls. Whomever Allah guides, none can misguide, and whomever He misguides, none can guide. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His slave and Messenger.\" He would then recite three verses of the Qur'an."
      }
    },

    {
      "id": 830,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا خَطَبَ أَحَدُكُمُ الْمَرْأَةَ , فَإِنْ اِسْتَطَاعَ أنْ يَنْظُرَ مِنْهَا مَا يَدْعُوهُ إِلَى نِكَاحِهَا , فَلْيَفْعَلْ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَرِجَالُهُ ثِقَاتٌ , وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے جب کوئی کسی عورت کو پیغام نکاح دے، تو اگر اس کے لیے ممکن ہو کہ وہ اس (عورت) کا وہ حصہ دیکھ لے جو اسے نکاح کی طرف مائل کرے، تو اسے ایسا کر لینا چاہیے۔“ اسے احمد اور ابوداؤد نے روایت کیا ہے، اس کے راوی ثقہ ہیں اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Jabir (RA): Allah's Messenger (ﷺ) said: 'When one of you asks a woman in marriage, if he is able to look at what will induce him to marry her, he should do so.'"
      }
    },

    {
      "id": 831,
      "name": {
        "arabic": "وَلِمُسْلِمٍ : عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لِرَجُلٍ تَزَوَّجَ اِمْرَأَةً : أَنَظَرْتَ إِلَيْهَا ? \" قَالَ : لَا .‏ قَالَ : \" اِذْهَبْ فَانْظُرْ إِلَيْهَا }",
        "urdu": "مسلم میں سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک شخص سے، جو کسی عورت سے شادی کرنا چاہتا تھا، دریافت فرمایا: ”کیا تو نے اسے دیکھ لیا ہے؟“ اس نے عرض کیا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ”جاؤ اور اسے دیکھ لو۔“",
        "english": "In Sahih Muslim, narrated by Abu Hurairah (RA): The Prophet (ﷺ) said to a man who intended to marry a woman: \"Have you looked at her?\" He replied: \"No.\" He (ﷺ) said: \"Go and look at her.\""
      }
    },

    {
      "id": 832,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَخْطُبْ بَعْضُكُمْ عَلَى خِطْبَةِ أَخِيهِ , حَتَّى يَتْرُكَ اَلْخَاطِبُ قَبْلَهُ , أَوْ يَأْذَنَ لَهُ اَلْخَاطِبُ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے کوئی اپنے بھائی کے پیغام نکاح پر پیغام نکاح نہ دے تاوقتیکہ کہ پیغام نکاح دینے والا اس سے پہلے اسے از خود چھوڑ دے یا پیغام نکاح دینے والا اجازت دیدے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'A man must not propose to a woman to whom his brother has already proposed, unless the first proposer gives up the idea or allows him to propose.'"
      }
    },

    {
      "id": 833,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ اَلسَّاعِدِيِّ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَتْ : يَا رَسُولَ اَللَّهِ ! جِئْتُ أَهَبُ لَكَ نَفْسِي , فَنَظَرَ إِلَيْهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَصَعَّدَ اَلنَّظَرَ فِيهَا , وَصَوَّبَهُ , ثُمَّ طَأْطَأَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَأْسَهُ ... قَالَ : اِذْهَبْ , فَقَدَ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا سہل بن سعد ساعدی رضی اللہ عنہ سے مروی ہے کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کیا، اے اللہ کے رسول! میں اپنے آپ کو آپ صلی اللہ علیہ وسلم کیلئے ہبہ کرنے آئی ہوں۔ آپ ﷺ نے اسے غور سے دیکھا اور پھر اپنا سر نیچا کر لیا۔ ایک صحابی نے عرض کیا کہ اگر آپ کو ضرورت نہیں تو اس کا نکاح مجھ سے کر دیں۔ آپ ﷺ نے مہر کی تلاش کا حکم دیا، جب کچھ نہ ملا تو فرمایا: ”جا میں نے اس کا نکاح تجھ سے اس قرآن کے عوض کر دیا جو تجھے یاد ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Sahl bin Sa'd al-Sa'idi (RA): A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger! I have come to give myself to you (in marriage).\" He looked at her closely and then lowered his head. A man said, \"If you do not want her, marry her to me.\" The Prophet (ﷺ) asked for a dower, and when nothing was found, he said: \"I have married her to you for the portion of the Qur'an you know.\""
      }
    },

    {
      "id": 834,
      "name": {
        "arabic": "وَعَنْ عَامِرِ بْنِ عَبْدِ اَللَّهِ بْنِ اَلزُّبَيْرِ , عَنْ أَبِيهِ ; أَنَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- قَالَ : { أَعْلِنُوا اَلنِّكاَحَ } رَوَاهُ أَحْمَدُ , وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا عامر بن عبداللہ بن زبیر رحمہ اللہ سے روایت ہے، انہوں نے اپنے والد (عبداللہ بن زبیر رضی اللہ عنہ) سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نکاح کا اعلان کرو۔“ اسے احمد نے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے۔",
        "english": "Narrated 'Amir bin 'Abdullah bin az-Zubair, from his father (RA) that Allah's Messenger (ﷺ) said: 'Publicize the marriage.'"
      }
    },

    {
      "id": 835,
      "name": {
        "arabic": "وَعَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى , عَنْ أَبِيهِ قَالَ : قَالَ رَسُولُ اَللَّه - صلى الله عليه وسلم - { لَا نِكَاحَ إِلَّا بِوَلِيٍّ } رَوَاهُ أَحْمَدُ وَالْأَرْبَعَةُ وَصَحَّحَهُ اِبْنُ اَلْمَدِينِيِّ , وَاَلتِّرْمِذِيُّ , وَابْنُ حِبَّانَ , وَأُعِلَّ بِالْإِرْسَالِ",
        "urdu": "سیدنا ابوبردہ بن ابی موسیٰ نے اپنے والد (ابوموسیٰ اشعری رضی اللہ عنہ) سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ولی کے بغیر نکاح (منعقد) نہیں ہوتا۔“ اسے احمد اور چاروں (سنن) نے روایت کیا ہے (سوائے نسائی کے)۔ امام ابن مدینی، ترمذی اور ابن حبان نے اسے صحیح قرار دیا ہے، اگرچہ بعض نے اسے مرسل ہونے کی وجہ سے معلول کہا ہے۔",
        "english": "Narrated Abu Burdah bin Abi Musa, on the authority of his father (RA): Allah's Messenger (ﷺ) said: \"There is no marriage except with a guardian (Wali).\" Reported by Ahmad and the Four (Sunan) except An-Nasa'i. It was graded Sahih by Ibn al-Madini, At-Tirmidhi, and Ibn Hibban, though some pointed out a defect due to its being Mursal."
      }
    },

    {
      "id": 836,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَيُّمَا اِمْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ وَلِيِّهَا, فَنِكَاحُهَا بَاطِلٌ, فَإِنْ دَخَلَ بِهَا فَلَهَا اَلْمَهْرُ بِمَا اِسْتَحَلَّ مِنْ فَرْجِهَا, فَإِنِ اشْتَجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ } أَخْرَجَهُ اَلْأَرْبَعَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ أَبُو عَوَانَةَ , وَابْنُ حِبَّانَ وَالْحَاكِمُ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی خاتون نے اپنے ولی کی اجازت کے بغیر نکاح کیا، اس کا نکاح باطل ہے۔ پھر اگر شوہر نے اس سے دخول (مباشرت) کیا ہے تو اس عورت کیلئے حق مہر ہے، اس کی شرمگاہ کو حلال کرنے کے بدلہ میں۔ پھر اگر اولیاء میں جھگڑا ہو جائے تو پھر جس کا کوئی ولی نہیں اس کا ولی حاکم وقت ہے۔“ نسائی کے علاوہ اسے چاروں نے روایت کیا ہے، ابوعوانہ، ابن حبان اور حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated 'Aisha (RA): Allah's Messenger (ﷺ) said: 'If any woman marries without the consent of her guardian, her marriage is void (batil). If there is cohabitation, she is entitled to the Mahr (dower) because of the sexual intercourse allowed. If they (the guardians) dispute, then the ruler (Sultan) is the guardian of the one who has no guardian.'"
      }
    },

    {
      "id": 837,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَا تُنْكَحُ اَلْأَيِّمُ حَتَّى تُسْتَأْمَرَ, وَلَا تُنْكَحُ اَلْبِكْرُ حَتَّى تُسْـتَأْذَنَ \" قَالُوا : يَا رَسُولَ اَللَّهِ , وَكَيْفَ إِذْنُهَا ? قَالَ : \" أَنْ تَسْكُتَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیوہ (یا طلاق یافتہ) عورت کا نکاح اس سے مشورہ لیے بغیر نہ کیا جائے اور کنواری کا نکاح اس سے اجازت لیے بغیر نہ کیا جائے۔“ صحابہ نے عرض کیا: یا رسول اللہ! کنواری کی اجازت (کا پتہ) کیسے چلے گا؟ آپ ﷺ نے فرمایا: ”اس کا خاموش رہنا (ہی اس کی اجازت ہے)۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"A matron (widow or divorcee) should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought.\" They asked, \"O Allah's Messenger, how is her permission (expressed)?\" He said, \"By her silence.\""
      }
    },

    {
      "id": 838,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ { اَلثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا , وَالْبِكْرُ تُسْتَأْمَرُ , وَإِذْنُهَا سُكُوتُهَا } رَوَاهُ مُسْلِمٌ وَفِي لَفْظٍ : { لَيْسَ لِلْوَلِيِّ مَعَ اَلثَّيِّبِ أَمْرٌ, وَالْيَتِيمَةُ تُسْتَأْمَرُ } رَوَاهُ أَبُو دَاوُدَ , وَالنَّسَائِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”شوہر دیدہ عورت اپنے دوبارہ نکاح کے بارے میں اپنے ولی کی بہ نسبت خود زیادہ استحقاق رکھتی ہے اور کنواری سے اجازت لی جائے گی اور اس کا اذن اس کی خاموشی ہے۔“ (مسلم) اور ایک روایت میں ہے کہ شوہر دیدہ عورت کے بارے میں ولی کا کوئی اختیار نہیں اور یتیم بچیوں سے بھی مشورہ لیا جائے۔ اسے ابوداؤد اور نسائی نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) said: 'A non-virgin woman (as-Sayyib) has more right to her person than her guardian, and a virgin’s consent must be asked from her, and her silence implies her consent.' [Reported by Muslim]. Another version says: 'A guardian has no concern with a non-virgin woman, and an orphan girl’s consent must be sought.' [Reported by Abu Dawud and An-Nasa'i; Sahih by Ibn Hibban]."
      }
    },

    {
      "id": 839,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تُزَوِّجُ اَلْمَرْأَةُ اَلْمَرْأَةَ, وَلَا تُزَوِّجُ اَلْمَرْأَةُ نَفْسَهَا } رَوَاهُ اِبْنُ مَاجَهْ , وَاَلدَّارَقُطْنِيُّ , وَرِجَالُهُ ثِقَاتٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نہ کوئی عورت دوسری عورت کا (ولی بن کر) نکاح کرے اور نہ کوئی عورت خود اپنا نکاح کرے۔“ اسے ابن ماجہ اور دارقطنی نے روایت کیا ہے، اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"A woman may not give another woman in marriage, nor may a woman give herself in marriage.\" Reported by Ibn Majah and Ad-Daraqutni, and its narrators are reliable."
      }
    },

    {
      "id": 840,
      "name": {
        "arabic": "وَعَنْ نَافِعٍ , عَنْ اِبْنِ عُمَرَ قَالَ : { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ الشِّغَارِ ; وَالشِّغَارُ: أَنْ يُزَوِّجَ اَلرَّجُلُ اِبْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ اَلْآخَرُ اِبْنَتَهُ , وَلَيْسَ بَيْنَهُمَا صَدَاقٌ } مُتَّفَقٌ عَلَيْهِ وَاتَّفَقَا مِنْ وَجْهٍ آخَرَ عَلَى أَنَّ تَفْسِيرَ اَلشِّغَارِ مِنْ كَلَامِ نَافِعٍ",
        "urdu": "سیدنا نافع نے ابن عمر رضی اللہ عنہما سے روایت کی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے شغار سے منع فرمایا ہے اور شغار کی تعریف یہ ہے کہ ایک آدمی اپنی بیٹی دوسرے آدمی سے اس شرط پر بیاہ دے کہ وہ اپنی بیٹی اس سے بیاہ دے گا اور دونوں کا کوئی مہر مقرر نہ ہو۔“ (بخاری و مسلم) اور بخاری اور مسلم اس پر متفق ہیں کہ شغار کی یہ تعریف نافع کی بیان کردہ ہے۔",
        "english": "Narrated Nafi' from Ibn 'Umar (RA): Allah's Messenger (ﷺ) forbade ash-Shighar, which is for a man to give his daughter in marriage to another man on the condition that the other gives him his daughter in marriage, and there is no dower (Mahr) between them. [Agreed upon]. Both (Bukhari and Muslim) also agreed through another chain that the definition of Shighar was from the words of Nafi'."
      }
    },

    {
      "id": 841,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- { أَنَّ جَارِيَةً بِكْرًا أَتَتِ النَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَذَكَرَتْ: أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ , فَخَيَّرَهَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-} رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَابْنُ مَاجَهْ , وَأُعِلَّ بِالْإِرْسَالِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ ایک کنواری لڑکی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اس نے بتایا کہ اس کے والد نے اس کا نکاح کر دیا ہے جب کہ اسے وہ ناپسند تھا، (یہ سن کر) نبی کریم صلی اللہ علیہ وسلم نے اس لڑکی کو اختیار دے دیا (کہ چاہے تو نکاح برقرار رکھے یا ختم کر دے)۔",
        "english": "Narrated Ibn 'Abbas (RA): A virgin girl came to the Prophet (ﷺ) and mentioned that her father had married her off against her will, so the Prophet (ﷺ) gave her the choice (to either stay in the marriage or annul it)."
      }
    },

    {
      "id": 842,
      "name": {
        "arabic": "وَعَنْ اَلْحَسَنِ , عَنْ سَمُرَةَ , عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- قَالَ : { أَيُّمَا اِمْرَأَةٍ زَوَّجَهَا وَلِيَّانِ , فَهِيَ لِلْأَوَّلِ مِنْهُمَا } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ , وَحَسَّنَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا حسن (بصری) رحمہ اللہ، سیدنا سمرہ رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کا ارشاد بیان کرتے ہیں کہ ”جس عورت کا نکاح دو ولی (مختلف جگہوں پر) کر دیں تو یہ خاتون پہلے خاوند کی ہے۔“ اسے احمد اور چاروں نے روایت کیا ہے اور ترمذی نے حسن قرار دیا ہے۔",
        "english": "Narrated Al-Hasan, on the authority of Samurah (RA) that the Prophet (ﷺ) said: 'If any woman is given in marriage by two guardians (to two different men), she belongs to the first of the two.'"
      }
    },

    {
      "id": 843,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ أَوْ أَهْلِهِ , فَهُوَ عَاهِرٌ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ , وَكَذَلِكَ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس غلام نے اپنے مالکوں اور اپنے اہل (سرپرستوں) کی اجازت کے بغیر نکاح کیا وہ زانی (گناہ گار) ہے۔“ اسے احمد، ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی و ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Jabir (RA): Allah's Messenger (ﷺ) said: \"Any slave who marries without the permission of his masters is a fornicator (committing a sinful act).\" Reported by Ahmad, Abu Dawud, and At-Tirmidhi, who graded it Sahih, as did Ibn Hibban."
      }
    },

    {
      "id": 844,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ : { لَا يُجْمَعُ بَيْنَ اَلْمَرْأَةِ وَعَمَّتِهَا , وَلَا بَيْنَ اَلْمَرْأَةِ وَخَالَتِهَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”(ایک مرد کے نکاح میں) پھوپھی اور بھتیجی کو جمع نہ کیا جائے، اور نہ ہی خالہ اور بھانجی کو جمع کیا جائے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: 'One should not be married to a woman and her paternal aunt at the same time, nor to a woman and her maternal aunt.'"
      }
    },

    {
      "id": 845,
      "name": {
        "arabic": "وَعَنْ عُثْمَانَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَنْكِحُ اَلْمُحْرِمُ , وَلَا يُنْكَحُ } رَوَاهُ مُسْلِمٌ .‏ وَفِي رِوَايَةٍ لَهُ : { وَلَا يَخْطُبُ } وَزَادَ اِبْنُ حِبَّانَ : { وَلَا يُخْطَبُ عَلَيْهِ }",
        "urdu": "سیدنا عثمان رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”حالتِ احرام میں کوئی شخص نہ اپنا نکاح کرے اور نہ کسی دوسرے کا نکاح کرائے۔“ (مسلم) اور مسلم کی ایک اور روایت میں ہے: ”اور نہ ہی نکاح کا پیغام (رشتہ) بھیجے۔“ ابن حبان نے یہ اضافہ بھی کیا ہے: ”اور نہ ہی اس کی طرف سے نکاح کا پیغام بھیجا جائے۔“",
        "english": "Narrated 'Uthman (RA): Allah's Messenger (ﷺ) said: \"A Muhrim (one in a state of Ihram) should not marry, nor should he give anyone in marriage.\" Reported by Muslim. Another version has: \"And he should not propose marriage.\" Ibn Hibban added: \"And no proposal should be made to him.\""
      }
    },

    {
      "id": 846,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { تَزَوَّجَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-مَيْمُونَةَ وَهُوَ مُحْرِمٌ } مُتَّفَقٌ عَلَيْهِ وَلِمُسْلِمٍ : عَنْ مَيْمُونَةَ نَفْسِهَا { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-تَزَوَّجَهَا وَهُوَ حَلَالٌ }",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے جب سیدہ میمونہ رضی اللہ عنہا سے نکاح کیا تو اس وقت آپ صلی اللہ علیہ وسلم حالت احرام میں تھے۔ (بخاری و مسلم) اور مسلم میں سیدہ میمونہ رضی اللہ عنہا کا اپنا بیان ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا تو اس وقت آپ صلی اللہ علیہ وسلم حلال (احرام میں نہیں) تھے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) married Maimuna while he was in the state of Ihram. [Agreed upon]. In a narration by Muslim, Maimuna (RA) herself stated: 'The Prophet (ﷺ) married me while he was not in the state of Ihram (Halal).'"
      }
    },

    {
      "id": 847,
      "name": {
        "arabic": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ أَحَقَّ اَلشُّرُوطِ أَنْ يُوَفَّى بِهِ , مَا اِسْتَحْلَلْتُمْ بِهِ اَلْفُرُوجَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”وہ شرط پورا کیے جانے کی سب سے زیادہ مستحق ہے جس کے ذریعے تم نے عورتوں کی شرمگاہوں کو حلال کیا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated 'Uqbah bin 'Amir (RA): Allah's Messenger (ﷺ) said: \"The conditions which are most worthy to be fulfilled are those by which you made the private parts (of your wives) lawful (i.e., the conditions of marriage).\""
      }
    },

    {
      "id": 848,
      "name": {
        "arabic": "وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ ‏- رضى الله عنه ‏- قَالَ : { رَخَّصَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَامَ أَوْطَاسٍ فِي اَلْمُتْعَةِ , ثَلَاثَةَ أَيَّامٍ , ثُمَّ نَهَى عَنْهَا } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا سلمہ بن اکوع رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے غزوہ اوطاس (فتح مکہ کے سال) کے موقع پر تین روز کے لئے نکاح متعہ کی اجازت دی۔ پھر اسے (ہمیشہ کے لیے) منع فرما دیا۔ (مسلم)",
        "english": "Narrated Salama bin al-Akwa' (RA): Allah's Messenger (ﷺ) permitted Mut'ah (temporary marriage) for three days in the year of Autas (the year of the Conquest of Makkah), and then he forbade it."
      }
    },

    {
      "id": 849,
      "name": {
        "arabic": "وَعَنْ عَلَيٍّ ‏- رضى الله عنه ‏- قَالَ : { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلْمُتْعَةِ عَامَ خَيْبَرَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے سال 'متعہ' (عارضی نکاح) سے منع فرما دیا تھا۔ (بخاری و مسلم)",
        "english": "Narrated 'Ali (RA): Allah's Messenger (ﷺ) forbade Mut'ah (temporary marriage) on the day of Khaibar."
      }
    },

    {
      "id": 850,
      "name": {
        "arabic": "وَعَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: { لَا نِكَاحَ إِلَّا بِوَلِيٍّ } رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ، وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ولی کے بغیر نکاح (صحیح) نہیں ہوتا۔“ اسے احمد اور ابوداؤد نے روایت کیا ہے، اور ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: 'There is no marriage (valid) without a guardian (Wali).'"
      }
    },

    {
      "id": 851,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: { لَا جِلَالَ فِي الْإِسْلَامِ، وَلَا شِغَارَ فِي الْإِسْلَامِ } رَوَاهُ أَحْمَدُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اسلام میں جلال (لوٹ مار) کی کوئی گنجائش نہیں اور اسلام میں نکاحِ شغار کی کوئی حیثیت نہیں۔“ (اسے احمد نے روایت کیا ہے)",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: \"There is no looting (Jilal) in Islam, and there is no Shighar (exchange marriage) in Islam.\""
      }
    },

    {
      "id": 852,
      "name": {
        "arabic": "وَعَنِ ابْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ : { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ } رَوَاهُ أَحْمَدُ , وَالنَّسَائِيُّ , وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ وَفِي اَلْبَابِ : عَنْ عَلِيٍّ أَخْرَجَهُ اَلْأَرْبَعَةُ إِلَّا النَّسَائِيَّ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حلالہ کرنے والے اور جس کے لیے حلالہ کیا جائے دونوں پر لعنت فرمائی ہے۔ اسے احمد، نسائی اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے صحیح کہا ہے اور پھر اس باب میں سیدنا علی رضی اللہ عنہ سے بھی روایت ہے جسے نسائی کے علاوہ چاروں نے روایت کیا ہے۔",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) cursed the one who makes a woman lawful for her first husband (al-Muhallil) and the one for whom she is made lawful (al-Muhallil lahu). [Reported by Ahmad, An-Nasa'i, and At-Tirmidhi, who graded it Sahih]. A similar narration from 'Ali (RA) is reported by the four (authors of Sunan) except An-Nasa'i."
      }
    },

    {
      "id": 853,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَنْكِحُ اَلزَّانِي اَلْمَجْلُودُ إِلَّا مِثْلَهُ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَرِجَالُهُ ثِقَاتٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”زانی جس پر (حدِ زنا کے) کوڑے برس چکے ہوں، وہ اپنے جیسی (حد یافتہ) عورت کے سوا کسی دوسری سے نکاح نہ کرے۔“ اسے احمد اور ابوداؤد نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"A person who has been lashed for committing adultery should not marry except one like himself.\""
      }
    },

    {
      "id": 854,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا , قَالَتْ : { طَلَّقَ رَجُلٌ اِمْرَأَتَهُ ثَلَاثًا , فَتَزَوَّجَهَا رَجُلٌ , ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا , فَأَرَادَ زَوْجُهَا أَنْ يَتَزَوَّجَهَا , فَسُئِلَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ ذَلِكَ , فَقَالَ : \"لَا .‏ حَتَّى يَذُوقَ اَلْآخَرُ مِنْ عُسَيْلَتِهَا مَا ذَاقَ اَلْأَوَّلُ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ ایک مرد نے اپنی بیوی کو تین طلاقیں دے دیں۔ پھر اس عورت سے ایک دوسرے آدمی نے نکاح کر لیا اور اس سے ہمبستری کئے بغیر ہی اسے طلاق بھی دے دی۔ تو پہلے شوہر نے اس سے نکاح کرنا چاہا۔ اور رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق استفسار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں! جب تک دوسرا خاوند اس سے اسی طرح لطف اندوز نہ ہو لے جس طرح پہلا خاوند ہوا تھا۔“ (بخاری و مسلم) اور یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated 'Aisha (RA): A man divorced his wife three times (irrevocably). Then she married another man who also divorced her before having sexual intercourse with her. The first husband then wanted to remarry her. When Allah's Messenger (ﷺ) was asked about this, he said: \"No, not until the second husband tastes her sweetness as the first one did.\""
      }
    }
  ]
}