{
  "chapId": 107,
  "bookId": 16,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1332,
    "to": 1359
  },
  "hadiths": [
    {
      "id": 1332,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَقُولُ اَللَّهُ ‏-تَعَالَى‏-: أَنَا مَعَ عَبْدِي مَا ذَكَرَنِي, وَتَحَرَّكَتْ بِي شَفَتَاهُ } أَخْرَجَهُ ابْنُ مَاجَهْ, وَصَحَّحَهُ ابْنُ حِبَّانَ, وَذَكَرَهُ اَلْبُخَارِيُّ تَعْلِيقًا",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ فرماتا ہے: میں اپنے بندے کے ساتھ ہوتا ہوں جب تک وہ مجھے یاد کرتا ہے اور میرے (ذکر کے) لیے اس کے ہونٹ ہلتے رہتے ہیں۔“ (ابن ماجہ، ابن حبان، بخاری)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"Allah the Exalted says, 'I am with My slave as long as he remembers Me and his lips move (mentioning) Me.'\""
      }
    },

    {
      "id": 1333,
      "name": {
        "arabic": "وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا عَمِلَ ابْنُ آدَمَ عَمَلاً أَنْجَى لَهُ مِنْ عَذَابِ اَللَّهِ مِنْ ذِكْرِ اَللَّهِ } أَخْرَجَهُ ابْنُ أَبِي شَيْبَةَ, وَالطَّبَرَانِيُّ بِإِسْنَادٍ حَسَنٍ .",
        "urdu": "سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ابن آدم کا کوئی عمل اللہ کے ذکر سے بڑھ کر اسے اللہ کے عذاب سے نجات دینے والا نہیں۔“ اسے ابن ابی شیبہ اور طبرانی نے حسن سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Mu'adh bin Jabal (RAA): The Messenger of Allah (ﷺ) said: 'No deed performed by the son of Adam is more effective in saving him from Allah's punishment than the remembrance of Allah (Dhikr).' [Reported by Ibn Abi Shaibah and at-Tabarani with a Hasan chain]."
      }
    },

    {
      "id": 1334,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا جَلَسَ قَوْمٌ مَجْلِسًا, يَذْكُرُونَ اَللَّهَ إِلَّا حَفَّتْ بِهِمُ الْمَلَائِكَةُ, وَغَشِيَتْهُمُ الرَّحْمَةُ, وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ } أَخْرَجَهُ مُسْلِم",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب بھی کچھ لوگ کسی مجلس میں بیٹھ کر اللہ کا ذکر کرتے ہیں تو فرشتے انہیں گھیر لیتے ہیں، اللہ کی رحمت انہیں ڈھانپ لیتی ہے، ان پر سکینت نازل ہوتی ہے اور اللہ تعالیٰ اپنی مقرب مخلوق (فرشتوں) میں ان کا تذکرہ فرماتا ہے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Whenever a group of people sit in a gathering remembering Allah, the angels surround them, mercy covers them, and Allah mentions them to those who are with Him.'"
      }
    },

    {
      "id": 1335,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا قَعَدَ قَوْمٌ مَقْعَدًا لَمْ يَذْكُرُوا اَللَّهَ, وَلَمْ يُصَلُّوا عَلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-إِلَّا كَانَ عَلَيْهِمْ حَسْرَةً يَوْمَ اَلْقِيَامَةِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَقَالَ: \"حَسَنٌ\" .‏ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ ہی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” کوئی قوم کسی ایسی مجلس میں نہیں بیٹھتی جس میں انہوں نے نہ اللہ کا ذکر کیا ہو اور نہ نبی پر درود بھیجا ہو، مگر وہ مجلس ان کے لیے قیامت کے روز باعث حسرت و ندامت ہو گی۔ “ (ترمذی)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'No people sit in a gathering in which they do not remember Allah or send blessings upon the Prophet (ﷺ) except that it will be a source of regret for them on the Day of Resurrection.' [Reported by at-Tirmidhi, who graded it Hasan]."
      }
    },

    {
      "id": 1336,
      "name": {
        "arabic": "وَعَنْ أَبِي أَيُّوبَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَالَ: لَا إِلَهَ إِلَّا اَللَّهَ, وَحْدَهُ لَا شَرِيكَ لَهُ, لَهُ اَلْمُلْكُ, وَلَهُ اَلْحَمْدُ, وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مَرَّاتٍ, كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ } مُتَّفَقٌ عَلَيْهِ .",
        "urdu": "سیدنا ابوایوب انصاری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے دس مرتبہ یہ کلمات کہے: «لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ» (اللہ کے سوا کوئی معبود برحق نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں، اور وہ ہر چیز پر قادر ہے)، تو وہ اس شخص کی طرح ہے جس نے اولادِ اسماعیل علیہ السلام سے چار غلام آزاد کیے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Ayyub (RA): Allah's Messenger (ﷺ) said: 'Whoever says ten times: \"There is no god but Allah, alone, without any partner. To Him belongs the Kingdom and to Him belongs the Praise, and He is over all things Powerful,\" shall be like one who has manumitted four slaves from the descendants of Isma'il.'"
      }
    },

    {
      "id": 1337,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَالَ: سُبْحَانَ اَللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ, وَإِنْ كَانَتْ مِثْلَ زَبَدِ اَلْبَحْرِ } مُتَّفَقٌ عَلَيْهِ .‏ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس کسی نے سو مرتبہ یہ کہا «سبحان الله وبحمده» (پاک ہے اللہ اپنی تعریفوں کے ساتھ)۔ اس کی خطائیں مٹا دی جاتی ہیں۔ خواہ وہ سمندر کی جھاگ کے برابر ہی کیوں نہ ہوں۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'Whoever says, \"Subhan Allah wa bihamdihi\" (Glory and praise be to Allah) one hundred times a day, his sins will be wiped away, even if they are like the foam of the sea.' [Agreed upon]."
      }
    },

    {
      "id": 1338,
      "name": {
        "arabic": " وَعَنْ جُوَيْرِيَةَ بِنْتِ اَلْحَارِثِ قَالَتْ: قَالَ لِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ, لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ اَلْيَوْمِ لَوَزَنَتْهُنَّ: سُبْحَانَ اَللَّهِ وَبِحَمْدِهِ, عَدَدَ خَلْقِهِ, وَرِضَا نَفْسِهِ, وَزِنَةَ عَرْشِهِ, وَمِدَادَ كَلِمَاتِهِ } أَخْرَجَهُ مُسْلِمٌ .‏ ",
        "urdu": "سیدہ جویریہ بنت حارث رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ”میں نے تمہارے پاس سے جانے کے بعد چار ایسے کلمات کہے ہیں کہ اگر ان کا وزن ان کلمات کے ساتھ کیا جائے جو تم نے صبح سے اب تک کہے ہیں تو ان چار کلمات کا وزن زیادہ ہو جائے گا۔ وہ کلمات یہ ہیں: «سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ» (اللہ اپنی حمد کے ساتھ پاک ہے، اپنی مخلوق کی تعداد کے برابر، اپنی ذات کی رضا کے مطابق، اپنے عرش کے وزن کے برابر اور اپنے کلمات کی سیاہی کے برابر)۔“ (مسلم)",
        "english": "Narrated Juwayriyah bint al-Harith (RA): Allah's Messenger (ﷺ) said to me: \"I have said four words after leaving you; if they were weighed against what you have been saying since the morning, they would outweigh them. They are: 'Glory be to Allah and praise is due to Him, as much as the number of His creation, as much as His pleasure, as much as the weight of His Throne, and as much as the ink of His words.'\""
      }
    },

    {
      "id": 1339,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْبَاقِيَاتُ اَلصَّالِحَاتُ: لَا إِلَهَ إِلَّا اَللَّهُ, وَسُبْحَانَ اَللَّهِ, وَاَللَّهُ أَكْبَرُ, وَالْحَمْدُ لِلَّهِ, وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاَللَّهِ } أَخْرَجَهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ .‏",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” باقیات صالحات (ہمیشہ باقی رہنے والی نیکیاں) یہ الفاظ ہیں: «لا إله إلا الله»، «سبحان الله»، «الله أكبر»، «الحمد لله» اور «لا حول ولا قوة إلا بالله»۔“ اسے نسائی نے نکالا ہے اور ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Sa'id al-Khudri (RAA): The Messenger of Allah (ﷺ) said: 'The everlasting good deeds (Al-Baqiyat as-Salihat) are: \"La ilaha illallahu\" (There is no god but Allah), \"Subhan Allah\" (Glory be to Allah), \"Allahu Akbar\" (Allah is Most Great), \"Al-Hamdu lillah\" (Praise be to Allah), and \"La hawla wa la quwwata illa billah\" (There is no might and no power except with Allah).' [Reported by an-Nasa'i, and authenticated by Ibn Hibban and al-Hakim]."
      }
    },

    {
      "id": 1340,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَحَبُّ اَلْكَلَامِ إِلَى اَللَّهِ أَرْبَعٌ, لَا يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ: سُبْحَانَ اَللَّهِ, وَالْحَمْدُ لِلَّهِ, وَلَا إِلَهَ إِلَّا اَللَّهُ, وَاَللَّهُ أَكْبَرُ } أَخْرَجَهُ مُسْلِمٌ .‏",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”اللہ کے نزدیک سب سے محبوب کلام چار کلمات ہیں۔ تم ان میں سے جس سے بھی چاہو آغاز کرو، اس میں تمہارا کوئی نقصان نہیں (یعنی ترتیب ضروری نہیں): سُبْحَانَ اللهِ (اللہ پاک ہے)، وَالْحَمْدُ لِلّٰهِ (تمام تعریفیں اللہ ہی کے لیے ہیں)، وَلَا إِلٰهَ إِلَّا اللهُ (اللہ کے سوا کوئی معبود نہیں)، وَاللهُ أَكْبَرُ (اللہ سب سے بڑا ہے)۔“ (مسلم)",
        "english": "Narrated Samurah bin Jundub (RA): Allah's Messenger (ﷺ) said: 'The most beloved words to Allah are four, and it does not matter which one you start with: Subhan Allah (Glory be to Allah), al-Hamdu lillah (Praise be to Allah), La ilaha illallah (There is no god but Allah), and Allahu Akbar (Allah is the Most Great).'"
      }
    },

    {
      "id": 1341,
      "name": {
        "arabic": "وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ لِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَا عَبْدَ اَللَّهِ بْنَ قَيْسٍ! أَلَّا أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ اَلْجَنَّةِ? لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاَللَّهِ } مُتَّفَقٌ عَلَيْه زَادَ النَّسَائِيُّ: { وَلَا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ }",
        "urdu": "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ”اے عبداللہ بن قیس! کیا میں تمہیں جنت کے خزانوں میں سے ایک خزانہ نہ بتاؤں؟ (وہ یہ ہے:) «لا حول ولا قوة إلا بالله» (اللہ کی مدد کے بغیر نہ گناہ سے بچنے کی طاقت ہے اور نہ نیکی کرنے کی ہمت)۔“ (بخاری و مسلم) اور نسائی کی روایت میں یہ اضافہ ہے: ”اور اللہ سے بھاگ کر کہیں پناہ نہیں مگر اسی کی طرف۔“",
        "english": "Narrated Abu Musa al-Ash'ari (RAA): The Messenger of Allah (ﷺ) said to me: 'O 'Abudullah bin Qais! Shall I not guide you to one of the treasures of Paradise? It is: \"La hawla wa la quwwata illa billah\" (There is no might and no power except with Allah).' [Agreed upon]. An-Nasa'i added: 'And there is no refuge from Allah except with Him.'"
      }
    },

    {
      "id": 1342,
      "name": {
        "arabic": " وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ اَلدُّعَاءَ هُوَ اَلْعِبَادَةُ } رَوَاهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ . وَلَهُ مِنْ حَدِيثِ أَنَسٍ بِلَفْظِ: { اَلدُّعَاءُ مُخُّ اَلْعِبَادَةِ } وَلَهُ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ رَفَعَهُ: { لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اَللَّهِ مِنَ الدُّعَاءِ } وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ .‏ ",
        "urdu": "سیدنا نعمان بن بشیر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا: ”بلاشبہ دعا ہی (اصل) عبادت ہے۔“ اسے چاروں (اصحابِ سنن) نے روایت کیا ہے اور ترمذی نے اسے صحیح کہا ہے۔ اور ترمذی ہی میں سیدنا انس رضی اللہ عنہ کی روایت میں «الدعاء مخ العبادة» (دعا عبادت کا مغز ہے) کے الفاظ ہیں۔ اور ترمذی ہی میں سیدنا ابوہریرہ رضی اللہ عنہ سے مرفوعاً مروی ہے کہ: ”اللہ کے نزدیک دعا سے زیادہ کوئی چیز معزز و مکرم نہیں۔“ اسے ابن حبان اور حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated An-Nu'man bin Bashir (RA): The Prophet (ﷺ) said: 'Verily, supplication (Dua) is worship itself.' Reported by the four (Sunan compilers) and At-Tirmidhi graded it Sahih. At-Tirmidhi also reported from Anas (RA) with the wording: 'Dua is the essence of worship.' And he reported from Abu Hurairah (RA) in a Marfu' Hadith: 'Nothing is more honorable to Allah than supplication.' Ibn Hibban and Al-Hakim graded it Sahih."
      }
    },

    {
      "id": 1343,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلدُّعَاءُ بَيْنَ اَلْأَذَانِ وَالْإِقَامَةِ لَا يُرَدُّ } أَخْرَجَهُ النَّسَائِيُّ, وَغَيْرُهُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَغَيْرُهُ .",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اذان اور اقامت کے درمیان دعا رد نہیں کی جاتی۔“ اس کو نسائی وغیرہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Anas (RAA): The Messenger of Allah (ﷺ) said: 'The supplication (Du'a) made between the Adhan and the Iqamah is not rejected.' [Reported by an-Nasa'i and others, and Ibn Hibban and others graded it Sahih]."
      }
    },

    {
      "id": 1344,
      "name": {
        "arabic": "وَعَنْ سَلْمَانَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ رَبَّكُمْ حَيِيٌّ كَرِيمٌ, يَسْتَحِي مِنْ عَبْدِهِ إِذَا رَفَعَ إِلَيْهِ يَدَيْهِ أَنْ يَرُدَّهُمَا صِفَرًا } أَخْرَجَهُ اَلْأَرْبَعَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏",
        "urdu": "سیدنا سلمان فارسی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بے شک تمہارا رب بہت حیا والا اور سخی ہے، وہ اپنے بندے سے حیا فرماتا ہے جب وہ اس کے سامنے اپنے ہاتھ (دعا کے لیے) اٹھاتا ہے کہ وہ ان دونوں کو خالی (ناکام) لوٹا دے۔“ (ابوداؤد، ترمذی، ابن ماجہ)",
        "english": "Narrated Salman (RA): Allah's Messenger (ﷺ) said: 'Verily, your Lord is Generous and Shy. If His servant raises his hands to Him (in supplication), He is shy to return them empty.'"
      }
    },

    {
      "id": 1345,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا مَدَّ يَدَيْهِ فِي اَلدُّعَاءِ, لَمْ يَرُدَّهُمَا, حَتَّى يَمْسَحَ بِهِمَا وَجْهَهُ } أَخْرَجَهُ اَلتِّرْمِذِيُّ .‏وَلَهُ شَوَاهِدُ مِنْهَا: حَدِيثُ اِبْنِ اِبْنِ عَبَّاسٍ: عِنْدَ أَبِي دَاوُدَ .‏ وَمَجْمُوعُهَا يَقْتَضِي أَنَّهُ حَدِيثٌ حَسَنٌ",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب دعا کے لئے ہاتھ اٹھایا کرتے تو ان کو اس وقت تک واپس نہ لوٹاتے جب تک چہرے پر پھیر نہ لیتے۔ اسے ترمذی نے نکالا ہے اور اس کے کئی شواہد ہیں، ان میں ایک ابوداؤد کے ہاں ابن عباس رضی اللہ عنہما کی حدیث ہے اور ان کا مجموعہ تقاضا کرتا ہے کہ یہ حدیث حسن ہے۔",
        "english": "Narrated Umar (RAA): 'When the Messenger of Allah (ﷺ) raised his hands in supplication, he did not lower them until he wiped his face with them.' [Reported by at-Tirmidhi. It has supporting narrations, including one from Ibn 'Abbas reported by Abu Dawud. Taken together, they make this a Hasan Hadith]."
      }
    },

    {
      "id": 1346,
      "name": {
        "arabic": "وَعَنِ ابْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ أَوْلَى اَلنَّاسِ بِي يَوْمَ اَلْقِيَامَةِ, أَكْثَرُهُمْ عَلَيَّ صَلَاةً } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن لوگوں میں سے میرے سب سے زیادہ قریب وہ شخص ہو گا جو مجھ پر سب سے زیادہ درود بھیجنے والا ہو گا۔“ (ترمذی) ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) said: 'The person closest to me on the Day of Resurrection will be the one who sent the most blessings (Salat) upon me.'"
      }
    },

    {
      "id": 1347,
      "name": {
        "arabic": "وَعَنْ شَدَّادِ بْنِ أَوْسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ سَيِّدُ اَلِاسْتِغْفَارِ, أَنْ يَقُولَ اَلْعَبْدُ: اَللَّهُمَّ أَنْتَ رَبِّي, لَا إِلَهَ إِلَّا أَنْتَ, خَلَقْتَنِي, وَأَنَا عَبْدُكَ, وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اِسْتَطَعْتُ, أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ, أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ, وَأَبُوءُ لَكَ بِذَنْبِي, فَاغْفِرْ لِي; فَإِنَّهُ لَا يَغْفِرُ اَلذُّنُوبَ إِلَّا أَنْتَ } أَخْرَجَهُ اَلْبُخَارِيُّ .‏",
        "urdu": "سیدنا شداد بن اوس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” سیدالاستغفار یہ ہے کہ بندہ یوں کہے: «اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت» (اے اللہ! تو میرا رب ہے۔ تیرے سوا کوئی معبود نہیں، تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں اور اپنی طاقت کے مطابق تیرے عہد اور وعدے پر قائم ہوں۔ میں اپنے کیے ہوئے کاموں کے شر سے تیری پناہ مانگتا ہوں۔ میں تیرے سامنے تیری نعمتوں کا اعتراف کرتا ہوں اور اپنے گناہوں کا اقرار کرتا ہوں۔ پس مجھے معاف فرما دے، کیونکہ تیرے سوا کوئی گناہوں کو معاف نہیں کر سکتا)۔ “ (بخاری)",
        "english": "Narrated Shaddad bin Aus (RAA): The Messenger of Allah (ﷺ) said: 'The most superior way of asking for forgiveness (Sayyid al-Istighfar) is to say: \"O Allah, You are my Lord! None has the right to be worshipped but You. You created me and I am Your slave, and I am faithful to my covenant and my promise as much as I can. I seek refuge with You from all the evil I have done. I acknowledge before You all the blessings You have bestowed upon me, and I confess to You all my sins. So I entreat You to forgive my sins, for nobody can forgive sins except You.\"' [Reported by al-Bukhari]."
      }
    },

    {
      "id": 1348,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { لَمْ يَكُنْ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَدَعُ هَؤُلَاءِ اَلْكَلِمَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ: اَللَّهُمَّ إِنِّي أَسْأَلُكَ اَلْعَافِيَةَ فِي دِينِي, وَدُنْيَايَ, وَأَهْلِي, وَمالِي, اَللَّهُمَّ اسْتُرْ عَوْرَاتِي, وَآمِنْ رَوْعَاتِي, وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ, وَمِنْ خَلْفِي, وَعَنْ يَمِينِي, وَعَنْ شِمَالِي, وَمِنْ فَوْقِي, وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي } أَخْرَجَهُ النَّسَائِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اَلْحَاكِمُ .‏",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ان کلمات کو صبح و شام کبھی بھی نہیں چھوڑتے تھے: «اللهم إني أسألك العافية في ديني ودنياي وأهلي ومالي اللهم استر عوراتي وآمن روعاتي واحفظني من بين يدی ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي» ”اے اللہ! میں تجھ سے عافیت کا طلبگار ہوں، اپنے دین، اپنی دنیا، اپنے اہل و عیال اور اپنے مال میں۔ اے اللہ! میرے عیوب کی پردہ پوشی فرما اور مجھے خوف سے امن عطا کر۔ میری حفاظت فرما میرے آگے سے، پیچھے سے، دائیں سے، بائیں سے اور اوپر سے، اور میں تیری عظمت کی پناہ مانگتا ہوں اس بات سے کہ میں اپنے نیچے سے ہلاک کیا جاؤں (دھنسا دیا جاؤں)۔“",
        "english": "Narrated Ibn 'Umar (RAA): The Messenger of Allah (ﷺ) never failed to utter these supplications in the evening and in the morning: 'O Allah, I ask You for well-being in my religion, my worldly affairs, my family and my wealth. O Allah, conceal my faults and keep me safe from what I fear. O Allah, guard me from my front and from my back, from my right and from my left, and from above me, and I seek refuge in Your Greatness from being swallowed up from beneath me.'"
      }
    },

    {
      "id": 1349,
      "name": {
        "arabic": " وَعَنِ ابْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ, وَتَحَوُّلِ عَافِيَتِكَ, وَفَجْأَةِ نِقْمَتِكَ, وَجَمِيعِ سَخَطِكَ } أَخْرَجَهُ مُسْلِمٌ .‏",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا فرمایا کرتے تھے: «اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجأة نقمتك وجميع سخطك» ”اے اللہ! میں تیری دی ہوئی نعمت کے چھن جانے، تیری عطا کردہ عافیت کے بدل جانے، تیرے اچانک عذاب کے نازل ہونے اور تیری ہر قسم کی ناراضگی سے تیری پناہ مانگتا ہوں۔“ (مسلم)",
        "english": "Narrated Ibn 'Umar (RAA): The Messenger of Allah (ﷺ) used to say: 'O Allah, I seek refuge in Thee from the withdrawal of Thine blessing, and the change of Thine protection (well-being), and from the suddenness of Thine wrath, and from every kind of Thy displeasure.' [Reported by Muslim]."
      }
    },

    {
      "id": 1350,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ اَلدَّيْنِ, وَغَلَبَةِ اَلْعَدُوِّ, وَشَمَاتَةِ اَلْأَعْدَاءِ } رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ فرمایا کرتے تھے: ”اے اللہ! میں قرض کے بوجھ (غلبے)، دشمن کے غلبے اور دشمنوں کے (میری تکلیف پر) خوش ہونے سے تیری پناہ مانگتا ہوں۔“ (نسائی، حاکم)",
        "english": "Narrated 'Abdullah bin 'Amr (RA): Allah's Messenger (ﷺ) used to say: 'O Allah, I seek refuge in You from being overwhelmed by debt, from being overpowered by the enemy, and from the malice of enemies (their rejoicing at my misfortune).'"
      }
    },

    {
      "id": 1351,
      "name": {
        "arabic": "وَعَنْ بُرَيْدَةَ ‏- رضى الله عنه ‏- قَالَ: { سَمِعَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-رَجُلاً يَقُولُ: اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اَللَّهُ لَا إِلَهَ إِلَّا أَنْتَ, اَلْأَحَدُ اَلصَّمَدُ, اَلَّذِي لَمْ يَلِدْ, وَلَمْ يُولَدْ, وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.‏ فَقَالَ: لَقَدْ سَأَلَ اَللَّهَ بِاسْمِهِ اَلَّذِي إِذَا سُئِلَ بِهِ أَعْطَى, وَإِذَا دُعِيَ بِهِ أَجَابَ } أَخْرَجَهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ .",
        "urdu": "سیدنا بریدہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی کو یہ کلمات کہتے ہوئے سنا: «اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد» ”الٰہی! میں تجھ سے سوال کرتا ہوں اس وسیلے سے کہ میں گواہی دیتا ہوں کہ تو ہی اللہ ہے، تیرے سوا کوئی معبود نہیں، تو اکیلا ہے، بے نیاز ہے، نہ تیری کوئی اولاد ہے اور نہ تو کسی کی اولاد ہے اور نہ کوئی تیرے برابر کا ہے۔“ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اس شخص نے اللہ تعالیٰ سے اس کے اس (اسمِ اعظم) کے ذریعے مانگا ہے کہ جب بھی اس کے ذریعے مانگا جائے تو وہ عطا فرماتا ہے اور جب دعا کی جائے تو قبول فرماتا ہے۔“",
        "english": "Narrated Buraidah (RAA): The Messenger of Allah (ﷺ) heard a man saying: 'O Allah, I ask You, bearing witness that You are Allah, none has the right to be worshipped but You, the One, the Self-Sufficient Master Who begets not nor was He begotten, and there is none co-equal or comparable to Him.' The Prophet (ﷺ) said: 'He has asked Allah by His Greatest Name, by which if He is asked, He grants, and by which if He is supplicated, He answers.' [Reported by the four Imams and authenticated by Ibn Hibban]."
      }
    },

    {
      "id": 1352,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَصْبَحَ, يَقُولُ: اَللَّهُمَّ بِكَ أَصْبَحْنَا, وَبِكَ أَمْسَيْنَا, وَبِكَ نَحْيَا, وَبِكَ نَمُوتُ, وَإِلَيْكَ اَلنُّشُورُ } وَإِذَا أَمْسَى قَالَ مِثْلَ ذَلِكَ ; إِلَّا أَنَّهُ قَالَ: { وَإِلَيْكَ اَلْمَصِيرُ } أَخْرَجَهُ اَلْأَرْبَعَةُ .‏ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے، جب صبح ہوتی رسول اللہ صلی اللہ علیہ وسلم کہتے: «اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور» (اے اللہ! تیرے ہی حکم سے ہم نے صبح کی اور تیرے ہی حکم سے ہم نے شام کی، تیرے ہی حکم سے ہم جیتے ہیں اور تیرے ہی حکم سے ہم مریں گے اور تیری ہی طرف دوبارہ جی اٹھنا ہے)۔ اور جب شام ہوتی تو بھی اسی طرح کہتے سوائے اس کے کہ (آخر میں) فرماتے: «وإليك المصير» (اور تیری ہی طرف پلٹ کر جانا ہے)۔ (ابوداؤد، ترمذی، نسائی اور ابن ماجہ)",
        "english": "Narrated Abu Hurairah (RA): In the morning the Messenger of Allah (ﷺ) used to say: 'O Allah, by You we enter the morning and by You we enter the evening, by You we live and by You we die, and to You is the Resurrection.' In the evening he used to say the same, but instead (at the end) he said: 'and to You is the final return.'"
      }
    },

    {
      "id": 1353,
      "name": {
        "arabic": " وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ أَكْثَرُ دُعَاءِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَبَّنَا آتِنَا فِي اَلدُّنْيَا حَسَنَةً, وَفِي اَلْآخِرَةِ حَسَنَةً, وَقِنَا عَذَابَ اَلنَّارِ } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": " سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم بکثرت یہ دعا مانگا کرتے تھے: «ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار» ”اے ہمارے رب! ہمیں دنیا میں بھی بھلائی عطا فرما اور آخرت میں بھی بھلائی عطا فرما اور ہمیں آگ کے عذاب سے بچا۔“ (بخاری ومسلم)",
        "english": "Narrated Anas (RAA): 'The supplication the Prophet (ﷺ) made most was: \"O Allah, give us in this world that which is good and in the Hereafter that which is good, and save us from the punishment of the Fire.\"' [Agreed upon]."
      }
    },

    {
      "id": 1354,
      "name": {
        "arabic": "وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: { كَانَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَدْعُو: اَللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي, وَجَهْلِي, وَإِسْرَافِي فِي أَمْرِي, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي, اَللَّهُمَّ اِغْفِرْ لِي جِدِّي, وَهَزْلِي, وَخَطَئِي, وَعَمْدِي, وَكُلُّ ذَلِكَ عِنْدِي, اَللَّهُمَّ اِغْفِرْ لِي مَا قَدَّمْتُ, وَمَا أَخَّرْتُ, وَمَا أَسْرَرْتُ, وَمَا أَعْلَنْتُ, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي, أَنْتَ اَلْمُقَدِّمُ وَالْمُؤَخِّرُ, وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ یہ دعا فرمایا کرتے تھے: ”اے اللہ! میری خطا، میری نادانی، اپنے معاملے میں میری زیادتی اور ان تمام گناہوں کو معاف فرما جنہیں تو مجھ سے زیادہ جانتا ہے۔ اے اللہ! میرے ان گناہوں کو بخش دے جو میں نے سنجیدگی میں کیے یا مذاق میں، غلطی سے کیے یا جان بوجھ کر، اور یہ سب (کیفیتیں) مجھ میں موجود ہیں۔ اے اللہ! میرے وہ گناہ بھی معاف فرما جو میں کر چکا ہوں اور جو میں آئندہ کروں گا، جو میں نے چھپ کر کیے اور جو علانیہ کیے، اور وہ بھی جنہیں تو مجھ سے زیادہ جانتا ہے۔ تو ہی آگے بڑھانے والا اور تو ہی پیچھے ہٹانے والا ہے، اور تو ہر چیز پر قدرت رکھنے والا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Musa al-Ash'ari (RA): The Prophet (ﷺ) used to supplicate: 'O Allah, forgive me my faults, my ignorance, my immoderation in my concerns, and what You know better than I. O Allah, forgive me my seriousness, my jesting, my mistakes and my intentional (sins), and all of these are in me. O Allah, forgive me what I have sent before and what I have left behind, what I have concealed and what I have declared, and what You know better than I. You are the Advancer and You are the Delayer, and You are Powerful over everything.'"
      }
    },

    {
      "id": 1355,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: اَللَّهُمَّ أَصْلِحْ لِي دِينِي اَلَّذِي هُوَ عِصْمَةُ أَمْرِي, وَأَصْلِحْ لِي دُنْيَايَ اَلَّتِي فِيهَا مَعَاشِي, وَأَصْلِحْ لِي آخِرَتِي اَلَّتِي إِلَيْهَا مَعَادِي, وَاجْعَلْ اَلْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ, وَاجْعَلْ اَلْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ } أَخْرَجَهُ مُسْلِمٌ .‏ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم فرمایا کرتے تھے: «اللهم أصلح لي ديني الذي هو عصمة أمري وأصلح لي دنياي التي فيها معاشي وأصلح لي آخرتي التي إليها معادي واجعل الحياة زيادة لي في كل خير واجعل الموت راحة لي من كل شر» ” اے اللہ! میرے لیے میرا دین درست فرما دے جو میرے تمام معاملات کا بچاؤ (بنیاد) ہے۔ میرے لیے میری دنیا درست فرما دے جس میں میرا گزر بسر ہے۔ میرے لیے میری آخرت درست فرما دے جہاں مجھے لوٹ کر جانا ہے۔ میری زندگی کو ہر خیر میں اضافے کا ذریعہ بنا دے اور میری موت کو ہر برائی سے راحت (کا سبب) بنا دے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) used to say: 'O Allah, set right for me my religion which is the safeguard of my affairs, and set right for me my world in which is my livelihood, and set right for me my Hereafter to which is my return, and make life for me an increase in every good and make death for me a rest from every evil.' [Reported by Muslim]."
      }
    },

    {
      "id": 1356,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ:' اَللَّهُمَّ اِنْفَعْنِي بِمَا عَلَّمْتَنِي, وَعَلِّمْنِي مَا يَنْفَعُنِي, وَارْزُقْنِي عِلْمًا يَنْفَعُنِي } رَوَاهُ النَّسَائِيُّ, وَالْحَاكِمُ . وَلِلتِّرْمِذِيِّ: مِنْ حَدِيثِ أَبِي هُرَيْرَةَ نَحْوُهُ, وَقَالَ فِي آخِرِهِ: { وَزِدْنِي عِلْمًا, وَالْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ, وَأَعُوذُ بِاَللَّهِ مِنْ حَالِ أَهْلِ اَلنَّارِ } وَإِسْنَادُهُ حَسَنٌ .‏",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا فرمایا کرتے تھے: ”اے اللہ! جو علم تو نے مجھے سکھایا ہے اس سے مجھے نفع عطا فرما، اور مجھے وہ علم سکھا جو میرے لیے نفع بخش ہو، اور مجھے ایسا علم عطا فرما جو مجھے فائدہ دے۔“ (نسائی اور حاکم)۔ اور ترمذی میں ابوہریرہ رضی اللہ عنہ سے بھی اسی طرح مروی ہے، جس کے آخر میں یہ الفاظ ہیں: ”اور میرے علم میں اضافہ فرما، ہر حال میں اللہ کا شکر ہے اور میں اہل جہنم کے حال سے اللہ کی پناہ مانگتا ہوں۔“ (اس کی اسناد حسن ہیں)۔",
        "english": "Narrated Anas (RA): The Messenger of Allah (ﷺ) used to say: 'O Allah, benefit me with what You have taught me, teach me what will benefit me, and provide me with knowledge that will benefit me.' Reported by An-Nasa'i and Al-Hakim. At-Tirmidhi reported something similar from Abu Hurairah (RA) and added at the end: 'And increase me in knowledge. Praise is to Allah in all circumstances, and I seek refuge in Allah from the state of the people of the Fire.' (Its chain is Hasan)."
      }
    },

    {
      "id": 1357,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَلَّمَهَا هَذَا اَلدُّعَاءَ: { اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ, عَاجِلِهِ وَآجِلِهِ, مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ, وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ, عَاجِلِهِ وَآجِلِهِ, مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ, اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ, وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ, اَللَّمَّ إِنِّي أَسْأَلُكَ اَلْجَنَّةَ, وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ, وَأَعُوذُ بِكَ مِنَ النَّارِ, وَمَا قَرَّبَ مِنْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ, وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا } أَخْرَجَهُ اِبْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ . ",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو یہ دعا سکھائی: ”اے اللہ! میں تجھ سے ہر طرح کی بھلائی کا سوال کرتا ہوں، جو جلد ملنے والی ہو یا دیر سے، جس کو میں جانتا ہوں یا نہیں جانتا۔ اور میں ہر طرح کے شر سے تیری پناہ مانگتا ہوں، جو جلد آنے والا ہو یا دیر سے، جس کو میں جانتا ہوں یا نہیں جانتا۔ اے اللہ! میں تجھ سے اس خیر کا سوال کرتا ہوں جس کا تیرے بندے اور تیرے نبی (ﷺ) نے سوال کیا، اور میں اس شر سے تیری پناہ مانگتا ہوں جس سے تیرے بندے اور تیرے نبی (ﷺ) نے پناہ مانگی۔ اے اللہ! میں تجھ سے جنت کا سوال کرتا ہوں اور ہر اس قول و عمل کا جو اس سے قریب کر دے، اور میں آگ سے تیری پناہ مانگتا ہوں اور ہر اس قول و عمل سے جو اس سے قریب کر دے۔ اور میں تجھ سے سوال کرتا ہوں کہ تو میرے لیے جو بھی فیصلہ کرے اسے بہتر بنا دے۔“ اسے ابن ماجہ نے روایت کیا اور ابن حبان اور حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated ‘Aishah (RAA): The Messenger of Allah (ﷺ) taught her this supplication: “O Allah, I ask You for all the good which is in the present or in the future, which I know and which I do not know. I seek refuge in You from all evil which is in the present or in the future, which I know and which I do not know. O Allah, I ask You for the best of what Your slave and Prophet (ﷺ) has asked You for, and I seek refuge in You from the evil of what Your slave and Prophet (ﷺ) sought refuge from. O Allah, I ask You for Paradise and for that which brings one closer to it, whether in word or deed. I seek refuge in You from Hell and from that which brings one closer to it, whether in word or deed. And I ask You to make every decree You have ordained for me good.” [Reported by Ibn Majah, and authenticated by Ibn Hibban and Al-Hakim]."
      }
    },

    {
      "id": 1358,
      "name": {
        "arabic": "وَأَخْرَجَ اَلشَّيْخَانِ عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كَلِمَتَانِ حَبِيبَتَانِ إِلَى اَلرَّحْمَنِ, خَفِيفَتَانِ عَلَى اَللِّسَانِ, ثَقِيلَتَانِ فِي اَلْمِيزَانِ, سُبْحَانَ اَللَّهِ وَبِحَمْدِهِ , سُبْحَانَ اَللَّهِ اَلْعَظِيمِ } ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”دو کلمے ایسے ہیں جو رحمن کو بہت پیارے ہیں، زبان پر بہت ہلکے (آسان) ہیں، اور (قیامت کے دن) عمل کے ترازو میں بہت بھاری ہوں گے، (وہ یہ ہیں): سُبْحَانَ اللہِ وَبِحَمْدِہٖ (اللہ اپنی تعریفوں کے ساتھ پاک ہے) سُبْحَانَ اللہِ الْعَظِیْمِ (عظمت والا اللہ پاک ہے)۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Two words (phrases) are beloved to the Most Merciful, light on the tongue but heavy in the Scale: \"Subhan-Allahi wa bihamdihi\" (Glory and praise be to Allah) and \"Subhan-Allahil-'Azim\" (Glory be to Allah the Supreme).'"
      }
    },

    {
      "id": 1359,
      "name": {
        "arabic": " ",
        "urdu": " ",
        "english": " "
      }
    }
  ]
}
