{
  "chapId": 7,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 77,
    "to": 93
  },
  "hadiths": [
    {
      "id": 77,
      "name": {
        "arabic": " عَنْ أَنَسِ بْنِ مَالِكٍ  - رضى الله عنه  - قَالَ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -إِذَا دَخَلَ اَلْخَلَاءَ وَضَعَ خَاتَمَهُ } أَخْرَجَهُ اَلْأَرْبَعَةُ, وَهُوَ مَعْلُول ٌ",
        "urdu": " سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ **رسول اللہ صلی اللہ علیہ وسلم جب قضائے حاجت کے لئے تشریف لے جاتے تو انگشتری (اپنی انگوٹھی اپنے دست مبارک سے) اتار کر الگ رکھ دیتے تھے۔** اسے ابوداؤد، ترمذی، نسائی، اور ابن ماجہ نے روایت کیا ہے اور یہ روایت **معلول** (علت والی، ضعیف) ہے۔ ",
        "english": "It was narrated from Anas ibn Malik (May Allah be pleased with him) who said: **“When the Messenger of Allah (peace be upon him) entered the toilet/lavatory (Khala'), he would remove his ring.”** Reported by the four Sunan compilers (Abu Dawud, At-Tirmidhi, An-Nasa'i, and Ibn Majah), but the Hadith is considered **defective (Ma‘lul).**"
      }
    },

    {
      "id": 78,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -إِذَا دَخَلَ اَلْخَلَاءَ قَالَ: \"اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ اَلْخُبُثِ وَالْخَبَائِثِ\" } أَخْرَجَهُ اَلسَّبْعَة ُ ",
        "urdu": " سیدنا انس بن مالک رضی اللہ عنہ ہی روایت کرتے ہیں کہ **نبی کریم صلی اللہ علیہ وسلم قضائے حاجت کے لئے بیت الخلاء میں داخلہ کے وقت یہ دعا پڑھتے تھے «اللهم إني أعوذ بك من الخبث والخبائث» اے اللہ! میں آپ کی پناہ پکڑتا ہوں، خبیث جنوں اور خبیث جنیوں سے۔** اس کو ساتوں یعنی بخاری، مسلم، احمد، ابوداؤد، نسائی، ابن ماجہ اور ترمذی نے روایت کیا ہے۔",
        "english": "It was narrated from **Anas ibn Malik** (May Allah be pleased with him) who said: **“When the Messenger of Allah (peace be upon him) entered the lavatory (Khala'), he used to say: 'Allahumma inni a'udhu bika min al-khubuth wal-khaba'ith' (O Allah! I seek refuge in You from the male and female evil spirits).”** Reported by the Seven Imams (Al-Bukhari, Muslim, Ahmad, Abu Dawud, At-Tirmidhi, An-Nasa'i, and Ibn Majah)."
      }
    },

    {
      "id": 79,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -يَدْخُلُ اَلْخَلَاءَ, فَأَحْمِلُ أَنَا وَغُلَامٌ نَحْوِي إِدَاوَةً مِنْ مَاءٍ وَعَنَزَةً, فَيَسْتَنْجِي بِالْمَاءِ } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ ہی سے یہ روایت بھی ہے کہ **رسول اللہ صلی اللہ علیہ وسلم قضائے حاجت کے لئے بیت الخلاء میں داخل ہوتے تو میں اور ایک اور میرا ہم عمر لڑکا پانی کا ایک برتن اور ایک چھوٹا سا نیزہ لے کر ہمراہ جاتے۔ اس پانی سے آپ صلی اللہ علیہ وسلم استنجاء فرمایا کرتے۔** (بخاری و مسلم)  ",
        "english": "It was narrated from him (Anas ibn Malik, May Allah be pleased with him) who said: **“The Messenger of Allah (peace be upon him) used to enter the lavatory, and I and a boy like me would carry a small leather water vessel ('Idawah) and a short spear ('Anazah), and he would cleanse himself with the water (Istinja').”** Agreed upon (by Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 80,
      "name": {
        "arabic": " وَعَنْ اَلْمُغِيرَةِ بْنِ شُعْبَةَ  - رضى الله عنه  - قَالَ: { قَالَ لِي اَلنَّبِيُّ  - صلى الله عليه وسلم  - \"خُذِ اَلْإِدَاوَةَ\".  فَانْطَلَقَ حَتَّى تَوَارَى عَنِّي, فَقَضَى حَاجَتَهُ } مُتَّفَقٌ عَلَيْه",
        "urdu": " سیدنا مغیرہ بن شعبہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے فرمایا **”پانی کا برتن (ساتھ) لے چلو۔“** چنانچہ آپ صلی اللہ علیہ وسلم رفع حاجت کے لئے (اتنی دور) تشریف لے گئے کہ **میری نظر سے اوجھل ہو گئے۔** وہاں آپ صلی اللہ علیہ وسلم قضائے حاجت سے فارغ ہوئے۔ (بخاری و مسلم) ",
        "english": "It was narrated from **Al-Mughirah ibn Shu’bah** (May Allah be pleased with him) who said: **“The Prophet (peace be upon him) said to me: ‘Take the small water vessel (Idawah).’ Then he went away until he was hidden from my sight, and he relieved himself.”** Agreed upon (by Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 81,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ اِتَّقُوا اَللَّاعِنِينَ: اَلَّذِي يَتَخَلَّى فِي طَرِيقِ اَلنَّاسِ, أَوْ فِي ظِلِّهِمْ } رَوَاهُ مُسْلِم زَادَ أَبُو دَاوُدَ, عَنْ مُعَاذٍ: { وَالْمَوَارِدَ } وَلِأَحْمَدَ; عَنِ ابْنِ عَبَّاسٍ: { أَوْ نَقْعِ مَاءٍ } وَفِيهِمَا ضَعْف ٌ ٌوَأَخْرَجَ اَلطَّبَرَانِيُّ اَلنَّهْيَ عَن ْ 1  تَحْتِ اَلْأَشْجَارِ اَلْمُثْمِرَةِ, وَضَفَّةِ اَلنَّهْرِ الْجَارِي.  مِنْ حَدِيثِ اِبْنِ عُمَرَ بِسَنَدٍ ضَعِيف ٍ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا **”دو لعنت کا سبب بننے والی جگہوں سے اجتناب کرو، ایک لوگوں کے راستہ میں۔ دوسرا (ان کے بیٹھنے آرام کرنے کی) سایہ دار جگہ میں قضائے حاجت کرنے سے۔“** (مسلم) اور ابوداؤد نے سیدنا معاذ رضی اللہ عنہ کے واسطہ سے جو روایت کی ہے، اس میں اس طرح ہے کہ **”لعنت کے تین اسباب سے اجتناب کرو، گھاٹوں پر، شاہراہ عام پر اور سایہ کے نیچے رفع حاجت کرنے سے۔“** اور امام احمد نے ابن عباس رضی اللہ عنہما کے حوالہ سے جو روایت بیان کی ہے اس میں ہے**“ جہاں پانی جمع ہوتا ہو وہاں بھی رفع حاجت سے بچنا چاہیئے۔“** یہ دونوں روایتیں ضعیف ہیں۔ اور طبرانی نے ابن عمر رضی اللہ عنہما سے جو روایت بیان کی ہے اس میں ہے کہ **“پھل دار و سایہ دار درخت کے نیچے اور جاری و ساری نہر کے کنارے پر قضائے حاجت نہ کرے۔“** اس کی سند بھی ضعیف ہے۔ ",
        "english": "It was narrated from **Abu Hurairah** (May Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: **“Beware of the two acts that draw curses: the one who relieves himself in the people's pathway, or in their resting shade.”** Reported by Muslim. Abu Dawud added, from Mu’adh (RA): **“and watering places (Mawarid).”** Ahmad added, from Ibn Abbas: **“or in stagnant water (Naq'i Ma').”** Both additions have weakness. At-Tabarani also narrated the prohibition of relieving oneself **under fruit-bearing trees, and on the bank of a flowing river** from Ibn Umar with a weak chain."
      }
    },

    {
      "id": 82,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا تَغَوَّطَ اَلرَّجُلَانِ فَلْيَتَوَارَ كُلُّ وَاحِدٍ مِنْهُمَا عَنْ صَاحِبِهِ, وَلَا يَتَحَدَّثَا.  فَإِنَّ اَللَّهَ يَمْقُتُ عَلَى ذَلِكَ } رَوَاهُ .  وَصَحَّحَهُ اِبْنُ اَلسَّكَنِ, وَابْنُ اَلْقَطَّانِ, وَهُوَ مَعْلُول ٌ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا **”جب دو آدمی قضائے حاجت کریں تو ان کو ایک دوسرے سے پردہ میں ہونا چاہیئے اور اس حالت میں ایک دوسرے سے باہم گفتگو بھی نہ کریں۔ اس لئے کہ ایسے فعل پر اللہ تعالیٰ ناراض ہوتے ہیں۔“** اس روایت کو احمد نے روایت کیا ہے اور ابن سکن اور ابن قطان نے اسے صحیح قرار دیا ہے۔ مگر یہ حدیث **معلول** ہے۔ ",
        "english": "It was narrated from **Jabir** (May Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: **“When two men relieve themselves (defecate), let each of them hide from his companion, and let them not converse, for Allah is displeased by that.”** Reported by Ahmad, and authenticated by Ibn As-Sakan and Ibn Al-Qattan, but the Hadith is considered **defective (Ma‘lul).**"
      }
    },

    {
      "id": 83,
      "name": {
        "arabic": "وَعَنْ أَبِي قَتَادَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ لَا يُمْسِكَنَّ أَحَدُكُمْ ذَكَرَهُ بِيَمِينِهِ, وَهُوَ يَبُولُ, وَلَا يَتَمَسَّحْ مِنْ اَلْخَلَاءِ بِيَمِينِهِ, وَلَا يَتَنَفَّسْ فِي اَلْإِنَاءِ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِم ٍ",
        "urdu": " سیدنا ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے کہ **”تم میں سے کوئی بھی پیشاب کرتے وقت دائیں ہاتھ سے اپنے عضو مخصوص کو ہرگز نہ چھوئے اور قضائے حاجت کے بعد سیدھے ہاتھ سے استنجاء بھی نہ کرے۔ نیز (پانی پیتے وقت) برتن میں سانس بھی نہ لے“** (بخاری و مسلم) یہ الفاظ مسلم کے ہیں۔",
        "english": "It was narrated from **Abu Qatadah** (May Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: **“None of you should hold his male organ with his right hand while urinating, nor should he cleanse himself (Istinja') with his right hand after answering the call of nature, and nor should he breathe into the vessel (when drinking).”** Agreed upon (by Al-Bukhari and Muslim), and the wording is that of Muslim."
      }
    },

    {
      "id": 84,
      "name": {
        "arabic": "وَعَنْ سَلْمَانَ  - رضى الله عنه  - قَالَ: { لَقَدْ نَهَانَا رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  - 'أَنْ نَسْتَقْبِلَ اَلْقِبْلَةَ بِغَائِطٍ أَوْ بَوْلٍ, أَوْ أَنْ نَسْتَنْجِيَ بِالْيَمِينِ, أَوْ أَنْ نَسْتَنْجِيَ بِأَقَلَّ مِنْ ثَلَاثَةِ أَحْجَارٍ, أَوْ أَنْ نَسْتَنْجِيَ بِرَجِيعٍ أَوْ عَظْمٍ' } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا سلمان رضی اللہ عنہ سے روایت ہے کہ **رسول اللہ صلی اللہ علیہ وسلم نے ہمیں منع فرمایا کہ ”ہم قضائے حاجت اور پیشاب کے وقت قبلہ رخ ہوں یا دائیں ہاتھ سے استنجاء کریں یا تین ڈھیلوں سے کم سے استنجاء کریں یا گوبر، لید اور ہڈی سے استنجاء کریں۔“** (مسلم)  ",
        "english": "It was narrated from **Salman** (May Allah be pleased with him) who said: **“The Messenger of Allah (peace be upon him) forbade us from facing the Qiblah while defecating or urinating, or from cleansing ourselves (Istinja') with the right hand, or from cleansing ourselves with less than three stones, or from cleansing ourselves with dung (Raji') or bone ('Azm).”** Reported by Muslim."
      }
    },

    {
      "id": 85,
      "name": {
        "arabic": " وَلِلسَّبْعَةِ مِنْ حَدِيثِ أَبِي أَيُّوبَ  - رضى الله عنه  - { لَا تَسْتَقْبِلُوا اَلْقِبْلَةَ بِغَائِطٍ وَلَا بَوْلٍ, وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا } ",
        "urdu": "سیدنا ابوایوب انصاری رضی اللہ عنہ سے مروی ہے کہ ”قضائے حاجت اور پیشاب کرتے وقت قبلہ رخ نہ بیٹھو اور نہ اس کی طرف پشت کرو، بلکہ مشرق یا مغرب کی جانب کرو۔“ اس کو ساتوں یعنی بخاری، مسلم، احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ ",
        "english": "And for the Seven (Imams of Hadith), from the Hadith of Abu Ayyub (may Allah be pleased with him): \"Do not face the Qiblah while defecating or urinating, but face east or west.\""
      }
    },

    {
      "id": 86,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -قَالَ: { مَنْ أَتَى اَلْغَائِطَ فَلْيَسْتَتِرْ } رَوَاهُ أَبُو دَاوُد َ  ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو قضائے حاجت کے لئے جائے اسے پردہ کر کے بیٹھنا چاہیئے۔“ (ابوداؤد) ",
        "english": "And from 'A'ishah (may Allah be pleased with her): The Prophet (peace be upon him) said: \"Whoever goes to relieve himself (defecate), let him conceal himself (or seek cover).\" Reported by Abu Dawud."
      }
    },

    {
      "id": 87,
      "name": {
        "arabic": " وَعَنْهَا; { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -كَانَ إِذَا خَرَجَ مِنْ اَلْغَائِطِ قَالَ: \"غُفْرَانَكَ\" } أَخْرَجَهُ اَلْخَمْسَةُ.  وَصَحَّحَهُ أَبُو حَاتِمٍ, وَالْحَاكِم ُ ",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم جب قضائے حاجت سے فارغ ہو کر بیت الخلاء سے باہر آتے تو «غفرانک» فرماتے (یعنی) اے اللہ! تیری بخشش اور پردہ پوشی مطلوب ہے۔ اس روایت کو پانچوں (امام احمد، ابو داؤد، ترمذی، نسائی اور ابن ماجہ) نے روایت کیا ہے، ابوحاتم اور حاکم دونوں نے اسے صحیح قرار دیا ہے۔ ",
        "english": "And from her ('A'ishah, may Allah be pleased with her): The Prophet (peace be upon him) used to say, when he came out of the lavatory (after relieving himself): \"Ghufranak (I seek Your forgiveness).\" It was reported by the Five (Sunan compilers and Ahmad) and authenticated by Abu Hatim and Al-Hakim."
      }
    },

    {
      "id": 88,
      "name": {
        "arabic": " وَعَنِ ابْنِ مَسْعُودٍ  - رضى الله عنه  - قَالَ: { أَتَى اَلنَّبِيُّ  - صلى الله عليه وسلم  -اَلْغَائِطَ, فَأَمَرَنِي أَنْ آتِيَهُ بِثَلَاثَةِ أَحْجَارٍ, فَوَجَدْتُ حَجَرَيْنِ, وَلَمْ أَجِدْ ثَالِثًا.  فَأَتَيْتُهُ بِرَوْثَةٍ.  فَأَخَذَهُمَا وَأَلْقَى اَلرَّوْثَةَ, وَقَالَ: \"هَذَا رِكْسٌ\" } أَخْرَجَهُ اَلْبُخَارِيّ ُ زَادَ أَحْمَدُ, وَاَلدَّارَقُطْنِيُّ: { ائْتِنِي بِغَيْرِهَا }",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم قضائے حاجت کو چلے تو مجھے حکم دیا کہ میں ان کیلئے تین پتھر لے آؤں۔ مجھے دو پتھر تو مل گئے تیسرا نہ مل سکا۔ میں (مجبوراً) گوبر کا ایک خشک ٹکڑا لے آیا۔ آپ صلی اللہ علیہ وسلم نے دونوں پتھر تو لے لئے اور گوبر کے خشک ٹکڑے کو دور پھینک دیا اور فرمایا ”یہ تو بذات خود پلید ہے۔“ اسے بخاری نے روایت کیا ہے۔ احمد اور دارقطنی نے اتنا اضافہ اور کیا ہے کہ ”اس کی بجائے اور لے آؤ۔“ ",
        "english": "And from Ibn Mas'ud (may Allah be pleased with him): He said, \"The Prophet (peace be upon him) went to relieve himself, so he commanded me to bring him three stones. I found two stones, but I did not find a third. So, I brought him a piece of dry dung. He took the two stones and cast away the dung, saying: 'This is filth (Riks).\" Reported by Al-Bukhari. Ahmad and Ad-Daraqutni added: \"Bring me something else instead of it.\""
      }
    },

    {
      "id": 89,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - { أَنَّ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -نَهَى 'أَنْ يُسْتَنْجَى بِعَظْمٍ, أَوْ رَوْثٍ\" وَقَالَ: \"إِنَّهُمَا لَا يُطَهِّرَانِ' } رَوَاهُ اَلدَّارَقُطْنِيُّ وَصَحَّحَه ُ  ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں **ہڈی اور گوبر** کے ساتھ استنجاء کرنے سے منع فرمایا ہے، ساتھ ہی فرمایا کہ ”یہ دونوں **پاک نہیں کر سکتے**۔“ دارقطنی نے اسے روایت کیا ہے اور صحیح بھی قرار دیا ہے۔",
        "english": "And from Abu Hurairah (may Allah be pleased with him): The Messenger of Allah (peace be upon him) **forbade** the use of a **bone** or **dung** for **Istinja'** (cleansing), and he said: \"**Indeed, neither of the two purifies**.\""
      }
    },

    {
      "id": 90,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ اِسْتَنْزِهُوا مِنْ اَلْبَوْلِ, فَإِنَّ عَامَّةَ عَذَابِ اَلْقَبْرِ مِنْهُ } رَوَاهُ اَلدَّارَقُطْنِيّ ُ وَلِلْحَاكِمِ: { أَكْثَرُ عَذَابِ اَلْقَبْرِ مِنْ اَلْبَوْلِ } وَهُوَ صَحِيحُ اَلْإِسْنَاد ِ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”پیشاب (کے چھینٹوں) سے بچو۔ اکثر عذاب قبر اسی وجہ سے ہوتا ہے۔“ دارقطنی نے اسے روایت کیا ہے اور حاکم کی روایت میں ہے: \"اکثر عذاب قبر پیشاب کی وجہ سے ہوتا ہے\"۔ اس کی سند صحیح ہے۔",
        "english": "And from Abu Hurairah (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: \"**Be careful to clean yourselves from urine, for indeed, the majority of the punishment of the grave is because of it.**\" Reported by Ad-Daraqutni. And for Al-Hakim: \"The majority of the punishment of the grave is from urine.\" And its chain of narration is authentic (Sahih Al-Isnad)."
      }
    },

    {
      "id": 91,
      "name": {
        "arabic": "وَعَنْ سُرَاقَةَ بْنِ مَالِكٍ  - رضى الله عنه  - قَالَ: { عَلَّمْنَا رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -فِي اَلْخَلَاءِ: \" أَنَّ نَقْعُدَ عَلَى اَلْيُسْرَى, وَنَنْصِبَ اَلْيُمْنَى\" } رَوَاهُ اَلْبَيْهَقِيُّ بِسَنَدٍ ضَعِيف ٍ ",
        "urdu": " سیدنا سراقہ بن مالک رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے قضائے حاجت کی تعلیم دیتے ہوئے ہمیں فرمایا کہ ”ہم بائیں پاؤں پر وزن دے کر بیٹھیں اور دائیں کو کھڑا رکھیں (اس پر بوجھ کم ڈالیں)۔“ اس کو بیہقی نے **ضعیف سند** کے ساتھ روایت کیا ہے۔",
        "english": "And from Suraqah ibn Malik (may Allah be pleased with him): He said: \"The Messenger of Allah (peace be upon him) taught us concerning relieving ourselves: **'That we should sit on the left foot and keep the right one raised**.'\" Reported by Al-Bayhaqi with a **weak chain of narration**."
      }
    },

    {
      "id": 92,
      "name": {
        "arabic": " وَعَنْ عِيسَى بْنِ يَزْدَادَ, عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا بَالَ أَحَدُكُمْ فَلْيَنْثُرْ ذَكَرَهُ ثَلَاثَ مَرَّاتٍ } رَوَاهُ اِبْنُ مَاجَه بِسَنَدٍ ضَعِيف",
        "urdu": " سیدنا عیسیٰ بن یزدار نے اپنے والد سے روایت بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے جب کوئی پیشاب کرے تو **عضو مخصوص کو تین مرتبہ جھاڑ** لے۔“ اسے ابن ماجہ نے **ضعیف سند** کے ساتھ روایت کیا ہے۔",
        "english": "And from 'Isa ibn Yazdad, from his father, he said: The Messenger of Allah (peace be upon him) said: \"**When one of you urinates, let him shake his penis (or genital area) three times**.\" Reported by Ibn Majah with a **weak chain of narration**."
      }
    },

    {
      "id": 93,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -سَأَلَ أَهْلَ قُبَاءٍ, فَقَالُوا: إِنَّا نُتْبِعُ اَلْحِجَارَةَ اَلْمَاءَ } رَوَاهُ اَلْبَزَّارُ بِسَنَدٍ ضَعِيف وَأَصْلُهُ فِي أَبِي دَاوُدَ, وَاَلتِّرْمِذِيّ وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ  - رضى الله عنه  - بِدُونِ ذِكْرِ اَلْحِجَارَة ِ ٍ",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے اہل قباء سے سوال کیا کہ اللہ تعالیٰ نے تمہاری (پاکیزگی کے بارے میں) بڑی تعریف فرمائی ہے، اس کی وجہ کیا ہے؟ انہوں نے عرض کیا کہ ہم **ڈھیلوں کے استعمال کے بعد مزید طہارت کے لیے پانی بھی استعمال کرتے** ہیں۔ اسے ضعیف سند کے ساتھ بزار نے روایت کیا ہے۔ اس کی اصل ابوداؤد اور ترمذی میں موجود ہے (اسی سلسلے میں) ابن خزیمہ نے ابوہریرہ رضی اللہ عنہ کی روایت کو صحیح قرار دیا ہے البتہ اس میں ڈھیلوں کا ذکر نہیں ہے۔",
        "english": "And from Ibn 'Abbas (may Allah be pleased with them both): The Prophet (peace be upon him) **asked the people of Quba'**, and they said: \"**We follow the stones with water**.\" Reported by Al-Bazzar with a **weak chain of narration**. The basis of it is in Abu Dawud and At-Tirmidhi, and Ibn Khuzaymah authenticated it from the Hadith of Abu Hurairah (may Allah be pleased with him) **without the mention of stones**."
      }
    }
  ]
}