{
  "chapId": 96,
  "bookId": 13,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1171,
    "to": 1187
  },
  "hadiths": [
    {
      "id": 1171,
      "name": {
        "arabic": "عَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا, { عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّهُ أَدْرَكَ عُمَرَ بْنَ اَلْخَطَّابِ فِي رَكْبٍ, وَعُمَرَ يَحْلِفُ بِأَبِيهِ, فَنَادَاهُمْ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- \"أَلَا إِنَّ اَللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ, فَمَنْ كَانَ حَالِفاً فَلْيَحْلِفْ بِاَللَّهِ, أَوْ لِيَصْمُتْ\" } مُتَّفَقٌ عَلَيْهِ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ, وَالنَّسَائِيِّ: عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { لَا تَحْلِفُوا بِآبَائِكُمْ, وَلَا بِأُمَّهَاتِكُمْ, وَلَا بِالْأَنْدَادِ, وَلَا تَحْلِفُوا إِلَّا بِاَللَّهِ, وَلَا تَحْلِفُوا بِاَللَّهِ إِلَّا وَأَنْتُمْ صَادِقُونَ }",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے سیدنا عمر رضی اللہ عنہ کو ایک کارواں میں اپنے باپ کی قسم اٹھاتے سنا تو نبی کریم صلی اللہ علیہ وسلم نے انہیں بلا کر فرمایا ” اللہ نے تمہیں تمہارے آباء و اجداد کی قسم کھانے سے منع فرمایا ہے۔ پس اب جو قسم کھانا چاہے تو اسے اللہ کے نام کی قسم کھانی چاہیئے ورنہ خاموش رہے۔“ (بخاری و مسلم) حضرت ابوہریرہ رضی اللہ عنہ سے ابوداؤد اور نسائی کی ایک مرفوع روایت میں ہے ” اپنے باپ دادوں، اپنی ماؤں اور اللہ کے شریکوں کی قسم نہ کھاؤ۔ اللہ کی قسم بھی صرف اس حالت میں کھاؤ کہ جب تم سچے ہو۔“",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) came upon 'Umar bin al-Khattab (RA) while he was in a group of riders and he was swearing by his father. So Allah's Messenger (ﷺ) called them and said: 'Verily, Allah forbids you to swear by your fathers. Whoever has to take an oath should swear by Allah or remain silent.' [Agreed upon]. In a version by Abu Dawud and an-Nasa'i from Abu Hurairah (RA): 'Do not swear by your fathers, nor by your mothers, nor by rivals (idols). Swear only by Allah, and swear by Allah only when you are speaking the truth.'"
      }
    },

    {
      "id": 1172,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ\" } وَفِي رِوَايَةٍ: { \"اَلْيَمِينُ عَلَى نِيَّةِ اَلْمُسْتَحْلِفِ\" } أَخْرَجَهُمَا مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” تیری قسم اس پر واقع ہوتی ہے کہ تمہارا ساتھی تجھ کو سچا سمجھے“ اور ایک روایت میں ہے ” قسم کا دارومدار قسم لینے والے کی نیت پر ہے۔“ ان دونوں احادیث کی روایت مسلم نے کی ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'Your oath is according to how your companion (who asks you to swear) understands it.' Another version states: 'The oath is based on the intention of the one who asks for the oath.' [Reported by Muslim]."
      }
    },

    {
      "id": 1173,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ سَمُرَةٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ وَإِذَا حَلَفْتَ عَلَى يَمِينٍ, فَرَأَيْتُ غَيْرَهَا خَيْراً مِنْهَا, فَكَفِّرْ عَنْ يَمِينِكَ, وَائْتِ اَلَّذِي هُوَ خَيْراً } مُتَّفَقٌ عَلَيْهِ. وَفِي لَفْظٍ لِلْبُخَارِيِّ: { فَائْتِ اَلَّذِي هُوَ خَيْرٌ, وَكَفِّرْ عَنْ يَمِينِكَ } .‏ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: { فَكَفِّرْ عَنْ يَمِينِكَ, ثُمَّ اِئْتِ اَلَّذِي هُوَ خَيْرٌ } ",
        "urdu": "سیدنا عبدالرحمٰن بن سمرہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب تم کسی کام پر قسم کھاؤ اور اس کام کے خلاف کو بہتر دیکھو تو قسم کا کفارہ ادا کر دو اور جو بہتر ہے وہ کر لو۔“ (بخاری و مسلم) اور بخاری کے الفاظ یہ ہیں کہ ” جو کام بہتر ہے اسے کرو اور قسم کا کفارہ ادا کرو۔“ اور ابوداؤد کی روایت میں اس طرح ہے کہ ” اپنی قسم کا کفارہ دے کر وہ کام کرو جو بہتر ہے۔“",
        "english": "Narrated 'Abdur-Rahman bin Samurah (RA): The Messenger of Allah (ﷺ) said: 'When you take an oath and then find something else to be better than it, expiate your oath and do that which is better.' [Agreed upon]. In a version by Al-Bukhari: 'Do that which is better and expiate your oath.' In a version by Abu Dawud: 'Expiate your oath and then do that which is better.'"
      }
    },

    {
      "id": 1174,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ: إِنْ شَاءَ اَللَّهُ, فَلَا حِنْثَ عَلَيْهِ } رَوَاهُ اَلْخَمْسَةُ .‏ وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جو کسی کام پر قسم کھائے اور ساتھ ہی «إن شاء الله» کہہ دے تو اس قسم کو توڑنے کا کوئی گناہ یا کفارہ نہیں ہے۔“",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'Whoever takes an oath and says, \"If Allah wills\" (Insha' Allah), he is not held to have broken his oath (if he acts otherwise).' [Reported by Al-Khamsa; Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1175,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَتْ يَمِينُ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- \"لَا, وَمُقَلِّبِ اَلْقُلُوبِ\" } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کی قسم کے الفاظ یہ ہوتے تھے ” نہیں، قسم ہے دلوں کے بدلنے والے کی (یعنی اللہ کی)۔“ (بخاری)",
        "english": "Narrated Ibn 'Umar (RA): The oath of the Prophet (ﷺ) used to be: 'No, by the One Who turns the hearts over (Muqallib al-Qulub).'"
      }
    },

    {
      "id": 1176,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { جَاءَ أَعْرَابِيٌّ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: يَا رَسُولَ اَللَّهِ! مَا اَلْكَبَائِرُ?.‏ … فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ قُلْتُ: وَمَا اَلْيَمِينُ اَلْغَمُوسُ? قَالَ: \" اَلَّذِي يَقْتَطِعُ مَالَ امْرِئٍ مُسْلِمٍ, هُوَ فِيهَا كَاذِبٌ\" } أَخْرَجَهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک دیہاتی آیا اور آپ صلی اللہ علیہ وسلم سے پوچھا کہ کبیرہ گناہ کون سے ہیں؟ پھر اس نے ساری حدیث بیان کی۔ اس حدیث میں جھوٹی قسم کا ذکر بھی تھا۔ میں نے عرض کیا جھوٹی قسم (یمین غموس) کون سی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ” جھوٹی قسم یہ ہے کہ اس کے ذریعہ کسی مسلمان کا مال ناحق حاصل کر لیا جائے حالانکہ قسم کھانے والا اس میں سراسر جھوٹا ہو۔“ (بخاری)",
        "english": "Narrated 'Abdullah bin 'Amr (RA): A desert Arab came to the Prophet (ﷺ) and asked, 'O Messenger of Allah, what are the major sins?' ... He (the narrator) mentioned the rest of the Hadith, and in it I asked, 'What is the engulfing oath (al-Yamin al-Ghamus)?' He (ﷺ) replied, 'It is that by which one usurps the property of a Muslim while he is lying.'"
      }
    },

    {
      "id": 1177,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا { فِي قَوْلِهِ تَعَالَى: ﴿ لَا يُؤَاخِذُكُمُ اَللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ ﴾ قَالَتْ: هُوَ قَوْلُ اَلرَّجُلِ: لَا وَاَللَّهِ.‏ بَلَى وَاَللَّهِ } أَخْرَجَهُ اَلْبُخَارِيُّ .‏ وَأَوْرَدَهُ أَبُو دَاوُدَ مَرْفُوعاً",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے اس ارشاد: ”اللہ تمہاری لغو قسموں پر تمہارا مواخذہ نہیں فرماتا“ کے بارے میں مروی ہے کہ انہوں نے فرمایا: اس سے مراد آدمی کا (بات بات پر عادتاً) یہ کہنا ہے کہ ”نہیں، اللہ کی قسم“ اور ”ہاں، اللہ کی قسم“۔ اس کی تخریج بخاری نے کی ہے اور ابوداؤد نے اسے مرفوعاً (نبی ﷺ کے قول کے طور پر) روایت کیا ہے۔",
        "english": "Narrated 'Aisha (RA) regarding the Verse: \"Allah will not punish you for what is unintentional in your oaths.\" (2:225). She said: \"It refers to a person saying (out of habit during conversation): 'No, by Allah' and 'Yes, by Allah'.\" [Reported by al-Bukhari; and Abu Dawud reported it as a Marfu' Hadith]."
      }
    },

    {
      "id": 1178,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"إِنَّ لِلَّهِ تِسْعًا وَتِسْعِينَ اِسْماً, مَنْ أَحْصَاهَا دَخَلَ اَلْجَنَّةَ\" } مُتَّفَقٌ عَلَيْهِ. وَسَاقَ اَلتِّرْمِذِيُّ وَابْنُ حِبَّانَ اَلْأَسْمَاءِ, وَالتَّحْقِيقُ أَنَّ سَرْدَهَا إِدْرَاجٌ مِنْ بَعْضِ اَلرُّوَاةِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بیشک اللہ تعالیٰ کے ننانوے (ایک کم سو) نام ہیں۔ جس نے ان کو یاد رکھا (ضبط کیا) وہ جنت میں داخل ہو گا۔“ (بخاری و مسلم) ترمذی اور ابن حبان نے ان ناموں کی تفصیل بھی بیان کی ہے، مگر تحقیق یہ ہے کہ ان ناموں کی فہرست اصل حدیث کا حصہ نہیں بلکہ بعض راویوں کی طرف سے درج (ادراج) کی گئی ہے۔",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Allah has ninety-nine names, one hundred less one; and he who memorizes them (and acts upon them) will enter Paradise.' [Agreed upon]. At-Tirmidhi and Ibn Hibban mentioned the names, but research shows that the list of names is an interpolation (Idraj) by some narrators."
      }
    },

    {
      "id": 1179,
      "name": {
        "arabic": "وَعَنْ أُسَامَةَ بْنِ زَيْدٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"مَنْ صُنِعَ إِلَيْهِ مَعْرُوفٌ, فَقَالَ لِفَاعِلِهِ: جَزَاكَ اَللَّهُ خَيْراً.‏ فَقَدْ أَبْلَغَ فِي اَلثَّنَاءِ\" } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا اسامہ بن زید رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس کسی کے ساتھ کوئی نیکی اور اچھا برتاؤ کیا جائے اور وہ (اس کے بدلے میں) اس نیکی کرنے والے سے کہے کہ «جزاك الله خيرا» (اللہ تعالیٰ آپ کو بہتر بدلہ عطا فرمائے) تو اس نے اس کی پوری پوری تعریف اور شکریہ ادا کر دیا۔“",
        "english": "Narrated Usamah bin Zaid (RA): Allah's Messenger (ﷺ) said: 'If one is done a kindness and says to his benefactor: \"Jazak Allahu khairan\" (May Allah reward you with good), he has fully expressed his appreciation.' [Reported by at-Tirmidhi; Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1180,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا, { عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ نَهَى عَنْ اَلنَّذْرِ وَقَالَ: \" إِنَّهُ لَا يَأْتِي بِخَيْرٍ وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ اَلْبَخِيلِ\" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے نذر ماننے سے منع کیا اور فرمایا کہ ” نذر سے کوئی خیر و بھلائی حاصل نہیں ہوتی صرف بخیل کا مال اس طریقہ سے نکال لیا جاتا ہے۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) forbade taking vows and said: 'It (a vow) does not bring about any good, but is a means of extracting something from the miserly.' [Agreed upon]."
      }
    },

    {
      "id": 1181,
      "name": {
        "arabic": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"كَفَّارَةُ اَلنَّذْرِ كَفَّارَةُ يَمِينٍ\" } رَوَاهُ مُسْلِمٌ.‏ وَزَادَ اَلتِّرْمِذِيُّ فِيهِ: { إِذَا لَمْ يُسَمِّ } , وَصَحَّحَهُ.‏ وَلِأَبِي دَاوُدَ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ مَرْفُوعاً: { \"مِنْ نَذَرَ نَذْراً لَمْ يُسَمِّهِ, فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ, وَمَنْ نَذَرَ نَذْراً فِي مَعْصِيَةٍ, فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ, وَمَنْ نَذَرَ نَذْراً لَا يُطِيقُهُ, فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ\" } وَإِسْنَادُهُ صَحِيحٌ; إِلَّا أَنَّ اَلْحُفَّاظَ رَجَّحُوا وَقْفَهُ.‏ وَلِلْبُخَارِيِّ: مِنْ حَدِيثِ عَائِشَةَ: { \" وَمَنْ نَذَرَ أَنْ يَعْصِيَ اَللَّهَ فَلَا يَعْصِهِ\" } وَلِمُسْلِمٍ: مِنْ حَدِيثِ عِمْرَانَ: { \" لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةٍ\" }",
        "urdu": "سیدنا عقبہ بن عامر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”نذر کا کفارہ وہی ہے جو قسم کا کفارہ ہے“۔ (مسلم) ترمذی نے اتنا اضافہ کیا ہے: ”جب اس کا نام نہ لیا جائے“۔ اور ابوداؤد میں ابن عباس رضی اللہ عنہما سے مرفوعاً مروی ہے: ”جس نے ایسی نذر مانی جس کا نام نہیں لیا (یعنی مبہم نذر)، یا گناہ کی نذر مانی، یا ایسی نذر مانی جس کی وہ طاقت نہیں رکھتا، تو ان سب کا کفارہ قسم کا کفارہ ہے“۔ اس کی سند صحیح ہے مگر حفاظ نے اسے موقوف قرار دیا ہے۔ بخاری میں سیدہ عائشہ رضی اللہ عنہا سے مروی ہے: ”جس نے اللہ کی نافرمانی کی نذر مانی تو وہ اس کی نافرمانی نہ کرے“ اور مسلم میں سیدنا عمران رضی اللہ عنہ سے مروی ہے: ”گناہ کے کام میں نذر کو پورا کرنا جائز نہیں“۔",
        "english": "Narrated 'Uqbah bin 'Amir (RA): Allah's Messenger (ﷺ) said: 'The expiation for a vow (Nadhr) is the same as the expiation for an oath.' [Reported by Muslim]. At-Tirmidhi added: 'If it is not specified,' and graded it Sahih. Abu Dawud reported from Ibn 'Abbas (RA) as Marfu': 'He who takes a vow which he did not specify, its expiation is that of an oath; and he who takes a vow to commit a sin, its expiation is that of an oath; and he who takes a vow which he is unable to fulfill, its expiation is that of an oath.' Its chain is Sahih, but scholars preferred it being Mauquf. Al-Bukhari reported from 'Aisha (RA): 'Whoever vows to disobey Allah, must not disobey Him.' Muslim reported from 'Imran (RA): 'There is no fulfillment of a vow to commit a sin.'"
      }
    },

    {
      "id": 1182,
      "name": {
        "arabic": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ ‏- رضى الله عنه ‏- قَالَ: { نَذَرَتْ أُخْتِي أَنْ تَمْشِيَ إِلَى بَيْتِ اَللَّهِ حَافِيَةً, فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏- \"لِتَمْشِ وَلْتَرْكَبْ\" } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ وَلِلْخَمْسَةِ. فَقَالَ: { \" إِنَّ اَللَّهَ لَا يَصْنَعُ بِشَقَاءِ أُخْتِكَ شَيْئاً, مُرْهَا: فَلْتَخْتَمِرْ , وَلْتَرْكَبْ, وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ\" }",
        "urdu": "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ میری بہن نے بیت اللہ تک ننگے پاؤں چل کر جانے کی نذر مانی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”وہ پیدل بھی چلے اور سوار بھی ہو جائے۔“ (متفق علیہ)۔ اور پانچوں (احمد، ابو داؤد، ترمذی، نسائی، ابن ماجہ) کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ تمہاری بہن کو مشقت میں ڈال کر کچھ حاصل نہیں کرے گا، اسے کہو کہ وہ دوپٹہ (چادر) اوڑھ لے، سوار ہو جائے اور (نذر کے کفارے میں) تین دن کے روزے رکھ لے۔“",
        "english": "Narrated ‘Uqbah bin ‘Amir (RA): My sister vowed to walk to the House of Allah (the Ka'bah) barefoot. The Prophet (SAW) said, \"Let her walk and let her ride.\" (Agreed upon). In the version of the five, he said, \"Allah gains nothing from your sister’s self-inflicted hardship. Order her to cover her head, to ride, and to fast for three days (as atonement).\""
      }
    },

    {
      "id": 1183,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { اِسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ ‏- رضى الله عنه ‏- رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي نَذْرٍ كَانَ عَلَى أُمِّهِ, تُوُفِّيَتْ قَبْلِ أَنْ تَقْضِيَهُ ? فَقَالَ: \"اِقْضِهِ عَنْهَا\" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ سیدنا سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس نذر کے متعلق پوچھا جو ان کی والدہ پر واجب تھی اور وہ اسے پوری کرنے سے پہلے ہی وفات پا گئی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تم ان کی طرف سے اسے پورا کر دو۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): Sa'd bin 'Ubadah (RA) asked Allah's Messenger (ﷺ) for a decision about a vow taken by his mother who had died before fulfilling it. He (ﷺ) said: 'Fulfill it on her behalf.' [Agreed upon]."
      }
    },

    {
      "id": 1184,
      "name": {
        "arabic": "وَعَنْ ثَابِتِ بْنِ اَلضَّحَّاكِ ‏- رضى الله عنه ‏- قَالَ: { نَذَرَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- أَنْ يَنْحَرَ إِبِلاً بِبُوَانَةَ، فَأَتَى رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- فَسَأَلَهُ: فَقَالَ: \"هَلْ كَانَ فِيهَا وَثَنٌ يُعْبَدُ؟\" .‏ قَالَ: لَا.‏ قَالَ: \"فَهَلْ كَانَ فِيهَا عِيدٌ مِنْ أَعْيَادِهِمْ؟\" فَقَالَ: لَا.‏ فَقَالَ: \"أَوْفِ بِنَذْرِكَ؛ فَإِنَّهُ لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اَللَّهِ، وَلَا فِي قَطِيعَةِ رَحِمٍ، وَلَا فِيمَا لَا يَمْلِكُ اِبْنُ آدَمَ\" } رَوَاهُ أَبُو دَاوُدَ، وَالطَّبَرَانِيُّ وَاللَّفْظُ لَهُ، وَهُوَ صَحِيحُ اَلْإِسْنَادِ.",
        "urdu": "سیدنا ثابت بن ضحاک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ایک آدمی نے بوانہ کے مقام پر اونٹ ذبح کرنے کی نذر مانی۔ وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور اس کے متعلق پوچھا، تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا: ”کیا اس جگہ کوئی بت تھا جس کی پوجا کی جاتی ہو؟“ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے پوچھا: ”کیا وہاں مشرکین کا کوئی میلہ لگتا تھا؟“ اس نے کہا: نہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اپنی نذر پوری کرو۔ حقیقت یہ ہے کہ اس نذر کا پورا کرنا جائز نہیں جس میں اللہ کی نافرمانی ہو، یا قطع رحمی (رشتہ داری توڑنا) ہو، یا وہ چیز ہو جو انسان کے بس میں نہ ہو۔“",
        "english": "Narrated Thabit bin ad-Dahhak (RA): During the time of the Messenger of Allah (SAW), a man vowed to slaughter camels at Buwanah. He came to the Messenger of Allah (SAW) and asked him. The Prophet (SAW) asked, \"Was there any idol there that was worshipped?\" He said, \"No.\" He asked, \"Was there any festival of theirs (disbelievers) celebrated there?\" He said, \"No.\" The Prophet (SAW) then said, \"Fulfill your vow, for a vow must not be fulfilled if it involves disobedience to Allah, or severing ties of kinship, or in something over which a human being has no control.\""
      }
    },

    {
      "id": 1185,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلاً قَالَ يَوْمَ اَلْفَتْحِ: يَا رَسُولَ اَللَّهِ! إِنِّي نَذَرْتُ إِنْ فَتَحَ اَللَّهُ عَلَيْكَ مَكَّةَ أَنْ أُصَلِّيَ فِي بَيْتِ اَلْمَقْدِسِ, فَقَالَ: \"صَلِّ هَا هُنَا\" .‏ فَسَأَلَهُ, فَقَالَ: \"صَلِّ هَا هُنَا\".‏ فَسَأَلَهُ, فَقَالَ: \"شَأْنُكَ إِذًا\" } رَوَاهُ أَحْمَدُ, أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ ایک شخص نے فتح مکہ کے روز عرض کیا: اے اللہ کے رسول! میں نے نذر مانی تھی کہ اگر اللہ نے آپ کے ہاتھوں مکہ فتح کر دیا تو میں بیت المقدس میں نماز پڑھوں گا۔ آپ ﷺ نے فرمایا: ”یہیں پڑھ لو۔“ اس نے پھر پوچھا تو آپ ﷺ نے فرمایا: ”یہیں پڑھ لو۔“ اس نے تیسری بار سوال کیا تو آپ ﷺ نے فرمایا: ”پھر تمہاری مرضی (یعنی اب چاہو تو بیت المقدس جا کر پڑھ لو)۔“",
        "english": "Narrated Jabir (RA): A man stood up on the day of the Conquest of Makkah and said, \"O Messenger of Allah, I vowed to Allah that if He granted you victory over Makkah, I would pray in Bait al-Maqdis (Jerusalem).\" He (ﷺ) said, \"Pray here.\" The man repeated the question, and he (ﷺ) said, \"Pray here.\" He repeated it again, and he (ﷺ) said, \"It is up to you then.\""
      }
    },

    {
      "id": 1186,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- قَالَ: { \"لَا تُشَدُّ اَلرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: مَسْجِدِ اَلْحَرَامِ, وَمَسْجِدِ اَلْأَقْصَى, وَمَسْجِدِي\" } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تین مساجد کے سوا اور کسی جگہ کے لیے (زیارت و ثواب کی خاطر) سفر نہ کیا جائے: مسجد حرام، مسجد اقصیٰ اور میری یہ مسجد (مسجد نبوی)۔“ (بخاری و مسلم) یہ الفاظ بخاری کے ہیں۔",
        "english": "Narrated Abu Sa'id al-Khudri (RA): The Prophet (SAW) said: \"Do not set out on a journey (for religious visiting) except to three mosques: Al-Masjid al-Haram, Al-Masjid al-Aqsa, and this mosque of mine (in Madinah).\" [Agreed upon; the wording is Al-Bukhari's]."
      }
    },

    {
      "id": 1187,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! إِنِّي نَذَرْتُ فِي اَلْجَاهِلِيَّةِ; أَنْ أَعْتَكِفَ لَيْلَةً فِي اَلْمَسْجِدِ اَلْحَرَامِ.‏ قَالَ: \"فَأَوْفِ بِنَذْرِكَ\" } مُتَّفَقٌ عَلَيْهِ وَزَادَ اَلْبُخَارِيُّ فِي رِوَايَةٍ { فَاعْتَكَفَ لَيْلَةً }",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے روایت ہے کہ میں نے عرض کیا اے اللہ کے رسول! میں نے جاہلیت کے زمانہ میں نذر مانی تھی کہ میں مسجد الحرام میں ایک رات اعتکاف کروں گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” پھر اپنی نذر کو پورا کرو۔“ (بخاری ومسلم) اور بخاری نے اپنی روایت میں اتنا اضافہ کیا ہے۔ پھر انہوں نے ایک رات اعتکاف کیا۔",
        "english": "Narrated 'Umar (RA): I said, \"O Messenger of Allah (ﷺ), I had vowed during the period of Ignorance (Jahiliyyah) to perform I'tikaf for one night in Al-Masjid-al-Haram.\" He (ﷺ) said, \"Fulfill your vow.\" [Agreed upon]. Al-Bukhari added in another narration: \"So he performed I'tikaf for a night.\""
      }
    }
  ]
}
