{
  "chapId": 36,
  "bookId": 6,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 579,
    "to": 589
  },
  "hadiths": [
    {
      "id": 579,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْعُمْرَةُ إِلَى اَلْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا, وَالْحَجُّ اَلْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلَّا اَلْجَنَّةَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک عمرہ کے بعد دوسرا عمرہ ان دونوں کے درمیان کے گناہوں کا کفارہ ہے، اور حج مبرور کا بدلہ جنت کے سوا کچھ نہیں۔‏‏‏‏“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"(The performance of) 'Umrah is an expiation for the sins committed between it and the previous 'Umrah; and the reward of Hajj Mabrur (i.e., one accepted by Allah) is nothing but Paradise.\""
      }
    },

    {
      "id": 580,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! عَلَى اَلنِّسَاءِ جِهَادٌ ? قَالَ: \" نَعَمْ, عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ: اَلْحَجُّ, وَالْعُمْرَةُ \" } رَوَاهُ أَحْمَدُ, وَابْنُ مَاجَهْ وَاللَّفْظُ لَهُ, وَإِسْنَادُهُ صَحِيحٌ وَأَصْلُهُ فِي اَلصَّحِيحِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ میں نے عرض کیا، اے اللہ کے رسول! کیا عورتوں پر جہاد ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں! ان پر وہ جہاد ہے جس میں لڑائی نہیں (یعنی) حج اور عمرہ۔“ اسے احمد اور ابن ماجہ نے روایت کیا ہے اور یہ الفاظ ابن ماجہ کے ہیں۔ اس کی سند صحیح ہے اور اس کی اصل بخاری میں ہے۔",
        "english": "Narrated 'Aishah (RA): I said, 'O Messenger of Allah (ﷺ)! Is Jihad incumbent upon women?' He replied, 'Yes, Jihad which does not include fighting is incumbent upon them. It is the Hajj and the 'Umrah.' [Reported by Ahmad and Ibn Majah; the wording is Ibn Majah's. Its chain of narrators is Sahih, and its origin is in the Sahih (Bukhari)]."
      }
    },

    {
      "id": 581,
      "name": {
        "arabic": " وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَعْرَابِيٌّ.‏ فَقَالَ: يَا رَسُولَ اَللَّهِ! أَخْبِرْنِي عَنْ اَلْعُمْرَةِ, أَوَاجِبَةٌ هِيَ? فَقَالَ: \" لَا.‏ وَأَنْ تَعْتَمِرَ خَيْرٌ لَكَ \" } رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ, وَالرَّاجِحُ وَقْفُهُ وَأَخْرَجَهُ اِبْنُ عَدِيٍّ مِنْ وَجْهٍ آخَرَ ضَعِيفٍ عَنْ جَابِرٍ مَرْفُوعًا: { اَلْحَجُّ وَالْعُمْرَةُ فَرِيضَتَانِ }",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک بدوی حاضر ہوا تو اس نے کہا، اے اللہ کے رسول! مجھے عمرہ کے بارے بتلائیے کہ کیا یہ واجب ہے؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں (واجب نہیں)، لیکن اگر تو عمرہ کرے تو یہ تمہارے لئے بہتر ہے۔“ اسے احمد و ترمذی نے روایت کیا ہے اور اس کا موقوف ہونا راجح ہے اور امام ابن عدی نے ایک اور ضعیف سند سے سیدنا جابر رضی اللہ عنہ سے مرفوعاً روایت کیا ہے کہ ”حج اور عمرہ دونوں فرض ہیں۔“",
        "english": "Narrated Jabir bin 'Abdullah (RA): A desert Arab came to the Prophet (ﷺ) and said, 'O Messenger of Allah! Tell me about 'Umrah, is it obligatory?' He (ﷺ) replied, 'No, but to perform 'Umrah is better for you.' [Reported by Ahmad and At-Tirmidhi; the more correct view is that it is Mauquf. Ibn 'Adi reported it through another weak chain as Marfu': 'Hajj and 'Umrah are two obligations']."
      }
    },

    {
      "id": 582,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ رضى الله عنه قَالَ: { قِيلَ يَا رَسُولَ اَللَّهِ, مَا اَلسَّبِيلُ? قَالَ: \" اَلزَّادُ وَالرَّاحِلَةُ \" } رَوَاهُ اَلدَّارَقُطْنِيُّ وَصَحَّحَهُ اَلْحَاكِمُ, وَالرَّاجِحُ إِرْسَالُهُ وَأَخْرَجَهُ اَلتِّرْمِذِيُّ مِنْ حَدِيثِ اِبْنِ عُمَرَ أَيْضًا, وَفِي إِسْنَادِهِ ضَعْفٌ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ عرض کیا گیا یا رسول اللہ! ”سبیل“ سے کیا مراد ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”راستے کا خرچ اور سواری۔“ اسے دارقطنی نے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے مگر راجح اس کا مرسل ہونا ہے اور ترمذی نے اسے ابن عمر رضی اللہ عنہما کی حدیث سے روایت کیا ہے اور اس کی سند میں کمزوری ہے۔",
        "english": "Narrated Anas (RA): It was said, 'O Messenger of Allah (ﷺ), what does 'as-Sabil' (the way) mean (in the Quranic verse regarding Hajj)?' He replied, 'Provisions and a means of transport.' [Reported by ad-Daraqutni and graded Sahih by al-Hakim, but the preferred view is that it is Mursal. At-Tirmidhi also reported it from Ibn 'Umar with a weak chain]."
      }
    },

    {
      "id": 583,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-لَقِيَ رَكْبًا بِالرَّوْحَاءِ فَقَالَ: \" مَنِ اَلْقَوْمُ? \" قَالُوا: اَلْمُسْلِمُونَ.‏ فَقَالُوا: مَنْ أَنْتَ? قَالَ: \" رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" فَرَفَعَتْ إِلَيْهِ اِمْرَأَةٌ صَبِيًّا.‏ فَقالتْ: أَلِهَذَا حَجٌّ? قَالَ: \" نَعَمْ: وَلَكِ أَجْرٌ \" } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم روحاء مقام پر کچھ سواروں سے ملے تو آپ صلی اللہ علیہ وسلم نے فرمایا ” تم کون ہو؟“ تو انہوں نے عرض کیا، ہم مسلمان ہیں۔ پھر انہوں نے پوچھا آپ کون ہیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ کا رسول ہوں“ پھر آپ صلی اللہ علیہ وسلم کی خدمت میں ایک عورت اپنے بچے کو اٹھا کر لائی اور پوچھا کیا اس کا حج ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں! اس کا ثواب تجھے ملے گا۔“ (مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) met some riders at ar-Rauha and asked, \"Who are these people?\" They replied, \"Muslims.\" They then asked, \"Who are you?\" He said, \"The Messenger of Allah.\" A woman lifted up a child to him and asked, \"Is there Hajj for this one?\" He replied, \"Yes, and you will have a reward.\""
      }
    },

    {
      "id": 584,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { كَانَ اَلْفَضْلُ بْنُ عَبَّاسٍ رَدِيفَ رَسُولِ اَللَّهِ صلى الله عليه وسلم . فَجَاءَتِ اِمْرَأَةٌ مَنْ خَثْعَمَ، فَجَعَلَ اَلْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ، وَجَعَلَ اَلنَّبِيُّ صلى الله عليه وسلم يَصْرِفُ وَجْهَ اَلْفَضْلِ إِلَى اَلشِّقِّ اَلْآخَرِ. فَقَالَتْ: يَا رَسُولَ اَللَّهِ, إِنَّ فَرِيضَةَ اَللَّهِ عَلَى عِبَادِهِ فِي اَلْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا, لَا يَثْبُتُ عَلَى اَلرَّاحِلَةِ, أَفَأَحُجُّ عَنْهُ? قَالَ: \" نَعَمْ \" وَذَلِكَ فِي حَجَّةِ اَلْوَدَاعِ } مُتَّفَقٌ عَلَيْهِ, وَاللَفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے ہی روایت ہے کہ فضل بن عباس رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم کے پیچھے سوار تھے کہ قبیلہ خشعم کی ایک عورت آئی تو فضل رضی اللہ عنہ اس کی طرف دیکھنے لگے اور وہ ان کی طرف دیکھنے لگی اور نبی کریم صلی اللہ علیہ وسلم ، فضل رضی اللہ عنہ کا منہ دوسری جانب پھیرتے تھے۔ پس اس عورت نے کہا، اے اللہ کے رسول! بیشک حج، اللہ کا فرض ہے اس کے بندوں پر۔ میرا باپ بڑی عمر والا بوڑھا ہے۔ وہ سواری پر بیٹھ نہیں سکتا کیا میں اس کی طرف سے حج کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں! اور یہ حجۃ الوداع کا واقعہ ہے۔“ (بخاری و مسلم) اور یہ الفاظ بخاری کے ہیں۔",
        "english": "Narrated Ibn 'Abbas (RA): Al-Fadl bin 'Abbas was riding behind Allah's Messenger (ﷺ) when a woman from the tribe of Khath'am came. Al-Fadl started looking at her and she at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, 'O Allah's Messenger! Allah's obligation of Hajj upon His servants has come when my father is a very old man and cannot sit steadily on a mount. May I perform Hajj on his behalf?' He replied, 'Yes.' This happened during the Farewell Pilgrimage. [Agreed upon; wording is Al-Bukhari's]."
      }
    },

    {
      "id": 585,
      "name": {
        "arabic": " وَعَنْهُ: { أَنَّ اِمْرَأَةً مِنْ جُهَيْنَةَ جَاءَتْ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَتْ: إِنَّ أُمِّي نَذَرَتْ أَنْ تَحُجَّ, فَلَمْ تَحُجَّ حَتَّى مَاتَتْ, أَفَأَحُجُّ عَنْهَا? قَالَ: \" نَعَمْ \", حُجِّي عَنْهَا, أَرَأَيْتِ لَوْ كَانَ عَلَى أُمِّكِ دَيْنٌ, أَكُنْتِ قَاضِيَتَهُ? اِقْضُوا اَللَّهَ, فَاَللَّهُ أَحَقُّ بِالْوَفَاءِ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے ہی مروی ہے کہ قبیلہ جھینہ کی ایک عورت نبی کریم صلی اللہ علیہ وسلم کے پاس آئی اور عرض کیا، بیشک میری ماں نے حج کرنے کی منت مانی تھی لیکن وہ حج نہیں کر سکی، اور فوت ہو گئی ہے کیا میں اس کی طرف سے حج کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ” ہاں! اس کی طرف سے حج کر، اگر تیری ماں کے ذمہ ادھار ہوتا تو کیا تم وہ قرض نہ اتارتی؟ اللہ کا حق پورا کرو کیونکہ اللہ زیادہ حقدار ہے کہ اس کا حق پورا کیا جائے۔ “ (بخاری)",
        "english": "Narrated Ibn 'Abbas (RA): A woman from the tribe of Juhainah came to the Prophet (ﷺ) and said, \"My mother had vowed to perform Hajj, but she died before performing it. Should I perform Hajj on her behalf?\" He (ﷺ) replied, \"Yes, perform Hajj on her behalf. Had there been a debt against your mother, would you not have paid it? Fulfill Allah's right, for Allah is more deserving that His right should be fulfilled.\""
      }
    },

    {
      "id": 586,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم { أَيُّمَا صَبِيٍّ حَجَّ, ثُمَّ بَلَغَ اَلْحِنْثَ, فَعَلَيْهِ أَنْ يَحُجَّ حَجَّةً أُخْرَى, وَأَيُّمَا عَبْدٍ حَجَّ, ثُمَّ أُعْتِقَ, فَعَلَيْهِ أَنْ يَحُجَّ حَجَّةً أُخْرَى } رَوَاهُ اِبْنُ أَبِي شَيْبَةَ, وَالْبَيْهَقِيُّ وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّهُ اِخْتُلِفَ فِي رَفْعِهِ, وَالْمَحْفُوظُ أَنَّهُ مَوْقُوفٌ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو بچہ حج کرے پھر وہ بلوغت کو پہنچ جائے تو اس پر ضروری ہے کہ دوسرا حج کرے اور جو غلام حج کرے پھر آزاد کر دیا جائے تو اس پر لازم ہے کہ دوسرا حج کرے۔“ اسے ابن ابی شیبہ اور بیہقی نے روایت کیا ہے اس کے راوی ثقہ ہیں مگر اس کے مرفوع ہونے میں اختلاف کیا گیا ہے اور محفوظ یہ ہے کہ یہ حدیث موقوف ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) said: 'Any boy who performs Hajj and then reaches the age of puberty, must perform Hajj again; and any slave who performs Hajj and then is emancipated, must perform Hajj again.' [Reported by Ibn Abi Shaiba and al-Baihaqi. Its narrators are reliable, but there is a difference of opinion as to whether it is Marfu' or Mauquf; the preserved view is that it is Mauquf]."
      }
    },

    {
      "id": 587,
      "name": {
        "arabic": " وَعَنْهُ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَخْطُبُ يَقُولُ: { \" لَا يَخْلُوَنَّ رَجُلٌ بِاِمْرَأَةٍ إِلَّا وَمَعَهَا ذُو مَحْرَمٍ, وَلَا تُسَافِرُ اَلْمَرْأَةُ إِلَّا مَعَ ذِي مَحْرَمٍ \" فَقَامَ رَجُلٌ, فَقَالَ: يَا رَسُولَ اَللَّهِ, إِنَّ اِمْرَأَتِي خَرَجَتْ حَاجَّةً, وَإِنِّي اِكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا, قَالَ: \" اِنْطَلِقْ, فَحُجَّ مَعَ اِمْرَأَتِكَ \" } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ ",
        "urdu": "سیدنا عبداللہ بن عباس رضی اللہ عنہما فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو خطبہ میں یہ ارشاد فرماتے سنا کہ ” کوئی مرد کسی عورت کے ساتھ ہرگز اکیلا نہ ہو مگر اس کے ساتھ محرم ہو اور کوئی عورت محرم کے بغیر سفر نہ کرے۔ “ پس ایک آدمی کھڑا ہوا تو اس نے کہا اے اللہ کے رسول! بیشک میری عورت حج کے لئے روانہ ہوئی اور میرا نام فلاں فلاں غزوہ میں شامل ہونے کیلئے لکھا گیا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” جاؤ اپنی بیوی کے ہمراہ حج کرو۔ “ (بخاری و مسلم) یہ الفاظ مسلم کے ہیں۔",
        "english": "Narrated Ibn 'Abbas (RA): I heard the Messenger of Allah (ﷺ) delivering a sermon and saying, \"No man should stay with a lady alone except in the presence of a Mahram, and no woman should travel except with a Mahram.\" A man stood up and said, \"O Messenger of Allah! My wife has set out for Hajj and I have been enlisted for such and such a battle.\" He (ﷺ) said, \"Go and perform Hajj with your wife.\" [Agreed upon, and the wording is Muslim's]."
      }
    },

    {
      "id": 588,
      "name": {
        "arabic": "وَعَنْهُ: { أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم سَمِعَ رَجُلًا يَقُولُ: لَبَّيْكَ عَنْ شُبْرُمَةَ, قَالَ: \" مَنْ شُبْرُمَةُ? \" قَالَ: أَخٌ لِي, أَوْ قَرِيبٌ لِي, قَالَ: \" حَجَجْتَ عَنْ نَفْسِكَ? \" قَالَ: لَا. قَالَ: \"حُجَّ عَنْ نَفْسِكَ, ثُمَّ حُجَّ عَنْ شُبْرُمَةَ \" } رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالرَّاجِحُ عِنْدَ أَحْمَدَ وَقْفُهُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی کو کہتے سنا ”شبرمہ کی طرف سے لبیک“ آپ صلی اللہ علیہ وسلم نے فرمایا ”شبرمہ کون ہے؟“ اس کہا کہ وہ میرا بھائی ہے یا قریبی ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا ”تو نے اپنی طرف سے حج کیا ہے؟“ اس نے کہا ”نہیں۔“ آپ صلی اللہ علیہ وسلم نے فرمایا ”پہلے اپنی طرف سے کر پھر شبرمہ کی طرف سے کر لینا۔“ اسے ابوداؤد اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے اور امام احمد کے نزدیک اس کا موقوف ہونا راجح ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) heard a man saying, 'Labbayk (at your service) on behalf of Shubrumah.' He asked, 'Who is Shubrumah?' The man replied, 'A brother of mine' or 'a relative of mine.' The Prophet (ﷺ) asked, 'Have you performed Hajj for yourself?' He replied, 'No.' The Prophet (ﷺ) said, 'Perform Hajj for yourself first, then perform Hajj on behalf of Shubrumah.' [Reported by Abu Dawud and Ibn Majah; Ibn Hibban graded it Sahih, but Ahmad considered it to be Mauquf]."
      }
    },

    {
      "id": 589,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: خَطَبَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ: { \" إِنَّ اَللَّهَ كَتَبَ عَلَيْكُمُ اَلْحَجَّ \" فَقَامَ اَلْأَقْرَعُ بْنُ حَابِسٍ فَقَالَ: أَفِي كَلِّ عَامٍ يَا رَسُولَ اَللَّهِ? قَالَ: \" لَوْ قُلْتُهَا لَوَجَبَتْ, اَلْحَجُّ مَرَّةٌ, فَمَا زَادَ فَهُوَ تَطَوُّعٌ \" } رَوَاهُ اَلْخَمْسَةُ, غَيْرَ اَلتِّرْمِذِيِّ  وَأَصْلُهُ فِي مُسْلِمٍ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما ہی فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خطبہ دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا ”بیشک اللہ تعالیٰ نے تم پر حج فرض کیا ہے۔“ اس پر اقرع بن حابس کھڑے ہوئے اور انہوں نے عرض کیا ”کیا ہر سال، اے اللہ کے رسول!؟“ آپ صلی اللہ علیہ وسلم نے فرمایا ”اگر میں ہاں کہ دیتا تو یہ (ہر سال کے لیے) فرض ہو جاتا۔ حج (زندگی میں) ایک بار ہے اور اس سے جو زائد ہے وہ نفل ہے۔“ اسے ترمذی کے علاوہ پانچوں نے روایت کیا ہے اور اس کی اصل مسلم میں ابوہریرہ رضی اللہ عنہ کی روایت ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): Allah's Messenger (ﷺ) delivered a sermon and said: \"Allah has ordained Hajj upon you.\" Al-Aqra' bin Habis stood up and asked: \"Is it every year, O Messenger of Allah?\" He (ﷺ) replied: \"If I had said yes, it would have become obligatory (every year). Hajj is only once (in a lifetime), and whatever is beyond that is a voluntary act.\""
      }
    }
  ]
}
