{
  "chapId": 22,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 354,
    "to": 378
  },
  "hadiths": [
    {
      "id": 354,
      "name": {
        "arabic": "عَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ، وَأَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُمْ، أَنَّهُمَا سَمِعَا رَسُولَ اَللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى أَعْوَادِ مِنْبَرِهِ: لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمُ اَلْجُمُعَاتِ، أَوْ لَيَخْتِمَنَّ اَللَّهُ عَلَى قُلُوبِهِمْ، ثُمَّ لَيَكُونُنَّ مِنَ اَلْغَافِلِينَ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما اور سیدنا ابوہریرہ رضی اللہ عنہ (دونوں) سے مروی ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر کی سیڑھیوں پر یہ فرماتے سنا ہے کہ ”لوگ نماز جمعہ چھوڑنے سے باز آ جائیں ورنہ اللہ تعالیٰ ان کے دلوں پر مہر لگا دے گا پھر وہ لازماً غافل لوگوں میں شمار ہوں گے۔“",
        "english": "It was narrated from 'Abdullah bin 'Umar and Abu Hurairah that they heard the Messenger of Allah (ﷺ) say, while standing on the wooden steps of his pulpit: 'People must cease neglecting the Friday prayer, or else Allah will seal their hearts and they will be among the heedless.'"
      }
    },

    {
      "id": 355,
      "name": {
        "arabic": "وَعَنْ سَلَمَةَ بْنِ اَلْأَكْوَعِ ‏- رضى الله عنه ‏- قَالَ: { كُنَّا نُصَلِّي مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلْجُمُعَةَ, ثُمَّ نَنْصَرِفُ وَلَيْسَ لِلْحِيطَانِ ظِلٌّ نَسْتَظِلُّ بِهِ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيّ ِ  وَفِي لَفْظٍ لِمُسْلِمٍ: { كُنَّا نَجْمَعُ مَعَهُ إِذَا زَالَتِ اَلشَّمْسُ, ثُمَّ نَرْجِعُ, نَتَتَبَّعُ اَلْفَيْءَ } ",
        "urdu": "سیدنا سلمہ بن اکوع رضی اللہ عنہ سے مروی ہے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ ادا کرتے تھے۔ جمعہ سے فارغ ہو کر جب ہم اپنے گھروں کو واپس مڑتے تو اس وقت دیواروں کا اتنا سایہ نہیں ہوتا تھا کہ جس سے سایہ حاصل کیا جا سکے۔ (بخاری و مسلم) یہ الفاظ بخاری کے ہیں، اور مسلم کے ایک لفظ میں ہے کہ: ”ہم آپ ﷺ کے ساتھ جمعہ پڑھتے تھے جب سورج ڈھل جاتا (زوال ہو جاتا)، پھر ہم واپس ہوتے تو (راستے میں) دیواروں کے سائے تلاش کرتے۔“",
        "english": "Narrated Salamah bin al-Akwa' (RAA): 'We used to pray the Friday prayer with the Messenger of Allah (ﷺ), then we would leave, and the walls had no shade in which we could take shelter (from the sun).' [Agreed upon, and the version is that of al-Bukhari]. In a version by Muslim: 'We used to pray Friday prayer with him when the sun passed the meridian (Zawal), then we would return and follow the shadows (for shade).'"
      }
    },

    {
      "id": 356,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: مَا كُنَّا نَقِيلُ وَلَا نَتَغَدَّى إِلَّا بَعْدَ اَلْجُمُعَةِ. مُتَّفَقٌ عَلَيْهِ، وَاللَّفْظُ لِمُسْلِمٍ. وَفِي رِوَايَةٍ: فِي عَهْدِ رَسُولِ اَللَّهِ صلى الله عليه وسلم.",
        "urdu": "سیدنا سہل بن سعد رضی اللہ عنہ سے مروی ہے کہ (جمعہ کے روز) ہم دوپہر کا قیلولہ اور کھانا نماز جمعہ کے بعد کرتے تھے۔ (بخاری و مسلم) متن حدیث کے الفاظ مسلم کے ہیں اور ایک روایت میں ہے ”یہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں تھا۔“",
        "english": "Narrated Sahl bin Sa'd (RA): We used to neither take a midday nap nor have lunch until after the Friday prayer. (Agreed upon, and the wording is Muslim's). In another narration: (This was) during the lifetime of the Messenger of Allah (ﷺ)."
      }
    },

    {
      "id": 357,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَخْطُبُ قَائِمًا, فَجَاءَتْ عِيرٌ مِنَ اَلشَّامِ, فَانْفَتَلَ اَلنَّاسُ إِلَيْهَا, حَتَّى لَمْ يَبْقَ إِلَّا اثْنَا عَشَرَ رَجُلًا } رَوَاهُ مُسْلِمٌ .‏",
        "urdu": "سیدنا جابر رضی اللہ عنہ کا بیان ہے کہ نبی کریم صلی اللہ علیہ وسلم جمعہ کا خطبہ کھڑے ہو کر ارشاد فرمایا کرتے تھے کہ (ایک مرتبہ دورانِ خطبہ) شام سے ایک تجارتی قافلہ آ گیا۔ لوگ (خطبہ چھوڑ کر) اس قافلہ کی طرف دوڑ پڑے، یہاں تک کہ صرف بارہ آدمی باقی رہ گئے۔ (مسلم)",
        "english": "Narrated Jabir (RAA): 'The Prophet (ﷺ) used to deliver the Friday sermon while standing. A caravan (of merchandise) then arrived from Syria and the people rushed towards it until only twelve men remained with the Prophet (ﷺ).' [Reported by Muslim]."
      }
    },

    {
      "id": 358,
      "name": {
        "arabic": " وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلَاةِ اَلْجُمُعَةِ وَغَيْرِهَا فَلْيُضِفْ إِلَيْهَا أُخْرَى, وَقَدْ تَمَّتْ صَلَاتُهُ } رَوَاهُ النَّسَائِيُّ, وَابْنُ مَاجَهْ, وَاَلدَّارَقُطْنِيُّ, وَاللَّفْظُ لَهُ, وَإِسْنَادُهُ صَحِيحٌ, لَكِنْ قَوَّى أَبُو حَاتِمٍ إِرْسَالَهُ .‏",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے نماز جمعہ اور دیگر نمازوں میں سے کسی کی ایک رکعت (جماعت کے ساتھ) پا لی تو وہ دوسری اس کے ساتھ ملا لے۔ تو بس اس کی نماز پوری ہو گئی۔“ اسے نسائی، ابن ماجہ اور دارقطنی نے روایت کیا ہے۔ یہ الفاظ دارقطنی کے ہیں۔ اس کی سند صحیح ہے لیکن ابوحاتم نے اس کے مرسل ہونے کو قوی قرار دیا ہے۔",
        "english": "Narrated Ibn 'Umar: The Messenger of Allah (ﷺ) said: 'Whoever catches one Rak'ah of the Friday prayer or any other prayer, let him add another one to it, and his prayer will be complete.' Reported by an-Nasa'i, Ibn Majah and ad-Daraqutni, and the wording is of the latter. Its chain is Sahih, but Abu Hatim strengthened the view that it is Mursal."
      }
    },

    {
      "id": 359,
      "name": {
        "arabic": " وَعَنْ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اَللَّهُ عَنْهُمَا, { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَخْطُبُ قَائِمًا, ثُمَّ يَجْلِسُ, ثُمَّ يَقُومُ فَيَخْطُبُ قَائِمًا, فَمَنْ أَنْبَأَكَ أَنَّهُ كَانَ يَخْطُبُ جَالِسًا, فَقَدْ كَذَبَ } أَخْرَجَهُ مُسْلِمٌ ",
        "urdu": "سیدنا جابر بن سمرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہو کر خطبہ جمعہ ارشاد فرماتے۔ پھر درمیان میں تھوڑا سا بیٹھ جاتے اور پھر کھڑے ہو کر خطاب فرماتے۔ پس جس کسی نے تمہیں یہ اطلاع دی کہ آپ صلی اللہ علیہ وسلم بیٹھ کر خطبہ ارشاد فرماتے تھے، اس نے جھوٹ بولا۔",
        "english": "Narrated Jabir bin Samurah: The Prophet (ﷺ) used to deliver the Khutbah (sermon) standing, then he would sit, then stand and deliver the Khutbah standing. So whoever tells you that he delivered the Khutbah sitting has lied. [Reported by Muslim]."
      }
    },

    {
      "id": 360,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: كَانَ رَسُولُ اَللَّهِ صلى الله عليه وسلم إِذَا خَطَبَ، احْمَرَّتْ عَيْنَاهُ، وَعَلَا صَوْتُهُ، وَاشْتَدَّ غَضَبُهُ، حَتَّى كَأَنَّهُ مُنْذِرُ جَيْشٍ يَقُولُ: صَبَّحَكُمْ وَمَسَّاكُمْ، وَيَقُولُ: أَمَّا بَعْدُ، فَإِنَّ خَيْرَ اَلْحَدِيثِ كِتَابُ اَللَّهِ، وَخَيْرَ اَلْهَدْيِ هَدْيُ مُحَمَّدٍ، وَشَرَّ اَلْأُمُورِ مُحْدَثَاتُهَا، وَكُلَّ بِدْعَةٍ ضَلَالَةٌ. رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةٍ لَهُ كَانَتْ خُطْبَةُ اَلنَّبِيِّ صلى الله عليه وسلم يَوْمَ اَلْجُمُعَةِ: يَحْمَدُ اَللَّهَ وَيُثْنِي عَلَيْهِ، ثُمَّ يَقُولُ عَلَى إِثْرِ ذَلِكَ، وَقَدْ عَلَا صَوْتُهُ. وَفِي رِوَايَةٍ لَهُ: مَنْ يَهْدِهِ اَللَّهُ فَلَا مُضِلَّ لَهُ، وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ. وَلِلنَّسَائِيِّ: وَكُلَّ ضَلَالَةٍ فِي اَلنَّارِ.",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب خطبہ ارشاد فرماتے تو رخ انور سرخ ہو جاتا۔ آواز بلند ہو جاتی اور جوش بڑھ جاتا جیسے کسی لشکر کو ڈرا رہے ہوں کہ دشمن تم پر صبح یا شام حملہ کرنے والا ہے۔ آپ فرماتے: اما بعد! بہترین بات اللہ کی کتاب ہے، بہترین طریقہ محمد ﷺ کا طریقہ ہے، بدترین کام دین میں نئی چیزیں (بدعت) نکالنا ہے اور ہر بدعت گمراہی ہے۔ (مسلم) نسائی کی روایت میں ہے: اور ہر گمراہی آگ میں لے جانے والی ہے۔",
        "english": "Narrated Jabir bin 'Abdullah (RA): When the Messenger of Allah (ﷺ) delivered a sermon, his eyes would become red, his voice rose, and his anger intensified as if he were warning an army, saying, 'The enemy has made a morning attack on you and an evening attack on you.' He would say, 'The best speech is the Book of Allah, and the best guidance is the guidance of Muhammad (ﷺ). The worst of matters are those newly introduced (in religion), and every innovation is a misguidance.' (Reported by Muslim). In a version by An-Nasa'i: 'And every misguidance is in the Fire.'"
      }
    },

    {
      "id": 361,
      "name": {
        "arabic": " وَعَنْ عَمَّارِ بْنِ يَاسِرٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِنَّ طُولَ صَلَاةِ اَلرَّجُلِ, وَقِصَرَ خُطْبَتِهِ مَئِنَّةٌ مِنْ فِقْهِهِ } رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا عمار بن یاسر رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے ”آدمی کی لمبی نماز اور اس کا مختصر خطبہ اس کی فقاہت کی نشانی ہے۔“",
        "english": "Narrated 'Ammar bin Yasir: I heard the Messenger of Allah (ﷺ) saying: 'The length of a man's prayer and the shortness of his Khutbah (sermon) are a sign of his understanding (of the religion).'"
      }
    },

    {
      "id": 362,
      "name": {
        "arabic": "وَعَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { مَا أَخَذْتُ: 'ق وَالْقُرْآنِ اَلْمَجِيدِ'' إِلَّا عَنْ لِسَانِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقْرَؤُهَا كُلَّ جُمُعَةٍ عَلَى اَلْمِنْبَرِ إِذَا خَطَبَ اَلنَّاسَ } رَوَاهُ مُسْلِمٌ .‏  ",
        "urdu": "سیدہ ام ہشام بنت حارثہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے سورۃ «ق والقرآن المجيد» لسان مآب صلی اللہ علیہ وسلم سے سن کر ازبر (یاد) کر لی۔ آپ صلی اللہ علیہ وسلم ہر جمعہ اس سورۃ کو منبر پر کھڑے ہو کر خطبہ جمعہ میں تلاوت فرماتے تھے۔ (مسلم)  ",
        "english": " "
      }
    },

    {
      "id": 363,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَكَلَّمَ يَوْمَ اَلْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَهُوَ كَمَثَلِ اَلْحِمَارِ يَحْمِلُ أَسْفَارًا, وَاَلَّذِي يَقُولُ لَهُ: أَنْصِتْ, لَيْسَتْ لَهُ جُمُعَةٌ } رَوَاهُ أَحْمَدُ, بِإِسْنَادٍ لَا بَأْسَ بِهِ .‏ وَهُوَ يُفَسِّرُ حَدِيثَ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- فِي اَلصَّحِيحَيْنِ مَرْفُوعًا: { إِذَا قُلْتَ لِصَاحِبِكَ: أَنْصِتْ يَوْمَ اَلْجُمُعَةِ وَالْإِمَامِ يَخْطُبُ, فَقَدْ لَغَوْتَ }",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس شخص نے جمعہ کے روز اس وقت بات کی جب امام منبر پر خطبہ جمعہ دے رہا ہو تو وہ شخص اس گدھے کی طرح ہے جو کتابوں کا بوجھ اٹھائے ہوئے ہے، اور اس کا بھی جمعہ نہیں جس نے اسے کہا کہ خاموش رہ۔“ اسے احمد نے ایسی سند سے روایت کیا جس کے متعلق، «لا بأس به» کہا گیا ہے۔ اور یہ سیدنا ابوہریرہ رضی اللہ عنہ سے صحیحین میں مروی حدیث کی تفسیر ہے ”جب امام خطبہ دے رہا ہو اور تو نے اپنے ساتھی سے کہا کہ چپ رہ تو تو نے بھی لغو بات کی۔“",
        "english": "Narrated Ibn 'Abbas: The Messenger of Allah (ﷺ) said: 'He who speaks on Friday while the Imam is delivering the sermon is like a donkey which carries books; and he who tells him to be quiet will have no reward for the Jumu'ah prayer.' Reported by Ahmad with a fair chain. This explains the Hadith of Abu Hurayrah in the Sahihayn: 'If you say to your companion, \"Listen quietly\" on Friday while the Imam is delivering the sermon, you have engaged in idle talk.'"
      }
    },

    {
      "id": 364,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ قَالَ: { دَخَلَ رَجُلٌ يَوْمَ اَلْجُمُعَةِ, وَالنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَخْطُبُ .‏ فَقَالَ: \"صَلَّيْتَ?\" قَالَ: لَا.‏ قَالَ: \"قُمْ فَصَلِّ رَكْعَتَيْنِ\" } مُتَّفَقٌ عَلَيْهِ .‏ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ کا بیان ہے کہ جمعہ کے روز ایک آدمی مسجد میں داخل ہوا۔ اس وقت نبی کریم صلی اللہ علیہ وسلم خطبہ ارشاد فرما رہے تھے۔ آپ صلی اللہ علیہ وسلم نے آنے والے سے دریافت فرمایا ”نماز (تحیۃ المسجد) پڑھی ہے؟“ وہ بولا ”نہیں!“ آپ صلی اللہ علیہ وسلم نے فرمایا ”تو اٹھو اور دو رکعت نماز ادا کر۔“ (بخاری ومسلم)",
        "english": "Narrated Jabir: A man entered the Mosque on a Friday while the Prophet (ﷺ) was delivering the sermon. He asked, \"Have you prayed?\" The man replied, \"No.\" He (ﷺ) said, \"Stand up and pray two Rak'ahs.\""
      }
    },

    {
      "id": 365,
      "name": {
        "arabic": "وَعَنِ ابْنِ عَبَّاسٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ سُورَةَ الْجُمُعَةِ, وَالْمُنَافِقِينَ } رَوَاهُ مُسْلِمٌ، وَلَهُ عَنِ اَلنُّعْمَانِ بْنِ بَشِيرٍ: { كَانَ يَقْرَأُ فِي اَلْعِيدَيْنِ وَفِي الْجُمُعَةِ: بِـ \"سَبِّحِ اسْمَ رَبِّكَ اَلْأَعْلَى\", وَ: \"هَلْ أَتَاكَ حَدِيثُ اَلْغَاشِيَةِ\" }",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم عموماً جمعہ کی نماز میں سورۃ «الجمعة» اور سورۃ «المنافقين» پڑھا کرتے تھے۔ (مسلم) اور مسلم ہی کی روایت میں ہے جس کے راوی نعمان بن بشیر رضی اللہ عنہ ہیں کہ آپ صلی اللہ علیہ وسلم نماز عیدین اور جمعہ کی نماز میں «سبح اسم ربك الأعلى» (سورۃ «الأعلى») اور «هل أتاك حديث الغاشية» (سورۃ «الغاشية») پڑھتے تھے۔",
        "english": "Narrated Ibn 'Abbas: The Prophet (ﷺ) used to recite in the Jumu'ah prayer: Surah Al-Jumu'ah and Surah Al-Munafiqun. [Reported by Muslim]. In another narration by Muslim from An-Nu'man bin Bashir: He used to recite in the two 'Eid prayers and the Jumu'ah prayer: \"Glorify the Name of your Lord, the Most High\" (Surah Al-A'la) and \"Has there come to you the narration of the Overwhelming?\" (Surah Al-Ghashiyah)."
      }
    },

    {
      "id": 366,
      "name": {
        "arabic": "وَعَنْ زَيْدِ بْنِ أَرْقَمَ ‏- رضى الله عنه ‏- قَالَ: { صَلَّى النَّبِيُّ ‏- صلى الله عليه وسلم ‏-اَلْعِيدَ, ثُمَّ رَخَّصَ فِي الْجُمُعَةِ, فَقَالَ: \"مَنْ شَاءَ أَنْ يُصَلِّيَ فَلْيُصَلِّ\" } رَوَاهُ اَلْخَمْسَةُ إِلَّا اَلتِّرْمِذِيَّ، وَصَحَّحَهُ ابْنُ خُزَيْمَة َ",
        "urdu": "سیدنا زید بن ارقم رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے نماز عید پڑھی اور جمعہ کے بارے میں رخصت دے دی اور فرمایا ”جو پڑھنا چاہے پڑھ لے۔“ اسے پانچوں یعنی احمد، ابوداؤد، نسائی، اور ابن ماجہ نے روایت کیا ہے۔ بجز ترمذی کے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Zaid bin Arqam (RA): The Prophet (ﷺ) performed the 'Eid prayer and then granted a concession regarding the Friday (Jumu'ah) prayer, saying: 'Whoever wishes to pray (it), let him pray.'"
      }
    },

    {
      "id": 367,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا صَلَّى أَحَدُكُمُ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تم میں سے کوئی جمعہ پڑھے تو اس کے بعد چار رکعتیں پڑھے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) said: \"When any one of you offers the Jumu'ah prayer, he should observe four Rak'ahs after it.\""
      }
    },

    {
      "id": 368,
      "name": {
        "arabic": "وَعَنِ السَّائِبِ بْنِ يَزِيدَ, أَنَّ مُعَاوِيَةَ قَالَ لَهُ: { إِذَا صَلَّيْتَ الْجُمُعَةَ فَلَا تَصِلْهَا بِصَلَاةٍ, حَتَّى تُكَلَّمَ أَوْ تَخْرُجَ, فَإِنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَمَرَنَا بِذَلِكَ: أَنْ لَا نُوصِلَ صَلَاةً بِصَلَاةٍ حَتَّى نَتَكَلَّمَ أَوْ نَخْرُجَ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا سائب بن یزید رحمہ اللہ علیہ کا بیان ہے کہ سیدنا معاویہ رضی اللہ عنہ نے فرمایا جب تم نماز جمعہ پڑھو تو پھر دوسری کوئی نماز اس کے ساتھ نہ ملاؤ تاوقتیکہ تم سے کوئی بات کر لے یا وہاں سے نکل جائے۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اسی طرح حکم دیا تھا کہ ہم نماز جمعہ کے ساتھ دوسری نماز نہ ملائیں تاوقتیکہ ہم کوئی بات نہ کر لیں یا وہاں سے نکل جائیں۔",
        "english": "Narrated As-Sa'ib bin Yazid: Mu'awiyah said to him, \"When you have observed the Jumu'ah prayer, do not follow it with another prayer until you have spoken or left (the Mosque); for the Messenger of Allah (ﷺ) commanded us not to follow one prayer with another until we have spoken or left.\""
      }
    },

    {
      "id": 369,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنِ اغْتَسَلَ, ثُمَّ أَتَى الْجُمُعَةَ, فَصَلَّى مَا قُدِّرَ لَهُ, ثُمَّ أَنْصَتَ, حَتَّى يَفْرُغَ اَلْإِمَامُ مِنْ خُطْبَتِهِ, ثُمَّ يُصَلِّي مَعَهُ: غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ اَلْأُخْرَى, وَفَضْلُ ثَلَاثَةِ أَيَّامٍ } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو آدمی غسل کر کے جمعہ کے لئے آئے پھر نماز پڑھے جتنی اس کے لئے مقدر ہو۔ پھر خاموشی سے اس وقت تک بیٹھا رہے کہ امام خطبہ جمعہ سے فارغ ہو پھر امام کے ساتھ فرض نماز ادا کرے تو اس کے دونوں جمعوں کے درمیان کے گناہ معاف کر دئیے جائیں گے بلکہ مزید تین دن کے اور بھی۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'Whoever takes a bath and then comes to Jumu'ah prayer, prays what has been fixed for him, then remains silent until the Imam finishes his sermon, and then prays with him, his sins between that time and the next Friday will be forgiven, and even of three days more.'"
      }
    },

    {
      "id": 370,
      "name": {
        "arabic": "وَعَنْهُ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ: { فِيهِ سَاعَةٌ لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ قَائِمٌ يُصَلِّي, يَسْأَلُ اَللَّهَ عَزَّ وَجَلَّ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ، وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا } مُتَّفَقٌ عَلَيْه ِ  وَفِي رِوَايَةٍ لِمُسْلِمٍ: { وَهِيَ سَاعَةٌ خَفِيفَةٌ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعہ کے دن کا ذکر فرمایا اور کہا: ”اس میں ایک ایسی گھڑی ہے کہ جو مسلمان بندہ اسے پا لے اور وہ کھڑا نماز پڑھ رہا ہو اور اللہ عزوجل سے کسی چیز کا سوال کرے، تو اللہ اسے وہ ضرور عطا فرماتا ہے۔“ اور آپ ﷺ نے اپنے ہاتھ سے اشارہ فرمایا کہ وہ وقت بہت تھوڑا ہے۔ اور مسلم کی روایت میں ہے: ”وہ ایک مختصر سی گھڑی ہے۔“",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) mentioned Friday and said: 'In it there is a time when if a Muslim slave (of Allah) happens to be praying and asks Allah the Exalted for something, He will definitely give it to him.' And he (ﷺ) signaled with his hand to indicate how short that time is. In a narration by Muslim: 'And it is a brief moment.'"
      }
    },

    {
      "id": 371,
      "name": {
        "arabic": "وَعَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { هِيَ مَا بَيْنَ أَنْ يَجْلِسَ اَلْإِمَامُ إِلَى أَنْ تُقْضَى اَلصَّلَاةُ } رَوَاهُ مُسْلِمٌ. وَفِي حَدِيثِ عَبْدِ اَللَّهِ بْنِ سَلَامٍ عِنْدَ ابْنِ مَاجَهْ وَجَابِرِ عِنْدَ أَبِي دَاوُدَ وَالنَّسَائِيِّ: { أَنَّهَا مَا بَيْنَ صَلَاةِ اَلْعَصْرِ إِلَى غُرُوبِ اَلشَّمْسِ }",
        "urdu": "سیدنا ابوبردہ رحمہ اللہ نے اپنے والد (ابوموسیٰ اشعری رضی اللہ عنہ) سے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ ”وہ (جمعہ کی قبولیت کی) گھڑی امام کے منبر پر بیٹھنے کے وقت سے لے کر نماز کے ختم ہونے تک کے درمیان ہے۔“ (مسلم)۔ اور عبداللہ بن سلام سے ابن ماجہ میں اور جابر سے ابوداؤد اور نسائی میں مروی ہے کہ ”وہ گھڑی عصر کی نماز کے بعد سے لے کر سورج غروب ہونے تک کے درمیان ہے۔“",
        "english": "Narrated Abu Burda on the authority of his father (Abu Musa al-Ash'ari): I heard Allah's Messenger (ﷺ) saying: 'It (the hour of response on Friday) is between the time the Imam sits down (on the pulpit) until the prayer is finished.' [Reported by Muslim]. According to the Hadith of 'Abdullah bin Salam in Ibn Majah, and Jabir in Abu Dawud and an-Nasa'i: 'It is between the 'Asr prayer and sunset.'"
      }
    },

    {
      "id": 372,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { مَضَتِ السُّنَّةُ أَنَّ فِي كُلِّ أَرْبَعِينَ فَصَاعِدًا جُمُعَةً } رَوَاهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيف ٍ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ سنت طریقہ یہ جاری رہا ہے کہ چالیس یا اس سے کچھ اوپر کی تعداد پر جمعہ ہے۔ اسے دارقطنی نے ضعیف سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Jabir (RA): The Sunnah has continued that for every forty (people) and more, there is a Jumu'ah prayer. [Reported by ad-Daraqutni with a weak chain]."
      }
    },

    {
      "id": 373,
      "name": {
        "arabic": " وَعَنْ سَمُرَةَ بنِ جُنْدُبٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَسْتَغْفِرُ لِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ كُلَّ جُمُعَةٍ } رَوَاهُ اَلْبَزَّارُ بِإِسْنَادٍ لَيِّنٍ ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم ہر جمعہ مومن مردوں اور عورتوں کے لیے بخشش (مغفرت) کی دعا فرمایا کرتے تھے۔ اسے بزار نے کمزور سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Samura bin Jundub: The Prophet (ﷺ) used to ask for forgiveness for the believing men and the believing women every Friday. [Reported by al-Bazzar with a weak chain]."
      }
    },

    {
      "id": 374,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ فِي اَلْخُطْبَةِ يَقْرَأُ آيَاتٍ مِنَ اَلْقُرْآنِ, وَيُذَكِّرُ اَلنَّاسَ } رَوَاهُ أَبُو دَاوُدَ وَأَصْلُهُ فِي مُسْلِمٍ",
        "urdu": "سیدنا جابر بن سمرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم خطبہ جمعہ میں قرآن حمید کی چند آیات تلاوت فرماتے تھے اور لوگوں کو نصیحت (وعظ) فرماتے تھے۔ (ابوداؤد) اس کی اصل صحیح مسلم میں ہے۔",
        "english": "Narrated Jabir bin Samura (RA): During the sermon, the Prophet (ﷺ) used to recite some verses of the Qur'an and remind (exhort) the people. [Reported by Abu Dawud, and its origin is in Muslim]."
      }
    },

    {
      "id": 375,
      "name": {
        "arabic": "وَعَنْ طَارِقِ بْنِ شِهَابٍ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { الْجُمُعَةُ حَقٌّ وَاجِبٌ عَلَى كُلِّ مُسْلِمٍ فِي جَمَاعَةٍ إِلَّا أَرْبَعَةً: مَمْلُوكٌ, وَاِمْرَأَةٌ, وَصَبِيٌّ, وَمَرِيضٌ } رَوَاهُ أَبُو دَاوُدَ, وَقَالَ: لَمْ يَسْمَعْ طَارِقٌ مِنَ اَلنَّبِيِّ وَأَخْرَجَهُ اَلْحَاكِمُ مِنْ رِوَايَةِ طَارِقِ اَلْمَذْكُورِ عَنْ أَبِي مُوسَى ",
        "urdu": "سیدنا طارق بن شہاب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جمعہ کو باجماعت ادا کرنا ہر مسلم پر واجب ہے، مگر چار قسم کے لوگ اس سے مستثنی ہیں غلام، عورت، بچہ اور مریض۔“ اسے ابوداؤد نے روایت کیا ہے اور ساتھ ہی یہ بھی کہا ہے کہ طارق نے نبی کریم صلی اللہ علیہ وسلم سے نہیں سنا۔ طارق کی یہی روایت حاکم نے ابوموسیٰ کے حوالے سے ذکر کی ہے۔",
        "english": "Narrated Tariq bin Shihab: The Messenger of Allah (ﷺ) said: 'The Friday prayer in congregation is a necessary duty for every Muslim, with the exception of four: a slave, a woman, a boy, and an invalid (sick person).' [Reported by Abu Dawud, who said: Tariq did not hear anything from the Prophet (ﷺ)]. Al-Hakim also reported it from Tariq via Abu Musa."
      }
    },

    {
      "id": 376,
      "name": {
        "arabic": "وَعَنِ ابْنِ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيْسَ عَلَى مُسَافِرٍ جُمُعَةٌ } رَوَاهُ اَلطَّبَرَانِيُّ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی مسافر پر جمعہ نہیں۔“ طبرانی نے اسے ضعیف سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Ibn 'Umar (RA): The Messenger of Allah (ﷺ) said: 'The Friday (Jumu'ah) prayer is not obligatory upon a traveler.' Reported by At-Tabarani with a weak chain of narrators."
      }
    },

    {
      "id": 377,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- إِذَا اسْتَوَى عَلَى الْمِنْبَرِ اسْتَقْبَلْنَاهُ بِوُجُوهِنَا } رَوَاهُ اَلتِّرْمِذِيُّ, بِإِسْنَادٍ ضَعِيفٍ .‏ وَلَهُ شَاهِدٌ مِنْ حَدِيثِ الْبَرَاءِ عِنْدَ اِبْنِ خُزَيْمَةَ",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب منبر پر تشریف فرما ہو جاتے تو ہم (صحابہ) اپنے چہرے آپ صلی اللہ علیہ وسلم کی طرف کر لیتے۔ اسے ترمذی نے ضعیف سند کے ساتھ روایت کیا ہے، تاہم اس کا شاہد ابن خزیمہ میں موجود ہے۔",
        "english": "Narrated Abdullah bin Mas'ud: When the Messenger of Allah (ﷺ) ascended the pulpit, we would face him with our faces. [Reported by at-Tirmidhi with a weak chain; but it has a witness from the Hadith of al-Bara' in Ibn Khuzaimah]."
      }
    },

    {
      "id": 378,
      "name": {
        "arabic": "وَعَنِ اَلْحَكَمِ بْنِ حَزْنٍ - رضى الله عنه - قَالَ: شَهِدْنَا الْجُمُعَةَ مَعَ اَلنَّبِيِّ - صلى الله عليه وسلم - فَقَامَ مُتَوَكِّئًا عَلَى عَصًا أَوْ قَوْسٍ",
        "urdu": "سیدنا حکم بن حزن رضی اللہ عنہ سے مروی ہے کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جمعہ میں حاضر تھے۔ آپ صلی اللہ علیہ وسلم لاٹھی یا کمان کا سہارا لے کر کھڑے ہوئے۔",
        "english": "Narrated Al-Hakam ibn Hazn (RA): We attended the Friday prayer with the Prophet (PBUH) and he stood leaning on a staff or a bow."
      }
    }
  ]
}
