{
  "chapId": 49,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 738,
    "to": 741
  },
  "hadiths": [
    {
      "id": 738,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { مَطْلُ اَلْغَنِيِّ ظُلْمٌ, وَإِذَا أُتْبِعُ أَحَدُكُمْ عَلَى مَلِيٍّ فَلْيَتْبَعْ } مُتَّفَقٌ عَلَيْهِ وَفِي رِوَايَةِ أَحْمَدَ: { فَلْيَحْتَلْ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”مالدار (قرض ادا کرنے کی طاقت رکھنے والے) کا ٹال مٹول کرنا ظلم ہے، اور جب تم میں سے کسی کو (قرض کی وصولی کے لیے) کسی دوسرے مالدار کا حوالہ دیا جائے تو اسے (یہ حوالہ) قبول کر لینا چاہیے۔“ (بخاری و مسلم) اور احمد کی ایک روایت میں ہے: ”پس وہ حوالہ قبول کر لے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Delay in payment on the part of a rich man (who possesses the means) is injustice; and if one of you is referred to a rich man (for payment of debt), he should accept the referral.' [Agreed upon]. In the version reported by Ahmad: '...he should accept the transfer (Hawalah).'"
      }
    },

    {
      "id": 739,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { تُوُفِّيَ رَجُلٌ مِنَّا, فَغَسَّلْنَاهُ, وَحَنَّطْنَاهُ, وَكَفَّنَّاهُ, ثُمَّ أَتَيْنَا بِهِ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقُلْنَا: تُصَلِّي عَلَيْهِ? فَخَطَا خُطًى, ثُمَّ قَالَ: \" أَعَلَيْهِ دَيْنٌ? \" قُلْنَا: دِينَارَانِ، فَانْصَرَفَ, فَتَحَمَّلَهُمَا أَبُو قَتَادَةَ، فَأَتَيْنَاهُ, فَقَالَ أَبُو قَتَادَةَ: اَلدِّينَارَانِ عَلَيَّ، فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" أُحِقَّ اَلْغَرِيمُ وَبَرِئَ مِنْهُمَا اَلْمَيِّتُ? \" قَالَ: نَعَمْ, فَصَلَّى عَلَيْهِ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ ہم میں سے ایک آدمی فوت ہو گیا۔ ہم نے اسے غسل دیا، خوشبو لگائی اور کفن پہنایا۔ پھر ہم اسے لے کر رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور عرض کیا کہ آپ اس کی نمازِ جنازہ پڑھائیں۔ آپ ﷺ جنازہ پڑھانے کے لیے چند قدم آگے بڑھے، پھر رک کر دریافت فرمایا: ”کیا اس پر کوئی قرض ہے؟“ ہم نے عرض کیا: جی ہاں، دو دینار۔ آپ ﷺ یہ سن کر پیچھے ہٹ گئے (اور جنازہ نہ پڑھایا)۔ پھر ابوقتادہ رضی اللہ عنہ نے ان دو دیناروں کی ادائیگی کی ذمہ داری اٹھا لی۔ ہم دوبارہ حاضر ہوئے تو ابوقتادہ رضی اللہ عنہ نے کہا: وہ دو دینار اب میرے ذمے ہیں۔ آپ ﷺ نے فرمایا: ”کیا اب قرض خواہ کا حق تم پر ثابت ہو گیا اور میت ان سے بری ہو گئی؟“ انہوں نے کہا: جی ہاں۔ تب آپ ﷺ نے اس کی نمازِ جنازہ پڑھائی۔",
        "english": "Narrated Jabir (R.A): A man from among us died. We washed him, perfumed him, and shrouded him, then we brought him to Allah's Messenger (peace be upon him) and asked, \"Will you offer the funeral prayer for him?\" He took some steps, then asked, \"Is there any debt on him?\" We replied, \"Two Dinars.\" So he went away. Then Abu Qatadah (R.A) undertook to pay them. We came to him and Abu Qatadah said, \"The two Dinars are my responsibility.\" Allah's Messenger (peace be upon him) asked, \"Is the creditor's right established on you and is the deceased person cleared of them?\" He replied, \"Yes.\" So he (the Prophet) offered the funeral prayer for him."
      }
    },

    {
      "id": 740,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَانَ يُؤْتَى بِالرَّجُلِ اَلْمُتَوَفَّى عَلَيْهِ اَلدَّيْنُ, فَيَسْأَلُ: \" هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ? \" فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى عَلَيْهِ, وَإِلَّا قَالَ: \" صَلُّوا عَلَى صَاحِبِكُمْ \" فَلَمَّا فَتَحَ اَللَّهُ عَلَيْهِ اَلْفُتُوحَ قَالَ: \" أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ, فَمَنْ تُوُفِّيَ, وَعَلَيْهِ دَيْنٌ فَعَلَيَّ قَضَاؤُهُ } مُتَّفَقٌ عَلَيْهِ وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: { فَمَنْ مَاتَ وَلَمْ يَتْرُكْ وَفَاءً }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس مقروض آدمیوں کے جنازے لائے جاتے تو پہلے آپ صلی اللہ علیہ وسلم دریافت فرماتے تھے کہ ”کیا اس نے قرضہ کی ادائیگی کیلئے کچھ چھوڑا ہے؟“ اگر بتایا جاتا کہ اس نے اپنا مال چھوڑا ہے تو اس کی نماز جنازہ پڑھاتے ورنہ فرما دیتے کہ ”جاؤ تم اپنے ساتھی کی نماز جنازہ پڑھ لو۔“ پھر جب اللہ تعالیٰ نے فتوحات کے دروازے کھول دیئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ”میں مومنوں کو ان کی جانوں سے بھی زیادہ قریب ہوں۔ لہٰذا اب جو شخص فوت ہو جائے اور اس پر قرضہ کا بار ہو تو اس قرضہ کی ادائیگی میرے ذمہ ہے۔“ (بخاری و مسلم) اور بخاری کی ایک روایت میں یہ الفاظ ہیں ”جو آدمی مر گیا اور اس نے اتنا ترکہ پیچھے نہیں چھوڑا جو قرضہ کی ادائیگی کیلئے کافی ہو۔“",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) used to be brought a deceased man who was in debt. He would ask, 'Has he left anything to repay his debt?' If he was told that he had left enough, he would pray for him; otherwise, he would say to the Muslims, 'Pray for your companion.' However, when Allah made him victorious (after the conquests), he said, 'I am closer to the believers than their own selves. So, if any believer dies leaving a debt, I will be responsible for its repayment.'"
      }
    },

    {
      "id": 741,
      "name": {
        "arabic": " وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا كَفَالَةَ فِي حَدٍّ } رَوَاهُ اَلْبَيْهَقِيُّ بِإِسْنَادٍ ضَعِيفٍ",
        "urdu": " سیدنا عمرو بن شعیب رحمہ اللہ نے اپنے والد سے اور انہوں نے اپنے دادا سے روایت کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اللہ کی حد میں ضمانت و ذمہ داری نہیں۔ ”اسے بیہقی نے کمزور سند سے روایت کیا ہے۔ ",
        "english": "Narrated 'Amr bin Shu'aib, on his father's authority from his grandfather, that the Messenger of Allah (ﷺ) said: 'There is no bailing (Kafalah) in prescribed punishments (Hudud).' [Reported by Al-Baihaqi with a weak chain]."
      }
    }
  ]
}
