{
  "chapId": 20,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 314,
    "to": 340
  },
  "hadiths": [
    {
      "id": 314,
      "name": {
        "arabic": "عَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { صَلَاةُ اَلْجَمَاعَةِ أَفْضَلُ مِنْ صَلَاةِ اَلْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً } مُتَّفَقٌ عَلَيْهِ .‏ وَلَهُمَا عَنْ أَبِي هُرَيْرَةَ: { بِخَمْسٍ وَعِشْرِينَ جُزْءًا } وَكَذَا لِلْبُخَارِيِّ: عَنْ أَبِي سَعِيدٍ, وَقَالَ: \"دَرَجَةً \"",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”باجماعت نماز پڑھنا اکیلے شخص کی نماز سے ستائیس (27) درجے زیادہ فضیلت رکھتا ہے۔“ (متفق علیہ)۔ اور بخاری و مسلم میں ہی سیدنا ابوہریرہ رضی اللہ عنہ سے (ستائیس کی جگہ) ”پچیس (25) حصے“ مروی ہے۔ اور اسی طرح بخاری میں سیدنا ابوسعید خدری رضی اللہ عنہ سے بھی (پچیس) مروی ہے، اور انہوں نے ”درجہ“ کا لفظ استعمال کیا ہے۔",
        "english": "Narrated Abdullah bin Umar (RA): The Messenger of Allah (ﷺ) said: \"Prayer in congregation is twenty-seven degrees more excellent than the prayer of a single person.\" (Agreed Upon). And in a narration by both (Bukhari & Muslim) from Abu Hurairah (RA): \"...by twenty-five parts.\" And similarly in Al-Bukhari from Abu Sa'id (RA), using the word \"degree\"."
      }
    },

    {
      "id": 315,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { وَاَلَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِحَطَبٍ فَيُحْتَطَبَ, ثُمَّ آمُرَ بِالصَّلَاةِ فَيُؤَذَّنَ لَهَا, ثُمَّ آمُرَ رَجُلًا فَيَؤُمَّ اَلنَّاسَ, ثُمَّ أُخَالِفُ إِلَى رِجَالٍ لَا يَشْهَدُونَ اَلصَّلَاةَ, فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ, وَاَلَّذِي نَفْسِي بِيَدِهِ لَوْ يَعْلَمُ أَحَدُهُمْ أَنَّهُ يَجِدُ عَرْقًا سَمِينًا أَوْ مِرْمَاتَيْنِ حَسَنَتَيْنِ لَشَهِدَ اَلْعِشَاءَ } مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِلْبُخَارِيِّ .",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! میں نے ارادہ کیا کہ لکڑیاں اکٹھی کرنے کا حکم دوں، پھر نماز کے لیے اذان کا حکم دوں، پھر کسی آدمی کو حکم دوں کہ وہ لوگوں کو نماز پڑھائے، پھر میں ان لوگوں کے پاس جاؤں جو نماز میں (جماعت کے لیے) حاضر نہیں ہوتے اور ان کے گھروں کو ان سمیت جلا دوں۔ اور قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! اگر ان میں سے کسی کو یہ علم ہو جائے کہ اسے (مسجد میں) گوشت والی موٹی ہڈی یا دو اچھے کھر (پائے) ملیں گے تو وہ ضرور عشاء کی نماز میں حاضر ہو جائے۔“ (متفق علیہ، اور یہ الفاظ بخاری کے ہیں)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"By Him in Whose Hand my soul is! I have considered ordering that wood be gathered, then ordering that the Adhan be called for the prayer, then ordering a man to lead the people in prayer, then going to the men who do not attend the (congregational) prayer and burning their houses down around them. By Him in Whose Hand my soul is! If one of them knew that he would find a meaty bone or two good hoofs (at the mosque), he would witness (attend) the Isha prayer.\" (Agreed Upon, wording is from Al-Bukhari)."
      }
    },

    {
      "id": 316,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَثْقَلُ اَلصَّلَاةِ عَلَى اَلْمُنَافِقِينَ: صَلَاةُ اَلْعِشَاءِ, وَصَلَاةُ اَلْفَجْرِ, وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”منافقین پر سب سے بھاری نمازیں عشاء اور فجر کی نمازیں ہیں، اور اگر انہیں معلوم ہو جائے کہ ان دونوں میں کیا (اجر و ثواب) ہے، تو وہ ان میں ضرور حاضر ہوں، خواہ انہیں گھٹنوں کے بل گھسٹ کر آنا پڑے۔“ (متفق علیہ)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"The heaviest prayers for the hypocrites are the Isha prayer and the Fajr prayer. If they knew what (reward) is in them, they would come to them even if they had to crawl.\" (Agreed Upon)"
      }
    },

    {
      "id": 317,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { أَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-رَجُلٌ أَعْمَى فَقَالَ: يَا رَسُولَ اَللَّهِ! لَيْسَ لِي قَائِدٌ يَقُودُنِي إِلَى اَلْمَسْجِدِ, فَرَخَّصَ لَهُ, فَلَمَّا وَلَّى دَعَاهُ, فَقَالَ: \"هَلْ تَسْمَعُ اَلنِّدَاءَ بِالصَّلَاةِ?\" قَالَ: نَعَمْ.‏ قَالَ: \"فَأَجِبْ\" } رَوَاهُ مُسْلِم ٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک نابینا شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا: ”یا رسول اللہ! میرے پاس کوئی قائد (رہنما) نہیں جو مجھے پکڑ کر مسجد لے آئے۔“ تو آپ صلی اللہ علیہ وسلم نے اسے رخصت دے دی۔ جب وہ پیٹھ پھیر کر جانے لگا تو آپ نے اسے بلایا اور فرمایا: ”کیا تم نماز کے لیے اذان سنتے ہو؟“ اس نے کہا: ”ہاں۔“ آپ نے فرمایا: ”تو پھر (اذان کا) جواب دو (یعنی مسجد آؤ)۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): A blind man came to the Prophet (ﷺ) and said: \"O Messenger of Allah! I have no guide to lead me to the mosque.\" He asked the Messenger of Allah (ﷺ) for permission (to pray at home), and he granted it. But when he turned away, he called him back and said: \"Do you hear the call (Adhan) to prayer?\" He said: \"Yes.\" He said: \"Then answer it.\""
      }
    },

    {
      "id": 318,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ سَمِعَ اَلنِّدَاءَ فَلَمْ يَأْتِ فَلَا صَلَاةَ لَهُ إِلَّا مِنْ عُذْرٍ } رَوَاهُ اِبْنُ مَاجَهْ, وَاَلدَّارَقُطْنِيُّ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ, وَإِسْنَادُهُ عَلَى شَرْطِ مُسْلِمٍ, لَكِنْ رَجَّحَ بَعْضُهُمْ وَقْفَه ُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اذان سنے اور پھر (جماعت میں) نہ آئے، تو اس کی کوئی نماز نہیں سوائے اس کے کہ کوئی (شرعی) عذر ہو۔“ (اسے ابن ماجہ، دارقطنی، ابن حبان اور حاکم نے روایت کیا ہے۔ اس کی سند مسلم کی شرط پر ہے، لیکن بعض محدثین نے اس کے موقوف [صحابی کا قول] ہونے کو ترجیح دی ہے)",
        "english": "Narrated Ibn Abbas (RA): The Prophet (ﷺ) said: \"Whoever hears the call (Adhan) and does not come to it (the mosque), then there is no prayer for him unless he has an excuse.\" (Reported by Ibn Majah, Ad-Daraqutni, Ibn Hibban, and Al-Hakim. Its chain meets the conditions of Muslim, but some scholars preferred classifying it as Mawquf)."
      }
    },

    {
      "id": 319,
      "name": {
        "arabic": "وَعَنْ يَزِيدَ بْنِ اَلْأَسْوَدِ ‏- رضى الله عنه ‏- { أَنَّهُ صَلَّى مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-صَلَاةَ اَلصُّبْحِ, فَلَمَّا صَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا هُوَ بِرَجُلَيْنِ لَمْ يُصَلِّيَا, فَدَعَا بِهِمَا, فَجِيءَ بِهِمَا تَرْعَدُ فَرَائِصُهُمَا, فَقَالَ لَهُمَا: \"مَا مَنَعَكُمَا أَنْ تُصَلِّيَا مَعَنَا?\" قَالَا: قَدْ صَلَّيْنَا فِي رِحَالِنَا.‏ قَالَ: \"فَلَا تَفْعَلَا, إِذَا صَلَّيْتُمَا فِي رِحَالِكُمْ, ثُمَّ أَدْرَكْتُمْ اَلْإِمَامَ وَلَمْ يُصَلِّ, فَصَلِّيَا مَعَهُ, فَإِنَّهَا لَكُمْ نَافِلَةٌ\" } رَوَاهُ أَحْمَدُ, وَاللَّفْظُ لَهُ, وَالثَّلَاثَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّان َ",
        "urdu": "سیدنا یزید بن اسود رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ فجر کی نماز پڑھی۔ جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو دو آدمیوں کو دیکھا جنہوں نے (جماعت کے ساتھ) نماز نہیں پڑھی تھی۔ آپ صلی اللہ علیہ وسلم نے انہیں بلایا، تو انہیں لایا گیا جبکہ ان کے شانے (خوف سے) کانپ رہے تھے۔ آپ نے ان سے پوچھا: ”تمہیں ہمارے ساتھ نماز پڑھنے سے کس چیز نے روکا؟“ انہوں نے کہا: ”ہم اپنے پڑاؤ (گھروں) میں نماز پڑھ چکے تھے۔“ آپ نے فرمایا: ”ایسا مت کرو، جب تم اپنے پڑاؤ میں نماز پڑھ لو، پھر امام کو پاؤ اور اس نے ابھی نماز نہ پڑھی ہو، تو اس کے ساتھ بھی پڑھ لو، کیونکہ یہ تمہارے لیے نفل ہو جائے گی۔“ (اسے احمد نے روایت کیا ہے اور یہ الفاظ اسی کے ہیں، اور تینوں [ابوداؤد، ترمذی، نسائی] نے بھی روایت کیا ہے، اور ترمذی اور ابن حبان نے اسے صحیح قرار دیا ہے)",
        "english": "Narrated Yazid bin Al-Aswad (RA): He prayed Fajr with the Messenger of Allah (ﷺ). When the Messenger of Allah (ﷺ) had finished the prayer, he saw two men who had not prayed (with the congregation). He called for them, and they were brought trembling with fear. He asked them: \"What prevented you from praying with us?\" They said: \"We have already prayed in our dwellings.\" He said: \"Do not do so. If you pray in your dwellings and then come to a mosque where there is a congregation (and the Imam hasn't prayed yet), pray with them, for it will be a voluntary prayer (Nafl) for you.\""
      }
    },

    {
      "id": 320,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّمَا جُعِلَ اَلْإِمَامُ لِيُؤْتَمَّ بِهِ, فَإِذَا كَبَّرَ فَكَبِّرُوا, وَلَا تُكَبِّرُوا حَتَّى يُكَبِّرَ, وَإِذَا رَكَعَ فَارْكَعُوا, وَلَا تَرْكَعُوا حَتَّى يَرْكَعَ, وَإِذَا قَالَ سَمِعَ اَللَّهُ لِمَنْ حَمِدَهُ, فَقُولُوا: اَللَّهُمَّ رَبَّنَا لَكَ اَلْحَمْدُ, وَإِذَا سَجَدَ فَاسْجُدُوا, وَلَا تَسْجُدُوا حَتَّى يَسْجُدَ, وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا, وَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا أَجْمَعِينَ } رَوَاهُ أَبُو دَاوُدَ, وَهَذَا لَفْظُه ُ  وَأَصْلُهُ فِي اَلصَّحِيحَيْن ِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”امام اسی لیے بنایا گیا ہے کہ اس کی پیروی کی جائے۔ پس جب وہ تکبیر (اللہ اکبر) کہے تو تم بھی تکبیر کہو، اور تم تکبیر نہ کہو یہاں تک کہ وہ تکبیر کہہ لے۔ اور جب وہ رکوع کرے تو تم بھی رکوع کرو، اور تم رکوع نہ کرو یہاں تک کہ وہ رکوع کر لے۔ اور جب وہ «سَمِعَ اَللَّهُ لِمَنْ حَمِدَهُ» کہے تو تم «اَللَّهُمَّ رَبَّنَا لَكَ اَلْحَمْدُ» کہو۔ اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو، اور سجدہ نہ کرو یہاں تک کہ وہ سجدہ کر لے۔ اور جب وہ کھڑے ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو، اور جب وہ بیٹھ کر پڑھے تو تم سب بھی بیٹھ کر نماز پڑھو۔“ (اسے ابوداؤد نے روایت کیا ہے اور یہ الفاظ اسی کے ہیں، جبکہ اس کی اصل صحیحین [بخاری و مسلم] میں ہے)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"The Imam is appointed only to be followed. So when he says the Takbeer, you say the Takbeer, and do not say the Takbeer until he has said it. When he bows, you bow, and do not bow until he has bowed. When he says 'Sami'Allahu liman hamidah' (Allah listens to him who praises Him), you say 'Allahumma Rabbana lakal-hamd' (O Allah, our Lord, to You is the praise). When he prostrates, you prostrate, and do not prostrate until he has prostrated. If he prays standing, you pray standing, and if he prays sitting, you all pray sitting.\" (Reported by Abu Dawud with this wording; its origin is in the Two Sahihs)."
      }
    },

    {
      "id": 321,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَأَى فِي أَصْحَابِهِ تَأَخُّرًا.‏ فَقَالَ: \"تَقَدَّمُوا فَائْتَمُّوا بِي, وَلْيَأْتَمَّ بِكُمْ مَنْ بَعْدَكُمْ\" } رَوَاهُ مُسْلِم ٌ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں (پیچھے رہنے کا رجحان یا) تاخیر دیکھی تو فرمایا: ”آگے بڑھو اور میری اقتدا (پیروی) کرو، اور تمہارے بعد والے (پچھلی صفوں والے) تمہاری اقتدا کریں۔“ (مسلم)",
        "english": "Narrated Abu Sa'id Al-Khudri (RA): The Messenger of Allah (ﷺ) saw some of his companions lagging behind, so he said: \"Come forward and follow me, and let those behind you follow you.\""
      }
    },

    {
      "id": 322,
      "name": {
        "arabic": "وَعَنْ زَيْدِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- قَالَ: { اِحْتَجَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حُجْرَةً بِخَصَفَةٍ, فَصَلَّى فِيهَا, فَتَتَبَّعَ إِلَيْهِ رِجَالٌ, وَجَاءُوا يُصَلُّونَ بِصَلَاتِهِ.‏.‏.‏ } اَلْحَدِيثَ, وَفِيهِ: { أَفْضَلُ صَلَاةِ اَلْمَرْءِ فِي بَيْتِهِ إِلَّا اَلْمَكْتُوبَةَ } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا زید بن ثابت رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کھجور کے پتوں کی چٹائی سے ایک چھوٹا حجرہ (گھیرا) بنایا اور اس میں نماز پڑھنے لگے۔ لوگوں نے آپ کا پیچھا کیا (یعنی تلاش کیا) اور آ کر آپ کی نماز کے ساتھ نماز پڑھنے لگے۔ (حدیث طویل ہے)، اس کے آخر میں ہے: ”(فرض) لکھی ہوئی نماز کے علاوہ، آدمی کی بہترین نماز وہ ہے جو وہ اپنے گھر میں پڑھے۔“ (بخاری و مسلم)",
        "english": "Narrated Zaid bin Thabit (RA): The Messenger of Allah (ﷺ) made a small room (or enclosure) using a mat made of palm leaves and prayed inside it. People tracked him and came to pray along with his prayer. ... (The Hadith continues), and in it, he said: \"The best prayer of a person is in his house, except for the prescribed (obligatory) prayer.\" (Agreed Upon)."
      }
    },

    {
      "id": 323,
      "name": {
        "arabic": " وَعَنْ جَابِرٍ قَالَ: { صَلَّى مُعَاذٌ بِأَصْحَابِهِ اَلْعِشَاءَ, فَطَوَّلَ عَلَيْهِمْ, فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏- \"أَتُرِيدُ أَنْ تَكُونَ يَا مُعَاذُ فَتَّانًا? إِذَا أَمَمْتَ اَلنَّاسَ فَاقْرَأْ: بِالشَّمْسِ وَضُحَاهَا, وَ: سَبِّحْ اِسْمَ رَبِّكَ اَلْأَعْلَى, وَ: اِقْرَأْ بِاسْمِ رَبِّكَ, وَاللَّيْلِ إِذَا يَغْشَى\".‏ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ .",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ سیدنا معاذ (بن جبل) رضی اللہ عنہ نے اپنے ساتھیوں کو عشاء کی نماز پڑھائی تو اسے لمبا کر دیا۔ (جب نبی ﷺ کو یہ بات معلوم ہوئی) تو آپ نے فرمایا: ”اے معاذ! کیا تم (لوگوں کو) فتنہ (آزمائش) میں ڈالنے والے بننا چاہتے ہو؟ جب تم لوگوں کی امامت کراؤ تو «وَالشَّمْسِ وَضُحَاهَا»، «سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى»، «اقْرَأْ بِاسْمِ رَبِّكَ» اور «وَاللَّيْلِ إِذَا يَغْشَى» (جیسی سورتیں) پڑھا کرو۔“ (متفق علیہ، اور یہ الفاظ مسلم کے ہیں)",
        "english": "Narrated Jabir (RA): Mu'adh led his companions in the Isha prayer and prolonged it for them. The Prophet (ﷺ) said: \"O Mu'adh! Do you want to be a cause of trial? When you lead the people, recite: 'By the sun and its brightness' (Surah 91), 'Glorify the Name of your Lord, the Most High' (Surah 87), 'Read! In the Name of your Lord' (Surah 96), and 'By the night when it covers' (Surah 92).\" (Agreed Upon, wording is from Muslim)."
      }
    },

    {
      "id": 324,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا فِي قِصَّةِ صَلَاةِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِالنَّاسِ, وَهُوَ مَرِيضٌ ‏- قَالَتْ: { فَجَاءَ حَتَّى جَلَسَ عَنْ يَسَارِ أَبِي بَكْرٍ, فَكَانَ يُصَلِّي بِالنَّاسِ جَالِسًا وَأَبُو بَكْرٍ قَائِمًا, يَقْتَدِي أَبُو بَكْرٍ بِصَلَاةِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-وَيَقْتَدِي اَلنَّاسُ بِصَلَاةِ أَبِي بَكْرٍ } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی بیماری کے دوران لوگوں کو نماز پڑھانے کے واقعہ کے بارے میں روایت ہے، وہ فرماتی ہیں: ”پس آپ تشریف لائے یہاں تک کہ سیدنا ابوبکر کے بائیں جانب بیٹھ گئے۔ آپ لوگوں کو بیٹھ کر نماز پڑھا رہے تھے اور ابوبکر کھڑے ہوئے تھے۔ ابوبکر، نبی کریم صلی اللہ علیہ وسلم کی نماز کی پیروی کر رہے تھے اور لوگ ابوبکر کی نماز (یعنی ان کی آواز) کی پیروی کر رہے تھے۔“ (متفق علیہ)",
        "english": "Narrated 'Aishah (RA) regarding the story of the Messenger of Allah (ﷺ) leading the people in prayer while he was ill: \"He came and sat on the left of Abu Bakr. He was leading the people in prayer while sitting, and Abu Bakr was standing. Abu Bakr was following the prayer of the Prophet (ﷺ), and the people were following the prayer of Abu Bakr.\" (Agreed Upon)"
      }
    },

    {
      "id": 325,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا أَمَّ أَحَدُكُمْ اَلنَّاسَ فَلْيُخَفِّفْ, فَإِنَّ فِيهِمْ اَلصَّغِيرَ وَالْكَبِيرَ وَالضَّعِيفَ وَذَا اَلْحَاجَةِ, فَإِذَا صَلَّى وَحْدَهُ فَلْيُصَلِّ كَيْفَ شَاءَ } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی لوگوں کی امامت کرے تو اسے (نماز میں) تخفیف کرنی چاہیے، کیونکہ ان میں چھوٹے بچے، بوڑھے، کمزور اور حاجت مند لوگ ہوتے ہیں۔ البتہ جب وہ تنہا نماز پڑھے تو جیسے چاہے (طویل) پڑھے۔“",
        "english": "Narrated Abu Hurairah (RAA): The Prophet (ﷺ) said: 'When one of you leads the people in prayer, he should be brief, for among them are the young, the aged, the weak, and those who have needs to attend to. But when he prays alone, he may pray as long as he likes.'"
      }
    },

    {
      "id": 326,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ سَلَمَةَ قَالَ: قَالَ أَبِي: { جِئْتُكُمْ مِنْ عِنْدِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-حَقًّا.‏ قَالَ: \"فَإِذَا حَضَرَتْ اَلصَّلَاةُ فَلْيُؤَذِّنْ أَحَدُكُمْ, وَلْيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا\", قَالَ: فَنَظَرُوا فَلَمْ يَكُنْ أَحَدٌ أَكْثَرَ قُرْآنًا مِنِّي, فَقَدَّمُونِي, وَأَنَا اِبْنُ سِتٍّ أَوْ سَبْعِ سِنِينَ } رَوَاهُ اَلْبُخَارِيُّ, وَأَبُو دَاوُدَ, وَالنَّسَائِيّ ُ ",
        "urdu": "سیدنا عمرو بن سلمہ رضی اللہ عنہما سے مروی ہے کہ میرے والد نے اپنی قوم سے کہا کہ میں تمہارے پاس رسول اللہ صلی اللہ علیہ وسلم کے ہاں سے حق لے کر آ رہا ہوں ان کا ارشاد گرامی ہے کہ ”جب نماز کا وقت ہو جائے تو تم میں سے کوئی ایک اذان کہے اور امامت ایسا شخص کرائے جو قرآن کا سب سے زیادہ حافظ ہو۔“ عمرو نے کہا میری قوم نے دیکھا میرے سوا کوئی دوسرا قرآن کا ان سے بڑا حافظ نہیں ہے تو انہوں نے مجھے آگے کر دیا۔ اس وقت میری عمر چھ سات برس کی تھی۔ (بخاری، ابوداؤد، نسائی)",
        "english": "Narrated 'Amr bin Salamah: My father said, \"I have come to you from the Prophet (ﷺ) for sure.\" The Prophet (ﷺ) had said: \"When the time for prayer comes, one of you should pronounce the Adhan and the one among you who knows most of the Qur'an should lead the prayer.\" 'Amr bin Salamah said: \"So they looked and did not find anyone who knew more of the Qur'an than I did, so they made me lead them in prayer, and I was then a boy of six or seven years.\""
      }
    },

    {
      "id": 327,
      "name": {
        "arabic": "وَعَنْ أَبِي مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَؤُمُّ اَلْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اَللَّهِ, فَإِنْ كَانَتْ فِي اَلْقِرَاءَةِ سَوَاءً فَأَعْلَمُهُمْ بِالسُّنَّةِ, فَإِنْ كَانُوا فِي اَلسُّنَّةِ سَوَاءً فَأَقْدَمُهُمْ هِجْرَةً, فَإِنْ كَانُوا فِي اَلْهِجْرَةِ سَوَاءً فَأَقْدَمُهُمْ سِلْمًا ‏-وَفِي رِوَايَةٍ: سِنًّا‏- وَلَا يَؤُمَّنَّ اَلرَّجُلُ اَلرَّجُلَ فِي سُلْطَانِهِ, وَلَا يَقْعُدْ فِي بَيْتِهِ عَلَى تَكْرِمَتِهِ إِلَّا بِإِذْنِهِ\".‏ } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”لوگوں کا امام ایسا آدمی ہو جسے قرآن حمید کا علم زیادہ ہو۔ اگر اس وصف میں لوگ مساوی ہوں پھر وہ امام بنے جسے سنت نبوی صلی اللہ علیہ وسلم کا علم زیادہ ہو اور اگر سنت کے علم میں بھی لوگ مساوی ہوں تو پھر وہ امام بنے جس نے ہجرت پہلے کی۔ اگر اس وصف میں سب برابر ہوں تو پھر وہ امام بنے جس نے پہلے اسلام قبول کیا ہو اور ایک روایت میں «سلما» (اسلام) کی بجائے «سنا» (عمر) کا لفظ بھی ہے (یعنی اگر مذکورہ بالا اوصاف میں سبھی برابر ہوں تو پھر ان میں جس کی عمر زیادہ ہو اسے امام بنایا جائے) کوئی آدمی کسی آدمی کے دائرہ اقتدار میں امامت نہ کرائے اور نہ گھر میں اس کی مخصوص نشست (بستر) پر اس کی اجازت کے بغیر بیٹھے۔“ (مسلم)",
        "english": "Narrated Abu Mas'ud (RAA): The Messenger of Allah (ﷺ) said: 'The one who has most knowledge of the Book of Allah (The Qur'an) should lead the people in prayer. If they are equal in that, then the one who has most knowledge of the Sunnah. If they are equal in that, then the one who emigrated (to Al-Madinah) first. If they are equal in that, then the one who accepted Islam first (and in another narration: the one who is oldest in age). No man should lead another in prayer where the latter has authority, nor should he sit in his house in his place of honor without his permission.' [Reported by Muslim]."
      }
    },

    {
      "id": 328,
      "name": {
        "arabic": "وَلِابْنِ مَاجَهْ: مِنْ حَدِيثِ جَابِرٍ: { وَلَا تَؤُمَّنَّ اِمْرَأَةٌ رَجُلًا, وَلَا أَعْرَابِيٌّ مُهَاجِرًا, وَلَا فَاجِرٌ مُؤْمِنًا.‏ } وَإِسْنَادُهُ وَاه ٍ ",
        "urdu": "ابن ماجہ میں سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ ”کوئی عورت کسی مرد کی امام نہ بنے اور نہ کوئی بدوی دیہاتی کسی مہاجر کی امامت کرائے اور نہ کوئی فاجر کسی مومن کا امام بنے۔“ اس روایت کی سند «واہ» (انتہائی ضعیف) ہے۔",
        "english": "Ibn Majah narrated from the Hadith of Jabir (RA): \"A woman must not lead a man in prayer, nor must a Bedouin lead a Muhajir (Emigrant), nor must a wicked person (Fajir) lead a believer.\""
      }
    },

    {
      "id": 329,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { رُصُّوا صُفُوفَكُمْ, وَقَارِبُوا بَيْنَهَا, وَحَاذُوا بِالْأَعْنَاقِ.‏ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کا ارشاد گرامی ہے: ”اپنی صفوں کو (مضبوطی سے) ملاؤ، ان کے درمیان فاصلہ کم رکھو اور اپنی گردنوں کو ایک لائن میں (برابر برابر) رکھو۔“",
        "english": "Narrated Anas (RAA): The Prophet (ﷺ) said: 'Stand close together in your rows, keep them near each other, and stand neck to neck.'"
      }
    },

    {
      "id": 330,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خَيْرُ صُفُوفِ اَلرِّجَالِ أَوَّلُهَا, وَشَرُّهَا آخِرُهَا, وَخَيْرُ صُفُوفِ اَلنِّسَاءِ آخِرُهَا, وَشَرُّهَا أَوَّلُهَا } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”مردوں کی بہترین صف پہلی اور بدترین (ثواب میں سب سے کم) آخری صف ہے، اور عورتوں کی بہترین صف آخری اور بدترین (ثواب میں سب سے کم) پہلی صف ہے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'The best of the men's rows is the first and the worst is the last, and the best of the women's rows is the last and the worst is the first.'"
      }
    },

    {
      "id": 331,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { صَلَّيْتُ مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-ذَاتَ لَيْلَةٍ, فَقُمْتُ عَنْ يَسَارِهِ, فَأَخَذَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِرَأْسِي مِنْ وَرَائِي, فَجَعَلَنِي عَنْ يَمِينِهِ } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ میں نے ایک رات رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز ادا کی۔ میں آپ صلی اللہ علیہ وسلم کی بائیں جانب کھڑا ہو گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے پیچھے سے میرا سر پکڑا اور مجھے اپنی دائیں جانب کھڑا کر لیا۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RAA): 'One night I prayed with the Messenger of Allah (ﷺ) and I stood on his left side. The Messenger of Allah (ﷺ) then took hold of my head from behind me and moved me to his right side.' [Agreed upon]."
      }
    },

    {
      "id": 332,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ قَالَ: { صَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقُمْتُ وَيَتِيمٌ خَلْفَهُ, وَأُمُّ سُلَيْمٍ خَلْفَنَا.‏ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيّ ِ ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی۔ میں اور ایک یتیم دونوں آپ صلی اللہ علیہ وسلم کے پیچھے (ایک صف میں) کھڑے ہوئے اور سیدہ ام سلیم رضی اللہ عنہا نے ہمارے پیچھے (تنہا صف بنا کر) نماز ادا کی۔ (بخاری و مسلم) متن کے الفاظ بخاری کے ہیں۔",
        "english": "Narrated Anas (RA): Allah's Messenger (ﷺ) led the prayer. I and an orphan stood behind him, and Umm Sulaim (RA) stood behind us."
      }
    },

    {
      "id": 333,
      "name": {
        "arabic": "وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- أَنَّهُ اِنْتَهَى إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-وَهُوَ رَاكِعٌ, فَرَكَعَ قَبْلَ أَنْ يَصِلَ إِلَى اَلصَّفِّ, فَقَالَ لَهُ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ زَادَكَ اَللَّهَ حِرْصًا وَلَا تَعُدْ } رَوَاهُ اَلْبُخَارِيُّ .‏ وَزَادَ أَبُو دَاوُدَ فِيهِ: { فَرَكَعَ دُونَ اَلصَّفِّ, ثُمَّ مَشَى إِلَى اَلصَّفِّ } ",
        "urdu": "سیدنا ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ وہ نبی کریم صلی اللہ علیہ وسلم کے پاس اس وقت پہنچے جب آپ صلی اللہ علیہ وسلم رکوع کی حالت میں تھے۔ انھوں نے صف تک پہنچنے سے پہلے ہی (باہر ہی) رکوع کر لیا۔ نبی کریم صلی اللہ علیہ وسلم نے (نماز کے بعد) ان سے فرمایا: ”اللہ تعالیٰ تمہارے شوق (نیکی کی تڑپ) میں اضافہ فرمائے، لیکن آئندہ ایسا مت کرنا۔“ (بخاری)۔ ابوداؤد کی روایت میں یہ اضافہ ہے کہ انھوں نے صف سے پیچھے رکوع کیا، پھر رکوع کی حالت میں ہی چل کر صف میں شامل ہو گئے۔",
        "english": "Narrated Abu Bakrah (RAA): He reached the Prophet (ﷺ) while he was in the bowing position (Ruku'), so he bowed before he reached the row. The Prophet (ﷺ) said to him, 'May Allah increase your eagerness (for good), but do not do it again.' [Reported by Al-Bukhari]. Abu Dawud added: 'He bowed behind the row and then walked to join the row (while still in Ruku').'"
      }
    },

    {
      "id": 334,
      "name": {
        "arabic": " وَعَنْ وَابِصَةَ بْنِ مَعْبَدٍ اَلْجُهَنِيِّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ رأَى رَجُلًا يُصَلِّي خَلْفَ اَلصَّفِّ وَحْدَهُ, فَأَمَرَهُ أَنْ يُعِيدَ اَلصَّلَاةَ.‏ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏ وَلَهُ عَنْ طَلْقٍ { لَا صَلَاةَ لِمُنْفَرِدٍ خَلْفَ اَلصَّفِّ } وَزَادَ اَلطَّبَرَانِيُّ مِنْ حَدِيثِ وَابِصَةَ: { أَلَا دَخَلْتَ مَعَهُمْ أَوْ اِجْتَرَرْتَ رَجُلًا? } ",
        "urdu": "سیدنا وابصہ بن معبد رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ایک آدمی کو صف کے پیچھے تنہا نماز پڑھتے دیکھا تو اسے نماز دہرانے کا حکم دیا۔ (احمد، ابوداؤد، ترمذی، ابن حبان)۔ اور طلق (علی بن شیبان) سے مروی ہے کہ ”صف کے پیچھے اکیلے شخص کی نماز نہیں ہوتی۔“ طبرانی میں اضافہ ہے: ”تم صف میں داخل کیوں نہ ہوئے یا کسی کو (پہلی صف سے) پیچھے کیوں نہ کھینچ لیا؟“",
        "english": "Narrated Wabisah bin Ma'bad (RA): Allah's Messenger (ﷺ) saw a man praying alone behind the row, so he ordered him to repeat the prayer. [Reported by Ahmad, Abu Dawud, and At-Tirmidhi, who graded it Hasan; and Ibn Hibban graded it Sahih]. Talq (Ali bin Shaiban) also narrated: \"The prayer of a person who is alone behind the row is invalid.\" At-Tabarani added: \"Why did you not join them or pull a man (from the front row) back?\""
      }
    },

    {
      "id": 335,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا سَمِعْتُمْ اَلْإِقَامَةَ فَامْشُوا إِلَى اَلصَّلَاةِ, وَعَلَيْكُمْ اَلسَّكِينَةُ وَالْوَقَارُ, وَلَا تُسْرِعُوا, فَمَا أَدْرَكْتُمْ فَصَلُّوا, وَمَا فَاتَكُمْ فَأَتِمُّوا } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ .‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جب تم (نماز کی) اقامت سنو تو نماز کی طرف (اس طرح) چل کر آؤ کہ تم پر سکینہ (اطمینان) اور وقار لازم ہو۔ جلدی نہ کرو، پھر نماز کا جو حصہ تمہیں (امام کے ساتھ) مل جائے اسے پڑھ لو اور جو رہ جائے اسے (بعد میں) پورا کر لو۔“",
        "english": "Narrated Abu Hurairah (RAA): The Prophet (ﷺ) said: 'When you hear the Iqamah, proceed to prayer with calmness and dignity, and do not rush. Pray whatever part (of the prayer) you catch (with the congregation), and complete whatever you miss.'"
      }
    },

    {
      "id": 336,
      "name": {
        "arabic": " وَعَنْ أُبَيِّ بْنِ كَعْبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ صَلَاةُ اَلرَّجُلِ مَعَ اَلرَّجُلِ أَزْكَى مِنْ صَلَاتِهِ وَحْدَهُ, وَصَلَاتُهُ مَعَ اَلرَّجُلَيْنِ أَزْكَى مِنْ صَلَاتِهِ مَعَ اَلرَّجُلِ, وَمَا كَانَ أَكْثَرَ فَهُوَ أَحَبُّ إِلَى اَللَّهِ عَزَّ وَجَلَّ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّان َ",
        "urdu": "سیدنا ابی بن کعب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک آدمی کا دوسرے آدمی کے ساتھ مل کر (باجماعت) نماز پڑھنا تنہا نماز پڑھنے سے کہیں زیادہ پاکیزہ ہے، اور اس کا دو آدمیوں کے ساتھ مل کر نماز پڑھنا ایک آدمی کے ساتھ نماز پڑھنے سے زیادہ پاکیزہ ہے، اور مقتدیوں کی تعداد جتنی زیادہ ہوگی وہ اللہ عزوجل کو اتنا ہی زیادہ پسند ہے۔“ (ابوداؤد، نسائی، اور ابن حبان نے اسے صحیح کہا ہے)۔",
        "english": "Narrated Ubayy bin Ka'b (RA): Allah's Messenger (ﷺ) said: 'A man's prayer offered along with another is purer than his prayer offered alone; and his prayer offered with two men is purer than his prayer offered with one; and the more there are, the more beloved it is to Allah, the Mighty and Sublime.'"
      }
    },

    {
      "id": 337,
      "name": {
        "arabic": "وَعَنْ أُمِّ وَرَقَةَ رَضِيَ اَللَّهُ عَنْهَا, { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَمَرَهَا أَنْ تَؤُمَّ أَهْلَ دَارِهَا } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ ",
        "urdu": "سیدہ ام ورقہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو اپنے گھر والوں کی امامت کرنے کا حکم فرمایا تھا۔ (ابوداؤد، ابن خزیمہ)",
        "english": "Narrated Umm Waraqah (RAA): The Prophet (ﷺ) commanded her to lead the people of her household in prayer. [Reported by Abu Dawud, and Ibn Khuzaimah authenticated it]."
      }
    },

    {
      "id": 338,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ رَضِيَ اَللَّهُ عَنْهُ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اِسْتَخْلَفَ اِبْنَ أُمِّ مَكْتُومٍ, يَؤُمُّ اَلنَّاسَ, وَهُوَ أَعْمَى } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ. وَنَحْوُهُ لِابْنِ حِبَّانَ: عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا.‏ ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے ابن ام مکتوم رضی اللہ عنہ کو (اپنی عدم موجودگی میں مدینہ میں) اپنا نائب بنایا، وہ لوگوں کی امامت کراتے تھے حالانکہ وہ نابینا تھے۔ اسے احمد اور ابوداؤد نے روایت کیا ہے۔ ابن حبان نے سیدہ عائشہ رضی اللہ عنہا سے بھی اسی طرح کی روایت نقل کی ہے۔",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) appointed Ibn Umm Maktum (RA) as his deputy to lead the people in prayer, and he was a blind man. [Reported by Ahmad and Abu Dawud]. A similar narration is reported by Ibn Hibban from 'Aisha (RA)."
      }
    },

    {
      "id": 339,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ صَلُّوا عَلَى مَنْ قَالَ: لَا إِلَهَ إِلَّا اَللَّهُ, وَصَلُّوا خَلْفَ مَنْ قَالَ: لَا إِلَهَ إِلَّا اَللَّهُ } رَوَاهُ اَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ . ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے (کلمہ) «لا إله إلا الله» کہا اس کی نماز جنازہ پڑھو، اور جس نے «لا إله إلا الله» کہا اس کے پیچھے نماز پڑھ لیا کرو۔“ اسے دارقطنی نے ضعیف سند کے ساتھ روایت کیا ہے۔",
        "english": "Narrated Ibn 'Umar (RAA): The Messenger of Allah (ﷺ) said: 'Pray over those who say, \"There is no god but Allah\" (i.e., Muslims), and pray behind those who say, \"There is no god but Allah.\"' [Reported by ad-Daraqutni with a weak chain of narrators]."
      }
    },

    {
      "id": 340,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَتَى أَحَدُكُمْ اَلصَّلَاةَ وَالْإِمَامُ عَلَى حَالٍ, فَلْيَصْنَعْ كَمَا يَصْنَعُ اَلْإِمَامُ } رَوَاهُ اَلتِّرْمِذِيُّ بِإِسْنَادٍ ضَعِيفٍ .‏",
        "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا: ”جب تم میں سے کوئی نماز کے لیے آئے اور امام کسی بھی حالت میں ہو، تو وہ وہی کرے جو امام کر رہا ہو۔“ (ترمذی نے اسے ضعیف سند کے ساتھ روایت کیا ہے)۔",
        "english": "Narrated 'Ali (RA): The Prophet (ﷺ) said: 'When one of you comes to the prayer while the Imam is in a certain position, he should do as the Imam is doing.' [Reported by At-Tirmidhi with a weak Isnad]."
      }
    }
  ]
}
