{
  "chapId": 16,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 195,
    "to": 209
  },
  "hadiths": [
    {
      "id": 195,
      "name": {
        "arabic": "عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { أَمَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- بِبِنَاءِ اَلْمَسَاجِدِ فِي اَلدُّورِ , وَأَنْ تُنَظَّفَ , وَتُطَيَّبَ.‏ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَاَلتِّرْمِذِيُّ , وَصَحَّحَ إِرْسَالَهُ .‏",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے گھروں میں جائے نماز متعین کرنے اور ان کو صاف ستھرا رکھنے کا حکم دیا۔ اس کے ساتھ ہی محلے کی مسجدوں کو تعمیر کرنے، انہیں صاف رکھنے اور خوشبو لگانے کا بھی حکم دیا۔ اسے احمد، ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی نے اس کے مرسل ہونے کو صحیح قرار دیا ہے۔ ",
        "english": "Narrated from 'Aishah (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings be upon him) commanded the building of mosques in the districts/houses (Ad-Dur), and that they should be cleaned and perfumed. Reported by Ahmad, Abu Dawud, and At-Tirmidhi, who considered its chain 'Mursal' (having a missing companion), yet the narration is deemed authentic by scholars."
      }
    },

    {
      "id": 196,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { قَاتَلَ اَللَّهُ اَلْيَهُودَ : اِتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ } مُتَّفَقٌ عَلَيْه. وَزَادَ مُسْلِمُ { وَالنَّصَارَى }. وَلَهُمَا : مِنْ حَدِيثِ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- : { كَانُوا إِذَا مَاتَ فِيهِمْ اَلرَّجُلُ اَلصَّالِحُ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا } وَفِيهِ : { أُولَئِكَ شِرَارُ اَلْخَلْقِ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اللہ تعالیٰ یہودیوں کو غارت و برباد کرے (یا ان پر لعنت کرے) انہوں نے انبیاء کرام کی قبروں کو سجدہ گاہ بنا لیا تھا۔ “ اسے بخاری و مسلم دونوں نے روایت کیا ہے اور مسلم نے 'نصاریٰ' (عیسائیوں) کے لفظ کا اضافہ بھی نقل کیا ہے۔ بخاری و مسلم میں سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ ” جب ان میں کوئی نیک آدمی فوت ہو جاتا تو وہ اس کی قبر پر مسجد بنا لیتے۔ “ اس حدیث میں یہ الفاظ بھی ہیں کہ ” یہ (ایسا کرنے والے) بدترین مخلوق ہیں۔ “ ",
        "english": "Narrated from Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"May Allah destroy the Jews! They took the graves of their prophets as places of worship (Masajid).\" Agreed upon (Al-Bukhari and Muslim). Muslim added: \"And the Christians.\" And both (Al-Bukhari and Muslim) reported from 'Aishah (may Allah be pleased with her): \"When a righteous man died among them, they would build a place of worship over his grave.\" And in it: \"Those are the worst of creation.\""
      }
    },

    {
      "id": 197,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { بَعَثَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏- خَيْلاً , فَجَاءَتْ بِرَجُلٍ , فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي اَلْمَسْجِدِ } اَلْحَدِيثَ .‏ مُتَّفَقٌ عَلَيْهِ .",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک سوار دستہ (فوج) کسی طرف روانہ فرمایا۔ وہ لوگ ایک (مشرک) مرد کو (گرفتار کر کے) لائے اور اس کو مسجد (نبوی) کے ستونوں میں سے ایک ستون کے ساتھ باندھ دیا (قید کر دیا)۔ (بخاری و مسلم)",
        "english": "Narrated from Abu Hurayrah (may Allah be pleased with him): The Prophet (peace and blessings be upon him) sent out a cavalry (expedition), and they brought a man whom they tied to one of the pillars of the Mosque. (The complete Hadith is well known.) Agreed upon (Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 198,
      "name": {
        "arabic": "وَعَنْهُ ‏- رضى الله عنه ‏- { أَنَّ عُمَرَ ‏- رضى الله عنه ‏- مُرَّ بِحَسَّانَ يَنْشُدُ فِي اَلْمَسْجِدِ , فَلَحَظَ إِلَيْهِ , فَقَالَ : \"قَدْ كُنْتُ أَنْشُدُ , وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ\" } .‏ مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے ہی یہ حدیث بھی مروی ہے کہ سیدنا عمر رضی اللہ عنہ کا گزر سیدنا حسان رضی اللہ عنہ کے پاس سے ہوا، وہ مسجد میں اشعار پڑھ رہے تھے، سیدنا عمر رضی اللہ عنہ نے ان کی طرف گھور کر دیکھا (اس پر) سیدنا حسان رضی اللہ عنہ نے کہا (گھورتے کیوں ہیں؟) میں تو اس وقت مسجد میں شعر پڑھا کرتا تھا جب مسجد میں وہ ذات گرامی موجود ہوتی تھی جو آپ سے افضل تھی (یعنی رسول اللہ صلی اللہ علیہ وسلم )۔ (بخاری و مسلم) ",
        "english": "Narrated from Abu Hurayrah (may Allah be pleased with him): 'Umar (may Allah be pleased with him) passed by Hassan (ibn Thabit) reciting poetry in the Mosque. 'Umar looked sternly at him. Thereupon, Hassan said: \"I used to recite poetry (in the Mosque) in the presence of one who was better than you (meaning the Messenger of Allah, peace and blessings be upon him).\" Agreed upon (Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 199,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { مَنْ سَمِعَ رَجُلاً يَنْشُدُ ضَالَّةً فِي اَلْمَسْجِدِ فَلْيَقُلْ : لَا رَدَّهَا اَللَّهُ عَلَيْكَ , فَإِنَّ اَلْمَسَاجِدَ لَمْ تُبْنَ لِهَذَا } رَوَاهُ مُسْلِم ٌ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ ہی سے یہ حدیث بھی مروی ہے کہ جو کوئی یہ سنے کہ کوئی آدمی مسجد میں اپنی گمشدہ چیز تلاش کر رہا ہے تو سننے والا اسے یہ کہے کہ اللہ کرے وہ چیز تمہیں واپس نہ ملے۔ مسجدیں اس مقصد کے لئے تو نہیں بنائی گئی ہیں۔ (مسلم)",
        "english": "Narrated from Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"Whoever hears a man calling out about a lost object in the Mosque, let him say: 'May Allah not restore it to you, for the mosques were not built for this (purpose).\" Reported by Muslim."
      }
    },

    {
      "id": 200,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { إِذَا رَأَيْتُمْ مَنْ يَبِيعُ , أَوْ يَبْتَاعُ فِي اَلْمَسْجِدِ , فَقُولُوا : لَا أَرْبَحَ اَللَّهُ تِجَارَتَكَ } رَوَاهُ النَّسَائِيُّ , وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ .‏",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ ہی سے یہ روایت بھی مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” جب تم کسی شخص کو مسجد میں خرید و فروخت کرتے دیکھو تو اسے کہو کہ اللہ تعالیٰ تمہارے کاروبار و تجارت میں نفع نہ دے۔ “ اس حدیث کو ترمذی اور نسائی نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے۔",
        "english": "Narrated from Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"If you see anyone buying or selling in the mosque, say to him: 'May Allah not give profit to your trade.'\" Reported by An-Nasa’i and At-Tirmidhi, who graded it Hasan (Good)."
      }
    },

    {
      "id": 201,
      "name": {
        "arabic": "وَعَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { لَا تُقَامُ اَلْحُدُودُ فِي اَلْمَسَاجِدِ , وَلَا يُسْتَقَادُ فِيهَا } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ بِسَنَدٍ ضَعِيف ٍ",
        "urdu": " سیدنا حکیم بن حزام رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” مساجد میں نہ تو حدود (شرعی سزائیں) قائم کی جائیں اور نہ ہی ان میں قصاص (خون کا بدلہ) لیا جائے۔“ اس حدیث کو احمد اور ابوداؤد نے روایت کیا ہے۔",
        "english": "Narrated from Hakim ibn Hizam (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings be upon him) said: \"Hadd punishments (prescribed legal penalties) should not be carried out in the mosques, nor should Qisas (retaliation, blood money) be exacted therein.\" Reported by Ahmad and Abu Dawud."
      }
    },

    {
      "id": 202,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { أُصِيبَ سَعْدٌ يَوْمَ اَلْخَنْدَقِ , فَضَرَبَ عَلَيْهِ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- خَيْمَةً فِي اَلْمَسْجِدِ , لِيَعُودَهُ مِنْ قَرِيبٍ } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ ” غزوہ خندق کے روز سیدنا سعد رضی اللہ عنہ زخمی ہو گئے تھے رسول اللہ صلی اللہ علیہ وسلم نے ان کیلئے مسجد میں خیمہ لگوایا تھا، تاکہ قریب سے ان کی تیمارداری (بآسانی) کر سکیں۔“ (بخاری و مسلم)  ",
        "english": "Narrated from 'Aishah (may Allah be pleased with her): Sa'd (ibn Mu'adh) was wounded on the day of Al-Khandaq (the Battle of the Trench), and the Messenger of Allah (peace and blessings be upon him) set up a tent for him in the mosque so that he could visit him closely (and attend to him easily)."
      }
    },

    {
      "id": 203,
      "name": {
        "arabic": "وَعَنْهَا قَالَتْ : { رَأَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- يَسْتُرُنِي , وَأَنَا أَنْظُرُ إِلَى اَلْحَبَشَةِ يَلْعَبُونَ فِي اَلْمَسْجِدِ .‏ .‏ .‏ } اَلْحَدِيثَ .‏ مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا ہی سے مروی ہے کہ ” میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم میرے لئے پردہ بنے ہوئے تھے اور میں حبشیوں کے کھیل کو دیکھ رہی تھی جو وہ مسجد میں (ہتھیاروں سے) کھیل رہے تھے۔“ یہ طویل حدیث کا ایک حصہ ہے۔ (بخاری و مسلم)",
        "english": "Narrated from 'Aishah (may Allah be pleased with her): \"I saw the Messenger of Allah (peace and blessings be upon him) shielding me while I was watching the Abyssinians (Ethiopians) playing with their weapons (or spears) in the mosque...\" This is part of a longer Hadith. Agreed upon (Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 204,
      "name": {
        "arabic": "وَعَنْهَا قَالَتْ : { أَنَّ وَلِيدَةً سَوْدَاءَ كَانَ لَهَا خِبَاءٌ فِي اَلْمَسْجِدِ , فَكَانَتْ تَأْتِينِي , فَتَحَدَّثُ عِنْدِي .‏ .‏ .‏ } اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْه",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا ہی سے مروی ہے کہ ” ایک سیاہ رنگ کی آزاد کردہ لڑکی کا خیمہ مسجد میں تھا وہ (اکثر) میرے پاس باتیں کرنے کے لئے آیا کرتی تھی۔“ یہ طویل حدیث کا حصہ ہے۔ (بخاری و مسلم)",
        "english": "Narrated from 'Aishah (may Allah be pleased with her) who said: \"A black liberated slave-girl had a small tent (Khaba') in the mosque, and she used to come to me and converse with me...\" This is part of a longer Hadith. Agreed upon (Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 205,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { اَلْبُزَاقُ فِي اَلْمَسْجِدِ خَطِيئَةٌ وَكَفَّارَتُهَا دَفْنُهَا } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": " سیدنا انس رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مسجد میں تھوکنا گناہ ہے۔ اس کا کفارہ تھوک کو دفن کرنا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated from Anas (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"Spitting (or expectorating) in the mosque is a sin, and its expiation (Kaffarah) is to bury it (or cover it up).\" Agreed upon (Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 206,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { لَا تَقُومُ اَلسَّاعَةُ حَتَّى يَتَبَاهَى اَلنَّاسُ فِي اَلْمَسَاجِدِ } أَخْرَجَهُ اَلْخَمْسَةُ إِلَّا اَلتِّرْمِذِيُّ , وَصَحَّحَهُ اِبْنُ خُزَيْمَة .",
        "urdu": " سیدنا انس رضی اللہ عنہ ہی نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”قیامت اس وقت تک قائم نہ ہو گی جب تک کہ لوگ مسجدوں (کی تعمیر و آرائش) میں ایک دوسرے پر فخر نہ کرنے لگیں۔“ اسے پانچوں (احمد، ابوداؤد، نسائی، ابن ماجہ) نے روایت کیا ہے بجز ترمذی کے۔ ابن خزیمہ نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated from Anas (may Allah be pleased with him) that the Messenger of Allah (peace and blessings be upon him) said: \"The Hour will not be established until the people boast to one another about (the construction/decoration of) the mosques.\" Reported by the five (Ahmad, Abu Dawud, An-Nasa’i, and Ibn Majah, excluding At-Tirmidhi), and Ibn Khuzaymah graded it Sahih (Authentic)."
      }
    },

    {
      "id": 207,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { مَا أُمِرْتُ بِتَشْيِيدِ اَلْمَسَاجِدِ } أَخْرَجَهُ أَبُو دَاوُدَ , وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مجھے مساجد کی آرائش و زیبائش (پختہ اور بلند عمارت) کا حکم نہیں دیا گیا۔“ اسے ابوداؤد نے روایت کیا ہے۔ ابن حبان نے اس کو صحیح قرار دیا ہے۔",
        "english": "Narrated from Ibn 'Abbas (may Allah be pleased with them both) who said: The Messenger of Allah (peace and blessings be upon him) said: \"I have not been commanded to erect lofty (Tashyīd) or elaborate structures for the mosques.\" Reported by Abu Dawud, and Ibn Hibban graded it Sahih (Authentic)."
      }
    },

    {
      "id": 208,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { عُرِضَتْ عَلَيَّ أُجُورُ أُمَّتِي , حَتَّى اَلْقَذَاةُ يُخْرِجُهَا اَلرَّجُلُ مِنْ اَلْمَسْجِدِ } رَوَاهُ أَبُو دَاوُدَ , وَاَلتِّرْمِذِيُّ وَاسْتَغْرَبَهُ , وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ .‏",
        "urdu": " سیدنا انس رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مجھ پر میری امت کے (اعمال کے) ثواب پیش کیے گئے، یہاں تک کہ اس تنکے کا ثواب بھی ان میں شامل تھا، جسے آدمی مسجد سے نکال کر باہر پھینکتا ہے۔“ اس حدیث کو ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے غریب کہا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated from Anas (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"The rewards of my Ummah were presented to me, even the reward for the piece of straw (Qadhah) that a man removes from the mosque.\" Reported by Abu Dawud and At-Tirmidhi, who considered it Gharīb (unfamiliar), and Ibn Khuzaymah graded it Sahih (Authentic)."
      }
    },

    {
      "id": 209,
      "name": {
        "arabic": "وَعَنْ أَبِي قَتَادَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { إِذَا دَخَلَ أَحَدُكُمْ اَلْمَسْجِدَ فَلَا يَجْلِسْ حَتَّى يُصَلِّيَ رَكْعَتَيْنِ } مُتَّفَقٌ عَلَيْهِ .‏",
        "urdu": "سیدنا ابو قتادہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے کوئی جب (بھی) مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت (نفل) ادا کر لے۔“ (بخاری ومسلم) ",
        "english": "Narrated from Abu Qatadah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"When any one of you enters the mosque, he should not sit until he has prayed two Rak'ah (units of prayer).\" Agreed upon (Al-Bukhari and Muslim)."
      }
    }
  ]
}
