{
  "chapId": 87,
  "bookId": 10,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1064,
    "to": 1074
  },
  "hadiths": [
    {
      "id": 1064,
      "name": {
        "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَتَى بِرَجُلٍ قَدْ شَرِبَ اَلْخَمْرَ, فَجَلَدَهُ بِجَرِيدَتَيْنِ نَحْوَ أَرْبَعِينَ.‏ قَالَ: وَفَعَلَهُ أَبُو بَكْرٍ, فَلَمَّا كَانَ عُمَرُ اِسْتَشَارَ اَلنَّاسَ, فَقَالَ عَبْدُ اَلرَّحْمَنِ بْنُ عَوْفٍ: أَخَفَّ اَلْحُدُودِ ثَمَانُونَ, فَأَمَرَ بِهِ عُمَرُ } مُتَّفَقٌ عَلَيْهِ. وَلِمُسْلِمٍ: عَنْ عَلِيٍّ ‏- رضى الله عنه ‏- ‏-فِي قِصَّةِ اَلْوَلِيدِ بْنِ عَقَبَةَ‏- { جَلَدَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَرْبَعِينَ, وَأَبُو بَكْرٍ أَرْبَعِينَ, وَعُمَرُ ثَمَانِينَ, وَكُلٌّ سُنَّةٌ, وَهَذَا أَحَبُّ } إِلَيَّ.‏",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم کے پاس ایک آدمی لایا گیا جس نے شراب پی رکھی تھی۔ پس اس شخص کو دو چھڑیوں سے چالیس کے لگ بھگ کوڑے لگائے گئے۔ راوی کا بیان ہے کہ سیدنا ابوبکر رضی اللہ عنہ نے بھی یہ سزا دی۔ جب سیدنا عمر رضی اللہ عنہ کا دور خلافت آیا تو انہوں نے صحابہ رضی اللہ عنہم سے مشورہ کیا۔ سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا کہ ہلکی ترین سزا اسی کوڑے ہیں (یعنی حدِ قذف پر قیاس کرتے ہوئے)۔ چنانچہ سیدنا عمر رضی اللہ عنہ نے اسی کا حکم صادر فرمایا۔ (بخاری و مسلم)۔ اور مسلم میں حضرت علی رضی اللہ عنہ سے مروی ہے: نبی صلی اللہ علیہ وسلم نے چالیس، ابوبکر رضی اللہ عنہ نے چالیس اور عمر رضی اللہ عنہ نے اسی کوڑے لگوائے، یہ سب سنت ہے اور مجھے (اسی کوڑے) زیادہ پسند ہیں۔",
        "english": "Narrated Anas bin Malik (R.A): A man who had drunk wine was brought to the Prophet (ﷺ), and he beat him with two palm-leaf stalks about forty times. Abu Bakr (R.A) also did the same. When 'Umar (R.A) became Caliph, he consulted the people. 'Abdur-Rahman bin 'Auf (R.A) said, 'The lightest of the prescribed punishments (Hudud) is eighty (lashes).' So 'Umar ordered that. [Agreed upon]. In Muslim, narrated by 'Ali (R.A) regarding Al-Walid bin 'Uqbah: 'The Prophet (ﷺ) gave forty lashes, Abu Bakr forty, and 'Umar eighty. All are Sunnah, but this (eighty) is dearer to me.'"
      }
    },

    {
      "id": 1065,
      "name": {
        "arabic": " وَعَنْ مُعَاوِيَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ قَالَ فِي شَارِبِ اَلْخَمْرِ: { إِذَا شَرِبَ فَاجْلِدُوهُ, ثُمَّ إِذَا شَرِبَ [ اَلثَّانِيَةِ ] فَاجْلِدُوهُ, ثُمَّ إِذَا شَرِبَ اَلثَّالِثَةِ فَاجْلِدُوهُ, ثُمَّ إِذَا شَرِبَ اَلرَّابِعَةِ فَاضْرِبُوا عُنُقَهُ } أَخْرَجَهُ أَحْمَدُ وَهَذَا لَفْظُهُ, وَالْأَرْبَعَةُ وَذَكَرَ اَلتِّرْمِذِيُّ مَا يَدُلُّ عَلَى أَنَّهُ مَنْسُوخٌ, وَأَخْرَجَ ذَلِكَ أَبُو دَاوُدَ صَرِيحًا عَنْ اَلزُّهْرِيِّ",
        "urdu": " سیدنا معاویہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے شرابی کے متعلق فرمایا ” جب وہ شراب پئے تو اسے کوڑے مارو۔ پھر دوبارہ شراب نوشی کرے تو پھر کوڑے لگاؤ۔ پھر جب تیسری مرتبہ شراب پئے تو پھر کوڑے لگاؤ مگر جب چوتھی دفعہ شراب نوشی کرے تو اس کی گردن اڑا دو۔ “ اسے احمد نے بیان کیا ہے اور یہ الفاظ اسی کے ہیں اور چاروں نے بھی روایت کیا ہے اور ترمذی نے ذکر کیا ہے کہ اس کا قتل کرنا منسوخ ہے اور ابوداؤد نے صراحت کے ساتھ زہری سے اس کے منسوخ ہونے کی تخریج کی ہے۔",
        "english": "Narrated Mu'awiyah (RA): The Prophet (ﷺ) said regarding the one who drinks wine: 'If he drinks it, flog him. If he drinks it again (a second time), flog him. If he drinks it again (a third time), flog him. If he drinks it a fourth time, strike his neck (execute him).' [Reported by Ahmad and the four. At-Tirmidhi mentioned what indicates it is abrogated, and Abu Dawud explicitly reported the abrogation from Az-Zuhri.]"
      }
    },

    {
      "id": 1066,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا ضَرَبَ أَحَدُكُمْ فَلْيَتَّقِ اَلْوَجْهَ } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی (حد لگاتے ہوئے یا لڑائی میں) مارے تو چہرے پر مارنے سے بچے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (R.A): The Messenger of Allah (ﷺ) said: 'When any one of you strikes (or inflicts a legal punishment), he must avoid the face.'"
      }
    },

    {
      "id": 1067,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" لَا تُقَامُ اَلْحُدُودُ فِي اَلْمَسَاجِدِ\" } رَوَاهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسجدوں میں حدود (شرعی سزائیں) نافذ نہ کی جائیں۔“",
        "english": "Narrated Ibn 'Abbas (RA): The Messenger of Allah (ﷺ) said: 'The prescribed penalties (Hudud) are not to be executed in the mosques.'"
      }
    },

    {
      "id": 1068,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { لَقَدْ أَنْزَلَ اَللَّهُ تَحْرِيمَ اَلْخَمْرِ, وَمَا بِالْمَدِينَةِ شَرَابٌ يَشْرَبُ إِلَّا مِنْ تَمْرٍ } أَخْرَجَهُ مُسْلِم ٌ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ اللہ تعالیٰ نے جب شراب کو حرام قرار دیا تو اس وقت مدینہ میں کھجور کے سوا کوئی اور مشروب (بطور شراب) نہیں پیا جاتا تھا۔ (مسلم)",
        "english": "Narrated Anas (R.A): 'When Allah revealed the prohibition of wine (Khamr), there was no drink in Madinah being consumed except that made from dates (Tamr).'"
      }
    },

    {
      "id": 1069,
      "name": {
        "arabic": " وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { نَزَلَ تَحْرِيمُ اَلْخَمْرِ, وَهِيَ مِنْ خَمْسَةِ: مِنْ اَلْعِنَبِ, وَالتَّمْرِ, وَالْعَسَلِ, وَالْحِنْطَةِ, وَالشَّعِيرِ.‏ وَالْخَمْرُ: مَا خَامَرَ اَلْعَقْلَ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے روایت ہے کہ تحریم شراب کا حکم نازل ہوا اور وہ پانچ چیزوں سے تیار کی جاتی تھی۔ انگور، کھجور، شہد، گندم، جو سے اور خمر (کی تعریف یہ ہے کہ) ہر وہ چیز جو عقل کو ڈھانپ لے۔",
        "english": "Narrated 'Umar (RA): When the prohibition of wine (Khamr) was revealed, it was made from five things: Grapes, dates, honey, wheat, and barley. Khamr is that which befogs (covers) the mind."
      }
    },

    {
      "id": 1070,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { كُلُّ مُسْكِرٍ خَمْرٌ, وَكُلُّ مُسْكِرٍ حَرَامٌ } أَخْرَجَهُ مُسْلِم ٌ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے روایت بیان کی ہے کہ: ”ہر نشہ آور چیز خمر (شراب) ہے اور ہر نشہ آور چیز حرام ہے۔“ (مسلم)",
        "english": "Narrated Ibn 'Umar (R.A): The Prophet (ﷺ) said: 'Every intoxicant is Khamr (wine) and every intoxicant is forbidden.'"
      }
    },

    {
      "id": 1071,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" مَا أَسْكَرَ كَثِيرُهُ, فَقَلِيلُهُ حَرَامٌ\" } أَخْرَجَهُ أَحْمَدُ, وَالْأَرْبَعَةُ .‏ وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس چیز کی کثیر مقدار نشہ آور ہو، اس کی قلیل مقدار بھی حرام ہے۔“",
        "english": "Narrated Jabir (RA): The Messenger of Allah (ﷺ) said: 'Whatever intoxicates in large quantities, a small quantity of it is also forbidden.'"
      }
    },

    {
      "id": 1072,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُنْبَذُ لَهُ اَلزَّبِيبُ فِي اَلسِّقَاءِ, فَيَشْرَبُهُ يَوْمَهُ, وَالْغَدَ, وَبَعْدَ اَلْغَدِ, فَإِذَا كَانَ مَسَاءُ اَلثَّالِثَةِ شَرِبَهُ وَسَقَاهُ, فَإِنْ فَضَلَ شَيْءٌ أَهْرَاقَهُ } أَخْرَجَهُ مُسْلِم ٌ ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے لیے منقی کو مشکیزے میں ڈال کر نبید تیار کیا جاتا تھا۔ آپ صلی اللہ علیہ وسلم اس کو اس روز بھی اور دوسرے اور تیسرے روز بھی نوش فرماتے تھے۔ جب تیسرے روز کی شام ہوتی تو اسے نوش فرماتے اور (دوسروں کو) پلا دیتے اور اگر کچھ بچ جاتا تو اسے گرا دیتے۔ (مسلم)",
        "english": "Narrated Ibn 'Abbas (R.A): 'Raisins were soaked for the Messenger of Allah (ﷺ) in a water skin, and he would drink it on that day, the following day, and the day after that. In the evening of the third day, he would drink it and give it to others to drink, and if any was left over, he would pour it out.'"
      }
    },

    {
      "id": 1073,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" إِنَّ اَللَّهَ لَمْ يَجْعَلْ شِفَاءَكُمْ فِيمَا حَرَّمَ عَلَيْكُمْ\" } أَخْرَجَهُ اَلْبَيْهَقِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے روایت بیان کی ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ عزوجل نے جو چیز تمہارے لئے حرام قرار دے دی ہے اس میں تمہارے لئے شفاء نہیں رکھی۔“",
        "english": "Narrated Umm Salamah (RA): The Prophet (ﷺ) said: 'Indeed, Allah has not placed your cure in what He has forbidden for you.'"
      }
    },

    {
      "id": 1074,
      "name": {
        "arabic": "وَعَنْ وَائِلٍ اَلْحَضْرَمِيِّ; أَنَّ طَارِقَ بْنَ سُوَيْدٍ رَضِيَ اَللَّهُ عَنْهُمَا { سَأَلَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَنْ اَلْخَمْرِ يَصْنَعُهَا لِلدَّوَاءِ? فَقَالَ: \" إِنَّهَا لَيْسَتْ بِدَوَاءٍ, وَلَكِنَّهَا دَاءٌ\" } أَخْرَجَهُ مُسْلِمٌ.‏ وَأَبُو دَاوُدَ وَغَيْرُهُمَا",
        "urdu": "سیدنا وائل بن حضرمی سے روایت ہے کہ طارق بن سوید رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے شراب کے بارے میں پوچھا کہ وہ اسے دوا کے لیے بناتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”یہ دوا بالکل نہیں بلکہ یہ خود ایک بیماری ہے۔“ اسے مسلم اور ابوداؤد وغیرہما نے روایت کیا ہے۔",
        "english": "Narrated Wa'il al-Hadrami: Tariq bin Suwaid (R.A) asked the Prophet (ﷺ) about wine which he made for medicinal purposes. He (ﷺ) replied: 'It is not a medicine, but an ailment (disease).'"
      }
    }
  ]
}
