{
  "chapId": 105,
  "bookId": 16,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1277,
    "to": 1313
  },
  "hadiths": [
    {
      "id": 1277,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِيَّاكُمْ وَالْحَسَدَ, فَإِنَّ اَلْحَسَدَ يَأْكُلُ اَلْحَسَنَاتِ, كَمَا تَأْكُلُ اَلنَّارُ اَلْحَطَبَ } أَخْرَجَهُ أَبُو دَاوُدَ وَلِابْنِ مَاجَهْ: مِنْ حَدِيثِ أَنَسٍ نَحْوُهُ.‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اپنے آپ کو حسد سے بچاؤ اس لئے کہ حسد نیکیوں کو اس طرح کھا جاتا ہے جس طرح آگ لکڑیوں کو کھا جاتی ہے۔“ اس کی تخریج ابوداؤد نے کی ہے اور ابن ماجہ میں بھی سیدنا انس رضی اللہ عنہ سے اسی طرح مروی ہے۔",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'Beware of envy (Hasad), for envy consumes good deeds just as fire consumes wood.' [Reported by Abu Dawud, and a similar narration is in Ibn Majah from Anas]."
      }
    },

    {
      "id": 1278,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيْسَ اَلشَّدِيدُ بِالصُّرَعَةِ, إِنَّمَا اَلشَّدِيدُ اَلَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ اَلْغَضَبِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے ہی روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” کسی کو پچھاڑ دینا بہادری نہیں ہے۔ بہادر تو وہ ہے جو غصہ میں اپنے آپ کو قابومیں رکھے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'The strong man is not the one who can wrestle, but the strong man is the one who controls himself at the time of anger.' [Agreed upon]"
      }
    },

    {
      "id": 1279,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلظُّلْمُ ظُلُمَاتٌ يَوْمَ اَلْقِيَامَةِ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ظلم قیامت کے روز بہت سی تاریکیوں اور اندھیروں کا باعث ہے۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RAA): The Messenger of Allah (ﷺ) said: 'Injustice will appear as darkness on the Day of Resurrection.' [Agreed upon]"
      }
    },

    {
      "id": 1280,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ : { اِتَّقُوا اَلظُّلْمَ, فَإِنَّ اَلظُّلْمَ ظُلُمَاتٌ يَوْمَ اَلْقِيَامَةِ, وَاتَّقُوا اَلشُّحَّ , فَإِنَّهُ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ظلم سے بچو کیونکہ ظلم قیامت کے روز اندھیرے اور تاریکیاں ہوں گی۔ نیز بخیلی سے بھی بچو تم سے پہلے گزرے ہوئے لوگ اسی سے ہلاک ہوئے ہیں۔“ (مسلم)",
        "english": "Narrated Jabir (RAA): The Messenger of Allah (ﷺ) said: 'Beware of injustice, for injustice shall be darkness on the Day of Resurrection, and beware of stinginess (greed) because it destroyed those who were before you.'"
      }
    },

    {
      "id": 1281,
      "name": {
        "arabic": "وَعَنْ مَحْمُودِ بْنِ لَبِيدٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ أَخْوَفَ مَا أَخَافُ عَلَيْكُمْ اَلشِّرْكُ اَلْأَصْغَرُ: اَلرِّيَاءُ } أَخْرَجَهُ أَحْمَدُ بِسَنَدٍ حَسَنٍ.",
        "urdu": "سیدنا محمود بن لبید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” سب سے زیادہ خوف تمہارے لئے مجھے شرک اصغر کا ہے اور وہ ریاکاری ہے۔“ امام احمد نے اسے سند حسن کے ساتھ نکالا ہے۔",
        "english": "Narrated Mahmud bin Labid (RAA): The Messenger of Allah (ﷺ) said: 'The thing I fear most for you is the lesser Shirk (polytheism), i.e. Ar-Riya (showing off).'"
      }
    },

    {
      "id": 1282,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ آيَةُ اَلْمُنَافِقِ ثَلَاثٌ: إِذَا حَدَّثَ كَذَبَ, وَإِذَا وَعَدَ أَخْلَفَ, وَإِذَا ائْتُمِنَ خَانَ } مُتَّفَقٌ عَلَيْهِ. وَلَهُمَا: مِنْ حَدِيثِ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ: { وَإِذَا خَاصَمَ فَجَرَ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” منافق کی تین نشانیاں ہیں۔ جب بات کرے تو جھوٹ بولے اور جب وعدہ کرے تو وعدہ خلافی کرے اور جب اس کے پاس امانت رکھی جائے تو اس میں خیانت کرے۔“ (بخاری و مسلم) اور دونوں کے ہاں عبداللہ بن عمر رضی اللہ عنہما کی روایت میں ہے کہ ” جب لڑتا ہے تو گالی بکتا ہے۔“",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'The signs of a hypocrite are three: whenever he speaks, he tells a lie; whenever he promises, he breaks it; and whenever he is entrusted, he betrays.' [Agreed upon]. In another version from 'Abdullah bin 'Amr: 'and whenever he quarrels, he behaves imprudently (uses foul language).'"
      }
    },

    {
      "id": 1283,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ سِبَابُ اَلْمُسْلِمِ فُسُوقٌ, وَقِتَالُهُ كُفْرٌ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” مسلمان کو گالی دینا فسق ہے اور اسے قتل کرنا کفر ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn Mas'ud (RAA): The Messenger of Allah (ﷺ) said: 'Abusing a Muslim is Fusuq (an evil-doing) and killing him is Kufr (disbelief).' [Agreed upon]"
      }
    },

    {
      "id": 1284,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِيَّاكُمْ وَالظَّنَّ, فَإِنَّ اَلظَّنَّ أَكْذَبُ اَلْحَدِيثِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بدگمانی سے بچو کیونکہ بدگمانی بہت بڑا جھوٹ ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'Beware of suspicion, for suspicion is the worst of false tales.'"
      }
    },

    {
      "id": 1285,
      "name": {
        "arabic": "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ ‏- رضى الله عنه ‏- قَالَ سَمِعْتُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَا مِنْ عَبْدِ يَسْتَرْعِيهِ اَللَّهُ رَعِيَّةً, يَمُوتُ يَوْمَ يَمُوتُ, وَهُوَ غَاشٌّ لِرَعِيَّتِهِ, إِلَّا حَرَّمَ اَللَّهُ عَلَيْهِ اَلْجَنَّةَ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا معقل بن یسار رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ جس بندے کو حاکم بنا کر رعیت اس کے سپرد کر دی جائے اگر اسے ایسی حالت میں موت آئے کہ رعیت و عوام میں خیانت کا ارتکاب کرتا رہا ہو تو ایسے حاکم پر اللہ تعالیٰ اپنی جنت حرام کر دیتا ہے۔ (بخاری و مسلم)",
        "english": "Narrated Ma'qil bin Yasar (RAA): I heard the Messenger of Allah (ﷺ) saying: 'Any servant whom Allah makes in charge of a flock (subjects) and he dies while being insincere (dishonest) to them, Allah will forbid him from entering Paradise.' [Agreed upon]"
      }
    },

    {
      "id": 1286,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَللَّهُمَّ مَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا, فَشَقَّ عَلَيْهِ, فَاشْقُقْ عَلَيْهِ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” یا الٰہی! میری امت سے جو شخص کسی کام کا والی و سربراہ بنایا جائے اور وہ لوگوں کو مشقت میں مبتلا کرے تو، تو اس پر سختی فرما۔“ (مسلم)",
        "english": "Narrated 'Aishah (RAA): The Messenger of Allah (ﷺ) said: 'O Allah, whoever is given charge of any affair of my Ummah and he is harsh with them, be You harsh with him.'"
      }
    },

    {
      "id": 1287,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا قَاتَلَ أَحَدُكُمْ, فَلْيَتَجَنَّبِ اَلْوَجْهَ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے ہی روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب تم میں سے کوئی لڑائی کرے تو منہ پر مارنے سے اجتناب کرے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'When any one of you fights, he should avoid the face.'"
      }
    },

    {
      "id": 1288,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَجُلاً قَالَ: { يَا رَسُولَ اَللَّهِ! أَوْصِنِي.‏ فَقَالَ: لَا تَغْضَبْ, فَرَدَّدَ مِرَارًا.‏ قَالَ: لَا تَغْضَبْ } أَخْرَجَهُ اَلْبُخَارِيُّ.‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا مجھے کوئی نصیحت فرمائیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ” غصہ مت کیا کرو۔“ اس نے یہی سوال چند مرتبہ کیا۔ آپ صلی اللہ علیہ وسلم نے ہر مرتبہ یہی جواب ارشاد فرمایا کہ ” غصہ نہ کیا کرو۔“ (بخاری)",
        "english": "Narrated Abu Hurairah (RAA): A man said to the Messenger of Allah (ﷺ): 'Counsel me.' He (ﷺ) said: 'Do not become angry.' The man repeated his request several times, and he (ﷺ) said: 'Do not become angry.'"
      }
    },

    {
      "id": 1289,
      "name": {
        "arabic": "وَعَنْ خَوْلَةَ اَلْأَنْصَارِيَّةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ رِجَالاً يتخوَّضون فِي مَالِ اَللَّهِ بِغَيْرِ حَقٍّ, فَلَهُمْ اَلنَّارُ يَوْمَ اَلْقِيَامَةِ } أَخْرَجَهُ اَلْبُخَارِيُّ.‏",
        "urdu": "سیدہ خولہ انصاریہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” کچھ لوگ اللہ کے مال میں ناحق دخل انداز ہوتے ہیں۔ قیامت کے روز ایسے لوگوں کیلئے جہنم کی آگ ہے۔ (بخاری)",
        "english": "Narrated Khawlah al-Ansariyah (RAA): The Messenger of Allah (ﷺ) said: 'Some men deal with Allah's property (i.e. public funds) unjustly; for them is the Fire on the Day of Resurrection.' [Reported by al-Bukhari]"
      }
    },

    {
      "id": 1290,
      "name": {
        "arabic": "وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ‏-‏- فِيمَا يَرْوِي عَنْ رَبِّهِ‏- قَالَ: { يَا عِبَادِي! إِنِّي حَرَّمْتُ اَلظُّلْمَ عَلَى نَفْسِي, وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا, فَلَا تَظَّالَمُوا } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدنا ابوذر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا، ان خبروں کے متعلق جو آپ صلی اللہ علیہ وسلم اللہ تعالیٰ سے بیان فرماتے ہیں کہ اللہ تعالیٰ نے فرمایا ” اے میرے بندو! میں نے ظلم کو اپنے اوپر حرام کر لیا ہے اور تمہارے درمیان بھی حرام کر دیا ہے۔ لہذا تم ایک دوسرے پر ظلم نہ کرو۔ “ (مسلم)",
        "english": "Abu Dharr (RAA) narrated that the Messenger of Allah (ﷺ) said, reporting from his Lord (Allah): 'O My servants! I have forbidden oppression for Myself and have made it forbidden amongst you, so do not oppress one another.'"
      }
    },

    {
      "id": 1291,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَتَدْرُونَ مَا اَلْغِيبَةُ? قَالُوا: اَللَّهُ وَرَسُولُهُ أَعْلَمُ.‏ قَالَ: ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ.‏ قِيلَ: أَرَأَيْتَ إِنْ كَانَ فِي أَخِي مَا أَقُولُ? قَالَ: إِنْ كَانَ فِيهِ مَا تَقُولُ فَقَدْ اِغْتَبْتَهُ, وَإِنْ لَمْ يَكُنْ فَقَدْ بَهَتَّهُ } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” تمہیں معلوم ہے کہ غیبت کسے کہتے ہیں؟“ صحابہ رضی اللہ عنہم نے عرض کیا اللہ اور اس کا رسول ( صلی اللہ علیہ وسلم ) ہی بہتر جانتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” غیبت یہ ہے کہ تو اپنے بھائی کا ذکر برائی سے کرے۔“ کسی نے عرض کیا جو بات میں کہتا ہوں اگر وہ میرے بھائی میں پائی جائے تو؟ آپ صلی اللہ علیہ وسلم نے جواب میں ارشاد فرمایا ” جو کچھ تم اپنے بھائی کے متعلق کہتے ہو اگر وہ اس میں پائی جاتی ہے تو اس کی تو نے غیبت کی اور اگر وہ بات جو تم اس کے متعلق کہتے ہو اس میں موجود ہی نہیں تو اس پر تو نے بہتان تراشی کی ہے۔“ (مسلم)",
        "english": "Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said: 'Do you know what backbiting is?' They said: 'Allah and His Messenger know best.' He said: 'It is to mention your brother in a manner which he dislikes.' Someone asked: 'What if my brother actually has what I say about him?' He replied: 'If he has what you say about him, then you have backbitten him; but if he does not have it, then you have slandered him.'"
      }
    },

    {
      "id": 1292,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَحَاسَدُوا وَلَا تَنَاجَشُوا, وَلَا تَبَاغَضُوا, وَلَا تَدَابَرُوا, وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ, وَكُونُوا عِبَادَ اَللَّهِ إِخْوَانًا, اَلْمُسْلِمُ أَخُو اَلْمُسْلِمِ, لَا يَظْلِمُهُ, وَلَا يَخْذُلُهُ, وَلَا يَحْقِرُهُ, اَلتَّقْوَى هَا هُنَا, وَيُشِيرُ إِلَى صَدْرِهِ ثَلَاثَ مِرَارٍ, بِحَسْبِ اِمْرِئٍ مِنْ اَلشَّرِّ أَنْ يَحْقِرَ أَخَاهُ اَلْمُسْلِمَ, كُلُّ اَلْمُسْلِمِ عَلَى اَلْمُسْلِمِ حَرَامٌ, دَمُهُ, وَمَالُهُ, وَعِرْضُهُ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے ہی روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ایک دوسرے سے حسد نہ کرو اور قیمتیں نہ بڑھاؤ۔ ایک دوسرے سے بےرخی نہ اختیار کرو۔ ایک دوسرے کی پیٹھ پیچھے غیبت نہ کرو۔ ایک دوسرے کے سودے پر سودا نہ کرو۔ اللہ کے بندو! آپس میں بھائی بھائی بن جاؤ۔ مسلمان، مسلمان کا بھائی ہے۔ نہ اس پر ظلم کرتا ہے اور نہ اسے بے یار و مددگار چھوڑتا ہے اور نہ اسے حقیر ہی سمجھتا ہے۔“ اپنے سینہ کی طرف تین مرتبہ اشارہ کر کے فرمایا کہ ” تقویٰ یہاں ہے۔ کسی آدمی کیلئے بس اتنا ہی گناہ کافی ہے کہ وہ اپنے مسلمان بھائی کو حقیر سمجھے۔ ہر مسلمان پر دوسرے مسلمان کا خون، مال اور آبرو حرام ہے۔“ (مسلم)",
        "english": "Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said: 'Do not envy one another, do not outbid one another (to raise the price), do not hate one another, do not turn your backs on one another, and do not undercut one another in trade, but be slaves of Allah and brothers. A Muslim is the brother of a Muslim: he does not oppress him, nor does he fail him, nor does he despise him. Piety is here' – and he pointed to his chest three times. 'It is enough evil for a man to despise his Muslim brother. The whole of a Muslim is sacred to another Muslim: his blood, his property, and his honor.' [Reported by Muslim]"
      }
    },

    {
      "id": 1293,
      "name": {
        "arabic": "وَعَنْ قُطْبَةَ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { اَللَّهُمَّ جَنِّبْنِي مُنْكَرَاتِ اَلْأَخْلَاقِ, وَالْأَعْمَالِ, وَالْأَهْوَاءِ, وَالْأَدْوَاءِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ , وَصَحَّحَهُ اَلْحَاكِمُ وَاللَّفْظِ لَهُ.‏",
        "urdu": "سیدنا قطبہ بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعائیہ کلمات فرمایا کرتے تھے «اللهم جنبني منكرات الأخلاق والأعمال والأهواء والأدواء» ” الٰہی! مجھے برے اخلاق، برے اعمال، بری خواہشات اور بری بیماریوں سے بچا۔“ اس کو ترمذی نے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے اور یہ الفاظ اسی کے ہیں۔",
        "english": "Narrated Qutbah bin Malik (RAA): The Messenger of Allah (ﷺ) used to say: 'O Allah, keep me away from objectionable character, actions, desires and diseases.' [Reported by at-Tirmidhi, and al-Hakim graded it Sahih, and the wording is his]."
      }
    },

    {
      "id": 1294,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تُمَارِ أَخَاكَ, وَلَا تُمَازِحْهُ, وَلَا تَعِدْهُ مَوْعِدًا فَتُخْلِفَهُ } أَخْرَجَهُ اَلتِّرْمِذِيُّ بِسَنَدٍ فِيهِ ضَعْفٌ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اپنے مسلمان بھائی سے جھگڑا مت کرو اور نہ اس سے ایسا مذاق کرو (جو تکلیف دہ ہو) اور اس سے ایسا وعدہ بھی نہ کرو جس کی بعد میں خلاف ورزی کرو۔“ اسے ترمذی نے کمزور سند سے روایت کیا ہے۔",
        "english": "Ibn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said: 'Do not argue with your brother, do not make (hurtful) jokes with him, and do not make him a promise that you will then break.' [Reported by at-Tirmidhi with a weak chain]."
      }
    },

    {
      "id": 1295,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خَصْلَتَانِ لَا يَجْتَمِعَانِ فِي مُؤْمِنٍ: اَلْبُخْلُ, وَسُوءُ اَلْخُلُقِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَفِي سَنَدِهِ ضَعْفٌ.‏",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” دو خصلتیں ایسی ہیں جو کسی مومن میں جمع نہیں ہو سکتیں بخل اور برا اخلاق۔“ اسے ترمذی نے روایت کیا ہے اور اس کی سند میں ضعف ہے۔",
        "english": "Narrated Abu Sa'id al-Khudri (RAA): The Messenger of Allah (ﷺ) said: 'Two qualities are never combined in a believer: greed (stinginess) and bad character.' [Reported by at-Tirmidhi with a weak chain]."
      }
    },

    {
      "id": 1296,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ : { اَلْمُسْتَبَّانِ مَا قَالَا, فَعَلَى اَلْبَادِئِ, مَا لَمْ يَعْتَدِ اَلْمَظْلُومُ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” گالی گلوچ کرنے والے دو آدمیوں میں سے ابتداء کرنے والے پر بار گناہ ہے تاوقتیکہ مظلوم زیادتی نہ کرے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RAA): The Messenger of Allah (ﷺ) said: 'The sin of what two people say when they abuse each other is credited to the one who began it, as long as the oppressed one (the person who was initially abused) does not overstep the limits.'"
      }
    },

    {
      "id": 1297,
      "name": {
        "arabic": "وَعَنْ أَبِي صِرْمَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ ضَارَّ مُسْلِمًا ضَارَّهُ اَللَّهُ, وَمَنْ شَاقَّ مُسَلِّمًا شَقَّ اَللَّهُ عَلَيْهِ } أَخْرَجَهُ أَبُو دَاوُدَ وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ.‏",
        "urdu": "سیدنا ابوصرمہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس نے کسی مسلمان کو ضرر پہنچایا، اللہ تعالیٰ اسے ضرر دے گا اور جس نے کسی مسلمان کو مشقت میں مبتلا کیا اللہ تعالیٰ اسے مشقت اور مصیبت میں مبتلا فرمائے گا۔ “ اس حدیث کو ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے۔",
        "english": "Narrated Abu Sirmah (RAA): The Messenger of Allah (ﷺ) said: 'Whoever harms a Muslim, Allah will harm him; and whoever causes hardship to a Muslim, Allah will cause hardship to him.' [Reported by Abu Dawud and At-Tirmidhi, who graded it Hasan]."
      }
    },

    {
      "id": 1298,
      "name": {
        "arabic": "وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ يُبْغِضُ اَلْفَاحِشَ اَلْبَذِيءَ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ",
        "urdu": "سیدنا ابوالدرداء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بیشک اللہ تعالیٰ بدخو، فحش گو کو ناپسند کرتا ہے۔“ اسے ترمذی نے صحیح سند سے روایت کیا ہے۔",
        "english": "Narrated Abu ad-Darda' (RAA): The Messenger of Allah (ﷺ) said: 'Indeed, Allah hates the person who uses abusive and obscene language.' [Reported by at-Tirmidhi, who graded it Sahih]."
      }
    },

    {
      "id": 1299,
      "name": {
        "arabic": "وَلَهُ مِنْ حَدِيثِ اِبْنِ مَسْعُودٍ ‏-رَفَعَهُ‏-: { لَيْسَ اَلْمُؤْمِنُ بِالطَّعَّانِ, وَلَا اَللَّعَّانُ, وَلَا اَلْفَاحِشَ, وَلَا اَلْبَذِيءَ } وَحَسَّنَهُ, وَصَحَّحَهُ اَلْحَاكِمُ, وَرَجَّحَ اَلدَّارَقُطْنِيُّ وَقْفَهُ.‏",
        "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مومن طعنہ دینے والا، لعنت کرنے والا، فحش گو اور بدزبان نہیں ہوتا۔“ اسے ترمذی نے حسن اور حاکم نے صحیح کہا ہے، جبکہ دارقطنی نے اسے موقوف قرار دینے کو ترجیح دی ہے۔",
        "english": "Narrated Ibn Mas'ud (RAA): The Messenger of Allah (ﷺ) said: 'A believer is not one who taunts, curses, or is obscene or shameless.' [Reported by At-Tirmidhi who graded it Hasan, and Al-Hakim graded it Sahih. Ad-Daraqutni preferred its Mauquf version]."
      }
    },

    {
      "id": 1300,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَسُبُّوا اَلْأَمْوَاتَ ; فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا } أَخْرَجَهُ اَلْبُخَارِيُّ.‏",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روايت ہے كہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” فوت شدگان کو گالی نہ دو کیونکہ انہوں نے جو کچھ کیا تھا اس تک وہ پہنچ چکے ہیں۔“ (بخاری)",
        "english": "Narrated 'Aishah (RAA): The Messenger of Allah (ﷺ) said: 'Do not abuse the dead, for they have reached that which they had forwarded (their deeds).'"
      }
    },

    {
      "id": 1301,
      "name": {
        "arabic": "وَعَنْ حُذَيْفَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَدْخُلُ اَلْجَنَّةَ قَتَّاتٌ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا حذیفہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” چغل خور جنت میں داخل نہیں ہو گا۔“ (بخاری و مسلم)",
        "english": "Narrated Hudhaifah (RAA): The Messenger of Allah (ﷺ) said: 'A Qattat (talebearer/backbiter) will not enter Paradise.' [Agreed upon]"
      }
    },

    {
      "id": 1302,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ كَفَّ غَضَبَهُ, كَفَّ اَللَّهُ عَنْهُ عَذَابَهُ } أَخْرَجَهُ اَلطَّبَرَانِيُّ فِي \" اَلْأَوْسَطِ\".‏ وَلَهُ شَاهِدٌ: مِنْ حَدِيثِ اِبْنِ مُمَرَ عِنْدَ اِبْنِ أَبِي اَلدُّنْيَا",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس کسی نے اپنے غصے کو روک لیا اللہ تعالیٰ اس سے اپنا عذاب روک لے گا۔“ اسے طبرانی نے الاوسط میں نکالا ہے۔ ابن عمر رضی اللہ عنہما کی حدیث اس کی شاہد ہے جسے ابن ابی الدنیا نے نقل کیا ہے۔",
        "english": "Narrated Anas (RAA): The Messenger of Allah (ﷺ) said: 'Whoever restrains his anger, Allah will restrain His punishment from him.' [Reported by at-Tabarani in al-Awsat. It has a supporting narration from Ibn 'Umar reported by Ibn Abi ad-Dunya]."
      }
    },

    {
      "id": 1303,
      "name": {
        "arabic": "وَعَنْ أَبِي بَكْرٍ اَلصِّدِّيقِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَدْخُلُ اَلْجَنَّةَ خِبٌّ, وَلَا بَخِيلٌ, وَلَا سَيِّئُ اَلْمَلَكَةِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَفَرَّقَهُ حَدِيثَيْنِ, وَفِي إِسْنَادِهِ ضَعْفٌ.‏",
        "urdu": "سیدنا ابوبکر صدیق رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” دھوکہ باز، بخیل اور ماتحتوں کے ساتھ برا سلوک کرنے والا (بدخلق) آدمی جنت میں داخل نہیں ہو گا۔“ ترمذی نے اس کو روایت کیا ہے اور اس نے اسے دو احادیث کی صورت میں الگ الگ بیان کیا ہے اور اس کی سند میں ضعف ہے۔",
        "english": "Narrated Abu Bakr as-Siddiq (RAA): The Messenger of Allah (ﷺ) said: 'A deceiver, a miser, and one who treats those under his authority badly will not enter Paradise.' [Reported by at-Tirmidhi, who divided it into two Hadiths, and its chain contains weakness]."
      }
    },

    {
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَسَمَّعَ حَدِيثَ قَوْمٍ, وَهُمْ لَهُ كَارِهُونَ, صُبَّ فِي أُذُنَيْهِ اَلْأْنُكُ يَوْمَ اَلْقِيَامَةِ } يَعْنِي: اَلرَّصَاصَ.‏ أَخْرَجَهُ اَلْبُخَارِيُّ.",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جو کوئی کسی قوم کی بات سننے کی سعی کرے (کان لگائے) جبکہ وہ اسے ناپسند کرتے ہوں تو قیامت کے روز اس کے دونوں کانوں میں سیسہ ڈالا جائے گا۔“ «آنك» کا معنی پگھلا ہوا سیسہ ہے۔ (بخاری)",
        "english": "Narrated Ibn 'Abbas (RAA): The Messenger of Allah (ﷺ) said: 'Whoever listens to the talk of people who are not in favor of his listening, then molten lead will be poured into his ears on the Day of Resurrection.' [Reported by al-Bukhari]"
      }
    },

    {
      "id": 1305,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ طُوبَى لِمَنْ شَغَلَهُ عَيْبُهُ عَنْ عُيُوبِ اَلنَّاسِ } أَخْرَجَهُ اَلْبَزَّارُ بِإِسْنَادٍ حَسَنٍ.‏",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اس شخص کے لیے خوشخبری (مبارک باد) ہے جس کو اپنے عیبوں کی فکر نے دوسرے لوگوں کے عیوب تلاش کرنے سے روک دیا۔ “ اس روایت کو بزار نے حسن سند سے نکالا ہے۔",
        "english": "Narrated Anas (RAA): The Messenger of Allah (ﷺ) said: 'Glad tidings to him who is occupied with his own faults instead of the faults of others.' [Reported by al-Bazzar with a Hasan chain]."
      }
    },

    {
      "id": 1306,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَعَاظَمَ فِي نَفْسِهِ, وَاخْتَالَ فِي مِشْيَتِهِ, لَقِيَ اَللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ } أَخْرَجَهُ اَلْحَاكِمُ وَرِجَالُهُ ثِقَاتٌ.",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو کوئی اپنے آپ کو بڑا سمجھے اور اپنی چال میں تکبر (اکڑ) پیدا کرے، وہ اللہ سے اس حال میں ملے گا کہ اللہ اس پر سخت غضب ناک ہو گا۔“ (حاکم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'Whoever thinks highly of himself and walks with a haughty gait will meet Allah while He is angry with him.'"
      }
    },

    {
      "id": 1307,
      "name": {
        "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْعَجَلَةُ مِنَ اَلشَّيْطَانِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَقَالَ: حَسَنٌ.",
        "urdu": "سیدنا سہل بن سعد رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جلد بازی و عجلت پسندی شیطانی کام ہے۔ “ اس کو ترمذی نے روایت کیا ہے اور اسے حسن قرار دیا ہے۔",
        "english": "Narrated Sahl bin Sa'd (RAA): The Messenger of Allah (ﷺ) said: 'Haste is from Satan.' [Reported by at-Tirmidhi, who graded it Hasan]."
      }
    },

    {
      "id": 1308,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلشُّؤْمُ: سُوءُ اَلْخُلُقِ } أَخْرَجَهُ أَحْمَدُ وَفِي إِسْنَادِهِ ضَعْفٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بد خلقی نحوست ہے۔“ (احمد)",
        "english": "Narrated 'Aishah (RA): Allah's Messenger (ﷺ) said: 'Ill-nature (bad character) is an evil omen (unluckiness).'"
      }
    },

    {
      "id": 1309,
      "name": {
        "arabic": " وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّعَّانِينَ لَا يَكُونُونَ شُفَعَاءَ, وَلَا شُهَدَاءَ يَوْمَ اَلْقِيَامَةِ } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": " سیدنا ابوالدرداء رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بلاشبہ لعنت کرنے والے قیامت کے روز نہ سفارش کرنے والے ہوں گے اور نہ گواہی دینے والے۔“ (مسلم)",
        "english": "Narrated Abu ad-Darda' (RAA): The Messenger of Allah (ﷺ) said: 'Those who frequently resort to cursing will neither be intercessors nor witnesses on the Day of Resurrection.' [Reported by Muslim]"
      }
    },

    {
      "id": 1310,
      "name": {
        "arabic": "وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ عَيَّرَ أَخَاهُ بِذَنْبٍ, لَمْ يَمُتْ حَتَّى يَعْمَلَهُ } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَسَنَدُهُ مُنْقَطِعٌ.‏",
        "urdu": "سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اپنے کسی (مسلمان) بھائی کو ایسے گناہ پر شرمندہ کرے (جس سے وہ توبہ کر چکا ہو)، وہ اس وقت تک نہیں مرے گا جب تک خود وہ گناہ نہ کر لے۔“ (ترمذی)",
        "english": "Narrated Mu'adh bin Jabal (RA): Allah's Messenger (ﷺ) said: 'Whoever taunts his brother for a sin (he committed), will not die until he himself commits it.' Reported by At-Tirmidhi who graded it Hasan, but its chain of narrators is broken (Munqati')."
      }
    },

    {
      "id": 1311,
      "name": {
        "arabic": "وَعَنْ بَهْزِ بْنِ حَكِيمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ: قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ وَيْلٌ لِلَّذِي يُحَدِّثُ, فَيَكْذِبُ ; لِيَضْحَكَ بِهِ اَلْقَوْمُ, وَيْلٌ لَهُ, ثُمَّ وَيْلٌ لَهُ } أَخْرَجَهُ اَلثَّلَاثَةُ, وَإِسْنَادُهُ قَوِيٌّ",
        "urdu": "سیدنا بہز بن حکیم اپنے باپ سے اور انہوں نے اپنے دادا (معاویہ بن حیدہ) سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ہلاکت ہے اس شخص پر جو بات کرتا ہے تو جھوٹ بولتا ہے تاکہ اس کے ذریعے لوگوں کو ہنسائے۔ اس پر ہلاکت ہے، پھر اس پر ہلاکت ہے۔“",
        "english": "Narrated Bahz bin Hakim, on his father's authority from his grandfather (Mu'awiyah bin Haidah): The Messenger of Allah (ﷺ) said: 'Woe to him who tells lies to make people laugh. Woe to him, woe to him!'"
      }
    },

    {
      "id": 1312,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { كَفَّارَةٌ مَنْ اِغْتَبْتَهُ أَنْ تَسْتَغْفِرَ لَهُ } رَوَاهُ اَلْحَارِثُ بْنُ أَبِي أُسَامَةَ بِسَنَدٍ ضَعِيفٍ.‏ ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص کی تم نے غیبت کی ہو، اس کا کفارہ یہ ہے کہ تم اس کے لیے مغفرت کی دعا کرو۔“ (اسے حارث بن ابی اسامہ نے ضعیف سند سے روایت کیا ہے)۔",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) said: 'The atonement (expiation) for backbiting someone is that you should ask Allah to forgive him.' Reported by al-Harith bin Abi Usamah with a weak chain of narrators."
      }
    },

    {
      "id": 1313,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَبْغَضُ اَلرِّجَالِ إِلَى اَللَّهِ اَلْأَلَدُّ اَلْخَصِمُ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بندوں میں سے اللہ کے نزدیک سب سے ناپسندیدہ شخص وہ ہے جو بہت زیادہ جھگڑالو ہو۔“ (مسلم)",
        "english": "Narrated 'Aishah (RAA): The Messenger of Allah (ﷺ) said: 'The most detestable man to Allah is the most quarrelsome person (who gives into disputes).'"
      }
    }
  ]
}
