{
  "chapId": 70,
  "bookId": 8,
  "summary": {
    "urdu": [
      "اسلام میں عورت کو یہ حق دیا گیا ہے کہ اگر وہ شوہر کے ساتھ گزارا نہ کر سکتی ہو تو خلع (علیحدگی) کا مطالبہ کر سکتی ہے۔",
      "خلع کی صورت میں عورت پر لازم ہے کہ وہ شوہر سے لیا ہوا مہر (یا اس کے برابر مال) اسے واپس کر دے۔",
      "خلع کے ذریعے ہونے والی علیحدگی کی عدت صرف ایک حیض ہے تاکہ رحم کی صفائی کا علم ہو سکے۔",
      "اگر بیوی شوہر کے دین اور اخلاق سے مطمئن ہو لیکن فطری عدم مطابقت کی بنا پر ناشکری یا گناہ کا اندیشہ ہو، تب بھی خلع لیا جا سکتا ہے۔"
    ],
    "english": [
      "In Islam, a woman is granted the right to seek Khula (annulment) if she finds it impossible to continue living with her husband.",
      "In a Khula proceeding, the wife is required to return the dower (Mahr) or the property given by the husband as a settlement for the separation.",
      "The waiting period (Iddah) for a woman who has obtained Khula is established as one menstrual cycle to ensure she is not pregnant.",
      "A wife may seek Khula even if there is no defect in the husband's character or religion, provided she fears she cannot fulfill his rights or maintain the limits of Islam."
    ]
  },
  "description": {
    "urdu": "یہ باب خلع کی مشروعیت، اس کے مالی معاوضے (مہر کی واپسی) اور خلع لینے والی عورت کی عدت کے احکامات بیان کرتا ہے۔",
    "english": "This chapter details the legality of Khula (divorce initiated by the wife), the financial compensation involved, and the prescribed waiting period (Iddah) for the woman."
  },
  "hadithRange": {
    "from": 914,
    "to": 914
  },
  "hadiths": [
    {
      "id": 914,
      "name": {
        "arabic": "عَنْ اِبْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- { أَنَّ اِمْرَأَةَ ثَابِتِ بْنِ قَيْسٍ أَتَتْ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَقَالَتْ : يَا رَسُولَ اَللَّهِ ! ثَابِتُ بْنُ قَيْسٍ مَا أَعِيبُ عَلَيْهِ فِي خُلُقٍ وَلَا دِينٍ , وَلَكِنِّي أَكْرَهُ اَلْكُفْرَ فِي اَلْإِسْلَامِ , قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ? \" , قَالَتْ : نَعَمْ .‏ قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" اِقْبَلِ اَلْحَدِيقَةَ , وَطَلِّقْهَا تَطْلِيقَةً } رَوَاهُ اَلْبُخَارِيُّ .‏ وَفِي رِوَايَةٍ لَهُ : { وَأَمَرَهُ بِطَلَاقِهَا } وَلِأَبِي دَاوُدَ , وَاَلتِّرْمِذِيِّ وَحَسَّنَهُ : { أَنَّ اِمْرَأَةَ ثَابِتِ بْنِ قَيْسٍ اِخْتَلَعَتْ مِنْهُ , فَجَعَلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عِدَّتَهَا حَيْضَةً }",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ ثابت بن قیس رضی اللہ عنہ کی اہلیہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کیا۔ یا رسول اللہ! میں ثابت بن قیس رضی اللہ عنہ کے اخلاق اور دین میں کوئی عیب نہیں لگاتی۔ لیکن اسلام میں کفر (ناشکری یا ناموافقت) کو ناپسند کرتی ہوں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کیا تو اس کا باغ واپس کر دے گی؟“ وہ بولی ہاں! تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”(اے ثابت)! اپنا باغ لے لو اور اسے طلاق دے دو۔“ (بخاری) ابوداؤد اور ترمذی میں ہے کہ انہوں نے خلع کیا اور نبی کریم صلی اللہ علیہ وسلم نے اس کیلئے عدت خلع ایک حیض مقرر فرمائی۔",
        "english": "Narrated Ibn 'Abbas (RA): The wife of Thabit bin Qais came to the Prophet (ﷺ) and said, 'O Messenger of Allah! I do not blame Thabit for any defects in his character or his religion, but I dislike to behave in un-Islamic manner (disbelief in Islam/ingratitude).' On that the Messenger of Allah (ﷺ) said, 'Will you give back the garden which he gave you as Mahr (dower)?' She said, 'Yes.' Then the Prophet (ﷺ) said to Thabit, 'Accept your garden, and divorce her at once.' [Reported by Al-Bukhari]. In a narration by Abu Dawud and At-Tirmidhi, the Prophet (ﷺ) fixed her Iddah (waiting period) as one menstrual cycle."
      }
    }
  ]
}
