{
  "chapId": 5,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 53,
    "to": 61
  },
  "hadiths": [
    {
      "id": 53,
      "name": {
        "arabic": " عَنْ اَلْمُغِيرَةِ بْنِ شُعْبَةَ  - رضى الله عنه  - قَالَ: { كُنْتُ مَعَ اَلنَّبِيِّ  - صلى الله عليه وسلم  -فَتَوَضَّأَ, فَأَهْوَيْتُ لِأَنْزِعَ خُفَّيْهِ, فَقَالَ: \"دَعْهُمَا, فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ\" فَمَسَحَ عَلَيْهِمَا } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ روایت کرتے ہیں کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا، آپ صلی اللہ علیہ وسلم نے وضو کرنا شروع کیا تو میں آپ صلی اللہ علیہ وسلم کے موزے اتارنے کیلئے لپکا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”چھوڑ دو میں نے جب یہ موزے پہنے تھے تو میں وضو سے تھا۔“ پھر آپ صلی اللہ علیہ وسلم نے ان پر مسح فرمایا۔ (بخاری و مسلم)  ",
        "english": "Narrated Al-Mughīrah ibn Shuʿbah (may Allah be pleased with him): \"I was with the Prophet (ﷺ) and he performed Wudu (ablution). I bent down to remove his **leather socks (Khuffayn)**, but he said: 'Leave them, for I put them on while my feet were pure (ṭāhiratayn).' Then he wiped over them.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 54,
      "name": {
        "arabic": "وَلِلْأَرْبَعَةِ عَنْهُ إِلَّا النَّسَائِيَّ: { أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -مَسَحَ أَعْلَى اَلْخُفِّ وَأَسْفَلَهُ } وَفِي إِسْنَادِهِ ضَعْف ٌ",
        "urdu": "(مغیرہ بن شعبہ رضی اللہ عنہ) نسائی کے علاوہ باقی سنن کی تین کتابوں میں مغیرہ بن شعبہ رضی اللہ عنہ ہی سے یہ الفاظ منقول ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے موزوں کے اوپر اور نیچے دونوں جانب مسح کیا۔ اس روایت کی سند ضعیف ہے۔ ",
        "english": "(Also narrated from Al-Mughīrah ibn Shuʿbah, excluding An-Nasā’ī): \"The Prophet (ﷺ) wiped over the **top of the Khuff** (leather sock) and its **bottom**.\" The chain of this narration is weak."
      }
    },

    {
      "id": 55,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ  - رضى الله عنه  - قَالَ: { لَوْ كَانَ اَلدِّينُ بِالرَّأْيِ لَكَانَ أَسْفَلُ اَلْخُفِّ أَوْلَى بِالْمَسْحِ مِنْ أَعْلَاهُ, وَقَدْ رَأَيْتُ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -يَمْسَحُ عَلَى ظَاهِرِ خُفَّيْهِ } أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَن ٍ",
        "urdu": "وعن علي رضي الله عنه أنه قال: لو كان الدين بالرأي لكان أسفل الخف أولى بالمسح من أعلاه، وقد رأيت رسول الله صلى الله عليه وآله وسلم يمسح على ظاهر خفيه. أخرجه أبو داود بإسناد حسن. ",
        "english": "Narrated Ali (may Allah be pleased with him) who said: \"If the religion were based on **personal opinion (al-Ra'y)**, then the bottom of the leather sock would be more deserving of being wiped than the top. But I saw the Messenger of Allah (ﷺ) wiping over the **top surface of his Khuffayn (leather socks).**\" Narrated by Abu Dawud with a Ḥasan (good) chain."
      }
    },

    {
      "id": 56,
      "name": {
        "arabic": "وَعَنْ صَفْوَانَ بْنِ عَسَّالٍ  - رضى الله عنه  - قَالَ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -يَأْمُرُنَا إِذَا كُنَّا سَفْرًا أَنْ لَا نَنْزِعَ خِفَافَنَا ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ, إِلَّا مِنْ جَنَابَةٍ وَلَكِنْ مِنْ غَائِطٍ, وَبَوْلٍ, وَنَوْمٍ } أَخْرَجَهُ النَّسَائِيُّ, وَاَلتِّرْمِذِيُّ وَاللَّفْظُ لَهُ, وَابْنُ خُزَيْمَةَ وَصَحَّحَاه ُ",
        "urdu": " سیدنا صفوان بن عسال رضی اللہ عنہ روایت کرتے ہیں کہ جب ہم مسافر ہوتے تو رسول اللہ صلی اللہ علیہ وسلم ہمیں حکم دیتے کہ ”ہم تین دن اور تین راتیں موزے نہ اتاریں، الایہ کہ حالت جنابت لاحق ہو جائے۔ البتہ بیت الخلاء جانے کی صورت میں، پیشاب اور نیند کی وجہ سے اتارنے کی ضرورت نہیں۔“",
        "english": "Narrated Ṣafwān ibn ʿAssāl (may Allah be pleased with him): \"When we were travelling, the Messenger of Allah (ﷺ) commanded us not to remove our Khuffayn (leather socks) for **three days and nights**, except in the case of major impurity (**Janābah**); but (we could keep them on) after defecating, urinating, or sleeping.\" Narrated by An-Nasā’ī and At-Tirmidhī (the wording is his), and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 57,
      "name": {
        "arabic": "وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ  - رضى الله عنه  - قَالَ: { جَعَلَ اَلنَّبِيُّ  - صلى الله عليه وسلم  -ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ لِلْمُسَافِرِ, وَيَوْمًا وَلَيْلَةً لِلْمُقِيمِ.  يَعْنِي: فِي اَلْمَسْحِ عَلَى اَلْخُفَّيْنِ } أَخْرَجَهُ مُسْلِم ٌ ",
        "urdu": " سیدنا علی رضی اللہ عنہ سے منقول ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مسافر کے لئے موزوں پر مسح کے لئے تین شب و روز اور مقیم کے لئے ایک دن رات مدت مقرر فرمائی ہے۔ (مسلم)",
        "english": "Narrated ʿAlī ibn Abī Ṭālib (may Allah be pleased with him) who said: \"The Prophet (ﷺ) appointed **three days and nights** for the **traveler** and **one day and night** for the **resident** (meaning, for wiping over the Khuffayn).\" Narrated by Muslim."
      }
    },

    {
      "id": 58,
      "name": {
        "arabic": " وَعَنْ ثَوْبَانَ  - رضى الله عنه  - قَالَ: { بَعَثَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -سَرِيَّةً, فَأَمَرَهُمْ أَنْ يَمْسَحُوا عَلَى اَلْعَصَائِبِ  - يَعْنِي: اَلْعَمَائِمَ  -وَالتَّسَاخِينِ - يَعْنِي: اَلْخِفَافَ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِم ُ",
        "urdu": "سیدنا ثوبان رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے ایک سریہ (یعنی چھوٹا لشکر) روانہ فرمایا اور انہیں پگڑیوں اور موزوں پر مسح کرنے کا حکم دیا۔ اسے احمد اور ابوداؤد نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Thawbān (may Allah be pleased with him): \"The Messenger of Allah (ﷺ) sent out a **small detachment (Sariyyah)**, and he commanded them to wipe over the **headbands (al-ʿAṣā’ib)**—meaning turbans (al-ʿAmā’im)—and over the **coverings for the feet (at-Tasākhīn)**—meaning the Khuffayn (leather socks).\" Narrated by Ahmad and Abu Dawud, and authenticated as Sahih by Al-Hākim."
      }
    },

    {
      "id": 59,
      "name": {
        "arabic": "وَعَنْ عُمَرَ  -مَوْقُوفًا - و]عَنْ] أَنَسٍ  -مَرْفُوعًا -: { إِذَا تَوَضَّأَ أَحَدُكُمْ وَلَبِسَ خُفَّيْهِ فَلْيَمْسَحْ عَلَيْهِمَا, وَلْيُصَلِّ فِيهِمَا, وَلَا يَخْلَعْهُمَا إِنْ شَاءَ إِلَّا مِنْ جَنَابَةٍ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ, وَالْحَاكِمُ وَصَحَّحَه ُ ",
        "urdu": " سیدنا عمر رضی اللہ عنہ سے موقف اور سیدنا انس رضی اللہ عنہ سے مرفوع روایت ہے کہ ”جب تم میں سے کوئی موزے پہن کر وضو کرے تو ان پر مسح کر لینا چاہیئے اور ان کو پہنے ہوئے نماز پڑھ لے۔ اگر چاہے تو ان کو نہ اتارے، الایہ کہ غسل جنابت کی ضرورت پیش آ جائے۔“ اسے دارقطنی نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated from ʿUmar (Mawqūf—stopped at the Companion) and from Anas (Marfūʿ—traced to the Prophet ﷺ): \"When any of you performs Wudu (ablution) and puts on his Khuffayn (leather socks), he should wipe over them, and he may pray in them, and he should not take them off if he wishes, **except for Janābah** (major impurity).\" Narrated by Ad-Dāraquṭnī and authenticated as Sahih by Al-Ḥākim."
      }
    },

    {
      "id": 60,
      "name": {
        "arabic": " وَعَنْ أَبِي بَكْرَةَ  - رضى الله عنه  - عَنْ اَلنَّبِيِّ  - صلى الله عليه وسلم  -{ أَنَّهُ رَخَّصَ لِلْمُسَافِرِ ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ, وَلِلْمُقِيمِ يَوْمًا وَلَيْلَةً, إِذَا تَطَهَّرَ فَلَبِسَ خُفَّيْهِ: أَنْ يَمْسَحَ عَلَيْهِمَا } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ",
        "urdu": "سیدنا ابوبکرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت بیان کی ہے کہ آپ صلی اللہ علیہ وسلم نے مسافر کے لیے (مسح کی مدت) تین دن اور تین راتوں کی رخصت فرمائی ہے اور مقیم کیلئے ایک دن اور ایک رات۔ اس حالت میں کہ اس نے باوضو ہو کر موزے پہنے ہوں تو ان پر مسح کر لینا چاہیئے۔ اسے دارقطنی نے روایت کیا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔  ",
        "english": "Narrated Abū Bakrah (may Allah be pleased with him) from the Prophet (ﷺ): \"He granted a concession (Rukhṣah) for the **traveler** of **three days and nights**, and for the **resident** of **one day and night**, that if a person purifies himself and then puts on his Khuffayn (leather socks), he may wipe over them.\" Narrated by Ad-Dāraquṭnī and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 61,
      "name": {
        "arabic": " وَعَنْ أُبَيِّ بْنِ عِمَارَةَ  - رضى الله عنه  - أَنَّهُ قَالَ: { يَا رَسُولَ اَللَّهِ أَمْسَحُ عَلَى اَلْخُفَّيْنِ? قَالَ: \"نَعَمْ\" قَالَ: يَوْمًا? قَالَ: \"نَعَمْ\", قَالَ: وَيَوْمَيْنِ? قَالَ: \"نَعَمْ\", قَالَ: وَثَلَاثَةً? قَالَ: \"نَعَمْ, وَمَا شِئْتَ\" أَخْرَجَهُ أَبُو دَاوُدَ, وَقَالَ: لَيْسَ بِالْقَوِيِّ }",
        "urdu": "سیدنا ابی بن عمارۃ رضی اللہ عنہ روایت کرتے ہیں کہ میں نے عرض کیا یا رسول اللہ! کیا میں موزوں پر مسح کر سکتا ہوں؟ فرمایا ”ہاں کر سکتے ہو“ عرض کیا ایک دن؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں ایک دن“ عرض کیا دو دن؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں دو دن“ میں نے عرض کیا تین دن؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”ہاں تین دن اور جب تک تیری مرضی ہو۔“ ابوداؤد نے اسے روایت کیا ہے اور ساتھ ہی کہا ہے کہ یہ حدیث قوی نہیں ہے۔ ",
        "english": "Narrated Ubayy ibn ʿUmārah (may Allah be pleased with him) who said: \"O Messenger of Allah, may I wipe over the Khuffayn (leather socks)?\" He said: \"Yes.\" He asked: \"A day?\" He said: \"Yes.\" He asked: \"And two days?\" He said: \"Yes.\" He asked: \"And three?\" He said: \"Yes, and **as long as you wish**.\" Narrated by Abu Dawud, who said: \"It is not strong.\""
      }
    }
  ]
}