{
  "chapId": 95,
  "bookId": 12,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1168,
    "to": 1170
  },
  "hadiths": [
    {
      "id": 1168,
      "name": {
        "arabic": "عَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَقَّ عَنْ اَلْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَعَبْدُ اَلْحَقِّ لَكِنْ رَجَّحَ أَبُو حَاتِمٍ إِرْسَالَهُ وَأَخْرَجَ اِبْنُ حِبَّانَ: مِنْ حَدِيثِ أَنَسٍ نَحْوَهُ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے سیدنا حسن رضی اللہ عنہ اور سیدنا حسین رضی اللہ عنہ کی طرف سے ایک ایک مینڈھے سے عقیقہ کیا۔ اسے ابوداؤد نے روایت کیا ہے، ابن خزیمہ، ابن جارود اور عبدالحق نے اسے صحیح کہا ہے لیکن ابوحاتم نے اس کے مرسل ہونے کو ترجیح دی ہے۔ نیز ابن حبان نے سیدنا انس رضی اللہ عنہ کے حوالہ سے اسی طرح روایت کیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) offered an 'Aqiqa (sacrifice for a newborn) for al-Hasan and al-Husain, a ram for each. [Reported by Abu Dawud; Ibn Khuzaima, Ibn al-Jarud and 'Abdul-Haqq graded it Sahih (authentic), but Abu Hatim preferred its being Mursal (disconnected)]. Ibn Hibban reported the same on the authority of Anas (RA)."
      }
    },

    {
      "id": 1169,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَمْرَهُمْ; أَنْ يُعَقَّ عَنْ اَلْغُلَامِ شَاتَانِ مُكَافِئَتَانِ, وَعَنْ اَلْجَارِيَةِ شَاةٌ } رَوَاهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ وَأَخْرَجَ اَلْخَمْسَةُ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ نَحْوَهُ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ لڑکے کی طرف سے دو بکریاں ایک جیسی اور لڑکی کی طرف سے ایک بکری عقیقہ کی جائے۔ اسے ترمذی نے روایت کیا ہے اور صحیح کہا ہے، اور پانچوں (احمد اور اصحاب سنن) نے ام کرز کعبیہ سے اسی طرح روایت کیا ہے۔",
        "english": "Narrated 'Aisha (RA): Allah's Messenger (ﷺ) commanded them to sacrifice two comparable sheep for a male newborn and one sheep for a female. [Reported by at-Tirmidhi who graded it Sahih]. Al-Khamsa (Ahmad and the four Sunan compilers) reported similar from Umm Kurz al-Ka'biyah."
      }
    },

    {
      "id": 1170,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { كُلُّ غُلَامٍ مُرْتَهَنٌ بِعَقِيقَتِهِ, تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ, وَيُحْلَقُ, وَيُسَمَّى } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا سمرہ رضی اللہ عنہ سے روایت ہے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ہر بچہ اپنے عقیقہ کے عوض رہن (گروی) ہوتا ہے۔ پیدائش کے ساتویں روز اس کا عقیقہ کیا جائے، سر کے بال منڈائے جائیں اور اس کا نام رکھا جائے۔“",
        "english": "Narrated Samurah (RA): The Messenger of Allah (ﷺ) said: 'Every boy is pawned (mortgaged) against his 'Aqiqa, which should be sacrificed on his behalf on the seventh day, his head should be shaved, and he should be given a name.'"
      }
    }
  ]
}
