{
  "chapId": 58,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 785,
    "to": 787
  },
  "hadiths": [
    {
      "id": 785,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا مَاتَ اَلْإِنْسَانُ اِنْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثٍ : صَدَقَةٍ جَارِيَةٍ ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالَحٍ يَدْعُو لَهُ } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ”جب انسان وفات پا جاتا ہے تو اس کا عمل منقطع ہو جاتا ہے مگر تین عمل ایسے ہیں جن کا اجر و ثواب اسے مرنے کے بعد بھی ملتا رہتا ہے۔ صدقہ جاریہ، علم جس سے فائدہ اٹھایا جاتا ہو، صالح اولاد جو مرنے والے کیلئے دعا کرے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"When a human being dies, his deeds come to an end except for three: ongoing charity (Sadaqah Jariyah), knowledge from which people derive benefit, and a righteous son (or child) who prays for him.\""
      }
    },

    {
      "id": 786,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ , فَأَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-يَسْتَأْمِرُهُ فِيهَا , فَقَالَ : يَا رَسُولُ اَللَّهِ ! إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ لَمْ أُصِبْ مَالًا قَطُّ هُوَ أَنْفَسُ عِنْدِي مِنْه ُ .‏ قَالَ : \" إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا , وَتَصَدَّقْتَ بِهَا \" .‏ قَالَ : فَتَصَدَّقَ بِهَا عُمَرُ , [غَيْرَ] أَنَّهُ لَا يُبَاعُ أَصْلُهَا, وَلَا يُورَثُ , وَلَا يُوهَبُ , فَتَصَدَّقَ بِهَا فِي اَلْفُقَرَاءِ , وَفي اَلْقُرْبَى , وَفِي اَلرِّقَابِ , وَفِي سَبِيلِ اَللَّهِ , وَابْنِ اَلسَّبِيلِ , وَالضَّيْفِ , لَا جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ , وَيُطْعِمَ صَدِيقاً } غَيْرَ مُتَمَوِّلٍ مَالًا .‏ مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ .",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ سیدنا عمر رضی اللہ عنہ کو خیبر میں زمین ملی تھی۔ وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مشورہ لینے حاضر ہوئے اور عرض کیا: یا رسول اللہ! مجھے خیبر میں ایسی نفیس زمین ملی ہے کہ اس سے پہلے کبھی اتنا قیمتی مال مجھے نہیں ملا۔ آپ اس کے بارے میں کیا حکم دیتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم چاہو تو اس کی اصل (زمین) کو روک لو اور اس کی پیداوار صدقہ کر دو۔“ چنانچہ سیدنا عمر رضی اللہ عنہ نے اسے اس شرط پر صدقہ کر دیا کہ نہ اصل زمین بیچی جائے گی، نہ وراثت میں دی جائے گی اور نہ ہبہ کی جائے گی۔ انہوں نے اسے فقراء، رشتہ داروں، غلاموں کو آزاد کرانے، اللہ کی راہ میں، مسافروں اور مہمانوں کے لیے وقف کر دیا۔ اس کے متولی کے لیے کوئی حرج نہیں کہ وہ دستور کے مطابق اس میں سے خود کھائے اور دوست کو کھلائے بشرطیکہ وہ مال جمع کرنے والا نہ ہو۔",
        "english": "Narrated Ibn 'Umar (RA): 'Umar bin al-Khattab acquired a piece of land in Khaibar and came to the Prophet (ﷺ) to seek his advice. He said, \"O Messenger of Allah! I have acquired land in Khaibar that is more valuable than any property I have ever possessed. What do you command me to do with it?\" He (ﷺ) replied, \"If you wish, you can freeze its original form (as an endowment) and give its fruits in charity.\" So, 'Umar gave it in charity on the condition that its corpus should not be sold, inherited, or given away as a gift. He devoted it to the poor, kinsmen, slaves, Allah's cause, wayfarers, and guests. There is no sin on the person who administers it to eat from it in a reasonable manner or to feed a friend, provided he does not accumulate wealth from it."
      }
    },

    {
      "id": 787,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { بَعَثَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عُمَرَ عَلَى اَلصَّدَقَةِ .‏ .‏ } اَلْحَدِيثَ , وَفِيهِ : { وَأَمَّا خَالِدٌ فَقَدْ اِحْتَبَسَ أَدْرَاعَهُ وَأَعْتَادَهُ فِي سَبِيلِ اَللَّهِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سیدنا عمر رضی اللہ عنہ کو صدقات کی وصولی پر مقرر فرما کر بھیجا۔ (الحدیث) اور اس میں ہے کہ ”رہا خالد (رضی اللہ عنہ) کا معاملہ، تو انہوں نے اپنی تمام زرہیں اور جنگی ساز و سامان اللہ کے راستے میں وقف کر رکھا ہے۔“ (متفق علیہ) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) sent 'Umar (RA) to collect Zakat. (The narrator then mentioned the rest of the Hadith, which contains): \"As for Khalid (bin al-Walid), he has devoted his shields and weapons (as an endowment/Waqf) for the cause of Allah.\" [Agreed upon]."
      }
    }
  ]
}