{
  "chapId": 26,
  "bookId": 2,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 406,
    "to": 414
  },
  "hadiths": [
    {
      "id": 406,
      "name": {
        "arabic": " عَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { خَرَجَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-مُتَوَاضِعًا, مُتَبَذِّلًا, مُتَخَشِّعًا, مُتَرَسِّلًا, مُتَضَرِّعًا, فَصَلَّى رَكْعَتَيْنِ, كَمَا يُصَلِّي فِي اَلْعِيدِ, لَمْ يَخْطُبْ خُطْبَتَكُمْ هَذِهِ } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَأَبُو عَوَانَةَ, وَابْنُ حِبَّانَ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم بڑی تواضع کے ساتھ سادہ لباس میں نہایت عاجزی و انکساری، بہت خشوع اور بڑی زاری اور تضرع کرتے ہوئے نماز کے لئے باہر نکلے۔ عید کی نماز کی طرح لوگوں کو دو رکعات نماز پڑھائی۔ تمہارے خطبہ کی طرح خطبہ ارشاد نہیں فرمایا۔ اسے پانچوں نے روایت کیا ہے اور ترمذی، ابوعوانہ اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (PBUH) went out (to the place of prayer) in a state of humility, wearing simple clothes, in a submissive and supplicating mood. He then offered two Rak'at as he used to do for the 'Eid prayer, but he did not deliver a sermon like this one of yours. Reported by the five (Ahmad and the four Sunan compilers) and At-Tirmidhi, Abu Awanah and Ibn Hibban graded it Sahih."
      }
    },

    {
      "id": 407,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { شَكَا اَلنَّاسُ إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قُحُوطَ الْمَطَرِ, فَأَمَرَ بِمِنْبَرٍ, فَوُضِعَ لَهُ فِي اَلْمُصَلَّى, وَوَعَدَ اَلنَّاسَ يَوْمًا يَخْرُجُونَ فِيهِ, فَخَرَجَ حِينَ بَدَا حَاجِبُ اَلشَّمْسِ, فَقَعَدَ عَلَى اَلْمِنْبَرِ, فَكَبَّرَ وَحَمِدَ اَللَّهَ, ثُمَّ قَالَ: \"إِنَّكُمْ شَكَوْتُمْ جَدَبَ دِيَارِكُمْ, وَقَدْ أَمَرَكُمْ اَللَّهُ أَنْ تَدْعُوَهُ, وَوَعَدَكُمْ أَنْ يَسْتَجِيبَ لَكُمْ, ثُمَّ قَالَ: اَلْحَمْدُ لِلَّهِ رَبِّ اَلْعَالَمِينَ, اَلرَّحْمَنِ اَلرَّحِيمِ, مَالِكِ يَوْمِ اَلدِّينِ, لَا إِلَهَ إِلَّا اَللَّهُ يَفْعَلُ مَا يُرِيدُ, اَللَّهُمَّ أَنْتَ اَللَّهُ, لَا إِلَهَ إِلَّا أَنْتَ, أَنْتَ اَلْغَنِيُّ وَنَحْنُ اَلْفُقَرَاءُ, أَنْزِلْ عَلَيْنَا الْغَيْثَ, وَاجْعَلْ مَا أَنْزَلْتَ قُوَّةً وَبَلَاغًا إِلَى حِينٍ\" ثُمَّ رَفَعَ يَدَيْهِ, فَلَمْ يَزَلْ حَتَّى رُئِيَ بَيَاضُ إِبِطَيْهِ, ثُمَّ حَوَّلَ إِلَى اَلنَّاسِ ظَهْرَهُ, وَقَلَبَ رِدَاءَهُ, وَهُوَ رَافِعٌ يَدَيْهِ, ثُمَّ أَقْبِلَ عَلَى اَلنَّاسِ وَنَزَلَ, وَصَلَّى رَكْعَتَيْنِ, فَأَنْشَأَ اَللَّهُ سَحَابَةً, فَرَعَدَتْ, وَبَرَقَتْ, ثُمَّ أَمْطَرَتْ } رَوَاهُ أَبُو دَاوُدَ وَقَالَ: \"غَرِيبٌ, وَإِسْنَادُهُ جَيِّدٌ\"",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ لوگوں نے رسول اللہ ﷺ سے بارش نہ ہونے کی شکایت کی۔ آپ ﷺ نے عید گاہ میں منبر رکھنے کا حکم دیا اور لوگوں سے ایک دن کا وعدہ کیا جس میں وہ باہر نکلیں۔ آپ ﷺ اس وقت نکلے جب سورج کا کنارہ ظاہر ہوا۔ منبر پر بیٹھ کر تکبیر و حمد کے بعد فرمایا: ”تم نے خشک سالی کی شکایت کی، اللہ نے تمہیں دعا کا حکم دیا اور قبولیت کا وعدہ فرمایا۔“ پھر اللہ کی حمد و ثناء بیان کی اور دعا فرمائی: ”اے اللہ! تو ہی اللہ ہے، تیرے سوا کوئی معبود نہیں، تو غنی ہے اور ہم فقیر ہیں، ہم پر بارش نازل فرما۔“ پھر آپ ﷺ نے اتنے ہاتھ اٹھائے کہ بغلوں کی سفیدی نظر آنے لگی، پھر پیٹھ پھیر کر چادر پلٹی اور دو رکعت نماز پڑھائی، جس کے بعد بادل گرجے اور بارش ہونے لگی۔",
        "english": "Narrated 'Aisha (RA): The people complained to the Messenger of Allah (ﷺ) about the lack of rain. So he gave orders for a pulpit (minbar), and it was placed in the place of prayer (Musalla). He appointed a day for the people to come out. He came out when the rim of the sun appeared and sat on the pulpit. He glorified Allah and praised Him, then said: 'You have complained of the drought in your areas. Allah has commanded you to supplicate Him and promised that He would respond to you.' He then praised Allah and supplicated: 'O Allah, You are Allah, there is no god but You, the Rich, while we are the poor. Send down rain upon us and make what You send down a strength and satisfaction for us for a time.' He then raised his hands until the whiteness of his armpits was visible. He then turned his back to the people and inverted his cloak while keeping his hands raised. He then faced the people, descended and offered two rak'ahs. Then Allah produced a cloud, it thundered and lightened, then it rained."
      }
    },

    {
      "id": 408,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلًا دَخَلَ اَلْمَسْجِدَ يَوْمَ اَلْجُمُعَةِ, وَالنَّبِيُّ ‏- صلى الله عليه وسلم ‏-قَائِمٌ يَخْطُبُ.‏ فَقَالَ: يَا رَسُولَ اَللَّهِ, هَلَكَتِ اَلْأَمْوَالُ, وَانْقَطَعَتِ اَلسُّبُلُ, فَادْعُ اَللَّهَ يُغِيثُنَا, فَرَفَعَ يَدَيْهِ, ثُمَّ قَالَ: \"اَللَّهُمَّ أَغِثْنَا, اَللَّهُمَّ أَغِثْنَا...\" } فَذَكَرَ اَلْحَدِيثَ، وَفِيهِ اَلدُّعَاءُ بِإِمْسَاكِهَا مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ ایک آدمی جمعہ کے روز مسجد میں داخل ہوا، اس وقت نبی کریم صلی اللہ علیہ وسلم کھڑے خطبہ ارشاد فرما رہے تھے، وہ بولا یا رسول اللہ! اموال (مویشی) ہلاک ہو گئے اور آمدورفت کے راستے بند ہو گئے ہیں۔ اللہ کے حضور دعا فرمائیں کہ وہ ہم پر بارش نازل فرمائے۔ آپ صلی اللہ علیہ وسلم نے اسی وقت اپنے ہاتھ اوپر اٹھائے اور دعا فرمائی: «اللهم أغثنا اللهم أغثنا» (یا الٰہی! ہم پر بارش برسا)۔ اس میں بارش کے بند کروانے کی دعا کا بھی ذکر ہے۔ (متفق علیہ)",
        "english": "Narrated Anas (RA): A man entered the mosque on a Friday while the Prophet (PBUH) was standing delivering the Khutbah (sermon). He said, 'O Messenger of Allah, livestock are dying and the roads are cut off; please supplicate to Allah to provide us with rain.' He (PBUH) raised his hands and said, 'O Allah! Bless us with rain. O Allah! Bless us with rain.' The Hadith continues to mention the supplication for the rain to stop. (Agreed Upon)"
      }
    },

    {
      "id": 409,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ; { أَنَّ عُمَرَ ‏- رضى الله عنه ‏- كَانَ إِذَا قَحِطُوا يَسْتَسْقِي بِالْعَبَّاسِ بْنِ عَبْدِ اَلْمُطَّلِبِ.‏ وَقَالَ: اَللَّهُمَّ إِنَّا كُنَّا نَسْتَسْقِي إِلَيْكَ بِنَبِيِّنَا فَتَسْقِينَا, وَإِنَّا نَتَوَسَّلُ إِلَيْكَ بِعَمِّ نَبِيِّنَا فَاسْقِنَا، فَيُسْقَوْنَ } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا انس رضی اللہ عنہ ہی سے مروی ہے کہ سیدنا عمر رضی اللہ عنہ جب لوگ قحط میں مبتلا ہو جاتے تو سیدنا عباس بن عبدالمطلب رضی اللہ عنہ کو وسیلہ بنا کر بارش طلب فرماتے تھے اور یوں دعا کرتے کہ اے اللہ! ہم تجھ سے تیرے نبی کریم صلی اللہ علیہ وسلم کے واسطہ سے بارش طلب کرتے تھے تو ہمیں باران رحمت سے نواز دیتا تھا اور اب ہم تیرے حضور تیرے نبی ( صلی اللہ علیہ وسلم ) کے چچا کو بطور وسیلہ لائے ہیں لہٰذا تو ہمیں بارش سے سیراب فرما دے (اس دعا کی قبولیت کے نتیجہ میں) ان کو بارش سے سیراب کیا جاتا تھا۔",
        "english": "Narrated Anas (RA): Whenever there was a drought, 'Umar bin Al-Khattab used to ask Al-Abbas bin 'Abdul-Muttalib to supplicate Allah for rain. He would say, 'O Allah! We used to ask our Prophet to supplicate You for rain and You would bless us with rain, and now we ask our Prophet's uncle to supplicate You for rain, so bless us with rain.' And so it would rain."
      }
    },

    {
      "id": 410,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ قَالَ: { أَصَابَنَا ‏-وَنَحْنُ مَعَ رَسُولِ اَللَّهِ‏- ‏- صلى الله عليه وسلم ‏-مَطَرٌ قَالَ: فَحَسَرَ ثَوْبَهُ, حَتَّى أَصَابَهُ مِنَ اَلْمَطَرِ, وَقَالَ: \"إِنَّهُ حَدِيثُ عَهْدٍ بِرَبِّهِ\" } رَوَاهُ مُسْلِمٌ.",
        "urdu": "سیدنا انس رضی اللہ عنہ ہی سے یہ حدیث بھی مروی ہے کہ ہم ایک دفعہ بارش کی لپیٹ میں آ گئے اور رسول اللہ صلی اللہ علیہ وسلم ہمارے ساتھ تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے اپنے بدن اطہر سے کپڑا اوپر اٹھایا کہ بارش آپ صلی اللہ علیہ وسلم کے جسم اطیب پر پڑنے لگی اور ارشاد فرمایا کہ ”یہ اپنے آقا و مالک کے ہاں سے نئی نئی (تحفہ کی صورت میں) آ رہی ہے۔“ (مسلم)",
        "english": "Narrated Anas (RA): It rained upon us while we were with the Messenger of Allah (PBUH). The Messenger of Allah (PBUH) uncovered his garment (from a part of his body) until the rain fell upon him. He said, 'It has just come from its Lord.'"
      }
    },

    {
      "id": 411,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا رَأَى اَلْمَطَرَ قَالَ: { اَللَّهُمَّ صَيِّبًا نَافِعًا } أَخْرَجَاهُ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم جب بارش کو دیکھتے تو اس طرح دعا مانگتے۔ «اللهم صيبا نافعا» ”اے اللہ! اس بارش کو منافع بخش و سود مند بنا دے۔ “",
        "english": "Narrated Aisha (RA): Whenever the Messenger of Allah (ﷺ) saw rain, he would say: 'O Allah, let it be a beneficial downpour (Allahumma sayyiban nafi'an).'"
      }
    },

    {
      "id": 412,
      "name": {
        "arabic": "وَعَنْ سَعْدٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-دَعَا فِي اَلِاسْتِسْقَاءِ: { اَللَّهُمَّ جَلِّلْنَا سَحَابًا, كَثِيفًا, قَصِيفًا, دَلُوقًا, ضَحُوكًا, تُمْطِرُنَا مِنْهُ رَذَاذًا, قِطْقِطًا, سَجْلًا, يَا ذَا اَلْجَلَالِ وَالْإِكْرَامِ } رَوَاهُ أَبُو عَوَانَةَ فِي \"صَحِيحِهِ\"",
        "urdu": "سیدنا سعد رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے دعا استسقاء میں یہ دعا مانگی «اللهم جللنا سحابا كثيفا قصيفا دلوقا ضحوكا تمطرنا منه رذاذا قطقطا سجلا يا ذا الجلال والإكرام» ”یا الٰہی! ہمیں ایسے بادل سے جو ساری زمین پر چھایا ہوا ہو، گہرا ہو، کڑکنے والا، زور سے برسنے والا، چمکنے گرجنے والا، تہ بہ تہ ہو، سے بارش کی باریک بوندیں بہت زیادہ برسا دے۔ اے بزرگی اور عزت کے مالک!۔“ (مسند ابی عوانہ)",
        "english": "Narrated Sa'd (RA): The Prophet (PBUH) supplicated during the prayer for rain (Istisqa): 'O Allah, cover us with a thick cloud, one that is thunderous and heavy with rain, pouring and lightning, from which You rain upon us fine drops, continuous drizzle, and heavy downpour; O Owner of Majesty and Honor.' Reported by Abu 'Awanah in his Sahih."
      }
    },

    {
      "id": 413,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { خَرَجَ سُلَيْمَانُ عَلَيْهِ اَلسَّلَامُ يَسْتَسْقِي, فَرَأَى نَمْلَةً مُسْتَلْقِيَةً عَلَى ظَهْرِهَا رَافِعَةً قَوَائِمَهَا إِلَى اَلسَّمَاءِ تَقُولُ: اَللَّهُمَّ إِنَّا خَلْقٌ مِنْ خَلْقِكَ, لَيْسَ بِنَا غِنًى عَنْ سُقْيَاكَ, فَقَالَ: ارْجِعُوا لَقَدْ سُقِيتُمْ بِدَعْوَةِ غَيْرِكُمْ } رَوَاهُ أَحْمَدُ وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ”سیدنا سلیمان علیہ السلام بارش طلب کرنے کے لئے باہر نکلے تو انہوں نے ایک چیونٹی کو پشت کے بل ٹانگیں آسمان کی جانب اٹھائے ہوئے دیکھا جو بارگاہ رب العزت میں عرض کر رہی تھی۔ الٰہی ہم تیری مخلوق ہیں تیری دوسری مخلوق کی طرح، ہم بھی تیری بارش سے بے نیاز و مستغنی نہیں ہیں، یہ سن کر سیدنا سلیمان علیہ السلام نے فرمایا چلو واپس چلیں تمہیں بارش سے سیراب کر دیا گیا، غیروں کی دعا کی بدولت۔“",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: \"Prophet Sulaiman (AS) went out to pray for rain (Istisqa), and he saw an ant lying on its back with its legs raised towards the sky, saying: 'O Allah, we are one of Your creations, we cannot do without Your water.' Sulaiman said (to the people): 'Go back, for rain has been given to you through the supplication of others (besides yourselves).\""
      }
    },

    {
      "id": 414,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اسْتَسْقَى فَأَشَارَ بِظَهْرِ كَفَّيْهِ إِلَى اَلسَّمَاءِ } أَخْرَجَهُ مُسْلِمٌ ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے بارش کے لئے دعا فرمائی تو اپنے دونوں ہاتھ الٹی حالت میں آسمان کی طرف اٹھا کر اشارہ فرمایا۔ (مسلم)",
        "english": "Narrated Anas (RA): The Prophet (PBUH) supplicated for rain and he pointed with the back of his hands towards the sky. (Reported by Muslim)"
      }
    }
  ]
}