{
  "chapId": 45,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 712,
    "to": 718
  },
  "hadiths": [
    {
      "id": 712,
      "name": {
        "arabic": "عَنْ زَيْدِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَخَّصَ فِي اَلْعَرَايَا: أَنْ تُبَاعَ بِخَرْصِهَا كَيْلاً } مُتَّفَقٌ عَلَيْهِ  وَلِمُسْلِمٍ: { رَخَّصَ فِي اَلْعَرِيَّةِ يَأْخُذُهَا أَهْلُ اَلْبَيْتِ بِخَرْصِهَا تَمْرًا، يَأْكُلُونَهَا رُطَبًا }",
        "urdu": "سیدنا زید بن ثابت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے 'عرایا' میں رخصت دی کہ ان کو (درخت پر لگی حالت میں) اندازہ سے ماپ کر (خشک کھجور کے بدلے) فروخت کر دیا جائے۔ (بخاری و مسلم) اور مسلم کی روایت میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے 'عریہ' میں رخصت دی کہ گھر والے اندازے سے خشک کھجوریں دے کر (درخت سے) کھانے کے لیے تازہ کھجوریں حاصل کر لیں۔",
        "english": "Narrated Zaid bin Thabit (RA): Allah's Messenger (ﷺ) granted a concession (Rukhsa) in the case of 'Araya' (plural of 'Ariyah') that they may be sold by estimating the amount of dates they would yield. [Agreed upon]. Muslim's version has: 'He granted a concession in the case of Ariyah for a family to take it by estimating its yield in terms of dried dates, so that they may eat them as fresh dates.'"
      }
    },

    {
      "id": 713,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَخَّصَ فِي بَيْعِ اَلْعَرَايَا بِخَرْصِهَا, فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ, أَوْ فِي خَمْسَةِ أَوْسُقٍ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیعِ عرایا (درخت پر لگی تازہ کھجوروں کا خشک کھجوروں سے تبادلہ) میں رخصت عنایت فرمائی ہے کہ اسے اندازے سے فروخت کر لیا جائے، بشرطیکہ وہ پانچ وسق سے کم ہوں یا پانچ وسق تک ہوں۔",
        "english": "Narrated Abu Hurairah (R.A): Allah's Messenger (peace be upon him) gave a concession (permission) regarding the sale of 'Araya' (fresh dates on the tree) for dried dates by estimation, provided they were less than five 'Wasaqs' or five 'Wasaqs' in quantity."
      }
    },

    {
      "id": 714,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { نَهَى رَسُولُ اَللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ اَلثِّمارِ حَتَّى يَبْدُوَ صَلَاحُهَا, نَهَى اَلْبَائِعَ وَالْمُبْتَاعَ } مُتَّفَقٌ عَلَيْهِ  وَفِي رِوَايَةٍ: وَكَانَ إِذَا سُئِلَ عَنْ صَلَاحِهَا? قَالَ: \" حَتَّى تَذْهَبَ عَاهَتُهُ \"",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے پھلوں کو پکنے (کی علامات ظاہر ہونے) سے پہلے فروخت کرنے سے منع فرمایا، آپ ﷺ نے بیچنے والے اور خریدنے والے دونوں کو منع فرمایا۔ (بخاری و مسلم) اور ایک روایت میں ہے کہ جب آپ ﷺ سے پھلوں کے پکنے کی صلاحیت (صلاح) کے بارے میں پوچھا جاتا تو فرماتے: ”جب ان سے بیماری اور آفت (کے نقصان) کا اندیشہ ختم ہو جائے۔“",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) forbade the sale of fruits until they begin to ripen. He forbade both the seller and the buyer. Another narration says: When he was asked about what 'begin to ripen' meant, he said: 'Until they are no longer at risk of blight (damage/pestilence).'"
      }
    },

    {
      "id": 715,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلثِّمَارِ حَتَّى تُزْهَى.‏ قِيلَ: وَمَا زَهْوُهَا? قَالَ: \" تَحْمَارُّ وَتَصْفَارُّ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے پھلوں کو پکنے (پختگی کے آثار ظاہر ہونے) سے پہلے فروخت کرنے سے منع فرمایا ہے۔ پوچھا گیا کہ ان کے پکنے (زہو) سے کیا مراد ہے؟ آپ ﷺ نے فرمایا: ”وہ سرخ ہو جائیں یا زرد ہو جائیں۔“",
        "english": "Narrated Anas bin Malik (R.A): The Prophet (peace be upon him) forbade the sale of fruits until they are matured (Tuzha). He was asked, \"What does matured mean?\" He (peace be upon him) replied, \"Until they turn red or yellow.\""
      }
    },

    {
      "id": 716,
      "name": {
        "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اَللَّهُ عَنْهُ أَنَّ اَلنَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ اَلْعِنَبِ حَتَّى يَسْوَدَّ, وَعَنْ بَيْعِ اَلْحَبِّ حَتَّى يَشْتَدَّ } رَوَاهُ اَلْخَمْسَةُ, إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے انگور کو سیاہ (پکا ہوا) ہونے سے پہلے اور اناج کے دانے کو سخت (مضبوط) ہونے سے پہلے فروخت کرنے سے منع فرمایا ہے۔ اسے نسائی کے علاوہ پانچوں نے روایت کیا ہے، اور ابن حبان و حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Anas bin Malik (RA): The Prophet (ﷺ) forbade the sale of grapes until they become black (ripe), and the sale of grain until it becomes hard (mature)."
      }
    },

    {
      "id": 717,
      "name": {
        "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَراً فَأَصَابَتْهُ جَائِحَةٌ, فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا.‏ بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ? } رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ لَهُ: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَمَرَ بِوَضْعِ اَلْجَوَائِحِ }",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم اپنے بھائی کے ہاتھ پھل فروخت کرو اور (درخت سے اتارنے سے پہلے) اسے کوئی آفت (اسمانی بلا) پہنچ جائے تو تمہارے لیے اس سے کچھ بھی وصول کرنا حلال نہیں۔ تم کس بنیاد پر اپنے بھائی کا مال ناحق لوگے؟“ اور مسلم کی ایک روایت میں ہے کہ نبی کریم ﷺ نے آفات کی صورت میں (قیمت میں) تخفیف کرنے کا حکم دیا۔",
        "english": "Narrated Jabir bin 'Abdullah (R.A): Allah's Messenger (peace be upon him) said: \"If you sell fruit to your brother and it is stricken by a blight (natural calamity), it is not lawful for you to take anything from him. How can you take your brother's money unjustly?\" Another narration in Muslim states: \"The Prophet (peace be upon him) ordered the remission of prices due to blights.\""
      }
    },

    {
      "id": 718,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنِ اِبْتَاعَ نَخْلًا بَعْدَ أَنْ تُؤَبَّرَ, فَثَمَرَتُهَا لِلْبَائِعِ اَلَّذِي بَاعَهَا, إِلَّا أَنْ يَشْتَرِطَ اَلْمُبْتَاعُ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے کھجور کے درخت پیوند کاری کے عمل کے بعد خریدے تو اس صورت میں پھل فروخت کرنے والے کے ہوں گے۔ الا یہ کہ خریدار پھل کی شرط کر لے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: 'Whoever buys date-palm trees after they have been fecundated (pollinated), their fruit belongs to the seller who sold them, unless the buyer makes a condition (that it belongs to him).' [Agreed upon]."
      }
    }
  ]
}
