{
  "chapId": 82,
  "bookId": 9,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1022,
    "to": 1026
  },
  "hadiths": [
    {
      "id": 1022,
      "name": {
        "arabic": " عَنْ اِبْنِ عُمَرَ رِضَيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ حَمَلَ عَلَيْنَا اَلسِّلَاحَ, فَلَيْسَ مِنَّا } مُتَّفَقٌ عَلَيْهِ .‏ ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس کسی نے ہمارے خلاف ہتھیار اٹھایا، اس کا ہم سے کوئی تعلق نہیں۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn ‘Umar (RA): Allah's Messenger (ﷺ) said: \"He who reaches for weapons against us is not one of us.\""
      }
    },

    {
      "id": 1023,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ خَرَجَ عَنْ اَلطَّاعَةِ, وَفَارَقَ اَلْجَمَاعَةَ, وَمَاتَ, فَمِيتَتُهُ مِيتَةٌ جَاهِلِيَّةٌ } أَخْرَجَهُ مُسْلِمٌ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” جس کسی نے امام کی اطاعت سے خروج کیا اور مسلمانوں کی جماعت سے جدا ہو گیا اور اسی حالت میں مر گیا تو اس کی موت جاہلیت کی موت ہو گی۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"Whoever defects from obedience (to the ruler) and separates from the Muslim community and then dies, dies a death of Jahiliyyah (the pre-Islamic period of ignorance).\""
      }
    },

    {
      "id": 1024,
      "name": {
        "arabic": "وَعَنْ أَمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تَقْتُلُ عَمَّارًا اَلْفِئَةُ اَلْبَاغِيَةُ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عمار (بن یاسر) کو ایک باغی گروہ قتل کرے گا۔“ (مسلم)",
        "english": "Narrated Umm Salama (RA): Allah's Messenger (ﷺ) said: \"Ammar will be killed by the rebellious group.\""
      }
    },

    {
      "id": 1025,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ هَلْ تَدْرِي يَا اِبْنَ أُمِّ عَبْدٍ, كَيْفَ حُكْمُ اَللَّهِ فِيمَنْ بَغَى مِنْ هَذِهِ اَلْأُمَّةِ? \", قَالَ: اَللَّهُ وَرَسُولُهُ أَعْلَمُ.‏ قَالَ: \"لَا يُجْهَزُ عَلَى جَرِيحِهَا, وَلَا يُقْتَلُ أَسِيرُهَا, وَلَا يُطْلَبُ هَارِبُهَا, وَلَا يُقْسَمُ فَيْؤُهَا } رَوَاهُ اَلْبُخَارِيُّ و اَلْحَاكِمُ وَصَحَّحَهُ فَوَهِمَ; فَإِنَّ فِي إِسْنَادِهِ كَوْثَرَ بْنَ حَكِيمٍ, وَهُوَ مَتْرُوكٌ  وَصَحَّ عَنْ عَلِيٍّ مِنْ طُرُقٍ نَحْوُهُ مَوْقُوفًا.‏ أَخْرَجَهُ اِبْنُ أَبِي شَيْبَةَ, وَالْحَاكِمُ ",
        "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” اے ام عبد کے بیٹے (ابن مسعود)! کیا تجھے معلوم ہے کہ اس امت کے باغی کے متعلق اللہ تعالیٰ کا کیا حکم ہے؟“ انہوں نے عرض کیا اللہ اور اس کے رسول صلی اللہ علیہ وسلم ہی بہتر جانتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” اس کے زخمیوں کو ختم نہیں کیا جائے گا اور نہ اس کے قیدیوں کو قتل کیا جائے گا اور نہ بھاگنے والے کا پیچھا و تعاقب کیا جائے گا اور نہ ہی اس کے مال کو بطور مال غنیمت تقسیم کیا جائے گا۔“",
        "english": "Narrated Ibn ‘Umar (RA): Allah’s Messenger (ﷺ) said, “O son of Umm ‘Abd (Ibn Mas'ud)! Do you know Allah’s ruling regarding those of this Ummah who rebel?” He replied, “Allah and His Messenger know best.” He (ﷺ) said, “Their wounded are not to be finished off, their captives are not to be killed, those who flee are not to be pursued, and their property is not to be divided as spoils.”"
      }
    },

    {
      "id": 1026,
      "name": {
        "arabic": " وَعَنْ عَرْفَجَةَ بْنِ شُرَيْحٍ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ أَتَاكُمْ وَأَمَرَكُمْ جَمِيعٌ, يُرِيدُ أَنْ يُفَرِّقَ جَمَاعَتَكُمْ, فَاقْتُلُوهُ } أَخْرَجَهُ مُسْلِمٌ .‏ ",
        "urdu": "سیدنا عرفجہ بن شریح کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا: ”جو شخص تمہارے پاس آئے حالانکہ تم ایک امیر پر متفق ہو اور وہ تمہاری جماعت میں تفریق پیدا کرنا چاہتا ہو تو اسے قتل کر دو۔“ (صحیح مسلم)",
        "english": "Narrated 'Arfajah bin Shuraih: I heard Allah's Messenger (ﷺ) say: \"If anyone comes to you when you are united under one leader, desiring to undermine your unity or to cause division in your community, kill him.\""
      }
    }
  ]
}
