{
  "chapId": 68,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 892,
    "to": 904
  },
  "hadiths": [
    {
      "id": 892,
      "name": {
        "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- رَأَى عَلَى عَبْدِ اَلرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ , قَالَ : \" مَا هَذَا ? \" , قَالَ : يَا رَسُولَ اَللَّهِ ! إِنِّي تَزَوَّجْتُ اِمْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ.‏ فَقَالَ : \" فَبَارَكَ اَللَّهُ لَكَ , أَوْلِمْ وَلَوْ بِشَاةٍ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف رضی اللہ عنہ (کے جسم یا کپڑوں) پر زرد رنگ کا اثر دیکھا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا: ”یہ کیا ہے؟“ انہوں نے عرض کیا: اے اللہ کے رسول! میں نے ایک عورت سے ایک گٹھلی (پانچ درہم) کے وزن کے برابر سونا مہر دے کر نکاح کیا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ تمہیں برکت دے، ولیمہ کرو خواہ ایک بکری ہی (ذبح کرنی) کیوں نہ ہو۔“ (بخاری و مسلم)",
        "english": "Narrated Anas bin Malik (RA): The Prophet (ﷺ) saw a mark of yellow (perfume) on 'Abdur-Rahman bin 'Auf (RA) and asked, 'What is this?' He replied, 'O Messenger of Allah, I have married a woman for a dower (Mahr) of gold equal to a weight of a date stone.' He (ﷺ) said, 'May Allah bless you. Give a wedding feast (Walima) even if it is only with one sheep.'"
      }
    },

    {
      "id": 893,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا دُعِيَ أَحَدُكُمْ إِلَى اَلْوَلِيمَةِ فَلْيَأْتِهَا } مُتَّفَقٌ عَلَيْهِ وَلِمُسْلِمٍ : { إِذَا دَعَا أَحَدُكُمْ أَخَاهُ , فَلْيُجِبْ; عُرْسًا كَانَ أَوْ نَحْوَهُ }",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کسی کو ولیمہ کی دعوت دی جائے تو اسے (وہاں) ضرور جانا چاہیے۔“ (بخاری و مسلم) اور مسلم کی ایک روایت میں ہے: ”جب تم میں سے کوئی اپنے بھائی کو دعوت دے تو اسے (دعوت) قبول کرنی چاہیے، خواہ وہ شادی (ولیمہ) ہو یا اس جیسی کوئی اور دعوت۔“",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: \"When one of you is invited to a wedding feast (Walimah), he should attend it.\" [Agreed upon]. Muslim's version has: \"When one of you invites his brother, he (the guest) should respond, whether it be a wedding feast or something similar.\""
      }
    },

    {
      "id": 894,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ شَرُّ اَلطَّعَامِ طَعَامُ اَلْوَلِيمَةِ: يُمْنَعُهَا مَنْ يَأْتِيهَا , وَيُدْعَى إِلَيْهَا مَنْ يَأْبَاهَا , وَمَنْ لَمْ يُجِبِ اَلدَّعْوَةَ فَقَدْ عَصَى اَللَّهَ وَرَسُولَهُ } أَخْرَجَهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بدترین کھانا اس ولیمے کا کھانا ہے جس میں (غریبوں اور محتاجوں) کو آنے سے روک دیا جائے اور ان لوگوں کو بلایا جائے جو (شکم سیر ہونے کی وجہ سے) آنے سے انکار کریں، اور جس نے دعوت قبول نہ کی اس نے اللہ اور اس کے رسول کی نافرمانی کی۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'The worst kind of food is that of a wedding feast (Walima) to which those who would want to come (the poor) are not invited, and those who refuse to come (the rich) are invited. He who does not accept an invitation has disobeyed Allah and His Messenger.'"
      }
    },

    {
      "id": 895,
      "name": {
        "arabic": "وَعَنْهُ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ ; فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ , وَإِنْ كَانَ مُفْطِرًا فَلْيُطْعَمْ } أَخْرَجَهُ مُسْلِمٌ أَيْضًا وَلَهُ مِنْ حَدِيثِ جَابِرٍ نَحْوُهُ .‏ وَقَالَ : { فَإِنْ شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ }",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے ہی مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا: ”جب تم میں سے کسی کو دعوت دی جائے تو اسے قبول کرنا چاہیے۔ اگر وہ روزے سے ہو تو (میزبان کے لیے) دعا کرے، اور اگر روزے سے نہ ہو تو کھانا کھائے۔“ (مسلم) اور مسلم ہی میں سیدنا جابر رضی اللہ عنہ سے بھی اسی طرح کی روایت ہے جس میں ہے کہ: ”پھر اگر وہ چاہے تو کھا لے اور اگر چاہے تو چھوڑ دے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"When one of you is invited, he should accept. If he is fasting, he should pray (supplicate for the host), and if he is not fasting, he should eat.\" [Reported by Muslim]. Muslim also reported a similar Hadith from Jabir (RA), which adds: \"Then if he wishes, he may eat; and if he wishes, he may leave (it).\""
      }
    },

    {
      "id": 896,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { طَعَامُ الْوَلِيمَةِ أَوَّلَ يَوْمٍ حَقٌّ , وَطَعَامُ يَوْمِ اَلثَّانِي سُنَّةٌ, وَطَعَامُ يَوْمِ اَلثَّالِثِ سُمْعَةٌ ، وَمَنْ سَمَّعَ سَمَّعَ اللهُ بِهِ } رَوَاهُ اَلتِّرْمِذِيُّ وَاسْتَغْرَبَهُ",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ولیمہ کا کھانا پہلے روز حق ہے، دوسرے روز سنت ہے اور تیسرے روز (کھلانا) شہرت اور دکھاوا ہے، اور جو دکھاوا کرے گا اللہ تعالیٰ اس کی حقیقت لوگوں پر ظاہر کر دے گا (یا اسے سزا دے گا)۔“ اسے ترمذی نے روایت کیا ہے اور اسے غریب قرار دیا ہے۔",
        "english": "Narrated Ibn Mas'ud (RA): Allah's Messenger (ﷺ) said: 'The wedding feast (Walima) on the first day is a right (Haqq), on the second day it is Sunnah, and on the third day it is for show and reputation (Sum'ah); and whoever acts for the sake of reputation, Allah will expose him.' [Reported by At-Tirmidhi who graded it Gharib]."
      }
    },

    {
      "id": 897,
      "name": {
        "arabic": "وَعَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ : { أَوْلَمَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَلَى بَعْضِ نِسَائِهِ بِمُدَّيْنِ مِنْ شَعِيرٍ } أَخْرَجَهُ اَلْبُخَارِيُّ",
        "urdu": "سیدہ صفیہ بنت شیبہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنی بعض ازواجِ مطہرات کا ولیمہ دو مد (تقریباً سوا کلو) جو سے کیا۔ (بخاری)",
        "english": "Narrated Safiyyah bint Shaibah (RA): The Prophet (ﷺ) gave a wedding feast (Walimah) for one of his wives with two Mudds of barley. [Reported by al-Bukhari]."
      }
    },

    {
      "id": 898,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ قَالَ : { أَقَامَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلَاثَ لَيَالٍ , يُبْنَى عَلَيْهِ بِصَفِيَّةَ , فَدَعَوْتُ اَلْمُسْلِمِينَ إِلَى وَلِيمَتِهِ , فَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلَا لَحْمٍ , وَمَا كَانَ فِيهَا إِلَّا أَنْ أَمَرَ بِالْأَنْطَاعِ , فَبُسِطَتْ , فَأُلْقِيَ عَلَيْهَا اَلتَّمْرُ , وَالْأَقِطُ , وَالسَّمْنُ.‏ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے خیبر اور مدینہ کے درمیان تین روز تک قیام فرمایا۔ صفیہ رضی اللہ عنہا سے اسی مقام پر رخصتی (شب باشی) ہوئی تو میں نے مسلمانوں کو حضور صلی اللہ علیہ وسلم کے ولیمہ کی دعوت دی۔ اس دعوت میں نہ روٹی تھی اور نہ گوشت، بلکہ آپ صلی اللہ علیہ وسلم کے ارشاد کے مطابق چمڑے کے دسترخوان بچھائے گئے اور ان پر کھجوریں، پنیر اور مکھن ڈال دیا گیا۔ (بخاری و مسلم)",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) stayed for three nights between Khaibar and Madinah, and there he consummated his marriage with Safiyyah (RA). I invited the Muslims to his wedding feast (Walima). There was neither bread nor meat in it; rather, he ordered for leather cloths (Nita') to be spread out, and dates, dried yogurt (Akit), and clarified butter (Samn) were placed on them."
      }
    },

    {
      "id": 899,
      "name": {
        "arabic": "وَعَنْ رَجُلٍ مِنْ أَصْحَابِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا اِجْتَمَعَ دَاعِيَانِ , فَأَجِبْ أَقْرَبَهُمَا بَابًا , فَإِنْ سَبَقَ أَحَدُهُمَا فَأَجِبِ اَلَّذِي سَبَقَ } رَوَاهُ أَبُو دَاوُدَ , وَسَنَدُهُ ضَعِيفٌ",
        "urdu": "اصحابِ نبی ﷺ میں سے ایک صحابی رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا: ”جب دو بلانے والے (داعی) جمع ہو جائیں تو اس کی دعوت قبول کرو جس کا دروازہ زیادہ قریب ہو، اور اگر ان میں سے ایک پہلے دعوت دے چکا ہو تو اس کی دعوت قبول کرو جس نے پہل کی ہے۔“",
        "english": "Narrated by a man from among the Companions of the Prophet (ﷺ): The Prophet (ﷺ) said: \"If two people extend an invitation at the same time, accept the one whose door is closer to you. But if one of them invited you before the other, accept the one who invited you first.\""
      }
    },

    {
      "id": 900,
      "name": {
        "arabic": "وَعَنْ أَبِي جُحَيْفَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا آكُلُ مُتَّكِئًا } رَوَاهُ اَلْبُخَارِيُّ",
        "urdu": "سیدنا ابوحجیفہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” میں ٹیک لگا کر نہیں کھایا کرتا۔“ (بخاری)",
        "english": "Narrated Abu Juhaifa (RA): Allah's Messenger (ﷺ) said: 'I do not eat while leaning (against something).'"
      }
    },

    {
      "id": 901,
      "name": {
        "arabic": "وَعَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ يَا غُلَامُ ! سَمِّ اَللَّهَ , وَكُلْ بِيَمِينِكَ , وَكُلْ مِمَّا يَلِيكَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا عمر بن ابی سلمہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے فرمایا ”اے بچے! اللہ کا نام لے کر کھانا شروع کرو اور اپنے سیدھے ہاتھ سے کھاؤ اور اپنے سامنے سے کھاؤ۔“ (بخاری و مسلم)",
        "english": "Narrated 'Umar bin Abi Salama (RA): The Prophet (ﷺ) said to me, 'O young boy! Mention the Name of Allah (say Bismillah), eat with your right hand, and eat from what is directly in front of you.'"
      }
    },

    {
      "id": 902,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أُتِيَ بِقَصْعَةٍ مِنْ ثَرِيدٍ، فَقَالَ : \"كُلُوا مِنْ جَوَانِبِهَا, وَلَا تَأْكُلُوا مِنْ وَسَطِهَا, فَإِنَّ اَلْبَرَكَةَ تَنْزِلُ فِي وَسَطِهَا } رَوَاهُ اَلْأَرْبَعَةُ , وَهَذَا لَفْظُ النَّسَائِيِّ , وَسَنَدُهُ صَحِيحٌ وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { مَا عَابَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-طَعَامًا قَطُّ , كَانَ إِذَا اِشْتَهَى شَيْئًا أَكَلَهُ , وَإِنْ كَرِهَهُ تَرَكَهُ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ثرید سے بھرا ہوا ایک بڑا پیالہ پیش کیا گیا۔ آپ صلی اللہ علیہ وسلم نے ہدایت فرمائی ”پیالے کے کناروں سے کھاؤ، درمیان سے نہ کھاؤ، اس لیے کہ برکت کا نزول درمیان میں ہوتا ہے۔“ اسے چاروں نے روایت کیا ہے اور یہ الفاظ نسائی کے ہیں اور اس کی سند صحیح ہے۔ حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کبھی بھی کسی کھانے کو برا نہیں کہا۔ جب کسی چیز کی خواہش ہوتی تو تناول فرما لیتے اور اگر ناپسند فرماتے تو چھوڑ دیتے۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): The Prophet (ﷺ) was brought a large bowl of Tharid (a dish of bread and meat soup). He said, \"Eat from its sides and do not eat from its middle, for the blessing descends in its middle.\" [Reported by the four Imams and this is the version of An-Nasa'i, and its chain is Sahih]. Also narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) never found fault with food. If he had an inclination for it, he would eat it, and if he disliked it, he would leave it. [Agreed upon]."
      }
    },

    {
      "id": 903,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ , عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَا تَأْكُلُوا بِالشِّمَالِ ; فَإِنَّ اَلشَّيْطَانَ يَأْكُلُ بِالشِّمَالِ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا جابر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ”بائیں ہاتھ سے نہ کھاؤ، اس لیے کہ شیطان بائیں ہاتھ سے کھاتا ہے۔“ (مسلم)",
        "english": "Narrated Jabir (RA): The Messenger of Allah (ﷺ) said: 'Do not eat with the left hand, for indeed Shaitan eats with the left hand.'"
      }
    },

    {
      "id": 904,
      "name": {
        "arabic": "وَعَنْ أَبِي قَتَادَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا شَرِبَ أَحَدُكُمْ , فَلَا يَتَنَفَّسْ فِي اَلْإِنَاءِ } مُتَّفَقٌ عَلَيْهِ وَلِأَبِي دَاوُدَ : عَنْ اِبْنِ عَبَّاسٍ نَحْوُهُ , وَزَادَ : { أَوْ يَنْفُخْ فِيهِ } وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے جب کوئی مشروب پی رہا ہو تو برتن میں سانس نہ لے۔“ (بخاری و مسلم) ابن عباس رضی اللہ عنہما سے اسی طرح کی روایت ابوداؤد میں بھی ہے اور اس میں اتنا اضافہ ہے ”اس میں پھونک نہ مارے۔“ اور ترمذی نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu Qatadah (RA): The Messenger of Allah (ﷺ) said: 'When one of you drinks, he should not breathe into the vessel.' [Agreed upon]. Abu Dawud reported it from Ibn 'Abbas (RA) with the addition: 'or blow into it.' [Authenticated by At-Tirmidhi]."
      }
    }
  ]
}
