{
  "chapId": 100,
  "bookId": 15,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1220,
    "to": 1228
  },
  "hadiths": [
    {
      "id": 1220,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"أَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ اِمْرَأً مُسْلِماً, اِسْتَنْقَذَ اَللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنَ النَّارِ\" } مُتَّفَقٌ عَلَيْهِ وَلِلتِّرْمِذِيِّ وَصَحَّحَهُ; عَنْ أَبِي أُمَامَةَ: { \"وَأَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ اِمْرَأَتَيْنِ مُسْلِمَتَيْنِ, كَانَتَا فِكَاكَهُ مِنَ النَّارِ\" } وَلِأَبِي دَاوُدَ: مِنْ حَدِيثِ كَعْبِ بْنِ مُرَّةَ: { \"وَأَيُّمَا اِمْرَأَةٍ أَعْتَقَتْ اِمْرَأَةً مُسْلِمَةً, كَانَتْ فِكَاكَهَا مِنْ اَلنَّارِ }",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جس مسلمان نے کسی مسلمان غلام کو آزاد کیا اللہ تعالیٰ اس کے ہر عضو کو اس کے ہر عضو کے بدلے جہنم کی آگ سے آزاد فرما دے گا۔ “ (بخاری و مسلم) اور ترمذی میں ابوامامہ کی روایت ہے جسے ترمذی نے صحیح قرار دیا ہے کہ ” جس مسلمان مرد نے دو مسلمان لونڈیوں کو آزاد کیا تو وہ دونوں اس مرد کے دوزخ سے آزاد ہونے کا سبب بن جائیں گی۔ “ اور ابوداؤد میں کعب بن مرہ کی روایت میں ہے کہ ” جو مسلمان خاتون کسی مسلمان لونڈی کو آزاد کرے گی تو وہ اس کی جہنم سے آزاد ہونے کا موجب ہو گی۔ “",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: \"If any Muslim man frees a Muslim slave, Allah will deliver from the Fire every limb of his for every limb of the slave.\" (Agreed upon). Also reported by At-Tirmidhi from Abu Umama (RA): \"And any Muslim man who frees two Muslim female slaves, they will be his ransom from the Fire.\" And in Abu Dawud from Ka'b bin Murrah (RA): \"And any Muslim woman who frees a Muslim female slave, she will be her ransom from the Fire.\""
      }
    },

    {
      "id": 1221,
      "name": {
        "arabic": "وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- قَالَ: سَأَلْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَيُّ اَلْعَمَلِ أَفْضَلُ? قَالَ: \"إِيمَانٌ بِاَللَّهِ, وَجِهَادٌ فِي سَبِيلِهِ\" .‏ قُلْتُ: فَأَيُّ اَلرِّقَابِ أَفْضَلُ? قَالَ: \" أَعْلَاهَا ثَمَنًا, وَأَنْفَسُهَا عِنْدَ أَهْلِهَا\" مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوذر رضی اللہ عنہ سے روایت ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ بہترین عمل کون سا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ” اللہ پر ایمان لانا اور اس کے راستہ میں جہاد کرنا“ میں نے عرض کیا کون سا غلام آزاد کرنا افضل ہے فرمایا ” وہ غلام جو قیمت میں زیادہ گراں اور مالکوں کی نظروں میں زیادہ نفیس و محبوب ہو۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Dharr (RA): I asked the Prophet (ﷺ), 'Which deed is the best?' He replied, 'Faith in Allah and Jihad in His cause.' I then asked, 'Which slave is the best to emancipate?' He said, 'The one who is highest in price and most precious to his people.'"
      }
    },

    {
      "id": 1222,
      "name": {
        "arabic": " وَعَنِ ابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ, فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ اَلْعَبْدِ, قُوِّمَ قِيمَةَ عَدْلٍ, فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ, وَعَتَقَ عَلَيْهِ اَلْعَبْدُ, وَإِذَا لَمْ يَكُنْ لَهُ مَالٌ، فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ\" } مُتَّفَقٌ عَلَيْه وَلَهُمَا: عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { \"وَإِلَّا قُوِّمَ عَلَيْهِ, وَاسْتُسْعِيَ غَيْرَ مَشْقُوقٍ عَلَيْهِ\" } ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جو شخص مشترکہ غلام میں سے اپنا حصہ آزاد کر دے اور اس کے پاس مزید اتنا مال بھی ہو کہ غلام خرید کر آزاد کر سکے تو انصاف سے اس کی قیمت مقرر کر کے دوسرے شرکاء کو ان کے حصہ کی قیمت ادا کر دے تو یہ غلام اس کی طرف سے آزاد ہو گا۔ ورنہ جتنا کچھ آزاد ہوا سو ہو چکا۔“ (بخاری و مسلم) دونوں نے ابوہریرہ رضی اللہ عنہ سے یہ الفاظ نقل کیے ہیں ” ورنہ اس کی قیمت لگائی جائے گی اور اس پر مشقت ڈالے بغیر اسے آزادی حاصل کرنے کا موقع دیا جائے گا۔“ ",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: \"If someone manumits his share in a slave and has enough money to pay the full price of the slave, a fair price should be estimated for the slave. He should then give his partners their shares and the slave will become free. Otherwise, he will be set free to the extent of the share he manumitted.\" (Agreed upon). Al-Bukhari and Muslim also narrated from Abu Hurairah (RA): \"Otherwise, the slave will be valued and will be asked to work to pay for his freedom (Sa'aya), but without being overburdened.\""
      }
    },

    {
      "id": 1223,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَجْزِي وَلَدٌ وَالِدَهُ, إِلَّا أَنْ يَجِدَهُ مَمْلُوكًا فَيُعْتِقَهُ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” کوئی بیٹا باپ کے لیے کافی نہیں۔ الایہ کہ باپ غلام ہو تو وہ اسے خرید کر آزاد کر دے۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said: 'A son does not repay his father (for his kindnesses) unless he finds him a slave, then buys him and emancipates him.'"
      }
    },

    {
      "id": 1224,
      "name": {
        "arabic": " وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ, فَهُوَ حُرٌّ\" } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جو شخص کسی ایسے قرابت دار کا مالک ہو جائے جس سے اس کا نکاح حرام ہو (ذو رحم محرم) تو وہ غلام خود بخود آزاد ہے۔“ اسے احمد اور چاروں (ابوداؤد، ترمذی، نسائی، ابن ماجہ) نے روایت کیا ہے۔ ",
        "english": "Narrated Samurah (RA): The Prophet (ﷺ) said: \"Whoever becomes the owner of a relative with whom marriage is prohibited (Dhu rahim mahram), that relative is free.\""
      }
    },

    {
      "id": 1225,
      "name": {
        "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَجُلاً أَعْتَقَ سِتَّةً مَمْلُوكِينَ لَهُ, عِنْدَ مَوْتِهِ, لَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُمْ, فَدَعَا بِهِمْ رَسُولُ اَللَّهِ صلى الله عليه وسلم فَجَزَّأَهُمْ أَثْلَاثًا, ثُمَّ أَقْرَعَ بَيْنَهُمْ, فَأَعْتَقَ اِثْنَيْنِ, وَأَرَقَّ أَرْبَعَةً, وَقَالَ لَهُ قَوْلاً شَدِيدًا } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ ایک آدمی نے اپنی موت کے وقت اپنے چھ غلام آزاد کر دیئے۔ ان غلاموں کے علاوہ اس کا کوئی اور مال نہیں تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے ان کو طلب فرمایا اور ان کے تین حصے کئے پھر ان میں قرعہ اندازی فرمائی۔ پھر آپ صلی اللہ علیہ وسلم نے دو غلاموں (ایک تہائی) کو آزاد فرما دیا اور باقی چار کو غلام رہنے دیا اور آزاد کرنے والے کے حق میں سخت کلمہ بھی فرمایا۔ (مسلم)",
        "english": "Narrated 'Imran bin Husain (RA): A man manumitted six slaves of his on his deathbed, and he had no other property besides them. The Messenger of Allah (ﷺ) called for them, divided them into three groups, and cast lots among them. He then emancipated two and kept four in slavery, and spoke harshly of the deceased man."
      }
    },

    {
      "id": 1226,
      "name": {
        "arabic": " وَعَنْ سَفِينَةَ ‏- رضى الله عنه ‏- { قَالَ: كُنْتُ مَمْلُوكًا لِأُمِّ سَلَمَةَ فَقَالَتْ: أُعْتِقُكَ, وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدِمَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مَا عِشْتَ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَالْحَاكِمُ ",
        "urdu": "سیدنا سفینہ رضی اللہ عنہ سے روایت ہے کہ میں ام سلمہ رضی اللہ عنہا کا غلام تھا، انہوں نے مجھے کہا کہ میں تجھے اس شرط پر آزاد کرتی ہوں کہ تو رسول اللہ صلی اللہ علیہ وسلم کی تاحیات خدمت بجا لاتا رہے۔ اسے احمد، ابوداؤد، نسائی اور حاکم نے روایت کیا ہے۔",
        "english": "Narrated Safinah (RA): I was a slave belonging to Umm Salamah, and she said, 'I shall emancipate you, but I stipulate that you serve Allah's Messenger (ﷺ) as long as you live.'"
      }
    },

    {
      "id": 1227,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم قَالَ: { إِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ولاء اسی کا حق ہے جو اسے آزاد کرے۔“ (بخاری و مسلم) یہ لمبی حدیث (بریرہ رضی اللہ عنہا کے قصے) کا ایک ٹکڑا ہے۔",
        "english": "Narrated Aisha (RA): The Messenger of Allah (ﷺ) said: 'The right of inheritance (Wala') belongs only to the one who emancipates (the slave).'"
      }
    },

    {
      "id": 1228,
      "name": {
        "arabic": " وَعَنِ ابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" اَلْوَلَاءُ لُحْمَةٌ كَلُحْمَةِ اَلنَّسَبِ, لَا يُبَاعُ وَلَا يُوهَبُ\" } رَوَاهُ اَلشَّافِعِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ولاء بھی نسب کی طرح ایک تعلق ہے جسے نہ فروخت کیا جا سکتا ہے اور نہ ہبہ کیا جا سکتا ہے۔“ اسے شافعی نے روایت کیا ہے اور ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Ibn 'Umar (RA): Allah's Messenger (ﷺ) said: \"The right of inheritance (Al-Wala') is a tie of relationship like the tie of lineage; it cannot be sold or given away as a gift.\""
      }
    }
  ]
}
