{
  "chapId": 89,
  "bookId": 11,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1080,
    "to": 1122
  },
  "hadiths": [
    {
      "id": 1080,
      "name": {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ رَ ضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ مَاتَ وَلَمْ يَغْزُ, وَلَمْ يُحَدِّثْ نَفْسَهُ بِهِ, مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍ } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص ایسی حالت میں مر گیا کہ اس نے نہ کبھی جہاد میں حصہ لیا اور نہ کبھی اپنے دل میں اس کا ارادہ کیا، تو اس کی موت نفاق کے ایک شعبے (حصے) پر ہوئی۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (R.A): The Messenger of Allah (ﷺ) said: 'Whoever dies without having fought in the way of Allah or having at least intended to do so, dies on a branch of hypocrisy.'"
      }
    },

    {
      "id": 1081,
      "name": {
        "arabic": " وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" جَاهِدُوا اَلْمُشْرِكِينَ بِأَمْوَالِكُمْ, وَأَنْفُسِكُمْ, وَأَلْسِنَتِكُمْ\" } رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ ",
        "urdu": " سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” مشرکین سے اپنے مالوں، اپنی جانوں اور اپنی زبانوں سے جہاد کرو۔“ اسے احمد اور نسائی نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا۔",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) said: 'Struggle (Jihad) against the polytheists with your wealth, your lives, and your tongues.'"
      }
    },

    {
      "id": 1082,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ ! عَلَى اَلنِّسَاءِ جِهَادٌ? قَالَ: \"نَعَمْ.‏ جِهَادٌ لَا قِتَالَ فِيهِ, اَلْحَجُّ وَالْعُمْرَةُ\" }.‏ رَوَاهُ اِبْنُ مَاجَه.‏ وَأَصْلُهُ فِي اَلْبُخَارِيِّ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ میں نے عرض کیا: اے اللہ کے رسول! کیا خواتین پر بھی جہاد ہے؟ آپ ﷺ نے فرمایا: ”ہاں! ان پر ایسا جہاد ہے جس میں لڑائی (قتال) نہیں، اور وہ ہے حج اور عمرہ۔“ اسے ابن ماجہ نے روایت کیا ہے اور اس کی اصل بخاری میں ہے۔",
        "english": "Narrated 'Aishah (R.A): I said, 'O Messenger of Allah! Is Jihad obligatory for women?' He (ﷺ) replied, 'Yes, there is a Jihad for them in which there is no fighting (Qital), and that is Hajj and Umrah.'"
      }
    },

    {
      "id": 1083,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَسْتَأْذِنُهُ فِي اَلْجِهَادِ.‏ فَقَالَ: \" [ أَ ] حَيٌّ وَالِدَاكَ?\" , قَالَ: نَعَمْ: قَالَ: \" فَفِيهِمَا فَجَاهِدْ\" } .‏ مُتَّفَقٌ عَلَيْهِ وَلِأَحْمَدَ, وَأَبِي دَاوُدَ: مِنْ حَدِيثِ أَبِي سَعِيدٍ نَحْوُهُ, وَزَادَ: { \"اِرْجِعْ فَاسْتَأْذِنْهُمَا, فَإِنْ أَذِنَا لَكَ; وَإِلَّا فَبِرَّهُمَا\" } ",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور وہ جہاد میں شرکت کی اجازت طلب کر رہا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ” کیا تیرے والدین بقید حیات ہیں؟ “ وہ بولا ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا ” پس ان دونوں (کی خدمت) میں جدوجہد کرو۔ “ (بخاری و مسلم) مسند احمد اور ابوداؤد میں ابوسعید کی روایت بھی اسی طرح منقول ہے۔ اس میں اضافہ ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ” واپس چلے جاؤ ان سے اجازت طلب کرو۔ پھر اگر وہ دونوں تجھے اجازت دے دیں تو درست ورنہ ان کے ساتھ نیکی اور حسن سلوک کرو۔ “ ",
        "english": "Narrated 'Abdullah bin 'Amr (RA): A man came to the Prophet (ﷺ) asking his permission to take part in Jihad. He (ﷺ) asked, \"Are your parents alive?\" He replied, \"Yes.\" He (ﷺ) said, \"Then exert yourself in their service (Jihad).\" [Agreed upon]. In a narration by Ahmad and Abu Dawud from Abu Sa'id, it is added: \"Go back and ask their permission. If they permit you, then go; otherwise, be devoted to their service (stay and serve them).\""
      }
    },

    {
      "id": 1084,
      "name": {
        "arabic": "وَعَنْ جَرِيرٍ الْبَجَلِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَنَا بَرِئٌ مِنْ كُلِّ مُسْلِمٍ يُقِيمُ بَيْنَ اَلْمُشْرِكِينَ } رَوَاهُ اَلثَّلَاثَةُ وَإِسْنَادُهُ [ صَحِيحٌ ], وَرَجَّحَ اَلْبُخَارِيُّ إِرْسَالَهُ",
        "urdu": "سیدنا جریر بجلی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں ہر اس مسلمان سے بری الذمہ ہوں جو مشرکین کے درمیان سکونت اختیار کرے۔“ اسے تینوں (ابوداؤد، ترمذی، نسائی) نے روایت کیا ہے اور اس کی سند صحیح ہے، مگر امام بخاری نے اس کے مرسل ہونے کو ترجیح دی ہے۔",
        "english": "Narrated Jarir al-Bajali (R.A): The Messenger of Allah (ﷺ) said: 'I am free from (the responsibility of) every Muslim who resides among the polytheists (Mushrikin).'"
      }
    },

    {
      "id": 1085,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" لَا هِجْرَةَ بَعْدَ اَلْفَتْحِ, وَلَكِنْ جِهَادٌ وَنِيَّةٌ\" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” فتح (مکہ) کے بعد ہجرت نہیں لیکن جہاد اور نیت باقی ہے۔ “ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Abbas (RA): The Messenger of Allah (ﷺ) said: 'There is no migration (Hijrah) after the Conquest (of Makkah), but Jihad and good intention (remain).'"
      }
    },

    {
      "id": 1086,
      "name": {
        "arabic": "وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اَللَّهِ هِيَ اَلْعُلْيَا, فَهُوَ فِي سَبِيلِ اَللَّهِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اس نیت سے لڑا کہ اللہ کا کلمہ (دین) بلند ہو، تو وہ اللہ کی راہ میں (لڑنے والا) ہے۔“ (بخاری ومسلم)",
        "english": "Narrated Abu Musa al-Ash'ari (R.A): The Messenger of Allah (ﷺ) said: 'He who fights so that Allah's Word (Islam) should be superior, then he is fighting in Allah's cause.'"
      }
    },

    {
      "id": 1087,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ اَلسَّعْدِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" لَا تَنْقَطِعُ اَلْهِجْرَةُ مَا قُوتِلَ اَلْعَدُوُّ\" } رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
        "urdu": " سیدنا عبداللہ بن سعدی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب تک دشمنوں سے جنگ جاری رہے گی ہجرت بھی جاری رہے گی۔“",
        "english": "Narrated Abdullah bin al-Sa'di (RA): The Messenger of Allah (ﷺ) said: 'Migration (Hijrah) will not end as long as the enemy is being fought.'"
      }
    },

    {
      "id": 1088,
      "name": {
        "arabic": "وَعَنْ نَافِعٍ قَالَ: { أَغَارَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى بَنِيَّ اَلْمُصْطَلِقِ, وَهُمْ غَارُّونَ, فَقَتَلَ مُقَاتِلَتَهُمْ, وَسَبَى ذَرَارِيَّهُمْ.‏ حَدَّثَنِي بِذَلِكَ عَبْدُ اَللَّهِ بْنُ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا نافع رحمہ اللہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بنو مصطلق پر شب خون مارا تو اس وقت یہ لوگ (حملے سے) بے خبر و غافل تھے۔ پس آپ صلی اللہ علیہ وسلم نے ان کے لڑائی کرنے والوں کو قتل کیا اور ان کی اولاد (اور عورتوں) کو قیدی بنا لیا۔ یہ واقعہ مجھ سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا۔ (بخاری و مسلم)",
        "english": "Narrated Nafi': Messenger of Allah (ﷺ) made a surprise attack on Banu al-Mustaliq while they were unaware and their cattle were having a drink of water. He killed those of them who fought and took their children and women as captives. Abdullah bin 'Umar (R.A) related this to me. [Agreed upon]"
      }
    },

    {
      "id": 1089,
      "name": {
        "arabic": " وَعَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ, عَنْ أَبِيهِ قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَمَّرَ أَمِيرًا عَلَى جَيْشٍ أَوْصَاهُ بِتَقْوَى اَللَّهِ, وَبِمَنْ مَعَهُ مِنْ اَلْمُسْلِمِينَ خَيْراً, ثُمَّ قَالَ: \"اُغْزُوا بِسْمِ اَللَّهِ, فِي سَبِيلِ اَللَّهِ, قَاتِلُوا مِنْ كَفَرَ بِاَللَّهِ, اُغْزُوا, وَلَا تَغُلُّوا, وَلَا تَغْدُرُوا, وَلَا تُمَثِّلُوا, وَلَا تَقْتُلُوا وَلِيداً, وَإِذَا لَقِيتَ عَدُوَّكَ مِنْ اَلْمُشْرِكِينَ فَادْعُهُمْ إِلَى ثَلَاثِ خِصَالٍ, فَأَيَّتُهُنَّ أَجَابُوكَ إِلَيْهَا, فَاقْبَلْ مِنْهُمْ, وَكُفَّ عَنْهُمْ: اُدْعُهُمْ إِلَى اَلْإِسْلَامِ فَإِنْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ.‏ ثُمَّ اُدْعُهُمْ إِلَى اَلتَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ اَلْمُهَاجِرِينَ, فَإِنْ أَبَوْا فَأَخْبَرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ اَلْمُسْلِمِينَ, وَلَا يَكُونُ لَهُمْ فِي اَلْغَنِيمَةِ وَالْفَيْءِ شَيْءٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ اَلْمُسْلِمِينَ.‏ فَإِنْ هُمْ أَبَوْا فَاسْأَلْهُمْ اَلْجِزْيَةَ, فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ, فَإِنْ أَبَوْا فَاسْتَعِنْ بِاَللَّهِ وَقَاتِلْهُمْ.‏ وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اَللَّهِ وَذِمَّةَ نَبِيِّهِ, فَلَا تَفْعَلْ, وَلَكِنْ اِجْعَلْ لَهُمْ ذِمَّتَكَ; فَإِنَّكُمْ إِنْ تُخْفِرُوا ذِمَمَكُمْ أَهْوَنُ مِنْ أَنَّ تُخْفِرُوا ذِمَّةَ اَللَّهِ, وَإِذَا أَرَادُوكَ أَنْ تُنْزِلَهُمْ عَلَى حُكْمِ اَللَّهِ, فَلَا تَفْعَلْ, بَلْ عَلَى حُكْمِكَ; فَإِنَّكَ لَا تَدْرِي أَتُصِيبُ فِيهِمْ حُكْمَ اَللَّهِ أَمْ لَا\" } أَخْرَجَهُ مُسْلِمٌ ",
        "urdu": "سیدنا سلیمان بن بریدہ اپنے باپ سے روایت کرتے ہیں کہ رسول اللہ ﷺ جب کسی لشکر کا امیر مقرر فرماتے تو اسے اللہ سے ڈرنے اور ساتھیوں کے ساتھ بھلائی کی نصیحت فرماتے، پھر فرماتے: اللہ کے نام سے اللہ کی راہ میں جہاد کرو، خیانت نہ کرو، عہد نہ توڑو، مثلہ نہ کرو اور بچوں کو قتل نہ کرو۔ جب مشرک دشمن سے ملو تو تین آپشنز دو: اسلام، جزیہ یا پھر اللہ کی مدد سے جنگ۔ اگر وہ قلعہ بند ہوں اور اللہ کا ذمہ چاہیں تو نہ دو بلکہ اپنا ذمہ دو، اور انہیں اللہ کے حکم کے بجائے اپنے حکم پر اتارو کیونکہ تم نہیں جانتے کہ اللہ کا حکم ان کے بارے میں کیا ہے۔",
        "english": "Sulaiman bin Buraida narrated from his father (RA): When the Prophet (ﷺ) appointed a commander over an army, he would advise him to fear Allah and treat the Muslims with him well. He said, 'Fight in the name of Allah; do not embezzle, do not break pledges, do not mutilate, and do not kill children. When you meet your enemies, invite them to three options: Islam, Jizya, or war. If you besiege a fort and they ask for Allah's protection, grant them your own protection instead. If they ask to be judged by Allah's law, judge them by your own judgment, for you do not know if you will hit upon Allah's judgment concerning them.'"
      }
    },

    {
      "id": 1090,
      "name": {
        "arabic": "وَعَنْ كَعْبِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا أَرَادَ غَزْوَةً وَرَّى بِغَيْرِهَا } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا کعب بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم جب کسی غزوہ پر جانا چاہتے تو توریہ (اصل ارادے کو چھپانے کے لیے ذومعنی بات) سے کام لیتے۔ (بخاری و مسلم)",
        "english": "Narrated Ka'b bin Malik (R.A): Whenever the Prophet (ﷺ) intended to go on an expedition, he would use a camouflage (Tauriya) and lead people to believe that he was heading elsewhere."
      }
    },

    {
      "id": 1091,
      "name": {
        "arabic": "وَعَنْ مَعْقِلٍ; أَنَّ اَلنُّعْمَانَ بْنَ مُقَرِّنٍ قَالَ: { شَهِدْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا لَمْ يُقَاتِلْ أَوَّلَ اَلنَّهَارِ أَخَّرَ اَلْقِتَالِ حَتَّى تَزُولَ اَلشَّمْسُ, وَتَهُبَّ اَلرِّيَاحُ, وَيَنْزِلَ اَلنَّصْرُ } رَوَاهُ أَحْمَدُ وَالثَّلَاثَةُ, وَصَحَّحَهُ اَلْحَاكِمُ .‏ وَأَصْلُهُ فِي اَلْبُخَارِيِّ ",
        "urdu": "سیدنا معقل سے روایت ہے کہ سیدنا نعمان بن مقرن رضی اللہ عنہ نے فرمایا: میں رسول اللہ ﷺ کے ساتھ (غزوات میں) حاضر رہا ہوں۔ آپ ﷺ جب دن کے آغاز میں لڑائی شروع نہ فرماتے تو پھر زوالِ آفتاب تک تاخیر فرماتے، یہاں تک کہ ہوائیں چلنے لگتیں اور (اللہ کی) مدد نازل ہوتی۔",
        "english": "Narrated Ma'qil: An-Nu'man bin Muqarrin (RA) said: 'I was present with the Messenger of Allah (ﷺ); when he did not fight at the beginning of the day, he would delay the fight until the sun had passed the meridian, the winds blew, and victory was sent down.'"
      }
    },

    {
      "id": 1092,
      "name": {
        "arabic": "وَعَنْ اَلصَّعْبِ بْنِ جَثَّامَةَ ‏- رضى الله عنه ‏- قَالَ: { سُئِلَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلدَّارِ مِنْ اَلْمُشْرِكِينَ. يُبَيِّتُونَ, فَيُصِيبُونَ مِنْ نِسَائِهِمْ وَذَرَارِيهِمْ, فَقَالَ: \"هُمْ مِنْهُمْ\" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا صعب بن جشامہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم سے مشرکین کے ان گھروں کے متعلق پوچھا گیا جن پر رات کے وقت اچانک حملہ (شب خون) کیا جاتا ہے، جس کے نتیجے میں ان کی عورتیں اور بچے بھی (نادانستہ طور پر) زد میں آکر ہلاک ہو جاتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”وہ بھی ان ہی میں سے ہیں۔“ (بخاری ومسلم)",
        "english": "Narrated As-Sa'b bin Jaththama (R.A): The Messenger of Allah (ﷺ) was asked about the polytheists' houses being attacked at night (night raids) whereby their women and children are struck. He (ﷺ) replied, 'They are from them (i.e., they follow the same legal ruling as their parents in that situation).'"
      }
    },

    {
      "id": 1093,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لِرَجُلٍ تَبِعَهُ يَوْمَ بَدْرٍ: \" اِرْجِعْ.‏ فَلَنْ أَسْتَعِينَ بِمُشْرِكٍ\" } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اس شخص سے فرمایا جو بدر کے دن آپ صلی اللہ علیہ وسلم کے ساتھ (لڑائی میں شرکت کے لیے) شامل ہو گیا تھا: ”واپس چلا جا، میں ہرگز کسی مشرک سے مدد کا طالب نہیں ہوں۔“",
        "english": "Narrated 'Aishah (RA): The Prophet (ﷺ) said to a man who followed him on the day of Badr (to fight along with him): 'Go back, for I will never seek help from a polytheist.'"
      }
    },

    {
      "id": 1094,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَأَى اِمْرَأَةً مَقْتُولَةً فِي بَعْضِ مَغَازِيهِ, فَأَنْكَرَ قَتْلَ اَلنِّسَاءِ وَالصِّبْيَانِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے کسی غزوہ میں ایک عورت کو دیکھا کہ اسے قتل کیا گیا ہے تو آپ صلی اللہ علیہ وسلم نے اس پر ناپسندیدگی کا اظہار فرمایا اور عورتوں اور بچوں کے قتل سے منع فرما دیا۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (R.A): During one of the military expeditions of the Messenger of Allah (ﷺ), a woman was found killed. On that, the Messenger of Allah (ﷺ) expressed his disapproval and forbade the killing of women and children."
      }
    },

    {
      "id": 1095,
      "name": {
        "arabic": "وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" اُقْتُلُوا شُيُوخَ اَلْمُشْرِكِينَ, وَاسْتَبْقُوا شَرْخَهُمْ\" } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ",
        "urdu": "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مشرکین کے بوڑھوں (جو جنگی تدبیر میں ماہر ہوں) کو قتل کرو اور ان کے نوجوانوں (جو ابھی لڑائی کے قابل نہ ہوئے ہوں) کو زندہ رہنے دو۔“",
        "english": "Narrated Samurah bin Jundub (RA): The Messenger of Allah (ﷺ) said: 'Kill the old men of the polytheists and spare their youth (those who have not reached puberty).'"
      }
    },

    {
      "id": 1096,
      "name": {
        "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- { أَنَّهُمْ تَبَارَزُوا يَوْمَ بَدْرٍ } رَوَاهُ اَلْبُخَارِيُّ .‏ وَأَخْرَجَهُ أَبُو دَاوُدَ مُطَوَّلاً ",
        "urdu": "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ انہوں نے (صحابہ کرام نے) بدر کے روز ان (کافروں) کو دعوت مبارزت دی (یعنی ان کے خلاف تن تنہا مقابلے کے لیے نکلے)۔ اسے بخاری نے روایت کیا ہے اور ابوداؤد میں یہ حدیث طویل ہے۔",
        "english": "Narrated 'Ali (R.A): They (some of the Companions) came forward for single combat on the day of the Battle of Badr. [Reported by al-Bukhari and Abu Dawud at length]."
      }
    },

    {
      "id": 1097,
      "name": {
        "arabic": " وَعَنْ أَبِي أَيُّوبَ ‏- رضى الله عنه ‏- قَالَ: إِنَّمَا أُنْزِلَتْ هَذِهِ اَلْآيَةُ فِينَا مَعْشَرَ اَلْأَنْصَارِ, يَعْنِي: ﴿ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى اَلتَّهْلُكَةِ ﴾ قَالَهُ رَدًّا عَلَى مَنْ أَنْكَرَ عَلَى مَنْ حَمَلَ عَلَى صَفِ اَلرَّومِ حَتَّى دَخَلَ فِيهِمْ .‏ رَوَاهُ اَلثَّلَاثَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ ",
        "urdu": "سیدنا ابوایوب انصاری رضی اللہ عنہ سے روایت ہے کہ یہ آیت «ولا تلقوا بأيديكم إلى التهلكة» ” اپنے ہاتھوں اپنے آپ کو ہلاکت میں نہ ڈالو۔ “ ہمارے حق میں یعنی انصار کے بارے میں نازل ہوئی۔ یہ بات انہوں نے ان لوگوں کی تردید میں کہی جنہوں نے اس مجاہد پر اعتراض کیا تھا جس نے رومیوں کی صفوں پر تنہا حملہ کیا تھا اور ان کے اندر جا گھسا تھا۔",
        "english": "Narrated Abu Ayyub al-Ansari (RA): The verse: 'And do not throw [yourselves] with your [own] hands into destruction' was revealed concerning us, the Ansar. He said this as a refutation against those who criticized a person who charged into the Roman ranks until he entered among them."
      }
    },

    {
      "id": 1098,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { حَرَقَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَخْلَ بَنِي اَلنَّضِيرِ, وَقَطَعَ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بنو نضیر کے کھجوروں کے درختوں کو آگ لگا دی اور انہیں کٹوا دیا۔ (بخاری و مسلم)",
        "english": "Narrated Ibn 'Umar (R.A): The Messenger of Allah (ﷺ) burnt the date-palm trees of Banu al-Nadir and cut them down. [Agreed upon]"
      }
    },

    {
      "id": 1099,
      "name": {
        "arabic": " وَعَنْ عُبَادَةَ بْنِ اَلصَّامِتِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"لَا تَغُلُّوا; فَإِنَّ اَلْغُلُولَ نَارٌ وَعَارٌ عَلَى أَصْحَابِهِ فِي اَلدُّنْيَا وَالْآخِرَةِ\" } رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ",
        "urdu": "سیدنا عبادہ بن صامت رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خیانت (غنیمت کے مال میں) نہ کرو کیونکہ یہ (خیانت) آگ ہے اور اپنے مرتکب ہونے والوں کے لیے دنیا اور آخرت میں ذلت و عار کا باعث ہے۔“",
        "english": "Narrated 'Ubadah bin as-Samit (RA): The Messenger of Allah (ﷺ) said: 'Do not embezzle (from the booty); for embezzlement is Hell-fire and a cause of shame for those who are guilty of it in this world and the next.'"
      }
    },

    {
      "id": 1100,
      "name": {
        "arabic": "وَعَنْ عَوْفِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَضَى بِالسَّلَبِ لِلْقَاتِلِ } رَوَاهُ أَبُو دَاوُدَ. وَأَصْلُهُ عِنْدَ مُسْلِمٍ",
        "urdu": "سیدنا عوف بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ: ”مقتول کا ساز و سامان قاتل (اسے قتل کرنے والے مجاہد) کے لیے ہے۔“ اسے ابوداؤد نے روایت کیا ہے اور اس کی اصل مسلم میں ہے۔",
        "english": "Narrated 'Awf bin Malik (R.A): The Prophet (ﷺ) decreed that the belongings (Salab) of a slain enemy soldier belong to the one who killed him. [Reported by Abu Dawud; its origin is in Muslim]."
      }
    },

    {
      "id": 1101,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عَوْفٍ ‏- رضى الله عنه ‏- فِي ‏- قِصَّةِ قَتْلِ أَبِي جَهْلٍ ‏- قَالَ: { فَابْتَدَرَاهُ بِسَيْفَيْهِمَا حَتَّى قَتَلَاهُ, ثُمَّ انْصَرَفَا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَأَخْبَرَاهُ, فَقَالَ: \"أَيُّكُمَا قَتَلَهُ? هَلْ مَسَحْتُمَا سَيْفَيْكُمَا ?\" قَالَا: لَا.‏ قَالَ: فَنَظَرَ فِيهِمَا, فَقَالَ: \"كِلَاكُمَا قَتَلَهُ, سَلْبُهُ لِمُعَاذِ بْنِ عَمْرِوِ بْنِ اَلْجَمُوحِ\" } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ سے ابوجہل کے قتل کے قصہ میں مروی ہے کہ دونوں (معاذ بن عفراء اور معاذ بن عمرو) اپنی اپنی تلوار لے کر ابوجہل کی طرف ایک دوسرے سے آگے بڑھے اور اسے قتل کر دیا۔ پھر رسول اللہ ﷺ کے پاس آ کر خبر دی۔ آپ ﷺ نے پوچھا: ”تم میں سے کس نے اسے قتل کیا؟ کیا تم نے تلواریں صاف کر لی ہیں؟“ انہوں نے کہا: نہیں۔ آپ ﷺ نے تلواریں دیکھ کر فرمایا: ”تم دونوں ہی اس کے قاتل ہو، البتہ اس کا ساز و سامان معاذ بن عمرو بن جموح کو ملے گا۔“",
        "english": "Narrated 'Abdur-Rahman bin 'Auf (RA) regarding the story of Abu Jahl's killing: Two young men (Mu'adh bin 'Afra and Mu'adh bin 'Amr) raced with their swords and struck him until they killed him. They then went to the Messenger of Allah (ﷺ) and informed him. He asked, 'Which of you killed him? Have you wiped your swords?' They replied, 'No.' He looked at the swords and said, 'Both of you killed him, but his spoils (Salab) are for Mu'adh bin 'Amr bin al-Jumuh.'"
      }
    },

    {
      "id": 1102,
      "name": {
        "arabic": "وَعَنْ مَكْحُولٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَصَبَ اَلْمَنْجَنِيقَ عَلَى أَهْلِ اَلطَّائِفِ } أَخْرَجَهُ أَبُو دَاوُدَ فِي \"اَلْمَرَاسِيلِ\" وَرِجَالُهُ ثِقَاتٌ وَوَصَلَهُ الْعُقَيْلِيُّ بِإِسْنَادٍ ضَعِيفٍ عَنْ عَلِيٍّ ‏- رضى الله عنه ‏-",
        "urdu": "سیدنا مکحول رحمہ اللہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اہل طائف پر منجنیق نصب کی۔ اسے ابوداؤد نے اپنی مراسیل میں تخریج کیا ہے اور اس کے راوی ثقہ ہیں مگر عقیلی نے سیدنا علی رضی اللہ عنہ سے ضعیف سند کے ساتھ اسے موصولاً روایت کیا ہے۔",
        "english": "Narrated Makul: The Prophet (ﷺ) set up a catapult (Manjaniq) against the people of Ta'if. [Reported by Abu Dawud in al-Marasil with reliable narrators, and al-Uqayli connected it through a weak chain from 'Ali (R.A)]."
      }
    },

    {
      "id": 1103,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-دَخَلَ مَكَّةَ وَعَلَى رَأْسِهِ اَلْمِغْفَرُ, فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ, فَقَالَ: ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ اَلْكَعْبَةِ, فَقَالَ: \"اُقْتُلُوهُ\" } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو اس وقت آپ صلی اللہ علیہ وسلم کے سر پر ”خود“ (لوہے کی ٹوپی) تھی۔ جب آپ صلی اللہ علیہ وسلم نے اسے سر سے اتارا تو آپ صلی اللہ علیہ وسلم کے پاس ایک آدمی آیا، اس نے کہا کہ ابن خطل کعبہ کے پردوں کے ساتھ چمٹا ہوا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اسے قتل کر دو۔“",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) entered Makkah (on the day of the Conquest) wearing a helmet. When he took it off, a man came to him and said, 'Ibn Khatal is clinging to the curtains of the Ka'bah.' He (ﷺ) said, 'Kill him.'"
      }
    },

    {
      "id": 1104,
      "name": {
        "arabic": "وَعَنْ سَعِيدِ بْنِ جُبَيْرٍ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَتَلَ يَوْمَ بَدْرٍ ثَلَاثَةً صَبْراً } أَخْرَجَهُ أَبُو دَاوُدَ فِي \"اَلْمَرَاسِيلِ\" وَرِجَالُهُ ثِقَاتٌ ",
        "urdu": "سیدنا سعید بن جبیر رحمہ اللہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بدر کے روز تین آدمیوں کو باندھ کر (بطورِ سزا) قتل کیا۔ اسے ابوداؤد نے اپنی مراسیل میں نقل کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Sa'id bin Jubair: The Messenger of Allah (ﷺ) executed three individuals in captivity (Sabran) on the day of Badr. [Reported by Abu Dawud in al-Marasil; its narrators are reliable]."
      }
    },

    {
      "id": 1105,
      "name": {
        "arabic": " وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَدَى رَجُلَيْنِ مِنْ اَلْمُسْلِمِينَ بِرَجُلٍ مِنْ اَلْمُشْرِكِينَ } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ .‏ وَأَصْلُهُ عِنْدَ مُسْلِمٍ ",
        "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مشرکین کے ایک (قیدی) مرد کے بدلے میں دو مسلمان مردوں کا فدیہ دے کر انہیں چھڑوایا۔",
        "english": "Narrated 'Imran bin Husain (RA): The Messenger of Allah (ﷺ) ransomed two Muslim men in exchange for one man from the polytheists."
      }
    },

    {
      "id": 1106,
      "name": {
        "arabic": "وَعَنْ صَخْرِ بْنِ اَلْعَيْلَةِ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ اَلْقَوْمَ إِذَا أَسْلَمُوا ؛ أَحْرَزُوا دِمَاءَهُمْ وَأَمْوَالَهُمْ } أَخْرَجَهُ أَبُو دَاوُدَ, وَرِجَالُهُ مُوَثَّقُونَ",
        "urdu": "سیدنا صخر بن عیلہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب لوگ اسلام قبول کر لیتے ہیں تو وہ اپنے خون اور اپنے مال محفوظ کر لیتے ہیں۔“ اس کو ابوداؤد نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Sakhr bin al-'Aila (R.A): The Prophet (ﷺ) said: 'When a people embrace Islam, they secure (protect) their lives and their properties.' [Reported by Abu Dawud; its narrators are trustworthy]."
      }
    },

    {
      "id": 1107,
      "name": {
        "arabic": " وَعَنْ جُبَيْرِ بْنِ مُطْعَمٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ فِي أُسَارَى بَدْرٍ: { \" لَوْ كَانَ اَلْمُطْعَمُ بْنُ عَدِيٍّ حَيًّا, ثُمَّ كَلَّمَنِي فِي هَؤُلَاءِ اَلنَّتْنَى لَتَرَكْتُهُمْ لَهُ\" } رَوَاهُ اَلْبُخَارِيُّ ",
        "urdu": "سیدنا جبیر بن مطعم رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے اسیرانِ بدر (بدر کے قیدیوں) کے متعلق فرمایا: ”اگر مطعم بن عدی زندہ ہوتا، پھر وہ ان بدبودار لوگوں (مشرکین) کے بارے میں مجھ سے سفارش کرتا تو میں اس کی خاطر ان سب کو (بغیر فدیہ کے) چھوڑ دیتا۔“",
        "english": "Narrated Jubair bin Mut'im (RA): Regarding the prisoners of Badr, the Prophet (ﷺ) said: 'If al-Mut'im bin 'Adi were alive and had interceded with me for these filthy people, I would have released them for his sake.'"
      }
    },

    {
      "id": 1108,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: { أَصَبْنَا سَبَايَا يَوْمَ أَوْطَاسٍ لَهُنَّ أَزْوَاجٌ, فَتَحَرَّجُوا, فَأَنْزَلَ اَللَّهُ تَعَالَى: ﴿ وَالْمُحْصَنَاتُ مِنَ اَلنِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ﴾ } أَخْرَجَهُ مُسْلِمٌ ",
        "urdu": "سیدنا ابوسعيد خدرى رضی اللہ عنہ سے روايت ہے كہ اوطاس کے دن (غزوہ حنین کے موقع پر) کچھ لونڈیاں ہمارے ہاتھ لگیں جن کے شوہر (دار الحرب میں) زندہ تھے۔ مسلمانوں نے ان کے خاوندوں کی موجودگی کی وجہ سے ان سے تعلق قائم کرنے کو باعثِ حرج و گناہ سمجھا، تو اس موقع پر اللہ تعالیٰ نے یہ آیت نازل فرمائی: «والْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ» ”اور شوہر والی عورتیں تم پر حرام ہیں مگر وہ جو تمہاری ملکیت میں آ جائیں۔“ (مسلم)",
        "english": "Narrated Abu Sa'id al-Khudri (R.A): On the day of Awtas (Battle of Hunain), we captured some female prisoners who had husbands. The Companions felt hesitant to have relations with them because of their husbands. Then Allah, the Most High, revealed: 'And (also forbidden are) women already married, except those whom your right hands possess' (4:24)."
      }
    },

    {
      "id": 1109,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { بَعَثَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سَرِيَّةٍ وَأَنَا فِيهِمْ, قِبَلَ نَجْدٍ, فَغَنِمُوا إِبِلاً كَثِيرَةً, فَكَانَتْ سُهْمَانُهُمْ اِثْنَيْ عَشَرَ بَعِيراً, وَنُفِّلُوا بَعِيراً بَعِيراً } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے نجد کی طرف ایک سریہ (لشکر) روانہ فرمایا، میں بھی اس میں موجود تھا۔ ہمیں بہت سے اونٹ مالِ غنیمت میں حاصل ہوئے، ان میں سے ہر ایک کے حصے میں بارہ بارہ اونٹ آئے اور پھر انہیں (بطور انعام) ایک ایک اونٹ مزید زائد دیا گیا۔",
        "english": "Narrated Ibn 'Umar (RA): The Messenger of Allah (ﷺ) sent an expedition toward Najd and I was among them. They gained many camels as war booty, and the share of each man was twelve camels, and they were each given one extra camel as a bonus (Nafal)."
      }
    },

    {
      "id": 1110,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَسَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- يَوْمَ خَيْبَرَ لِلْفَرَسِ سَهْمَيْنِ, وَلِلرَّاجِلِ سَهْمًا } مُتَّفَقٌ عَلَيْهِ.‏ وَاللَّفْظُ لِلْبُخَارِيِّ وَلِأَبِي دَاوُدَ: { أَسْهَمَ لِرَجُلٍ وَلِفَرَسِهِ ثَلَاثَةَ أَسْهُمٍ: سَهْمَيْنِ لِفَرَسِهِ, وَسَهْماً لَهُ }",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے روز (مالِ غنیمت کی تقسیم میں) گھڑ سوار کے گھوڑے کے لیے دو حصے اور پیدل مجاہد کے لیے ایک حصہ مقرر فرمایا۔ (بخاری ومسلم) یہ الفاظ بخاری کے ہیں۔ ابوداؤد کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے ایک شخص اور اس کے گھوڑے کے لیے مجموعی طور پر تین حصے مقرر فرمائے: دو حصے اس کے گھوڑے کے اور ایک حصہ اس کا اپنا۔",
        "english": "Narrated Ibn 'Umar (R.A): On the day of Khaibar, Allah's Messenger (ﷺ) allotted two shares for the horse and one share for the foot-soldier. [Agreed upon; the wording is al-Bukhari's]. In Abu Dawud's version: 'He allotted three shares for a man and his horse: two shares for his horse and one share for him.'"
      }
    },

    {
      "id": 1111,
      "name": {
        "arabic": " وَعَنْ مَعْنِ بْنِ يَزِيدَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { سَمِعْتَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: \"لَا نَفْلَ إِلَّا بَعْدَ اَلْخُمُسِ\" } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ, وَصَحَّحَهُ اَلطَّحَاوِيُّ",
        "urdu": "سیدنا معن بن یزید رضی اللہ عنہما سے مروی ہے کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ”(مالِ غنیمت میں) زائد انعام (نفل) نہیں دیا جائے گا مگر پانچواں حصہ (خمس) نکالنے کے بعد۔“",
        "english": "Narrated Ma'n bin Yazid (RA): I heard the Messenger of Allah (ﷺ) saying: 'There is no bonus (Nafal) except after the extraction of the fifth (Khums).'"
      }
    },

    {
      "id": 1112,
      "name": {
        "arabic": "وَعَنْ حَبِيبِ بْنِ مَسْلَمَةٍ ‏- رضى الله عنه ‏- قَالَ: { شَهِدْتُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَفَّلَ اَلرُّبْعَ فِي اَلْبَدْأَةِ, وَالثُّلُثَ فِي اَلرَّجْعَةِ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ ابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ ",
        "urdu": "سیدنا حبیب بن مسلمہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ ﷺ نے (مالِ غنیمت کے علاوہ) سریہ (لشکر) کے لیے ابتدائی حملے میں چوتھا حصہ بطور نفل (انعام) دیا اور واپسی کے وقت (لڑائی کی صورت میں) تہائی حصہ دیا۔ اسے ابوداؤد نے روایت کیا ہے اور ابن جارود، ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
        "english": "Narrated Habib bin Maslamah (R.A): I witnessed the Messenger of Allah (ﷺ) giving a fourth of the spoils as an extra reward (Nafal) in the beginning of an expedition, and a third on the return. [Reported by Abu Dawud; Ibn al-Jarud, Ibn Hibban and al-Hakim graded it Sahih]."
      }
    },

    {
      "id": 1113,
      "name": {
        "arabic": " وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُنَفِّلُ بَعْضَ مَنْ يَبْعَثُ مِنْ اَلسَّرَايَا لِأَنْفُسِهِمْ خَاصَّةً, سِوَى قَسْمِ عَامَّةِ اَلْجَيْشِ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": " سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم بعض فوجی دستوں (سرایا) کو بالخصوص ان کی اپنی ذات کے لیے غنیمت کے عام حصے کے علاوہ کچھ مزید (نفل) عطا فرماتے تھے۔ یہ عام لشکر کی تقسیم میں شامل نہیں ہوتا تھا۔",
        "english": "Narrated Ibn 'Umar (RA): The Messenger of Allah (ﷺ) used to give some of the detachments (Saraya) he sent out an extra portion (Nafal) for themselves specifically, aside from the general portion shared by the rest of the army."
      }
    },

    {
      "id": 1114,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كُنَّا نُصِيبُ فِي مَغَازِينَا اَلْعَسَلَ وَالْعِنَبَ , فَنَأْكُلُهُ وَلَا نَرْفَعُهُ } رَوَاهُ اَلْبُخَارِيُّ . وَلِأَبِي دَاوُدَ: { فَلَمْ يُؤْخَذْ مِنْهُمْ اَلْخُمُسُ } . وَصَحَّحَهُ ابْنُ حِبَّانَ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ ہمیں غزوات میں شہد اور انگور ہاتھ آتے تو ہم ان کو کھا لیتے تھے اور اٹھا کر (اپنے گھروں کو) نہیں لے جاتے تھے۔ اسے بخاری نے روایت کیا ہے۔ اور ابوداؤد کی روایت میں ہے کہ ان سے خمس وصول نہیں کیا جاتا تھا، اور ابن حبان نے اسے صحیح کہا ہے۔",
        "english": "Narrated Ibn 'Umar (R.A): We used to get honey and grapes in our military expeditions and we would eat them without taking them away (to our homes). [Reported by al-Bukhari]. In Abu Dawud's version: 'The Khums (one-fifth) was not taken from them.' [Ibn Hibban graded it Sahih]."
      }
    },

    {
      "id": 1115,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ أَبِي أَوْفَى رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أَصَبْنَا طَعَاماً يَوْمَ خَيْبَرَ, فَكَانَ اَلرَّجُلُ يَجِيءُ, فَيَأْخُذُ مِنْهُ مِقْدَارَ مَا يَكْفِيهِ, ثُمَّ يَنْصَرِفُ } أَخْرَجَهُ أَبُو دَاوُدَ, وَصَحَّحَهُ ابْنُ اَلْجَارُودِ, وَالْحَاكِمُ",
        "urdu": "سیدنا عبداللہ بن ابی اوفی رضی اللہ عنہما سے روایت ہے کہ خیبر کے روز ہمیں کھانے کی اشیاء ہاتھ آئیں تو (تقسیم سے پہلے ہی) ہر آدمی آتا اور اس میں سے اپنی ضرورت کے مطابق (کھانے کے لیے) حاصل کر لیتا تھا پھر واپس چلا جاتا۔",
        "english": "Narrated Abdullah bin Abi Awfa (RA): 'On the day of Khaibar, we got some food (as booty). A man would come and take as much of it as he needed and then leave (without it being divided formally).'"
      }
    },

    {
      "id": 1116,
      "name": {
        "arabic": "وَعَنْ رُوَيْفِعِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ اَلْآخِرِ فَلَا يَرْكَبُ دَابَّةً مِنْ فَيْءِ اَلْمُسْلِمِينَ, حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ, وَلَا يَلْبَسُ ثَوْباً مِنْ فَيْءِ اَلْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ } أَخْرَجَهُ أَبُو دَاوُدَ, وَالدَّارِمِيُّ",
        "urdu": "سیدنا رویفع بن ثابت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اللہ پر اور یومِ آخرت پر ایمان رکھتا ہے، وہ مسلمانوں کے مالِ غنیمت کے کسی جانور پر سوار نہ ہو کہ جب اسے دبلا کر دے تو واپس کر دے، اور نہ مسلمانوں کے مالِ غنیمت سے کوئی کپڑا پہنے کہ جب اسے پرانا اور بوسیدہ کر دے تو واپس بیت المال میں جمع کرائے۔“",
        "english": "Narrated Ruwaifi' bin Thabit (R.A): The Messenger of Allah (ﷺ) said: 'Whoever believes in Allah and the Last Day should not ride an animal belonging to the spoils (Fai') of the Muslims and then return it when it has become emaciated; nor should he wear a garment belonging to the spoils of the Muslims and then return it when it has become tattered.'"
      }
    },

    {
      "id": 1117,
      "name": {
        "arabic": " وَعَنْ أَبِي عُبَيْدَةَ بْنِ اَلْجَرَّاحِ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \" يُجِيرُ عَلَى اَلْمُسْلِمِينَ بَعْضُهُمْ\" } أَخْرَجَهُ ابْنُ أَبِي شَيْبَةَ, وَأَحْمَدُ, وَفِي إِسْنَادِهِ ضَعْفٌ وَلِلْطَيَالِسِيِّ: مِنْ حَدِيثِ عَمْرِوِ بْنِ الْعَاصِ: { \" يُجِيرُ عَلَى اَلْمُسْلِمِينَ أَدْنَاهُمْ\" } وَفِي \"اَلصَّحِيحَيْنِ\" : عَنْ عَلِيٍّ [رَضِيَ اَللَّهُ عَنْهُ قَالَ]: { \"ذِمَّةُ اَلْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى ِبهَا أَدْنَاهُمْ\" } زَادَ اِبْنُ مَاجَه مِنْ وَجْهٍ آخَرَ: { \" يُجِيرُ عَلَيْهِمْ أَقْصَاهُمْ\" } وَفِي \"اَلصَّحِيحَيْنِ\" مِنْ حَدِيثٍ أَمِ هَانِئٍ: { قَدْ أَجَرْنَا مَنْ أَجَرْتِ\" } ",
        "urdu": "سیدنا ابوعبیدہ بن جراح رضی اللہ عنہ روایت کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا: ”مسلمانوں میں سے کوئی بھی (دشمن کو) پناہ دینے کا مجاز ہے۔“ اور صحیحین میں حضرت علی رضی اللہ عنہ سے مروی ہے کہ ”مسلمانوں کی پناہ (امان) ایک ہی ہے، جس کی ذمہ داری ان کا ادنیٰ آدمی بھی لے سکتا ہے۔“ اور صحیحین ہی میں امِ ہانی رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ”(اے ام ہانی!) ہم نے بھی اسے پناہ دی جسے تو نے پناہ دی۔“",
        "english": "Narrated Abu 'Ubaidah bin al-Jarrah (RA): I heard the Messenger of Allah (ﷺ) saying: 'Any Muslim can grant protection (Aman) on behalf of other Muslims.' In the Sahihayn, 'Ali (RA) narrated: 'The protection granted by Muslims is one and the same; even the humblest of them can grant it.' In the Sahihayn, Umm Hani narrated: 'The Prophet (ﷺ) said: We grant protection to whom you have granted protection (O Umm Hani).'"
      }
    },

    {
      "id": 1118,
      "name": {
        "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- أَنَّه سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { لَأَخْرِجَنَّ اَلْيَهُودَ وَالنَّصَارَى مِنْ جَزِيرَةِ اَلْعَرَبِ, حَتَّى لَا أَدَعَ إِلَّا مُسْلِماً } رَوَاهُ مُسْلِمٌ.‏ ",
        "urdu": "سیدنا عمر رضی اللہ عنہ سے مروی ہے کہ انہوں نے سنا، رسول اللہ صلی اللہ علیہ وسلم فرما رہے تھے کہ: ”میں یہود و نصاریٰ کو جزیرۃ العرب سے باہر نکال کر دم لوں گا، یہاں تک کہ (وہاں) مسلمانوں کے علاوہ کسی کو نہیں چھوڑوں گا۔“ (مسلم)",
        "english": "Narrated 'Umar (R.A): He heard the Messenger of Allah (ﷺ) saying: 'I will certainly expel the Jews and the Christians from the Arabian Peninsula until I leave none but Muslims.'"
      }
    },

    {
      "id": 1119,
      "name": {
        "arabic": " وَعَنْهُ قَالَ: { كَانَتْ أَمْوَالُ بَنِي اَلنَّضِيرِ مِمَّا أَفَاءَ اَللَّهُ عَلَى رَسُولِهِ, مِمَّا لَمْ يُوجِفْ عَلَيْهِ اَلْمُسْلِمُونَ بِخَيْلٍ وَلَا رِكَابٍ, فَكَانَتْ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-خَاصَّةً, فَكَانَ يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَةٍ, وَمَا بَقِيَ يَجْعَلُهُ فِي اَلْكُرَاعِ وَالسِّلَاحِ, عُدَّةً فِي سَبِيلِ اَللَّهِ\" } مُتَّفَقٌ عَلَيْهِ.‏",
        "urdu": " سیدنا عمر رضی اللہ عنہ ہی سے روایت ہے کہ بنو نضیر کے اموال، ان اموال میں سے ہیں جو اللہ تعالیٰ نے اپنے رسول کی طرف پلٹا دئیے ہیں۔ جن پر مسلمانوں نے نہ گھوڑے دوڑائے اور نہ اونٹ۔ یہ اموال خالص نبی کریم صلی اللہ علیہ وسلم کے لیے تھے۔ آپ صلی اللہ علیہ وسلم ان اموال میں سے اپنی بیویوں پر سال بھر کا خرچ نکالتے تھے اور جو باقی بچ رہتا اس سے گھوڑے اور اسلحہ جہاد فی سبیل اللہ کی تیاری کے لیے خرید فرماتے۔",
        "english": "Narrated Umar (RA): The properties of Banu al-Nadir were among the spoils (Fai') that Allah bestowed on His Messenger, for which the Muslims had not to rouse any horses or camels. These properties belonged specifically to the Prophet (ﷺ). He would provide a year's subsistence for his family from them, and whatever remained, he would spend on horses and weapons as equipment for the cause of Allah."
      }
    },

    {
      "id": 1120,
      "name": {
        "arabic": "وَعَنْ مُعَاذٍ ‏- رضى الله عنه ‏- قَالَ: { غَزَوْنَا مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-خَيْبَرَ, فَأَصَبْنَا فِيهَا غَنَمًا , فَقَسَمَ فِينَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-طَائِفَةً, وَجَعَلَ بَقِيَّتَهَا فِي اَلْمَغْنَمِ } رَوَاهُ أَبُو دَاوُدَ, وَرِجَالُهُ لَا بَأْسَ بِهِمْ ",
        "urdu": "سیدنا معاذ رضی اللہ عنہ سے روایت ہے کہ ہم نے نبی کریم صلی اللہ علیہ وسلم کے ہمراہ غزوہ خیبر لڑا۔ اس میں ہمارے ہاتھ کچھ بکریاں غنیمت میں آئیں۔ ان میں سے کچھ رسول اللہ صلی اللہ علیہ وسلم نے (تقسیم سے پہلے ہی ضرورت کے لیے) ہم میں تقسیم کر دیں اور باقی کو (عام) غنیمت کے اموال میں شامل فرما دیا۔ اسے ابوداؤد نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Mu'adh (R.A): We went on an expedition to Khaibar with the Messenger of Allah (ﷺ) and we got some sheep as spoils of war. The Messenger of Allah (ﷺ) distributed a portion of them among us (for immediate needs) and put the remainder in the general spoils. [Reported by Abu Dawud, and its narrators are reliable]."
      }
    },

    {
      "id": 1121,
      "name": {
        "arabic": "وَعَنْ أَبِي رَافِعٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"إِنِّي لَا أَخِيسُ بِالْعَهْدِ, وَلَا أَحْبِسُ اَلرُّسُلَ \" } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ ",
        "urdu": "سیدنا ابورافع رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیشک میں نہ تو عہد شکنی کرتا ہوں اور نہ ہی قاصدوں (سفیروں) کو قید کرتا ہوں۔“",
        "english": "Narrated Abu Rafi' (RA): The Messenger of Allah (ﷺ) said: 'I do not break a covenant, nor do I detain messengers (envoys).'"
      }
    },

    {
      "id": 1122,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"أَيُّمَا قَرْيَةٍ أَتَيْتُمُوهَا, فَأَقَمْتُمْ فِيهَا, فَسَهْمُكُمْ فِيهَا, وَأَيُّمَا قَرْيَةٍ عَصَتْ اَللَّهَ وَرَسُولَهُ, فَإِنْ خُمُسَهَا لِلَّهِ وَرَسُولِهِ , ثُمَّ هِيَ لَكُمْ\" } رَوَاهُ مُسْلِمٌ.‏ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم جس بستی میں بھی آؤ اور اس میں (صلح کے ذریعے) قیام کرو تو اس میں تمہارا حصہ (یعنی تمہارا حقِ وراثت و شہریت) ہے، اور جو بستی اللہ اور اس کے رسول کی نافرمانی کرے (اور جنگ کے ذریعے فتح ہو) تو اس کا خمس اللہ اور اس کے رسول کا ہے، پھر باقی تمہارے درمیان تقسیم ہو گا۔“ (مسلم)",
        "english": "Narrated Abu Hurairah (R.A): The Messenger of Allah (ﷺ) said: 'Any village you come to and settle in (peacefully), you have your share in it. But any village that disobeys Allah and His Messenger (and is taken by force), its fifth (Khums) belongs to Allah and His Messenger, and the remainder is for you (the captors).'"
      }
    }
  ]
}
