{
  "chapId": 47,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 727,
    "to": 734
  },
  "hadiths": [
    {
      "id": 727,
      "name": {
        "arabic": " عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اَلرَّحْمَنِ, عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ, فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوبکر بن عبدالرحمٰن نے سیدنا ابوہریرہ رضی اللہ عنہ سے روایت کیا کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا کہ ”جو شخص مفلس کے پاس اپنی چیز بعینہ اسی حالت میں پائے تو وہ اس کا دوسرے کی بہ نسبت زیادہ حقدار ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Bakr bin 'Abdur-Rahman: I heard Abu Hurairah (RA) saying that Allah's Messenger (ﷺ) said: 'If anyone finds his very property with a man who has become insolvent, he is more entitled to it than anyone else.' [Agreed upon]."
      }
    },

    {
      "id": 728,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ اَلشَّرِيدِ, عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { لَيُّ اَلْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَعَلَّقَهُ اَلْبُخَارِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ ",
        "urdu": "سیدنا عمرو بن شرید رحمہ اللہ نے اپنے والد (شرید بن سوید) سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مالدار آدمی کا ادائیگی قرض میں ٹال مٹول کرنا، اس کی بے عزتی اور سزا دینے کو حلال کر دیتا ہے۔“",
        "english": "Narrated 'Amr bin ash-Sharid from his father: The Prophet (ﷺ) said: 'The procrastination (delaying payment) of one who is able to pay makes it lawful to dishonor him and punish him.'"
      }
    },

    {
      "id": 729,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: { أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي ثِمَارٍ اِبْتَاعَهَا, فَكَثُرَ دَيْنُهُ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" تَصَدَّقُوا عَلَيْهِ \" فَتَصَدَّقَ اَلنَّاسُ عَلَيْهِ, وَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِغُرَمَائِهِ: \" خُذُوا مَا وَجَدْتُمْ, وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ } رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ایک آدمی کو ان پھلوں میں نقصان ہوا جو اس نے خریدے تھے، جس کی وجہ سے اس پر قرض بہت زیادہ ہو گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے (صحابہ سے) فرمایا: ”اس کی مالی مدد (صدقہ) کرو۔“ چنانچہ لوگوں نے اسے صدقہ دیا مگر وہ اس کا قرض چکانے کے لیے کافی نہ ہوا۔ تب رسول اللہ صلی اللہ علیہ وسلم نے اس کے قرض خواہوں سے فرمایا: ”جو کچھ پاؤ اسے لے لو اور تمہارے لیے اس کے سوا کچھ نہیں ہے۔“",
        "english": "Narrated Abu Sa'id al-Khudri (R.A): In the time of Allah's Messenger (peace be upon him), a man suffered a loss in fruits he had bought, and his debts increased. Allah's Messenger (peace be upon him) said (to the people), \"Give him Sadaqah (charity).\" So the people gave him Sadaqah, but that was not enough to pay off his debt in full. Thereupon, Allah's Messenger (peace be upon him) said to his creditors, \"Take what you find, and you will have nothing more than that.\""
      }
    },

    {
      "id": 730,
      "name": {
        "arabic": "وَعَنِ اِبْنِ كَعْبِ بْنِ مَالِكٍ, عَنْ أَبِيهِ; { أَنَّ رَسُولَ اَللَّهِ صلى الله عليه وسلم حَجَرَ عَلَى مُعَاذٍ مَالَهُ, وَبَاعَهُ فِي دَيْنٍ كَانَ عَلَيْهِ } رَوَاهُ اَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ, وَأَخْرَجَهُ أَبُو دَاوُدَ مُرْسَلًا, وَرُجِّحَ ",
        "urdu": "سیدنا ابن کعب بن مالک اپنے والد (کعب بن مالک رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے سیدنا معاذ رضی اللہ عنہ کے مال پر پابندی (حجر) لگا دی تھی اور ان کا مال اس قرض کی ادائیگی کے لیے فروخت کر دیا جو ان کے ذمہ تھا۔",
        "english": "Narrated Ibn Ka'b bin Malik from his father: Allah's Messenger (ﷺ) placed Mu'adh's property under legal restraint (Hajr) and sold it to pay off a debt he owed. [Reported by ad-Daraqutni and Sahih according to al-Hakim. Abu Dawud reported it as Mursal and this is preferred]."
      }
    },

    {
      "id": 731,
      "name": {
        "arabic": "وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { عُرِضْتُ عَلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَوْمَ أُحُدٍ, وَأَنَا اِبْنُ أَرْبَعَ عَشْرَةَ سَنَةً, فَلَمْ يُجِزْنِي, وَعُرِضْتُ عَلَيْهِ يَوْمَ اَلْخَنْدَقِ, وَأَنَا اِبْنُ خَمْسَ عَشْرَةَ سَنَةً, فَأَجَازَنِي } مُتَّفَقٌ عَلَيْهِ وَفِي رِوَايَةٍ لِلْبَيْهَقِيِّ: \" فَلَمْ يُجِزْنِي, وَلَمْ يَرَنِي بَلَغْتُ \".‏ وَصَحَّحَهَا اِبْنُ خُزَيْمَةَ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ مجھے احد کے روز نبی کریم ﷺ کے روبرو (جنگ میں شرکت کے لیے) پیش کیا گیا، اس وقت میری عمر چودہ برس تھی، تو آپ ﷺ نے مجھے اجازت نہ دی۔ پھر خندق کے روز مجھے آپ ﷺ کے سامنے پیش کیا گیا، اس وقت میری عمر پندرہ برس تھی، تو آپ ﷺ نے مجھے (شرکت کی) اجازت دے دی۔ اور بیہقی کی روایت میں ہے کہ: ”آپ ﷺ نے مجھے اجازت نہ دی کیونکہ آپ ﷺ نے مجھے (اس وقت) بالغ نہیں سمجھا تھا۔“",
        "english": "Narrated Ibn 'Umar (R.A): I was presented to the Prophet (peace be upon him) on the day of Uhud when I was fourteen years old, and he did not permit me (to fight). Then I was presented to him on the day of Al-Khandaq (the Trench) when I was fifteen years old, and he permitted me. (Agreed upon). In a narration by Al-Baihaqi: \"He did not permit me as he did not consider me to have reached puberty.\""
      }
    },

    {
      "id": 732,
      "name": {
        "arabic": "وَعَنْ عَطِيَّةَ اَلْقُرَظِيِّ ‏- رضى الله عنه ‏- قَالَ: { عُرِضْنَا عَلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَوْمَ قُرَيْظَةَ، فَكَانَ مَنْ أَنْبَتَ قُتِلَ, وَمَنْ لَمْ يُنْبِتْ خُلِّيَ سَبِيلُهُ, فَكُنْتُ فِيمَنْ لَمْ يُنْبِتْ فَخُلِّيَ سَبِيلِي } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ، وَالْحَاكِمُ ",
        "urdu": "سیدنا عطیہ قرظی رضی اللہ عنہ سے روایت ہے کہ بنوقریظہ (کے فیصلے) کے دن ہمیں نبی کریم ﷺ کے سامنے پیش کیا گیا۔ جس کے زیرِ ناف بال اگ آئے تھے (جو بلوغت کی علامت ہے) اسے قتل کر دیا گیا، اور جس کے بال نہیں اگے تھے اسے چھوڑ دیا گیا۔ میں ان میں سے تھا جس کے بال نہیں اگے تھے، چنانچہ مجھے چھوڑ دیا گیا۔",
        "english": "Narrated 'Atiyah al-Qurazi (RA): We were presented to the Prophet (ﷺ) on the day of the judgment of Banu Qurayzah. Those whose pubic hair had grown were executed, and those who had not were let go. I was among those whose hair had not grown, so I was let go."
      }
    },

    {
      "id": 733,
      "name": {
        "arabic": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَجُوزُ لِاِمْرَأَةٍ عَطِيَّةٌ إِلَّا بِإِذْنِ زَوْجِهَا } وَفِي لَفْظٍ: { لَا يَجُوزُ لِلْمَرْأَةِ أَمْرٌ فِي مَالِهَا, إِذَا مَلَكَ زَوْجُهَا عِصْمَتَهَا } رَوَاهُ أَحْمَدُ, وَأَصْحَابُ اَلسُّنَنِ إِلَّا اَلتِّرْمِذِيَّ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": "سیدنا عمرو بن شعیب رحمہ اللہ اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ”کسی عورت کا اپنے شوہر کی اجازت کے بغیر (کسی کو) عطیہ دینا جائز نہیں۔“ اور ایک لفظ میں ہے: ”کسی عورت کے لیے اپنے مال میں کوئی تصرف کرنا جائز نہیں جب اس کا شوہر اس کے نکاح (عصمت) کا مالک ہو۔“",
        "english": "Narrated 'Amr bin Shu'aib on his father's authority from his grandfather, that Allah's Messenger (peace be upon him) said: \"It is not permissible for a woman to give a gift except with her husband's permission.\" Another version says: \"It is not permissible for a woman to manage her own property once her husband has the right over her (through marriage).\""
      }
    },

    {
      "id": 734,
      "name": {
        "arabic": "وَعَنْ قَبِيصَةَ بْنِ مُخَارِقٍ [ اَلْهِلَالِيِّ ] ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: { إِنَّ اَلْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ: رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكَ، وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اِجْتَاحَتْ مَالَهُ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ، وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُولَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَوْمِهِ: لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ } رَوَاهُ مُسْلِمٌ ",
        "urdu": "سیدنا قبیصہ بن مخارق ہلالی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ”بیشک (لوگوں سے) مانگنا صرف تین آدمیوں میں سے کسی ایک کے لیے حلال ہے: (1) وہ شخص جس نے (دو فریقوں میں صلح کرانے کے لیے) کسی مالی ضمانت (حمالہ) کا بوجھ اٹھایا ہو، اس کے لیے اس مقدار تک مانگنا جائز ہے، پھر وہ رک جائے۔ (2) وہ شخص جس پر کوئی ایسی آفت آئے جو اس کا مال تباہ کر دے، اس کے لیے مانگنا حلال ہے یہاں تک کہ اسے گزر اوقات کے لیے مناسب سہارا مل جائے۔ (3) وہ شخص جو فاقہ (سخت غربت) میں مبتلا ہو جائے یہاں تک کہ اس کی قوم کے تین صاحبِ عقل آدمی گواہی دیں کہ فلاں شخص فاقہ زدہ ہو گیا ہے، تو اس کے لیے مانگنا حلال ہے۔“",
        "english": "Narrated Qabisah bin Mukhariq al-Hilali (RA): Allah's Messenger (ﷺ) said: 'Begging is not permissible except for one of three (classes of) people: (1) A man who has become a guarantor for a payment (Hamalah), for whom it is permissible to beg until he gets the amount and then he must stop. (2) A man whose property has been destroyed by a calamity, for whom it is permissible to beg until he gets enough to support himself. (3) A man who is reduced to poverty until three wise men of his people say, 'So-and-so has been reduced to poverty', for whom it is permissible to beg (until he can support himself).'"
      }
    }
  ]
}
