{
  "chapId": 103,
  "bookId": 16,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 1252,
    "to": 1265
  },
  "hadiths": [
    {
      "id": 1252,
      "name": {
        "arabic": " عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أََحَبَّ أَنْ يُبْسَطَ عَلَيْهِ فِي رِزْقِهِ, وَأَنْ يُنْسَأَ لَهُ فِي أَثَرِهِ, فَلْيَصِلْ رَحِمَهُ } أَخْرَجَهُ اَلْبُخَارِيُّ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس کسی کو یہ پسند ہے کہ اس کے رزق میں کشادگی ہو اور اس کی عمر دراز کی جائے تو اسے صلہ رحمی کرنی چاہیئے۔“ (بخاری) ",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Whoever loves that he be granted more wealth and that his lease of life be prolonged, then he should keep good relations with his Kith and kin.'"
      }
    },

    {
      "id": 1253,
      "name": {
        "arabic": "وَعَنْ جُبَيْرِ بْنِ مُطْعِمٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَدْخُلُ اَلْجَنَّةَ قَاطِعٌ } يَعْنِي: قَاطِعَ رَحِمٍ.‏ مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا جبیر بن مطعم رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جنت میں قطع رحمی کرنے والا (یعنی رشتہ داری توڑنے والا) داخل نہیں ہو گا۔“ (بخاری و مسلم)",
        "english": "Narrated Jubair bin Mut'im (RA): Allah's Messenger (ﷺ) said: 'The one who severs the ties of kinship will not enter Paradise.'"
      }
    },

    {
      "id": 1254,
      "name": {
        "arabic": "وَعَنْ اَلْمُغِيرَةِ بْنِ شُعْبَةَ ‏- رضى الله عنه ‏- عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ اَللَّهَ حَرَّمَ عَلَيْكُمْ عُقُوقَ اَلْأُمَّهَاتِ, وَوَأْدَ اَلْبَنَاتِ, وَمَنْعًا وَهَاتِ, وَكَرِهَ لَكُمْ قِيلَ وَقَالَ, وَكَثْرَةَ اَلسُّؤَالِ وَإِضَاعَةَ اَلْمَالِ } مُتَّفَقٌ عَلَيْهِ. ",
        "urdu": "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے تم پر ماؤں کی نافرمانی، لڑکیوں کو زندہ درگور کرنا، واجب حقوق کی ادائیگی سے رکنا اور دوسروں سے (ناحق) مانگنا حرام فرما دیا ہے، اور تمہارے لیے فضول باتیں کرنے، کثرت سے سوال کرنے اور مال ضائع کرنے کو ناپسند کیا ہے۔“ (بخاری و مسلم)",
        "english": "Narrated Al-Mughirah bin Shu'bah (RA): Allah's Messenger (ﷺ) said: 'Allah has forbidden you to be undutiful to your mothers, to bury your daughters alive, to withhold (what you should give) and to demand (what you should not take); and He dislikes for you idle talk, excessive questioning, and the squandering of wealth.'"
      }
    },

    {
      "id": 1255,
      "name": {
        "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { رِضَا اَللَّهِ فِي رِضَا اَلْوَالِدَيْنِ, وَسَخَطُ اَللَّهِ فِي سَخَطِ اَلْوَالِدَيْنِ } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ.",
        "urdu": "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ کی رضامندی والدین کی رضامندی میں ہے اور اللہ تعالیٰ کی ناراضگی والدین کی ناراضگی میں ہے۔“",
        "english": "Narrated Abdullah bin 'Amr (RA): The Prophet (ﷺ) said: 'The pleasure of Allah is in the pleasure of the parents, and the displeasure of Allah is in the displeasure of the parents.'"
      }
    },

    {
      "id": 1256,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { وَاَلَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ عَبْدٌ حَتَّى يُحِبَّ لِجَارِهِ ‏- أَوْ لِأَخِيهِ‏- مَا يُحِبُّ لِنَفْسِهِ } مُتَّفَقٌ عَلَيْهِ.‏ ",
        "urdu": " سیدنا انس رضی اللہ عنہ نے روایت کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”مجھے اس ذات اقدس کی قسم، جس کے ہاتھ میں میری جان ہے کوئی بندہ اس وقت تک مومن نہیں ہو سکتا جب تک وہ اپنے ہمسایہ یا اپنے بھائی کیلئے بھی وہی پسند نہ کرے جو اپنے لیے پسند کرتا ہے۔“ (بخاری ومسلم) ",
        "english": "Narrated Anas (RA): The Prophet (ﷺ) said: 'By Him in Whose Hand is my soul, no slave (of Allah) truly believes until he loves for his neighbor - or for his brother - what he loves for himself.'"
      }
    },

    {
      "id": 1257,
      "name": {
        "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ سَأَلْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَيُّ اَلذَّنْبِ أَعْظَمُ? قَالَ: { أَنْ تَجْعَلَ لِلَّهِ نِدًّا, وَهُوَ خَلَقَكَ.‏ قُلْتُ ثُمَّ أَيُّ? قَالَ: ثُمَّ أَنْ تَقْتُلَ وَلَدَكَ خَشْيَةَ أَنْ يَأْكُلَ مَعَكَ.‏ قُلْتُ: ثُمَّ أَيُّ? قَالَ: ثُمَّ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ } مُتَّفَقٌ عَلَيْهِ.",
        "urdu": "سیدنا ابن مسعود رضی اللہ عنہما سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا، کون سا گناہ سب سے بڑا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”یہ کہ تو اللہ تعالیٰ کے ساتھ کسی کو شریک بنائے۔ حالانکہ وہ تیرا خالق ہے۔“ میں نے عرض کیا پھر کون سا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”یہ کہ تو اپنی اولاد کو اس ڈر سے قتل کرے کہ وہ تمہارے ساتھ مل کر کھائیں گے۔“ میں نے پھر عرض کیا کہ پھر کون سا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تو اپنے ہمسایہ کی اہلیہ سے زنا کرے۔“ (بخاری و مسلم)",
        "english": "Narrated Ibn Mas'ud (RA): I asked Allah's Messenger (ﷺ), 'Which sin is the greatest?' He replied, 'That you set up a rival to Allah while He is the One Who created you.' I asked, 'What is next?' He said, 'That you kill your child for fear that he might share your food with you.' I asked, 'What is next?' He said, 'That you commit adultery with the wife of your neighbor.'"
      }
    },

    {
      "id": 1258,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مِنْ اَلْكَبَائِرِ شَتْمُ اَلرَّجُلِ وَالِدَيْهِ.‏ قِيلَ: وَهَلْ يَسُبُّ اَلرَّجُلُ وَالِدَيْهِ? قَالَ: نَعَمْ.‏ يَسُبُّ أَبَا اَلرَّجُلِ, فَيَسُبُّ أَبَاهُ, وَيَسُبُّ أُمَّهُ, فَيَسُبُّ أُمَّهُ } مُتَّفَقٌ عَلَيْهِ ",
        "urdu": "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”آدمی کا اپنے والدین کو گالی دینا کبیرہ گناہوں میں سے ہے۔“ عرض کیا گیا: کیا کوئی شخص اپنے ماں باپ کو بھی گالی دیتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”ہاں! وہ کسی دوسرے کے باپ کو گالی دیتا ہے تو وہ (بدلے میں) اس کے باپ کو گالی دیتا ہے، اور وہ کسی کی ماں کو گالی دیتا ہے تو وہ اس کی ماں کو گالی دیتا ہے۔“ (بخاری و مسلم) ",
        "english": "Narrated Abdullah bin 'Amr bin al-'As (RA): Allah's Messenger (ﷺ) said: \"It is one of the greatest sins that a man should curse his parents.\" It was asked, \"O Messenger of Allah! Does a man curse his own parents?\" He replied, \"Yes, he curses another man's father, and then the latter curses his father in return, and he curses another man's mother, and the latter curses his mother in return.\""
      }
    },

    {
      "id": 1259,
      "name": {
        "arabic": "وَعَنْ أَبِي أَيُّوبَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍ يَلْتَقِيَانِ, فَيُعْرِضُ هَذَا, وَيُعْرِضُ هَذَا, وَخَيْرُهُمَا اَلَّذِي يَبْدَأُ بِالسَّلَامِ } مُتَّفَقٌ عَلَيْهِ",
        "urdu": "سیدنا ابوایوب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی مسلمان کے لیے یہ حلال نہیں ہے کہ وہ اپنے بھائی سے تین روز سے زیادہ قطع تعلق رکھے۔ جب دونوں کا آمنا سامنا ہو تو یہ اپنا منہ ادھر کر لے اور وہ ادھر کر لے۔ دونوں میں بہتر انسان وہ ہے جو سلام میں پہل کرے۔“ (بخاری و مسلم)",
        "english": "Narrated Abu Ayyub (RA): Allah's Messenger (ﷺ) said: 'It is not lawful for a Muslim to desert (stop talking to) his brother for more than three nights. When they meet, this one turns away and that one turns away. The better of the two is the one who initiates the greeting (Salam).'"
      }
    },

    {
      "id": 1260,
      "name": {
        "arabic": " عَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كُلُّ مَعْرُوفٍ صَدَقَةٌ } أَخْرَجَهُ اَلْبُخَارِيُّ ",
        "urdu": " سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” ہر بھلائی صدقہ ہے۔“ (بخاری) ",
        "english": "Narrated Jabir (RA): Allah's Messenger (ﷺ) said: 'Every good deed is a Sadaqah (charity).'"
      }
    },

    {
      "id": 1261,
      "name": {
        "arabic": "وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَحْقِرَنَّ مِنْ اَلْمَعْرُوفِ شَيْئًا, وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ } ",
        "urdu": "سیدنا ابوذر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی بھلے کام کو حقیر اور معمولی نہ سمجھو۔ خواہ اپنے بھائی سے کشادہ چہرے (مسکراہٹ) کے ساتھ ملنا ہی کیوں نہ ہو۔“",
        "english": "Narrated Abu Dharr (RA): Allah's Messenger (ﷺ) said: 'Do not belittle any good deed, even meeting your brother with a cheerful (smiling) face.'"
      }
    },

    {
      "id": 1262,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا طَبَخْتَ مَرَقَةً, فَأَكْثِرْ مَاءَهَا, وَتَعَاهَدْ جِيرَانَكَ } أَخْرَجَهُمَا مُسْلِمٌ",
        "urdu": "سیدنا ابوذر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم شوربہ پکاؤ تو اس میں پانی زیادہ ڈال لیا کرو اور اپنے پڑوسیوں کا بھی خیال رکھا کرو۔“ (مسلم)",
        "english": "Narrated Abu Dharr (RA): Allah's Messenger (ﷺ) said: 'When you cook broth, put plenty of water in it and be mindful of your neighbors.'"
      }
    },

    {
      "id": 1263,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ اَلدُّنْيَا, نَفَّسَ اَللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ اَلْقِيَامَةِ , وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ, يَسَّرَ اَللَّهُ عَلَيْهِ فِي اَلدُّنْيَا وَالْآخِرَةِ, وَمَنْ سَتَرَ مُسْلِمًا, سَتَرَهُ اَللَّهُ فِي اَلدُّنْيَا وَالْآخِرَةِ, وَاَللَّهُ فِي عَوْنِ اَلْعَبْدِ مَا كَانَ اَلْعَبْدُ فِي عَوْنِ أَخِيهِ } أَخْرَجَهُ مُسْلِمٌ.‏",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو کوئی دنیا کی مصیبتوں میں سے کسی مومن کی کوئی مصیبت دور کرے گا، اللہ تعالیٰ قیامت کی مصیبتوں میں سے اس کی مصیبت دور فرمائے گا؛ اور جو کوئی کسی تنگ دست کے لیے آسانی پیدا کرے گا، اللہ تعالیٰ دنیا و آخرت میں اس کے لیے آسانی پیدا فرمائے گا؛ اور جو کوئی کسی مسلمان کی پردہ پوشی کرے گا، اللہ تعالیٰ دنیا و آخرت میں اس کی پردہ پوشی فرمائے گا؛ اور اللہ تعالیٰ اس وقت تک بندے کی مدد میں رہتا ہے جب تک بندہ اپنے بھائی کی مدد میں رہتا ہے۔“",
        "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Whoever removes a worldly grief from a believer, Allah will remove from him one of the griefs of the Day of Resurrection. Whoever alleviates the lot of a needy person, Allah will alleviate his lot in this world and the next. Whoever shields a Muslim, Allah will shield him in this world and the next. Allah will aid a servant as long as the servant aids his brother.'"
      }
    },

    {
      "id": 1264,
      "name": {
        "arabic": " وَعَنْ أَبِي مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ دَلَّ عَلَى خَيْرٍ, فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ } أَخْرَجَهُ مُسْلِمٌ.",
        "urdu": "سیدنا ابومسعود (انصاری) رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی خیر (نیکی) کی رہنمائی کرے، تو اسے نیکی کرنے والے کے برابر ثواب ملتا ہے۔“ (مسلم)",
        "english": "Narrated Abu Mas'ud (RA): Allah's Messenger (ﷺ) said: 'Whoever leads to good, he will have a reward similar to that of the one who does it.'"
      }
    },

    {
      "id": 1265,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ اسْتَعَاذَكُمْ بِاَللَّهِ فَأَعِيذُوهُ, وَمَنْ سَأَلَكُمْ بِاَللَّهِ فَأَعْطُوهُ, وَمَنْ أَتَى إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ, فَإِنْ لَمْ تَجِدُوا, فَادْعُوا لَهُ } أَخْرَجَهُ اَلْبَيْهَقِيُّ.‏",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”جو کوئی اللہ کے نام پر تم سے پناہ مانگے تو اسے پناہ دو، اور جو اللہ کے نام پر تم سے سوال کرے تو اسے (کچھ نہ کچھ) دو، اور جو تمہارے ساتھ کوئی بھلائی کرے تو اسے بدلہ دو، اگر تم (بدلہ دینے کی) وسعت نہ پاؤ تو اس کے حق میں دعا کرو۔“",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) said: 'If anyone seeks protection in Allah's name, give him protection; if anyone asks in Allah's name, give him something; and if anyone does you a favor, reward him, but if you do not have the means to do so, pray for him.'"
      }
    }
  ]
}
