{
  "chapId": 69,
  "bookId": 8,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 905,
    "to": 913
  },
  "hadiths": [
    {
      "id": 905,
      "name": {
        "arabic": "عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقْسِمُ , فَيَعْدِلُ , وَيَقُولُ : \"اَللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ , فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُ } رَوَاهُ اَلْأَرْبَعَةُ , وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ , وَلَكِنْ رَجَّحَ اَلتِّرْمِذِيُّ إِرْسَالَه ُ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اپنی ازواج مطہرات کے درمیان باری تقسیم کرتے تھے اور عدل و انصاف کو ملحوظ رکھتے تھے۔ اس کے بعد اللہ تعالیٰ کے حضور عرض کرتے تھے ”الٰہی! جو میرے بس میں ہے اس کے مطابق میں نے یہ تقسیم کی ہے اور جو میرے بس میں نہیں، تیرے اختیار میں ہے، اس میں مجھے ملامت نہ کرنا۔“ اسے چاروں نے روایت کی ہے اور ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے، لیکن ترمذی نے اس روایت کے مرسل ہونے کو ترجیح دی ہے۔",
        "english": "Narrated Aisha (RA): Allah's Messenger (ﷺ) used to divide his time equally among his wives and be just, and say: 'O Allah, this is my division of what I possess, so do not blame me for what You possess and I do not possess (i.e., the heart's inclination).'"
      }
    },

    {
      "id": 906,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَنْ كَانَتْ لَهُ اِمْرَأَتَانِ , فَمَالَ إِلَى إِحْدَاهُمَا , جَاءَ يَوْمَ اَلْقِيَامَةِ وَشِقُّهُ مَائِلٌ } رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ , وَسَنَدُهُ صَحِيحٌ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس شخص کی دو بیویاں ہوں اور خاوند کا میلان ایک کی طرف رہا تو قیامت کے دن وہ ایسی حالت میں آئے گا کہ اس کا ایک پہلو جھکا ہوا ہو گا۔“ اسے احمد اور چاروں نے روایت کی ہے اور اس کی سند صحیح ہے۔",
        "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) said: \"If anyone has two wives and inclines towards one of them (showing injustice), he will come on the Day of Resurrection with one side of his body hanging down (paralyzed).\" [Reported by Ahmad and the four Imams; its chain is Sahih]."
      }
    },

    {
      "id": 907,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ قَالَ : { مِنَ اَلسُّنَّةِ إِذَا تَزَوَّجَ اَلرَّجُلُ اَلْبِكْرَ عَلَى اَلثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا , ثُمَّ قَسَمَ , وَإِذَا تَزَوَّجَ اَلثَّيِّبَ أَقَامَ عِنْدَهَا ثَلَاثًا , ثُمَّ قَسَمَ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيّ",
        "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ مسنون طریقہ یہ ہے کہ جب مرد پہلے سے شادی شدہ بیوی کی موجودگی میں کنواری سے نکاح کرے تو اس نئی دلہن کے پاس پہلے سات روز قیام کرے پھر باری تقسیم کرے اور جب شوہر دیدہ (بیوہ یا مطلقہ) سے نکاح کرے تو اس کے پاس تین روز قیام کرے پھر باری تقسیم کرے۔ (بخاری و مسلم)",
        "english": "Narrated Anas (RA): It is from the Sunnah that if a man marries a virgin while having a matron (previously married woman) as a wife, he should stay with the virgin for seven days and then distribute the turns. And if he marries a matron, he should stay with her for three days and then distribute the turns."
      }
    },

    {
      "id": 908,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-لَمَّا تَزَوَّجَهَا أَقَامَ عِنْدَهَا ثَلَاثًا , وَقَالَ : \" إِنَّهُ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ , إِنْ شِئْتِ سَبَّعْتُ لَكِ , وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي } رَوَاهُ مُسْلِمٌ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے جب ان سے نکاح کیا تو ان کے پاس تین روز قیام کیا اور فرمایا ”اپنے اہل کے نزدیک تو ذلیل نہیں ہے۔ اگر تو چاہے تو میں تیرے لیے سات روز مقرر کر کے قیام کرتا ہوں۔ پھر میں اپنی باقی سب عورتوں کے ہاں بھی سات سات روز قیام کروں گا۔“ (مسلم)",
        "english": "Narrated Umm Salamah (RA): When the Messenger of Allah (ﷺ) married her, he stayed with her for three nights and said: 'You are not held in low estimate by your people. If you wish I shall stay with you for seven nights, but if I stay with you for seven nights, I shall stay for seven nights with each of my wives.'"
      }
    },

    {
      "id": 909,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- { أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا لِعَائِشَةَ , وَكَانَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَقْسِمُ لِعَائِشَةَ يَوْمَهَا وَيَوْمَ سَوْدَةَ } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ سیدہ سودہ بنت زمعہ رضی اللہ عنہا نے اپنی باری کا دن سیدہ عائشہ رضی اللہ عنہا کو ہبہ کر دیا اور نبی کریم صلی اللہ علیہ وسلم سیدہ عائشہ رضی اللہ عنہا کے لیے ان کا اپنا دن بھی اور سیدہ سودہ رضی اللہ عنہا کا دن بھی تقسیم کرتے تھے۔ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): Sawdah bint Zam'ah (RA) gave up her turn (day) to 'Aisha (RA), and the Prophet (ﷺ) used to allot to 'Aisha her own turn and that of Sawdah."
      }
    },

    {
      "id": 910,
      "name": {
        "arabic": "وَعَنْ عُرْوَةَ قَالَ : { قَالَتْ عَائِشَةُ : يَا اِبْنَ أُخْتِي ! كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لَا يُفَضِّلُ بَعْضَنَا عَلَى بَعْضٍ فِي اَلْقَسْمِ مِنْ مُكْثِهِ عِنْدَنَا , وَكَانَ قَلَّ يَوْمٌ إِلَّا وَهُوَ يَطُوفُ عَلَيْنَا جَمِيعًا , فَيَدْنُو مِنْ كُلِّ اِمْرَأَةٍ مِنْ غَيْرِ مَسِيسٍ , حَتَّى يَبْلُغَ اَلَّتِي هُوَ يَوْمُهَا , فَيَبِيتَ عِنْدَهَا } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ وَاللَّفْظُ لَهُ , وَصَحَّحَهُ اَلْحَاكِمُ وَلِمُسْلِمٍ : عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا صَلَّى اَلْعَصْرَ دَارَ عَلَى نِسَائِهِ , ثُمَّ يَدْنُو مِنْهُنَّ } اَلْحَدِيث",
        "urdu": "سیدنا عروہ رحمہ اللہ سے روایت ہے کہ سیدہ عائشہ رضی اللہ عنہا نے فرمایا ”اے میری بہن کے لخت جگر (بھانجے)! رسول اللہ صلی اللہ علیہ وسلم اپنی ازواج مطہرات کی باری کی تقسیم میں کسی کو کسی پر فوقیت و فضیلت نہیں دیتے تھے۔ ہمارے پاس آپ صلی اللہ علیہ وسلم کے قیام کے اعتبار سے آپ صلی اللہ علیہ وسلم کا معمول تھا اور کم ہی ایسا کوئی دن ہو گا جس میں آپ صلی اللہ علیہ وسلم ہمارے پاس آتے جاتے نہ ہوں اور ہر بیوی کے پاس جاتے ضرور مگر جماع نہ فرماتے (صرف پیار و محبت سے پیش آتے)۔ پھر اس بیوی کے پاس پہنچ جاتے جس کی باری ہوتی اور رات اس کے پاس بسر فرماتے۔“ (احمد و ابوداؤد) اور مسلم میں ہے کہ آپ ﷺ عصر کے بعد سب بیویوں کے پاس تشریف لے جاتے تھے۔",
        "english": "Narrated 'Urwa: 'Aishah (RA) said, \"O my nephew! The Messenger of Allah (ﷺ) never used to prefer one of us over another in his division of the time he stayed with us. It was very rare that a day passed without him visiting all of us and coming near to each of his wives without having intercourse, until he reached the one whose turn it was and spent the night with her.\" [Reported by Ahmad and Abu Dawud, and the wording is Abu Dawud's; Al-Hakim graded it Sahih]. In Muslim, 'Aishah (RA) said: \"After Al-Asr prayer, the Messenger of Allah (ﷺ) used to visit his wives and go near them.\""
      }
    },

    {
      "id": 911,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَانَ يَسْأَلُ فِي مَرَضِهِ اَلَّذِي مَاتَ فِيهِ : \" أَيْنَ أَنَا غَدًا ? \" , يُرِيدُ : يَوْمَ عَائِشَةَ , فَأَذِنَ لَهُ أَزْوَاجُهُ يَكُونُ حَيْثُ شَاءَ , فَكَانَ فِي بَيْتِ عَائِشَةَ } مُتَّفَقٌ عَلَيْه",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جس مرض میں وفات پائی اس میں دریافت فرماتے تھے کہ ”کل میری باری کس کے ہاں ہے؟“ ان کے پیش نظر سیدہ عائشہ رضی اللہ عنہا کا دن ہوتا تھا۔ آپ صلی اللہ علیہ وسلم کی ازواج مطہرات نے اس کی اجازت دے دی کہ جہاں چاہیں رہیں۔ پس بعد میں آپ صلی اللہ علیہ وسلم سیدہ عائشہ رضی اللہ عنہا کے ہاں ہی رہے۔ (بخاری و مسلم)",
        "english": "Narrated 'Aisha (RA): During the illness which preceded his death, Allah's Messenger (ﷺ) used to ask, 'Where am I (scheduled to be) tomorrow?' seeking to know when it would be 'Aisha's turn. His wives then gave him permission to stay wherever he wished, so he stayed at 'Aisha's house until he passed away."
      }
    },

    {
      "id": 912,
      "name": {
        "arabic": " وَعَنْهَا قَالَتْ : { كَانَ رَسُولُ اَللَّه ‏- صلى الله عليه وسلم ‏-إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ , فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا , خَرَجَ بِهَا } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی سفر پر روانہ ہونے کا ارادہ فرماتے تو اپنی بیویوں کے درمیان قرعہ اندازی کرتے۔ پس جس بیوی کے نام کا قرعہ نکلتا وہ آپ صلی اللہ علیہ وسلم کی ہم سفر ہوتی۔ (بخاری و مسلم)",
        "english": "Narrated 'Aishah (RA): Whenever the Messenger of Allah (ﷺ) intended to go on a journey, he would cast lots among his wives and would take with him the one whose lot was drawn. [Agreed upon]."
      }
    },

    {
      "id": 913,
      "name": {
        "arabic": " وَعَنْ عَبْدِ اَللَّهِ بْنِ زَمْعَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَجْلِدُ أَحَدُكُمْ اِمْرَأَتَهُ جَلْدَ اَلْعَبْدِ } رَوَاهُ اَلْبُخَارِيّ ُ",
        "urdu": " سیدنا عبداللہ بن زمعہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے کوئی بھی اپنی بیوی کو غلاموں کی طرح نہ مارے۔“ (بخاری)",
        "english": "Narrated 'Abdullah bin Zam'a (RA): Allah's Messenger (ﷺ) said, 'None of you should flog his wife as he flogs a slave.'"
      }
    }
  ]
}
