{
  "chapId": 54,
  "bookId": 7,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 760,
    "to": 764
  },
  "hadiths": [
    {
      "id": 760,
      "name": {
        "arabic": " عَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { قَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ, فَإِذَا وَقَعَتِ اَلْحُدُودُ وَصُرِّفَتْ اَلطُّرُقُ فَلَا شُفْعَةَ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  وَفِي رِوَايَةِ مُسْلِمٍ: { اَلشُّفْعَةُ فِي كُلِّ شِرْكٍ: أَرْضٍ, أَوْ رَبْعٍ, أَوْ حَائِطٍ, لَا يَصْلُحُ أَنْ يَبِيعَ حَتَّى يَعْرِضَ عَلَى شَرِيكِهِ } وَفِي رِوَايَةِ اَلطَّحَاوِيِّ: قَضَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِالشُّفْعَةِ فِي كُلِّ شَيْءٍ, وَرِجَالُهُ ثِقَاتٌ ",
        "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہر اس چیز میں شفعہ کا فیصلہ دیا ہے جو تقسیم نہ ہوئی ہو مگر جب حدود بندی ہو جائے اور راستے الگ ہو جائیں تو پھر شفعہ نہیں۔ (بخاری و مسلم) اور یہ الفاظ بخاری کے ہیں اور مسلم کی ایک روایت میں ہے کہ شفعہ ہر مشترک چیز میں ہے (مثلا) زمین میں، مکان میں، باغ میں۔ اپنے حصہ دار (شریک) کے روبرو پیش کئے بغیر کسی کیلئے چیز فروخت کرنا درست نہیں اور طحاوی میں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ہر چیز میں شفعہ رکھا ہے۔ اس کے راوی ثقہ ہیں۔ ",
        "english": "Narrated Jabir bin 'Abdullah (RA): Allah's Messenger (ﷺ) decreed the right of Pre-emption (Shuf'a) in everything which has not been divided; but when the boundaries are fixed and the roads are laid out, there is no right of Pre-emption. [Agreed upon, and the wording is Al-Bukhari's]. In a narration of Muslim: 'The right of Pre-emption is in every joint property, whether land, house, or garden. It is not lawful for one to sell it until he has offered it to his partner.' In the narration of At-Tahawi: 'The Prophet (ﷺ) decreed Shuf'a in everything.' Its narrators are reliable."
      }
    },

    {
      "id": 761,
      "name": {
        "arabic": "وَعَنْ أَبِي رَافِعٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْجَارُ أَحَقُّ بِصَقَبِهِ } أَخْرَجَهُ اَلْبُخَارِيُّ, وَفِيهِ قِصَّةٌ",
        "urdu": "سیدنا ابورافع رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہمسایہ اپنے قریب ہونے کی وجہ سے (خریداری کا) زیادہ حق رکھتا ہے۔“ اسے بخاری نے روایت کیا ہے اور اس بارے میں ایک لمبا قصہ بھی ہے۔",
        "english": "Narrated Abu Rafi' (RA): Allah's Messenger (ﷺ) said: \"The neighbor has more right to property that is near to him.\" [Reported by Al-Bukhari, and it contains a story]."
      }
    },

    {
      "id": 762,
      "name": {
        "arabic": " وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ جَارُ اَلدَّارِ أَحَقُّ بِالدَّارِ } رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَلَهُ عِلَّةٌ ",
        "urdu": " سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مکان کا ہمسایہ اس مکان کا زیادہ حق رکھتا ہے۔“ اسے نسائی نے روایت کیا ہے اور ابن حبان نے اسے صحیح کہا ہے لیکن اس میں علت ہے۔",
        "english": "Narrated Anas bin Malik (RA): Allah's Messenger (ﷺ) said: \"The neighbor of a house has more right to that house.\" [Reported by An-Nasa'i, and Ibn Hibban graded it Sahih, but it has a defect (Illah)]."
      }
    },

    {
      "id": 763,
      "name": {
        "arabic": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْجَارُ أَحَقُّ بِشُفْعَةِ جَارِهِ, يُنْتَظَرُ بِهَا ‏- وَإِنْ كَانَ غَائِبًا ‏- إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَرِجَالُهُ ثِقَاتٌ",
        "urdu": "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پڑوسی اپنے پڑوسی کے شفعہ کا زیادہ حقدار ہے۔ اس کے شفعہ کا انتظار کیا جائے گا، خواہ وہ غائب (موجود نہ) ہو، بشرطیکہ دونوں کا راستہ ایک ہو۔“ اسے احمد اور چاروں (سنن) نے روایت کیا ہے اور اس کے راوی ثقہ ہیں۔",
        "english": "Narrated Jabir (RA): Allah's Messenger (ﷺ) said: \"A neighbor is most entitled to the pre-emption of his neighbor; he should be waited for even if he is absent, provided they both have a common path.\" [Reported by Ahmad and the four Sunan, and its narrators are reliable]."
      }
    },

    {
      "id": 764,
      "name": {
        "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلشُّفْعَةُ كَحَلِّ اَلْعِقَالِ } رَوَاهُ اِبْنُ مَاجَهْ وَالْبَزَّارُ, وَزَادَ: \" وَلَا شُفْعَةَ لِغَائِبٍ \" وَإِسْنَادُهُ ضَعِيفٌ ",
        "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”شفعہ (کا حق) رسی کھولنے کی طرح (جلد ختم ہو جانے والا) ہے۔“ اسے ابن ماجہ اور بزار نے روایت کیا ہے اور بزار نے یہ اضافہ بھی کیا ہے کہ ”غیر حاضر شخص کے لیے شفعہ کا کوئی حق نہیں ہے۔“ اس کی سند ضعیف ہے۔",
        "english": "Narrated Ibn 'Umar (RA): The Prophet (ﷺ) said: \"The right of pre-emption (Shuf'a) is like the unfastening of a camel's fold (i.e., it must be claimed quickly).\" [Reported by Ibn Majah and al-Bazzar, who added: \"And there is no right of pre-emption for one who is absent.\"] Its chain of narrators is weak."
      }
    }
  ]
}