{
  "hadithId": 620,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh-al-maram/6/40"
    ],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1678)، ومسلم (1293). واللفظ لمسلم. قوله 'من جمع' أي من مزدلفة، وسميت بذلك لاجتماع الناس فيها.",
    "urdu": "صحیح۔ اسے امام بخاری (1678) اور امام مسلم (1293) نے روایت کیا ہے۔ حدیث میں مذکور لفظ 'جمع' سے مراد مزدلفہ ہے کیونکہ وہاں لوگ اکٹھے ہوتے ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (1678) and Muslim (1293). The term 'Jam'' in the Hadith refers to Muzdalifah, named so because of the gathering of pilgrims there."
  },
  "importantWords": [
    {
      "arabic": "بَعَثَنِي",
      "english": "Sent me",
      "urdu": "مجھے بھیجا / روانہ کیا"
    },
    {
      "arabic": "الثَّقَلِ",
      "english": "Baggage / Luggage",
      "urdu": "بھاری سامان"
    },
    {
      "arabic": "الضَّعَفَةِ",
      "english": "Weak ones",
      "urdu": "کمزور لوگ"
    },
    {
      "arabic": "جَمْعٍ",
      "english": "Muzdalifah",
      "urdu": "مزدلفہ"
    },
    {
      "arabic": "بِلَيْلٍ",
      "english": "During the night",
      "urdu": "رات کے وقت"
    }
  ],
  "summary": {
    "urdu": "اسلام نے حج کے دوران کمزوروں، عورتوں اور بچوں کو یہ رعایت دی ہے کہ وہ ازدحام سے بچنے کے لیے مزدلفہ سے رات کے آخری پہر منیٰ کے لیے روانہ ہو سکتے ہیں۔",
    "english": "Islam grants a concession to the weak, women, and children during Hajj, allowing them to leave Muzdalifah for Mina in the latter part of the night to avoid crowds."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1856)",
      "english": "Sahih al-Bukhari (1856)"
    },
    {
      "arabic": "صحيح مسلم (1293)",
      "english": "Sahih Muslim (1293)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کمزوروں کے لیے شرعی رخصت",
        "english": "Legal Concession for the Weak"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مزدلفہ سے روانگی کا وقت",
              "english": "Departure Time from Muzdalifah"
            },
            "content": {
              "urdu": [
                "عام حاجیوں کے لیے سنت یہ ہے کہ وہ مزدلفہ میں رات گزاریں اور فجر کی نماز پڑھ کر پو پھٹنے تک قیام کریں۔",
                "لیکن بوڑھوں، بچوں، مریضوں اور خواتین کے لیے اجازت ہے کہ وہ آدھی رات کے بعد یا چاند چھپنے کے وقت منیٰ چلے جائیں۔",
                "نبی ﷺ نے خود سیدنا ابن عباس (جو اس وقت بچے تھے) اور اپنے گھر کی خواتین کو یہ رخصت عطا فرمائی۔"
              ],
              "english": [
                "For regular pilgrims, the Sunnah is to stay in Muzdalifah until dawn and depart after performing Fajr.",
                "However, the elderly, children, the sick, and women are permitted to leave for Mina after midnight.",
                "The Prophet (ﷺ) personally granted this permission to Ibn Abbas (who was a child then) and the women of his household."
              ]
            }
          },
          {
            "title": {
              "urdu": "ازدحام سے بچاؤ کی حکمت",
              "english": "Wisdom of Avoiding Crowds"
            },
            "content": {
              "urdu": [
                "اس رخصت کا مقصد کمزوروں کو صبح کے وقت ہونے والے شدید رش اور دھکم پیل سے بچانا ہے۔",
                "تاکہ وہ اطمینان کے ساتھ منیٰ پہنچ کر رمی (کنکریاں مارنا) کر سکیں۔",
                "یہ حکم ثابت کرتا ہے کہ شریعت میں انسانی جان کی حفاظت اور سہولت کو اہمیت حاصل ہے۔"
              ],
              "english": [
                "The purpose of this concession is to protect the weak from the intense crowding and pushing that occurs at dawn.",
                "It allows them to reach Mina calmly and perform the stoning (Rami) of the Jamarat.",
                "This ruling demonstrates that Sharia prioritizes human safety and ease."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات اور مسائل",
        "english": "Juristic Rulings and Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ساتھ جانے والوں کا حکم",
              "english": "Ruling for Those Accompanying the Weak"
            },
            "content": {
              "urdu": [
                "جو تندرست مرد خواتین یا کمزوروں کے نگران کے طور پر ساتھ ہوں، وہ بھی ان کے ساتھ رات کو روانہ ہو سکتے ہیں۔",
                "ان کے لیے بھی وہی رعایت ہوگی جو ان کے زیرِ کفالت افراد کے لیے ہے۔",
                "اسی طرح سامان کی حفاظت پر مامور افراد بھی اس رخصت سے فائدہ اٹھا سکتے ہیں۔"
              ],
              "english": [
                "Healthy men acting as guardians for women or the weak may also depart with them during the night.",
                "They share the same concession granted to those under their care.",
                "Similarly, those in charge of protecting luggage can also avail of this permission."
              ]
            }
          },
          {
            "title": {
              "urdu": "رمیِ جمرہ کا وقت",
              "english": "Timing for Stoning the Jamarah"
            },
            "content": {
              "urdu": [
                "ان لوگوں کے لیے جائز ہے کہ وہ منیٰ پہنچ کر سورج نکلنے سے پہلے ہی جمرہ عقبہ کو کنکریاں مار لیں۔",
                "اگرچہ افضل وقت طلوعِ آفتاب کے بعد ہے، مگر رخصت پانے والوں کے لیے رات کے آخری حصے میں رمی کرنا درست ہے۔",
                "یہ مسلک اکثر ائمہ بشمول امام شافعی اور امام احمد کا ہے۔"
              ],
              "english": [
                "It is permissible for these individuals to stone the Jamarah al-Aqabah before sunrise upon reaching Mina.",
                "While the preferred time is after sunrise, it is valid for those with concessions to do it in the latter part of the night.",
                "This is the view of the majority including Imam ash-Shafi'i and Imam Ahmad."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور سماجی پہلو",
        "english": "Educational and Social Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا: 'دین آسان ہے'۔ حج جیسے مشکل سفر میں بھی آپ ﷺ نے انسانی کمزوری کا لحاظ رکھا۔",
                "بلاوجہ مشقت میں پڑنا مقصودِ عبادت نہیں ہے بلکہ اللہ کی حدود کی پاسداری اصل ہے۔",
                "رخصتوں پر عمل کرنا بھی اللہ کو ویسے ہی پسند ہے جیسے عزیمت پر عمل کرنا۔"
              ],
              "english": [
                "The Prophet (ﷺ) said, 'The religion is easy.' Even in difficult journeys like Hajj, he considered human fragility.",
                "Seeking unnecessary hardship is not the goal of worship; following Allah's limits is what matters.",
                "Allah loves for His concessions to be taken just as He loves His obligations to be fulfilled."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین اور بچوں کا احترام",
              "english": "Respect for Women and Children"
            },
            "content": {
              "urdu": [
                "یہ حدیث ظاہر کرتی ہے کہ اسلام معاشرے کے کمزور طبقات کو کس قدر تحفظ فراہم کرتا ہے۔",
                "اجتماعی عبادات میں بھی ان کی سہولت کا پہلے سوچا گیا ہے۔",
                "مردوں کو چاہیے کہ وہ حج کے دوران خواتین اور کمزوروں کا راستہ آسان بنائیں۔"
              ],
              "english": [
                "This Hadith illustrates the protection Islam provides to the vulnerable segments of society.",
                "Even in collective worship, their convenience was considered first.",
                "Men should strive to make the path easier for women and the weak during Hajj."
              ]
            }
          }
        ]
      }
    }
  ]
}