{
  "hadithId": 853,
  "hadithNo": 30,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/30"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (2/324) ، وأبو داود (2052) ، والحاكم (2/195) من طريق قتادة عن سعيد بن أبي الحسن عن أبي هريرة. وصححه الحاكم ووافقه الذهبي.",
    "urdu": "صحیح۔ اسے امام احمد (324/2) اور ابوداؤد (2052) نے روایت کیا ہے۔ اس کے راوی ثقہ ہیں اور امام حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (2/324) and Abu Dawud (2052). Its narrators are reliable and it was authenticated by Al-Hakim and Adh-Dhahabi."
  },
  "importantWords": [
    {
      "arabic": "الزَّانِي",
      "english": "Adulterer / Fornicator",
      "urdu": "زنا کرنے والا"
    },
    {
      "arabic": "الْمَجْلُودُ",
      "english": "The one lashed",
      "urdu": "جسے کوڑے مارے گئے ہوں"
    },
    {
      "arabic": "يَنْكِحُ",
      "english": "Marries",
      "urdu": "نکاح کرے"
    },
    {
      "arabic": "إِلَّا مِثْلَهُ",
      "english": "Except one like himself",
      "urdu": "سوائے اپنے جیسے کے"
    },
    {
      "arabic": "ثِقَاتٌ",
      "english": "Trustworthy / Reliable",
      "urdu": "قابلِ اعتماد"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں گناہِ کبیرہ (زنا) کے مرتکب افراد کے نکاح کے حوالے سے سخت سماجی اور شرعی پابندی کا ذکر ہے تاکہ معاشرے کی پاکیزگی برقرار رہے۔",
    "english": "This Hadith highlights a strict social and legal restriction regarding the marriage of those convicted of adultery to maintain the moral purity of society."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2052)",
      "english": "Sunan Abi Dawud (2052)"
    },
    {
      "arabic": "مسند أحمد (324/2)",
      "english": "Musnad Ahmad (2/324)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3L0f6LpB3M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آیتِ قرآنی اور حدیث کا ربط",
        "english": "Connection between Quran and Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سورہ نور کی روشنی میں",
              "english": "In light of Surah An-Nur"
            },
            "content": {
              "urdu": [
                "قرآن مجید میں اللہ تعالیٰ نے فرمایا کہ زانی مرد زانی عورت یا مشرکہ ہی سے نکاح کرتا ہے۔",
                "یہ حدیث اسی قرآنی حکم کی تائید اور عملی تشریح کرتی ہے۔",
                "یہ پابندی بدکار افراد کو پاکدامن مسلمانوں سے الگ رکھنے کے لیے ہے۔"
              ],
              "english": [
                "In the Quran, Allah states that an adulterer only marries an adulteress or a polytheist.",
                "This Hadith supports and provides a practical explanation of that Quranic injunction.",
                "This restriction is meant to segregate immoral individuals from chaste Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "پاکدامنی کا معیار",
              "english": "Criteria of Chastity"
            },
            "content": {
              "urdu": [
                "اسلام نکاح کے لیے کفو (برابری) اور اخلاقی مماثلت کو اہمیت دیتا ہے۔",
                "ایک پاکدامن مرد یا عورت کا حق ہے کہ اسے پاکدامن شریکِ حیات ملے۔",
                "بدکاری کا داغ نکاح جیسے مقدس بندھن کی بنیاد کو کمزور کر دیتا ہے۔"
              ],
              "english": [
                "Islam emphasizes compatibility (Kufu) and moral similarity for marriage.",
                "A chaste man or woman has the right to be matched with a chaste partner.",
                "The stain of immorality weakens the foundation of the sacred bond of marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توبہ اور اس کے اثرات",
        "english": "Repentance and its Effects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خلوصِ نیت سے توبہ",
              "english": "Sincere Repentance"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک اگر زانی سچی توبہ کر لے تو یہ ممانعت ختم ہو جاتی ہے۔",
                "توبہ گناہوں کو دھو دیتی ہے اور انسان دوبارہ پاکبازوں میں شامل ہو جاتا ہے۔",
                "یہ حکم ان لوگوں کے لیے ہے جو اپنی بدکاری پر اصرار کریں یا توبہ نہ کریں۔"
              ],
              "english": [
                "Most jurists believe that if an adulterer sincerely repents, this prohibition is lifted.",
                "Repentance washes away sins and allows a person to rejoin the ranks of the righteous.",
                "This ruling applies specifically to those who persist in immorality without repenting."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی بائیکاٹ کی حکمت",
              "english": "Wisdom of Social Boycott"
            },
            "content": {
              "urdu": [
                "ایسی پابندیاں بدکاری کو معاشرے میں عام ہونے سے روکتی ہیں۔",
                "جب لوگوں کو معلوم ہوگا کہ گناہ کے نتیجے میں ان کے نکاح کی راہیں بند ہوں گی، تو وہ بچیں گے۔",
                "یہ مجرم کے لیے ایک قسم کی سماجی سزا اور عبرت کا نشان ہے۔"
              ],
              "english": [
                "Such restrictions prevent immorality from becoming widespread in society.",
                "Awareness that sin restricts marital options serves as a strong deterrent.",
                "It functions as a form of social penalty and a warning to others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Opinions of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حنبلی مذہب کا موقف",
              "english": "Position of the Hanbali School"
            },
            "content": {
              "urdu": [
                "امام احمد بن حنبل کے نزدیک زانی کا نکاح پاکدامن عورت سے سرے سے جائز ہی نہیں جب تک وہ توبہ نہ کر لے۔",
                "وہ اس حدیث کے ظاہری الفاظ سے استدلال کرتے ہیں۔",
                "ان کے نزدیک توبہ کے بغیر ایسا نکاح فاسد (باطل) تصور ہوگا۔"
              ],
              "english": [
                "According to Imam Ahmad, marrying an adulterer to a chaste woman is invalid until he repents.",
                "They derive their argument from the literal wording of this Hadith.",
                "In their view, such a marriage remains invalid (fasid) without sincere repentance."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور فقہاء کی رائے",
              "english": "Opinion of the Majority"
            },
            "content": {
              "urdu": [
                "احناف، مالکیہ اور شوافع کے نزدیک یہ حکم کراہت یا تنزیہ پر محمول ہے۔",
                "ان کے نزدیک نکاح منعقد ہو جاتا ہے مگر ایسا کرنا ناپسندیدہ ہے۔",
                "وہ اسے اخلاقی برتری اور سماجی تربیت کا ایک ضابطہ قرار دیتے ہیں۔"
              ],
              "english": [
                "Hanafis, Malikis, and Shafi'is interpret this command as a matter of strong dislike (karahah).",
                "They hold that the marriage contract is valid but highly discouraged.",
                "They view it as a code for moral superiority and social discipline."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کی حفاظت",
              "english": "Protection of the Family System"
            },
            "content": {
              "urdu": [
                "نیک میاں بیوی ہی ایک صالح نسل کی پرورش کر سکتے ہیں۔",
                "بدکار ساتھی کا اثر پوری نسل اور گھریلو ماحول پر پڑتا ہے۔",
                "اسلام خاندان کی بنیاد تقویٰ اور پاکیزگی پر رکھنے کا حکم دیتا ہے۔"
              ],
              "english": [
                "Only righteous spouses can raise a virtuous generation.",
                "An immoral partner negatively affects the entire lineage and domestic environment.",
                "Islam commands that the foundation of a family be based on piety and purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہ سے نفرت",
              "english": "Hatred for Sin"
            },
            "content": {
              "urdu": [
                "اس حدیث کا مقصد گناہ سے نفرت پیدا کرنا ہے نہ کہ گناہ گار کی تذلیل۔",
                "یہ معاشرے کو پیغام دیتی ہے کہ اخلاقی پستی کے سنگین نتائج نکلتے ہیں۔",
                "مومن کو ہمیشہ اپنی عفت اور پاکدامنی کی حفاظت کرنی چاہیے۔"
              ],
              "english": [
                "The aim of this Hadith is to create hatred for sin, not to humiliate the sinner.",
                "It messages society that moral degradation has serious legal and social consequences.",
                "A believer must always safeguard their chastity and moral integrity."
              ]
            }
          }
        ]
      }
    }
  ]
}