{
  "hadithId": 655,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/8"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "رواه أحمد (2/233) وأبو داود (3842). قال البخاري وأبو حاتم أن ذكر 'المائع' فيه وهم، والصحيح حديث ميمونة في البخاري بدون هذه الزيادة.",
    "urdu": "اسے احمد اور ابو داؤد نے روایت کیا ہے۔ امام بخاری اور ابو حاتم کے نزدیک اس کے ایک راوی 'معمر' سے اس لفظ 'مائع' (پگھلے ہوئے) کے ذکر میں وہم ہوا ہے، جبکہ صحیح روایت سیدہ میمونہ کی ہے جو صرف جمے ہوئے گھی کا ذکر کرتی ہے۔",
    "english": "Reported by Ahmad and Abu Dawud. Al-Bukhari and Abu Hatim classified the specific mention of 'liquid' butter as a mistake (Wahm) by the narrator Ma'mar, whereas the Sahih version from Maymunah only details the solid state."
  },
  "importantWords": [
    {
      "arabic": "اَلْفَأْرَةُ",
      "english": "The mouse",
      "urdu": "چوہا"
    },
    {
      "arabic": "اَلسَّمْنِ",
      "english": "Clarified butter",
      "urdu": "گھی"
    },
    {
      "arabic": "جَامِداً",
      "english": "Solid / Frozen",
      "urdu": "منجمد / جما ہوا"
    },
    {
      "arabic": "مَايِعًا",
      "english": "Liquid / Fluid",
      "urdu": "پگھلا ہوا / سیال"
    },
    {
      "arabic": "فَأَلْقُوهَا",
      "english": "Throw it away",
      "urdu": "پس اسے پھینک دو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ گھی میں چوہا گر جائے تو جمے ہوئے گھی سے صرف متاثرہ حصہ نکالنا کافی ہے، مگر سیال گھی کے بارے میں ممانعت وارد ہوئی ہے۔",
    "english": "The Hadith explains that if a mouse falls into solid ghee, removing the affected part is sufficient, but it warns against using liquid ghee in such cases."
  },
  "references": [
    {
      "arabic": "رواه أحمد (2/232)",
      "english": "Reported by Ahmad (2/232)"
    },
    {
      "arabic": "رواه أبو داود (3842)",
      "english": "Reported by Abu Dawud (3842)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "منكر بهذا اللفظ",
    "english": "Munkar (Rejected with this wording)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "منجمد گھی کا شرعی حکم",
        "english": "Ruling on Solid Ghee"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نجاست کا محدود اثر",
              "english": "Limited Effect of Impurity"
            },
            "content": {
              "urdu": [
                "اگر گھی جما ہوا ہو تو چوہے کی نجاست صرف اس کے چھونے والے حصے تک رہتی ہے۔",
                "ایسی صورت میں پورے گھی کو ضائع کرنا مال کا زیاں اور فضول خرچی ہے۔",
                "صرف چوہا اور اس کے ارد گرد کا تھوڑا سا گھی نکال دینے سے باقی پاک رہتا ہے۔"
              ],
              "english": [
                "If ghee is solid, the impurity of the mouse remains localized to the contact area.",
                "In this case, wasting the entire container of ghee would be considered extravagance.",
                "Removing only the mouse and the immediate surrounding ghee keeps the rest pure."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت کا آسان طریقہ",
              "english": "Easy Method of Purification"
            },
            "content": {
              "urdu": [
                "اسلام نے طہارت کے معاملے میں انسانوں کے لیے بہت آسانی پیدا فرمائی ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ نجاست منجمد چیزوں میں سرایت نہیں کرتی۔",
                "باقی ماندہ گھی کو کھانے اور دیگر استعمال میں لانا شرعی طور پر بالکل جائز ہے۔"
              ],
              "english": [
                "Islam has provided great ease for people regarding matters of purification.",
                "This ruling proves that impurity does not spread through solid substances easily.",
                "Using the remaining ghee for eating or other purposes is perfectly lawful in Sharia."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیال گھی اور مائع اشیاء",
        "english": "Liquid Ghee and Fluids"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نجاست کی سرایت",
              "english": "Spread of Impurity"
            },
            "content": {
              "urdu": [
                "مائع یا پگھلے ہوئے گھی میں نجاست گرتے ہی پورے برتن میں پھیل جاتی ہے۔",
                "حدیث میں ایسے گھی کے قریب نہ جانے کا حکم صحت اور طہارت کی بنا پر ہے۔",
                "سیال چیز میں پاک اور ناپاک کے درمیان امتیاز کرنا ناممکن ہو جاتا ہے۔"
              ],
              "english": [
                "In liquid ghee, impurities spread throughout the entire container instantly upon contact.",
                "The command to avoid such ghee is based on principles of health and purity.",
                "It becomes impossible to distinguish between clean and unclean parts in a fluid."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاطی تدابیر",
              "english": "Precautionary Measures"
            },
            "content": {
              "urdu": [
                "اگرچہ اس لفظ 'مائع' پر محدثین نے جرح کی ہے، مگر فقہی طور پر احتیاط اسی میں ہے۔",
                "ناپاک چیز کا کھانا حرام ہے، اس لیے مشتبہ سیال سے بچنا تقویٰ کا تقاضا ہے۔",
                "ایسا گھی اگر کھانے کے قابل نہ رہے تو اسے چراغ جلانے جیسے کاموں میں لیا جا سکتا ہے۔"
              ],
              "english": [
                "Although scholars questioned the word 'liquid' here, juristic caution aligns with it.",
                "Consuming impure things is prohibited, so avoiding doubtful liquids is a mark of piety.",
                "If such ghee is unfit for eating, it may potentially be used for non-food purposes like lamps."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محدثین کی فنی تحقیق",
        "english": "Technical Analysis by Scholars"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راوی کا وہم",
              "english": "Narrator's Error"
            },
            "content": {
              "urdu": [
                "امام بخاری اور دیگر نقاد نے اس روایت میں 'مائع' کے اضافے کو غلطی قرار دیا ہے۔",
                "صحیح بخاری کی مستند روایت میں صرف جمے ہوئے گھی کا ذکر ملتا ہے۔",
                "محدثین کی یہ باریک بینی حدیث کی حفاظت اور صحت کے بلند معیار کو ظاہر کرتی ہے۔"
              ],
              "english": [
                "Imam Bukhari and other critics labeled the addition of 'liquid' as a narrator's error.",
                "The most authentic version in Sahih Bukhari only mentions the solid state of ghee.",
                "This scrutiny by scholars demonstrates the high standards of Hadith preservation."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب کا اختلاف",
              "english": "Differences in Juristic Schools"
            },
            "content": {
              "urdu": [
                "بعض فقہاء پگھلے ہوئے گھی کو بھی نکال کر باقی استعمال کرنے کے قائل ہیں۔",
                "وہ دلیل دیتے ہیں کہ اگر گھی بہت زیادہ (کثیر) ہو تو نجاست اثر نہیں کرے گی۔",
                "تاہم، عام طور پر گھروں میں استعمال ہونے والے تھوڑے گھی میں احتیاط ہی بہتر ہے۔"
              ],
              "english": [
                "Some jurists believe even liquid ghee can be used if the quantity is very large.",
                "They argue that in massive amounts, minor impurities do not affect the whole.",
                "However, for small quantities typically used in homes, caution is always preferred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور حفظانِ صحت کے اصول",
        "english": "Health and Hygiene Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیماریوں سے بچاؤ",
              "english": "Prevention of Diseases"
            },
            "content": {
              "urdu": [
                "چوہے مختلف قسم کے جراثیم اور وبائی امراض پھیلانے کا سبب بنتے ہیں۔",
                "اسلامی احکام نہ صرف روحانی بلکہ جسمانی صحت کے تحفظ کے بھی ضامن ہیں۔",
                "گندی چیزوں سے پرہیز کرنا انسانی فطرت اور شریعت دونوں کا تقاضا ہے۔"
              ],
              "english": [
                "Mice are known carriers of various pathogens and epidemic diseases.",
                "Islamic rulings guarantee protection for both spiritual and physical health.",
                "Avoiding filthy substances is a requirement of both human nature and Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزق کی حفاظت",
              "english": "Protection of Sustenance"
            },
            "content": {
              "urdu": [
                "اشیاءِ خوردونوش کو ڈھانپ کر رکھنا سنت ہے تاکہ ان میں موذی جانور نہ گریں۔",
                "یہ حدیث ہمیں اپنے کھانے پینے کے برتنوں کی حفاظت کی ترغیب دیتی ہے۔",
                "سستی اور غفلت کی وجہ سے رزق کا ضیاع روکنا ایک مسلمان کی ذمہ داری ہے۔"
              ],
              "english": [
                "It is Sunnah to keep food and drink covered to prevent pests from falling in.",
                "This Hadith encourages us to be vigilant in protecting our food containers.",
                "Preventing the waste of sustenance due to laziness is a Muslim's responsibility."
              ]
            }
          }
        ]
      }
    }
  ]
}