{
  "hadithId": 696,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/64"],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه ابن ماجه (2275)، والحاكم (2/37) واللفظ له، والبيهقي في شعب الإيمان (5131). وصححه الحاكم على شرط الشيخين ووافقه الذهبي في التلخيص.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابن ماجہ (2275) نے مختصراً اور حاکم (2/37) نے مکمل سند کے ساتھ روایت کیا ہے۔ امام حاکم نے اسے شیخین کی شرط پر صحیح قرار دیا ہے اور علامہ ذہبی نے ان کی موافقت کی ہے۔",
    "english": "Sahih. Reported by Ibn Majah (2275) and Al-Hakim (2/37). Al-Hakim graded it Sahih according to the criteria of Al-Bukhari and Muslim, and Adh-Dhahabi concurred with him."
  },
  "importantWords": [
    {
      "arabic": "الرِّبَا",
      "english": "Usury / Interest",
      "urdu": "سود"
    },
    {
      "arabic": "أَيْسَرُهَا",
      "english": "The least of them",
      "urdu": "ان میں سب سے ہلکا"
    },
    {
      "arabic": "يَنْكِحَ",
      "english": "Marries / Commits adultery",
      "urdu": "نکاح کرے"
    },
    {
      "arabic": "أَرْبَى",
      "english": "Most excessive / Worst",
      "urdu": "سب سے بڑھ کر"
    },
    {
      "arabic": "عِرْضُ",
      "english": "Honor / Dignity",
      "urdu": "عزت و آبرو"
    },
    {
      "arabic": "بَابًا",
      "english": "Gates / Categories",
      "urdu": "درجے یا ابواب"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سود کی سنگینی کو واضح کیا گیا ہے کہ اس کا معمولی درجہ بھی انتہائی قبیح ہے، اور کسی مسلمان کی عزت اچھالنا سود کے بدترین درجے میں شمار ہوتا ہے۔",
    "english": "This Hadith emphasizes the gravity of Riba (interest), stating that even its mildest form is a heinous sin, while violating a Muslim's honor is the worst form of usury."
  },
  "references": [
    {
      "arabic": "سنن ابن ماجه، كتاب التجارات",
      "english": "Sunan Ibn Majah, Book of Trade"
    },
    {
      "arabic": "مستدرك الحاكم، كتاب البيوع",
      "english": "Mustadrak al-Hakim, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fS6L8t8qA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سود کی سنگینی اور اقسام",
        "english": "Severity and Types of Riba"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سود کے تہتر ابواب",
              "english": "Seventy-Three Gates of Riba"
            },
            "content": {
              "urdu": [
                "حدیث میں تہتر ابواب سے مراد سود کی کثرت اور اس کی مختلف پیچیدہ صورتیں ہیں۔",
                "سود صرف پیسوں کے لین دین تک محدود نہیں بلکہ یہ اخلاقیات پر بھی اثر انداز ہوتا ہے۔",
                "اس کثرت کو بیان کرنے کا مقصد مسلمانوں کو ہر مشکوک معاملے سے بچانا ہے۔"
              ],
              "english": [
                "The 'seventy-three gates' signify the vastness and complexity of usurious dealings.",
                "Usury is not limited to monetary exchange; it impacts the moral fabric of society.",
                "Mentioning this number warns Muslims to avoid every suspicious financial transaction."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدترین گناہ سے تشبیہ",
              "english": "Comparison to Heinous Sin"
            },
            "content": {
              "urdu": [
                "سود کے کم ترین درجے کو ماں سے نکاح جیسا قبیح فعل قرار دینا اس کی شدت کو ظاہر کرتا ہے۔",
                "یہ تشبیہ انسانی ضمیر کو جھنجھوڑنے کے لیے ہے تاکہ وہ سود کے قریب بھی نہ جائے۔",
                "اسلام میں سود لینا، دینا اور اس میں گواہ بننا سب اللہ کے خلاف اعلانِ جنگ ہے۔"
              ],
              "english": [
                "Likening the mildest Riba to incest emphasizes its extreme repulsiveness.",
                "This comparison aims to jolt the human conscience to stay far from usury.",
                "Taking, giving, or witnessing interest is considered a declaration of war against Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسلمان کی عزت اور سود",
        "english": "Muslim's Honor and Usury"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزت اچھالنا بدترین سود",
              "english": "Violating Honor as Worst Riba"
            },
            "content": {
              "urdu": [
                "کسی مسلمان کی آبرو ریزی یا غیبت کرنا سود کے سب سے بڑے درجے میں آتا ہے۔",
                "جس طرح سود میں مال ناحق بڑھایا جاتا ہے، اسی طرح غیبت میں کسی کی برائی بڑھا چڑھا کر کی جاتی ہے۔",
                "عزت اللہ کی طرف سے عطا کردہ ایک قیمتی سرمایہ ہے جسے پامال کرنا معاشی سود سے بھی بڑا جرم ہے۔"
              ],
              "english": [
                "Slandering or violating the dignity of a Muslim is considered the highest form of Riba.",
                "Just as Riba involves unjust gain, backbiting involves unjustly attacking another's character.",
                "Honor is a precious asset from Allah, and violating it is a greater crime than financial usury."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی اور معاشی تعلق",
              "english": "Moral and Economic Connection"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ اسلام میں اخلاقیات اور معاشیات ایک دوسرے سے جڑے ہوئے ہیں۔",
                "معاشی سود مال کو تباہ کرتا ہے جبکہ اخلاقی سود (بدگوئی) معاشرتی سکون کو غارت کرتی ہے۔",
                "مسلمان کو اپنے ہاتھ، زبان اور مال تینوں کی پاکیزگی کا خیال رکھنا چاہیے۔"
              ],
              "english": [
                "This Hadith clarifies that ethics and economics are deeply intertwined in Islam.",
                "Economic usury destroys wealth, while moral usury (slander) ruins social peace.",
                "A Muslim must ensure the purity of their hands, tongue, and financial dealings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی حکمت",
        "english": "Juristic and Educational Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شبہات سے بچنے کی تاکید",
              "english": "Emphasis on Avoiding Doubts"
            },
            "content": {
              "urdu": [
                "سود کے اتنے زیادہ درجے بتانے کا مطلب یہ ہے کہ سود کسی بھی لبادے میں ہو سکتا ہے۔",
                "جدید دور کے پیچیدہ بینکاری نظام میں سود کے 'تہتر ابواب' کو سمجھنا ضروری ہے۔",
                "تقویٰ کا تقاضا ہے کہ جس معاملے میں سود کا معمولی شبہ بھی ہو اسے چھوڑ دیا جائے۔"
              ],
              "english": [
                "Describing many gates of Riba means it can hide under various deceptive labels.",
                "Understanding these categories is vital in today's complex global banking systems.",
                "Piety requires leaving any transaction that carries even a slight suspicion of usury."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور اصلاح",
              "english": "Repentance and Reform"
            },
            "content": {
              "urdu": [
                "سود کھانے والا اللہ کی ناراضگی مول لیتا ہے، لہذا فوری توبہ لازم ہے۔",
                "اگر ماضی میں کوئی ایسا معاملہ کیا ہو تو اسے فوراً ختم کر کے اللہ سے معافی مانگنی چاہیے۔",
                "معاشرے کو سود سے پاک کرنا انفرادی اور اجتماعی فریضہ ہے۔"
              ],
              "english": [
                "Consuming Riba invites Allah's anger, making immediate repentance mandatory.",
                "If such dealings occurred in the past, they must be terminated at once with an apology to Allah.",
                "Purifying society from usury is both an individual and a collective responsibility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے سبق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "کسی کی برائی کر کے اپنی زبان کو آلودہ نہ کریں کیونکہ یہ بھی سود کی ایک قسم ہے۔",
                "دوسرے مسلمانوں کی عزت و آبرو کا ویسے ہی تحفظ کریں جیسے اپنے مال کا کرتے ہیں۔",
                "مثبت گفتگو اور خیر خواہی معاشرے میں برکت لاتی ہے۔"
              ],
              "english": [
                "Do not pollute your tongue with the faults of others, as this is a form of usury.",
                "Protect the honor of other Muslims just as you protect your own wealth.",
                "Positive speech and sincere goodwill bring blessings to the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزقِ حلال کی تلاش",
              "english": "Pursuit of Halal Provision"
            },
            "content": {
              "urdu": [
                "تھوڑا حلال مال سود والے کثیر مال سے کہیں بہتر اور بابرکت ہے۔",
                "اپنے کاروبار اور ملازمت میں سودی معاملات سے ہر ممکن بچنے کی کوشش کریں۔",
                "اللہ تعالیٰ متقی تاجروں کو وہاں سے رزق دیتا ہے جہاں سے وہ گمان بھی نہیں کرتے۔"
              ],
              "english": [
                "A small amount of Halal is better and more blessed than abundant usurious wealth.",
                "Strive to avoid interest-based dealings in your business and employment.",
                "Allah provides for the God-fearing merchants from sources they cannot imagine."
              ]
            }
          }
        ]
      }
    }
  ]
}