{
  "hadithId": 52,
  "hadithNo": 24,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 24 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب ما يقال بعد الوضوء",
    "babId": 4
  },

  "takhreej": {
    "arabic": "صحيح.  رواه مسلم (234)  عن عقبة بن عامر قال: كانت علينا رعاية الإبل، فجاءت نوبتي، فروحتها بعشي، فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس، فأدركت من قوله: \"ما من مسلم يتوضأ فيحسن وضوءه، ثم يقوم فيصلى ركعتين، مقبل عليهما بقلبه ووجهه، إلا وجبت له الجنة\" قال: فقلت: ما أجود هذه، فإذا قاتل بين يدي يقول: التي قبلها أجود، فنظرت فإذا عمر.  قال: إني قد رأيتك جئت آنفا، قال: فذكره.  وزاد: \"الثمانية، يدخل من أيها شاء\".  سنن الترمذي (55) ، وهذه الزيادة التي عند الترمذي لا تصح، كما هو مبين \"بالأصل\"",
    "urdu": "صحیح (درجہ)۔ اسے مسلم (234) نے روایت کیا ہے۔ اور (عقبة بن عامر رضی اللہ عنہ کی) ایک دوسری روایت میں ہے کہ جنت کے آٹھوں دروازے کھول دیے جاتے ہیں، وہ جس سے چاہے داخل ہو جائے۔ ترمذی (55) کی زیادتی ('اَللَّهُمَّ اِجْعَلْنِي...') صحیح نہیں ہے، جیسا کہ محققین نے بیان کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Muslim (234). The addition found in At-Tirmidhi ('Allāhumma ijʿalnī...') is not authentic (Da'īf), as clarified by scholars. The main text and the mention of the eight gates (in a related narration) are Sahih."
  },
  "importantWords": [
    {
      "arabic": "فَيُسْبِغُ اَلْوُضُوءَ",
      "english": "Performs Wudu perfectly",
      "urdu": "خوب اچھی طرح وضو کرے"
    },
    {
      "arabic": "يَقُولُ",
      "english": "Says/recites",
      "urdu": "یوں کہے"
    },
    {
      "arabic": "أَشْهَدُ",
      "english": "I bear witness",
      "urdu": "میں شہادت دیتا ہوں"
    },
    {
      "arabic": "فُتِحَتْ لَهُ أَبْوَابُ اَلْجَنَّةِ",
      "english": "The gates of Paradise are opened for him",
      "urdu": "اس کیلئے جنت کے دروازے کھول دیئے جاتے ہیں"
    },
    {
      "arabic": "اَلتَّوَّابِينَ",
      "english": "Those who repent (Tawwābīn)",
      "urdu": "توبہ کرنے والوں"
    },
    {
      "arabic": "اَلْمُتَطَهِّرِينَ",
      "english": "Those who purify themselves (Mutaṭahhirīn)",
      "urdu": "پاک رہنے والوں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث وضو کے اختتام پر کلمۂ شہادت (پہلا ذکر) پڑھنے کی عظیم فضیلت بیان کرتی ہے کہ جو شخص وضو کو کامل کرنے کے بعد یہ کلمات کہتا ہے، اس کے لیے جنت کے آٹھوں دروازے کھول دیے جاتے ہیں۔",
    "english": "This Hadith highlights the immense reward for reciting the declaration of faith (First Dhikr) after perfecting Wudu: the doors of Paradise are opened for the believer, allowing entry through any door they wish."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الطهارة، رقم 234",
      "english": "Sahih Muslim, The Book of Purification, Hadith 234"
    },
    {
      "arabic": "جامع الترمذي، أبواب الطهارة، رقم 55",
      "english": "Jami' At-Tirmidhi, The Book of Purification, Hadith 55"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عُمَرُ بْنُ اَلْخَطَّابِ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Umar ibn Al-Khattāb (May Allah be pleased with him)"
      },
      "slug": "umar-ibn-al-khattab"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-30-dua-after-wudu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وضو کی تکمیل اور کلمۂ شہادت",
        "english": "Perfection of Wudu and the Declaration of Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اِسباغ الوضوء اور اس کا تقاضا",
              "english": "Isbāgh al-Wudu and its Requirement"
            },
            "content": {
              "urdu": [
                "حدیث کا آغاز **\"فَيُسْبِغُ اَلْوُضُوءَ\"** (وضو کو خوب اچھی طرح پورا کرے) سے ہوتا ہے، جو اس بات کی شرط ہے کہ یہ فضیلت صرف اسی کو حاصل ہو گی جو وضو کو مکمل سنتوں کے ساتھ ادا کرے۔",
                "وضو کا مکمل ہونا نہ صرف ظاہری اعضاء کی صفائی ہے بلکہ پانی کو تمام اعضاء کے ہر حصے تک پہنچانا اور سنتوں کی رعایت کرنا بھی شامل ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام میں معمولی سے معمولی عمل میں بھی **احسان (کمال)** مطلوب ہے، تاکہ اس کا ثواب کامل ہو۔"
              ],
              "english": [
                "The Hadith begins with the condition **'fayusbighu al-wuḍū’'** (performs Wudu perfectly), making it a prerequisite that this immense reward is granted only to one who completes Wudu according to the Sunnah.",
                "Perfect Wudu involves not only washing the obligatory limbs but also ensuring water reaches every part of them, along with observing the recommended Sunnahs.",
                "This instruction proves that **perfection (Iḥsān)** is sought in every Islamic act, no matter how small, to ensure the reward is complete."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو کے بعد کا پہلا ذکر",
              "english": "The First Dhikr After Wudu"
            },
            "content": {
              "urdu": [
                "وضو کے فوراً بعد **کلمۂ شہادت** پڑھنا سنتِ مؤکدہ ہے، جو طہارتِ جسم کو طہارتِ روح اور **عقیدۂ توحید** سے جوڑ دیتا ہے۔",
                "اس ذکر کا مقصد یہ ہے کہ جب جسم نجاست اور گناہوں سے پاک ہو جائے تو زبان سے توحید کا اقرار کیا جائے اور ایمان کی تجدید ہو۔",
                "کلمۂ شہادت تمام اعمالِ خیر کی کنجی ہے، اور اسے وضو کے بعد پڑھنا اس عمل کے اجر کو آسمانوں تک پہنچا دیتا ہے۔"
              ],
              "english": [
                "Reciting the **Declaration of Faith (Shahādah)** immediately after Wudu is an emphasized Sunnah, linking the physical purification with the spiritual purification and **belief in Tawḥīd**.",
                "The purpose of this Dhikr is to follow the physical cleansing with a verbal affirmation of monotheism and a renewal of faith.",
                "The Shahādah is the key to all good deeds, and reciting it at this point elevates the spiritual reward of the ablution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عظیم ترین اجر: جنت کے دروازے",
        "english": "The Immense Reward: Gates of Paradise "
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنت کے آٹھ دروازے",
              "english": "The Eight Gates of Paradise"
            },
            "content": {
              "urdu": [
                "اس عمل کی فضیلت یہ ہے کہ ایسا کرنے والے کے لیے جنت کے **آٹھوں دروازے کھول دیے** جاتے ہیں، اور اسے اختیار ہوتا ہے کہ وہ جس دروازے سے چاہے داخل ہو جائے۔",
                "جنت کے آٹھ دروازے مختلف نیک اعمال (جیسے نماز، روزہ، صدقہ، جہاد وغیرہ) سے وابستہ ہیں، اور یہ عمل ہر دروازے سے داخلے کی اہلیت پیدا کرتا ہے۔",
                "یہ اس بات کی دلیل ہے کہ وضو کو سنت کے مطابق مکمل کرنا اور اس کے بعد ایمان کی تجدید کرنا اللہ کے نزدیک بہت بڑا مقام رکھتا ہے۔"
              ],
              "english": [
                "The virtue of this act is that the **eight gates of Paradise are opened** for the one who performs it, granting him the choice to enter through whichever door he wills.",
                "The eight gates are associated with different good deeds (like prayer, fasting, charity, etc.), and this act qualifies one for entry through all of them.",
                "This demonstrates that perfecting Wudu and renewing one's faith afterwards holds a very high status with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "عقیدہ اور عمل کا تعلق",
              "english": "Connection Between Belief and Action"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر عقیدہ (توحید کا اقرار) کو جسمانی عمل (وضو) سے جوڑتی ہے، اور بتاتی ہے کہ ایک کے بغیر دوسرا کامل نہیں ہو سکتا۔",
                "وضو کے ذریعے جسم کو پاک کیا جاتا ہے، اور کلمۂ شہادت کے ذریعے دل اور روح کو پاک کیا جاتا ہے، جو اللہ کے حضور حاضر ہونے کی بہترین تیاری ہے۔",
                "یہ اس بات کی تعلیم ہے کہ مسلمان کی زندگی میں ہر عمل روحانی نیت اور توحید کے عقیدہ سے جڑا ہونا چاہیے۔"
              ],
              "english": [
                "This Hadith clearly links belief (the affirmation of Tawḥīd) with the physical act (Wudu), showing that one cannot be perfected without the other.",
                "The body is purified through Wudu, and the heart and soul are purified through the Shahādah, making it the best preparation to stand before Allah.",
                "This teaches that every action in a Muslim's life must be connected to a spiritual intention and the creed of monotheism."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ترمذی کی اضافی دعا کا حکم",
        "english": "The Ruling on Tirmidhi's Additional Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زیادہ دعا کا حکم",
              "english": "Ruling on the Added Supplication"
            },
            "content": {
              "urdu": [
                "امام ترمذی کی روایت میں اضافہ ہے: 'اَللَّهُمَّ اِجْعَلْنِي مِنْ اَلتَّوَّابِينَ...' (اے اللہ! مجھے توبہ کرنے اور پاک رہنے والوں میں سے کر دے)، لیکن محدثین نے اس زیادت کو **ضعیف** قرار دیا ہے۔",
                "تاہم، یہ دعا قرآن کی تعلیمات (سورۃ البقرہ 2:222) کے عین مطابق ہے، جہاں اللہ کو توبہ کرنے والے اور پاک رہنے والے دونوں پسند ہیں۔",
                "اگرچہ یہ الفاظ نبی ﷺ سے ثابت نہیں، لیکن چونکہ یہ خیر و بھلائی کی دعا ہے، اس لیے اسے دعا کے طور پر پڑھنا جائز ہے، مگر یہ نہ مانا جائے کہ یہ نبی ﷺ کی سنت ہے۔"
              ],
              "english": [
                "The addition in Imām At-Tirmidhi's narration, 'Allāhumma ijʿalnī min at-tawwābīna...', is deemed **weak (Da'īf)** by Hadith scholars.",
                "However, this supplication aligns perfectly with Qur'anic teachings (Surah Al-Baqarah 2:222), where Allah loves those who constantly repent and purify themselves.",
                "While these specific words are not confirmed from the Prophet (ﷺ) after Wudu, reciting it as a general prayer of goodness is permissible, but it should not be considered the established Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور طہارت",
              "english": "Repentance and Purification"
            },
            "content": {
              "urdu": [
                "اس دعا (اگرچہ ضعیف ہے) میں توبہ کرنے والوں اور پاک رہنے والوں میں شامل ہونے کی درخواست کی گئی ہے، جو مومن کی زندگی کا خلاصہ ہے۔",
                "وضو کا مقصد گناہوں سے توبہ کرنا (روحانی طہارت) اور پاکی حاصل کرنا (جسمانی طہارت) دونوں ہے، اس لیے یہ دعا موضوع سے مطابقت رکھتی ہے۔",
                "مسلمان کو چاہیے کہ وہ ہمیشہ وضو کے بعد سنت کے مطابق کلمۂ شہادت پر اکتفا کرے اور اضافی دعائیں انفرادی طور پر کر سکتا ہے۔"
              ],
              "english": [
                "This supplication (though weak in chain) asks to be among those who repent and those who purify themselves, summarizing the essence of a believer's life.",
                "The purpose of Wudu is both repentance for sins (spiritual purity) and achieving cleanliness (physical purity), making this supplication relevant to the context.",
                "A Muslim should primarily stick to the Shahādah as per the authentic Sunnah after Wudu, and may offer additional prayers individually."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اہمیت",
        "english": "Importance in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی پیروی کا نتیجہ",
              "english": "Outcome of Following the Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک مسلمان کو وضو جیسے روزمرہ کے چھوٹے سے عمل کو بھی پوری توجہ اور اخلاص سے کرنے کی ترغیب دیتی ہے۔",
                "وضو کو صرف نماز کے لیے ایک شرط کے طور پر نہیں، بلکہ جنت کے دروازے کھولنے والے ایک **آسان عمل** کے طور پر سمجھنا چاہیے۔",
                "یہ اجر اس بات کی دلیل ہے کہ اللہ تعالیٰ اپنے بندوں کو معمولی سے عمل پر بھی کتنا بڑا انعام عطا فرماتے ہیں۔"
              ],
              "english": [
                "This Hadith encourages a Muslim to perform even a small, daily act like Wudu with full attention and sincerity.",
                "Wudu should be understood not just as a prerequisite for prayer, but as an **easy act** that opens the gates of Paradise.",
                "This great reward proves how much Allah grants His servants for even a simple act performed perfectly."
              ]
            }
          },
          {
            "title": {
              "urdu": "حضرت عمرؓ کا مقام",
              "english": "The Status of Umar (RA)"
            },
            "content": {
              "urdu": [
                "یہ روایت سیدنا عمر بن خطاب رضی اللہ عنہ سے مروی ہے، جو نبی ﷺ کے قریبی اور عظیم ترین صحابہ میں سے ہیں، ان کی روایت کردہ فضائلِ اعمال بہت معتبر ہیں۔",
                "آپ کا وضو کے بعد اس دعا کو سننا اور اسے آگے پہنچانا اس عمل کی فضیلت کو اور بھی زیادہ تقویت دیتا ہے۔",
                "اس حدیث پر عمل کرنے سے مسلمان کو جنت کے آٹھ دروازوں میں سے کسی ایک سے داخلے کی ضمانت ملتی ہے، جو سب سے بڑی کامیابی ہے۔"
              ],
              "english": [
                "This narration is conveyed by Sayyiduna Umar ibn Al-Khaṭṭāb (RA), one of the Prophet's closest and greatest companions, lending immense weight to the virtue mentioned.",
                "His propagation of this Dhikr after witnessing it strengthens its virtue and authenticity for the Ummah.",
                "Acting upon this Hadith guarantees a Muslim entry through any of the eight gates of Paradise, which is the ultimate success."
              ]
            }
          }
        ]
      }
    }
  ]
}
