{
  "hadithId": 475,
  "hadithNo": 51,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1306",
      "https://sunnah.com/muslim:936"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1306) في كتاب الجنائز، ومسلم (936). والحديث جزء من بيعة النساء للنبي صلى الله عليه وسلم.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (1306) و مسلم (936) میں مروی ہے۔ یہ دراصل خواتین کی اس بیعت کا حصہ ہے جو نبی ﷺ نے ان سے لی تھی جس میں دیگر برائیوں کے ساتھ نوحہ سے بھی روکا گیا تھا۔",
    "english": "Authentic. Reported by Al-Bukhari (1306) and Muslim (936). This Hadith is part of the broader pledge (Bay'ah) taken by women to the Prophet (ﷺ), which included abstaining from wailing."
  },
  "importantWords": [
    {
      "arabic": "أَخَذَ عَلَيْنَا",
      "english": "Took a pledge from us",
      "urdu": "ہم سے عہد لیا"
    },
    {
      "arabic": "لَا نَنُوحَ",
      "english": "We would not wail",
      "urdu": "ہم نوحہ نہیں کریں گی"
    },
    {
      "arabic": "الْبَيْعَةِ",
      "english": "Pledge of Allegiance",
      "urdu": "بیعت"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "متفقہ"
    },
    {
      "arabic": "النِّيَاحَةُ",
      "english": "Wailing",
      "urdu": "نوحہ کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں میت پر بین کرنے، چیخنے چلانے اور جاہلی طریقے سے نوحہ کرنے کی سختی سے ممانعت کی گئی ہے اور اسے بیعتِ اسلام کا حصہ قرار دیا گیا ہے۔",
    "english": "This Hadith strictly prohibits wailing and mourning in the pre-Islamic style, establishing it as a key condition in the Islamic pledge of allegiance."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1306)",
      "english": "Sahih al-Bukhari (1306)"
    },
    {
      "arabic": "صحيح مسلم (936)",
      "english": "Sahih Muslim (936)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم عطية الأنصارية",
        "english": "Umm 'Atiyyah al-Ansariyyah"
      },
      "slug": "umm-atiyyah-al-ansariyyah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R2_K-E-K98A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نوحہ کی تعریف اور ممانعت",
        "english": "Definition and Prohibition of Wailing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نوحہ کیا ہے؟",
              "english": "What is Wailing?"
            },
            "content": {
              "urdu": [
                "نوحہ سے مراد آواز کے ساتھ میت کی خوبیاں بیان کر کے رونا اور چیخنا ہے۔",
                "اس میں عموماً اللہ کی تقدیر پر گلہ اور کپڑے پھاڑنا شامل ہوتا ہے۔",
                "اسلام نے غم کے اظہار کے اس جاہلانہ طریقے کو سختی سے مسترد کیا ہے۔"
              ],
              "english": [
                "Wailing refers to crying loudly while listing the deceased's virtues.",
                "It often involves complaining against destiny and tearing clothes.",
                "Islam strictly rejects this pre-Islamic (Jahiliyyah) way of mourning."
              ]
            }
          },
          {
            "title": {
              "urdu": "رونے اور نوحہ میں فرق",
              "english": "Crying vs. Wailing"
            },
            "content": {
              "urdu": [
                "آنکھوں سے آنسو بہنا اور دل کا غمگین ہونا فطری ہے اور جائز ہے۔",
                "نبی ﷺ نے اپنے بیٹے ابراہیم کی وفات پر خود آنسو بہائے تھے۔",
                "حرام وہ نوحہ ہے جس میں زبان سے بے صبری کے کلمات نکالے جائیں۔"
              ],
              "english": [
                "Shedding tears and feeling sorrow in the heart is natural and allowed.",
                "The Prophet (ﷺ) shed tears at the death of his son, Ibrahim.",
                "Prohibited wailing involves uttering words of impatience and discontent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عہد اور بیعت کی اہمیت",
        "english": "Significance of the Pledge"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیعت کا حصہ",
              "english": "Part of the Bay'ah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے خواتین سے بیعت لیتے وقت نوحہ نہ کرنے کا خصوصی عہد لیا۔",
                "اس سے معلوم ہوتا ہے کہ نوحہ کرنا ایمان اور بیعت کے منافی عمل ہے۔",
                "دین میں ثابت قدمی کے لیے جاہلی رسموں کو چھوڑنا لازمی شرط ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) took a specific pledge from women to avoid wailing.",
                "This shows that wailing is contrary to the essence of faith and allegiance.",
                "Abandoning pagan customs is a prerequisite for steadfastness in religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کی اصلاح",
              "english": "Reforming Women's Customs"
            },
            "content": {
              "urdu": [
                "خواتین میں نوحہ کرنے کا رواج زیادہ تھا اس لیے انہیں خاص طور پر روکا گیا۔",
                "اسلام نے خواتین کو صبر اور وقار کے ساتھ صدمہ برداشت کرنے کی تعلیم دی۔",
                "میت کے گھر میں آہ و بکا کے بجائے تسبیح اور دعا کا ماحول ہونا چاہیے۔"
              ],
              "english": [
                "Wailing was more common among women, so they were specifically warned.",
                "Islam teaches women to endure trauma with patience and dignity.",
                "The home of the deceased should have an atmosphere of prayer, not wailing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نوحہ کے نقصانات",
        "english": "Harms of Wailing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تقدیر پر عدمِ رضا",
              "english": "Discontent with Destiny"
            },
            "content": {
              "urdu": [
                "نوحہ کرنا اللہ کے فیصلے پر ناراضگی کا اظہار ہے جو کہ گناہ ہے۔",
                "یہ عمل انسان کے اجر کو ضائع کر دیتا ہے جو اسے صبر پر ملنا تھا۔",
                "مومن وہی ہے جو ہر حال میں اللہ کی رضا پر راضی رہے۔"
              ],
              "english": [
                "Wailing expresses anger at Allah's decree, which is a major sin.",
                "This act wastes the spiritual reward promised for displaying patience.",
                "A true believer is one who remains content with Allah's will always."
              ]
            }
          },
          {
            "title": {
              "urdu": "میت کے لیے اذیت",
              "english": "Torment for the Deceased"
            },
            "content": {
              "urdu": [
                "بعض احادیث کے مطابق میت کو اس کے گھر والوں کے نوحہ سے اذیت ہوتی ہے۔",
                "ہمارا غلط طریقہء غم میت کی روح کے لیے بوجھ بن سکتا ہے۔",
                "میت کی بہترین خدمت اس کے لیے استغفار کرنا ہے نہ کہ رونا پیٹنا۔"
              ],
              "english": [
                "Some Hadiths state the deceased is pained by the wailing of their family.",
                "Our wrong way of mourning can become a burden for the departed soul.",
                "The best service to the dead is seeking forgiveness, not loud mourning."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و تربیتی سبق",
        "english": "Moral and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صبرِ جمیل",
              "english": "Beautiful Patience"
            },
            "content": {
              "urdu": [
                "مصیبت کے پہلے جھٹکے پر صبر کرنا ہی حقیقی صبر ہے۔",
                "خاموشی کے ساتھ صدمہ سہنا انسان کے ایمان کی پختگی کو ظاہر کرتا ہے۔",
                "اللہ صابرین کے ساتھ ہے اور انہیں بے حساب اجر عطا فرماتا ہے۔"
              ],
              "english": [
                "True patience is that which is displayed at the first stroke of calamity.",
                "Enduring sorrow in silence reflects the maturity of a person's faith.",
                "Allah is with the patient and grants them rewards without measure."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی اتباع",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے تمام رسوم و رواج کو سنتِ نبوی کے تابع کرنا چاہیے۔",
                "نبی ﷺ کی ہر ہدایت میں ہمارے لیے دنیا و آخرت کی خیر ہے۔",
                "جاہلی عادات سے دوری ہی اسلام کی حقیقی روح کو زندہ کرتی ہے۔"
              ],
              "english": [
                "We must subject all our customs and traditions to the Prophetic Sunnah.",
                "Every guidance of the Prophet (ﷺ) contains goodness for both worlds.",
                "Distancing from pagan habits revives the true spirit of Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}