{
  "hadithId": 987,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/41"],
    "kitabId": 8,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 78
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أحمد (6707)، وأبو داود (2276)، والحاكم (2830)، من طريق عمرو بن شعيب، عن أبيه، عن جده. وصححه الحاكم ووافقه الذهبي.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام احمد، ابو داؤد اور حاکم نے عمرو بن شعیب کے واسطے سے روایت کیا ہے۔ امام حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan (good). Reported by Ahmad (6707), Abu Dawud (2276), and Al-Hakim (2830), through the chain of 'Amr bin Shu'aib from his father from his grandfather."
  },
  "importantWords": [
    {
      "arabic": "وِعَاءً",
      "english": "Vessel / Container",
      "urdu": "برتن"
    },
    {
      "arabic": "سِقَاءً",
      "english": "Water-skin / Drink",
      "urdu": "مشکیزہ / پلانے کا ذریعہ"
    },
    {
      "arabic": "حِوَاءً",
      "english": "Shelter / Protection",
      "urdu": "ٹھکانہ / جائے پناہ"
    },
    {
      "arabic": "يَنْتَزِعَهُ",
      "english": "Snatch him / Take away",
      "urdu": "چھین لینا"
    },
    {
      "arabic": "أَحَقُّ",
      "english": "More deserving / Better right",
      "urdu": "زیادہ حقدار"
    },
    {
      "arabic": "تَنْكِحِي",
      "english": "You marry",
      "urdu": "تم نکاح کرلو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں طلاق کے بعد چھوٹے بچے کی پرورش (حضانت) کا حق ماں کو دیا گیا ہے، جب تک وہ دوسرا نکاح نہ کر لے۔",
    "english": "This Hadith establishes the mother's primary right to custody (Hadanah) of her child after divorce, conditional upon her remaining unmarried."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2276)",
      "english": "Reported by Abu Dawud (2276)"
    },
    {
      "arabic": "رواه أحمد (6707)",
      "english": "Reported by Ahmad (6707)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-As"
      },
      "slug": "abdullah-bin-amr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_I_OqXb8vM",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ماں کا حقِ حضانت",
        "english": "Mother's Right of Custody"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری اور شرعی حق",
              "english": "Natural and Legal Right"
            },
            "content": {
              "urdu": [
                "بچے کی پرورش کے لیے ماں سب سے زیادہ موزوں اور رحمدل ہوتی ہے۔",
                "شریعت نے بچے کے مفاد کو باپ کے مطالبے پر مقدم رکھا ہے۔",
                "ماں کی قربانیوں (حمل، رضاعت) کی وجہ سے اسے اولیت حاصل ہے۔"
              ],
              "english": [
                "The mother is the most suitable and merciful for raising a child.",
                "Shariah prioritizes the child's welfare over the father's demand.",
                "The mother's sacrifices in pregnancy and nursing give her priority."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسرے نکاح کی شرط",
              "english": "Condition of Remarriage"
            },
            "content": {
              "urdu": [
                "اگر ماں دوسرا نکاح کرلے تو حضانت کا حق منتقل ہو سکتا ہے۔",
                "دوسرا شوہر عموماً غیر بچے کے لیے وہ شفقت نہیں رکھتا۔",
                "بچے کی بہتر تربیت اور نفسیاتی سکون اس شرط کا بنیادی مقصد ہے۔"
              ],
              "english": [
                "If the mother remarry, the right of custody may be transferred.",
                "A stepfather often lacks the same affection for a non-biological child.",
                "The child's upbringing and psychological peace is the goal of this rule."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بچے کی فلاح و بہبود",
        "english": "Child Welfare"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے کی ضروریات",
              "english": "Child's Basic Needs"
            },
            "content": {
              "urdu": [
                "چھوٹا بچہ اپنی جسمانی ضروریات کے لیے ماں کا محتاج ہوتا ہے۔",
                "اسلام نے والدین کے جھگڑے میں بچے کو تنہا نہیں چھوڑا۔",
                "بچے کی صحت اور تعلیم کا تحفظ اسلام کی ترجیح ہے۔"
              ],
              "english": [
                "A young child is dependent on the mother for physical needs.",
                "Islam does not leave the child vulnerable during parental disputes.",
                "Protecting the child's health and education is an Islamic priority."
              ]
            }
          },
          {
            "title": {
              "urdu": "باپ کی ذمہ داری",
              "english": "Father's Responsibility"
            },
            "content": {
              "urdu": [
                "بچہ ماں کے پاس ہونے کے باوجود خرچہ باپ کے ذمے ہوتا ہے۔",
                "باپ کو بچے سے ملنے اور اس کی نگرانی کا پورا حق ہے۔",
                "مالی ذمہ داری اور حقِ ولایت میں باپ کا کردار اہم ہے۔"
              ],
              "english": [
                "Even if the child is with the mother, the father bears the costs.",
                "The father has the right to visit and monitor the child's welfare.",
                "The father's role is crucial in financial support and guardianship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Jurisprudential Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمر کی حد",
              "english": "Age Limit"
            },
            "content": {
              "urdu": [
                "حضانت کا حق عموماً شعور کی عمر تک ماں کے پاس رہتا ہے۔",
                "لڑکوں اور لڑکیوں کے لیے فقہاء نے مختلف عمریں متعین کی ہیں۔",
                "بچے کے سمجھدار ہونے پر اس کی خواہش کا بھی اعتبار کیا جاتا ہے۔"
              ],
              "english": [
                "Custody usually remains with the mother until the age of discernment.",
                "Jurists have specified different ages for boys and girls.",
                "The child's preference is considered once they reach maturity."
              ]
            }
          },
          {
            "title": {
              "urdu": "حق کا تبادلہ",
              "english": "Transfer of Rights"
            },
            "content": {
              "urdu": [
                "اگر ماں نکاح کرلے تو یہ حق نانی یا دادی کی طرف جاتا ہے۔",
                "ہر فیصلے میں بچے کا بہترین مفاد ہی واحد معیار ہے۔",
                "عدالت حالات کی نزاکت دیکھ کر فیصلہ کرنے کی مجاز ہے۔"
              ],
              "english": [
                "If the mother remarry, the right moves to maternal/paternal grandmothers.",
                "The best interest of the child is the sole criterion in every decision.",
                "The court is authorized to decide based on specific circumstances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی نظامِ عدل",
        "english": "Islamic Justice System"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مظلوم کی داد رسی",
              "english": "Redressing Grievances"
            },
            "content": {
              "urdu": [
                "خاتون نے رسول اللہ ﷺ سے اپنے حق کے لیے رجوع کیا۔",
                "اسلام کمزور طبقوں کو آواز اٹھانے کا مکمل حق دیتا ہے۔",
                "نبوی فیصلہ فوری، واضح اور عدل پر مبنی ہوتا تھا۔"
              ],
              "english": [
                "The woman turned to the Prophet ﷺ to seek her legal rights.",
                "Islam grants the vulnerable the full right to voice concerns.",
                "Prophetic rulings were immediate, clear, and based on justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی استحکام",
              "english": "Family Stability"
            },
            "content": {
              "urdu": [
                "اسلام طلاق کے بعد بھی بچوں کے مستقبل کو محفوظ بناتا ہے۔",
                "والدین کو آپسی دشمنی میں بچوں کو استعمال نہیں کرنا چاہیے۔",
                "یہ اصول معاشرتی امن اور بچوں کی ذہنی صحت کے ضامن ہیں۔"
              ],
              "english": [
                "Islam secures the future of children even after divorce.",
                "Parents must not use children as tools in their personal enmity.",
                "These principles ensure social peace and children's mental health."
              ]
            }
          }
        ]
      }
    }
  ]
}