{
  "hadithId": 1227,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2563", "https://sunnah.com/muslim:1504"],
    "kitabId": 15,
    "inKitabBab": 1,
    "arabicBook": "كتاب العتق",
    "babId": 100
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2563) ومسلم (1504) مطولا في قصة بريرة رضي الله عنها.",
    "urdu": "یہ حدیث صحیح اور متفق علیہ ہے۔ اسے امام بخاری اور امام مسلم نے سیدہ بریرہ رضی اللہ عنہا کے واقعے کے ضمن میں مفصل روایت کیا ہے۔",
    "english": "Sahih. Muttafaqun 'Alayh. Reported by Al-Bukhari (2563) and Muslim (1504) as part of the lengthy narration regarding Barirah (RA)."
  },
  "importantWords": [
    {
      "arabic": "إِنَّمَا",
      "english": "Only/Surely",
      "urdu": "صرف / یقیناً"
    },
    {
      "arabic": "الْوَلَاءُ",
      "english": "Right of Inheritance",
      "urdu": "ولاء (وراثت کا حق)"
    },
    {
      "arabic": "لِمَنْ",
      "english": "For the one who",
      "urdu": "اس کے لیے جس نے"
    },
    {
      "arabic": "أَعْتَقَ",
      "english": "Emancipated",
      "urdu": "آزاد کیا"
    },
    {
      "arabic": "الْمُعْتِقُ",
      "english": "The Emancipator",
      "urdu": "آزاد کرنے والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا خلاصہ یہ ہے کہ جب کوئی شخص کسی غلام کو آزاد کرتا ہے، تو وہ آزاد کردہ غلام اگر لاوارث مر جائے تو اس کی وراثت کا حق صرف آزاد کرنے والے کو ملتا ہے۔",
    "english": "The summary of this Hadith is that the legal right of inheritance (Wala') from an emancipated slave belongs exclusively to the person who set them free."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2563)",
      "english": "Reported by Al-Bukhari (2563)"
    },
    {
      "arabic": "رواه مسلم (1504)",
      "english": "Reported by Muslim (1504)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ولاء کا تصور اور شرعی حیثیت",
        "english": "Concept and Legal Status of Wala'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولاء کا لغوی و اصطلاحی مفہوم",
              "english": "Literal and Technical Meaning of Wala'"
            },
            "content": {
              "urdu": [
                "ولاء کا مطلب وہ تعلق ہے جو غلام کو آزاد کرنے سے پیدا ہوتا ہے۔",
                "یہ تعلق آزاد کرنے والے اور آزاد شدہ غلام کے درمیان رشتہ داری جیسا بن جاتا ہے۔",
                "شریعت میں اس رشتے کو 'ولاء العتاقہ' کہا جاتا ہے جو وراثت کا سبب بنتا ہے۔"
              ],
              "english": [
                "Wala' refers to the legal relationship established through emancipation.",
                "This bond functions similarly to kinship between the emancipator and the freed slave.",
                "In Sharia, this is called 'Wala' al-'Ataqah,' which serves as a basis for inheritance."
              ]
            }
          },
          {
            "title": {
              "urdu": "وراثت کا حقدار کون؟",
              "english": "Who is the Rightful Heir?"
            },
            "content": {
              "urdu": [
                "اگر آزاد کردہ غلام مر جائے اور اس کا کوئی نسبی وارث نہ ہو تو مال مالک کو ملے گا۔",
                "نبی ﷺ نے واضح فرمایا کہ یہ حق صرف اسی کا ہے جس نے آزادی کا احسان کیا۔",
                "کوئی دوسرا شخص ولاء کا دعویٰ نہیں کر سکتا اگر اس نے آزاد نہ کیا ہو۔"
              ],
              "english": [
                "If a freed slave dies without blood heirs, the estate goes to the emancipator.",
                "The Prophet (ﷺ) clarified that this right belongs only to the one who bestowed freedom.",
                "No other person can claim Wala' if they were not the one who performed the manumission."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قصہ بریرہ رضی اللہ عنہا اور اس کا پس منظر",
        "english": "The Story of Barirah (RA) and its Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلط شرائط کی ممانعت",
              "english": "Prohibition of Invalid Conditions"
            },
            "content": {
              "urdu": [
                "بریرہ رضی اللہ عنہا کے مالکان نے آزادی کے بدلے ولاء اپنے پاس رکھنے کی شرط لگائی۔",
                "نبی ﷺ نے ایسی تمام شرائط کو باطل قرار دے دیا جو اللہ کی کتاب کے خلاف ہوں۔",
                "آپ ﷺ نے منبر پر کھڑے ہو کر اس ضابطے کا اعلان فرمایا تاکہ سب کو علم ہو جائے۔"
              ],
              "english": [
                "Barirah's owners stipulated a condition to keep the Wala' for themselves despite the sale.",
                "The Prophet (ﷺ) declared all conditions invalid if they contradict Allah's Book.",
                "He announced this principle from the pulpit to ensure widespread legal awareness."
              ]
            }
          },
          {
            "title": {
              "urdu": "احسان کا بدلہ احسان",
              "english": "Reward for Kindness"
            },
            "content": {
              "urdu": [
                "آزادی دلانا ایک بہت بڑا احسان ہے جس کا اجر دنیا میں ولاء کی صورت میں ہے۔",
                "جو شخص اپنی ملکیت ختم کرتا ہے، اللہ اسے وراثت کا ایک نیا حق عطا فرماتا ہے۔",
                "یہ قانون غلامی کے خاتمے کی حوصلہ افزائی کے لیے ایک سماجی محرک بھی تھا۔"
              ],
              "english": [
                "Providing freedom is a massive favor, rewarded in this world via the right of Wala'.",
                "By relinquishing ownership, Allah grants the emancipator a new right of inheritance.",
                "This law served as a social incentive to encourage the ending of slavery."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ولاء کی فروخت اور منتقلی",
        "english": "Sale and Transfer of Wala'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولاء کی خرید و فروخت کا حکم",
              "english": "Ruling on the Sale of Wala'"
            },
            "content": {
              "urdu": [
                "ولاء ایک نسبی تعلق کی طرح ہے جسے بیچا یا خریدا نہیں جا سکتا۔",
                "احادیث میں ولاء کو بیچنے اور اسے کسی کو ہبہ کرنے سے سختی سے روکا گیا ہے۔",
                "یہ تعلق جب ایک بار قائم ہو جائے تو اسے ختم کرنا یا بدلنا ناممکن ہے۔"
              ],
              "english": [
                "Wala' is treated like a lineage bond and cannot be bought or sold.",
                "Hadiths strictly forbid the selling or gifting of the right of Wala'.",
                "Once this relationship is established, it is impossible to terminate or alter it."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسبی تعلق سے تشبیہ",
              "english": "Analogy to Lineage"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا 'الولاء لحمة کلحمة النسب' (ولاء نسب کی طرح ایک گوشت کا ٹکڑا ہے)۔",
                "جس طرح کوئی اپنا باپ نہیں بدل سکتا، ویسے ہی ولاء کا حقدار نہیں بدلا جا سکتا۔",
                "یہ اسلامی وراثت کے نظام میں ایک مضبوط اور مستقل ستون ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said, 'Wala' is a bond like the bond of lineage.'",
                "Just as one cannot change their biological father, the holder of Wala' cannot change.",
                "It remains a strong and permanent pillar within the Islamic inheritance system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق اور اسباق",
        "english": "Practical Application and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہدات میں شرعی حدود",
              "english": "Legal Limits in Contracts"
            },
            "content": {
              "urdu": [
                "کسی بھی لین دین میں ایسی شرط نہیں لگائی جا سکتی جو قرآن و سنت کے خلاف ہو۔",
                "اگر فریقین راضی بھی ہوں، تب بھی غیر شرعی شرط باطل ہی رہے گی۔",
                "مسلمانوں کو اپنے معاہدوں میں اللہ کی حدود کا خیال رکھنا چاہیے۔"
              ],
              "english": [
                "No condition can be placed in any transaction that contradicts the Quran and Sunnah.",
                "Even if both parties agree, an un-Islamic condition remains legally void.",
                "Muslims must strictly observe the boundaries set by Allah in their contracts."
              ]
            }
          },
          {
            "title": {
              "urdu": "انصاف اور شفافیت",
              "english": "Justice and Transparency"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ حق صرف اسی کو ملنا چاہیے جس کا وہ بنتا ہے۔",
                "دھوکہ دہی یا غلط بیانی سے کسی کا شرعی حق نہیں چھینا جا سکتا۔",
                "معاشرے میں عدل کے قیام کے لیے ان ضابطوں پر عمل کرنا لازمی ہے۔"
              ],
              "english": [
                "This Hadith proves that rights must only be granted to the rightful owners.",
                "A legal Sharia right cannot be usurped through fraud or misrepresentation.",
                "Adhering to these regulations is essential for establishing justice in society."
              ]
            }
          }
        ]
      }
    }
  ]
}