{
  "hadithId": 1039,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/10/6"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2152)، ومسلم (1703).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری اور امام مسلم دونوں نے اسے اپنی صحیح میں روایت کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2152) and Muslim (1703)."
  },
  "importantWords": [
    {
      "arabic": "أَمَةُ",
      "english": "Slave-girl",
      "urdu": "لونڈی"
    },
    {
      "arabic": "فَتَبَيَّنَ",
      "english": "Becomes clear / established",
      "urdu": "ظاہر ہو جائے / ثابت ہو جائے"
    },
    {
      "arabic": "فَلْيَجْلِدْهَا",
      "english": "He should lash her",
      "urdu": "پس وہ اسے کوڑے مارے"
    },
    {
      "arabic": "لَا يُثَرِّبْ",
      "english": "Should not reproach / upbraid",
      "urdu": "ملامت نہ کرے"
    },
    {
      "arabic": "فَلْيَبِعْهَا",
      "english": "He should sell her",
      "urdu": "پس وہ اسے بیچ دے"
    },
    {
      "arabic": "حَبْلٍ",
      "english": "Rope",
      "urdu": "رسی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں لونڈی کے زنا کی صورت میں سزا اور مالک کے لیے اخلاقی و انتظامی ہدایات دی گئی ہیں کہ سزا کے بعد ملامت نہ کی جائے اور بار بار جرم پر اسے بیچ دیا جائے۔",
    "english": "This Hadith outlines the penalty for a slave-girl who commits adultery, instructing the owner to apply the limit without verbal abuse and to sell her if the offense persists."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2152)",
      "english": "Reported by Al-Bukhari (2152)"
    },
    {
      "arabic": "رواه مسلم (1703)",
      "english": "Reported by Muslim (1703)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6o9l6Kts",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سزا اور ملامت کی ممانعت",
        "english": "Punishment and Prohibition of Reproach"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حد کے بعد زبان درازی کی ممانعت",
              "english": "Prohibition of Verbal Abuse After Had"
            },
            "content": {
              "urdu": [
                "جب مجرم کو شرعی سزا (حد) مل جائے تو اسے طعنہ دینا یا ذلیل کرنا جائز نہیں ہے۔",
                "اسلام جرم کی سزا دینے کا حکم دیتا ہے، لیکن انسانی عزتِ نفس کی پامالی سے روکتا ہے۔",
                "سزا کا مقصد اصلاح ہے، مجرم کو معاشرے سے مستقل متنفر کرنا مقصود نہیں ہے۔"
              ],
              "english": [
                "Once a criminal receives the Sharia penalty (Had), it is unlawful to taunt or humiliate them.",
                "Islam commands punishing the crime but forbids the violation of human dignity.",
                "The purpose of punishment is reform, not making the offender permanently resentful of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل اور شفقت کا امتزاج",
              "english": "Combination of Justice and Compassion"
            },
            "content": {
              "urdu": [
                "شریعت نے مجرم کے لیے جسمانی سزا مقرر کی ہے تاکہ قانون کی بالادستی قائم رہے۔",
                "ساتھ ہی ملامت سے روک کر یہ سکھایا کہ سزا کے بعد معاملہ اللہ کے سپرد ہے۔",
                "یہ طرزِ عمل مجرم کو توبہ کرنے اور دوبارہ باعزت زندگی گزارنے کا موقع دیتا ہے۔"
              ],
              "english": [
                "Sharia prescribes physical punishment for the offender to maintain the rule of law.",
                "Simultaneously, forbidding reproach teaches that after punishment, the matter is with Allah.",
                "This conduct gives the offender a chance to repent and live an honorable life again."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لونڈی کے لیے زنا کی حد",
        "english": "The Legal Limit for a Slave-girl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آزاد عورت کے مقابلے میں نصف سزا",
              "english": "Half Punishment Compared to Free Women"
            },
            "content": {
              "urdu": [
                "قرآن و سنت کی رو سے لونڈی کے لیے زنا کی سزا آزاد عورت کے مقابلے میں آدھی ہے۔",
                "چونکہ لونڈی کے حالات اور تربیت آزاد عورت جیسی نہیں ہوتی، اس لیے رعایت دی گئی۔",
                "لونڈی پر رجم (سنگسار) کی سزا نہیں ہے، صرف کوڑے مارے جاتے ہیں۔"
              ],
              "english": [
                "According to Quran and Sunnah, the penalty for a slave-girl is half that of a free woman.",
                "Since a slave-girl's circumstances and upbringing differ, this legal concession is granted.",
                "There is no stoning (Rajm) for a slave-girl; only lashes are applied."
              ]
            }
          },
          {
            "title": {
              "urdu": "ثبوت اور گواہی کی ضرورت",
              "english": "Requirement of Proof and Testimony"
            },
            "content": {
              "urdu": [
                "سزا دینے کے لیے جرم کا ثابت ہونا اور نمایاں ہونا شرط قرار دیا گیا ہے۔",
                "محض شک یا تہمت کی بنیاد پر کسی کو سزا دینا اسلامی قانون کے خلاف ہے۔",
                "قانون کی نظر میں ثبوت کی فراہمی سب سے اہم مرحلہ ہے۔"
              ],
              "english": [
                "Establishing proof of the crime is a prerequisite before carrying out the sentence.",
                "Punishing someone based on mere suspicion or slander contradicts Islamic law.",
                "In the eyes of the law, the provision of clear evidence is the most critical stage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انتظامی ہدایت: فروخت کا حکم",
        "english": "Administrative Instruction: Order to Sell"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بار بار جرم اور ماحول کی تبدیلی",
              "english": "Repeated Crimes and Changing Environment"
            },
            "content": {
              "urdu": [
                "اگر لونڈی بار بار جرم کرے تو اسے بیچ دینا اس لیے ہے تاکہ اس کا ماحول بدلے۔",
                "مالک کے لیے ایسی لونڈی کو گھر میں رکھنا اخلاقی بگاڑ کا باعث بن سکتا ہے۔",
                "فروخت کر دینے سے اس کی برائی کی تشہیر رکتی ہے اور اسے نئی زندگی مل سکتی ہے۔"
              ],
              "english": [
                "Selling the slave-girl after repeated crimes aims to change her environment.",
                "Keeping such a slave-girl may cause moral degradation within the owner's household.",
                "Selling her limits the spread of her vice and provides her a chance for a fresh start."
              ]
            }
          },
          {
            "title": {
              "urdu": "معمولی قیمت پر بھی فروخت",
              "english": "Selling Even for a Low Price"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے فرمایا کہ خواہ رسی کے عوض بیچنا پڑے، یعنی نقصان اٹھا کر بھی الگ کر دو۔",
                "مقصد مالی فائدہ نہیں بلکہ فتنے اور گناہ سے اپنے گھر کو پاک کرنا ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ دین اور اخلاق مال سے زیادہ قیمتی ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) said to sell even for a rope, meaning discard the risk despite financial loss.",
                "The goal is not profit, but purifying the home from discord and sin.",
                "This instruction proves that religion and morality are more valuable than wealth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالک کا سزا دینے کا اختیار",
              "english": "The Owner's Authority to Punish"
            },
            "content": {
              "urdu": [
                "بعض فقہاء کے نزدیک مالک خود اپنی لونڈی پر حد نافذ کر سکتا ہے۔",
                "دیگر کے نزدیک حدود کا نفاذ صرف حاکمِ وقت یا قاضی کی ذمہ داری ہے۔",
                "حدیث سے معلوم ہوتا ہے کہ مالک کو اس معاملے میں کچھ حد تک تادیبی اختیار حاصل تھا۔"
              ],
              "english": [
                "Some jurists believe the owner can personally implement the Had on their slave-girl.",
                "Others maintain that executing Hudud is solely the responsibility of the state or judge.",
                "The Hadith indicates the owner possessed a level of disciplinary authority in this matter."
              ]
            }
          },
          {
            "title": {
              "urdu": "برائی سے دوری",
              "english": "Distance from Evil"
            },
            "content": {
              "urdu": [
                "اسلام گناہ کے عادی افراد سے دوری اختیار کرنے کی ترغیب دیتا ہے اگر وہ اصلاح نہ کریں۔",
                "معاشرے میں بے حیائی پھیلانے والوں کے ساتھ نرمی برتنا فتنہ بڑھاتا ہے۔",
                "حکمتِ عملی کے ساتھ گناہ کے اسباب کو ختم کرنا ایمان کا تقاضا ہے۔"
              ],
              "english": [
                "Islam encourages distancing from habitual sinners if they refuse to reform.",
                "Showing undue leniency toward those spreading immorality increases fitnah.",
                "Strategically eliminating the causes of sin is a requirement of faith."
              ]
            }
          }
        ]
      }
    }
  ]
}