{
  "hadithId": 913,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1049"],
    "kitabId": 8,
    "inKitabBab": 6,
    "arabicBook": "كتاب النكاح",
    "babId": 69
  },
 
  "takhreej": {
    "arabic": " صحيح .‏ رواه البخاري (5204)‏ ، ومسلم (2855) ، وتمامه في البخاري : ثم لعله يجامعها في آخر اليوم .",
    "urdu": "صحیح۔ اسے امام بخاری (5204) اور امام مسلم (2855) نے روایت کیا ہے۔ بخاری کی مکمل روایت میں یہ الفاظ بھی ہیں کہ 'پھر شاید وہ دن کے آخری حصے میں اس سے جماع کرے'۔ یہ اس بات کی طرف اشارہ ہے کہ جس کے ساتھ محبت کا تعلق ہے اس پر تشدد کرنا عقل اور شرافت کے خلاف ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5204) and Muslim (2855). The complete version in Bukhari adds: '...and then he may have intercourse with her at the end of the day.' This highlights the contradiction between violence and intimacy."
  },
  "importantWords": [
    {
      "arabic": "لَا يَجْلِدُ",
      "english": "Should not flog",
      "urdu": "نہ مارے / کوڑے نہ لگائے"
    },
    {
      "arabic": "اِمْرَأَتَهُ",
      "english": "His wife",
      "urdu": "اپنی بیوی"
    },
    {
      "arabic": "جَلْدَ",
      "english": "Flogging / Whipping",
      "urdu": "مارنا / کوڑے مارنا"
    },
    {
      "arabic": "اَلْعَبْدِ",
      "english": "The slave",
      "urdu": "غلام"
    },
    {
      "arabic": "يُجَامِعُهَا",
      "english": "Has intercourse with her",
      "urdu": "اس سے ہمبستری کرے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیویوں پر جسمانی تشدد کی ممانعت کی گئی ہے، خاص طور پر ایسی مار جو ذلت آمیز ہو، کیونکہ بیوی ایک شریکِ حیات ہے نہ کہ کوئی غلام۔",
    "english": "This Hadith prohibits physical abuse of wives, specifically humiliating violence, emphasizing that a wife is a life partner and not a slave."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5204)",
      "english": "Sahih al-Bukhari (5204)"
    },
    {
      "arabic": "صحيح مسلم (2855)",
      "english": "Sahih Muslim (2855)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن زمعة",
        "english": "Abdullah bin Zam'a"
      },
      "slug": "abdullah-bin-zam-a"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYIq9vM-E7M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیوی کا مقام اور عزت",
        "english": "Dignity and Status of the Wife"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیوی غلام نہیں ہے",
              "english": "A Wife is Not a Slave"
            },
            "content": {
              "urdu": [
                "اسلام نے بیوی کو گھر کی ملکہ اور شوہر کی رفیقِ حیات کا درجہ دیا ہے۔",
                "اسے غلاموں کی طرح بے دردی سے مارنا اس کی انسانی تذلیل اور شرعی حقوق کی خلاف ورزی ہے۔",
                "نبی کریم ﷺ نے مردوں کو یاد دلایا کہ عورت ایک آزاد انسان ہے جس کے ساتھ حسنِ سلوک فرض ہے۔"
              ],
              "english": [
                "Islam grants the wife the status of the queen of the house and a partner in life.",
                "Beating her mercilessly like a slave is a violation of her dignity and Islamic rights.",
                "The Prophet (ﷺ) reminded men that a woman is a free being entitled to kind treatment."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبت اور تشدد کا تضاد",
              "english": "Contradiction of Love and Violence"
            },
            "content": {
              "urdu": [
                "ایک مرد کے لیے یہ کیسے ممکن ہے کہ وہ دن میں مار پیٹ کرے اور رات میں محبت کی امید رکھے۔",
                "تشدد اور ازدواجی الفت ایک جگہ جمع نہیں ہو سکتے، یہ انسانی فطرت کے خلاف ہے۔",
                "یہ حدیث مردوں کو اپنے جذبات پر قابو رکھنے اور عقل سے کام لینے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "How can a man be violent during the day and expect intimacy and love at night?",
                "Physical abuse and marital affection cannot coexist; it is against human nature.",
                "This Hadith encourages men to control their emotions and act with reason and wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی نظامِ تربیت",
        "english": "Islamic System of Rectification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اصلاح کا تدریجی طریقہ",
              "english": "Step-by-Step Correction"
            },
            "content": {
              "urdu": [
                "قرآن و سنت نے بیوی کی اصلاح کے لیے پہلے نصیحت اور پھر بستر الگ کرنے کا حکم دیا ہے۔",
                "مارنے کی اجازت صرف انتہائی مجبوری میں ہے، وہ بھی ایسی جس سے چوٹ نہ آئے۔",
                "نبی ﷺ نے پوری زندگی کبھی کسی عورت یا خادم پر ہاتھ نہیں اٹھایا، یہی اصل سنت ہے۔"
              ],
              "english": [
                "Quran and Sunnah prescribe advice first, then separate beds for rectifying behavior.",
                "Light hitting is only allowed as a final resort, ensuring it causes no injury or marks.",
                "The Prophet (ﷺ) never hit a woman or a servant in his life; this is the true Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "تشدد کی ممانعت",
              "english": "Prohibition of Severe Abuse"
            },
            "content": {
              "urdu": [
                "غلاموں کی طرح کوڑے مارنا یا جسم پر نشان ڈالنا قطعی طور پر حرام اور گناہ ہے۔",
                "چہرے پر مارنے سے خاص طور پر منع کیا گیا ہے کیونکہ یہ انسان کی عزت کا مرکز ہے۔",
                "مرد کو اپنی طاقت کا استعمال کمزور پر ظلم کے لیے نہیں بلکہ تحفظ کے لیے کرنا چاہیے۔"
              ],
              "english": [
                "Flogging like a slave or leaving marks on the body is strictly forbidden and sinful.",
                "Striking the face is specifically prohibited as it is the center of human dignity.",
                "A man should use his strength for protection, not for oppressing the weak."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خوشگوار معاشرت کے اصول",
        "english": "Principles of Happy Living"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیرکم خیرکم لاھلہ",
              "english": "The Best Among You"
            },
            "content": {
              "urdu": [
                "تم میں سے بہترین وہ ہے جو اپنے گھر والوں کے لیے بہترین اخلاق رکھتا ہو۔",
                "گھر سے باہر اخلاق دکھانا اور گھر میں تشدد کرنا منافقت کی علامت ہے۔",
                "سچا مومن وہی ہے جس کے ہاتھ اور زبان سے اس کی بیوی محفوظ رہے۔"
              ],
              "english": [
                "The best among you is the one who is best to his family in character.",
                "Showing good manners outside while being abusive at home is a sign of hypocrisy.",
                "A true believer is one from whose hands and tongue his wife remains safe."
              ]
            }
          },
          {
            "title": {
              "urdu": "درگزر اور صبر",
              "english": "Patience and Forgiveness"
            },
            "content": {
              "urdu": [
                "ازدواجی زندگی میں تلخیوں کو مار پیٹ کے بجائے صبر اور برداشت سے حل کرنا چاہیے۔",
                "عورت اپنی فطرت میں نازک ہے، اس کے ساتھ سختی کرنا تعلق کو توڑ دیتا ہے۔",
                "نبی ﷺ نے عورتوں کے بارے میں ہمیشہ خیر کی وصیت فرمائی ہے۔"
              ],
              "english": [
                "Bitterness in marital life should be resolved with patience rather than violence.",
                "Women are delicate by nature; harshness towards them breaks the relationship.",
                "The Prophet (ﷺ) always left a final will and advice for the kind treatment of women."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی وصیت اور خلاصہ",
        "english": "Practical Advice and Summary"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی و ذہنی اذیت سے بچاؤ",
              "english": "Avoiding Physical and Mental Torture"
            },
            "content": {
              "urdu": [
                "کسی بھی قسم کی جسمانی یا ذہنی اذیت دینا اسلام کے بنیادی اصولوں کے خلاف ہے۔",
                "مرد کو چاہیے کہ وہ اپنی حاکمیت کو ظلم کے لیے استعمال نہ کرے۔",
                "بیوی پر تشدد بچوں کی تربیت اور گھر کے ماحول کو مکمل تباہ کر دیتا ہے۔"
              ],
              "english": [
                "Inflicting any form of physical or mental torture is against Islamic principles.",
                "A man must not misuse his authority to commit acts of oppression.",
                "Violence against a wife destroys the children's upbringing and the home environment."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستقبل کی نسلوں کی تربیت",
              "english": "Training Future Generations"
            },
            "content": {
              "urdu": [
                "اگر باپ اپنی بیوی پر ہاتھ اٹھاتا ہے تو بچے بھی وہی پرتشدد رویہ سیکھتے ہیں۔",
                "نبی ﷺ کا طریقہ اپنانے سے ہی معاشرے میں سکون اور امن آ سکتا ہے۔",
                "خاندان کی بنیاد ڈر اور خوف پر نہیں بلکہ محبت اور احترام پر ہونی چاہیے۔"
              ],
              "english": [
                "If a father raises his hand against his wife, children learn the same violent behavior.",
                "Peace and security can only prevail in society by following the Prophet's way.",
                "The foundation of a family should be based on love and respect, not fear."
              ]
            }
          }
        ]
      }
    }
  ]
}