{
  "hadithId": 763,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/763"],
    "kitabId": 7,
    "inKitabBab": 13,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 54
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (3/303)، وأبو داود (3518)، والنسائي في الكبرى (2/229)، والترمذي (1369)، وابن ماجه (2494). وصححه الألباني في صحيح الجامع.",
    "urdu": "صحیح۔ اسے احمد (3/303)، ابوداؤد (3518)، نسائی، ترمذی (1369) اور ابن ماجہ (2494) نے روایت کیا ہے۔ علامہ البانی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (3/303), Abu Dawud (3518), An-Nasa'i, At-Tirmidhi (1369), and Ibn Majah (2494). Authenticated by Al-Albani in Sahih al-Jami'."
  },
  "importantWords": [
    {
      "arabic": "أَحَقُّ",
      "english": "More entitled",
      "urdu": "زیادہ حقدار"
    },
    {
      "arabic": "يُنْتَظَرُ",
      "english": "To be waited for",
      "urdu": "انتظار کیا جائے گا"
    },
    {
      "arabic": "غَائِبًا",
      "english": "Absent",
      "urdu": "موجود نہ ہونا"
    },
    {
      "arabic": "طَرِيقُهُمَا",
      "english": "Their path",
      "urdu": "ان دونوں کا راستہ"
    },
    {
      "arabic": "وَاحِدًا",
      "english": "One / Common",
      "urdu": "ایک / مشترک"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ اگر دو جائیدادوں کا راستہ ایک ہو، تو پڑوسی کو حقِ شفعہ حاصل ہوتا ہے اور اگر وہ موجود نہ ہو تو اس کی واپسی تک انتظار کرنا ضروری ہے۔",
    "english": "This Hadith clarifies that a neighbor shares the right of pre-emption if there is a common path, and his decision must be awaited even if he is away."
  },
  "references": [
    {
      "arabic": "رواه أحمد (3/303)",
      "english": "Reported by Ahmad (3/303)"
    },
    {
      "arabic": "رواه أبو داود (3518)",
      "english": "Reported by Abu Dawud (3518)"
    },
    {
      "arabic": "رواه الترمذي (1369)",
      "english": "Reported by At-Tirmidhi (1369)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مشترک راستہ اور شفعہ",
        "english": "Common Path and Pre-emption"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راستے کی شراکت کی اہمیت",
              "english": "Importance of a Shared Path"
            },
            "content": {
              "urdu": [
                "حدیث کے مطابق اگر دو گھروں کا راستہ ایک ہی ہو تو پڑوسی کا حق مضبوط ہو جاتا ہے۔",
                "یہ شراکت داری جائیداد کے حقوق میں ایک دوسرے سے جڑ جانے کی علامت ہے۔",
                "فقہاء کے نزدیک مشترکہ راستہ 'حقوقِ ملکیت' میں شراکت کے مترادف سمجھا جاتا ہے۔"
              ],
              "english": [
                "According to the Hadith, if two houses share the same path, the neighbor's right is strengthened.",
                "This shared access is considered a sign of being linked in property rights.",
                "Jurists consider a shared path equivalent to partnership in the 'rights of ownership'."
              ]
            }
          },
          {
            "title": {
              "urdu": "پڑوسی کا انتظار کرنا",
              "english": "Waiting for the Neighbor"
            },
            "content": {
              "urdu": [
                "اگر حقِ شفعہ رکھنے والا پڑوسی شہر سے باہر ہو، تو اس کا انتظار کیا جائے گا۔",
                "بیچنے والے کو چاہیے کہ وہ اسے مطلع کرے اور اس کے جواب کا موقع دے۔",
                "یہ حکم اس لیے ہے تاکہ غائب پڑوسی کے حق کو ضائع ہونے سے بچایا جا سکے۔"
              ],
              "english": [
                "If the neighbor with the right of pre-emption is out of town, he must be waited for.",
                "The seller should inform him and provide an opportunity for a response.",
                "This ruling exists to prevent the absent neighbor's rights from being violated or lost."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور ائمہ کی آراء",
        "english": "Juristic Details and Scholarly Views"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احناف اور شفعہ الجار",
              "english": "Hanafis and Neighbor's Pre-emption"
            },
            "content": {
              "urdu": [
                "امام ابو حنیفہ کے نزدیک محض پڑوسی ہونا ہی شفعہ کے حق کے لیے کافی ہے۔",
                "ان کے نزدیک راستہ مشترک ہو یا نہ ہو، دیوار سے جڑا پڑوسی حقدار ہے۔",
                "یہ حدیث ان لوگوں کے لیے خاص دلیل ہے جو مشترک راستے کو بنیاد بناتے ہیں۔"
              ],
              "english": [
                "According to Imam Abu Hanifa, simply being a neighbor is enough for the right of Shuf'a.",
                "In his view, whether the path is shared or not, the adjacent neighbor is entitled.",
                "This Hadith serves as specific evidence for those who base the right on shared pathways."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقِ شفعہ کی ترجیحات",
              "english": "Priorities in the Right of Pre-emption"
            },
            "content": {
              "urdu": [
                "پہلا حق زمین میں شریک (شریک فی نفس المبیع) کا ہوتا ہے۔",
                "دوسرا حق اس کا ہے جو حقوق (جیسے راستہ یا پانی) میں شریک ہو۔",
                "تیسرا حق محض قریبی پڑوسی کا ہے جو دیوار کے ساتھ جڑا ہو۔"
              ],
              "english": [
                "The first right belongs to the co-owner of the property itself.",
                "The second right belongs to the one who shares rights like paths or water access.",
                "The third right belongs to the adjacent neighbor who shares a boundary wall."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد اور اسباق",
        "english": "Social Benefits and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنازعات کا حل",
              "english": "Resolution of Conflicts"
            },
            "content": {
              "urdu": [
                "مشترکہ راستے پر نئے خریدار کے آنے سے اکثر جھگڑے جنم لیتے ہیں۔",
                "پڑوسی کو ترجیح دینے سے ایسے تمام ممکنہ تنازعات کا خاتمہ ہو جاتا ہے۔",
                "اسلامی قانون معاشرتی ہم آہنگی کو انفرادی آزادی پر فوقیت دیتا ہے۔"
              ],
              "english": [
                "Conflicts often arise when a new buyer enters a shared pathway situation.",
                "Prioritizing the neighbor eliminates these potential future disputes.",
                "Islamic Law prioritizes social harmony over unrestricted individual freedom."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانتداری اور عدل",
              "english": "Trustworthiness and Justice"
            },
            "content": {
              "urdu": [
                "غائب پڑوسی کا انتظار کرنا عدل و انصاف کا تقاضا ہے۔",
                "یہ قانون کسی کی عدم موجودگی کا ناجائز فائدہ اٹھانے سے روکتا ہے۔",
                "مسلمانوں کے مابین معاملات کی بنیاد شفافیت اور امانت پر ہونی چاہیے۔"
              ],
              "english": [
                "Waiting for an absent neighbor is a requirement of justice and fairness.",
                "This law prevents taking unfair advantage of someone's absence.",
                "Transactions between Muslims must be based on transparency and trust."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی ہدایات",
        "english": "Practical Guidelines"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فروخت سے پہلے مشورہ",
              "english": "Consultation Before Selling"
            },
            "content": {
              "urdu": [
                "جائیداد بیچنے والے کو چاہیے کہ وہ اپنے پڑوسیوں کو پہلے مطلع کرے۔",
                "اگر راستہ مشترک ہو تو یہ اخلاقی ذمہ داری مزید بڑھ جاتی ہے۔",
                "پڑوسی کی رضا مندی حاصل کرنا مستقبل کی تلخیوں سے بچاتا ہے۔"
              ],
              "english": [
                "A property seller should inform their neighbors before proceeding with a sale.",
                "If the path is shared, this ethical responsibility becomes even greater.",
                "Obtaining the neighbor's consent prevents future bitterness and legal issues."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقِ شفعہ کا استعمال",
              "english": "Exercising the Right of Shuf'a"
            },
            "content": {
              "urdu": [
                "پڑوسی کو چاہیے کہ وہ خریداری کا فیصلہ جلد کرے تاکہ بیچنے والے کو تنگی نہ ہو۔",
                "اگر وہ نہیں خریدنا چاہتا تو اسے فوری طور پر اپنی دستبرداری ظاہر کرنی چاہیے۔",
                "حقوق کا استعمال دوسروں کے لیے تنگی یا نقصان کا باعث نہیں بننا چاہیے۔"
              ],
              "english": [
                "The neighbor should decide on the purchase quickly to avoid hardship for the seller.",
                "If they do not wish to buy, they should promptly declare their waiver of the right.",
                "Exercising rights should not become a means of causing difficulty or harm to others."
              ]
            }
          }
        ]
      }
    }
  ]
}