{
  "hadithId": 1307,
  "hadithNo": 31,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh:1507"
    ],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه الترمذي (2012)، وأبو يعلى (4338)، والبيهقي في الشعب (4411). وزاد الترمذي في رواية أخرى: 'الأناة من الله والعجلة من الشيطان'. وصححه الألباني في صحيح الجامع (3011).",
    "urdu": "یہ حدیث اپنے شواہد کے ساتھ صحیح ہے۔ اسے امام ترمذی (2012) نے روایت کیا ہے۔ اس کے شروع میں 'الأناة من الله' (بردباری اللہ کی طرف سے ہے) کے الفاظ بھی ملتے ہیں۔ علامہ البانی نے اسے صحیح الجامع میں صحیح قرار دیا ہے۔",
    "english": "Sahih through supporting evidences. Reported by At-Tirmidhi (2012), Abu Ya'la, and Al-Baihaqi. The complete version often includes: 'Deliberation is from Allah and haste is from Satan.' Authenticated by Al-Albani."
  },
  "importantWords": [
    {
      "arabic": "الْعَجَلَةُ",
      "english": "Haste / Hurry",
      "urdu": "جلد بازی / عجلت"
    },
    {
      "arabic": "الشَّيْطَانِ",
      "english": "Satan / Devil",
      "urdu": "شیطان"
    },
    {
      "arabic": "الأَنَاةُ",
      "english": "Deliberation / Patience",
      "urdu": "بردباری / ٹھہراؤ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ہمیں زندگی کے معاملات میں سوچ سمجھ کر اور ٹھہراؤ کے ساتھ قدم اٹھانے کی ترغیب دیتی ہے اور بلا ضرورت جلدی کرنے سے روکتی ہے کیونکہ یہ انسان کو غلطیوں اور نقصان کی طرف لے جاتی ہے۔",
    "english": "This Hadith encourages acting with deliberation and calmness in all affairs, warning that unnecessary haste leads to errors and is a tool of Satan."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (2012)",
      "english": "Sunan at-Tirmidhi (2012)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سهل بن سعد الساعدي",
        "english": "Sahl bin Sa'd al-Sa'idi"
      },
      "slug": "sahl-bin-sad-al-saidi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9NOnXh6g5U",
  "grade": {
    "arabic": "حسن لغيره",
    "english": "Hasan Lighairihi (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جلد بازی کی حقیقت",
        "english": "The Nature of Haste"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطانی کام کیوں؟",
              "english": "Why is it from Satan?"
            },
            "content": {
              "urdu": [
                "جلد بازی انسان کی عقل پر پردہ ڈال دیتی ہے جس سے وہ انجام کو نہیں سوچ پاتا۔",
                "شیطان انسان کو جلدی میں ڈال کر غلط فیصلے کرواتا ہے تاکہ وہ گناہ یا نقصان میں پڑ جائے۔",
                "ٹھہراؤ اور غور و فکر اللہ کی پسندیدہ صفات ہیں جو انسان کو ندامت سے بچاتی ہیں۔"
              ],
              "english": [
                "Haste clouds human intellect, preventing one from considering the consequences.",
                "Satan pushes humans into hurry to cause wrong decisions, leading to sin or loss.",
                "Deliberation and reflection are attributes beloved by Allah that save one from regret."
              ]
            }
          },
          {
            "title": {
              "urdu": "عجلت کے نقصانات",
              "english": "Disadvantages of Haste"
            },
            "content": {
              "urdu": [
                "جلدی میں کیے گئے کاموں میں اکثر نقص رہ جاتا ہے۔",
                "غصے اور جذبات میں آکر جلد بازی کرنا رشتوں کی تباہی کا سبب بنتا ہے۔",
                "جلد باز شخص صبر جیسی عظیم صفت سے محروم ہو جاتا ہے۔"
              ],
              "english": [
                "Actions performed in haste often remain flawed or incomplete.",
                "Acting hurriedly in anger or emotion leads to the destruction of relationships.",
                "A hasty person is deprived of the great virtue of patience (Sabr)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پسندیدہ اور ناپسندیدہ عجلت",
        "english": "Commendable vs Blameworthy Haste"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیکی کے کاموں میں جلدی",
              "english": "Haste in Good Deeds"
            },
            "content": {
              "urdu": [
                "نیکی کرنے اور گناہوں سے توبہ کرنے میں جلدی کرنا مستحسن (پسندیدہ) ہے۔",
                "نماز کا وقت ہونے پر ادائیگی میں جلدی کرنا افضل عمل ہے۔",
                "مہمان کو کھانا کھلانے اور میت کی تدفین میں تعجیل کی اجازت دی گئی ہے۔"
              ],
              "english": [
                "Hurrying to do good deeds and repenting from sins is commendable.",
                "Performing prayer as soon as the time starts is an excellent act.",
                "Haste in feeding guests and burying the deceased is permitted and encouraged."
              ]
            }
          },
          {
            "title": {
              "urdu": "دنیاوی معاملات میں ٹھہراؤ",
              "english": "Calmness in Worldly Affairs"
            },
            "content": {
              "urdu": [
                "لین دین، تجارت اور سماجی فیصلوں میں جلد بازی سے بچنا چاہیے۔",
                "تحقیق کے بغیر کوئی بات پھیلانا یا فیصلہ کرنا ممنوع ہے۔",
                "بردباری انسان کے وقار میں اضافے کا باعث بنتی ہے۔"
              ],
              "english": [
                "One should avoid haste in transactions, trade, and social decisions.",
                "Spreading news or making judgments without verification is prohibited.",
                "Forbearance and calmness lead to an increase in human dignity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بردباری (الأناة) کی فضیلت",
        "english": "Virtue of Deliberation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی صفت",
              "english": "An Attribute of Allah"
            },
            "content": {
              "urdu": [
                "ٹھہراؤ اور سکون اللہ کی طرف سے بندے کے لیے ایک انعام ہے۔",
                "نبی ﷺ نے اشج عبد القیس سے فرمایا تھا: 'تم میں دو خصلتیں ایسی ہیں جو اللہ کو پسند ہیں: بردباری اور ٹھہراؤ'۔",
                "مومن وہی ہے جو ہر کام میں سنجیدگی اور وقار کو ملحوظ رکھے۔"
              ],
              "english": [
                "Calmness and tranquility are a gift from Allah to His servant.",
                "The Prophet (ﷺ) told Ashaj Abdul Qais: 'You possess two qualities loved by Allah: forbearance and deliberation.'",
                "A believer is one who maintains seriousness and dignity in every task."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذہنی تربیت",
              "english": "Mental Training"
            },
            "content": {
              "urdu": [
                "کسی بھی اشتعال انگیز صورتحال میں خاموشی اور گہرا سانس لینا عجلت کو روکتا ہے۔",
                "بولنے سے پہلے اپنے الفاظ کا انجام سوچنے کی عادت ڈالیں۔",
                "مشکل وقت میں 'استخارہ' اور 'مشورہ' جلد بازی کا بہترین توڑ ہیں۔"
              ],
              "english": [
                "In any provocative situation, silence and deep breathing prevent haste.",
                "Develop the habit of considering the outcome of your words before speaking.",
                "During difficult times, 'Istikhara' and 'Consultation' are the best remedies for haste."
              ]
            }
          }
        ]
      }
    }
  ]
}