{
  "hadithId": 357,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": [
      "bukhari:936",
      "muslim:863"
    ],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "كتاب الجمعة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (863)، والبخاري (936)، والترمذي (3311). وهذا الحديث نزل فيه قوله تعالى: (وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام مسلم اور بخاری دونوں نے روایت کیا ہے۔ اس واقعے کے پس منظر میں سورۃ الجمعہ کی آخری آیت نازل ہوئی: ”اور جب انہوں نے کوئی تجارت یا کھیل دیکھا تو وہ اس کی طرف دوڑ پڑے اور آپ کو کھڑا چھوڑ دیا۔“",
    "english": "Sahih (Authentic). Reported by Muslim (863) and Al-Bukhari (936). This Hadith relates to the revelation of the Verse: 'But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing.' (Surah Al-Jumu'ah: 11)."
  },
  "importantWords": [
    {
      "arabic": "يَخْطُبُ قَائِمًا",
      "english": "Preaching while standing",
      "urdu": "کھڑے ہو کر خطبہ دینا"
    },
    {
      "arabic": "عِيرٌ",
      "english": "Caravan",
      "urdu": "تجارتی قافلہ"
    },
    {
      "arabic": "انْفَتَلَ",
      "english": "Turned away / Rushed towards",
      "urdu": "پھٹ گئے / مڑ گئے"
    },
    {
      "arabic": "اثْنَا عَشَرَ",
      "english": "Twelve",
      "urdu": "بارہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث جمعہ کے خطبے کی سنت (کھڑے ہو کر خطبہ دینا) اور خطبہ سننے کی اہمیت بیان کرتی ہے۔ اس میں ایک تاریخی واقعے کا ذکر ہے جس پر قرآن مجید کی آیات نازل ہوئیں۔",
    "english": "This Hadith highlights the Sunnah of delivering the Friday sermon while standing and emphasizes the importance of listening to it. it records a historical incident that led to the revelation of Quranic verses."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (936)",
      "english": "Sahih al-Bukhari (936)"
    },
    {
      "arabic": "صحيح مسلم (863)",
      "english": "Sahih Muslim (863)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خطبہ جمعہ کی ہیئت",
        "english": "The Manner of the Friday Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھڑے ہو کر خطبہ دینا",
              "english": "Standing during the Sermon"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کی مستقل سنت یہ تھی کہ آپ ﷺ جمعہ کا خطبہ کھڑے ہو کر دیتے تھے۔",
                "بیٹھ کر خطبہ دینا سنت کے خلاف ہے، الّا یہ کہ کوئی شرعی عذر یا بیماری ہو۔",
                "یہ ہیئت خطیب کے وقار اور سامعین کی توجہ حاصل کرنے کے لیے موزوں ترین ہے۔"
              ],
              "english": [
                "It was the consistent Sunnah of the Prophet (ﷺ) to deliver the Friday sermon while standing.",
                "Delivering it while sitting is contrary to the Sunnah, unless there is a valid Shariah excuse or illness.",
                "This posture is most suitable for the dignity of the preacher and for capturing the audience's attention."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "واقعہ کی تشریح اور نصحیت",
        "english": "Context and Lesson of the Incident"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تجارتی قافلے کی آمد",
              "english": "The Arrival of the Caravan"
            },
            "content": {
              "urdu": [
                "اس وقت مدینہ میں قحط کی صورتحال تھی، جب دحیہ کلبی کا قافلہ غلہ لے کر پہنچا تو لوگ اپنی ضرورت کے پیشِ نظر دوڑ پڑے۔",
                "یہ واقعہ مسلمانوں کی ابتدائی تربیت کے دور کا ہے، جس کے بعد اللہ نے خطبہ چھوڑ کر جانے کی سختی سے ممانعت فرمائی۔",
                "جو بارہ افراد باقی رہ گئے تھے ان میں سیدنا ابوبکر اور سیدنا عمر رضی اللہ عنہما بھی شامل تھے۔"
              ],
              "english": [
                "At that time, there was a famine in Madinah; when Dihyah al-Kalbi's caravan arrived with food, people rushed out of necessity.",
                "This incident occurred during the early training phase of the Muslims, after which Allah strictly prohibited leaving the sermon.",
                "Among the twelve who remained were Abu Bakr and Umar (may Allah be pleased with them)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل",
        "english": "Jurisprudential Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز جمعہ کے لیے کم از کم تعداد",
              "english": "Minimum Number for Jumu'ah"
            },
            "content": {
              "urdu": [
                "اس حدیث سے بعض فقہاء نے استدلال کیا ہے کہ جمعہ کے صحیح ہونے کے لیے کم از کم بارہ افراد کا ہونا ضروری ہے۔",
                "تاہم دیگر فقہاء کے نزدیک تین یا چالیس کی تعداد بھی معتبر ہے، مگر یہ حدیث 'بارہ' کی اہمیت کو واضح کرتی ہے۔",
                "خطبے کے دوران خاموشی سے بیٹھنا اور امام کی طرف متوجہ رہنا واجب ہے۔"
              ],
              "english": [
                "Some jurists use this Hadith to argue that at least twelve people are required for the Friday prayer to be valid.",
                "However, other jurists consider three or forty as the minimum; this Hadith highlights the significance of the number twelve.",
                "It is obligatory (Wajib) to sit silently and remain attentive to the Imam during the sermon."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دنیا پر دین کی ترجیح",
              "english": "Prioritizing Deen over Dunya"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ خطبہ جمعہ کے دوران تمام دنیاوی کاموں اور تجارت کو معطل کر دیں جیسا کہ قرآن کا حکم ہے۔",
                "رزق کا مالک اللہ ہے، لہذا عبادت کے وقت رزق کی فکر میں دین کو پیچھے نہیں چھوڑنا چاہیے۔",
                "خطبے کے آداب کا خیال رکھنا نماز کے ثواب کو مکمل کرنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "We must suspend all worldly tasks and trade during the Friday sermon, as commanded in the Quran.",
                "Allah is the Provider; therefore, one should not neglect religion for the sake of worldly gain during worship.",
                "Adhering to the etiquettes of the sermon is essential for the completeness of the prayer's reward."
              ]
            }
          }
        ]
      }
    }
  ]
}