{
  "hadithId": 881,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/80"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5086)، ومسلم (1428) من حديث أنس بن مالك رضي الله عنه.",
    "urdu": "صحیح۔ اسے امام بخاری (5086) اور امام مسلم (1428) نے سیدنا انس رضی اللہ عنہ سے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5086) and Muslim (1428) on the authority of Anas bin Malik (RA)."
  },
  "importantWords": [
    {
      "arabic": "أَعْتَقَ",
      "english": "Emancipated / Set free",
      "urdu": "آزاد کیا"
    },
    {
      "arabic": "عِتْقَهَا",
      "english": "Her freedom / Manumission",
      "urdu": "اس کی آزادی"
    },
    {
      "arabic": "صَدَاقَهَا",
      "english": "Her dower (Mahr)",
      "urdu": "اس کا مہر"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "جَعَلَ",
      "english": "Made / Appointed",
      "urdu": "بنایا / قرار دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ کسی باندی کو آزاد کر کے اس کی آزادی ہی کو اس کا مہر قرار دے کر اس سے نکاح کرنا جائز ہے۔",
    "english": "This Hadith establishes that it is permissible to emancipate a female slave and consider her manumission as her dowry (Mahr) for marriage."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5086)",
      "english": "Sahih al-Bukhari (5086)"
    },
    {
      "arabic": "صحيح مسلم (1428)",
      "english": "Sahih Muslim (1428)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آزادی بطورِ مہر",
        "english": "Manumission as Dower"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی جواز",
              "english": "Legal Permissibility"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے سیدہ صفیہ کو آزاد کر کے ان کی آزادی کو ہی مہر قرار دیا۔",
                "اس سے معلوم ہوا کہ مہر صرف مال کی صورت میں ہونا ضروری نہیں ہے۔",
                "آزادی ایک ایسی عظیم نعمت ہے جو کسی بھی مادی مال سے زیادہ قیمتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) freed Safiyyah (RA) and made her freedom her actual dowry.",
                "This indicates that Mahr does not necessarily have to be in the form of physical wealth.",
                "Freedom is a supreme blessing that is far more valuable than any material possession."
              ]
            }
          },
          {
            "title": {
              "urdu": "باندیوں کے حقوق",
              "english": "Rights of Female Slaves"
            },
            "content": {
              "urdu": [
                "اسلام نے باندیوں کو معاشرے کا معزز رکن بنانے کے لیے نکاح کی ترغیب دی۔",
                "آزاد کر کے نکاح کرنا ان کی سماجی حیثیت کو بلند کرنے کا بہترین ذریعہ ہے۔",
                "آپ ﷺ کا یہ عمل قیامت تک کے مسلمانوں کے لیے ایک اعلیٰ نمونہ ہے۔"
              ],
              "english": [
                "Islam encouraged marriage to transform slaves into respected members of society.",
                "Emancipating and then marrying them is a primary means to elevate their social status.",
                "The Prophet's (ﷺ) action serves as an excellent precedent for Muslims for all time."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدہ صفیہ کا مقام",
        "english": "Status of Safiyyah (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عظیم اعزاز",
              "english": "Great Honor"
            },
            "content": {
              "urdu": [
                "سیدہ صفیہ رضی اللہ عنہا خیبر کے قیدیوں میں شامل تھیں اور رئیس کی بیٹی تھیں۔",
                "آپ ﷺ نے ان کے مرتبے کا خیال رکھتے ہوئے انہیں اپنی زوجیت میں لیا۔",
                "یہ ان کے لیے ایک بڑا اعزاز تھا کہ وہ ام المومنین کے رتبے پر فائز ہوئیں۔"
              ],
              "english": [
                "Safiyyah (RA) was among the captives of Khaibar and was the daughter of a chief.",
                "The Prophet (ﷺ) took her into his marriage, respecting her noble background.",
                "It was a great honor for her to attain the exalted rank of Mother of the Believers."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی حکمت",
              "english": "Prophetic Wisdom"
            },
            "content": {
              "urdu": [
                "اس نکاح کے ذریعے آپ ﷺ نے قبائل کے درمیان دشمنی کو ختم فرمایا۔",
                "رشتہ داری سے دلوں میں لچک پیدا ہوتی ہے اور دعوتِ دین آسان ہوتی ہے۔",
                "آپ ﷺ کے ہر نکاح کے پیچھے گہری سیاسی اور دعوتی حکمتیں پوشیدہ تھیں۔"
              ],
              "english": [
                "Through this marriage, the Prophet (ﷺ) aimed to end hostilities between tribes.",
                "Marital ties foster flexibility in hearts and make the dawah of Islam easier.",
                "Every marriage of the Prophet (ﷺ) contained profound political and religious wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی پہلو",
        "english": "Juristic and Legal Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہر کی اقسام",
              "english": "Types of Mahr"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک منفعت (فائدہ) کو بھی مہر قرار دیا جا سکتا ہے۔",
                "آزادی چونکہ عورت کے لیے سراسر فائدہ ہے، اس لیے یہ مہر بن سکتی ہے۔",
                "یہ حدیث اس اصول کی بنیادی دلیل ہے کہ مہر میں وسعت موجود ہے۔"
              ],
              "english": [
                "Jurists state that a benefit (manfa'ah) can also be designated as a valid dower.",
                "Since freedom is an absolute benefit for a woman, it qualifies as Mahr.",
                "This Hadith is a primary evidence for the principle of flexibility regarding Mahr."
              ]
            }
          },
          {
            "title": {
              "urdu": "بغیر مال کے نکاح",
              "english": "Marriage Without Wealth"
            },
            "content": {
              "urdu": [
                "اسلام نے نکاح کو اتنا آسان بنایا ہے کہ مال نہ ہونے پر بھی مہر ادا ہو سکتا ہے۔",
                "کسی کو ہنر سکھانا یا آزاد کرنا بھی مہر کے قائم مقام ہو سکتا ہے۔",
                "اس سے معاشرے میں معاشی دباؤ کے بغیر نکاح کی حوصلہ افزائی ہوتی ہے۔"
              ],
              "english": [
                "Islam made marriage simple enough that Mahr can be paid even without wealth.",
                "Teaching a skill or granting freedom can substitute for a monetary dowry.",
                "This encourages marriage in society without creating excessive financial pressure."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانیت کا احترام",
              "english": "Respect for Humanity"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا یہ عمل غلاموں اور باندیوں کے لیے رحمت کا پیغام تھا۔",
                "آپ ﷺ نے ثابت کیا کہ اسلام میں کسی کی سابقہ حیثیت رکاوٹ نہیں بنتی۔",
                "مومن کو چاہیے کہ وہ کمزور طبقات کے ساتھ حسنِ سلوک اور شفقت برتے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) action was a message of mercy for all male and female slaves.",
                "He proved that in Islam, a person's previous status is not a barrier to honor.",
                "A believer should treat vulnerable groups with kindness, dignity, and compassion."
              ]
            }
          },
          {
            "title": {
              "urdu": "سادگی اور برکت",
              "english": "Simplicity and Blessing"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کے نکاح انتہائی سادہ اور نمود و نمائش سے پاک ہوتے تھے۔",
                "سادگی سے کیا گیا نکاح ہی خاندان میں برکت اور محبت کا باعث بنتا ہے۔",
                "ہمیں بھی مہر اور نکاح کی دیگر رسومات میں سنتِ نبوی کو اپنانا چاہیے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) marriages were extremely simple and free from ostentation.",
                "A marriage conducted with simplicity brings blessings and love to the family.",
                "We must adopt the Sunnah regarding Mahr and other marital traditions today."
              ]
            }
          }
        ]
      }
    }
  ]
}