{
  "hadithId": 607,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/607"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1218). وهو أصح وأجمع حديث في صفة حجة النبي صلى الله عليه وسلم، وقد أفرده جماعة من العلماء بالتصنيف، منهم الشيخ الألباني في كتابه 'حجة النبي صلى الله عليه وسلم'.",
    "urdu": "صحیح۔ اسے مسلم (1218) نے روایت کیا ہے۔ یہ حدیث حجۃ الوداع کی مکمل اور تفصیلی منظر کشی کرتی ہے اور مناسکِ حج کے باب میں ریڑھ کی ہڈی کی حیثیت رکھتی ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (1218). This is the most comprehensive Hadith describing the Prophet's (ﷺ) Hajj. Scholars like Al-Albani have written specific books based on this narration."
  },
  "importantWords": [
    {
      "arabic": "أَهَلَّ بِالتَّوْحِيدِ",
      "english": "Proclaimed the Oneness",
      "urdu": "توحیدی تلبیہ پکارا"
    },
    {
      "arabic": "رَمَلَ",
      "english": "Trotted / Ramal",
      "urdu": "تیز قدموں سے چلنا (پہلے تین چکروں میں)"
    },
    {
      "arabic": "يَوْمَ اَلتَّرْوِيَةِ",
      "english": "Day of Tarwiyah (8th Dhul-Hijjah)",
      "urdu": "آٹھ ذوالحجہ کا دن"
    },
    {
      "arabic": "الْمَوْقِفَ",
      "english": "Standing place (Arafat)",
      "urdu": "ٹھہرنے کی جگہ (میدانِ عرفات)"
    },
    {
      "arabic": "الْمَشْعَرَ اَلْحَرَامَ",
      "english": "The Sacred Site (Muzdalifah)",
      "urdu": "مشعرِ حرام (مزدلفہ کا ایک مقام)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث حجۃ الوداع کا مکمل خاکہ پیش کرتی ہے، جس میں میقات سے احرام، تلبیہ، طواف، سعی، منیٰ، عرفات، مزدلفہ اور رمی جمار کے تمام طریقے تفصیل سے بیان ہوئے ہیں۔",
    "english": "This long Hadith details the complete Prophet's Hajj, covering Ihram at the Miqat, Talbiyah, Tawaf, Sa'i, the stay at Mina, Arafat, Muzdalifah, and the stoning of the pillars."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1218)",
      "english": "Reported by Muslim (1218)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYI7H7_nO6o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احرام اور تلبیہ کے احکام",
        "english": "Rulings of Ihram and Talbiyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حالتِ نفاس میں احرام",
              "english": "Ihram during Postnatal Bleeding"
            },
            "content": {
              "urdu": [
                "اسماء بنت عمیس کے واقعے سے ثابت ہوا کہ حائضہ اور نفاس والی عورت غسل کر کے احرام باندھ سکتی ہے۔",
                "ایسی حالت میں وہ طواف کے علاوہ حج کے تمام مناسک (عرفات، مزدلفہ، رمی) ادا کر سکتی ہے۔",
                "صفائی کے لیے کپڑے کا استعمال (لنگوٹ) کرنا چاہیے تاکہ نجاست نہ پھیلے۔"
              ],
              "english": [
                "The incident of Asma' (RA) proves that women in menstruation or postnatal bleeding can perform Ghusl and enter Ihram.",
                "She can perform all Hajj rituals (Arafat, Muzdalifah, Ramy) except for Tawaf around the Ka'bah.",
                "Using a pad or cloth to prevent blood flow from spreading is required for hygiene."
              ]
            }
          },
          {
            "title": {
              "urdu": "توحیدی تلبیہ",
              "english": "The Talbiyah of Monotheism"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا تلبیہ اللہ کی وحدانیت اور ہر قسم کے شرک کی نفی پر مبنی تھا۔",
                "'لبیک' پکارنے کا مطلب اللہ کی پکار پر مکمل سپردگی کا اظہار ہے۔",
                "تلبیہ بلند آواز سے پکارنا حج کا شعار ہے جو میقات سے شروع ہوتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) Talbiyah was based on the Oneness of Allah and the rejection of all Shirk.",
                "Reciting 'Labbayk' signifies total submission to the call of Allah.",
                "Proclaiming the Talbiyah loudly is a hallmark of Hajj that begins at the Miqat."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طواف اور سعی کے مناسک",
        "english": "Rituals of Tawaf and Sa'i"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمل اور استلام",
              "english": "Ramal and Touching the Stone"
            },
            "content": {
              "urdu": [
                "طواف کے پہلے تین چکروں میں پہلو بچا کر تیز چلنا (رمل) سنت ہے، جبکہ باقی چار چکر معمول کی چال سے ہوں گے۔",
                "حجرِ اسود کا بوسہ لینا یا اسے ہاتھ لگانا (استلام) طواف کی ابتدا اور انتہا ہے۔",
                "مقامِ ابراہیم پر دو رکعت نماز پڑھنا طواف کا لازمی حصہ ہے۔"
              ],
              "english": [
                "Trotting (Ramal) in the first three circuits of Tawaf is Sunnah, while the last four are at a normal pace.",
                "Kissing or touching the Black Stone (Istilam) marks the beginning and end of each circuit.",
                "Offering two Rak'ahs at the Station of Ibrahim (Maqam Ibrahim) is an essential part of the process."
              ]
            }
          },
          {
            "title": {
              "urdu": "صفا اور مروہ کی سعی",
              "english": "Sa'i between Safa and Marwah"
            },
            "content": {
              "urdu": [
                "سعی کی ابتدا صفا پہاڑی سے ہونی چاہیے کیونکہ اللہ نے قرآن میں اس کا ذکر پہلے کیا ہے۔",
                "پہاڑی پر چڑھ کر قبلہ رخ ہونا اور اللہ کی بڑائی بیان کرنا مسنون عمل ہے۔",
                "وادی کے نشیب (سبز میلین) کے درمیان مردوں کے لیے دوڑنا سعی کی سنت ہے۔"
              ],
              "english": [
                "Sa'i must begin at Safa because Allah mentioned it first in the Quran (2:158).",
                "Ascending the hill, facing the Qiblah, and proclaiming Allah's greatness is Sunnah.",
                "Running between the green markers (the valley bottom) is recommended specifically for men."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عرفات اور مزدلفہ کے احکام",
        "english": "Rulings of Arafat and Muzdalifah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقوفِ عرفات اور جمع بین الصلاتین",
              "english": "Standing at Arafat and Combining Prayers"
            },
            "content": {
              "urdu": [
                "9 ذوالحجہ کو زوال کے بعد ظہر اور عصر کی نمازیں قصر و جمع کر کے عرفات میں پڑھی جاتی ہیں۔",
                "وقوفِ عرفات حج کا سب سے بڑا رکن ہے، جس کے بغیر حج مکمل نہیں ہوتا۔",
                "غروبِ آفتاب تک قبلہ رخ ہو کر دعا و مناجات میں مشغول رہنا سنتِ نبوی ہے۔"
              ],
              "english": [
                "On the 9th of Dhul-Hijjah, Dhuhr and Asr prayers are shortened and combined at Arafat after midday.",
                "Standing at Arafat (Wuquf) is the greatest pillar of Hajj; without it, Hajj is invalid.",
                "Remaining occupied in supplication while facing the Qiblah until sunset is the Prophetic way."
              ]
            }
          },
          {
            "title": {
              "urdu": "مزدلفہ کی رات اور مشعرِ حرام",
              "english": "Night at Muzdalifah and al-Mash'ar al-Haram"
            },
            "content": {
              "urdu": [
                "عرفات سے واپسی پر مغرب اور عشاء کی نمازیں مزدلفہ پہنچ کر جمع کر کے پڑھی جاتی ہیں۔",
                "مزدلفہ میں رات گزارنا واجب ہے اور فجر کے بعد مشعرِ حرام کے پاس رک کر خوب دعا کرنی چاہیے۔",
                "سورج نکلنے سے پہلے منیٰ کی طرف روانہ ہونا سنت ہے۔"
              ],
              "english": [
                "Upon returning from Arafat, Maghrib and Isha prayers are combined at Muzdalifah.",
                "Staying overnight at Muzdalifah is mandatory, followed by intense prayer at al-Mash'ar al-Haram after Fajr.",
                "Departing for Mina just before sunrise is the established Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رمی، قربانی اور طوافِ افاضہ",
        "english": "Ramy, Sacrifice, and Tawaf al-Ifadah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمرہ عقبہ کی رمی",
              "english": "Stoning the Large Pillar"
            },
            "content": {
              "urdu": [
                "10 ذوالحجہ کو صرف بڑے شیطان (جمرہ عقبہ) کو سات کنکریاں ماری جاتی ہیں۔",
                "ہر کنکری مارتے وقت 'اللہ اکبر' کہنا مسنون ہے۔",
                "کنکریوں کا سائز لوبیا کے دانے کے برابر ہونا چاہیے، بڑے پتھر مارنا غلو ہے۔"
              ],
              "english": [
                "On the 10th of Dhul-Hijjah, only the large pillar (Jamrat al-Aqaba) is stoned with seven pebbles.",
                "Saying 'Allahu Akbar' with each throw is the Sunnah practice.",
                "Pebbles should be the size of a bean; using large stones is considered religious excess (Ghuluw)."
              ]
            }
          },
          {
            "title": {
              "urdu": "قربانی اور حلق",
              "english": "Sacrifice and Shaving"
            },
            "content": {
              "urdu": [
                "رمی کے بعد قربانی کرنا اور پھر سر منڈوانا یا بال کٹوانا ترتیبِ نبوی ہے۔",
                "اس کے بعد حاجی احرام کی پابندیوں سے (جماع کے علاوہ) آزاد ہو جاتا ہے۔",
                "آخر میں مکہ جا کر طوافِ افاضہ (زیارت) کرنا فرض ہے جس سے حج مکمل ہوتا ہے۔"
              ],
              "english": [
                "The Prophetic order is: stoning, followed by sacrifice, then shaving or cutting the hair.",
                "After this, the pilgrim is partially released from Ihram restrictions (except marital relations).",
                "Finally, performing Tawaf al-Ifadah in Makkah is obligatory to complete the Hajj."
              ]
            }
          }
        ]
      }
    }
  ]
}