{
  "hadithId": 1148,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/12/14"],
    "kitabId": 12,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأطعمة - باب الصيد والذبائح",
    "babId": 93
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5484)، ومسلم (1929). واللفظ لمسلم، وهو من الأصول العظيمة في أحكام الصيد.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (5484) اور امام مسلم (1929) نے روایت کیا ہے۔ یہ الفاظ امام مسلم کے ہیں۔ یہ حدیث شکار کے احکام میں ایک بنیادی اور عظیم ضابطہ ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5484) and Muslim (1929). The wording belongs to Muslim. This Hadith is a major foundational text regarding the laws of hunting."
  },
  "importantWords": [
    {
      "arabic": "أَرْسَلَتَ",
      "english": "Sent off / Released",
      "urdu": "چھوڑا / روانہ کیا"
    },
    {
      "arabic": "فَاذْكُرِ اسْمَ اَللَّهِ",
      "english": "Mention Allah's Name",
      "urdu": "اللہ کا نام لو (بسم اللہ پڑھو)"
    },
    {
      "arabic": "أَمْسَكَ عَلَيْكَ",
      "english": "Caught for you",
      "urdu": "تیرے لیے پکڑ رکھا"
    },
    {
      "arabic": "غَرِيقاً",
      "english": "Drowned",
      "urdu": "ڈوبا ہوا"
    },
    {
      "arabic": "أَثَرَ",
      "english": "Mark / Trace",
      "urdu": "نشان"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں شکار کے حلال ہونے کی پانچ بنیادی شرائط بیان کی گئی ہیں: اللہ کا نام لینا، کتے کا اپنے مالک کے لیے شکار کرنا، کتے کا خود نہ کھانا، شکاری ہتھیار یا کتے کا ہی مارنا، اور شکار کا کسی دوسرے سبب (جیسے ڈوبنے) سے نہ مرنا۔",
    "english": "This Hadith outlines five conditions for hunted meat to be Halal: mentioning Allah's name, the dog hunting specifically for the owner, the dog not eating from it, the death being caused by the intended weapon/dog, and ensuring no external cause (like drowning) caused the death."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5484)",
      "english": "Sahih al-Bukhari (5484)"
    },
    {
      "arabic": "صحيح مسلم (1929)",
      "english": "Sahih Muslim (1929)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عدي بن حاتم الطائي",
        "english": "Adi bin Hatim al-Ta'i"
      },
      "slug": "adi-bin-hatim"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شکاری کتے کے ذریعے شکار کے احکام",
        "english": "Rulings on Hunting with Dogs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تسمیہ (اللہ کا نام لینا)",
              "english": "Tasmiyah (Mentioning Allah's Name)"
            },
            "content": {
              "urdu": [
                "کتے کو چھوڑتے وقت 'بسم اللہ' پڑھنا شرط ہے، اگر جان بوجھ کر چھوڑ دیا تو شکار حرام ہوگا۔",
                "یہ اس بات کی علامت ہے کہ جانور کا خون اللہ کے حکم اور اجازت سے بہایا جا رہا ہے۔",
                "اگر بھول کر نام نہ لیا جائے تو اکثر فقہاء کے نزدیک گنجائش موجود ہے۔"
              ],
              "english": [
                "Reciting 'Bismillah' when releasing the dog is a condition; intentionally omitting it makes the meat Haram.",
                "This signifies that the animal's blood is shed under Allah's command and permission.",
                "If the name is forgotten, most jurists allow for an exemption."
              ]
            }
          },
          {
            "title": {
              "urdu": "کتے کا گوشت نہ کھانا",
              "english": "Dog Not Eating the Meat"
            },
            "content": {
              "urdu": [
                "اگر کتا شکار میں سے کچھ کھا لے، تو اس کا مطلب ہے اس نے اپنے لیے شکار کیا ہے، مالک کے لیے نہیں۔",
                "ایسی صورت میں وہ شکار حلال نہیں رہتا (بغیر ذبح کیے)۔",
                "کتے کو باقاعدہ سدھایا ہوا (Trained) ہونا چاہیے تاکہ وہ مالک کے حکم کی پابندی کرے۔"
              ],
              "english": [
                "If the dog eats from the game, it implies it hunted for itself, not for the owner.",
                "In such a case, the meat is not Halal (unless reached alive and slaughtered).",
                "The dog must be specifically trained (Mu'allam) to obey the owner's commands."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تیر اندازی اور دیگر اسباب",
        "english": "Archery and Other External Causes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موت کا سبب متعین ہونا",
              "english": "Certainty of the Cause of Death"
            },
            "content": {
              "urdu": [
                "اگر آپ کے کتے کے ساتھ کوئی غیر شکاری یا ایسا کتا مل جائے جس پر 'بسم اللہ' نہ پڑھی گئی ہو، تو شکار مشکوک ہونے کی وجہ سے حرام ہوگا۔",
                "اگر شکار پانی میں ڈوب کر مر جائے، تو یہ احتمال ہے کہ وہ دم گھٹنے سے مرا ہے نہ کہ زخم سے، اس لیے اسے حرام قرار دیا گیا۔",
                "اسلامی اصول یہ ہے کہ حلال و حرام کے شبہ میں حرمت کو ترجیح دی جاتی ہے۔"
              ],
              "english": [
                "If an unauthorized dog joins yours, the meat becomes Haram due to uncertainty of the cause of death.",
                "If the animal is found drowned, it might have died from suffocation rather than the wound, making it Haram.",
                "The Islamic principle is that when Halal and Haram are mixed in doubt, prohibition takes precedence."
              ]
            }
          },
          {
            "title": {
              "urdu": "شکار کا اوجھل ہو جانا",
              "english": "Game Disappearing from Sight"
            },
            "content": {
              "urdu": [
                "اگر زخمی شکار بھاگ جائے اور اگلے دن ملے، تو وہ تب حلال ہوگا جب اس پر صرف آپ کے تیر کا نشان ہو۔",
                "اگر اس میں کوئی دوسرا زخم یا درندے کے نشان ہوں، تو وہ حلال نہیں ہوگا۔",
                "اس سے ثابت ہوتا ہے کہ شریعت میں یقین اور احتیاط کو کتنی اہمیت حاصل ہے۔"
              ],
              "english": [
                "If the wounded game escapes and is found later, it is Halal only if it bears only your arrow mark.",
                "If there are other wounds or predator marks, it becomes impermissible.",
                "This demonstrates the high level of certainty and precaution required in Shariah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سائنسی اور اخلاقی حکمت",
        "english": "Scientific and Ethical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حفظانِ صحت",
              "english": "Health and Hygiene"
            },
            "content": {
              "urdu": [
                "پانی میں ڈوبنے یا دم گھٹنے سے مرنے والے جانور کا خون جسم میں رہ جاتا ہے جو زہریلا ہو سکتا ہے۔",
                "کتے کا گوشت کھانا اس بات کی دلیل ہو سکتا ہے کہ وہ بھوکا یا جنگلی تھا، جو بیماریوں کا سبب بن سکتا ہے۔",
                "اسلامی ذبیحہ اور شکار کے قوانین انسانی صحت کے بہترین محافظ ہیں۔"
              ],
              "english": [
                "Animals dying from drowning or suffocation retain blood in their bodies, which can be toxic.",
                "A dog eating the meat might indicate it was wild or diseased, potentially harming the consumer.",
                "Islamic slaughter and hunting laws are optimal for safeguarding human health."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شبہات سے بچنا",
              "english": "Avoiding Doubts"
            },
            "content": {
              "urdu": [
                "ہر وہ چیز جس کی حلت میں شک ہو، اسے چھوڑ دینا تقویٰ کا تقاضا ہے۔",
                "کھانے پینے کے معاملات میں احتیاط برتنا ایمان کی حفاظت کے لیے ضروری ہے۔",
                "رزقِ حلال کی تلاش میں باریکیوں پر توجہ دینا اسلاف کا طریقہ رہا ہے۔"
              ],
              "english": [
                "Leaving anything that carries doubt regarding its permissibility is a requirement of piety.",
                "Being cautious in dietary matters is essential for the protection of one's faith.",
                "Paying attention to details in seeking Halal sustenance was the way of the predecessors."
              ]
            }
          }
        ]
      }
    }
  ]
}