{
  "hadithId": 867,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/66"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه أبو داود (2162) والنسائي في الكبرى (9013) وأحمد (2/479). وله شواهد من حديث ابن عباس وخزيمة بن ثابت تقوي معناه وتصححه.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے ابوداؤد (2162)، نسائی (9013) اور احمد نے روایت کیا ہے۔ ابن عباس اور خزیمہ بن ثابت کی روایات بھی اس کی تائید کرتی ہیں۔",
    "english": "Sahih with supporting evidences. Reported by Abu Dawud (2162), An-Nasa'i (9013), and Ahmad (2/479). It has supporting narrations from Ibn Abbas and Khuzaima bin Thabit which strengthen its grade."
  },
  "importantWords": [
    {
      "arabic": "مَلْعُونٌ",
      "english": "Cursed",
      "urdu": "لعنتی / اللہ کی رحمت سے دور"
    },
    {
      "arabic": "أَتَى",
      "english": "Approach / Intercourse",
      "urdu": "جماع کرنا / پاس آنا"
    },
    {
      "arabic": "اِمْرَأَةً",
      "english": "Woman / Wife",
      "urdu": "عورت / بیوی"
    },
    {
      "arabic": "دُبُرِهَا",
      "english": "Her rectum / Backside",
      "urdu": "اس کی دبر / پچھلا راستہ"
    },
    {
      "arabic": "أُعِلَّ",
      "english": "Declared defective",
      "urdu": "علت نکالی گئی"
    }
  ],
  "summary": {
    "urdu": "بیوی کے ساتھ پچھلے راستے (دبر) سے جنسی تعلق قائم کرنا اسلام میں حرامِ قطعی اور اللہ کی لعنت کا سبب ہے۔",
    "english": "Establishing sexual relations with one's wife through the rectum is strictly forbidden in Islam and is a cause for Allah's curse."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2162)",
      "english": "Sunan Abi Dawud (2162)"
    },
    {
      "arabic": "سنن النسائي الكبرى (9013)",
      "english": "Sunan al-Nasa'i al-Kubra (9013)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=l_H8G-n8m1Y",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شرعی حکم اور حرمت",
        "english": "Sharia Ruling and Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عملِ قومِ لوط سے مشابہت",
              "english": "Similarity to the Act of Lot's People"
            },
            "content": {
              "urdu": [
                "دبر میں جماع کرنا فطرتِ انسانی کے خلاف اور ایک قبیح فعل ہے۔",
                "یہ عمل قومِ لوط کی مشابہت رکھتا ہے جن پر اللہ کا عذاب نازل ہوا۔",
                "اسلام نے اسے 'لواطتِ صغریٰ' (چھوٹی بدفعلی) قرار دے کر حرام کیا ہے۔"
              ],
              "english": [
                "Anal intercourse is contrary to human nature and a repulsive act.",
                "This act resembles the practices of the people of Lot who faced Divine wrath.",
                "Islam has categorized this as 'lesser sodomy' and strictly forbidden it."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کا مفہوم",
              "english": "Meaning of the Curse"
            },
            "content": {
              "urdu": [
                "لعنت کا مطلب اللہ کی رحمت اور برکت سے محروم ہونا ہے۔",
                "جس عمل پر اللہ اور اس کے رسول ﷺ لعنت کریں وہ گناہِ کبیرہ ہوتا ہے۔",
                "ایسا کرنے والے کے لیے دنیا اور آخرت میں سخت وعیدیں آئی ہیں۔"
              ],
              "english": [
                "A curse signifies being distanced from Allah's mercy and blessings.",
                "Any act cursed by Allah and His Messenger (ﷺ) is considered a major sin.",
                "Severe warnings exist for those who engage in this for both worlds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور اخلاقی نقصانات",
        "english": "Medical and Moral Harms"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طبی نقصانات",
              "english": "Medical Consequences"
            },
            "content": {
              "urdu": [
                "پچھلا راستہ گندگی کی جگہ ہے جو بیماریوں کا گڑھ ہوتا ہے۔",
                "اس فعل سے مہلک متعدی امراض اور جسمانی انفیکشن کا خطرہ بڑھ جاتا ہے۔",
                "جدید طب نے بھی اس غیر فطری عمل کے شدید مضر اثرات کی تصدیق کی ہے۔"
              ],
              "english": [
                "The rectum is a place of waste and a breeding ground for diseases.",
                "This act increases the risk of fatal contagious diseases and physical infections.",
                "Modern medicine confirms the severely harmful effects of this unnatural act."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی پستی",
              "english": "Moral Degradation"
            },
            "content": {
              "urdu": [
                "یہ عمل حیا اور انسانی وقار کے سراسر خلاف ہے۔",
                "ازدواجی تعلق کا مقصد سکون ہے نہ کہ وحشیانہ لذت کا حصول۔",
                "فطرت کے خلاف چلنا انسانی معاشرے میں بے راہ روی پیدا کرتا ہے۔"
              ],
              "english": [
                "This act is completely contrary to modesty and human dignity.",
                "The purpose of marital relations is tranquility, not barbaric gratification.",
                "Going against nature causes moral deviance within human society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرآنی آیات کی تفسیر",
        "english": "Tafsir of Quranic Verses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نسل کی پیدائش کا مقام",
              "english": "The Place of Procreation"
            },
            "content": {
              "urdu": [
                "اللہ نے فرمایا: 'تمہاری بیویاں تمہاری کھیتیاں ہیں، جہاں سے چاہو آؤ'۔",
                "کھیتی سے مراد وہ مقام ہے جہاں سے نسلِ انسانی کی آبیاری ہوتی ہے۔",
                "علماء کے مطابق اس آیت میں بھی صرف اگلے راستے کی اجازت دی گئی ہے۔"
              ],
              "english": [
                "Allah said: 'Your wives are a tilth for you, so go to your tilth as you will'.",
                "The word 'tilth' refers to the place where human procreation occurs.",
                "Scholars clarify that this verse only permits the vaginal route."
              ]
            }
          },
          {
            "title": {
              "urdu": "حلال اور حرام کا فرق",
              "english": "Difference Between Halal and Haram"
            },
            "content": {
              "urdu": [
                "نکاح کے باوجود بعض حدود کی پابندی کرنا ہر مسلمان پر لازم ہے۔",
                "صرف حیض کے دوران اور دبر میں جماع کی ممانعت کی گئی ہے۔",
                "باقی ہر طرح سے بیوی کے ساتھ لطف اندوز ہونا شرعاً جائز ہے۔"
              ],
              "english": [
                "Despite marriage, adhering to certain boundaries is mandatory for every Muslim.",
                "Intercourse is only forbidden during menstruation and through the rectum.",
                "Enjoying one's wife in all other permissible ways is legally allowed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی ہدایت",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توبہ اور اصلاح",
              "english": "Repentance and Reform"
            },
            "content": {
              "urdu": [
                "اگر نادانی میں ایسا گناہ ہوا ہو تو سچے دل سے توبہ کرنی چاہیے۔",
                "میاں بیوی کو ایک دوسرے کی شرعی حدود کا علم ہونا ضروری ہے۔",
                "اسلامی تعلیمات پر عمل پیرا ہونا ہی خوشگوار زندگی کی ضمانت ہے۔"
              ],
              "english": [
                "If such a sin occurred in ignorance, one must repent sincerely.",
                "Husbands and wives must be aware of each other's Sharia boundaries.",
                "Adhering to Islamic teachings is the guarantee of a happy life."
              ]
            }
          },
          {
            "title": {
              "urdu": "مغربی ثقافت کے اثرات سے بچاؤ",
              "english": "Protection from Western Cultural Influences"
            },
            "content": {
              "urdu": [
                "میڈیا اور مغربی افکار اس قبیح فعل کو نارمل بنا کر پیش کرتے ہیں۔",
                "مسلمانوں کو اپنی تہذیب اور نبوی اخلاق کی حفاظت کرنی چاہیے۔",
                "ایسی گندگی سے بچنا ہی ایمان کی پختگی اور تقویٰ کی نشانی ہے۔"
              ],
              "english": [
                "Media and Western thoughts often portray this foul act as normal.",
                "Muslims must safeguard their civilization and Prophetic ethics.",
                "Avoiding such filth is a sign of strong faith and righteousness."
              ]
            }
          }
        ]
      }
    }
  ]
}