{
  "hadithId": 1154,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/12/20"],
    "kitabId": 12,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأطعمة - باب الصيد والذبائح",
    "babId": 93
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5504). وفي رواية أن التي ذبحتها كانت جارية لكعب بن مالک ترعى غنماً بسلع، فأصيبت شاة منها، فأدركتها فذبحتها بحجر.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری نے روایت کیا ہے۔ دیگر روایات میں تفصیل ہے کہ وہ کعب بن مالک کی لونڈی تھی جو 'سلع' پہاڑ کے پاس بکریاں چرا رہی تھی، ایک بکری مرنے لگی تو اس نے پتھر توڑ کر اس کی دھار سے اسے ذبح کر دیا۔",
    "english": "Sahih. Reported by al-Bukhari (5504). Other narrations detail that the woman was a slave-girl of Ka'b bin Malik tending sheep at Sal' mountain; when one sheep was about to die, she broke a stone and slaughtered it with the sharp edge."
  },
  "importantWords": [
    {
      "arabic": "ذَبَحَتْ",
      "english": "Slaughtered",
      "urdu": "ذبح کیا"
    },
    {
      "arabic": "شَاةً",
      "english": "Sheep / Goat",
      "urdu": "بکری"
    },
    {
      "arabic": "بِحَجَرٍ",
      "english": "With a stone",
      "urdu": "پتھر کے ساتھ"
    },
    {
      "arabic": "فَأَمَرَ",
      "english": "Then he ordered",
      "urdu": "پس آپ ﷺ نے حکم دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ ذبح کرنے کے لیے چھری کا ہونا لازمی نہیں، بلکہ ہر وہ چیز جو خون بہا دے (سوائے دانت اور ناخن کے) اس سے ذبح کرنا جائز ہے۔ نیز عورت کا ذبیحہ بھی حلال ہے۔",
    "english": "This Hadith proves that a knife is not mandatory for slaughtering; any sharp object that causes blood to flow (except teeth and nails) is permissible. It also confirms that meat slaughtered by a woman is Halal."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5504)",
      "english": "Sahih al-Bukhari (5504)"
    },
    {
      "arabic": "سنن النسائي (4413)",
      "english": "Sunan an-Nasa'i (4413)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "كعب بن مالك",
        "english": "Ka'b bin Malik"
      },
      "slug": "kab-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آلاتِ ذبح کا شرعی حکم",
        "english": "Ruling on Slaughtering Tools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون بہانے والی ہر چیز جائز ہے",
              "english": "Anything that Sheds Blood is Allowed"
            },
            "content": {
              "urdu": [
                "شریعت میں ذبح کا اصل مقصد جانور کا ناپاک خون جسم سے نکالنا ہے۔",
                "پتھر، لکڑی یا شیشے کا کوئی بھی تیز ٹکڑا جو رگیں کاٹ دے، اس سے ذبح کرنا جائز ہے۔",
                "رسول اللہ ﷺ نے صرف دانت اور ناخن سے ذبح کرنے کو منع فرمایا ہے۔"
              ],
              "english": [
                "The primary purpose of slaughtering in Shariah is to drain the impure blood from the body.",
                "Any sharp piece of stone, wood, or glass that can cut the veins is permissible for slaughter.",
                "The Prophet (ﷺ) only prohibited using teeth or nails as slaughtering tools."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہنگامی حالات میں تدبیر",
              "english": "Resourcefulness in Emergencies"
            },
            "content": {
              "urdu": [
                "اگر جانور مرنے کے قریب ہو اور چھری میسر نہ ہو، تو وقت ضائع کیے بغیر کسی بھی دھار دار چیز سے ذبح کر لینا چاہیے۔",
                "اسلام نے حلال رزق کو ضائع ہونے سے بچانے کے لیے یہ سہولت دی ہے۔",
                "یہ عمل صحابیہ کی حاضر دماغی اور شرعی بیداری کی بہترین مثال ہے۔"
              ],
              "english": [
                "If an animal is dying and a knife is unavailable, it should be slaughtered with any sharp object without delay.",
                "Islam provides this facility to prevent the wastage of Halal provision.",
                "This act is a great example of the resourcefulness and religious awareness of the female companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عورت کے ذبیحہ کی حلت",
        "english": "Permissibility of Meat Slaughtered by Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرد اور عورت میں برابری",
              "english": "Equality of Men and Women"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس غلط فہمی کو دور کرتی ہے کہ عورت کا ذبیحہ حلال نہیں یا مکروہ ہے۔",
                "عورت اگر شرائط (تسمیہ اور رگیں کاٹنا) پوری کرے تو اس کا ذبیحہ بالاتفاق حلال ہے۔",
                "دین کے بنیادی احکامات میں مرد و عورت کے درمیان کوئی تفریق نہیں ہے۔"
              ],
              "english": [
                "This Hadith clears the misconception that meat slaughtered by a woman is not Halal or is disliked.",
                "If a woman fulfills the Shariah conditions (Tasmiyah and cutting the veins), her slaughter is unanimously Halal.",
                "There is no distinction between men and women in the fundamental rulings of the faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی نکات",
        "english": "Juristic and Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تسمیہ (اللہ کا نام لینا)",
              "english": "Tasmiyah (Mentioning Allah's Name)"
            },
            "content": {
              "urdu": [
                "کسی بھی آلے سے ذبح کرتے وقت 'بسم اللہ' پڑھنا لازمی شرط ہے۔",
                "نبی ﷺ کا اسے کھانے کا حکم دینا اس بات کی دلیل ہے کہ اس خاتون نے تسمیہ پڑھا تھا۔",
                "ذبح کرتے وقت نیت اور اللہ کا ذکر ذبیحہ کو پاکیزہ بناتا ہے۔"
              ],
              "english": [
                "Mentioning Allah's name (Bismillah) is a mandatory condition regardless of the tool used.",
                "The Prophet's (ﷺ) permission implies that the woman had performed the Tasmiyah.",
                "Intention and the remembrance of Allah during slaughter make the meat pure."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کی حفاظت",
              "english": "Protection of Property"
            },
            "content": {
              "urdu": [
                "جانور کو مردار ہونے سے بچانا اور اسے ذبح کر لینا 'حفاظتِ مال' کے زمرے میں آتا ہے۔",
                "اسلام اسراف اور مال کے ضیاع کو ناپسند کرتا ہے۔",
                "خاتون کا یہ عمل ثابت کرتا ہے کہ ذمہ داری کے معاملے میں صحابیات بہت بیدار تھیں۔"
              ],
              "english": [
                "Saving an animal from becoming carrion (Maitah) by slaughtering it falls under the 'protection of property'.",
                "Islam dislikes extravagance and the wastage of resources.",
                "This woman's action proves that female companions were very vigilant regarding their responsibilities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشکلات میں حل تلاش کرنا",
              "english": "Finding Solutions in Difficulties"
            },
            "content": {
              "urdu": [
                "جب مروجہ ذرائع میسر نہ ہوں تو جائز متبادل تلاش کرنا چاہیے۔",
                "ہمیں دین کے احکامات کو بوجھ سمجھنے کے بجائے ان میں موجود آسانیاں تلاش کرنی چاہئیں۔",
                "علمِ دین کا ہونا انسان کو مشکل وقت میں صحیح فیصلہ کرنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "When standard means are unavailable, one should look for permissible alternatives.",
                "We should seek the eases within Shariah rulings rather than viewing them as a burden.",
                "Possessing religious knowledge helps a person make the right decisions during crises."
              ]
            }
          }
        ]
      }
    }
  ]
}