{
  "hadithId": 949,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1090"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح لغيره. رواه أبو داود (2305) ، والنسائي (3536). وفي سنده مخرمة بن بكير عن أبيه وفيه كلام، لكن الحديث له شواهد صحيحة في السنن والمسانيد تقوي معناه في أحكام الإحداد.",
    "urdu": "یہ روایت اپنے شواہد کی بنا پر صحیح ہے۔ اسے ابوداؤد (2305) اور نسائی (3536) نے روایت کیا ہے۔ اگرچہ اس کی خاص سند میں مخرمہ بن بکیر کی وجہ سے کلام ہے، لیکن بیوہ کے سوگ (احداِد) کے حوالے سے اس کے شواہد کتبِ حدیث میں بکثرت موجود ہیں۔",
    "english": "Sahih lighairihi (Authentic due to corroborating evidence). Reported by Abu Dawud (2305) and An-Nasa'i (3536). Although the specific chain has some discussion regarding Makharama bin Bukair, the rulings of mourning (Ihdad) mentioned here are supported by numerous authentic narrations."
  },
  "importantWords": [
    {
      "arabic": "صَبْرًا",
      "english": "Aloes / Bitter herb",
      "urdu": "مصبر / کڑوی دوا"
    },
    {
      "arabic": "يَشِبُّ",
      "english": "Glows / Brightens",
      "urdu": "نکھارتا ہے / چمکاتا ہے"
    },
    {
      "arabic": "تَمْتَشِطِي",
      "english": "Comb hair",
      "urdu": "کنگھی کرنا"
    },
    {
      "arabic": "خِضَابٌ",
      "english": "Dye / Coloring",
      "urdu": "رنگنا / زینت"
    },
    {
      "arabic": "السِّدْرِ",
      "english": "Lote-tree leaves",
      "urdu": "بیری کے پتے"
    }
  ],
  "summary": {
    "urdu": "بیوہ کے لیے عدت کے دوران زینت اور بناؤ سنگھار ممنوع ہے؛ ایسی ادویات یا چیزیں جو حسن و جمال کا باعث ہوں، ان سے اجتناب ضروری ہے تاکہ سوگ کی کیفیت برقرار رہے۔",
    "english": "A widow in her waiting period (Iddah) must observe mourning (Ihdad), avoiding cosmetics, perfumes, dyes, and any adornment that enhances physical beauty or attracts attention."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2305)",
      "english": "Sunan Abu Dawud (2305)"
    },
    {
      "arabic": "سنن النسائي (3536)",
      "english": "Sunan an-Nasa'i (3536)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة هند بنت أبي أمية",
        "english": "Umm Salama Hind bint Abi Umayya"
      },
      "slug": "umm-salama"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سوگ (احداد) کی حقیقت",
        "english": "The Reality of Mourning (Ihdad)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زینت کی ممانعت",
              "english": "Prohibition of Adornment"
            },
            "content": {
              "urdu": [
                "بیوہ پر لازم ہے کہ وہ عدت کے دوران ہر قسم کی زینت اور بناؤ سنگھار ترک کر دے۔",
                "خوشبو، مہندی، رنگین لباس اور زیورات کا استعمال اس مدت میں جائز نہیں ہے۔",
                "یہ پابندی شوہر کے احترام اور اس کے ساتھ گزرے ہوئے رشتے کے سوگ میں ہے۔"
              ],
              "english": [
                "A widow must refrain from all types of cosmetics and beautification during Iddah.",
                "The use of perfume, henna, colorful jewelry, and fancy clothing is prohibited.",
                "This restriction serves as a mark of respect for the deceased husband and the marital bond."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوا اور علاج میں احتیاط",
              "english": "Caution in Medication and Treatment"
            },
            "content": {
              "urdu": [
                "اگر کسی دوا سے چہرے پر نکھار آتا ہو تو اسے صرف ضرورت کے وقت استعمال کیا جائے۔",
                "نبی ﷺ نے مصبر کو دن میں لگانے سے منع کیا کیونکہ وہ خوبصورتی کا باعث بنتا تھا۔",
                "علاج کے لیے ایسی اشیاء استعمال کی جا سکتی ہیں جن میں خوشبو یا رنگ (زینت) نہ ہو۔"
              ],
              "english": [
                "If a medicine enhances facial beauty, it should only be used if absolutely necessary.",
                "The Prophet (ﷺ) forbade using aloes during the day as it caused the face to glow.",
                "Treatments can be used during mourning as long as they lack perfume or dye."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بالوں کی حفاظت اور سادگی",
        "english": "Hair Care and Simplicity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کنگھی اور صفائی کا طریقہ",
              "english": "Method of Combing and Cleaning"
            },
            "content": {
              "urdu": [
                "بیوہ کے لیے بالوں کی صفائی اور ان میں کنگھی کرنا منع نہیں ہے مگر سادگی کے ساتھ۔",
                "ایسا تیل یا خوشبو استعمال کرنا جس سے بالوں میں چمک یا مہک پیدا ہو، ممنوع ہے۔",
                "بیری کے پتے (سدر) بالوں کی صفائی کے لیے بہترین اور سادہ نبوی طریقہ ہیں۔"
              ],
              "english": [
                "Cleaning and combing hair is not forbidden for a widow, provided it is done simply.",
                "Using oils or perfumes that add significant fragrance or shine to the hair is prohibited.",
                "Lote-tree leaves (Sidr) are a recommended and simple Prophetic way to clean the hair."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہندی اور خضاب سے پرہیز",
              "english": "Avoiding Henna and Dyes"
            },
            "content": {
              "urdu": [
                "مہندی چونکہ زینت اور خوشصورتی کا ایک بڑا ذریعہ ہے، اس لیے سوگ میں اسے منع کیا گیا ہے۔",
                "بالوں یا ہاتھوں کو رنگنا خوشی اور سنگھار کی علامت ہے جو بیوہ کے لیے مناسب نہیں۔",
                "سادگی اختیار کرنا دراصل اللہ کے فیصلے پر صبر اور تسلیم کا اظہار ہے۔"
              ],
              "english": [
                "Henna is a major form of adornment, hence it is strictly forbidden during mourning.",
                "Dyeing hair or hands symbolizes celebration and grooming, which is inappropriate for a widow.",
                "Adopting simplicity is an expression of patience and submission to Allah's decree."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدت کے دورانیہ کا لحاظ",
              "english": "Respecting the Iddah Period"
            },
            "content": {
              "urdu": [
                "بیوہ کی عدت چار ماہ دس دن ہے، جس میں احداد (سوگ) بھی شامل ہے۔",
                "اس عرصے میں عورت کو غیر مردوں کے لیے جاذبِ نظر بننے سے روکا گیا ہے۔",
                "یہ قانون عورت کی اپنی حفاظت اور معاشرتی وقار کو برقرار رکھنے کے لیے ہے۔"
              ],
              "english": [
                "A widow's Iddah is 4 months and 10 days, during which mourning is mandatory.",
                "During this time, the woman is prohibited from appearing attractive to non-mahram men.",
                "This law is for the woman's own protection and to maintain her social dignity."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی طرزِ تربیت",
              "english": "Prophetic Training Style"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ام سلمہ کو نہایت شفقت سے سکھایا کہ غم کی حالت میں اللہ کو کیا پسند ہے۔",
                "آپ ﷺ نے صرف منع نہیں کیا بلکہ متبادل (بیری کے پتے) بھی فراہم کیے۔",
                "اسلامی احکام انسانی فطرت اور نفسیات کا مکمل لحاظ رکھتے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) kindly taught Umm Salama what Allah loves during times of grief.",
                "He did not just prohibit things but also provided alternatives like Lote-tree leaves.",
                "Islamic rulings take human nature and psychology into full consideration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رسم و رواج کی اصلاح",
              "english": "Reforming Customs"
            },
            "content": {
              "urdu": [
                "بیوہ پر ایسی سختیاں نہ کی جائیں جو شریعت نے نہیں لگائی ہیں (مثلاً کالی کوٹھڑی میں بیٹھنا)۔",
                "سنت کے مطابق صرف زینت چھوڑنا اور سادگی اختیار کرنا ہی اصل سوگ ہے۔",
                "معاشرے کو چاہیے کہ وہ بیوہ کی نفسیاتی مدد کرے اور اس پر بے جا بوجھ نہ ڈالے۔"
              ],
              "english": [
                "Widows should not be subjected to hardships not prescribed by Shariah (like total isolation).",
                "According to Sunnah, true mourning is simply leaving adornment and being modest.",
                "Society should support the widow psychologically and avoid placing undue burdens on her."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ سے تعلق",
              "english": "Connection with Allah"
            },
            "content": {
              "urdu": [
                "عدت کا وقت اللہ کی طرف رجوع کرنے اور دعا و استغفار کا بہترین موقع ہے۔",
                "ظاہری بناؤ کے بجائے باطنی سکون کی تلاش ہی اصل کامیابی ہے۔",
                "ایک مومنہ کے لیے اللہ کے احکامات کی پابندی ہی اس کی حقیقی خوبصورتی ہے۔"
              ],
              "english": [
                "The time of Iddah is an excellent opportunity to turn to Allah in prayer and seeking pardon.",
                "Seeking inner peace rather than outward adornment is the real success.",
                "For a believing woman, adherence to Allah's commands is her true beauty."
              ]
            }
          }
        ]
      }
    }
  ]
}