{
  "hadithId": 123,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["1:123"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "صحيح.  رواه البخاري (300) ، ومسلم (293) ، واللفظ للبخاري.  ",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (300) اور مسلم (293) نے روایت کیا ہے، اور الفاظ بخاری کے ہیں۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (300) and Muslim (293), and the wording is that of Al-Bukhari. The Hadith is agreed upon (Muttafaqun Alayhi)."
  },
  "importantWords": [
    {
      "arabic": "يَأْمُرُنِي",
      "english": "He used to order me",
      "urdu": "وہ مجھے حکم دیتے"
    },
    {
      "arabic": "فَأَتَّزِرُ",
      "english": "So I would wear an Izar (waist-wrapper)",
      "urdu": "میں تہبند باندھتی"
    },
    {
      "arabic": "فَيُبَاشِرُنِي",
      "english": "Then he would fondle/cuddle me",
      "urdu": "پھر آپ میرے ساتھ مباشرت کرتے"
    },
    {
      "arabic": "وَأَنَا حَائِضٌ",
      "english": "While I was menstruating",
      "urdu": "حالانکہ میں حائضہ ہوتی"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْه",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    }
  ],
  "summary": {
    "urdu": "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ حیض کی حالت میں نبی اکرم ﷺ ان کو تہبند باندھنے کا حکم دیتے تھے، پھر آپ ﷺ تہبند کے اوپر سے ان کے ساتھ مباشرت (لطف اندوزی) کرتے تھے، جو اس بات کی واضح دلیل ہے کہ حیض میں جماع کے علاوہ ہر قسم کا تعلق جائز ہے۔",
    "english": "Aishah (RA) narrated that during her menses, the Prophet ﷺ would instruct her to wear a waist-wrapper (Izar), and then he would engage in intimate physical contact with her, clearly demonstrating that all forms of closeness except sexual intercourse are permissible during menstruation."
  },
  "references": [
    {
      "arabic": "رواه البخاري (300)",
      "english": "Reported by Al-Bukhari (300)"
    },
    {
      "arabic": "رواه مسلم (293)",
      "english": "Reported by Muslim (293)"
    }
  ],
  "narrators": [
    {
      "id": 12301,
      "name": {
        "arabic": "عَائِشَةَ بِنْتِ أَبِي بَكْرٍ",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیض میں تعلق کی حدود",
        "english": "Limits of Intimacy During Menses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماع سے اجتناب کی حکمت",
              "english": "Wisdom of Avoiding Intercourse"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا تہبند باندھنے کا حکم حیض کے دوران جماع کی حرمت پر عمل کرنے کے لیے تھا۔",
                "یہ اس بات کی دلیل ہے کہ میاں بیوی کے درمیان تمام اعضاء سے لطف اندوزی جائز ہے سوائے شرمگاہ کے۔",
                "یہ حکم اس آیت کی تفسیر ہے: \"فاعتزلوا النساء في المحيض\" (حیض میں عورتوں سے کنارہ کش رہو)۔"
              ],
              "english": [
                "The Prophet's command to wear an Izar was to ensure compliance with the prohibition of sexual intercourse during menses.",
                "This proves that all forms of intimacy between spouses are permissible except for the actual penetration.",
                "This ruling is an interpretation of the verse: 'So keep away from women during menses' (Al-Baqarah 2:222)."
              ]
            }
          },
          {
            "title": {
              "urdu": "مباشرت کا مفہوم",
              "english": "Meaning of Mubasharah (Fondling)"
            },
            "content": {
              "urdu": [
                "حدیث میں 'فیباشرنی' کا لفظ جماع کے علاوہ ہر قسم کے جسمانی قرب اور لطف اندوزی کے لیے استعمال ہوا ہے۔",
                "تہبند باندھنے کا مطلب ہے کہ ناف سے لے کر گھٹنوں تک کے حصہ کو ڈھانپ لیا جائے، جو جماع سے بچاؤ ہے۔",
                "اس سے حیض کی وجہ سے ازدواجی تعلقات کے مکمل ٹوٹنے کی تردید ہوتی ہے۔"
              ],
              "english": [
                "The word 'Yubashiruni' (fondle/cuddle) in the Hadith refers to all forms of physical closeness short of intercourse.",
                "Wearing the Izar implies covering the area from the navel to the knees, which serves as a barrier against intercourse.",
                "This negates the notion that matrimonial relations must cease entirely during menses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ازدواجی رشتوں کی اہمیت",
        "english": "Importance of Marital Relations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعلقات کا استحکام",
              "english": "Strengthening Relationships"
            },
            "content": {
              "urdu": [
                "حیض کی حالت میں عورت سے دور نہ رہنے کا حکم اسلامی معاشرت کا ایک اہم اصول ہے۔",
                "نبی ﷺ کے اس عمل سے میاں بیوی کے درمیان محبت اور تعلق کا تسلسل برقرار رہتا ہے۔",
                "حیض کو عورت کی نجاست یا معاشرتی بائیکاٹ کی وجہ نہیں بنایا جانا چاہیے۔"
              ],
              "english": [
                "The command not to isolate the wife during menses is a crucial principle of Islamic social conduct.",
                "This action of the Prophet ﷺ ensures the continuity of love and connection between the spouses.",
                "Menses should not be a cause for considering the wife impure or socially isolating her."
              ]
            }
          },
          {
            "title": {
              "urdu": "یہودیت کی مخالفت",
              "english": "Contradicting Judaism"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر یہودی طرز عمل کی مخالفت کرتی ہے جو حیض والی عورتوں سے مکمل لاتعلقی اختیار کرتے تھے۔",
                "اسلام نے انتہا پسندی سے بچ کر، فطری ضروریات اور شرعی حدود کے درمیان توازن قائم کیا۔",
                "یہ حکم امت مسلمہ کے لیے آسانی اور رحمت کا ذریعہ ہے۔"
              ],
              "english": [
                "This Hadith clearly contradicts the Jewish practice of complete isolation from menstruating women.",
                "Islam established a balance between natural needs and legal restrictions, avoiding extremism.",
                "This ruling is a source of ease and mercy for the Muslim community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نجاست سے حفاظت",
              "english": "Protection from Impurity"
            },
            "content": {
              "urdu": [
                "تہبند باندھنے کا مقصد نفاست (صفائی) کو یقینی بنانا اور خون کے آلودہ ہونے سے بچنا تھا۔",
                "اس طرح، نجاست کو محدود کر کے باقی جسم سے قربت کو جائز قرار دیا گیا۔",
                "یہ اس بات کی دلیل ہے کہ اسلام میں اصل حکم حلال ہے، مگر نجاست سے بچنا ضروری ہے۔"
              ],
              "english": [
                "The purpose of wearing the Izar was to ensure cleanliness and prevent contamination from blood.",
                "By confining the impurity, intimacy with the rest of the body was deemed permissible.",
                "This proves that the default ruling in Islam is permissibility, but avoidance of ritual impurity is necessary."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضرورت کے لیے احتیاط",
              "english": "Precaution for Necessity"
            },
            "content": {
              "urdu": [
                "اگرچہ بعض فقہاء نے صرف تہبند باندھ کر جماع سے اجتناب کو ضروری قرار دیا ہے، دیگر نے مزید احتیاط کی اجازت دی۔",
                "صحیح قول یہ ہے کہ میاں بیوی کے درمیان پیٹ اور ناف کے حصے کے علاوہ ہر طرح کا قرب جائز ہے۔",
                "یہ احتیاطی تدابیر یقینی بناتی ہیں کہ کہیں غلطی سے حرام کام سرزد نہ ہو جائے۔"
              ],
              "english": [
                "Although some jurists require only avoiding intercourse with the Izar on, others allow for further precaution.",
                "The sound view is that all forms of closeness are permissible between spouses, except for the area between the navel and knees (where the Izar is worn).",
                "These precautionary measures ensure that the forbidden act is not committed by mistake."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تربیتی نتائج",
        "english": "Educational and Training Outcomes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتماعی رہنمائی",
              "english": "Collective Guidance"
            },
            "content": {
              "urdu": [
                "یہ حدیث امت مسلمہ کے لیے عملی طور پر ایک واضح اور متفق علیہ حکم فراہم کرتی ہے۔",
                "رسول اللہ ﷺ کا حکم ہمارے لیے دین اور دنیا کے معاملات میں بہترین نمونہ ہے۔",
                "اس حدیث پر عمل کرنے سے خاندانی زندگی میں سہولت اور محبت پیدا ہوتی ہے۔"
              ],
              "english": [
                "This Hadith provides a clear and agreed-upon practical ruling for the Muslim community.",
                "The Prophet's command is the best example for us in both religious and worldly matters.",
                "Following this Hadith brings ease and affection into family life."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "صحیح سنت کی پیروی میں کبھی مشقت نہیں ہوتی بلکہ آسانی اور برکت ہوتی ہے۔",
                "جن لوگوں نے بلاوجہ سختی اختیار کی، وہ سنت سے دور ہو گئے اور غلط فہمی میں پڑ گئے۔",
                "یہ حکم اس بات پر زور دیتا ہے کہ ہم نبی ﷺ کے واضح حکم کے مطابق زندگی گزاریں۔"
              ],
              "english": [
                "Following the authentic Sunnah never results in hardship, but rather in ease and blessing.",
                "Those who adopted unnecessary strictness distanced themselves from the Sunnah and fell into error.",
                "This ruling emphasizes that we should live according to the clear command of the Prophet ﷺ."
              ]
            }
          }
        ]
      }
    }
  ]
}
