{
  "hadithId": 333,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["bukhari:783", "abudawud:683"],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب الأذان",
    "babId": 20
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (783)‏، وأبو داود (683)، والنسائي (871).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری نے اپنی صحیح (783) میں روایت کیا ہے۔ ابوداؤد اور نسائی میں بھی اس کے مختلف طرق موجود ہیں۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (783), Abu Dawud (683), and An-Nasa'i (871)."
  },
  "importantWords": [
    {
      "arabic": "رَاكِعٌ",
      "english": "Bowing",
      "urdu": "رکوع کرنے والا"
    },
    {
      "arabic": "حِرْصًا",
      "english": "Eagerness / Desire for good",
      "urdu": "لالچ / نیکی کا شوق"
    },
    {
      "arabic": "لَا تَعُدْ",
      "english": "Do not repeat / Do not return to this",
      "urdu": "دوبارہ ایسا نہ کرنا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث باجماعت نماز میں شامل ہونے کے آداب سکھاتی ہے کہ رکعت پانے کے شوق میں صف سے باہر رکوع کرنا یا دوڑ کر آنا درست نہیں، بلکہ سکون اور وقار کے ساتھ صف میں شامل ہونا چاہیے۔",
    "english": "This Hadith teaches the etiquettes of joining a congregational prayer: one should not bow before reaching the row or rush to catch a unit (Rak'ah); instead, one should join with calmness and dignity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (783)",
      "english": "Sahih al-Bukhari (783)"
    },
    {
      "arabic": "سنن أبي داود (683)",
      "english": "Sunan Abu Dawud (683)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكرة الثقفي",
        "english": "Abu Bakrah al-Thaqafi"
      },
      "slug": "abu-bakrah-al-thaqafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نیکی کا شوق اور نظم و ضبط",
        "english": "Zeal for Good vs. Discipline"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حوصلہ افزائی اور اصلاح",
              "english": "Encouragement and Correction"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے پہلے سیدنا ابوبکرہ کے جذبے کی تعریف فرمائی ('اللہ تمہارے شوق میں اضافہ کرے') تاکہ ان کا دل نہ ٹوٹے۔",
                "پھر آپ ﷺ نے ان کی غلطی کی اصلاح فرمائی ('آئندہ ایسا نہ کرنا') تاکہ نماز کے اجتماعی نظم و ضبط میں خلل نہ پڑے۔",
                "مبلغ اور استاد کو چاہیے کہ اصلاح کرتے وقت پہلے مخاطب کی خوبی بیان کرے۔"
              ],
              "english": [
                "The Prophet (ﷺ) first praised Abu Bakrah's intention ('May Allah increase your eagerness') to maintain his morale.",
                "He then corrected the mistake ('Do not do it again') to preserve the communal discipline of prayer.",
                "A teacher or preacher should highlight the positive aspects of a person before correcting their faults."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صفوں میں شامل ہونے کا طریقہ",
        "english": "Manner of Joining the Rows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صف سے باہر نماز",
              "english": "Praying Outside the Row"
            },
            "content": {
              "urdu": [
                "صف سے باہر اکیلے رکوع کرنا یا کھڑے ہونا سنت کے خلاف ہے۔",
                "نمازی کو چاہیے کہ وہ پہلے صف میں اپنی جگہ بنائے اور پھر نماز کے ارکان ادا کرے۔",
                "رکوع کی حالت میں چل کر صف میں آنا بھی 'کثرتِ عمل' کی وجہ سے ناپسندیدہ ہے۔"
              ],
              "english": [
                "Bowing or standing alone outside the row is contrary to the Sunnah.",
                "A worshiper should first secure a place in the row and then perform the prayer's actions.",
                "Walking while in a state of Ruku' to join the row is discouraged due to excessive movement."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رکعت پانے کا مسئلہ",
        "english": "Catching the Rak'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکوع میں ملنا",
              "english": "Joining in Ruku'"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک اگر کوئی امام کے ساتھ رکوع میں شامل ہو جائے تو اسے وہ رکعت مل جاتی ہے۔",
                "سیدنا ابوبکرہ نے بھی رکعت پانے کے لیے ہی جلدی کی تھی، آپ ﷺ نے ان کی نماز دوبارہ پڑھنے کا حکم نہیں دیا، جس سے معلوم ہوا کہ رکعت ہو گئی تھی۔",
                "تاہم، رکعت پانے کے لیے دوڑنا یا ہانپنا منع ہے، جو حصہ مل جائے وہ پڑھیں اور جو رہ جائے اسے بعد میں پورا کریں۔"
              ],
              "english": [
                "According to the majority of scholars, if one joins the Imam in Ruku', they have caught that Rak'ah.",
                "Abu Bakrah rushed to catch the unit; the Prophet (ﷺ) did not ask him to repeat the prayer, indicating the Rak'ah was valid.",
                "However, running or panting to catch a Rak'ah is forbidden; join what you find and complete what you missed calmly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقار اور سکون",
              "english": "Dignity and Calmness"
            },
            "content": {
              "urdu": [
                "مسجد کی طرف ہمیشہ باوقار طریقے سے چل کر آنا چاہیے، چاہے جماعت کھڑی ہو چکی ہو۔",
                "نیکی کی تڑپ میں شریعت کے مقرر کردہ ضابطوں کو نہیں توڑنا چاہیے۔",
                "نماز میں خشوع و خضوع کے لیے ضروری ہے کہ انسان پرسکون حالت میں صف میں داخل ہو۔"
              ],
              "english": [
                "One should always walk to the mosque with dignity, even if the congregation has started.",
                "Established Shariah rules should not be bypassed even out of a strong desire for reward.",
                "To maintain focus (Khushu') in prayer, it is essential to join the row in a state of calmness."
              ]
            }
          }
        ]
      }
    }
  ]
}