{
  "hadithId": 431,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:5814",
      "https://sunnah.com/muslim:942"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5814) في كتاب اللباس، ومسلم (942) في كتاب الجنائز. واللفظ يدل على استحباب تغطية الميت.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (5814) و مسلم (942) دونوں میں موجود ہے۔ یہ اس بات کی دلیل ہے کہ موت کے بعد میت کو ڈھانپنا سنت ہے۔",
    "english": "Authentic. Reported by Bukhari (5814) and Muslim (942). The wording indicates the recommendation of covering the deceased immediately after death."
  },
  "importantWords": [
    {
      "arabic": "تُوُفِّيَ",
      "english": "Passed away",
      "urdu": "وفات پا گئے"
    },
    {
      "arabic": "سُجِّيَ",
      "english": "Covered up",
      "urdu": "ڈھانپ دیا گیا"
    },
    {
      "arabic": "بِبُرْدٍ",
      "english": "With a cloak",
      "urdu": "چادر کے ساتھ"
    },
    {
      "arabic": "حِبَرَةٍ",
      "english": "Striped/Decorated",
      "urdu": "یمنی دھاری دار"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "بخاری و مسلم کی متفقہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ وفات کے فوراً بعد میت کے پورے جسم کو کسی کپڑے یا چادر سے ڈھانپ دینا سنتِ نبوی ہے تاکہ میت کی حرمت برقرار رہے۔",
    "english": "This Hadith proves that it is Sunnah to cover the entire body of the deceased with a cloth immediately after death to preserve their dignity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5814)",
      "english": "Sahih al-Bukhari (5814)"
    },
    {
      "arabic": "صحيح مسلم (942)",
      "english": "Sahih Muslim (942)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=J8W-X_H38uY",
  "grade": {
    "arabic": "صحيح (متفق عليه)",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "میت کی تکریم و پردہ پوشی",
        "english": "Dignity and Covering the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ڈھانپنے کی شرعی حکمت",
              "english": "Legal Wisdom of Covering"
            },
            "content": {
              "urdu": [
                "وفات کے بعد میت کو ڈھانپنا اس کی عزت اور پردہ پوشی کا تقاضا ہے۔",
                "یہ عمل میت کے جسمانی تغیرات کو لوگوں کی نظروں سے چھپانے کے لیے ہے۔",
                "حضور ﷺ کا اس طرح ڈھانپا جانا امت کے لیے ایک دائمی نمونہ ہے۔"
              ],
              "english": [
                "Covering the deceased after death is a requirement of honor and privacy.",
                "This act hides any physical changes of the body from public view.",
                "The covering of the Prophet (ﷺ) serves as an eternal example for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "پورے جسم کی کوریج",
              "english": "Full Body Coverage"
            },
            "content": {
              "urdu": [
                "سنت یہ ہے کہ چادر سر سے پاؤں تک پورے جسم پر ڈال دی جائے۔",
                "اس سے میت کی ہیبت برقرار رہتی ہے اور پسماندگان کو تسلی ملتی ہے۔",
                "کپڑا ایسا ہونا چاہیے جو پورے جسم کو مکمل طور پر چھپا لے۔"
              ],
              "english": [
                "The Sunnah is to place the cloth over the entire body from head to toe.",
                "This maintains the sanctity of the deceased and comforts the survivors.",
                "The fabric used should be sufficient to cover the entire body completely."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لباس اور چادر کی نوعیت",
        "english": "Nature of the Garment Used"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برد حبرہ کی وضاحت",
              "english": "Definition of Burd Hibara"
            },
            "content": {
              "urdu": [
                "حبرہ یمن کی بنی ہوئی ایک نفیس اور دھاری دار چادر کو کہتے ہیں۔",
                "اس سے معلوم ہوا کہ میت پر عمدہ یا قیمتی چادر ڈالنا جائز ہے۔",
                "اسلام نے وفات کے وقت بھی صفائی اور اچھے لباس کی اہمیت دی ہے۔"
              ],
              "english": [
                "Hibara refers to a fine, striped garment manufactured in Yemen.",
                "This indicates that using a good or valuable cloth for covering is permissible.",
                "Islam emphasizes cleanliness and good attire even at the time of death."
              ]
            }
          },
          {
            "title": {
              "urdu": "رنگ اور بناوٹ",
              "english": "Color and Texture"
            },
            "content": {
              "urdu": [
                "یمنی چادریں اکثر سبز یا سرخ دھاریوں والی خوبصورت ہوتی تھیں۔",
                "میت کے لیے صرف سفید کپڑا ہی لازم نہیں بلکہ رنگین بھی ہو سکتا ہے۔",
                "اصل مقصد تزئین و آرائش نہیں بلکہ پردہ پوشی اور تکریم ہے۔"
              ],
              "english": [
                "Yemeni cloaks were often beautiful with green or red stripes.",
                "Only white cloth is not mandatory; colored ones can also be used.",
                "The primary goal is not decoration but modesty and respect."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کرام کا عمل",
        "english": "The Practice of the Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اطاعتِ رسول ﷺ",
              "english": "Obedience to the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "صحابہ نے نبی ﷺ کی وفات پر فوراً سنت کے مطابق عمل کیا۔",
                "سیدہ عائشہ کا یہ نقل کرنا امت کی تعلیمی ضرورت کے لیے تھا۔",
                "وفات کے نازک وقت میں بھی احکامِ شرعیہ کا پاس رکھنا ضروری ہے۔"
              ],
              "english": [
                "The Companions acted immediately according to Sunnah upon the Prophet's death.",
                "Aisha's narration of this was for the educational needs of the Ummah.",
                "Observing Shariah rulings is vital even during sensitive times like death."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماعِ صحابہ",
              "english": "Consensus of the Companions"
            },
            "content": {
              "urdu": [
                "تمام صحابہ کا اس عمل پر اتفاق تھا کہ میت کو ڈھانپا جائے۔",
                "کسی نے بھی اس عمل پر اعتراض یا متبادل پیش نہیں کیا۔",
                "یہ عمل دینِ اسلام میں میت کے حقوق کی ادائیگی کا حصہ ہے۔"
              ],
              "english": [
                "All companions agreed on the practice of covering the deceased.",
                "None of them objected to this practice or offered an alternative.",
                "This act is part of fulfilling the rights of the deceased in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی ہدایات و سبق",
        "english": "Practical Guidelines and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موت کے بعد کی کارروائی",
              "english": "Procedure After Death"
            },
            "content": {
              "urdu": [
                "روح نکلنے کے بعد آنکھیں بند کرنا اور چادر ڈالنا اولین کام ہے۔",
                "میت کے پاس موجود لوگوں کو خاموشی اور دعا کا اہتمام کرنا چاہیے۔",
                "خلافِ شرع بین کرنے یا میت کو کھلا چھوڑنے سے پرہیز کریں۔"
              ],
              "english": [
                "Closing the eyes and covering with a cloth are the first tasks after death.",
                "Those present with the deceased should remain quiet and offer prayers.",
                "Avoid un-Islamic wailing or leaving the deceased uncovered."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی حرمت کا درس",
              "english": "Lesson on Human Sanctity"
            },
            "content": {
              "urdu": [
                "اسلام میں انسان کی حرمت مرنے کے بعد بھی برقرار رہتی ہے۔",
                "میت کی تذلیل یا اس کی بے پردگی گناہ کا باعث ہے۔",
                "مومن کے جسم کا احترام زندہ اور مردہ دونوں حالتوں میں لازم ہے۔"
              ],
              "english": [
                "In Islam, human sanctity remains intact even after death.",
                "Humiliating the deceased or exposing them is a cause of sin.",
                "Respecting a believer's body is mandatory in both life and death."
              ]
            }
          }
        ]
      }
    }
  ]
}