{
  "hadithId": 965,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1110"],
    "kitabId": 8,
    "inKitabBab": 13,
    "arabicBook": "كتاب الرضاع",
    "babId": 76
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2647)‏، ومسلم (1455).‏ سبب الحديث أن النبي ﷺ دخل على عائشة وعندها رجل، فاشتد ذلك عليه، فقالت: إنه أخي من الرضاعة، فقال: انظرن من إخوانكن، فإنما الرضاعة من المجاعة.",
    "urdu": "صحیح۔ اسے بخاری (2647) اور مسلم (1455) نے روایت کیا ہے۔ اس حدیث کا پس منظر یہ ہے کہ نبی ﷺ حضرت عائشہ کے پاس تشریف لائے تو وہاں ایک آدمی بیٹھا تھا، جس پر آپ ﷺ کے چہرہ مبارک پر ناگواری کے آثار آئے۔ حضرت عائشہ نے عرض کیا کہ یہ میرا رضاعی بھائی ہے، تب آپ ﷺ نے یہ اصول بیان فرمایا۔",
    "english": "Sahih. Reported by Al-Bukhari (2647) and Muslim (1455). The context is that the Prophet (ﷺ) saw a man with 'Aisha and felt upset. When she said he was her foster brother, he gave this rule to ensure the breastfeeding occurred at the proper age."
  },
  "importantWords": [
    {
      "arabic": "اُنْظُرْنَ",
      "english": "Look carefully / Verify",
      "urdu": "غور کرو / اچھی طرح دیکھ لو"
    },
    {
      "arabic": "إِخْوَانُكُنَّ",
      "english": "Your brothers",
      "urdu": "تمہارے بھائی"
    },
    {
      "arabic": "الرَّضَاعَةُ",
      "english": "Breastfeeding / Suckling",
      "urdu": "دودھ پینا / رضاعت"
    },
    {
      "arabic": "الْمَجَاعَةِ",
      "english": "Hunger",
      "urdu": "بھوک"
    }
  ],
  "summary": {
    "urdu": "رضاعت سے حرمت صرف اسی صورت میں ثابت ہوتی ہے جب دودھ اس عمر میں پیا جائے جب وہ بچے کی اصل غذا ہو اور بھوک مٹانے کا ذریعہ ہو، یعنی ڈھائی سال کی عمر سے پہلے۔",
    "english": "Fosterage only establishes prohibition (Mahram status) if the breastfeeding occurs during infancy when milk is the primary source of nutrition to satisfy hunger."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2647)",
      "english": "Sahih al-Bukhari (2647)"
    },
    {
      "arabic": "صحيح مسلم (1455)",
      "english": "Sahih Muslim (1455)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_vW0BTo",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رضاعت کی شرعی مدت",
        "english": "The Shariah Period of Breastfeeding"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمر کی حد",
              "english": "Age Limit"
            },
            "content": {
              "urdu": [
                "حدیث میں 'المجاعة' (بھوک) کا لفظ اس بات کی طرف اشارہ ہے کہ دودھ پینا اس وقت معتبر ہے جب بچہ اپنی غذا کے لیے صرف دودھ پر منحصر ہو۔",
                "جمہور فقہاء کے نزدیک یہ مدت دو سال یا زیادہ سے زیادہ ڈھائی سال ہے۔",
                "بڑی عمر میں دودھ پینے سے رضاعی حرمت (محرم ہونا) ثابت نہیں ہوتی۔"
              ],
              "english": [
                "The word 'Al-Majaa'ah' (hunger) indicates that suckling counts when the child depends on milk for sustenance.",
                "The majority of jurists set this period at two years or a maximum of two and a half years.",
                "Breastfeeding an adult or an older child does not establish foster relationship (Mahram status)."
              ]
            }
          },
          {
            "title": {
              "urdu": "گوشت اور ہڈیوں کی نشوونما",
              "english": "Growth of Flesh and Bone"
            },
            "content": {
              "urdu": [
                "دوسری روایات میں صراحت ہے کہ وہ رضاعت معتبر ہے جو ہڈیاں اگائے اور گوشت بنائے۔",
                "یہ نشوونما صرف شیر خوارگی کے دور میں ہوتی ہے۔",
                "اس اصول سے معلوم ہوتا ہے کہ رضاعت کا اثر جسمانی تعلق پر مبنی ہے۔"
              ],
              "english": [
                "Other narrations specify that valid suckling is that which builds bones and grows flesh.",
                "This biological development only occurs during infancy.",
                "This principle shows that the foster bond is based on physical nourishment during growth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محرم رشتوں کی تحقیق",
        "english": "Verifying Mahram Relationships"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احتیاط کا حکم",
              "english": "Instruction for Caution"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے 'انظرن' (غور کرو) فرما کر خواتین کو تاکید کی کہ وہ اپنے رضاعی بھائیوں کی اچھی طرح تصدیق کریں۔",
                "کیونکہ رضاعی بھائی سے پردہ نہیں ہوتا، اس لیے اس میں غلطی بہت بڑے فتنے کا سبب بن سکتی ہے۔",
                "کسی کو محض دعوے کی بنیاد پر محرم تسلیم نہیں کرنا چاہیے جب تک شرعی شہادت موجود نہ ہو۔"
              ],
              "english": [
                "By saying 'Verify', the Prophet (ﷺ) urged women to be certain about their foster brothers.",
                "Since foster brothers are Mahrams (no Hijab), an error in this could lead to serious religious violations.",
                "One should not accept someone as a Mahram based solely on a claim without Shariah evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "نکاح میں حرمت",
              "english": "Prohibition in Marriage"
            },
            "content": {
              "urdu": [
                "جو رشتے نسب سے حرام ہیں، وہی رضاعت سے بھی حرام ہو جاتے ہیں۔",
                "رضاعی بھائی سے نکاح دائمی طور پر حرام ہے۔",
                "یہ قانون خاندانی پاکیزگی اور سماجی تحفظ کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "Relationships forbidden by lineage are also forbidden by fosterage.",
                "Marrying a foster brother is permanently prohibited.",
                "This law is established for family purity and social protection."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رضاعتِ کبیر (بڑوں کی رضاعت) کا مسئلہ",
        "english": "The Issue of Sucking for Adults"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاص واقعہ بمقابلہ عام حکم",
              "english": "Specific Incident vs General Rule"
            },
            "content": {
              "urdu": [
                "سالم مولیٰ ابوحذیفہ کا واقعہ ایک خاص استثنیٰ تھا جو صرف ان کے لیے تھا۔",
                "عام مسلمانوں کے لیے قاعدہ یہی ہے کہ بڑی عمر کی رضاعت سے حرمت ثابت نہیں ہوتی۔",
                "حضرت عائشہ کے علاوہ دیگر امہات المومنین کا موقف بھی یہی تھا کہ یہ حکم عام نہیں ہے۔"
              ],
              "english": [
                "The case of Salim, the freed slave of Abu Hudhaifa, was a specific exception for him.",
                "For Muslims in general, the rule remains that adult suckling does not establish Mahram status.",
                "Except for 'Aisha, the other Mothers of the Believers held that this was not a general rule."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی ترجیح",
              "english": "Juristic Preference"
            },
            "content": {
              "urdu": [
                "چاروں ائمہ اس بات پر متفق ہیں کہ رضاعت کے لیے بچپن کی مدت شرط ہے۔",
                "حدیث کے الفاظ 'فانما' (صرف اور صرف) حصر کے لیے ہیں، جو بڑی عمر کی رضاعت کی نفی کرتے ہیں۔",
                "دین میں واضح نصوص پر عمل کرنا ہی فتنے سے بچنے کا راستہ ہے۔"
              ],
              "english": [
                "The four Imams agree that infancy is a necessary condition for fosterage.",
                "The wording 'Innama' (Only) in the Hadith acts as a restriction, negating adult suckling.",
                "Adhering to clear texts is the way to avoid confusion in religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھریلو نظم و ضبط",
              "english": "Household Discipline"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا حضرت عائشہ کے گھر میں غیر مرد کو دیکھ کر غصہ ہونا غیرتِ ایمانی کی علامت ہے۔",
                "مردوں کو اپنے گھروں کے ماحول اور آنے جانے والوں پر نظر رکھنی چاہیے۔",
                "پردے کے احکام میں کسی قسم کی سستی یا مداہنت نہیں ہونی چاہیے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) anger at seeing a stranger in 'Aisha's house is a sign of faith-based protective honor.",
                "Men should be vigilant about the environment of their homes and visitors.",
                "There should be no laxity or compromise regarding the rules of Hijab."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی تحقیق کی ضرورت",
              "english": "Need for Knowledgeable Research"
            },
            "content": {
              "urdu": [
                "معاشرتی تعلقات استوار کرنے سے پہلے ان کی شرعی حیثیت معلوم کرنا ضروری ہے۔",
                "محض جذباتی رشتوں کو شرعی رشتوں کا نام نہیں دینا چاہیے۔",
                "دینی مسائل میں ہمیشہ مستند دلائل کی بنیاد پر فیصلہ کرنا چاہیے۔"
              ],
              "english": [
                "It is essential to know the Shariah status of social relations before establishing them.",
                "Emotional bonds should not be confused with or labeled as Shariah-defined bonds.",
                "Religious matters should always be decided based on authentic evidence."
              ]
            }
          }
        ]
      }
    }
  ]
}