{
  "hadithId": 1105,
  "hadithNo": 26,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/26"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. أخرجه الترمذي (1568) واللفظ له، ومسلم (1641) بمعناه في قصة طويلة.",
    "urdu": "صحیح۔ اسے ترمذی (1568) نے ان الفاظ کے ساتھ روایت کیا ہے، اور اس کی اصل صحیح مسلم (1641) میں ایک طویل قصے کے طور پر موجود ہے۔",
    "english": "Sahih. Reported by At-Tirmidhi (1568) with this wording, and its origin is in Sahih Muslim (1641) within a longer narration."
  },
  "importantWords": [
    {
      "arabic": "فَدَى",
      "english": "Ransomed / Exchanged",
      "urdu": "فدیہ دیا / بدلے میں چھڑایا"
    },
    {
      "arabic": "رَجُلَيْنِ",
      "english": "Two men",
      "urdu": "دو آدمی"
    },
    {
      "arabic": "الْمُسْلِمِينَ",
      "english": "The Muslims",
      "urdu": "مسلمان"
    },
    {
      "arabic": "الْمُشْرِكِينَ",
      "english": "The Polytheists",
      "urdu": "مشرکین"
    },
    {
      "arabic": "أَصْلُهُ",
      "english": "Its origin",
      "urdu": "اس کی بنیاد"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ جنگی قیدیوں کا تبادلہ شرعاً جائز ہے اور حاکمِ وقت مسلمانوں کی رہائی کے لیے مشرک قیدیوں کو بطور فدیہ استعمال کر سکتا ہے۔",
    "english": "This Hadith proves that the exchange of prisoners of war is legally permissible, and the leader can ransom Muslim captives using non-Muslim prisoners."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1568)",
      "english": "Narrated by At-Tirmidhi (1568)"
    },
    {
      "arabic": "رواه مسلم (1641)",
      "english": "Narrated by Muslim (1641)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمران بن حصين",
        "english": "Imran bin Husain"
      },
      "slug": "imran-bin-husain"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قیدیوں کے تبادلے کا شرعی حکم",
        "english": "Legal Status of Captive Exchange"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تبادلے کی مشروعیت",
              "english": "Legality of Exchange"
            },
            "content": {
              "urdu": [
                "اسلام دشمن قیدیوں کے بدلے اپنے قیدیوں کو رہا کروانے کی اجازت دیتا ہے۔",
                "یہ عمل جنگی حکمت عملی اور انسانی حقوق کے تحفظ کا بہترین نمونہ ہے۔",
                "اس حدیث سے معلوم ہوتا ہے کہ تبادلے میں تعداد برابر ہونا ضروری نہیں۔"
              ],
              "english": [
                "Islam permits the exchange of enemy captives for the release of Muslim prisoners.",
                "This practice reflects a balance between military strategy and human rights protection.",
                "The Hadith shows that an equal number of captives is not required for an exchange."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاکم کا اختیار",
              "english": "Authority of the Ruler"
            },
            "content": {
              "urdu": [
                "قیدیوں کو قتل کرنا، غلام بنانا یا رہا کرنا حاکم کی صوابدید پر ہے۔",
                "اگر مسلمانوں کی رہائی مقصود ہو تو فدیہ لینا سب سے بہتر عمل ہے۔",
                "اسلامی ریاست اپنے شہریوں کی جان و مال کی حفاظت کے لیے جوابدہ ہے۔"
              ],
              "english": [
                "Executing, enslaving, or releasing captives is at the leader's discretion.",
                "Ransoming is the preferred option when it leads to the freedom of Muslims.",
                "The Islamic state is responsible for safeguarding the lives and assets of its citizens."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسلمانوں کی قدر و منزلت",
        "english": "The Value and Status of Muslims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک کے بدلے دو کا فدیہ",
              "english": "Ransom of Two for One"
            },
            "content": {
              "urdu": [
                "ایک مشرک کے بدلے دو مسلمانوں کی رہائی ایمان کی فضیلت کو ظاہر کرتی ہے۔",
                "نبی ﷺ نے ہمیشہ مسلمانوں کی جان بچانے کو ترجیح عطا فرمائی۔",
                "ایمان کی طاقت مادی تعداد اور دنیاوی حیثیت سے کہیں زیادہ بلند ہے۔"
              ],
              "english": [
                "Releasing two Muslims for one polytheist highlights the spiritual value of faith.",
                "The Prophet (ﷺ) always prioritized the safety and rescue of the believers.",
                "The power of faith far exceeds material numbers and worldly status."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیدیوں کے ساتھ حسنِ سلوک",
              "english": "Good Treatment of Captives"
            },
            "content": {
              "urdu": [
                "اسلام میں قیدیوں کے بھی حقوق ہیں جن کی پاسداری لازمی قرار دی گئی ہے۔",
                "تبادلے تک ان کی خوراک اور رہائش کا مناسب انتظام کرنا نیکی ہے۔",
                "یہ رویہ دشمنوں کے دلوں میں اسلام کے لیے نرم گوشہ پیدا کرتا ہے۔"
              ],
              "english": [
                "Islam establishes specific rights for captives that must be strictly followed.",
                "Providing proper food and shelter until their release is a virtuous act.",
                "This compassionate behavior often softens the hearts of enemies toward Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور ابعاد",
        "english": "Juristic Aspects and Dimensions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فدیہ کی مختلف صورتیں",
              "english": "Various Forms of Ransom"
            },
            "content": {
              "urdu": [
                "فدیہ مال کی صورت میں بھی ہو سکتا ہے اور افراد کے تبادلے کی صورت میں بھی۔",
                "جنگِ بدر میں کچھ قیدیوں کو تعلیم سکھانے کے بدلے بھی رہا کیا گیا تھا۔",
                "مقصد یہ ہے کہ جس طرح بھی ہو مسلمانوں کو فائدہ پہنچایا جائے۔"
              ],
              "english": [
                "Ransom can be paid in the form of wealth or through the exchange of individuals.",
                "At Badr, some captives were freed in exchange for teaching Muslim children.",
                "The primary goal is to provide benefit to the Muslim community in any way possible."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاہدات کی پاسداری",
              "english": "Sanctity of Agreements"
            },
            "content": {
              "urdu": [
                "جب تبادلے کا معاہدہ ہو جائے تو اس کی مکمل پاسداری کرنا فرض ہے۔",
                "دھوکہ دہی اور عہد شکنی اسلام کے جنگی آداب کے بالکل خلاف ہے۔",
                "دیانت داری ہی اسلامی نظام کی کامیابی اور رعب کی بنیاد ہے۔"
              ],
              "english": [
                "Once an exchange agreement is reached, its full fulfillment is mandatory.",
                "Betrayal and breach of trust are strictly against Islamic war ethics.",
                "Integrity is the foundation of the success and prestige of the Islamic system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتماعی مفاد کی ترجیح",
              "english": "Priority of Collective Interest"
            },
            "content": {
              "urdu": [
                "فیصلہ سازی میں ہمیشہ امت کے بڑے مفاد کو سامنے رکھنا چاہیے۔",
                "اپنے لوگوں کی آزادی کے لیے اسباب کا درست استعمال کرنا سنت ہے۔",
                "ذاتی انا کے بجائے حکمت اور مصلحت سے کام لینا کامیابی کی کنجی ہے۔"
              ],
              "english": [
                "In decision-making, the greater interest of the Ummah must be kept in view.",
                "Utilizing resources correctly to free our people is a Prophetic Sunnah.",
                "Exercising wisdom and pragmatism instead of personal ego is the key to success."
              ]
            }
          },
          {
            "title": {
              "urdu": "نصرت اور دعا",
              "english": "Divine Aid and Supplication"
            },
            "content": {
              "urdu": [
                "ظاہری کوشش کے ساتھ اللہ سے مدد مانگنا مومن کا خاصہ ہے۔",
                "قیدیوں کی رہائی کے لیے دعا کرنا اور عملی جدوجہد کرنا دونوں ضروری ہیں۔",
                "اللہ کی نصرت تب آتی ہے جب انسان شریعت کے مطابق عمل کرتا ہے۔"
              ],
              "english": [
                "Seeking Allah's help alongside outward effort is a trait of a believer.",
                "Both praying for captives' release and working practically for it are necessary.",
                "Allah's aid descends when a person acts according to the Sharia."
              ]
            }
          }
        ]
      }
    }
  ]
}