{
  "hadithId": 951,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1092"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1483). وهو دليل على جواز خروج المعتدة بائناً للحاجة نهاراً.",
    "urdu": "صحیح۔ اسے امام مسلم (1483) نے روایت کیا ہے۔ یہ حدیث اس بات کی مستند دلیل ہے کہ مطلقہ عورت اپنی ضروریات کی خاطر دن کے وقت گھر سے باہر نکل سکتی ہے۔",
    "english": "Sahih. Reported by Muslim (1483). This Hadith is a primary evidence for the permissibility of a divorced woman leaving her house during the daytime for necessary tasks."
  },
  "importantWords": [
    {
      "arabic": "طُلِّقَتْ",
      "english": "Was divorced",
      "urdu": "طلاق دی گئی"
    },
    {
      "arabic": "تَجُدَّ",
      "english": "Harvest / Cut",
      "urdu": "پھل توڑنا / کاٹنا"
    },
    {
      "arabic": "فَزَجَرَهَا",
      "english": "Scolded / Rebuked her",
      "urdu": "اسے ڈانٹا / روکا"
    },
    {
      "arabic": "تَصَدَّقِي",
      "english": "Give charity",
      "urdu": "تم صدقہ کرو"
    },
    {
      "arabic": "مَعْرُوفًا",
      "english": "Good deed",
      "urdu": "نیکی / بھلائی"
    }
  ],
  "summary": {
    "urdu": "عدت گزارنے والی مطلقہ عورت ضرورت کے تحت دن میں گھر سے باہر جا سکتی ہے، خاص طور پر معاشی سرگرمیوں یا نیکی کے کاموں کے لیے۔",
    "english": "A divorced woman observing Iddah is allowed to leave her home during the day for valid needs, particularly for livelihood or performing charitable acts."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1483)",
      "english": "Sahih Muslim (1483)"
    },
    {
      "arabic": "سنن أبي داود (2297)",
      "english": "Sunan Abu Dawud (2297)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دورانِ عدت باہر نکلنے کا حکم",
        "english": "Leaving Home During Iddah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت اور حاجت کا لحاظ",
              "english": "Considering Need and Necessity"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں عدت کا مقصد عورت کو قید کرنا یا اس کے معاشی مفادات کو نقصان پہنچانا نہیں ہے۔",
                "اگر مطلقہ عورت کو اپنی معاش یا باغات کی دیکھ بھال کے لیے باہر جانا پڑے تو اس کی مکمل اجازت ہے۔",
                "نبی ﷺ نے اس معاملے میں سختی کرنے والے شخص کے مقابلے میں عورت کو سہولت فراہم فرمائی۔"
              ],
              "english": [
                "In Islamic law, the purpose of Iddah is not to imprison a woman or harm her economic interests.",
                "If a divorced woman needs to go out for her livelihood or to tend to her property, it is fully permitted.",
                "The Prophet (ﷺ) provided ease to the woman over the person who was being unnecessarily strict."
              ]
            }
          },
          {
            "title": {
              "urdu": "دن اور رات کے احکام کا فرق",
              "english": "Difference Between Day and Night"
            },
            "content": {
              "urdu": [
                "علماء کے نزدیک مطلقہ عورت دن کے وقت اپنی ضروریات کے لیے باہر جا سکتی ہے مگر رات گھر میں گزارے۔",
                "بیوہ کے لیے بھی یہی حکم ہے کہ وہ اپنی معاشی ضروریات کے لیے دن میں باہر نکل سکتی ہے۔",
                "یہ لچک ظاہر کرتی ہے کہ دینِ اسلام انسانی زندگی کے معاملات کو مفلوج نہیں کرنا چاہتا۔"
              ],
              "english": [
                "Scholars state that a divorced woman may go out during the day for needs but must spend the night at home.",
                "The same rule applies to a widow who may need to work or manage affairs during the day.",
                "This flexibility shows that Islam does not intend to paralyze the practical affairs of human life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی خود مختاری اور خیر کے کام",
        "english": "Economic Independence and Charity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی معاملات کی نگرانی",
              "english": "Managing Financial Affairs"
            },
            "content": {
              "urdu": [
                "کھجوروں کی فصل کاٹنا ایک مالی معاملہ ہے، جس میں تاخیر سے نقصان کا اندیشہ ہوتا ہے۔",
                "عورت کو اپنے مال کی حفاظت اور انتظام کرنے کا پورا حق حاصل ہے، خواہ وہ عدت میں ہو۔",
                "آپ ﷺ کا عمل ثابت کرتا ہے کہ عورت کی معاشی سرگرمیوں کو بلاوجہ نہیں روکنا چاہیے۔"
              ],
              "english": [
                "Harvesting dates is a financial matter where delay could lead to loss of property.",
                "A woman has every right to protect and manage her wealth, even while observing Iddah.",
                "The Prophet's (ﷺ) action proves that a woman's economic activities should not be hindered without cause."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ و خیرات کی ترغیب",
              "english": "Encouragement of Charity"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے باہر جانے کی ایک وجہ یہ بتائی کہ اس سے صدقہ کرنے کا موقع ملے گا۔",
                "نیکی کے کاموں میں حصہ لینا انسان کے لیے روحانی سکون اور اجر کا باعث بنتا ہے۔",
                "دورانِ عدت بھی عورت کو سماجی بھلائی کے کاموں سے دور نہیں رہنا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) mentioned that going out would give her an opportunity to give charity.",
                "Participating in good deeds brings spiritual peace and reward to the individual.",
                "Even during Iddah, a woman should not be completely detached from social welfare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلط فہمیوں کا ازالہ",
        "english": "Removing Misconceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بے جا سختی کی مذمت",
              "english": "Condemning Unnecessary Harshness"
            },
            "content": {
              "urdu": [
                "کچھ لوگ اپنی کم علمی کی وجہ سے دین میں سختی پیدا کرتے ہیں جیسا کہ اس آدمی نے ڈانٹا۔",
                "سچی اتباع وہ ہے جو نبی ﷺ کے بتائے ہوئے اعتدال والے راستے پر مبنی ہو۔",
                "عورتوں پر ایسی پابندیاں لگانا جو اللہ نے نہیں لگائیں، ایک جاہلانہ طرزِ عمل ہے۔"
              ],
              "english": [
                "Some people create hardship in religion due to lack of knowledge, as seen in the man's rebuke.",
                "True following is based on the moderate path prescribed by the Prophet (ﷺ).",
                "Imposing restrictions on women that Allah has not ordained is an ignorant practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی طرزِ تعلیم",
              "english": "Prophetic Teaching Method"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے صرف 'ہاں' نہیں کہا بلکہ اس عمل کے مثبت پہلو (صدقہ و معروف) بھی بیان کیے۔",
                "یہ انداز سکھاتا ہے کہ احکام کی حکمت بتانے سے عمل کرنا آسان ہو جاتا ہے۔",
                "دین میں اصل مقصد اللہ کی رضا کا حصول اور انسانیت کی خدمت ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) didn't just say 'yes'; he highlighted the positive outcomes like charity.",
                "This style teaches that explaining the wisdom behind rulings makes them easier to follow.",
                "The primary goal in religion is seeking Allah's pleasure and serving humanity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشورے کی اہمیت",
              "english": "Importance of Consultation"
            },
            "content": {
              "urdu": [
                "جابر رضی اللہ عنہ کی خالہ نے ڈانٹ سن کر خاموش ہونے کے بجائے نبی ﷺ سے رجوع کیا۔",
                "مومن کو چاہیے کہ وہ اپنے مسائل کے حل کے لیے ہمیشہ علم والے لوگوں سے رابطہ کرے۔",
                "صحیح معلومات حاصل کرنے سے انسان بے جا ذہنی دباؤ اور غلطیوں سے بچ جاتا ہے۔"
              ],
              "english": [
                "Instead of remaining silent after being scolded, the aunt sought guidance from the Prophet (ﷺ).",
                "A believer should always reach out to people of knowledge to resolve their issues.",
                "Obtaining correct information saves a person from undue mental stress and errors."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشگوار معاشرہ",
              "english": "A Pleasant Society"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرے میں عدل اور سہولت کے اصولوں کو رواج دینا چاہیے۔",
                "عورتوں کو ان کے جائز شرعی حقوق سے محروم کرنا معاشرتی بگاڑ کا سبب ہے۔",
                "سنتِ نبوی پر عمل کرنے سے ہی معاشرے میں سکون اور ترقی ممکن ہے۔"
              ],
              "english": [
                "Principles of justice and ease should be promoted within an Islamic society.",
                "Depriving women of their legitimate Shariah rights leads to social corruption.",
                "Peace and progress in society are only possible by following the Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}