{
  "hadithId": 797,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/797"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2566)، ومسلم (1030). والفرسن بكسر الفاء: هو طرف رجل الشاة أو البعير، وهو مبالغة في القلة.",
    "urdu": "صحیح۔ اسے امام بخاری (2566) اور امام مسلم (1030) نے روایت کیا ہے۔ 'فرسن' بکری کے پاؤں کے نچلے حصے (کھر) کو کہتے ہیں، یہاں اسے بطور مبالغہ ذکر کیا گیا ہے تاکہ کم مالیت کی چیز دینے میں بھی ہچکچاہٹ نہ ہو۔",
    "english": "Sahih. Reported by Al-Bukhari (2566) and Muslim (1030). 'Firsin' refers to the hoof or the end of a sheep's leg, used here as a metaphor for something of very little value."
  },
  "importantWords": [
    {
      "arabic": "تَحْقِرَنَّ",
      "english": "Belittle / Despise",
      "urdu": "حقیر سمجھے / معمولی جانے"
    },
    {
      "arabic": "جَارَةٌ",
      "english": "Female neighbor",
      "urdu": "پڑوسن / ہمسائی"
    },
    {
      "arabic": "فِرْسِنَ",
      "english": "Trotter / Hoof",
      "urdu": "کھر / پایا"
    },
    {
      "arabic": "شَاةٍ",
      "english": "Sheep / Goat",
      "urdu": "بکری"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ہمسایوں کے درمیان تحائف کے تبادلے کی ترغیب دی گئی ہے اور اس بات پر زور دیا گیا ہے کہ ہدیہ چاہے کتنا ہی معمولی ہو، اسے دینے اور لینے میں شرم یا حقارت محسوس نہیں کرنی چاہیے۔",
    "english": "This Hadith encourages the exchange of gifts between neighbors and emphasizes that no gift should be looked down upon, regardless of how small or inexpensive it may be."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2566)",
      "english": "Reported by Al-Bukhari (2566)"
    },
    {
      "arabic": "رواه مسلم (1030)",
      "english": "Reported by Muslim (1030)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah ad-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہدیہ اور پڑوسیوں کے حقوق",
        "english": "Gifts and Neighborly Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواتین کو خاص خطاب کی وجہ",
              "english": "Reason for Addressing Women Specifically"
            },
            "content": {
              "urdu": [
                "خواتین عام طور پر پڑوسیوں سے زیادہ رابطے میں رہتی ہیں اور کھانا پکانے کے تبادلے میں پیش پیش ہوتی ہیں۔",
                "عورتوں میں بعض اوقات یہ احساس پایا جاتا ہے کہ اگر چیز معمولی ہے تو بھیجنے میں شرم محسوس کرتی ہیں۔",
                "نبی ﷺ نے اس ہچکچاہٹ کو دور کرنے کے لیے خواتین کو مخاطب فرمایا تاکہ معاشرتی الفت بڑھے۔"
              ],
              "english": [
                "Women are usually more engaged with neighbors and handle the exchange of cooked meals.",
                "Sometimes women feel hesitant to send a small gift, thinking it might be perceived as stinginess.",
                "The Prophet (ﷺ) addressed them to remove this social barrier and foster mutual affection."
              ]
            }
          },
          {
            "title": {
              "urdu": "کمیت کے بجائے جذبے کی اہمیت",
              "english": "Importance of Sentiment over Quantity"
            },
            "content": {
              "urdu": [
                "ہدیہ دینے کا اصل مقصد قیمت نہیں بلکہ محبت اور یادآوری کا اظہار ہے۔",
                "بکری کا کھر (پایا) ایک ایسی چیز ہے جس میں گوشت کم ہوتا ہے، مگر اسے بھی بطور تحفہ دینے سے منع نہیں کیا گیا۔",
                "اسلام سکھاتا ہے کہ نیت کی پاکیزگی اور ایثار ہی اصل نیکی ہے۔"
              ],
              "english": [
                "The real purpose of a gift is the expression of love and care, not its monetary value.",
                "A sheep's trotter is mentioned as it has very little meat, yet it is worthy of being shared.",
                "Islam teaches that sincerity of intention and selflessness are the core of virtue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پڑوسی کے ساتھ حسنِ سلوک",
        "english": "Good Conduct with Neighbors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوقِ ہمسائیگی کی اہمیت",
              "english": "Importance of Neighborly Rights"
            },
            "content": {
              "urdu": [
                "قرآن و حدیث میں پڑوسی کے حقوق پر بہت زیادہ زور دیا گیا ہے۔",
                "آپ ﷺ نے فرمایا کہ جبرائیل علیہ السلام مجھے پڑوسی کے بارے میں اتنی وصیت کرتے رہے کہ مجھے گمان ہوا کہ وہ اسے وارث بنا دیں گے۔",
                "ہدیہ بھیجنا ان حقوق کی ادائیگی کا ایک عملی اور آسان راستہ ہے۔"
              ],
              "english": [
                "Qur'an and Hadith place immense emphasis on the rights of neighbors.",
                "The Prophet (ﷺ) noted that Angel Jibril kept reminding him of neighbors until he thought they might be made heirs.",
                "Sending gifts is a practical and easy way to fulfill these obligations."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبول کرنے کا ادب",
              "english": "Etiquette of Acceptance"
            },
            "content": {
              "urdu": [
                "لینے والی پڑوسن کو چاہیے کہ وہ ہدیہ کو حقیر نہ سمجھے اور اسے خوشی سے قبول کرے۔",
                "کسی کے خلوص کا مذاق اڑانا یا اسے کم تر جاننا اسلامی اخلاق کے خلاف ہے۔",
                "شکر گزاری کا جذبہ معاشرتی تعلقات کو پائیدار بناتا ہے۔"
              ],
              "english": [
                "The receiving neighbor should never belittle the gift and should accept it with gratitude.",
                "Mocking someone's sincerity or undervaluing their effort is contrary to Islamic character.",
                "A spirit of thankfulness makes social relationships enduring."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد",
        "english": "Social Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کینہ اور بغض کا خاتمہ",
              "english": "Eradication of Malice"
            },
            "content": {
              "urdu": [
                "کھانے پینے کی چیزوں کا تبادلہ دلوں سے میل کچیل نکال دیتا ہے۔",
                "معمولی ہدیہ بھی بڑے سے بڑے جھگڑے کو ختم کرنے کی طاقت رکھتا ہے۔",
                "اسلام ایک ایسا معاشرہ بنانا چاہتا ہے جہاں ہر فرد دوسرے کے لیے خیر خواہ ہو۔"
              ],
              "english": [
                "Exchanging food and items washes away ill-will from hearts.",
                "Even a small gift has the power to settle significant disputes.",
                "Islam aims to build a society where every individual is a well-wisher for others."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتماد کی فضا",
              "english": "Atmosphere of Trust"
            },
            "content": {
              "urdu": [
                "جب پڑوسی ایک دوسرے کا خیال رکھتے ہیں، تو پورا محلہ ایک خاندان بن جاتا ہے۔",
                "اس سے باہمی تعاون اور ضرورت کے وقت ایک دوسرے کی مدد کا جذبہ پیدا ہوتا ہے۔",
                "یہ نبوی تعلیمات امنِ عالم اور سماجی خوشحالی کی ضامن ہیں۔"
              ],
              "english": [
                "When neighbors care for one another, the entire locality becomes like a family.",
                "It fosters mutual cooperation and the spirit of helping during times of need.",
                "These Prophetic teachings are guarantees of global peace and social prosperity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیکی میں پہل کریں",
              "english": "Initiate Goodness"
            },
            "content": {
              "urdu": [
                "ہدیہ دینے کے لیے کسی بڑے موقع کا انتظار نہ کریں، جو میسر ہو وہی بھیج دیں۔",
                "اگر گھر میں سالن پکائیں تو اس میں شوربہ تھوڑا بڑھا دیں تاکہ پڑوسی کو بھی بھیجا جا سکے۔",
                "نیکی کا کوئی بھی موقع ہاتھ سے نہ جانے دیں، چاہے وہ کتنا ہی چھوٹا کیوں نہ ہو۔"
              ],
              "english": [
                "Do not wait for a grand occasion to give a gift; send whatever is available.",
                "If cooking at home, add a little extra broth to share with a neighbor.",
                "Never miss an opportunity for a good deed, no matter how small it may seem."
              ]
            }
          },
          {
            "title": {
              "urdu": "خودداری اور شکر گزاری",
              "english": "Self-Respect and Gratitude"
            },
            "content": {
              "urdu": [
                "ہدیہ دیتے وقت احسان جتلانے سے مکمل پرہیز کریں۔",
                "ہدیہ لیتے وقت دینے والے کے ہاتھ اور دل کا شکریہ ادا کریں۔",
                "ہمیشہ یاد رکھیں کہ اللہ کے ہاں اعمال کا وزن ان کے خلوص سے ہوتا ہے۔"
              ],
              "english": [
                "Strictly avoid reminding the recipient of your favor when giving a gift.",
                "When receiving, express gratitude to the giver's heart and effort.",
                "Always remember that in Allah's sight, the weight of deeds is determined by their sincerity."
              ]
            }
          }
        ]
      }
    }
  ]
}