{
  "hadithId": 1309,
  "hadithNo": 33,
  "hadithReferences": {
    "sunnah.com": ["muslim:2598"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب البر والصلة والآداب",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2598)، وأبو داود (4907)، وأحمد (6/448).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (2598) نے اسے روایت کیا ہے۔ یہ روایت زبان کی سختی اور دوسروں کے حق میں بددعا (لعنت) کرنے کی سنگینی کو واضح کرتی ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (2598), Abu Dawud (4907), and Ahmad. It highlights the gravity of frequently cursing others."
  },
  "importantWords": [
    {
      "arabic": "اللَّعَّانِينَ",
      "english": "Frequent cursers",
      "urdu": "بہت زیادہ لعنت کرنے والے"
    },
    {
      "arabic": "شُفَعَاءَ",
      "english": "Intercessors",
      "urdu": "سفارش کرنے والے"
    },
    {
      "arabic": "شُهَدَاءَ",
      "english": "Witnesses",
      "urdu": "گواہی دینے والے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان لوگوں کے لیے ایک بڑی محرومی کا ذکر ہے جو کثرت سے دوسروں پر لعنت بھیجتے ہیں۔ ایسے لوگ قیامت کے دن شفاعت اور گواہی کے بلند مرتبے سے محروم رہیں گے۔",
    "english": "This Hadith warns that those who habitually curse others will be deprived of the high ranks of intercession and witnessing on the Day of Judgment."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2598)",
      "english": "Sahih Muslim (2598)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو الدرداء الأنصاري",
        "english": "Abu ad-Darda' al-Ansari"
      },
      "slug": "abu-ad-darda"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لعنت کی حقیقت اور سنگینی",
        "english": "The Reality and Severity of Cursing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لعنت کا مفہوم",
              "english": "The Meaning of Cursing"
            },
            "content": {
              "urdu": [
                "لعنت کا مطلب ہے کسی کو اللہ کی رحمت سے دور کیے جانے کی بددعا دینا۔",
                "مسلمان کا کام دوسروں کے لیے خیر مانگنا ہے نہ کہ انہیں اللہ کی رحمت سے محروم کرنے کی تمنا کرنا۔",
                "ایک مومن کی زبان رحمت ہونی چاہیے، زحمت نہیں۔"
              ],
              "english": [
                "Cursing (La'nah) means to pray for someone to be removed from Allah's mercy.",
                "A Muslim's duty is to wish for others' guidance, not their deprivation of divine mercy.",
                "A believer's tongue should be a source of mercy, not a source of trouble."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کرنے والے کا انجام",
              "english": "Consequence for the Curser"
            },
            "content": {
              "urdu": [
                "اگر لعنت ناحق کی جائے تو وہ پلٹ کر کرنے والے پر ہی آتی ہے۔",
                "دوسروں پر لعنت کرنا سنگین گناہ ہے جو انسان کے اخلاق کو گرا دیتا ہے۔",
                "نبی ﷺ نے فرمایا: 'مومن لعنت کرنے والا نہیں ہوتا'۔"
              ],
              "english": [
                "If a curse is unjustified, it returns to the person who uttered it.",
                "Cursing others is a major sin that degrades one's moral character.",
                "The Prophet (ﷺ) said: 'A believer is not one who frequently curses'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کے دن محرومی",
        "english": "Deprivation on the Day of Judgment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفاعت سے محرومی",
              "english": "Deprivation of Intercession"
            },
            "content": {
              "urdu": [
                "قیامت کے دن نیک لوگ گنہگاروں کی سفارش کریں گے، مگر لعنت کرنے والے اس اعزاز سے محروم رہیں گے۔",
                "وہ دوسروں کے لیے اللہ کے حضور شفاعت (سفارش) کرنے کے قابل نہیں سمجھے جائیں گے۔",
                "جو دنیا میں لوگوں کے لیے بددعا کرتا رہا، وہ وہاں ان کے کام کیسے آ سکے گا۔"
              ],
              "english": [
                "On Judgment Day, the righteous will intercede for sinners, but cursers will be denied this honor.",
                "They will not be deemed worthy of making intercession before Allah.",
                "One who invoked evil for people in this world cannot benefit them in the next."
              ]
            }
          },
          {
            "title": {
              "urdu": "گواہی سے محرومی",
              "english": "Deprivation of Witnessing"
            },
            "content": {
              "urdu": [
                "امتِ محمدیہ کو پچھلی امتوں پر گواہ بنا کر پیش کیا جائے گا، مگر یہ گروہ اس سے بھی محروم ہوگا۔",
                "ان کی گواہی اللہ کے دربار میں معتبر یا مقبول نہیں ٹھہرے گی۔",
                "یہ ان کے حق میں ایک بڑی رسوائی اور مقام و مرتبے کی کمی ہے۔"
              ],
              "english": [
                "The Ummah of Muhammad (ﷺ) will witness over previous nations, but this group will be excluded.",
                "Their testimony will not be considered reliable or accepted in Allah's court.",
                "This marks a significant loss of status and humiliation for them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی تربیت",
        "english": "Moral Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کا کنٹرول",
              "english": "Control of the Tongue"
            },
            "content": {
              "urdu": [
                "غصے اور اشتعال کے وقت بھی لعنت کے الفاظ نکالنے سے پرہیز کریں۔",
                "اپنی زبان کو اللہ کے ذکر اور کلماتِ خیر سے تر رکھیں۔",
                "بدکلامی انسان کی نیکیوں کے نور کو ختم کر دیتی ہے۔"
              ],
              "english": [
                "Refrain from uttering curses even during moments of anger and provocation.",
                "Keep the tongue busy with the remembrance of Allah and good words.",
                "Foul language extinguishes the light of one's good deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعائے خیر کی ترغیب",
              "english": "Encouragement of Supplicating for Good"
            },
            "content": {
              "urdu": [
                "اگر کوئی برا سلوک کرے تو اس کے لیے ہدایت کی دعا کرنا سنت ہے۔",
                "بددعا کے بجائے صبر اور درگزر کا راستہ اختیار کرنا اعلیٰ ظرفی ہے۔",
                "ہمارا کلام ایسا ہونا چاہیے جو لوگوں کو اللہ کی رحمت سے جوڑے۔"
              ],
              "english": [
                "If someone treats you badly, it is Sunnah to pray for their guidance.",
                "Choosing patience and forgiveness over invoking evil is a sign of noble character.",
                "Our speech should connect people to Allah's mercy, not distance them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توبہ اور اصلاح",
              "english": "Repentance and Reform"
            },
            "content": {
              "urdu": [
                "اگر ماضی میں لعنت کرنے کی عادت رہی ہو تو صدقِ دل سے توبہ کریں۔",
                "دوسروں کی عزت اور حرمت کا احترام کرنا ایمان کا حصہ بنائیں۔",
                "قیامت کے دن کی کامیابی کے لیے ابھی سے اپنے اخلاق درست کریں۔"
              ],
              "english": [
                "If cursing was a past habit, repent sincerely with a firm heart.",
                "Make respecting the honor and sanctity of others a core part of your faith.",
                "Correct your character now to ensure success on the Day of Resurrection."
              ]
            }
          }
        ]
      }
    }
  ]
}