{
  "hadithId": 315,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:644",
      "https://sunnah.com/muslim:651"
    ],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "صحيح البخاري / صحيح مسلم",
    "babId": 20
  },

  "takhreej": {
    "arabic": "صحيح متفق عليه.‏ رواه البخاري (644)‏، ومسلم (651)‏.",
    "urdu": "صحیح، متفق علیہ۔ اسے بخاری (644) اور مسلم (651) نے روایت کیا ہے۔",
    "english": "Sahih (Agreed Upon). Reported by Al-Bukhari (644) and Muslim (651)."
  },
  "importantWords": [
    {
      "arabic": "هَمَمْتُ",
      "english": "I intended / considered",
      "urdu": "میں نے ارادہ کیا"
    },
    {
      "arabic": "حَطَبٍ",
      "english": "Firewood",
      "urdu": "لکڑی / ایندھن"
    },
    {
      "arabic": "أُخَالِفُ إِلَى",
      "english": "I go to (surprise them)",
      "urdu": "میں ان کی طرف جاؤں"
    },
    {
      "arabic": "أُحَرِّقَ",
      "english": "I burn",
      "urdu": "میں جلا دوں"
    },
    {
      "arabic": "عَرْقًا سَمِينًا",
      "english": "A meaty bone",
      "urdu": "گوشت والی ہڈی"
    },
    {
      "arabic": "مِرْمَاتَيْنِ",
      "english": "Two hoofs (trotters)",
      "urdu": "دو کھر / پائے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز باجماعت کی انتہائی اہمیت اور اسے ترک کرنے والوں کے لیے سخت وعید بیان کرتی ہے۔ نبی ﷺ نے جماعت چھوڑنے والوں کے گھر جلانے کا ارادہ ظاہر کیا اور ان کی دنیاوی لالچ کی مذمت کی۔",
    "english": "This Hadith emphasizes the extreme importance of congregational prayer and issues a severe warning to those who neglect it. The Prophet (ﷺ) expressed his intent to burn the houses of those who miss the congregation and condemned their worldly greed."
  },
  "references": [
    {
      "arabic": "رواه البخاري (644)",
      "english": "Reported by Al-Bukhari (644)"
    },
    {
      "arabic": "رواه مسلم (651)",
      "english": "Reported by Muslim (651)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://youtu.be/k2Mxo0Nlo9A?si=l4nQ8vJ4X5bF8Gg_",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Muttafaq Alaih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جماعت کی اہمیت و وجوب",
        "english": "Importance and Obligation of Jama'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخت وعید",
              "english": "Severe Warning"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا گھروں کو جلانے کا ارادہ ظاہر کرنا بتاتا ہے کہ جماعت چھوڑنا کتنا بڑا گناہ ہے۔",
                "یہ وعید منافقین کے بارے میں تھی یا سست مسلمانوں کے بارے میں، دونوں صورتوں میں یہ غفلت کی سنگینی ظاہر کرتی ہے۔",
                "بہت سے علماء (جیسے امام احمد) اس حدیث کی بنیاد پر جماعت کو 'فرضِ عین' قرار دیتے ہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) intention to burn houses shows the gravity of missing congregation.",
                "Whether regarding hypocrites or lazy Muslims, it highlights the severity of negligence.",
                "Based on this, many scholars (like Imam Ahmad) consider Jama'ah as 'Fard Ayn' (Individual Obligation)."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزا پر عمل کیوں نہیں ہوا؟",
              "english": "Why was punishment not executed?"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے صرف ارادہ ظاہر کیا، عمل نہیں کیا۔",
                "اس کی وجہ دوسری احادیث میں یہ بیان ہوئی ہے کہ گھروں میں عورتیں اور معصوم بچے تھے جن پر جمعہ اور جماعت فرض نہیں ہے۔",
                "اللہ کی شریعت میں ایک کی غلطی کی سزا دوسرے کو نہیں دی جاتی۔"
              ],
              "english": [
                "The Prophet (ﷺ) only expressed intent, he did not execute it.",
                "The reason stated in other Hadiths is that houses contained women and children upon whom congregation is not obligatory.",
                "In Allah's law, one is not punished for the sins of another."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دنیاوی لالچ کی مذمت",
        "english": "Condemnation of Worldly Greed"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہڈی اور پائے کی مثال",
              "english": "Example of Bone and Hoofs"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ان لوگوں کی پست سوچ کو بے نقاب کیا کہ انہیں دنیا کی حقیر چیز (ہڈی) تو کھینچ لاتی ہے، مگر آخرت کا عظیم ثواب نہیں۔",
                "یہ ان کے ایمان کی کمزوری اور نفاق کی علامت ہے۔",
                "عشاء کی نماز کا ذکر خاص طور پر کیا گیا کیونکہ یہ اندھیرے کا وقت تھا اور منافقین کے لیے بھاری تھی۔"
              ],
              "english": [
                "The Prophet (ﷺ) exposed their low mentality: a trivial worldly thing (bone) attracts them, but immense reward of Hereafter does not.",
                "This is a sign of weak faith and hypocrisy.",
                "Isha prayer is specifically mentioned as it was in darkness and burdensome for hypocrites."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترجیحات کا تعین",
              "english": "Setting Priorities"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ آخرت کے فائدے کو دنیا کے فائدے پر ترجیح دے۔",
                "اگر دنیاوی مجلس کے لیے وقت نکل سکتا ہے تو رب کے دربار کے لیے کیوں نہیں؟"
              ],
              "english": [
                "A Muslim should prioritize the benefit of the Hereafter over worldly gain.",
                "If time can be found for worldly gatherings, why not for the Court of the Lord?"
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عشاء اور فجر کا اہتمام",
              "english": "Care for Isha and Fajr"
            },
            "content": {
              "urdu": [
                "منافقین پر عشاء اور فجر سب سے بھاری ہوتی تھیں۔",
                "مومن کو ان دو نمازوں کی جماعت کا خاص اہتمام کرنا چاہیے تاکہ نفاق سے بری ہو سکے۔",
                "جو ان دو نمازوں میں حاضر ہو، باقی نمازوں میں تو بدرجہ اولیٰ حاضر ہوگا۔"
              ],
              "english": [
                "Isha and Fajr were the heaviest for hypocrites.",
                "A believer should take special care of these two in congregation to be free from hypocrisy.",
                "One who attends these two will surely attend the others."
              ]
            }
          },
          {
            "title": {
              "urdu": "لیڈرشپ کی ذمہ داری",
              "english": "Leadership Responsibility"
            },
            "content": {
              "urdu": [
                "امام یا حاکم کو چاہیے کہ وہ لوگوں کے اعمال کا جائزہ لے۔",
                "غفلت برتنے والوں کو تنبیہ کرنا اور ڈرانا سنتِ نبوی ہے۔",
                "معاشرے میں نماز کا نظام قائم کرنا حکومت اور کمیونٹی کی ذمہ داری ہے۔"
              ],
              "english": [
                "The Imam or leader should monitor the people's actions.",
                "Warning and admonishing the negligent is a Prophetic Sunnah.",
                "Establishing the system of Salah is the responsibility of the state and community."
              ]
            }
          }
        ]
      }
    }
  ]
}
