{
  "hadithId": 838,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/15"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (1421)، وأبو داود (2100)، والنسائي (6/84)، وابن حبان (1241)، وأصله في البخاري.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام مسلم (1421) نے روایت کیا ہے، نیز الفاظ کے معمولی فرق کے ساتھ ابو داؤد (2100) اور نسائی میں بھی موجود ہے۔ ابن حبان نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Recorded by Muslim (1421), Abu Dawud (2100), An-Nasa'i (6/84), and Ibn Hibban (1241). The core meaning is also supported by Al-Bukhari."
  },
  "importantWords": [
    {
      "arabic": "الثَّيِّبُ",
      "english": "Non-virgin / Previously married",
      "urdu": "بیوہ یا مطلقہ / شوہر دیدہ"
    },
    {
      "arabic": "أَحَقُّ",
      "english": "Has more right",
      "urdu": "زیادہ حق دار"
    },
    {
      "arabic": "الْبِكْرُ",
      "english": "Virgin",
      "urdu": "کنواری لڑکی"
    },
    {
      "arabic": "تُسْتَأْمَرُ",
      "english": "Her consent must be sought",
      "urdu": "اس سے حکم / اجازت لی جائے"
    },
    {
      "arabic": "سُكُوتُهَا",
      "english": "Her silence",
      "urdu": "اس کی خاموشی"
    },
    {
      "arabic": "الْيَتِيمَةُ",
      "english": "Orphan girl",
      "urdu": "یتیم بچی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں عورت کی مرضی اور اجازت کی اہمیت بیان کی گئی ہے، بیوہ یا مطلقہ عورت خود فیصلہ کرے گی جبکہ کنواری لڑکی کی خاموشی کو اس کی رضا مندی سمجھا جائے گا۔",
    "english": "This Hadith emphasizes the importance of a woman's consent in marriage, stating that a non-virgin makes her own choice while a virgin's silence is taken as her permission."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤٢١",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1421"
    },
    {
      "arabic": "سنن أبي داود، كتاب النكاح، رقم الحديث ٢١٠٠",
      "english": "Sunan Abi Dawud, Book of Marriage, Hadith No. 2100"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqGjI2Y8HLo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواتین کی مرضی اور اسلام",
        "english": "Women's Consent and Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبردستی کے نکاح کی نفی",
              "english": "Rejection of Forced Marriage"
            },
            "content": {
              "urdu": [
                "اسلام نے نکاح کے معاملے میں عورت کی پسند اور ناپسند کو بنیادی اہمیت دی ہے۔",
                "کسی بھی عورت پر اس کی مرضی کے خلاف نکاح مسلط کرنا شرعی طور پر ناجائز ہے۔",
                "یہ حکم عورت کو معاشرتی تحفظ اور جذباتی اطمینان فراہم کرتا ہے۔"
              ],
              "english": [
                "Islam gives fundamental importance to a woman's choice and preference in marriage.",
                "Imposing a marriage on any woman against her will is religiously impermissible.",
                "This ruling provides women with social protection and emotional security."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیوہ اور مطلقہ کا حق",
              "english": "Rights of the Previously Married"
            },
            "content": {
              "urdu": [
                "ثیبہ (بیوہ یا مطلقہ) عورت زندگی کے تجربات کی بنا پر اپنے فیصلے کی خود مالک ہے۔",
                "ولی اس پر اپنا فیصلہ مسلط نہیں کر سکتا بلکہ اسے صریح اجازت دینی ہوگی۔",
                "اس کا مقصد یہ ہے کہ وہ اپنی زندگی کا نیا آغاز اپنی مرضی سے کر سکے۔"
              ],
              "english": [
                "A non-virgin (widow/divorcee) is the primary decision-maker due to her life experience.",
                "The guardian cannot impose a choice on her; she must give explicit verbal consent.",
                "The aim is to allow her to start a new chapter of life according to her own will."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کنواری لڑکی کی اجازت کا طریقہ",
        "english": "Method of Consent for Virgins"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاموشی بطور اجازت",
              "english": "Silence as Consent"
            },
            "content": {
              "urdu": [
                "کنواری لڑکی اکثر شرم و حیا کی وجہ سے زبان سے ہاں نہیں کہہ پاتی۔",
                "شریعت نے اس کی فطری حیا کا لحاظ رکھتے ہوئے اس کی خاموشی کو اجازت مانا ہے۔",
                "اگر وہ خاموش رہے تو اسے رضامندی سمجھا جائے گا، مگر انکار کی صورت میں نکاح نہیں ہوگا۔"
              ],
              "english": [
                "A virgin girl often feels shy or hesitant to explicitly say 'yes' due to modesty.",
                "Shariah respects her natural modesty by interpreting her silence as agreement.",
                "While silence is approval, an explicit refusal means the marriage cannot proceed."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور شرع کا توازن",
              "english": "Balance of Modesty and Law"
            },
            "content": {
              "urdu": [
                "اسلام نے حیا کو ایمان کا حصہ قرار دیا ہے اور نکاح میں بھی اس کا پاس رکھا ہے۔",
                "لڑکی سے اجازت طلب کرنا واجب ہے تاکہ اس کے حقوق پامال نہ ہوں۔",
                "یہ توازن خاندانی نظام کو مضبوط اور خوشگوار بنانے کے لیے ضروری ہے۔"
              ],
              "english": [
                "Islam considers modesty part of faith and upholds it even during marriage proposals.",
                "Seeking the girl's permission is obligatory to ensure her rights are not violated.",
                "This balance is essential for making the family system strong and harmonious."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "یتیم بچیوں کے حقوق",
        "english": "Rights of Orphan Girls"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یتیم کی سرپرستی اور مشورہ",
              "english": "Guardianship and Consultation"
            },
            "content": {
              "urdu": [
                "یتیم بچیوں کے معاملے میں ولی کو زیادہ احتیاط اور نرمی برتنے کا حکم ہے۔",
                "بغیر مشورے اور مرضی کے یتیم بچی کا نکاح کرنا ظلم کے زمرے میں آتا ہے۔",
                "نبی ﷺ نے یتیموں کے حقوق کی حفاظت پر خاص زور دیا ہے۔"
              ],
              "english": [
                "Guardians of orphan girls are commanded to exercise extra caution and kindness.",
                "Marrying off an orphan girl without consultation or her consent is considered oppression.",
                "The Prophet (ﷺ) placed special emphasis on protecting the rights of orphans."
              ]
            }
          },
          {
            "title": {
              "urdu": "ولی کی ذمہ داری",
              "english": "Responsibility of the Guardian"
            },
            "content": {
              "urdu": [
                "ولی کا کام صرف نکاح کروانا نہیں بلکہ لڑکی کے مفاد کا تحفظ کرنا بھی ہے۔",
                "اگر ولی لڑکی کی مرضی کے خلاف نکاح کرے تو وہ گناہگار ٹھہرے گا۔",
                "اسلامی معاشرے میں ولی ایک محافظ ہے، کوئی آمر یا ڈکٹیٹر نہیں۔"
              ],
              "english": [
                "The guardian's job is not just to marry her off, but to protect her best interests.",
                "If a guardian marries her against her will, he becomes sinful in the eyes of Allah.",
                "In an Islamic society, the guardian is a protector, not an oppressor or dictator."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح اور اثرات",
        "english": "Social Reform and Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوشگوار ازدواجی زندگی",
              "english": "Happy Marital Life"
            },
            "content": {
              "urdu": [
                "جس رشتے کی بنیاد مرضی اور محبت پر ہو، وہ زیادہ پائیدار ثابت ہوتا ہے۔",
                "مرضی کے خلاف نکاح اکثر گھریلو جھگڑوں اور طلاق پر ختم ہوتے ہیں۔",
                "نبی ﷺ کی یہ تعلیمات خاندان کے استحکام کی ضامن ہیں۔"
              ],
              "english": [
                "A relationship built on consent and mutual liking is more likely to endure.",
                "Forced marriages often result in domestic disputes and eventual divorce.",
                "These teachings of the Prophet (ﷺ) are the guarantee of family stability."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کا وقار",
              "english": "Dignity of the Woman"
            },
            "content": {
              "urdu": [
                "اسلام نے عورت کو وہ مقام دیا کہ وہ اپنے سب سے بڑے فیصلے میں خود مختار ہے۔",
                "جاہلی رسم و رواج جہاں عورت کو جائیداد سمجھا جاتا تھا، اسلام نے اسے ختم کیا۔",
                "ایک مومن کو چاہیے کہ وہ اپنی بیٹیوں اور بہنوں کے حقوق کا پاسداری کرے۔"
              ],
              "english": [
                "Islam elevated women by making them independent in their most significant life decision.",
                "Islam abolished pre-Islamic customs where women were treated like mere property.",
                "A believer must uphold the rights of his daughters and sisters as prescribed."
              ]
            }
          }
        ]
      }
    }
  ]
}