{
  "hadithId": 1194,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/7"],
    "kitabId": 14,
    "inKitabBab": 1,
    "arabicBook": "كتاب القضاء",
    "babId": 97
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (7169)، ومسلم (1713)، وأحمد (26528)، وأبو داود (3583).",
    "urdu": "صحیح۔ اسے بخاری (7169) اور مسلم (1713) نے روایت کیا ہے۔ اس میں یہ اضافہ بھی ہے کہ 'میں تو بس ایک انسان ہوں'۔",
    "english": "Sahih. Reported by Al-Bukhari (7169) and Muslim (1713). The version in Bukhari starts with 'I am only a human being'."
  },
  "importantWords": [
    {
      "arabic": "تَخْتَصِمُونَ",
      "english": "Dispute / Litigate",
      "urdu": "تم جھگڑا لے کر آتے ہو"
    },
    {
      "arabic": "أَلْحَنَ",
      "english": "More eloquent / Persuasive",
      "urdu": "زیادہ چرب زبان / دلائل میں ماہر"
    },
    {
      "arabic": "بِحُجَّتِهِ",
      "english": "With his plea / Argument",
      "urdu": "اپنے دلائل کے ساتھ"
    },
    {
      "arabic": "أَقْضِيَ",
      "english": "I judge",
      "urdu": "میں فیصلہ کرتا ہوں"
    },
    {
      "arabic": "قِطْعَةً",
      "english": "A piece / Portion",
      "urdu": "ایک ٹکڑا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ قاضی کا فیصلہ ظاہر پر ہوتا ہے، اگر کوئی جھوٹے دلائل سے فیصلہ اپنے حق میں کروا لے تو وہ چیز اس کے لیے حلال نہیں ہوگی بلکہ وہ جہنم کا ایندھن بنے گی۔",
    "english": "This Hadith clarifies that a judge's decision is based on apparent evidence. If someone wins a case through false eloquence, the acquired property remains haram and is a piece of Hellfire."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأحكام، باب موعظة الإمام للخصوم، رقم 7169",
      "english": "Sahih al-Bukhari, Book of Judgments, Chapter: The Imam's exhortation to the litigants, No. 7169"
    },
    {
      "arabic": "صحيح مسلم، كتاب الأقضية، باب الحكم بالظاهر، رقم 1713",
      "english": "Sahih Muslim, Book of Judicial Decisions, Chapter: Judging by the Apparent, No. 1713"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة هند بنت أبي أمية",
        "english": "Umm Salama Hind bint Abi Umayya"
      },
      "slug": "umm-salama"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S8p7ySj9j4s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انسانی بشریت اور عدالتی فیصلہ",
        "english": "Human Nature and Judicial Verdicts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی بشریت",
              "english": "The Prophet's (ﷺ) Humanity"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے واضح فرمایا کہ بطور قاضی وہ ظاہری دلائل اور بیانات کی بنیاد پر فیصلہ فرماتے ہیں۔",
                "آپ ﷺ نے اپنی بشریت کا ذکر کر کے امت کو بتایا کہ قاضی غیب کا علم نہیں رکھتا۔",
                "یہ اصول قیامت تک کے قاضیوں کے لیے ایک قانونی ضابطہ ہے کہ وہ شواہد کے پابند ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that as a judge, he decides based on apparent evidence and statements.",
                "By mentioning his humanity, he taught the Ummah that a judge does not possess knowledge of the unseen.",
                "This principle serves as a legal code for judges until the Day of Judgment to follow evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "چرب زبانی اور دھوکہ دہی",
              "english": "Eloquence and Deception"
            },
            "content": {
              "urdu": [
                "کچھ لوگ اپنی گفتگو میں اتنے ماہر ہوتے ہیں کہ باطل کو حق ثابت کر دیتے ہیں۔",
                "محض الفاظ کی جادوگری سے عدالت کو گمراہ کرنا ایک سنگین جرم اور گناہ ہے۔",
                "حقیقت وہی رہتی ہے جو اللہ کے علم میں ہے، چاہے دنیاوی عدالت کچھ بھی کہے۔"
              ],
              "english": [
                "Some people are so skilled in speech that they can present falsehood as the truth.",
                "Misleading the court merely through the magic of words is a serious crime and sin.",
                "The reality remains what is in Allah's knowledge, regardless of what a worldly court decrees."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فیصلہ اور حلت و حرمت",
        "english": "Verdict and Lawfulness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاضی کا فیصلہ حرام کو حلال نہیں کرتا",
              "english": "A Judge's Verdict Does Not Make Haram Halal"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص جھوٹ بول کر زمین یا مال جیت لے، تو وہ شرعی طور پر اس کا مالک نہیں بنتا۔",
                "عدالتی ڈگری سے وہ مال حلال نہیں ہو جاتا جو درحقیقت کسی دوسرے کا حق تھا۔",
                "انسان کو اپنی آخرت کی فکر کرنی چاہیے نہ کہ دنیاوی فائدے کے لیے باطل کا سہارا لینا چاہیے۔"
              ],
              "english": [
                "If a person wins land or wealth through lying, they do not become its rightful owner Islamically.",
                "A court decree does not make property lawful (Halal) if it actually belongs to someone else.",
                "A person should worry about their Hereafter rather than using falsehood for worldly gain."
              ]
            }
          },
          {
            "title": {
              "urdu": "آگ کا ٹکڑا",
              "english": "A Piece of Hellfire"
            },
            "content": {
              "urdu": [
                "ناحق مال حاصل کرنا درحقیقت اپنے پیٹ کو جہنم کی آگ سے بھرنے کے مترادف ہے۔",
                "رسول اللہ ﷺ نے اس کے انجام کو 'آگ کا ٹکڑا' کہہ کر انتہائی سخت تنبیہ فرمائی ہے۔",
                "جو شخص یہ مال لیتا ہے، وہ گویا اپنے لیے عذابِ الہی کو دعوت دے رہا ہوتا ہے۔"
              ],
              "english": [
                "Acquiring property unjustly is equivalent to filling one's belly with the fire of Hell.",
                "The Messenger (ﷺ) gave a stern warning by describing its end result as a 'piece of fire'.",
                "Whoever takes this wealth is essentially inviting Divine punishment upon themselves."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی اخلاقیات",
        "english": "Judicial Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظاہری ثبوتوں پر فیصلہ",
              "english": "Judging by Apparent Proofs"
            },
            "content": {
              "urdu": [
                "اسلامی قانون کے مطابق قاضی صرف گواہوں اور حلف کی بنیاد پر فیصلہ کرنے کا مکلف ہے۔",
                "اگر گواہ جھوٹے ہوں تو گناہ گواہ اور اس فریق پر ہوگا جس نے انہیں پیش کیا۔",
                "قاضی کو غیب کے پیچھے پڑنے یا الہام پر فیصلہ کرنے کی اجازت نہیں ہے۔"
              ],
              "english": [
                "According to Islamic law, a judge is only obliged to decide based on witnesses and oaths.",
                "If witnesses lie, the sin lies on them and the party that presented them.",
                "A judge is not permitted to chase after the unseen or base verdicts on mere inspiration."
              ]
            }
          },
          {
            "title": {
              "urdu": "فریقین کی ذمہ داری",
              "english": "Responsibility of the Litigants"
            },
            "content": {
              "urdu": [
                "عدالت میں پیش ہونے والے ہر مسلمان پر لازم ہے کہ وہ صرف سچائی بیان کرے۔",
                "وکیلوں کی ذمہ داری ہے کہ وہ جانتے بوجھتے ہوئے باطل کیس کی پیروی نہ کریں۔",
                "حق کا چھپانا یا باطل کو خوبصورت بنا کر پیش کرنا منافقت کی نشانی ہے۔"
              ],
              "english": [
                "Every Muslim appearing in court is obligated to speak nothing but the truth.",
                "Lawyers have a responsibility not to pursue a case they know to be false.",
                "Hiding the truth or beautifying falsehood is a sign of hypocrisy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آخرت کا خوف اور تقویٰ",
        "english": "Fear of the Hereafter and Piety"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی عدالت سب سے بڑی ہے",
              "english": "Allah's Court is the Greatest"
            },
            "content": {
              "urdu": [
                "اگر کوئی دنیا کی عدالت سے بچ بھی جائے تو اللہ کی گرفت سے نہیں بچ سکتا۔",
                "روزِ قیامت ہر چھوٹی بڑی چیز کا حساب ہوگا اور حقدار کو اس کا حق دلایا جائے گا۔",
                "تقویٰ کا تقاضا ہے کہ انسان دوسرے کے حق پر نظر ڈالنے سے بھی ڈرے۔"
              ],
              "english": [
                "If someone escapes a worldly court, they cannot escape the grasp of Allah.",
                "On the Day of Judgment, everything will be accounted for, and the rightful will get their due.",
                "Piety requires that a person fears even looking at the rights of others with greed."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی امن کا قیام",
              "english": "Establishing Social Peace"
            },
            "content": {
              "urdu": [
                "جب لوگ دوسروں کے حقوق کا احترام کریں گے تو معاشرے سے جھگڑے ختم ہوں گے۔",
                "اس حدیث کا مقصد لوگوں کے دلوں میں دیانتداری اور سچائی کا جذبہ پیدا کرنا ہے۔",
                "انصاف کی فراہمی صرف جج کا کام نہیں بلکہ معاشرے کے ہر فرد کی اخلاقی ذمہ داری ہے۔"
              ],
              "english": [
                "When people respect the rights of others, disputes will vanish from society.",
                "The purpose of this Hadith is to instill a spirit of honesty and truthfulness in hearts.",
                "Providing justice is not just the judge's job but the moral responsibility of every individual."
              ]
            }
          }
        ]
      }
    }
  ]
}