{
  "hadithId": 486,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1591"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أحمد (6730)، وأبو داود (1591). والحديث يوضح التيسير على أرباب الأموال في جباية الزكاة، فلا يكلفون مشقة جلبها إلى الإمام.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام احمد (6730) اور ابوداؤد (1591) نے روایت کیا ہے۔ یہ حدیث مالداروں پر آسانی پیدا کرنے کے بارے میں ہے تاکہ انہیں زکوٰۃ کا مال حاکم تک پہنچانے کی مشقت نہ اٹھانی پڑے۔",
    "english": "Hasan (Good). Reported by Ahmad (6730) and Abu Dawud (1591). This Hadith highlights the ease provided to wealth owners in collecting Zakat, so they are not burdened with transporting it to the leader/authority."
  },
  "importantWords": [
    {
      "arabic": "تُؤْخَذُ",
      "english": "Collected / Taken",
      "urdu": "وصول کی جائے گی"
    },
    {
      "arabic": "صَدَقَاتُ",
      "english": "Zakat / Charities",
      "urdu": "صدقات / زکوٰۃ"
    },
    {
      "arabic": "مِيَاهِهِمْ",
      "english": "Their waters / Watering places",
      "urdu": "ان کے پانی (گھاٹ)"
    },
    {
      "arabic": "دُورِهِمْ",
      "english": "Their dwellings / Homes",
      "urdu": "ان کے گھروں / ٹھکانوں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مفہوم یہ ہے کہ زکوٰۃ کے عاملین کو چاہیے کہ وہ خود مالداروں کے علاقوں یا ان کے پانی کے مقامات پر جا کر زکوٰۃ وصول کریں، نہ کہ مالداروں کو مال لے کر دور دراز سفر کرنے پر مجبور کیا جائے۔",
    "english": "The essence of this Hadith is that Zakat collectors should visit the owners at their locations or watering places to collect Zakat, rather than forcing owners to travel long distances with their livestock."
  },
  "references": [
    {
      "arabic": "مسند أحمد (6730)",
      "english": "Musnad Ahmad (6730)"
    },
    {
      "arabic": "سنن أبي داود (1591)",
      "english": "Sunan Abu Dawud (1591)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_rOun7K5bY",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ وصول کرنے کا مسنون طریقہ",
        "english": "Sunnah Method of Collecting Zakat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالداروں کے لیے آسانی",
              "english": "Ease for the Wealthy"
            },
            "content": {
              "urdu": [
                "اسلام نے زکوٰۃ کی ادائیگی میں مالداروں پر غیر ضروری بوجھ نہیں ڈالا۔",
                "عاملین کو حکم ہے کہ وہ خود وہاں جائیں جہاں جانور چرنے کے لیے یا پانی پینے کے لیے جمع ہوتے ہیں۔",
                "پانی کے گھاٹ (میاہ) وہ مقامات ہیں جہاں جانوروں کو گننا اور زکوٰۃ نکالنا آسان ہوتا ہے۔"
              ],
              "english": [
                "Islam does not impose unnecessary burdens on wealth owners during Zakat payment.",
                "Collectors are commanded to go where the livestock gather for grazing or water.",
                "Watering places (Miyah) are ideal spots for counting animals and extracting Zakat easily."
              ]
            }
          },
          {
            "title": {
              "urdu": "جلب اور جنب کی ممانعت",
              "english": "Prohibition of 'Jalab' and 'Janab'"
            },
            "content": {
              "urdu": [
                "دوسری روایات میں 'لا جلب ولا جنب' کے الفاظ آئے ہیں، جس کا مطلب ہے کہ مال کو زبردستی دور نہ لے جایا جائے۔",
                "مالک کو زکوٰۃ دینے کے لیے شہروں یا سرکاری دفاتر کے چکر لگانے کی ضرورت نہیں۔",
                "یہ اصول اسلامی حکومت کی طرف سے عوام کے لیے خیر خواہی کی علامت ہے۔"
              ],
              "english": [
                "Other narrations mention 'No Jalab and no Janab,' meaning livestock shouldn't be forcibly moved far.",
                "Owners are not required to travel to cities or government offices to pay Zakat.",
                "This principle signifies the Islamic government's goodwill towards its citizens."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مقامِ وصولی کی حکمت",
        "english": "Wisdom of the Collection Point"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھروں یا بستیوں میں وصولی",
              "english": "Collection at Dwellings"
            },
            "content": {
              "urdu": [
                "ابوداؤد کی روایت 'دورہم' (ان کے گھروں) سے مراد ان کی مستقل رہائش گاہیں یا خیمے ہیں۔",
                "اس کا مقصد یہ ہے کہ مالک کو اپنے مال کی حفاظت میں تنگی نہ آئے۔",
                "جانوروں کو دور دراز لے جانے سے ان کے بیمار ہونے یا ہلاک ہونے کا خطرہ ہوتا ہے۔"
              ],
              "english": [
                "The narration in Abu Dawud 'Durihim' (their dwellings) refers to permanent residences or camps.",
                "The goal is to ensure the owner faces no difficulty in protecting their property.",
                "Moving livestock long distances increases the risk of illness or death of the animals."
              ]
            }
          },
          {
            "title": {
              "urdu": "شفافیت اور عدل",
              "english": "Transparency and Justice"
            },
            "content": {
              "urdu": [
                "مالک کی موجودگی میں اس کے ٹھکانے پر زکوٰۃ وصول کرنے سے تنازعات کا اندیشہ کم ہوتا ہے۔",
                "عامل اور مالک دونوں کے سامنے مال کی حقیقت واضح رہتی ہے۔",
                "یہ نظام معاشرے میں اعتماد اور معاشی ہم آہنگی پیدا کرتا ہے۔"
              ],
              "english": [
                "Collecting Zakat at the owner's place in their presence minimizes the risk of disputes.",
                "The true status of the property remains clear to both the collector and the owner.",
                "This system builds trust and economic harmony within the society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عاملینِ زکوٰۃ کے لیے ہدایات",
        "english": "Instructions for Zakat Collectors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوش اخلاقی اور نرمی",
              "english": "Kindness and Good Conduct"
            },
            "content": {
              "urdu": [
                "عاملین کو چاہیے کہ وہ لوگوں کے بہترین مال کے پیچھے نہ پڑیں بلکہ درمیانہ مال لیں۔",
                "وصولی کے وقت سختی کے بجائے دعائیہ کلمات اور شفقت کا مظاہرہ کرنا چاہیے۔",
                "نبی ﷺ نے عاملین کو مظلوم کی بددعا سے بچنے کی تاکید فرمائی ہے۔"
              ],
              "english": [
                "Collectors should not chase after the most precious assets but take average quality.",
                "Instead of harshness, they should display compassion and offer prayers for the owner.",
                "The Prophet (ﷺ) urged collectors to fear the supplication of the oppressed."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی اہمیت",
              "english": "Importance of Discipline"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست کا فرض ہے کہ وہ زکوٰۃ کی وصولی کے لیے باقاعدہ اہلکار مقرر کرے۔",
                "ان اہلکاروں کی تنخواہیں بھی زکوٰۃ کے مال سے ہی ادا کی جا سکتی ہیں۔",
                "ایک منظم نظام ہی زکوٰۃ کے اصل ثمرات مستحقین تک پہنچا سکتا ہے۔"
              ],
              "english": [
                "It is the Islamic state's duty to appoint formal officials for Zakat collection.",
                "The salaries of these officials can be paid from the Zakat funds themselves.",
                "Only an organized system can deliver the true benefits of Zakat to the needy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور میں اطلاق",
        "english": "Modern Day Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سہولت اور ٹیکنالوجی",
              "english": "Convenience and Technology"
            },
            "content": {
              "urdu": [
                "جدید دور میں بینکوں اور آن لائن ذرائع سے زکوٰۃ کی ادائیگی اسی 'آسانی' کے اصول پر مبنی ہے۔",
                "حکومت کو چاہیے کہ زکوٰۃ کی وصولی کے لیے شہریوں کو کم سے کم مشقت میں ڈالے۔",
                "لوگوں کے لیے زکوٰۃ دینا جتنا آسان ہوگا، ادائیگی کی شرح اتنی ہی زیادہ ہوگی۔"
              ],
              "english": [
                "In the modern era, paying Zakat via banks or online means aligns with the principle of 'ease'.",
                "The government should minimize the effort required by citizens for Zakat collection.",
                "The easier it is for people to pay Zakat, the higher the rate of compliance will be."
              ]
            }
          },
          {
            "title": {
              "urdu": "روحانی فائدہ",
              "english": "Spiritual Benefit"
            },
            "content": {
              "urdu": [
                "زکوٰۃ صرف ایک ٹیکس نہیں بلکہ ایک عظیم مالی عبادت ہے۔",
                "جب عامل خود چل کر آتا ہے تو یہ ریاست کی طرف سے رعایا کی خدمت کا احساس دلاتا ہے۔",
                "یہ نظام معاشرے میں مالدار اور غریب کے درمیان نفرت کو ختم کرتا ہے۔"
              ],
              "english": [
                "Zakat is not merely a tax but a significant financial act of worship.",
                "When the collector visits personally, it fosters a sense of service from the state to the people.",
                "This system eliminates resentment between the rich and the poor in society."
              ]
            }
          }
        ]
      }
    }
  ]
}