{
  "hadithId": 212,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم في كتاب صلاة المسافرين وقصرها، باب الدعاء في صلاة الليل وقيامه (771). أما الدعاء بتمامه فقد رواه مسلم في هذا الموضع. ووردت روايات صحيحة أخرى كأبي داود (760) و ابن حبان (1771) تدل على جواز قوله في الصلوات المكتوبة أيضاً، خلافاً لما قد يفهم من تخصيص مسلم.",
    "urdu": "صحیح۔ اسے مسلم نے کتاب صلاة المسافرین وقصرھا، باب الدعاء فی صلاة اللیل و قیامہ (771) میں روایت کیا ہے۔ یہ دعا مکمل طور پر مسلم کی اسی روایت میں موجود ہے۔ دیگر صحیح روایات جیسے ابوداؤد (760) اور ابن حبان (1771) سے یہ بھی ثابت ہوتا ہے کہ اس دعا کو فرض نمازوں میں بھی پڑھا جا سکتا ہے، برخلاف اس کے جو مسلم کے تخصیص سے سمجھا جا سکتا ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim in the Book of Traveler's Prayer and Shortening it, Chapter: Supplication in the night prayer and Qiyām (771). The full supplication is present in this narration by Muslim. Other authentic narrations, such as Abu Dawud (760) and Ibn Hibban (1771), also indicate its permissibility in obligatory prayers, contradicting the possible inference that it is exclusive to the night prayer."
  },
  "importantWords": [
    {
      "arabic": "وجهت وجهي",
      "english": "I have turned my face",
      "urdu": "میں نے اپنا رُخ متوجہ کیا"
    },
    {
      "arabic": "فَطَرَ السَّمَوَاتِ",
      "english": "Who originated the heavens",
      "urdu": "جس نے آسمانوں کو پیدا کیا"
    },
    {
      "arabic": "حَنِيفًا",
      "english": "Upright/Inclining towards truth",
      "urdu": "یکسو ہو کر/اللہ کی طرف مائل ہو کر"
    },
    {
      "arabic": "نُسُكِي",
      "english": "My sacrifice/worship",
      "urdu": "میری قربانی/عبادت"
    },
    {
      "arabic": "أَنْتَ الْمَلِكُ",
      "english": "You are the King",
      "urdu": "تو ہی بادشاہ ہے"
    },
    {
      "arabic": "أَنْتَ رَبِّي وَأَنَا عَبْدُكَ",
      "english": "You are my Lord and I am Your servant",
      "urdu": "تو میرا رب اور میں تیرا بندہ ہوں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث دعاء الاستفتاح (نماز شروع کرنے کی دعا) کو بیان کرتی ہے، جس میں بندہ اللہ کی تعریف، توحید کا اقرار، اپنے اعمال کی اللہ کے لیے خالص ہونے کا اعلان، اور اپنے گناہوں کا اعتراف کرتا ہے۔ یہ دعا نماز کے آغاز میں، تکبیر تحریمہ کے بعد اور قراءت سے پہلے پڑھی جاتی ہے، اور اس کا مقصد قلب کو مکمل طور پر اللہ کی طرف متوجہ کرنا اور اخلاص کو بڑھانا ہے۔",
    "english": "This Hadith details the 'Du'a Al-Istiftāḥ' (Opening Supplication of the Prayer), in which the servant praises Allah, affirms Tawheed (Monotheism), declares the sincerity of his deeds for Allah, and confesses his sins. This supplication is recited at the beginning of the prayer, after the Takbirat Al-Ihram and before the recitation, aiming to fully orient the heart towards Allah and increase sincerity."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب صلاة المسافرين وقصرها، باب الدعاء في صلاة الليل وقيامه (771)",
      "english": "Sahih Muslim, Book of Traveler's Prayer and Shortening it, Chapter: Supplication in the night prayer and Qiyām (771)"
    },
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب من رأى أن يجهر بها (760)",
      "english": "Sunan Abu Dawud, Book of Prayer, Chapter: The one who advocated reciting it loudly (760)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "'Ali ibn Abi Talib"
      },
      "slug": "ali-ibn-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعاء الاستفتاح کا محل",
        "english": "The Place of Du'a Al-Istiftāḥ"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت اور مقصد",
              "english": "Time and Purpose"
            },
            "content": {
              "urdu": [
                "دعاء الاستفتاح (نماز کھولنے کی دعا) تکبیر تحریمہ کے بعد اور سورۃ فاتحہ سے پہلے پڑھی جاتی ہے۔",
                "اس دعا کا مقصد قراءت شروع کرنے سے پہلے دل کو اللہ کی عظمت اور بڑائی کی طرف متوجہ کرنا ہے۔",
                "یہ دعا نماز میں خشوع، یکسوئی اور باطنی طہارت کے حصول کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Du'a Al-Istiftāḥ is recited after Takbirat Al-Ihram and before Surah Al-Fatihah.",
                "The purpose of this supplication is to turn the heart towards Allah's Greatness and Majesty before beginning the recitation.",
                "It is an excellent means of achieving Khushu', concentration, and inner purity in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرض اور نفل نماز",
              "english": "Obligatory and Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "مسلم کی بعض روایات سے یہ دعا نمازِ تہجد سے خاص معلوم ہوتی ہے، جو اس کی فضیلت کو ظاہر کرتا ہے۔",
                "جبکہ دیگر صحیح روایات، جیسے ابو داؤد کی 'صلاة المكتوبة' (فرض نماز) کا ذکر، اس کے عموم پر دلالت کرتی ہیں۔",
                "لہذا، تمام نمازوں (فرض اور نفل) میں یہ دعا پڑھنا سنت ہے، اگرچہ تہجد میں زیادہ زور دیا گیا ہے۔"
              ],
              "english": [
                "Some narrations in Muslim link this supplication specifically to Tahajjud (night prayer), highlighting its virtue therein.",
                "However, other authentic narrations, such as Abu Dawud's mention of 'Al-Salāt Al-Maktūbah' (obligatory prayer), indicate its general permissibility.",
                "Thus, reciting this Du'a in all prayers (obligatory and voluntary) is Sunnah, although emphasized more in Tahajjud."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کے بنیادی مضامین",
        "english": "Core Themes of the Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توحید اور اخلاص کا اقرار",
              "english": "Affirmation of Tawheed and Sincerity"
            },
            "content": {
              "urdu": [
                "دعا کا آغاز اللہ کی وحدانیت اور خالقِ کائنات ہونے کے اقرار سے ہوتا ہے۔",
                "نمازی یہ اعلان کرتا ہے کہ اس کی تمام عبادات، زندگی اور موت صرف اللہ رب العالمین کے لیے ہیں۔",
                "یہ جملے نماز میں بندے کے ایمان اور شرک سے دوری کے عزم کو مضبوط کرتے ہیں۔"
              ],
              "english": [
                "The supplication begins with the affirmation of Allah's Oneness and His status as the Originator of the universe.",
                "The worshipper declares that all their worship, life, and death are dedicated solely to Allah, the Lord of the Worlds.",
                "These phrases strengthen the worshipper's faith and commitment to abstain from polytheism in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہوں کا اعتراف اور مغفرت کی طلب",
              "english": "Confession of Sins and Seeking Forgiveness"
            },
            "content": {
              "urdu": [
                "دعا میں 'ظلمت نفسی واعترفت بذنبي' (میں نے اپنی جان پر ظلم کیا اور اپنے گناہ کا اعتراف کیا) کا اعتراف ہے۔",
                "یہ عاجزی اور انکساری کی حالت ہے جس میں بندہ اللہ سے تمام گناہوں کی مغفرت طلب کرتا ہے۔",
                "گناہوں سے پاکی اور مغفرت کی طلب کے بعد ہی قراءت شروع کرنا مناسب ہے۔"
              ],
              "english": [
                "The supplication includes the confession: 'Ẓalamtu nafsī wa'taraftu bidhanbī' (I have wronged myself and confessed my sin).",
                "This is a state of humility where the servant asks Allah for forgiveness for all their sins.",
                "It is appropriate to begin the recitation only after seeking purification and forgiveness from sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاق اور روحانی ترقی",
        "english": "Ethics and Spiritual Progress"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احسن اخلاق کی رہنمائی",
              "english": "Guidance to the Best of Manners"
            },
            "content": {
              "urdu": [
                "نمازی اللہ سے بہترین اخلاق کی رہنمائی اور برے اخلاق سے پناہ طلب کرتا ہے۔",
                "اس سے ظاہر ہوتا ہے کہ نماز صرف ظاہری عبادات نہیں بلکہ اخلاق کی تعمیر کا ذریعہ بھی ہے۔",
                "اخلاق کا حسن اللہ کی طرف سے ہدایت کے بغیر ممکن نہیں ہے، اس لیے بندہ اللہ سے مدد مانگتا ہے۔"
              ],
              "english": [
                "The worshipper seeks guidance to the best of manners and protection from evil manners from Allah.",
                "This indicates that prayer is not merely outward worship but also a means of character building.",
                "Excellence in character is impossible without guidance from Allah, so the servant seeks help from Him."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی ملکیت کا اقرار",
              "english": "Affirmation of Allah's Sovereignty"
            },
            "content": {
              "urdu": [
                "دعا میں 'لبيك وسعديك والخير كله في يديك والشر ليس إليك' (میں تیرے حکم پر حاضر ہوں، تمام بھلائی تیرے ہاتھ میں ہے اور شر تیری طرف سے نہیں) کا اقرار شامل ہے۔",
                "یہ کلمات اللہ کی مکمل ملکیت، طاقت، اور خیر پر اس کے کنٹرول کا اعتراف ہیں۔",
                "یہ نماز کے شروع میں مکمل سپردگی (Submission) کے جذبے کو پیدا کرتا ہے۔"
              ],
              "english": [
                "The supplication includes the affirmation: 'Labbayka wa sa‘dayka, wal-khayru kulluhu fī yadayk, wash-sharru laysa ilayk' (I am here at Your command, all good is in Your Hands, and evil is not attributed to You).",
                "These words acknowledge Allah's complete Sovereignty, power, and control over all good.",
                "This generates a feeling of complete submission at the very beginning of the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اہمیت",
        "english": "Importance in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز سے قبل تیاری",
              "english": "Preparation Before Prayer"
            },
            "content": {
              "urdu": [
                "اس دعا کا مستقل ورد نمازی کو دنیاوی افکار سے نکال کر روحانی حالت میں لے جاتا ہے۔",
                "یہ اس بات کی دلیل ہے کہ نماز سے پہلے کی چند لمحات کی توجہ بھی عبادت کے معیار کو بدل سکتی ہے۔",
                "دعاء الاستفتاح ہمیں ہر بار نماز کو پہلی اور آخری نماز سمجھ کر پڑھنے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "The consistent recitation of this supplication shifts the worshipper from worldly thoughts into a spiritual state.",
                "It proves that even a few moments of concentration before prayer can change the quality of the worship.",
                "Du'a Al-Istiftāḥ encourages us to pray every time as if it were our first and last prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسنون طریقہ",
              "english": "The Sunnah Method"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے کئی مختلف دعائے استفتاح سکھائی ہیں، اس دعا کا پڑھنا بھی سنت ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی نمازوں میں نبی صلی اللہ علیہ وسلم کی سکھائی ہوئی مسنون دعاؤں کو اپنائیں۔",
                "دعاء الاستفتاح نماز کو کامل اور بھرپور بنانے کا ایک بہترین حصہ ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) taught several different opening supplications, and reciting this one is Sunnah.",
                "Muslims should adopt the Sunnah supplications taught by the Prophet (PBUH) in their prayers.",
                "Du'a Al-Istiftāḥ is an excellent component for making the prayer complete and enriching."
              ]
            }
          }
        ]
      }
    }
  ]
}
