{
  "hadithId": 1252,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/17"],
    "kitabId": 16,
    "inKitabBab": 2,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 103
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5985)، ومسلم (2557).",
    "urdu": "صحیح۔ اسے امام بخاری (5985) اور امام مسلم (2557) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5985) and Muslim (2557)."
  },
  "importantWords": [
    {
      "arabic": "يُبْسَطَ",
      "english": "To be expanded / increased",
      "urdu": "کشادگی دی جائے / بڑھا دیا جائے"
    },
    {
      "arabic": "يُنْسَأَ",
      "english": "To be prolonged / delayed",
      "urdu": "لمبا کر دیا جائے / تاخیر کی جائے"
    },
    {
      "arabic": "أَثَرِهِ",
      "english": "His life (literally: his footprint/trace)",
      "urdu": "اس کی عمر / زندگی کے نشانات"
    },
    {
      "arabic": "فَلْيَصِلْ رَحِمَهُ",
      "english": "He should join ties of kinship",
      "urdu": "پس اسے صلہ رحمی کرنی چاہیے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث رزق میں برکت اور لمبی زندگی کے حصول کا ایک بہترین نبوی نسخہ بیان کرتی ہے، اور وہ ہے اپنے رشتہ داروں کے ساتھ حسنِ سلوک اور صلہ رحمی۔",
    "english": "This Hadith provides a Prophetic remedy for increasing sustenance and longevity: maintaining good relations and kind treatment toward one's relatives."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأدب، باب من بسط له في الرزق بصلة الرحم، رقم 5985",
      "english": "Sahih al-Bukhari, Book of Manners, No. 5985"
    },
    {
      "arabic": "صحيح مسلم، كتاب البر والصلة، رقم 2557",
      "english": "Sahih Muslim, Book of Virtue, Enjoining Good Manners, No. 2557"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صلہ رحمی کی اہمیت اور برکت",
        "english": "Importance and Blessings of Joining Kinship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صلہ رحمی کا مفہوم",
              "english": "Meaning of Silat al-Rahm"
            },
            "content": {
              "urdu": [
                "صلہ رحمی کا مطلب رشتہ داروں کے ساتھ تعلق جوڑنا، ان کی مالی مدد کرنا اور ان کے دکھ سکھ میں شریک ہونا ہے۔",
                "اسلام میں والدین کے بعد قریبی رشتہ داروں کے حقوق کو سب سے زیادہ اہمیت دی گئی ہے۔",
                "تعلق توڑنے والے کے ساتھ بھی حسنِ سلوک کرنا صلہ رحمی کا اعلیٰ درجہ ہے۔"
              ],
              "english": [
                "Silat al-Rahm means maintaining ties with relatives, assisting them financially, and sharing in their joys and sorrows.",
                "In Islam, after parents, the rights of close relatives are given the highest priority.",
                "Maintaining ties even with those who cut them off is the highest level of this virtue."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزق میں کشادگی",
              "english": "Expansion of Sustenance"
            },
            "content": {
              "urdu": [
                "رشتہ داروں پر خرچ کرنا اور ان سے اچھا برتاؤ کرنا مال میں برکت کا سبب بنتا ہے۔",
                "اللہ تعالیٰ صلہ رحمی کرنے والے کے رزق کے دروازے کھول دیتا ہے اور اسے ایسی جگہ سے دیتا ہے جہاں سے گمان بھی نہ ہو۔",
                "برکت کا مطلب صرف مال کی کثرت نہیں بلکہ اس مال سے سکون اور نفع حاصل ہونا بھی ہے۔"
              ],
              "english": [
                "Spending on relatives and treating them well causes blessings (Barakah) in one's wealth.",
                "Allah opens the doors of sustenance for those who uphold kinship, providing from unexpected sources.",
                "Blessing does not just mean quantity; it also means deriving peace and benefit from that wealth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عمر میں اضافے کی حقیقت",
        "english": "The Reality of Prolonging Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمر کی طوالت سے کیا مراد ہے؟",
              "english": "What is Meant by Prolonged Life?"
            },
            "content": {
              "urdu": [
                "علماء کے نزدیک اس کا ایک مطلب یہ ہے کہ انسان کو نیکیوں کی ایسی توفیق ملتی ہے کہ اس کا تھوڑا وقت بھی دوسروں کی لمبی زندگیوں پر بھاری ہوتا ہے۔",
                "دوسرا مطلب یہ ہے کہ مرنے کے بعد بھی اس کا ذکرِ خیر اور صدقہ جاریہ کے کام اسے لوگوں کے دلوں میں زندہ رکھتے ہیں۔",
                "بعض کے نزدیک اللہ تعالیٰ حقیقتاً اس کے مقدر میں لکھی گئی عمر میں اضافہ فرما دیتا ہے۔"
              ],
              "english": [
                "One meaning according to scholars is that the person is granted such success in deeds that their short time outweighs others' long lives.",
                "Another meaning is that their good reputation and ongoing charity (Sadaqah Jariyah) keep them alive in hearts after death.",
                "Some believe Allah literally increases the lifespan decreed in their destiny."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفسیاتی اور سماجی اثرات",
              "english": "Psychological and Social Impacts"
            },
            "content": {
              "urdu": [
                "رشتہ داروں سے اچھے تعلقات انسان کو ذہنی تناؤ اور تنہائی سے بچاتے ہیں، جو صحت کے لیے مفید ہے۔",
                "مضبوط خاندانی نظام معاشرے میں امن اور استحکام کا باعث بنتا ہے۔",
                "جب پورا خاندان ایک دوسرے کا ہمدرد ہو تو مشکلات کا مقابلہ کرنا آسان ہو جاتا ہے۔"
              ],
              "english": [
                "Good relations with relatives protect a person from stress and isolation, which is beneficial for health.",
                "A strong family system brings peace and stability to society.",
                "When an entire family supports one another, facing life's challenges becomes much easier."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلق توڑنے کی مذمت",
        "english": "Condemnation of Severing Ties"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قطع رحمی کا وبال",
              "english": "The Burden of Severing Ties"
            },
            "content": {
              "urdu": [
                "رشتہ داروں سے ناطہ توڑنا (قطع رحمی) گناہِ کبیرہ ہے اور یہ رزق و عمر کی تنگی کا باعث بنتا ہے۔",
                "حدیث قدسی کے مطابق اللہ نے فرمایا کہ جو رشتہ جوڑے گا میں اسے جوڑوں گا اور جو توڑے گا میں اسے توڑ دوں گا۔",
                "قطع رحمی کرنے والے کی دعائیں اور نیک اعمال قبول ہونے میں رکاوٹ پیدا ہوتی ہے۔"
              ],
              "english": [
                "Severing ties (Qat' al-Rahm) is a major sin and leads to constriction in sustenance and life.",
                "In a Hadith Qudsi, Allah says He will keep ties with the one who keeps them and sever ties with the one who cuts them.",
                "Severing ties acts as a barrier to the acceptance of supplications and good deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "معافی اور درگزر",
              "english": "Forgiveness and Forbearance"
            },
            "content": {
              "urdu": [
                "خاندانی جھگڑوں میں پہل کر کے معاف کر دینا صلہ رحمی کی روح ہے۔",
                "نبی ﷺ نے سکھایا کہ بدلہ لینے والا صلہ رحمی کرنے والا نہیں، بلکہ وہ ہے جو زیادتی کے باوجود تعلق برقرار رکھے۔",
                "عاجزی اختیار کرنے سے اللہ تعالیٰ انسان کی عزت میں اضافہ فرماتا ہے۔"
              ],
              "english": [
                "Taking the initiative to forgive in family disputes is the soul of Silat al-Rahm.",
                "The Prophet (ﷺ) taught that the one who reciprocates is not the true joiner of ties, but the one who maintains them despite being wronged.",
                "By adopting humility, Allah increases a person's honor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رابطے کی اہمیت",
              "english": "Importance of Communication"
            },
            "content": {
              "urdu": [
                "اج کل کے دور میں فون، میسج یا ملاقات کے ذریعے رشتہ داروں کی خیر خیریت معلوم کرنا بھی صلہ رحمی ہے۔",
                "اپنے غریب رشتہ داروں کی خفیہ مالی مدد کرنا دہرا ثواب (صدقہ اور صلہ رحمی) رکھتا ہے۔",
                "چھوٹی چھوٹی باتوں کو نظر انداز کر کے خاندان کے اتحاد کو ترجیح دینی چاہیے۔"
              ],
              "english": [
                "In the modern era, checking on relatives via phone, message, or visits counts as Silat al-Rahm.",
                "Secretly helping poor relatives carries a double reward (charity and joining ties).",
                "One should ignore minor grievances and prioritize family unity."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی فکر",
              "english": "Focusing on the Hereafter"
            },
            "content": {
              "urdu": [
                "دنیاوی فوائد کے ساتھ ساتھ صلہ رحمی کا اصل اجر آخرت میں جنت کی صورت میں ملے گا۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ دین اور دنیا ایک دوسرے سے الگ نہیں، بلکہ دینی احکام پر عمل سے دنیا بھی سنورتی ہے۔",
                "نبی کریم ﷺ کی اس پیاری سنت کو زندہ کرنا معاشرے کی خوشحالی کی ضمانت ہے۔"
              ],
              "english": [
                "Along with worldly benefits, the true reward of Silat al-Rahm is Paradise in the Hereafter.",
                "This Hadith teaches that religion and the world are not separate; practicing religious commands also improves worldly life.",
                "Reviving this beautiful Sunnah of the Prophet (ﷺ) is a guarantee for the prosperity of society."
              ]
            }
          }
        ]
      }
    }
  ]
}