{
  "hadithId": 1297,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["bulugh:1497"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3635)، والترمذي (1940)، وابن ماجه (2342)، وأحمد (3/453). قال الترمذي: 'حسن غريب'.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام ابوداؤد (3635) اور امام ترمذی (1940) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن غریب کہا ہے، اور اس کے ہم معنی روایات ابن ماجہ اور مسند احمد میں بھی موجود ہیں۔",
    "english": "Hasan (Good). Reported by Abu Dawud (3635), At-Tirmidhi (1940), and Ibn Majah (2342). At-Tirmidhi classified it as 'Hasan Gharib'."
  },
  "importantWords": [
    {
      "arabic": "ضَارَّ",
      "english": "Harmed / Caused Loss",
      "urdu": "نقصان پہنچایا / ضرر دیا"
    },
    {
      "arabic": "مُسْلِمًا",
      "english": "A Muslim",
      "urdu": "ایک مسلمان"
    },
    {
      "arabic": "شَاقَّ",
      "english": "Caused Hardship",
      "urdu": "مشقت میں ڈالا / سختی کی"
    },
    {
      "arabic": "شَقَّ اللهُ",
      "english": "Allah will put him in hardship",
      "urdu": "اللہ اسے مشقت میں ڈالے گا"
    },
    {
      "arabic": "جَزَاء",
      "english": "Recompense / Reward",
      "urdu": "بدلہ / جزا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مکافاتِ عمل کا اصول بیان کرتی ہے کہ جو دوسروں کو نقصان پہنچاتا ہے یا مشکل میں ڈالتا ہے، اللہ تعالیٰ اسے اسی قسم کی مصیبت میں مبتلا کر دیتا ہے۔",
    "english": "This Hadith establishes the principle of divine retribution: whoever intentionally harms or creates difficulties for others will face similar consequences from Allah."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3635)",
      "english": "Sunan Abu Dawud (3635)"
    },
    {
      "arabic": "سنن الترمذي (1940)",
      "english": "Sunan at-Tirmidhi (1940)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو صرمة الأنصاري",
        "english": "Abu Sirmah al-Ansari"
      },
      "slug": "abu-sirmah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ضرر اور نقصان کی ممانعت",
        "english": "Prohibition of Harm"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان پہنچانے کی تعریف",
              "english": "Defining Harm"
            },
            "content": {
              "urdu": [
                "اسلام میں کسی کو مالی، جسمانی یا نفسیاتی نقصان پہنچانا قطعی حرام ہے۔",
                "ضرر سے مراد ایسا کام ہے جس سے دوسرے کا حق مارا جائے یا تکلیف ہو۔",
                "مومن وہ ہے جس کے ہاتھ اور زبان سے دوسرے مسلمان محفوظ رہیں۔"
              ],
              "english": [
                "In Islam, causing financial, physical, or psychological harm is strictly forbidden.",
                "Harm refers to any action that violates another's rights or causes pain.",
                "A true believer is one from whose hand and tongue other Muslims are safe."
              ]
            }
          },
          {
            "title": {
              "urdu": "قصداً نقصان دینا",
              "english": "Intentional Injury"
            },
            "content": {
              "urdu": [
                "اس حدیث میں خاص طور پر ان لوگوں کو ڈرایا گیا ہے جو جان بوجھ کر نقصان دیتے ہیں۔",
                "اپنے فائدے کے لیے دوسرے کا نقصان کرنا اللہ کے غصے کو دعوت دینا ہے۔",
                "نبی ﷺ نے فرمایا: 'نہ خود نقصان اٹھاؤ اور نہ دوسروں کو نقصان دو'۔"
              ],
              "english": [
                "This Hadith specifically warns those who intentionally cause injury to others.",
                "Causing loss to others for personal gain invites the wrath of Allah.",
                "The Prophet (ﷺ) said: 'There should be neither harming nor reciprocating harm'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مشقت اور سختی کا انجام",
        "english": "Consequences of Creating Hardship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لوگوں کو تنگی میں ڈالنا",
              "english": "Putting People in Difficulty"
            },
            "content": {
              "urdu": [
                "سختی سے مراد کسی کے جائز کام میں رکاوٹ ڈالنا یا بلاوجہ تنگ کرنا ہے۔",
                "خاص طور پر عہدے داروں کے لیے یہ تنبیہ ہے کہ وہ عوام پر بوجھ نہ ڈالیں۔",
                "آسانی پیدا کرنا صدقہ ہے جبکہ مشقت پیدا کرنا گناہِ عظیم ہے۔"
              ],
              "english": [
                "Hardship refers to obstructing legitimate tasks or harassing others needlessly.",
                "This is a specific warning for officials not to burden the public.",
                "Creating ease is a charity, while creating difficulty is a major sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی طرف سے سختی",
              "english": "Hardship from Allah"
            },
            "content": {
              "urdu": [
                "جو دوسروں کی زندگی مشکل بناتا ہے، اللہ اس کے اپنے معاملات مشکل کر دیتا ہے۔",
                "اللہ کی پکڑ سے کوئی ظالم یا حیلے بہانے کرنے والا بچ نہیں سکتا۔",
                "دنیا میں لوگوں کو رلانے والا آخرت میں سخت حساب کا سامنا کرے گا۔"
              ],
              "english": [
                "Whoever makes life difficult for others, Allah makes their own affairs difficult.",
                "No oppressor or schemer can escape the eventual seizure of Allah.",
                "One who makes people cry in this world will face a rigorous account hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مکافاتِ عمل کا قاعدہ",
        "english": "The Law of Retribution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جیسا کرو گے ویسا بھرو گے",
              "english": "As You Sow, So Shall You Reap"
            },
            "content": {
              "urdu": [
                "اللہ کا قانون ہے کہ جزا اور سزا عمل کی جنس سے ہی ملتی ہے۔",
                "اگر تم رحم کرو گے تو تم پر رحم کیا جائے گا، اگر ضرر دو گے تو ضرر ملے گا۔",
                "دوسروں کے ساتھ کیا گیا سلوک گھوم کر واپس انسان تک ہی آتا ہے۔"
              ],
              "english": [
                "It is Allah's law that reward and punishment match the nature of the deed.",
                "If you show mercy, you receive mercy; if you cause harm, you face harm.",
                "The way you treat others eventually circles back to you."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدلِ الٰہی",
              "english": "Divine Justice"
            },
            "content": {
              "urdu": [
                "مظلوم کی پکار اور اللہ کے درمیان کوئی پردہ نہیں ہوتا۔",
                "اللہ تعالیٰ مظلوم کا بدلہ ظالم سے دنیا و آخرت دونوں میں لیتا ہے۔",
                "نقصان پہنچانے والا درحقیقت اپنا ہی بیڑا غرق کر رہا ہوتا ہے۔"
              ],
              "english": [
                "There is no veil between the cry of the oppressed and Allah.",
                "Allah takes revenge for the oppressed in both this world and the next.",
                "One who harms others is actually causing their own destruction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعمیری سبق",
        "english": "Constructive Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیر خواہی کا جذبہ",
              "english": "Spirit of Well-wishing"
            },
            "content": {
              "urdu": [
                "مومن کا کام دوسروں کے لیے ڈھال بننا ہے، کانٹا بننا نہیں۔",
                "دوسروں کے نقصان پر خوش ہونا منافقت کی علامت ہے۔",
                "ہمیں چاہیے کہ لوگوں کے لیے سہولت کار اور نفع بخش بنیں۔"
              ],
              "english": [
                "A believer's job is to be a shield for others, not a thorn.",
                "Rejoicing at the loss of others is a sign of hypocrisy.",
                "We must strive to be facilitators and beneficial to people."
              ]
            }
          },
          {
            "title": {
              "urdu": "معافی اور تلافی",
              "english": "Forgiveness and Restitution"
            },
            "content": {
              "urdu": [
                "اگر کسی کو دانستہ یا نادانستہ نقصان پہنچا ہو تو فوراً معافی مانگیں۔",
                "حقوق العباد کی تلافی کے بغیر توبہ مکمل نہیں ہوتی۔",
                "دوسروں کی زندگی میں آسانیاں بانٹنا اللہ کے قرب کا ذریعہ ہے۔"
              ],
              "english": [
                "If harm is caused intentionally or not, seek forgiveness immediately.",
                "Repentance is incomplete without making amends for human rights.",
                "Spreading ease in the lives of others is a means to gain proximity to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}