{
  "hadithId": 693,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh:693"],
    "kitabId": 7,
    "inKitabBab": 2,
    "arabicBook": "كتاب البيوع",
    "babId": 43
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3456)، والنسائي (7/251)، والترمذي (1247) وقال: حسن، وأحمد (2/183)، والدارقطني (3/50)، وابن الجارود (620).",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے ابوداؤد، نسائی، ترمذی، احمد، دارقطنی اور ابن الجارود نے روایت کیا ہے۔ امام ترمذی نے اسے حسن قرار دیا ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (3456), An-Nasa'i (7/251), At-Tirmidhi (1247), Ahmad, Ad-Daraqutni, and Ibn al-Jarud. At-Tirmidhi graded it Hasan."
  },
  "importantWords": [
    {
      "arabic": "الْمُبْتَاعُ",
      "english": "The Buyer",
      "urdu": "خریدنے والا"
    },
    {
      "arabic": "بِالْخِيَارِ",
      "english": "With Option",
      "urdu": "اختیار کے ساتھ"
    },
    {
      "arabic": "يَتَفَرَّقَا",
      "english": "They separate",
      "urdu": "وہ جدا ہو جائیں"
    },
    {
      "arabic": "يَسْتَقِيلَهُ",
      "english": "Asks to cancel",
      "urdu": "اس سے منسوخی کا مطالبہ کرے"
    },
    {
      "arabic": "صَفْقَةَ",
      "english": "Transaction / Deal",
      "urdu": "سودا / بیع"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'خیارِ مجلس' کا بیان ہے، یعنی جب تک خریدار اور بیچنے والا ایک جگہ موجود ہیں، وہ سودا ختم کر سکتے ہیں، اور اس حق کو ختم کرنے کے لیے بدنیتی سے بھاگنا منع ہے۔",
    "english": "This Hadith discusses 'Option of the Session' (Khiyar al-Majlis), allowing parties to cancel a deal as long as they stay together, and forbids fleeing to prevent the other from exercising this right."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3456)",
      "english": "Reported by Abu Dawud (3456)"
    },
    {
      "arabic": "جامع الترمذي (1247)",
      "english": "Jami' At-Tirmidhi (1247)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعیب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خیارِ مجلس کا مفہوم",
        "english": "Understanding the Option of Session"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سودے پر نظر ثانی کا حق",
              "english": "Right to Reconsider"
            },
            "content": {
              "urdu": [
                "جب تک خریدار اور بیچنے والا ایک ہی جگہ (مجلس) میں موجود ہوں، سودا غیر لازم رہتا ہے۔",
                "اس دوران دونوں میں سے کوئی بھی بغیر کسی عیب کے سودا منسوخ کرنے کا حق رکھتا ہے۔",
                "جیسے ہی وہ جسمانی طور پر ایک دوسرے سے الگ ہوں گے، سودا قطعی اور لازم ہو جائے گا۔"
              ],
              "english": [
                "As long as the buyer and seller are in the same session, the deal remains non-binding.",
                "During this time, either party has the right to cancel the transaction without any defect.",
                "The deal becomes final and binding once they physically separate from each other."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدا ہونے کی حد",
              "english": "Limit of Separation"
            },
            "content": {
              "urdu": [
                "جدائی سے مراد وہ جسمانی علیحدگی ہے جو عرفِ عام میں ایک دوسرے سے الگ ہونا کہلائے۔",
                "اگر وہ ایک بڑی دکان میں ہوں تو ایک کا باہر نکل جانا جدائی تصور ہوگا۔",
                "یہ اصول اس لیے ہے تاکہ فریقین کو سوچنے کا آخری موقع مل سکے اور وہ پچھتاوے سے بچیں۔"
              ],
              "english": [
                "Separation refers to physical distance recognized by custom as leaving the presence of the other.",
                "In a large store, one party walking out constitutes the end of the session option.",
                "This principle provides parties a final chance to think and avoid future regret."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دھوکہ دہی اور فرار کی ممانعت",
        "english": "Prohibition of Deception and Fleeing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق چھیننے کے لیے بھاگنا",
              "english": "Running to Negate Rights"
            },
            "content": {
              "urdu": [
                "اگر بیچنے والے کو لگے کہ خریدار پچھتا رہا ہے، تو اس کے لیے وہاں سے بھاگنا حرام ہے۔",
                "جلدی سے الگ ہونا تاکہ دوسرے کا منسوخی کا حق ختم ہو جائے، بددیانتی ہے۔",
                "اسلامی تجارت کی بنیاد ایک دوسرے کو نفع پہنچانے اور خوشدلی پر ہے۔"
              ],
              "english": [
                "If a seller senses the buyer is regretting, it is forbidden for him to flee the scene.",
                "Separating quickly to terminate the other's right of option is considered dishonesty.",
                "Islamic trade is based on mutual benefit and dealing with a cheerful heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت کا عمل دخل",
              "english": "The Role of Intention"
            },
            "content": {
              "urdu": [
                "اگر کوئی ضرورت کے تحت الگ ہوتا ہے تو کوئی حرج نہیں، ممانعت بدنیتی پر مبنی فرار کی ہے۔",
                "اللہ نیتوں کو جانتا ہے اور وہ ہر اس چال کو ناپسند کرتا ہے جو دوسرے کا حق مارنے کے لیے ہو۔",
                "برکت ہمیشہ سچائی اور شفافیت کے ساتھ وابستہ ہوتی ہے، چالبازی کے ساتھ نہیں۔"
              ],
              "english": [
                "Leaving due to necessity is fine; the prohibition is specifically against malicious fleeing.",
                "Allah knows the intentions and dislikes any trick used to suppress the rights of others.",
                "Blessing is always associated with truth and transparency, not with cunning tactics."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خیارِ شرط (اختیارِ شرط)",
        "english": "The Option of Condition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مدت کا تعین",
              "english": "Defining a Period"
            },
            "content": {
              "urdu": [
                "اگر سودے کے وقت یہ شرط رکھی جائے کہ 'مجھے تین دن کا اختیار ہے' تو یہ جائز ہے۔",
                "اس صورت میں مجلس سے جدا ہونے کے بعد بھی طے شدہ مدت تک اختیار باقی رہتا ہے۔",
                "اسے 'صفقہ خیار' کہا جاتا ہے جو فریقین کو مزید اطمینان فراہم کرتا ہے۔"
              ],
              "english": [
                "If a condition is set such as 'I have an option for three days,' it is permissible.",
                "In this case, the option remains even after physical separation until the period ends.",
                "This is called 'Safqat al-Khiyar,' which provides additional security to the parties."
              ]
            }
          },
          {
            "title": {
              "urdu": "موافقت اور لزوم",
              "english": "Agreement and Obligation"
            },
            "content": {
              "urdu": [
                "اگر دونوں فریق کہیں کہ 'ہم نے اختیار ختم کیا' تو مجلس میں رہتے ہوئے بھی سودا لازم ہو جائے گا۔",
                "شریعت نے انسانوں کو اپنے معاملات طے کرنے کی مکمل آزادی اور سہولت دی ہے۔",
                "بنیادی مقصد یہ ہے کہ کسی بھی فریق پر زبردستی کوئی بوجھ نہ ڈالا جائے۔"
              ],
              "english": [
                "If both parties agree to waive the option, the deal becomes binding even within the session.",
                "Sharia provides humans full freedom and facility to settle their own affairs.",
                "The core objective is that no party should be forced into a burden against their will."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی اسباق",
        "english": "Juristic and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ائمہ کے مابین اختلاف",
              "english": "Difference Among Imams"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد خیارِ مجلس کے قائل ہیں اور اس حدیث کو دلیل بناتے ہیں۔",
                "امام ابوحنیفہ کے نزدیک صرف کلام سے سودا پکا ہو جاتا ہے اور علیحدگی ضروری نہیں۔",
                "محدثین کے نزدیک صحیح اور صریح حدیث کی موجودگی میں علیحدگی والی بات ہی راجح ہے۔"
              ],
              "english": [
                "Imams Shafi'i and Ahmad uphold the Option of Session, using this Hadith as evidence.",
                "Imam Abu Hanifa views the deal as final via verbal agreement without needing separation.",
                "Scholars of Hadith prioritize the physical separation view due to this explicit narration."
              ]
            }
          },
          {
            "title": {
              "urdu": "تجارت میں اخلاق",
              "english": "Ethics in Trade"
            },
            "content": {
              "urdu": [
                "یہ حدیث سکھاتی ہے کہ مال بیچنے کی جلدی میں اخلاقی حدود پامال نہیں کرنی چاہئیں۔",
                "اگر گاہک پشیمان ہے تو اسے موقع دینا اللہ کے ہاں پسندیدہ عمل ہے۔",
                "سچا تاجر وہی ہے جو نفع سے زیادہ انسانی تعلق اور امانتداری کی فکر کرے۔"
              ],
              "english": [
                "This Hadith teaches that ethical limits should not be violated in the rush to sell.",
                "Giving the customer a chance if they regret is a deed beloved to Allah.",
                "A true merchant cares more about human connection and integrity than just profit."
              ]
            }
          }
        ]
      }
    }
  ]
}