{
  "hadithId": 1043,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/10/10"
    ],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (5/222)‏، والنسائي في \"الكبرى\" (7344)‏، وابن ماجه (2574)‏، وصححه ابن حبان (4437).",
    "urdu": "یہ روایت صحیح ہے۔ اسے امام احمد، نسائی اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔ اس کی سند حسن درجے کی ہے۔",
    "english": "Sahih (Authentic). Reported by Ahmad (5/222), An-Nasa'i in Al-Kubra (7344), and Ibn Majah (2574). It was authenticated by Ibn Hibban (4437)."
  },
  "importantWords": [
    {
      "arabic": "رُوَيْجِلٌ",
      "english": "Small/Weak man",
      "urdu": "چھوٹا سا کمزور آدمی"
    },
    {
      "arabic": "خَبُثَ",
      "english": "Committed adultery",
      "urdu": "برائی کی / زنا کیا"
    },
    {
      "arabic": "عِثْكَالًا",
      "english": "Date-palm stalk",
      "urdu": "کھجور کا گچھا / ٹہنی"
    },
    {
      "arabic": "شِمْرَاخٍ",
      "english": "Small sprigs/branches",
      "urdu": "شاخیں / تیلیاں"
    },
    {
      "arabic": "ضَرْبَةً وَاحِدَةً",
      "english": "A single strike",
      "urdu": "ایک ہی ضرب"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ثابت ہوتا ہے کہ اگر مجرم جسمانی طور پر انتہائی کمزور ہو اور حد برداشت نہ کر سکتا ہو، تو اسے سو ٹہنیوں والے گچھے سے ایک بار مار کر حد پوری کی جا سکتی ہے۔",
    "english": "This Hadith shows that if an offender is too weak to endure the standard lashing, the penalty can be fulfilled by striking them once with a bundle of a hundred sprigs."
  },
  "references": [
    {
      "arabic": "رواه أحمد (5/222)",
      "english": "Reported by Ahmad (5/222)"
    },
    {
      "arabic": "رواه ابن ماجه (2574)",
      "english": "Reported by Ibn Majah (2574)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعيد بن سعد بن عبادة",
        "english": "Sa'id bin Sa'd bin Ubadah"
      },
      "slug": "sa'id-bin-sa'd"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6o9l6Kts",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کمزور مجرم کے لیے رعایت",
        "english": "Concession for Weak Offenders"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی حالت کا لحاظ",
              "english": "Considering Physical Health"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں سزا کا مقصد مجرم کو ہلاک کرنا نہیں بلکہ تادیب و اصلاح ہے۔",
                "اگر مجرم اتنا لاغر ہو کہ سو کوڑے اس کی جان لے لیں، تو شریعت نرمی کرتی ہے۔",
                "ایسی صورت میں سو شاخوں والے گچھے سے ایک ضرب مارنا سو کوڑوں کے قائم مقام ہے۔"
              ],
              "english": [
                "The goal of punishment in Islam is discipline and reform, not killing the offender.",
                "If an offender is so frail that 100 lashes would be fatal, Shariah offers a concession.",
                "In such cases, a single strike with a bundle of 100 sprigs substitutes for 100 lashes."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآنی مثال",
              "english": "Quranic Precedent"
            },
            "content": {
              "urdu": [
                "یہ طریقہ کار قرآن مجید میں حضرت ایوب علیہ السلام کے واقعے سے بھی ثابت ہے۔",
                "اللہ نے انہیں حکم دیا تھا کہ تنکوں کا مٹھا لے کر ایک بار ماریں تاکہ قسم پوری ہو۔",
                "نبی کریم ﷺ نے اسی قرآنی اصول کو حدود کے نفاذ میں استعمال فرمایا۔"
              ],
              "english": [
                "This methodology is supported by the story of Prophet Ayyub (AS) in the Quran.",
                "Allah commanded him to strike with a bundle of grass once to fulfill his oath.",
                "The Prophet (ﷺ) applied this Quranic principle to the implementation of Hudud."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانون اور شفقت کا توازن",
        "english": "Balance of Law and Compassion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حد کا نفاذ ضروری ہے",
              "english": "Necessity of Executing the Limit"
            },
            "content": {
              "urdu": [
                "کمزوری کی بنیاد پر حد کو بالکل معاف نہیں کیا جا سکتا کیونکہ یہ اللہ کا حق ہے۔",
                "طریقہ کار میں تبدیلی کی جا سکتی ہے مگر قانون کی علامتی پاسداری لازمی ہے۔",
                "یہ عمل ثابت کرتا ہے کہ کوئی بھی شخص قانون سے بالاتر نہیں ہوتا۔"
              ],
              "english": [
                "The legal limit (Had) cannot be entirely waived due to weakness as it is Allah's right.",
                "The method can be modified, but symbolic adherence to the law remains mandatory.",
                "This act proves that no individual is above the law, regardless of their condition."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی نظامِ عدل کی روح",
              "english": "Spirit of Islamic Justice"
            },
            "content": {
              "urdu": [
                "اسلامی سزاؤں میں انتقام کے بجائے رحمت اور حکمت کا پہلو غالب ہوتا ہے۔",
                "مجرم کو توبہ اور اصلاح کا موقع دینا اسلامی ریاست کی ذمہ داری ہے۔",
                "یہ رعایت صرف ان کے لیے ہے جن کی جان کو واقعی خطرہ لاحق ہو۔"
              ],
              "english": [
                "Mercy and wisdom prevail over revenge in Islamic punishments.",
                "It is the state's responsibility to give the offender a chance for repentance.",
                "This concession is strictly for those whose lives are genuinely endangered by the Had."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرب کا طریقہ",
              "english": "Method of Striking"
            },
            "content": {
              "urdu": [
                "فقہاء کے مطابق یہ ضروری ہے کہ ہر ٹہنی مجرم کے جسم کو ٹکرائے۔",
                "ایسی ضرب لگائی جائے جو تکلیف دہ تو ہو مگر جان لیوا ہرگز نہ ہو۔",
                "قاضی کو حالات دیکھ کر اس رعایت کا فیصلہ کرنے کا اختیار ہے۔"
              ],
              "english": [
                "Jurists state it is necessary for every sprig to touch the offender's body.",
                "The blow should be felt but must not be life-threatening under any condition.",
                "The judge has the authority to decide on this concession based on circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیماری کی حالت میں حکم",
              "english": "Ruling During Illness"
            },
            "content": {
              "urdu": [
                "اگر مجرم عارضی طور پر بیمار ہو تو تندرستی تک سزا مؤخر کی جائے گی۔",
                "مستقل کمزوری یا لاعلاج بیماری کی صورت میں یہ متبادل طریقہ اپنایا جائے گا۔",
                "شریعت انسانی جان کی حفاظت کو ہر ممکن حد تک یقینی بناتی ہے۔"
              ],
              "english": [
                "If the offender is temporarily ill, the penalty is delayed until recovery.",
                "In cases of permanent frailty or incurable illness, this alternative is used.",
                "Shariah ensures the protection of human life to the maximum possible extent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سماجی نظم و ضبط",
              "english": "Social Discipline"
            },
            "content": {
              "urdu": [
                "گناہ کی سزا کا خوف معاشرے کو بے حیائی سے بچانے کے لیے ضروری ہے۔",
                "حتیٰ کہ کمزور ترین شخص کو بھی تنبیہ کی گئی تاکہ برائی جڑ نہ پکڑے۔",
                "قانون کا احترام ہی پرامن معاشرے کی بنیاد رکھتا ہے۔"
              ],
              "english": [
                "The fear of punishment is essential to protect society from immorality.",
                "Even the weakest individual was admonished to prevent vice from spreading.",
                "Respect for the law forms the foundation of a peaceful and stable society."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی حکمتِ عملی",
              "english": "Prophetic Strategy"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے ہر مسئلے کا حل نہایت دانشمندی اور شفقت سے نکالا۔",
                "آپ ﷺ کی تعلیمات میں سختی اور نرمی کا بہترین توازن موجود ہے۔",
                "ہمیں بھی اپنے معاملات میں حکمت اور عدل کو ملحوظ رکھنا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) solved every problem with immense wisdom and compassion.",
                "His teachings encompass a perfect balance between firmness and leniency.",
                "We must also uphold wisdom and justice in our personal and social dealings."
              ]
            }
          }
        ]
      }
    }
  ]
}