{
  "hadithId": 1045,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/10/12"
    ],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه الترمذي (1438)‏، وزاد: \"وأن عمر ضرب وغرب\".‏ وسنده صحيح، ورجاله ثقات، والحديث له شواهد من حديث أبي هريرة وزيد بن خالد المتفق عليه.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام ترمذی نے روایت کیا ہے اور اس میں یہ اضافہ بھی ہے کہ حضرت عمر نے بھی کوڑے لگائے اور جلا وطن کیا۔ اس کی اصل صحیحین میں حضرت ابوہریرہ کی روایت سے ثابت ہے۔",
    "english": "Sahih (Authentic). Reported by At-Tirmidhi (1438). The narrators are reliable. It is supported by the authentic narration of Abu Hurairah and Zaid bin Khalid in Bukhari and Muslim."
  },
  "importantWords": [
    {
      "arabic": "ضَرَبَ",
      "english": "Lashed / Struck",
      "urdu": "مارا / کوڑے لگائے"
    },
    {
      "arabic": "غَرَّبَ",
      "english": "Exiled / Banished",
      "urdu": "جلا وطن کیا"
    },
    {
      "arabic": "بِكْر",
      "english": "Unmarried person",
      "urdu": "کنوارہ / غیر شادی شدہ"
    },
    {
      "arabic": "تَغْرِيب",
      "english": "Expatriation",
      "urdu": "شہر بدری"
    },
    {
      "arabic": "مَرْفُوع",
      "english": "Attributed to Prophet",
      "urdu": "مرفوع (نبی ﷺ کا قول)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں غیر شادی شدہ زانی کی سزا بیان کی گئی ہے، جو کہ سو کوڑے اور ایک سال کی جلاوطنی پر مشتمل ہے، اور خلفائے راشدین کا اس پر عمل ثابت ہے۔",
    "english": "This Hadith confirms the penalty for an unmarried fornicator, which includes 100 lashes and one year of exile, as practiced by the Prophet (ﷺ) and the Righteous Caliphs."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1438)",
      "english": "Reported by At-Tirmidhi (1438)"
    },
    {
      "arabic": "أخرجه البخاري (2691) بنحوه",
      "english": "Reported by Al-Bukhari (2691) similarly"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Jb-DqIq8X9o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جلاوطنی کی شرعی حیثیت",
        "english": "Legal Status of Exile"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ نبوی اور تعاملِ صحابہ",
              "english": "Prophetic Sunnah and Practice"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے غیر شادی شدہ زانی کے لیے کوڑوں کے ساتھ جلاوطنی کا حکم دیا۔",
                "حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما نے بھی اپنے دور میں اس پر عمل کیا۔",
                "یہ اس بات کی دلیل ہے کہ جلاوطنی حد کا لازمی حصہ یا تکملہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) ordered exile alongside lashes for the unmarried fornicator.",
                "Abu Bakr and Umar (RA) also implemented this during their respective caliphates.",
                "This serves as evidence that exile is an integral part or supplement of the Had."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب کی آراء",
              "english": "Views of Juridical Schools"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک جلاوطنی حد کا مستقل حصہ ہے۔",
                "امام مالک کے نزدیک یہ صرف مرد کے لیے ہے، عورت کے لیے نہیں۔",
                "امام ابوحنیفہ کے نزدیک جلاوطنی لازمی نہیں بلکہ حاکم کی صوابدید پر ہے۔"
              ],
              "english": [
                "Imams Shafi'i and Ahmad consider exile a permanent part of the prescribed limit.",
                "Imam Malik holds that exile applies to men only, not to women.",
                "Imam Abu Hanifa views exile as a discretionary punishment by the ruler, not mandatory."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جلاوطنی کی حکمت",
        "english": "Wisdom Behind Exile"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماحول کی تبدیلی",
              "english": "Change of Environment"
            },
            "content": {
              "urdu": [
                "مجرم کو اس کے گناہ آلود ماحول سے دور کرنا اس کی اصلاح میں مددگار ہوتا ہے۔",
                "اپنے علاقے سے دوری انسان کو ندامت اور توبہ کی طرف مائل کرتی ہے۔",
                "یہ سزا معاشرے کو برائی کے اثرات سے محفوظ رکھنے کا ایک ذریعہ ہے۔"
              ],
              "english": [
                "Removing the offender from a sinful environment aids in their personal reform.",
                "Distance from one's home inclines a person toward remorse and repentance.",
                "This penalty serves as a means to protect society from the influence of vice."
              ]
            }
          },
          {
            "title": {
              "urdu": "تشہیر سے بچاؤ اور عبرت",
              "english": "Prevention of Scandal and Deterrence"
            },
            "content": {
              "urdu": [
                "جلاوطنی سے مجرم کی بدنامی کا پہلو بدل جاتا ہے اور اسے نئی زندگی کا موقع ملتا ہے۔",
                "دوسروں کے لیے یہ ایک خاموش عبرت ہے کہ گناہ کی سزا صرف جسمانی نہیں سماجی بھی ہے۔",
                "اسلامی سزاؤں کا مقصد فرد کی تذلیل نہیں بلکہ معاشرتی پاکیزگی ہے۔"
              ],
              "english": [
                "Exile shifts the aspect of public shame and gives a chance for a fresh start.",
                "It serves as a deterrent showing that sin has both physical and social costs.",
                "The goal of Islamic penalties is social purity, not the mere humiliation of individuals."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نفاذ کے شرائط",
        "english": "Conditions of Implementation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر شادی شدہ ہونا شرط ہے",
              "english": "Condition of Being Unmarried"
            },
            "content": {
              "urdu": [
                "یہ سزا صرف ان کے لیے ہے جنہوں نے کبھی صحیح نکاح نہ کیا ہو۔",
                "شادی شدہ (محصن) کے لیے سزا صرف رجم یعنی سنگسار کرنا ہے۔",
                "شریعت نے جرم کی سنگینی کے لحاظ سے سزا کے مختلف درجات رکھے ہیں۔"
              ],
              "english": [
                "This penalty is exclusively for those who have never been legally married.",
                "For married persons (Muhsan), the penalty is stoning to death (Rajm).",
                "Shariah has set different levels of punishment based on the gravity of the crime."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاست کا اختیار",
              "english": "State Authority"
            },
            "content": {
              "urdu": [
                "جلاوطنی اور کوڑوں کا نفاذ صرف اسلامی حکومت کا ہی اختیار ہے۔",
                "عوام کو قانون اپنے ہاتھ میں لے کر کسی کو نکالنے کی اجازت نہیں ہے۔",
                "نظمِ اجتماعی کی پاسداری اسلام کی بنیادی تعلیمات میں سے ہے۔"
              ],
              "english": [
                "Executing lashes and exile is strictly the prerogative of the Islamic state.",
                "The public is not permitted to take the law into their hands to banish anyone.",
                "Adhering to the social and legal order is a core teaching of Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عفت اور پاکدامنی",
              "english": "Chastity and Modesty"
            },
            "content": {
              "urdu": [
                "زنا ایک ایسا جرم ہے جو خاندانی نظام اور نسب کو تباہ کر دیتا ہے۔",
                "سخت سزائیں معاشرے میں پاکیزگی اور حیا کے فروغ کے لیے ہیں۔",
                "ایک مومن کو چاہیے کہ وہ اللہ کے حدود کے قریب جانے سے بھی ڈرے۔"
              ],
              "english": [
                "Adultery is a crime that destroys the family structure and lineage.",
                "Severe punishments are meant to promote purity and modesty in society.",
                "A believer must fear even approaching the boundaries set by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلفاء کی پیروی",
              "english": "Following the Caliphs"
            },
            "content": {
              "urdu": [
                "خلفائے راشدین کی سنت پر عمل کرنا بھی نبوی ہدایت کا حصہ ہے۔",
                "ان کے فیصلے شریعت کی روح اور فہم کے عین مطابق ہوتے تھے۔",
                "صحابہ کا طرزِ عمل ہمارے لیے قانونی اور اخلاقی رہنمائی کا منبع ہے۔"
              ],
              "english": [
                "Following the Sunnah of the Righteous Caliphs is part of Prophetic guidance.",
                "Their decisions were in perfect harmony with the spirit and understanding of Shariah.",
                "The conduct of the Sahabah is a source of legal and moral guidance for us."
              ]
            }
          }
        ]
      }
    }
  ]
}