{
  "hadithId": 479,
  "hadithNo": 55,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3132",
      "https://sunnah.com/tirmidhi:998"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": " حسن. رواه أحمد (1/205) ، وأبو داود (3132) ، والترمذي (998) ، وابن ماجه (1610) ، والحاكم (1/372). وصححه الترمذي والحاكم والذهبي. وهو أصل في مشروعية صنع الطعام لأهل الميت.",
    "urdu": "یہ حدیث حسن ہے۔ اسے احمد (1/205)، ابوداؤد (3132)، ترمذی (998) اور ابن ماجہ (1610) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے اور حاکم و ذہبی نے اسے صحیح قرار دیا ہے۔ یہ میت کے گھر والوں کے لیے کھانا تیار کرنے کی اصل دلیل ہے۔",
    "english": "Hasan (Good). Reported by Ahmad (1/205), Abu Dawud (3132), at-Tirmidhi (998), and Ibn Majah (1610). At-Tirmidhi graded it Hasan Sahih. This Hadith is the primary evidence for the permissibility of preparing food for the bereaved family."
  },
  "importantWords": [
    {
      "arabic": "نَعْيُ",
      "english": "News of death",
      "urdu": "خبرِ وفات / موت کی اطلاع"
    },
    {
      "arabic": "اصْنَعُوا",
      "english": "Prepare / Make",
      "urdu": "تم تیار کرو / بناؤ"
    },
    {
      "arabic": "آلِ",
      "english": "Family / Household",
      "urdu": "آل / گھر والے"
    },
    {
      "arabic": "طَعَامًا",
      "english": "Food",
      "urdu": "کھانا"
    },
    {
      "arabic": "يَشْغَلُهُمْ",
      "english": "Occupies them",
      "urdu": "انہیں مشغول کر دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں حکم دیا گیا ہے کہ میت کے گھر والوں کی تعزیت کے طور پر ان کے لیے کھانا تیار کیا جائے، کیونکہ وہ صدمے کی وجہ سے خود کھانا بنانے کی حالت میں نہیں ہوتے۔",
    "english": "This Hadith commands that food should be prepared for the family of the deceased as a gesture of sympathy, as they are too overwhelmed by grief to cook for themselves."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (998)",
      "english": "Sunan at-Tirmidhi (998)"
    },
    {
      "arabic": "سنن أبي داود (3132)",
      "english": "Sunan Abu Dawud (3132)"
    },
    {
      "arabic": "سنن ابن ماجه (1610)",
      "english": "Sunan Ibn Majah (1610)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن جعفر بن أبي طالب",
        "english": "Abdullah bin Ja'far bin Abi Talib"
      },
      "slug": "abdullah-bin-jafar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_rOun7K5bY",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہمدردی اور اخوت کا مظاہرہ",
        "english": "Display of Sympathy and Brotherhood"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میت کے گھر والوں کا خیال",
              "english": "Caring for the Bereaved"
            },
            "content": {
              "urdu": [
                "صدمے کی حالت میں انسان اپنی بنیادی ضروریات سے غافل ہو جاتا ہے۔",
                "پڑوسیوں اور رشتہ داروں کا فرض ہے کہ وہ ان کی خوراک کا انتظام کریں۔",
                "یہ عمل مسلمانوں کے درمیان باہمی ہمدردی اور جڑاؤ کو مضبوط کرتا ہے۔"
              ],
              "english": [
                "In states of grief, humans often neglect their basic survival needs.",
                "It is the duty of neighbors and relatives to arrange for their food.",
                "This act strengthens mutual sympathy and connection among Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی ﷺ کی پیروی",
              "english": "Following the Prophet's Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے سیدنا جعفر کی شہادت پر ان کے گھر کھانا بھیجا۔",
                "یہ طریقہ جاہلی رسموں کے برعکس ایک انسانی ہمدردی کا نمونہ ہے۔",
                "ہمیں دکھ کی گھڑی میں سنت کے مطابق دوسروں کا سہارا بننا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) sent food to Ja'far's home upon his martyrdom.",
                "This practice is a model of humanity, unlike pre-Islamic customs.",
                "We must support others according to Sunnah during times of sorrow."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور حدود",
        "english": "Juristic Rulings and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے کی نوعیت",
              "english": "Nature of the Food"
            },
            "content": {
              "urdu": [
                "کھانا اتنا ہونا چاہیے جو میت کے گھر والوں کے لیے کافی ہو۔",
                "اس کھانے میں اسراف یا نمائش سے مکمل اجتناب کرنا ضروری ہے۔",
                "اصل مقصد میت کے گھر والوں کی مشقت کو کم کرنا ہے نہ کہ ضیافت۔"
              ],
              "english": [
                "The food should be sufficient specifically for the bereaved family.",
                "It is essential to avoid wastefulness or show-off in this meal.",
                "The goal is to lessen their burden, not to hold a formal banquet."
              ]
            }
          },
          {
            "title": {
              "urdu": "میت کے گھر ضیافت کا حکم",
              "english": "Ruling on Feasts at the Deceased's Home"
            },
            "content": {
              "urdu": [
                "میت کے گھر والوں کا آنے والوں کے لیے کھانا بنانا مکروہ ہے۔",
                "صحابہ کرام میت کے ہاں اکٹھے ہونے اور کھانے کو نوحہ سمجھتے تھے۔",
                "تعزیت کے لیے آنے والوں کو وہاں بوجھ نہیں بننا چاہیے۔"
              ],
              "english": [
                "It is disliked for the bereaved family to cook for the visitors.",
                "The Companions viewed gathering for food at such times as wailing.",
                "Those coming for condolence should not become a burden on the family."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلط رسموں کا خاتمہ",
              "english": "Ending Wrong Customs"
            },
            "content": {
              "urdu": [
                "آج کل میت کے گھر بڑی ضیافتیں کرنا سنت کے صریح خلاف ہے۔",
                "غمزدہ خاندان پر مالی بوجھ ڈالنا ایک غیر اخلاقی فعل ہے۔",
                "معاشرے کو سادہ اور نبوی طریقوں کی طرف واپس لانا لازم ہے۔"
              ],
              "english": [
                "Holding large feasts at the deceased's home today contradicts Sunnah.",
                "Imposing financial burdens on a grieving family is an immoral act.",
                "It is necessary to bring society back to simple Prophetic ways."
              ]
            }
          },
          {
            "title": {
              "urdu": "پڑوسیوں کے حقوق",
              "english": "Rights of Neighbors"
            },
            "content": {
              "urdu": [
                "پڑوسی کا پہلا حق ہے کہ وہ مصیبت زدہ گھر کی خبر گیری کرے۔",
                "ایک دن اور رات کا کھانا فراہم کرنا سنت سے ثابت شدہ عمل ہے۔",
                "انسانیت کا تقاضا ہے کہ ضرورت کے وقت مخلصانہ مدد کی جائے۔"
              ],
              "english": [
                "The primary right of a neighbor is to check on a distressed home.",
                "Providing food for a day and night is proven from the Sunnah.",
                "Humanity demands offering sincere help during times of necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعزیت کا مقصد",
              "english": "Purpose of Condolence"
            },
            "content": {
              "urdu": [
                "تعزیت کا اصل مقصد غم بانٹنا اور صبر کی تلقین کرنا ہے۔",
                "عملی مدد کے ذریعے دکھ کو کم کرنا ایمان کی علامت ہے۔",
                "نبی ﷺ کی ہر نصیحت میں حکمت اور رحمت پوشیدہ ہے۔"
              ],
              "english": [
                "The core purpose of condolence is to share grief and urge patience.",
                "Reducing sorrow through practical help is a sign of true faith.",
                "In every advice of the Prophet (ﷺ), wisdom and mercy are hidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی طرزِ زندگی",
              "english": "Islamic Lifestyle"
            },
            "content": {
              "urdu": [
                "اسلام ہر نازک موقع پر انسان کو بہترین آداب سکھاتا ہے۔",
                "موت کے وقت بھی شریعت نے حقوق اور فرائض متعین کیے ہیں۔",
                "ایمان والے ایک جسم کی مانند ہیں، ایک کو تکلیف ہو تو سب تڑپتے ہیں۔"
              ],
              "english": [
                "Islam teaches the best etiquettes for every sensitive occasion.",
                "Even at death, Shariah has defined specific rights and duties.",
                "Believers are like one body; if one part hurts, all feel the pain."
              ]
            }
          }
        ]
      }
    }
  ]
}