{
  "hadithId": 842,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/19"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "ضعيف بهذا الإسناد وصحيح بمعناه . رواه أحمد (5/8)، وأبو داود (2088)، والترمذي (1110)، والنسائي (6/314). علته عنعنة الحسن البصري، لكن المعنى مجمع عليه عند الفقهاء.",
    "urdu": "یہ روایت اس سند کے ساتھ ضعیف ہے کیونکہ حسن بصری رحمہ اللہ مدلس ہیں، لیکن فقہاء کے نزدیک اس کا مفہوم صحیح اور مجمع علیہ ہے۔ اسے احمد، ابو داؤد اور ترمذی نے روایت کیا ہے۔",
    "english": "Weak with this chain due to the 'An'anah of Hasan al-Basri, but Sahih in meaning. Reported by Ahmad (5/8), Abu Dawud (2088), At-Tirmidhi (1110), and An-Nasa'i (6/314)."
  },
  "importantWords": [
    {
      "arabic": "أَيُّمَا",
      "english": "Whichever / Any",
      "urdu": "جو کوئی بھی"
    },
    {
      "arabic": "زَوَّجَهَا",
      "english": "Gave her in marriage",
      "urdu": "اس کا نکاح کر دیا"
    },
    {
      "arabic": "وَلِيَّانِ",
      "english": "Two guardians",
      "urdu": "دو ولی / سرپرست"
    },
    {
      "arabic": "لِلْأَوَّلِ",
      "english": "For the first one",
      "urdu": "پہلے والے کے لیے"
    },
    {
      "arabic": "مِنْهُمَا",
      "english": "From the two of them",
      "urdu": "ان دونوں میں سے"
    }
  ],
  "summary": {
    "urdu": "اگر دو مختلف ولی ایک ہی عورت کا نکاح دو الگ مردوں سے کر دیں، تو شرعی طور پر وہ پہلے نکاح کو معتبر مانا جائے گا جس کا ایجاب و قبول پہلے ہوا تھا۔",
    "english": "If two guardians marry the same woman to two different men, the first marriage contract that took place is the one considered legally valid in Sharia."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب النكاح، رقم الحديث ١١١٠",
      "english": "Jami` at-Tirmidhi, Book of Marriage, Hadith No. 1110"
    },
    {
      "arabic": "سنن أبي داود، كتاب النكاح، رقم الحديث ٢٠٨٨",
      "english": "Sunan Abi Dawud, Book of Marriage, Hadith No. 2088"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S4-Yy1nQY8k",
  "grade": {
    "arabic": "ضعيف (بسبب الانقطاع) / حسن عند الترمذي",
    "english": "Da'if (Due to interruption) / Hasan according to At-Tirmidhi"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دوہرے نکاح کی صورت اور حکم",
        "english": "Scenario and Ruling of Double Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پہلے نکاح کی فوقیت",
              "english": "Priority of the First Contract"
            },
            "content": {
              "urdu": [
                "اگر ایک عورت کے دو ولی (مثلاً باپ اور بھائی) الگ الگ جگہ نکاح کر دیں تو پہلا نکاح صحیح ہوگا۔",
                "نکاح کے صحیح ہونے کے لیے وقت کا تعین بنیادی شرط ہے، جس کا عقد پہلے ہوا وہی شوہر ہے۔",
                "دوسرا نکاح خود بخود باطل قرار دیا جائے گا کیونکہ عورت پہلے ہی منکوحہ ہو چکی تھی۔"
              ],
              "english": [
                "If two guardians marry a woman to different men, the contract that occurred first is valid.",
                "The timing of the marriage contract is the primary factor; the first to perform it is the husband.",
                "The second marriage is automatically void as the woman was already legally married."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کا علم نہ ہونے کی صورت",
              "english": "In Case of Unknown Timing"
            },
            "content": {
              "urdu": [
                "اگر یہ معلوم نہ ہو سکے کہ کون سا نکاح پہلے ہوا، تو دونوں نکاح فسخ کر دیے جائیں گے۔",
                "ایسی صورت میں تجدیدِ نکاح ضروری ہوگی تاکہ کسی ایک کا حق واضح ہو سکے۔",
                "اسلامی عدالت اس معاملے میں حتمی فیصلہ کرنے کی مجاز ہے۔"
              ],
              "english": [
                "If it cannot be determined which marriage came first, both contracts are annulled.",
                "In such a situation, a new marriage contract must be established to clarify rights.",
                "The Islamic court has the authority to issue a final ruling on such disputes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ولی کی ذمہ داریاں اور حدود",
        "english": "Responsibilities and Limits of the Guardian"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اولیاء کے درمیان ہم آہنگی",
              "english": "Coordination Between Guardians"
            },
            "content": {
              "urdu": [
                "ایک ہی عورت کے متعدد اولیاء ہونے کی صورت میں آپسی مشورہ اور رابطہ ضروری ہے۔",
                "بغیر اطلاع کے نکاح کر دینا خاندانی جھگڑوں اور قانونی پیچیدگیوں کا باعث بنتا ہے۔",
                "ولی کو چاہیے کہ وہ رشتہ طے کرنے سے پہلے دوسرے قریبی ذمہ داروں کو اعتماد میں لے۔"
              ],
              "english": [
                "When a woman has multiple guardians, coordination and consultation are essential.",
                "Marrying her off without mutual information leads to family disputes and legal issues.",
                "A guardian should consult other close relatives before finalizing a marriage contract."
              ]
            }
          },
          {
            "title": {
              "urdu": "لڑکی کی رضا مندی",
              "english": "The Woman's Consent"
            },
            "content": {
              "urdu": [
                "اس طرح کی الجھن سے بچنے کا بہترین طریقہ لڑکی سے براہِ راست مشورہ کرنا ہے۔",
                "اگر لڑکی نے ایک ولی کو اجازت دی ہے تو دوسرے کا نکاح کروانا معتبر نہیں ہوگا۔",
                "رضا مندی ہی نکاح کی روح ہے جس سے تمام تنازعات ختم ہو جاتے ہیں۔"
              ],
              "english": [
                "The best way to avoid such confusion is to consult the woman directly.",
                "If she authorized one guardian, a contract made by another would generally be invalid.",
                "Consent is the essence of marriage, which helps eliminate all potential disputes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور معاشرتی نظم",
        "english": "Juristic Wisdom and Social Order"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی فساد کا سدِ باب",
              "english": "Prevention of Social Discord"
            },
            "content": {
              "urdu": [
                "یہ قانون معاشرے میں عورت کے تحفظ اور خاندانی وقار کو برقرار رکھنے کے لیے ہے۔",
                "ایک وقت میں دو شوہروں کا تصور اسلام میں قطعی حرام اور غیر فطری ہے۔",
                "شریعت نے واضح ضابطے دے کر پیچیدہ مسائل کا حل پیش کر دیا ہے۔"
              ],
              "english": [
                "This law exists to maintain a woman's protection and family dignity in society.",
                "The concept of having two husbands at once is strictly forbidden and unnatural in Islam.",
                "Shariah provides clear regulations to resolve complex and overlapping legal issues."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوقِ زوجیت کا تحفظ",
              "english": "Protection of Marital Rights"
            },
            "content": {
              "urdu": [
                "پہلے شوہر کا حق مقدم ہے کیونکہ اس کا عقدِ نکاح پہلے مکمل ہو چکا تھا۔",
                "نکاح محض ایک رسمی معاہدہ نہیں بلکہ ایک ذمہ داری ہے جس میں سبقت کی اہمیت ہے۔",
                "یہ اصول خرید و فروخت اور دیگر معاہدوں میں بھی لاگو ہوتا ہے۔"
              ],
              "english": [
                "The first husband's right is prioritized because his contract was completed first.",
                "Marriage is not just a formal deal but a responsibility where precedence matters.",
                "This principle of 'first in time, first in right' applies to sales and other contracts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی مداخلت اور فیصلہ",
        "english": "Judicial Intervention and Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گواہوں کی اہمیت",
              "english": "Importance of Witnesses"
            },
            "content": {
              "urdu": [
                "وقت کے ثبوت کے لیے نکاح کے گواہوں کا بیان سب سے مستند ذریعہ مانا جاتا ہے۔",
                "نکاح کی تحریری دستاویز (نکاح نامہ) ایسے تنازعات میں بہترین ثبوت فراہم کرتی ہے۔",
                "اسلام گواہی کے نظام کو مضبوط بنانے کی تاکید کرتا ہے تاکہ حقوق ضائع نہ ہوں۔"
              ],
              "english": [
                "Testimony from marriage witnesses is the most authentic way to prove the timing.",
                "Written marriage documents (Nikahnama) provide excellent evidence in such disputes.",
                "Islam emphasizes strengthening the witness system so that rights are not lost."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناسمجھی اور غلطی کا ازالہ",
              "english": "Correction of Misunderstanding"
            },
            "content": {
              "urdu": [
                "اگر یہ عمل نادانی میں ہوا ہو تو دونوں ولی توبہ کریں اور غلطی کی اصلاح کریں۔",
                "اسلامی ریاست کا قاضی فریقین کے بیانات کی روشنی میں انصاف پر مبنی فیصلہ کرے گا۔",
                "دین میں سختی نہیں بلکہ ضابطہ ہے تاکہ انسانی زندگی پرسکون رہے۔"
              ],
              "english": [
                "If this act happened out of ignorance, both guardians should repent and correct the error.",
                "The judge of an Islamic state will issue a just ruling based on the parties' statements.",
                "Religion offers regulations rather than hardship, ensuring human life remains peaceful."
              ]
            }
          }
        ]
      }
    }
  ]
}