{
  "hadithId": 652,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/5"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2097)، ومسلم (715) واللفظ له. وفيه جواز بيع الدابة مع استثناء ركوبها.",
    "urdu": "یہ حدیث صحیح ہے، اسے بخاری (2097) اور مسلم (715) نے روایت کیا ہے۔ اس میں جانور بیچنے کے بعد اس پر سواری کی شرط لگانے کا جواز ملتا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2097) and Muslim (715). The wording is from Muslim. It proves the permissibility of selling an animal while stipulating its use for a trip."
  },
  "importantWords": [
    {
      "arabic": "أَعْيَا",
      "english": "Became tired / Exhausted",
      "urdu": "تھک گیا"
    },
    {
      "arabic": "يُسَيِّبَهُ",
      "english": "Set it free / Abandon it",
      "urdu": "اسے آزاد چھوڑ دینا"
    },
    {
      "arabic": "بِوُقِيَّةٍ",
      "english": "For an Uqiyah (Unit of silver)",
      "urdu": "ایک اوقیہ کے عوض"
    },
    {
      "arabic": "حُمْلَانَهُ",
      "english": "Riding it / Carriage",
      "urdu": "سوار ہو کر جانا"
    },
    {
      "arabic": "مَاكَسْتُكَ",
      "english": "Bargained with you",
      "urdu": "میں نے تم سے بھاؤ تاؤ کیا"
    },
    {
      "arabic": "نَقَدَنِي",
      "english": "Paid me in cash",
      "urdu": "مجھے نقد رقم دی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تجارت میں شرط لگانے کا جواز، نبی ﷺ کے معجزے اور آپ ﷺ کی سخاوت و مروت کا بیان ہے کہ آپ نے قیمت بھی دی اور اونٹ بھی واپس کر دیا۔",
    "english": "This Hadith illustrates the permissibility of making conditions in sales, a miracle of the Prophet (ﷺ), and his immense generosity in returning both the price and the camel."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساقاة",
      "english": "Sahih Muslim, Book of Musaqah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_Y_8eH4Syk",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیع میں شرط کا جواز",
        "english": "Validity of Conditions in Sale"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سودے میں فائدہ کی شرط",
              "english": "Condition of Benefit in Sale"
            },
            "content": {
              "urdu": [
                "اس حدیث سے ثابت ہوتا ہے کہ بیچنے والا کسی فائدے کی شرط رکھ سکتا ہے۔",
                "سیدنا جابر نے اونٹ بیچ کر گھر تک سواری کی شرط رکھی جو جائز قرار پائی۔",
                "ایسی شرائط جو عقد کے منافی نہ ہوں، وہ شرعی طور پر معتبر سمجھی جاتی ہیں۔"
              ],
              "english": [
                "This Hadith proves that a seller can stipulate a specific benefit in a sale.",
                "Jabir (RA) sold the camel but conditioned riding it home, which was permitted.",
                "Conditions that do not contradict the contract are legally binding in Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقد ادائیگی کی اہمیت",
              "english": "Importance of Cash Payment"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے سودا مکمل ہوتے ہی نقد قیمت ادا فرما دی۔",
                "تجارت میں وعدے کے مطابق رقم کی فوری ادائیگی سنتِ نبوی ہے۔",
                "یہ عمل فریقین کے درمیان اعتماد اور شفافیت کو فروغ دیتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) paid the full price in cash as soon as the deal was settled.",
                "Immediate payment as per agreement is a Sunnah in business transactions.",
                "This practice promotes trust and transparency between the buyer and seller."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا معجزہ اور شفقت",
        "english": "The Prophet's Miracle and Kindness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اونٹ کی حالت میں تبدیلی",
              "english": "Change in the Camel's Condition"
            },
            "content": {
              "urdu": [
                "تھکے ہوئے اونٹ کا آپ ﷺ کے چھونے سے تیز ہو جانا ایک واضح معجزہ ہے۔",
                "اللہ تعالیٰ نے آپ ﷺ کے ہاتھ اور دعا میں غیر معمولی برکت رکھی تھی۔",
                "یہ واقعہ صحابہ کے ایمان میں اضافے کا باعث بنا۔"
              ],
              "english": [
                "The exhausted camel becoming fast after the Prophet's touch is a clear miracle.",
                "Allah placed extraordinary blessings in the Prophet's touch and supplication.",
                "This event served as a means to increase the faith of the Companions."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کے ساتھ نرمی",
              "english": "Gentleness with Companions"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے جابر رضی اللہ عنہ کی مالی تنگی دور کرنے کے لیے اونٹ خریدا۔",
                "آپ ﷺ کا مقصد تجارت نہیں بلکہ اپنے صحابی کی مدد کرنا تھا۔",
                "حاکمِ وقت کو اپنے ماتحتوں کے حالات سے باخبر اور ہمدرد ہونا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) bought the camel to relieve Jabir's financial hardship.",
                "His primary goal was not trade but helping his companion in need.",
                "A leader should be aware of and empathetic toward the needs of subordinates."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عظیم سخاوت کا نمونہ",
        "english": "Example of Great Generosity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال اور قیمت دونوں کی واپسی",
              "english": "Returning Both Item and Price"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے جابر کو اونٹ بھی واپس کر دیا اور قیمت بھی تحفے میں دے دی۔",
                "یہ آپ ﷺ کے اخلاقِ کریمانہ کی بلندی کی روشن مثال ہے۔",
                "ایسی سخاوت صرف وہی کر سکتا ہے جسے اللہ کی رضا مقصود ہو۔"
              ],
              "english": [
                "The Prophet (ﷺ) returned the camel to Jabir and gifted him the price too.",
                "This is a shining example of the loftiness of the Prophet's noble character.",
                "Such generosity can only be displayed by one seeking Allah's pleasure alone."
              ]
            }
          },
          {
            "title": {
              "urdu": "بھاؤ تاؤ کی حقیقت",
              "english": "Reality of Bargaining"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے مزاحاً یا مصلحتاً بھاؤ تاؤ کیا تاکہ جابر کو ہچکچاہٹ نہ ہو۔",
                "تجارت میں جائز بھاؤ تاؤ کرنا سنت ہے اور اس میں کوئی برائی نہیں۔",
                "آپ ﷺ نے واضح کیا کہ میرا مقصد تمہیں نقصان پہنچانا نہیں تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) bargained to make Jabir feel comfortable with the transaction.",
                "Lawful bargaining in trade is a Sunnah and carries no negative connotation.",
                "He clarified that his intention was never to cause any loss to Jabir."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و اخلاقی اسباق",
        "english": "Practical and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروبار میں سچائی",
              "english": "Truthfulness in Business"
            },
            "content": {
              "urdu": [
                "سیدنا جابر نے اونٹ کے تھکے ہونے کی حقیقت کو نہیں چھپایا۔",
                "کاروبار میں ایمانداری اور چیز کے عیب کو واضح کرنا برکت کا باعث ہے۔",
                "نبی کریم ﷺ نے اس ایمانداری کو بہت پسند فرمایا۔"
              ],
              "english": [
                "Jabir (RA) did not hide the fact that the camel was exhausted.",
                "Honesty in business and disclosing defects leads to great blessings.",
                "The Prophet (ﷺ) highly appreciated this level of integrity."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحفہ اور ہدیہ کی اہمیت",
              "english": "Importance of Gifts"
            },
            "content": {
              "urdu": [
                "باہمی تعلقات میں تحفہ دینا محبت اور بھائی چارے کو بڑھاتا ہے۔",
                "آپ ﷺ کا اونٹ واپس کرنا جابر رضی اللہ عنہ کے لیے ایک بڑا اعزاز تھا۔",
                "ہمیں بھی اپنے دوستوں اور ضرورت مندوں کی اس طرح مدد کرنی چاہیے۔"
              ],
              "english": [
                "Giving gifts in mutual relationships increases love and brotherhood.",
                "Returning the camel was a huge honor and support for Jabir (RA).",
                "We should strive to help our friends and those in need in a similar manner."
              ]
            }
          }
        ]
      }
    }
  ]
}