{
  "hadithId": 1082,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/3"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه ابن ماجه (2901)، وأصله في البخاري (1520) بلفظ: \"جهادكن الحج\". وفي رواية أخرى: \"نعم الجهاد الحج\".",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابن ماجہ (2901) نے روایت کیا اور اس کی اصل صحیح بخاری (1520) میں موجود ہے۔ بخاری کے الفاظ میں 'تمہارا جہاد حج ہے' کے الفاظ مروی ہیں۔",
    "english": "Sahih. Reported by Ibn Majah (2901). Its origin is in Sahih al-Bukhari (1520) with the wording 'Your Jihad is Hajj.' Another narration mentions 'The best Jihad is Hajj.'"
  },
  "importantWords": [
    {
      "arabic": "جِهَادٌ",
      "english": "Struggle/Jihad",
      "urdu": "کوشش/جہاد"
    },
    {
      "arabic": "قِتَالَ",
      "english": "Fighting/Combat",
      "urdu": "لڑائی/جنگ"
    },
    {
      "arabic": "الْحَجُّ",
      "english": "The Pilgrimage",
      "urdu": "حج"
    },
    {
      "arabic": "الْعُمْرَةُ",
      "english": "The Lesser Pilgrimage",
      "urdu": "عمرہ"
    },
    {
      "arabic": "نَعَمْ",
      "english": "Yes",
      "urdu": "ہاں"
    },
    {
      "arabic": "النِّسَاءِ",
      "english": "Women",
      "urdu": "خواتین"
    }
  ],
  "summary": {
    "urdu": "خواتین کے لیے حج اور عمرہ کو جہاد کے قائم مقام قرار دیا گیا ہے کیونکہ اس میں بھی مالی اور جسمانی مشقت برداشت کرنی پڑتی ہے۔",
    "english": "Hajj and Umrah are declared as the equivalent of Jihad for women because both involve significant financial and physical exertion."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1520)",
      "english": "Sahih al-Bukhari (1520)"
    },
    {
      "arabic": "سنن ابن ماجه (2901)",
      "english": "Sunan Ibn Majah (2901)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواتین اور جہاد کا تصور",
        "english": "Women and the Concept of Jihad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میدانِ جنگ سے استثناء",
              "english": "Exemption from the Battlefield"
            },
            "content": {
              "urdu": [
                "اسلام نے خواتین کی عفت اور نازک طبع کی وجہ سے ان پر قتال فرض نہیں کیا۔",
                "خواتین پر میدانِ کارزار میں دشمن سے لڑنا واجب نہیں قرار دیا گیا ہے۔",
                "یہ حکم خواتین کے لیے اللہ کی طرف سے ایک بڑی آسانی اور رحمت ہے۔"
              ],
              "english": [
                "Islam does not obligate combat for women due to their nature and dignity.",
                "Fighting the enemy on the physical battlefield is not mandatory for them.",
                "This ruling is a significant ease and mercy from Allah for women."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجر و ثواب میں برابری",
              "english": "Equality in Reward"
            },
            "content": {
              "urdu": [
                "خواتین حج اور عمرہ کے ذریعے وہی اجر پا سکتی ہیں جو مرد جہاد سے پاتے ہیں۔",
                "نبی کریم ﷺ نے خواتین کے شوقِ جہاد کو حج کی طرف موڑ کر ان کی حوصلہ افزائی کی۔",
                "اسلام میں نیت اور درست عمل کے ذریعے ہر ایک کے لیے بلندی کے درجات ہیں۔"
              ],
              "english": [
                "Women can attain the same rewards through Hajj as men do through Jihad.",
                "The Prophet (ﷺ) encouraged women by directing their zeal for Jihad toward Hajj.",
                "In Islam, degrees of spiritual elevation are open to everyone through sincere intent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حج اور عمرہ بطور جہاد",
        "english": "Hajj and Umrah as Jihad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی اور جسمانی مشقت",
              "english": "Financial and Physical Exertion"
            },
            "content": {
              "urdu": [
                "حج میں سفر کی صعوبتیں اور عبادات کی مشقت جہاد سے مشابہت رکھتی ہیں۔",
                "اس میں بھی مال خرچ ہوتا ہے اور اللہ کے لیے وطن چھوڑنا پڑتا ہے۔",
                "حج مبرور کا ثواب جنت کے سوا کچھ نہیں جو کہ ایک عظیم کامیابی ہے۔"
              ],
              "english": [
                "The hardships of travel and worship in Hajj resemble the rigors of Jihad.",
                "It involves spending wealth and leaving one's homeland for the sake of Allah.",
                "The reward for an accepted Hajj is nothing but Paradise, a supreme success."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کے خلاف جہاد",
              "english": "Jihad Against the Self"
            },
            "content": {
              "urdu": [
                "حج کے دوران صبر و تحمل اور اخلاق کا مظاہرہ کرنا نفس کا جہاد ہے۔",
                "مجمع اور گرمی میں خود پر قابو رکھنا ایمان کی پختگی کی علامت ہے۔",
                "خواتین کے لیے یہ تربیت ان کی روحانی ترقی کا بہترین ذریعہ بنتی ہے۔"
              ],
              "english": [
                "Demonstrating patience and ethics during Hajj is a struggle against the self.",
                "Maintaining self-control in crowds and heat signifies firmness in faith.",
                "This training serves as the best means for spiritual growth for women."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کے دیگر سماجی کردار",
        "english": "Other Social Roles of Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھر کی تربیت گاہ",
              "english": "The Household Training Ground"
            },
            "content": {
              "urdu": [
                "خواتین کا اصل جہاد اپنی نسل کی بہترین اسلامی تربیت اور گھر کی حفاظت ہے۔",
                "ایک نیک ماں مجاہدین کی نسل تیار کرنے میں کلیدی کردار ادا کرتی ہے۔",
                "گھریلو ذمہ داریوں کو احسن طریقے سے نبھانا بھی اللہ کے ہاں اجر کا باعث ہے۔"
              ],
              "english": [
                "The primary Jihad for women is the Islamic upbringing of the next generation.",
                "A righteous mother plays a key role in preparing a generation of believers.",
                "Fulfilling household responsibilities excellently earns great rewards from Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاونت کا کردار",
              "english": "Supportive Role"
            },
            "content": {
              "urdu": [
                "تاریخِ اسلام میں خواتین نے جنگوں میں زخمیوں کی مرہم پٹی اور پانی پلانے کا کام کیا۔",
                "بوقتِ ضرورت خواتین دفاعی اور معاونتی خدمات انجام دے سکتی ہیں۔",
                "سیدہ عائشہ نے علم کی ترویج کے ذریعے امت کی فکری رہنمائی کا جہاد کیا۔"
              ],
              "english": [
                "In Islamic history, women served by nursing the wounded and providing water.",
                "When necessary, women can perform defensive and supportive services.",
                "Aishah (R.A) led a Jihad of knowledge by intellectually guiding the Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادات میں توازن",
              "english": "Balance in Worship"
            },
            "content": {
              "urdu": [
                "خواتین کو اپنے حالات کے مطابق افضل عبادات کا انتخاب کرنا چاہیے۔",
                "حج اور عمرہ کی ادائیگی کی بھرپور خواہش اور کوشش کرنی چاہیے۔",
                "دین میں ہر طبقے کے لیے اس کی استطاعت کے مطابق اجر کے دروازے کھلے ہیں۔"
              ],
              "english": [
                "Women should choose the best acts of worship according to their circumstances.",
                "They should have a strong desire and make efforts to perform Hajj and Umrah.",
                "Doors of reward are open for every group in religion according to their ability."
              ]
            }
          },
          {
            "title": {
              "urdu": "سوال پوچھنے کا شوق",
              "english": "Eagerness to Seek Knowledge"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کا سوال کرنا علم حاصل کرنے کی بہترین مثال ہے۔",
                "خواتین کو اپنے مسائل کے بارے میں اہل علم سے رہنمائی لینی چاہیے۔",
                "درست معلومات سے عمل میں پختگی اور یقین پیدا ہوتا ہے۔"
              ],
              "english": [
                "The questioning of Aishah (R.A) is an excellent example of seeking knowledge.",
                "Women should seek guidance from scholars regarding their specific issues.",
                "Correct information leads to firmness in practice and certainty in belief."
              ]
            }
          }
        ]
      }
    }
  ]
}