{
  "hadithId": 621,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bulugh/621"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1680)، ومسلم (1290).",
    "urdu": "صحیح۔ اسے امام بخاری (1680) اور امام مسلم (1290) نے روایت کیا ہے۔ یہ حدیث مزدلفہ سے منیٰ کی طرف کوچ کرنے کے وقت کے متعلق ایک اہم رخصت بیان کرتی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1680) and Muslim (1290). This Hadith discusses the concession for leaving Muzdalifah before dawn for those with valid excuses."
  },
  "importantWords": [
    {
      "arabic": "اِسْتَأْذَنَتْ",
      "english": "Asked permission",
      "urdu": "اجازت طلب کی"
    },
    {
      "arabic": "تَدْفَعَ",
      "english": "Depart / Leave",
      "urdu": "روانہ ہونا / کوچ کرنا"
    },
    {
      "arabic": "ثَبِطَةً",
      "english": "Slow / Heavy",
      "urdu": "بھاری جسم والی / سست رفتار"
    },
    {
      "arabic": "لَيْلَةَ اَلْمُزْدَلِفَةِ",
      "english": "Night of Muzdalifah",
      "urdu": "مزدلفہ کی رات"
    },
    {
      "arabic": "فَأَذِنَ لَهَا",
      "english": "He gave her permission",
      "urdu": "پس آپ ﷺ نے انہیں اجازت دے دی"
    }
  ],
  "summary": {
    "urdu": "مزدلفہ میں فجر تک رکنا سنت ہے، لیکن عورتوں، بوڑھوں اور کمزوروں کے لیے ہجوم سے بچنے کی خاطر آدھی رات کے بعد وہاں سے منیٰ روانہ ہونا جائز ہے۔",
    "english": "While staying in Muzdalifah until Fajr is Sunnah, it is permissible for women, the elderly, and the weak to depart for Mina after midnight to avoid the crowd."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1680)",
      "english": "Reported by Al-Bukhari (1680)"
    },
    {
      "arabic": "رواه مسلم (1290)",
      "english": "Reported by Muslim (1290)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "سودة بنت زمعة",
        "english": "Sauda bint Zam'a"
      },
      "slug": "sauda-bint-zama"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مزدلفہ سے روانگی اور شرعی رخصت",
        "english": "Departure from Muzdalifah and Legal Concession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معذورین کے لیے آسانی",
              "english": "Ease for the Vulnerable"
            },
            "content": {
              "urdu": [
                "اصل سنت یہ ہے کہ مزدلفہ میں رات گزاری جائے اور فجر کی نماز پڑھ کر روشنی ہونے تک دعا کی جائے۔",
                "نبی ﷺ نے ان لوگوں کو پہلے جانے کی اجازت دی جو ہجوم کی مشقت برداشت نہیں کر سکتے تھے۔",
                "سیدہ سودہ رضی اللہ عنہا کی مثال سے ثابت ہوا کہ جسمانی بھاری پن یا سست رفتاری ایک شرعی عذر ہے۔"
              ],
              "english": [
                "The original Sunnah is to stay in Muzdalifah overnight, pray Fajr, and supplicate until it is bright.",
                "The Prophet (ﷺ) permitted those who could not handle the crowd's hardship to leave earlier.",
                "Lady Sauda's (RA) case proves that physical heaviness or slow pace is a valid Sharia excuse."
              ]
            }
          },
          {
            "title": {
              "urdu": "روانگی کا وقت",
              "english": "Time of Departure"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک معذورین کے لیے چاند چھپنے کے بعد یا آدھی رات کے بعد روانہ ہونا جائز ہے۔",
                "اس رخصت کا مقصد یہ ہے کہ یہ لوگ عام لوگوں کے ہجوم سے پہلے منیٰ پہنچ کر رمی کر لیں۔",
                "جو لوگ تندرست اور طاقتور ہیں، ان کے لیے فجر تک رکنا ہی افضل ہے۔"
              ],
              "english": [
                "According to jurists, it is permissible for the vulnerable to leave after the moon sets or after midnight.",
                "The goal is to allow them to reach Mina and perform Ramy before the massive crowd arrives.",
                "For those who are healthy and strong, staying until Fajr remains the superior option."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجازت لینے کا ادب",
              "english": "Etiquette of Seeking Permission"
            },
            "content": {
              "urdu": [
                "سیدہ سودہ کا نبی ﷺ سے اجازت لینا ظاہر کرتا ہے کہ سفر میں امیرِ قافلہ کی اطاعت ضروری ہے۔",
                "بیوی کو چاہیے کہ وہ اہم معاملات میں اپنے شوہر کی مرضی اور مشورے کو شامل کرے۔",
                "صحابہ کرام نیکی کے کاموں میں بھی اپنی مرضی کے بجائے اللہ کے رسول ﷺ کی منشا کو مقدم رکھتے تھے۔"
              ],
              "english": [
                "Lady Sauda seeking the Prophet's (ﷺ) permission shows that obeying the caravan leader is necessary during travel.",
                "A wife should involve her husband's will and advice in significant matters.",
                "The Sahaba prioritized the Messenger's (ﷺ) guidance even in virtuous deeds over their own preferences."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں نرمی اور حکمت",
              "english": "Leniency and Wisdom in Religion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے سیدہ سودہ کے عذر کو قبول فرمایا، جو آپ ﷺ کی نرم مزاجی اور حکمت کو ظاہر کرتا ہے۔",
                "اسلامی شریعت میں تنگی نہیں ہے، بلکہ حالات کے مطابق لچک موجود ہے۔",
                "انتظامی امور میں لوگوں کی جسمانی حالت اور ضروریات کا لحاظ رکھنا سنتِ نبوی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) accepted Sauda's excuse, reflecting his kind nature and wisdom.",
                "Islamic Sharia does not impose hardship; it offers flexibility based on circumstances.",
                "Considering people's physical states and needs in administrative matters is a Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رمی جمار کا مسئلہ",
        "english": "The Issue of Stoning the Pillars"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پہلے رمی کرنا",
              "english": "Performing Ramy Early"
            },
            "content": {
              "urdu": [
                "جو لوگ مزدلفہ سے رات ہی کو روانہ ہوتے ہیں، وہ سورج نکلنے سے پہلے بھی جمرہ عقبہ کی رمی کر سکتے ہیں۔",
                "یہ رعایت ان خواتین اور بچوں کے لیے ہے جو ہجوم میں دبنے کا خطرہ محسوس کرتے ہیں۔",
                "نبی ﷺ نے اپنے گھر کے کمزور افراد کو اس طرح کی سہولتیں فراہم کیں۔"
              ],
              "english": [
                "Those departing Muzdalifah at night can stone the Jamrat al-Aqaba even before sunrise.",
                "This concession is specifically for women and children who fear being crushed in the crowd.",
                "The Prophet (ﷺ) personally provided such facilitations for the weak members of his household."
              ]
            }
          },
          {
            "title": {
              "urdu": "حج کا وقار",
              "english": "The Dignity of Hajj"
            },
            "content": {
              "urdu": [
                "حج ایک پروقار عبادت ہے، اسے جان لیوا مشقت نہیں بنانا چاہیے۔",
                "جہاں خطرہ ہو وہاں اللہ کی دی ہوئی رخصتوں سے فائدہ اٹھانا اللہ کو پسند ہے۔",
                "لوگوں کی جانوں کی حفاظت شعائرِ اللہ کی تعظیم کا حصہ ہے۔"
              ],
              "english": [
                "Hajj is a dignified act of worship; it should not be turned into life-threatening toil.",
                "Allah loves for His servants to use the concessions He provided where there is danger.",
                "Protecting human lives is part of honoring the Symbols of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی ہمدردی",
              "english": "Mutual Compassion"
            },
            "content": {
              "urdu": [
                "گھر کے سربراہ کو چاہیے کہ وہ اپنی خواتین اور کمزوروں کی جسمانی حالت کا خیال رکھے۔",
                "کسی پر اس کی طاقت سے زیادہ بوجھ ڈالنا اسلامی تعلیمات کے خلاف ہے۔",
                "نبی ﷺ کا اسوہ ہمیں دوسروں کے جذبات اور مجبوریوں کا احترام سکھاتا ہے۔"
              ],
              "english": [
                "A household head should be mindful of the physical condition of women and the weak.",
                "Imposing a burden beyond someone's capacity contradicts Islamic teachings.",
                "The Prophetic example teaches us to respect the feelings and constraints of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصت پر عمل کرنا",
              "english": "Acting upon Concessions"
            },
            "content": {
              "urdu": [
                "بعض اوقات 'افضل' کام چھوڑ کر 'رخصت' پر عمل کرنا زیادہ بہتر ہوتا ہے اگر اس میں کوئی مصلحت ہو۔",
                "دین میں غلو اور بے جا سختی سے بچنا چاہیے۔",
                "اصل نیکی اللہ اور اس کے رسول ﷺ کے احکامات کے مطابق ڈھل جانے میں ہے۔"
              ],
              "english": [
                "Sometimes, following a 'concession' is better than the 'ideal' act if there is a valid benefit.",
                "Extremism and unnecessary rigidity in religion should be avoided.",
                "True righteousness lies in conforming to the commands of Allah and His Messenger (ﷺ)."
              ]
            }
          }
        ]
      }
    }
  ]
}