{
  "hadithId": 376,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/3/23"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "كتاب الصلاة",
    "babId": 22
  },

  "takhreej": {
    "arabic": "رواه الطبراني في الأوسط (822) والدارقطني (2/3) من حديث ابن عمر. قال الحافظ ابن حجر في البلوغ: إسناده ضعيف، لكن له شواهد تؤيده من حديث جابر وغيره، مما يجعله مقبولاً فقهياً عند الجمهور.",
    "urdu": "اسے طبرانی (الاوسط: 822) اور دارقطنی نے روایت کیا ہے۔ حافظ ابن حجر کے مطابق اس کی سند ضعیف ہے، تاہم دیگر صحابہ جیسے حضرت جابر سے مروی شواہد اس کی تائید کرتے ہیں، جس کی بنیاد پر جمہور فقہاء اسے قبول کرتے ہیں۔",
    "english": "Reported by At-Tabarani in Al-Awsat (822) and Ad-Daraqutni. Though the chain is weak as noted by Al-Hafiz Ibn Hajar, it has supporting evidences from other narrations (e.g., from Jabir) that strengthen its legal application among the majority of scholars."
  },
  "importantWords": [
    {
      "arabic": "مُسَافِرٍ",
      "english": "Traveler",
      "urdu": "مسافر"
    },
    {
      "arabic": "جُمُعَةٌ",
      "english": "Friday Prayer",
      "urdu": "نمازِ جمعہ"
    },
    {
      "arabic": "لَيْسَ عَلَى",
      "english": "Not obligatory upon",
      "urdu": "لازم یا واجب نہیں"
    },
    {
      "arabic": "إِسْنَادٍ",
      "english": "Chain of narrators",
      "urdu": "سند"
    },
    {
      "arabic": "ضَعِيفٍ",
      "english": "Weak",
      "urdu": "کمزور"
    },
    {
      "arabic": "شواهد",
      "english": "Supporting evidences",
      "urdu": "شواہد / تائیدات"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ سفر کی حالت میں ہونے والے شخص پر جمعہ کی نماز فرض نہیں ہے، وہ اس کی جگہ ظہر ادا کر سکتا ہے۔",
    "english": "This Hadith clarifies that a person on a journey is exempted from the obligation of the Friday (Jumu'ah) prayer and should pray Zuhr instead."
  },
  "references": [
    {
      "arabic": "رواه الطبراني في الأوسط (822)",
      "english": "Reported by At-Tabarani in Al-Awsat (822)"
    },
    {
      "arabic": "رواه الدارقطني (2/3)",
      "english": "Reported by Ad-Daraqutni (2/3)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XhSjN9wO_i4",
  "grade": {
    "arabic": "ضعيف (وله شواهد)",
    "english": "Weak (but supported by other narrations)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسافر کے لیے شرعی رخصت",
        "english": "Legal Concession for the Traveler"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمعہ کی فرضیت کا ساقط ہونا",
              "english": "Exemption from Friday Prayer"
            },
            "content": {
              "urdu": [
                "اسلام میں مسافر کے لیے عبادات میں آسانی پیدا کی گئی ہے۔",
                "سفر کی مشقت کی وجہ سے مسافر پر جمعہ کی حاضری لازم نہیں ہے۔",
                "مسافر جمعہ کے وقت کے دوران ظہر کی نماز (قصر) ادا کرے گا۔"
              ],
              "english": [
                "Islam provides ease in acts of worship for the traveler.",
                "Due to the hardships of travel, Jumu'ah is not mandatory for them.",
                "The traveler performs the Zuhr prayer (shortened) during that time."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصت پر عمل کی حکمت",
              "english": "Wisdom Behind the Concession"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ اپنے بندوں کے لیے تنگی نہیں بلکہ آسانی چاہتا ہے۔",
                "دورانِ سفر خطبہ سننا اور باقاعدہ اجتماع میں شامل ہونا مشکل ہو سکتا ہے۔",
                "یہ رخصت دینِ اسلام کے اعتدال اور رحمت کی ایک بڑی مثال ہے۔"
              ],
              "english": [
                "Allah desires ease for His servants rather than hardship.",
                "Listening to the sermon and attending a congregation is difficult while traveling.",
                "This concession is a prime example of the moderation and mercy of Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور مذاہب",
        "english": "Jurisprudential Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Position of the Majority of Jurists"
            },
            "content": {
              "urdu": [
                "چاروں اماموں کے نزدیک مسافر پر جمعہ کی نماز فرض نہیں ہے۔",
                "اگرچہ یہ حدیث ضعیف ہے، مگر اس کا مفہوم دیگر صحیح احادیث سے ثابت ہے۔",
                "صحابہ کرام کا عمل بھی اسی رخصت کی تائید کرتا رہا ہے۔"
              ],
              "english": [
                "According to the four Imams, Jumu'ah is not obligatory for travelers.",
                "Though this specific chain is weak, the meaning is proven by Sahih reports.",
                "The practice of the Companions also confirms this legal exemption."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسافر اگر جمعہ پڑھے تو؟",
              "english": "What if a Traveler Joins Jumu'ah?"
            },
            "content": {
              "urdu": [
                "اگر مسافر کسی بستی میں قیام کے دوران جمعہ پڑھ لے تو جائز ہے۔",
                "ایسی صورت میں اس کا جمعہ ادا ہو جائے گا اور ظہر کی ضرورت نہیں۔",
                "یہ افضل ہے کہ اگر موقع ملے تو وہ برکت حاصل کرنے کے لیے جمعہ پڑھے۔"
              ],
              "english": [
                "If a traveler prays Jumu'ah while stopping in a town, it is valid.",
                "In this case, the Jumu'ah suffices and Zuhr is no longer required.",
                "It is better for the traveler to join if it does not cause distress."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی فنی حیثیت",
        "english": "Technical Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری کی وضاحت",
              "english": "Clarification of Chain Weakness"
            },
            "content": {
              "urdu": [
                "طبرانی کی سند میں عبد اللہ بن نافع جیسے راوی پر جرح موجود ہے۔",
                "مگر حدیث کے مفہوم کو امت میں تلقی بالقبول حاصل ہے۔",
                "ضعیف حدیث جب شواہد سے تقویت پائے تو قابلِ استدلال بن جاتی ہے۔"
              ],
              "english": [
                "The chain in At-Tabarani has narrators like Abdullah bin Nafi who are criticized.",
                "However, the core meaning has been widely accepted by the Ummah.",
                "A weak Hadith becomes reliable when supported by external evidences."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر معاون روایات",
              "english": "Other Supporting Traditions"
            },
            "content": {
              "urdu": [
                "حضرت جابر بن عبد اللہ سے بھی اسی طرح کی روایت منقول ہے۔",
                "فقہاء نے ان روایات کے مجموعے سے یہ شرعی اصول وضع کیا ہے۔",
                "اسی لیے اس مسئلے پر امت کا عملی اتفاق پایا جاتا ہے۔"
              ],
              "english": [
                "Similar traditions are narrated from Jabir bin Abdullah (RA).",
                "Jurists have derived this legal principle from the collective reports.",
                "Hence, there is a practical consensus in the Ummah on this matter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسافر کے لیے ہدایات",
              "english": "Guidelines for the Traveler"
            },
            "content": {
              "urdu": [
                "سفر شروع کرنے سے پہلے شرعی احکام کا علم حاصل کرنا ضروری ہے۔",
                "اگر دورانِ سفر جمعہ آئے تو پریشان ہونے کی ضرورت نہیں۔",
                "اپنے ساتھیوں کے ساتھ مل کر باجماعت ظہر ادا کی جا سکتی ہے۔"
              ],
              "english": [
                "It is essential to learn legal rulings before starting a journey.",
                "One should not worry if Jumu'ah occurs during the travel period.",
                "Zuhr can be performed in congregation with fellow travelers."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں تنگی کا نہ ہونا",
              "english": "No Hardship in Religion"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ کا احسان ہے کہ اس نے مسافر کو بوجھ سے بچایا۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ عبادت میں معیار اخلاص ہے نہ کہ مشقت۔",
                "رخصتوں پر عمل کرنا بھی سنت کی اتباع کا حصہ ہے۔"
              ],
              "english": [
                "It is a blessing from Allah that He spared the traveler from burden.",
                "This Hadith teaches that sincerity, not hardship, is the goal of worship.",
                "Acting upon valid concessions is also part of following the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
