{
  "hadithId": 435,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3141"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أحمد (6/267) ، وأبو داود (3141). والحديث يوضح خصوصية النبي صلى الله عليه وسلم في غسله، حيث غُسل في قميصه صيانةً لحرمته وتكريماً له.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام احمد (6/267) اور ابوداؤد (3141) نے روایت کیا ہے۔ یہ روایت نبی کریم ﷺ کے غسل کی انفرادی خصوصیت اور آپ ﷺ کی عظمت و حرمت کو بیان کرتی ہے۔",
    "english": "Hasan (Good). Reported by Ahmad (6/267) and Abu Dawud (3141). This narration explains the unique way the Prophet (ﷺ) was washed, remaining in his shirt as a mark of supreme honor and sanctity."
  },
  "importantWords": [
    {
      "arabic": "غَسْلَ",
      "english": "Washing / Ghusl",
      "urdu": "غسل دینا"
    },
    {
      "arabic": "نُجَرِّدُ",
      "english": "To undress / strip",
      "urdu": "کپڑے اتارنا / برہنہ کرنا"
    },
    {
      "arabic": "مَوْتَانَا",
      "english": "Our dead ones",
      "urdu": "ہمارے فوت شدگان"
    },
    {
      "arabic": "نَدْرِي",
      "english": "We know",
      "urdu": "ہم جانتے ہیں"
    },
    {
      "arabic": "الْقَمِيصِ",
      "english": "The shirt / garment",
      "urdu": "قمیص / کپڑا"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ کو عام مردوں کی طرح برہنہ کر کے غسل نہیں دیا گیا بلکہ اللہ کے حکم سے آپ ﷺ کو آپ کے قمیص سمیت غسل دیا گیا، جو آپ ﷺ کی خاص فضیلت ہے۔",
    "english": "The Prophet (ﷺ) was not undressed like other deceased persons; instead, by Allah's command, he was washed while wearing his shirt, highlighting his unique status."
  },
  "references": [
    {
      "arabic": "مسند أحمد (26315)",
      "english": "Musnad Ahmad (26315)"
    },
    {
      "arabic": "سنن أبي داود (3141)",
      "english": "Sunan Abu Dawud (3141)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYJvB0_V_wM",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کی خاص حرمت",
        "english": "Unique Sanctity of the Prophet (ﷺ)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غسل کا منفرد طریقہ",
              "english": "Unique Method of Washing"
            },
            "content": {
              "urdu": [
                "صحابہ کرام آپ ﷺ کے مقام و مرتبہ کی وجہ سے غسل کے معاملے میں متردد تھے۔",
                "اللہ تعالیٰ نے غیبی آواز کے ذریعے صحابہ کی رہنمائی فرمائی۔",
                "آپ ﷺ کو قمیص کے اوپر سے پانی ڈال کر غسل دیا گیا۔"
              ],
              "english": [
                "The companions were hesitant about the method of washing due to the Prophet's (ﷺ) status.",
                "Allah guided the companions through a miraculous voice from an unseen source.",
                "The Prophet (ﷺ) was washed by pouring water over his shirt rather than undressing him."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکریمِ نبوی ﷺ",
              "english": "Honoring the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کی مبارک میت کو عام انسانوں کی طرح برہنہ کرنا جائز نہ تھا۔",
                "یہ آپ ﷺ کی وہ خصوصیت ہے جو آپ کی حیات اور وفات دونوں میں قائم رہی۔",
                "اس عمل سے آپ ﷺ کے جسدِ اطہر کی بے پناہ حرمت واضح ہوتی ہے۔"
              ],
              "english": [
                "It was not permissible to undress the Prophet's (ﷺ) blessed body like ordinary humans.",
                "This is a specific privilege of the Prophet (ﷺ) that remained in both life and death.",
                "This act clarifies the immense sanctity of his pure and noble physical form."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کی محبت اور احتیاط",
        "english": "Companions' Love and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا ادب",
              "english": "The Manners of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام آپ ﷺ کے معاملے میں انتہائی درجے کی احتیاط برتتے تھے۔",
                "انہوں نے اپنی رائے کے بجائے غیبی حکم کا انتظار کیا۔",
                "یہ ادب ان کے پختہ ایمان اور محبتِ رسول ﷺ کی علامت ہے۔"
              ],
              "english": [
                "The companions exercised extreme caution regarding matters related to the Prophet (ﷺ).",
                "They waited for divine guidance rather than relying solely on their own opinions.",
                "This etiquette is a sign of their strong faith and deep love for the Messenger (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیرت اور استفسار",
              "english": "Wonder and Inquiry"
            },
            "content": {
              "urdu": [
                "صحابہ کا 'ہمیں نہیں معلوم' کہنا ان کی عاجزی کا اظہار تھا۔",
                "وہ جانتے تھے کہ نبی ﷺ کا معاملہ عام لوگوں جیسا نہیں ہے۔",
                "اللہ نے ان کی پریشانی دور کرنے کے لیے غیبی مدد فرمائی۔"
              ],
              "english": [
                "The companions saying 'We do not know' was an expression of their humility.",
                "They recognized that the status of the Prophet (ﷺ) was not like ordinary men.",
                "Allah provided miraculous assistance to resolve their confusion and distress."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عام میت کا غسل",
              "english": "Ghusl of Ordinary Deceased"
            },
            "content": {
              "urdu": [
                "عام میت کو غسل دیتے وقت کپڑے اتارنا مسنون اور جائز ہے۔",
                "میت کی ستر پوشی کا خیال رکھنا بہرحال ہر حال میں ضروری ہے۔",
                "نبی ﷺ کا معاملہ ایک استثنائی صورت تھی جو صرف آپ کے لیے تھی۔"
              ],
              "english": [
                "Undressing an ordinary deceased person for washing is Sunnah and permissible.",
                "It remains necessary to maintain the privacy (Satr) of the deceased at all times.",
                "The Prophet's (ﷺ) case was an exceptional circumstance specific only to him."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل دینے والے",
              "english": "Those Performing the Ghusl"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کو آپ کے خاندان کے قریبی افراد نے غسل دیا۔",
                "سیدہ عائشہ نے فرمایا کہ کاش آپ ﷺ کو آپ کی بیویاں غسل دیتیں۔",
                "اس سے ثابت ہوتا ہے کہ بیوی شوہر کو غسل دے سکتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was washed by close members of his immediate family.",
                "Lady Aisha remarked that she wished his wives had performed the washing.",
                "This indicates that it is permissible for a wife to wash her deceased husband."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمانی و تربیتی اسباق",
        "english": "Faith and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباع کا جذبہ",
              "english": "The Spirit of Following"
            },
            "content": {
              "urdu": [
                "دین کے نازک معاملات میں ہمیشہ شرعی رہنمائی کا انتظار کرنا چاہیے۔",
                "نبی ﷺ کی تعظیم ایمان کا جزوِ لازم ہے۔",
                "صحابہ کی زندگی ہمارے لیے ادب اور محبت کا بہترین نمونہ ہے۔"
              ],
              "english": [
                "One should always wait for Shariah guidance in sensitive religious matters.",
                "Venerating the Prophet (ﷺ) is an essential and core component of faith.",
                "The lives of the companions provide the best example of respect and love."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کے بعد بھی ادب",
              "english": "Respect Even After Death"
            },
            "content": {
              "urdu": [
                "اسلام نے مرنے کے بعد بھی انسان کی حرمت کا خیال رکھا ہے۔",
                "میت کے ساتھ وہی سلوک کریں جو اس کے وقار کے مطابق ہو۔",
                "نبی ﷺ کے معاملے میں یہ وقار انتہائی بلندی پر نظر آتا ہے۔"
              ],
              "english": [
                "Islam preserves the dignity of a human being even after their death.",
                "One must treat the deceased in a manner that befits their status and honor.",
                "In the case of the Prophet (ﷺ), this dignity is seen at its highest peak."
              ]
            }
          }
        ]
      }
    }
  ]
}