{
  "hadithId": 82,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["abudawud:15"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": " كذا بالأصل دون ذكر من أخرجه، ولم أجده من حديث جابر، وهو عند أحمد وأبي داود من حديث أبي سعيد. ضعيف. وانظر الأصل. ",
    "urdu": "یہ روایت ضعیف ہے۔ اصل حدیث میں راوی کا ذکر نہیں ہے، اور مجھے یہ جابر رضی اللہ عنہ سے نہیں ملی۔ البتہ امام احمد اور ابوداؤد نے اسے **ابوسعید رضی اللہ عنہ** کی حدیث سے روایت کیا ہے (ابوداؤد 15)۔ اگرچہ ابن السکن نے اسے صحیح کہا ہے، لیکن حدیث کی سند میں ضعف ہے۔",
    "english": "Da'if (Weak). The narrator is missing in the original source, and the Hadith is not found from Jabir (RA). However, Ahmad and Abu Dawud narrated a similar ruling from **Abu Sa'id al-Khudri** (Abu Dawud 15). Despite being authenticated by some, the chain contains a defect (Illah)."
  },
  "importantWords": [
    {
      "arabic": "تَغَوَّطَ",
      "english": "They defecate / relieve themselves",
      "urdu": "قضائے حاجت کریں"
    },
    {
      "arabic": "اَلرَّجُلَانِ",
      "english": "The two men",
      "urdu": "دو آدمی"
    },
    {
      "arabic": "فَلْيَتَوَارَ",
      "english": "Let him hide / conceal himself",
      "urdu": "پر دہ میں ہونا چاہیے"
    },
    {
      "arabic": "صَاحِبِهِ",
      "english": "His companion / friend",
      "urdu": "اپنے ساتھی"
    },
    {
      "arabic": "يَتَحَدَّثَا",
      "english": "They converse / talk",
      "urdu": "گفتگو کریں"
    },
    {
      "arabic": "يَمْقُتُ",
      "english": "Is greatly displeased / wrathful",
      "urdu": "ناراض ہوتے ہیں"
    },
    {
      "arabic": "مَعْلُول",
      "english": "Defective (Hadith term)",
      "urdu": "علت والی / ضعیف"
    },
    {
      "arabic": "سَتْر",
      "english": "Privacy / Covering",
      "urdu": "پردہ پوشی"
    },
    {
      "arabic": "أَدَب",
      "english": "Etiquette / Manners",
      "urdu": "آداب"
    },
    {
      "arabic": "ضَعْف",
      "english": "Weakness (in chain)",
      "urdu": "ضعف / کمزوری"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے انتہائی اہم آداب بیان کرتی ہے، جس میں یہ حکم ہے کہ دو لوگ ایک دوسرے کی نظروں سے **مکمل طور پر اوجھل** ہو کر رفع حاجت کریں اور اس حالت میں **باہم بات چیت** سے مکمل پرہیز کریں۔",
    "english": "This Hadith outlines crucial etiquette for relieving oneself, commanding that two individuals should **completely conceal themselves** from each other's view and **refrain from conversation** while answering the call of nature, as this displeases Allah."
  },
  "references": [
    {
      "arabic": "أخرجه أحمد (نحوه)",
      "english": "Reported by Ahmad (similar wording)"
    },
    {
      "arabic": "رواه أبو داود (15) (من حديث أبي سعيد)",
      "english": "Reported by Abu Dawud (15) (from the Hadith of Abu Sa'id)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جَابِرٍ  - رضى الله عنه",
        "english": "Jabir (May Allah be pleased with him)"
      },
      "slug": "jabir-ibn-abdullah"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "حسن لغيره",
    "english": "Hasan li-Ghairihi (Good due to external support)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قضائے حاجت کے دوران پردہ پوشی",
        "english": "Concealment During Relieving Oneself"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک دوسرے سے پردہ",
              "english": "Concealment from Each Other"
            },
            "content": {
              "urdu": [
                "حدیث کا پہلا حکم یہ ہے کہ جب دو لوگ کھلے مقام پر قضائے حاجت کریں تو **ہر ایک اپنے ساتھی سے مکمل پردہ کرے**۔",
                "یہ حکم اس بات کو یقینی بناتا ہے کہ ستر کسی دوسرے انسان کے سامنے بھی نہ کھلے، جو کہ حیا کا اعلیٰ ترین معیار ہے۔",
                "یہاں 'پر دہ' سے مراد صرف اوٹ نہیں بلکہ **نظروں سے اوجھل** ہونا ہے تاکہ ایک دوسرے کی شرمگاہیں نہ دیکھیں۔"
              ],
              "english": [
                "The first command dictates that when two individuals relieve themselves in an open place, **each must completely hide from his companion**.",
                "This ruling ensures that the private parts are not exposed even to another person, which is the highest standard of modesty (Haya).",
                "The intended concealment here means being **out of sight** to prevent them from seeing each other's private parts."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی ناراضگی کا سبب",
              "english": "Cause of Allah's Displeasure"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ کا اس فعل پر **ناراض ہونا (یمقت)** اس کی سنگینی کو ظاہر کرتا ہے، کیونکہ یہ شرم اور عفت کے خلاف ہے۔",
                "ایسا کرنا اسلامی آداب اور فطری حیا کے خلاف ہے، جس کی وجہ سے اللہ کی رحمت اور مدد سے محرومی کا خطرہ ہے۔",
                "یہ حکم مسلمانوں کو سکھاتا ہے کہ سب سے نجی معاملات میں بھی اللہ کی طرف سے مقرر کردہ حدود کی پاسداری کی جائے۔"
              ],
              "english": [
                "Allah's **displeasure (Yaqmut)** with this action highlights its severity, as it violates the sanctity of modesty and chastity.",
                "This act is contrary to Islamic manners and innate modesty (Fitrah), risking the loss of Allah's mercy and support.",
                "This ruling teaches Muslims to adhere strictly to the boundaries set by Allah, even in the most private affairs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قضائے حاجت کے دوران گفتگو کی ممانعت",
        "english": "Prohibition of Conversation During Relieving Oneself"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گفتگو سے ممانعت",
              "english": "Prohibition from Conversation"
            },
            "content": {
              "urdu": [
                "حدیث کا دوسرا اہم حکم یہ ہے کہ اس حالت میں **ایک دوسرے سے بات چیت نہ کی جائے**۔",
                "گفتگو نجاست کی جگہ پر، نجس چیز کے قریب اور ستر کھلا ہونے کی حالت میں ہوتی ہے، جو سخت ناپسندیدہ ہے۔",
                "یہ ممانعت بیت الخلاء کے اندر بھی عمومی بات چیت سے پرہیز کا تقاضا کرتی ہے، سوائے اشد ضرورت کے۔"
              ],
              "english": [
                "The second crucial command in the Hadith is the prohibition against **conversing with each other** in that state.",
                "Conversation takes place near filth, in a place of impurity, and while the private parts are exposed, which is highly detestable.",
                "This prohibition extends to general conversation even inside a dedicated lavatory, unless there is an absolute necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "آدابِ خلاء کی تکمیل",
              "english": "Completing the Etiquette of the Lavatory"
            },
            "content": {
              "urdu": [
                "قضائے حاجت کا وقت مکمل طور پر اس فعل کی طرف توجہ دینے اور صفائی حاصل کرنے کے لیے مخصوص ہونا چاہیے۔",
                "بات چیت یا پردہ نہ کرنے کی صورت میں انسان حیا کے بنیادی اصولوں سے غافل ہو جاتا ہے اور اللہ کی ناراضگی کا سبب بنتا ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام انسانی وقار اور پاکیزگی کو کتنی اہمیت دیتا ہے۔"
              ],
              "english": [
                "The time spent relieving oneself should be solely dedicated to the act itself and achieving cleanliness.",
                "By conversing or failing to conceal oneself, a person becomes heedless of the basic principles of modesty, inviting Allah's displeasure.",
                "This ruling proves the great importance Islam places on human dignity and ritual purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کا ضعف اور فقہی حکم",
        "english": "Weakness of the Chain and Juristic Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کا ضعف",
              "english": "The Weakness of the Hadith"
            },
            "content": {
              "urdu": [
                "جابر رضی اللہ عنہ کی سند ضعیف (معلول) ہے، کیونکہ اس میں راویوں کا اختلاف اور سند میں انقطاع پایا جاتا ہے۔",
                "تاہم، امام ابو داؤد اور احمد کی روایت **ابوسعید خدری** رضی اللہ عنہ سے موجود ہے جو اس حکم کی تائید کرتی ہے، جس سے اسے **حسن لغیرہ** کا درجہ ملا۔",
                "لہٰذا، اگرچہ یہ سند کمزور ہے، لیکن یہ حکم صحیح احادیث کے مجموعی مفہوم اور قیاس کے مطابق ہونے کی وجہ سے قابل عمل ہے۔"
              ],
              "english": [
                "The chain from Jabir (RA) is weak (Ma'lul) due to narrator inconsistencies and defects in the chain of transmission.",
                "However, the narration from **Abu Sa'id al-Khudri** reported by Imams Abu Dawud and Ahmad supports this ruling, elevating its status to **Hasan li-Ghairihi**.",
                "Thus, while this specific chain is weak, the ruling is enforceable as it aligns with the overall meaning of authentic Ahadith and sound analogy (Qiyas)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی طہارت کا حکم",
              "english": "Ruling on Communal Purity"
            },
            "content": {
              "urdu": [
                "یہ حدیث طہارت کے آداب کو **اجتماعی تناظر** میں بھی واضح کرتی ہے، یعنی دوسروں کے حقوق کا خیال رکھنا۔",
                "جب سفر یا مہمات کے دوران بیت الخلاء دستیاب نہ ہوں تو مسلمانوں کو ایک دوسرے سے دور ہو کر بیٹھنا چاہیے (بصری فاصلہ)۔ ",
                "اس حکم پر عمل دراصل اس بنیادی اصول کی پختگی کرتا ہے کہ **مسلمان وہ ہے جس کی زبان اور ہاتھ سے دوسرے مسلمان محفوظ رہیں**۔"
              ],
              "english": [
                "This Hadith clarifies the etiquette of purity even in a **communal context**, emphasizing respect for others' rights.",
                "During travel or expeditions when lavatories are unavailable, Muslims must distance themselves adequately from each other (visual separation). ",
                "Adhering to this reinforces the fundamental Islamic principle that **a Muslim is one from whose tongue and hand other Muslims are safe**."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روزمرہ زندگی میں عملی اطلاق",
        "english": "Practical Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیا اور عفت کی تربیت",
              "english": "Cultivating Modesty and Chastity"
            },
            "content": {
              "urdu": [
                "یہ حدیث بچوں اور بڑوں دونوں کو سکھاتی ہے کہ وہ شرم و حیا کی قدر کو سب سے زیادہ مقدم رکھیں۔",
                "عفت کے آداب کا تقاضا ہے کہ نہ صرف دوسروں کے سامنے بلکہ تنہائی میں بھی بے جا برہنگی سے پرہیز کیا جائے۔",
                "نماز کی تیاری کے دوران اور نجی ضروریات کی تکمیل میں یہ آداب حیا کو تقویت دیتے ہیں۔"
              ],
              "english": [
                "This Hadith teaches both children and adults to prioritize the value of modesty (Haya) above all else.",
                "The etiquette of chastity requires avoiding unnecessary nakedness not only in front of others but also when alone.",
                "Adherence to these manners during private necessities strengthens the feeling of modesty, crucial for preparing for prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیت الخلاء میں خاموشی",
              "english": "Silence in the Lavatory"
            },
            "content": {
              "urdu": [
                "گفتگو سے ممانعت کا حکم آج کے دور کے جدید بیت الخلاء میں بھی لاگو ہوتا ہے، جہاں بات چیت سے بچنا چاہیے۔",
                "اس کے تحت فون پر بات کرنے یا بلند آواز میں سلام کا جواب دینے سے بھی اجتناب کیا جانا چاہیے۔",
                "مقصد یہ ہے کہ یہ جگہ صرف طہارت کے لیے مخصوص رہے اور اس کا تقدس برقرار رکھا جائے۔"
              ],
              "english": [
                "The prohibition against conversation applies even in modern lavatories today; unnecessary chatting should be avoided.",
                "This extends to refraining from taking phone calls or responding loudly to greetings while inside the washroom.",
                "The objective is to dedicate this space solely for purification and to maintain its specific functional sanctity."
              ]
            }
          }
        ]
      }
    }
  ]
}
