{
  "hadithId": 112,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["Tirmidhi 124", "Bazzar 310"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب التيمم (Tayamum)",
    "babId": 9
  },

  "takhreej": {
    "arabic": "صحيح. رواه البزار (310 زوائد) وما بعده يشهد له. صحيح. رواه الترمذي (124) ولفظه: \"إن الصعيد الطيب طهور المسلم، وإن لم يجد الماء عشر سنين، فإذا وجد الماء فليمسه بشرته؛ فإن ذلك خير\" وقال: \"حديث حسن صحيح\".",
    "urdu": "صحیح (درست) حدیث۔ اسے بزار (310 زوائد) نے روایت کیا ہے اور اس کی تائید دیگر روایات سے ہوتی ہے۔ ترمذی (124) میں ابوذر کی روایت کا متن ہے: 'بلاشبہ پاکیزہ مٹی مسلمان کا طہور (پاک کرنے کا ذریعہ) ہے، خواہ اسے دس سال تک پانی نہ ملے۔ پھر جب اسے پانی مل جائے تو اسے اپنے جسم پر ملنا چاہیے، کیونکہ یہ بہتر ہے۔' اور ترمذی نے کہا: 'یہ حدیث حسن صحیح ہے۔'",
    "english": "Sahih (Authentic). Reported by Al-Bazzar (310, Zawa'id), and subsequent narrations support it. The wording in At-Tirmidhi (124) from Abu Dharr is: 'Indeed, clean and good earth is the purifier for the Muslim, even if he does not find water for ten years. Then, when he finds water, let him touch his skin with it, for that is better.' And At-Tirmidhi graded it 'Hasan Sahih' (Good and Authentic)."
  },
  "importantWords": [
    {
      "arabic": "اَلصَّعِيدُ",
      "english": "The clean earth/dust",
      "urdu": "پاک مٹی/زمین"
    },
    {
      "arabic": "وُضُوءُ",
      "english": "Ablution/Purification",
      "urdu": "وضو/طہارت"
    },
    {
      "arabic": "عَشْرَ سِنِينَ",
      "english": "Ten years",
      "urdu": "دس برس"
    },
    {
      "arabic": "وَجَدَ",
      "english": "He finds",
      "urdu": "اسے مل جائے"
    },
    {
      "arabic": "فَلْيَتَّقِ اَللَّهَ",
      "english": "Then let him fear Allah",
      "urdu": "تو اللہ سے ڈرنا چاہیئے"
    },
    {
      "arabic": "لْيُمِسَّهُ",
      "english": "Let him touch it to",
      "urdu": "اسے پہنچانا چاہیئے"
    },
    {
      "arabic": "بَشَرَتَهُ",
      "english": "His skin/body",
      "urdu": "اپنے جسم/جلد کو"
    },
    {
      "arabic": "طَهُور",
      "english": "Purifier",
      "urdu": "پاک کرنے والا"
    },
    {
      "arabic": "إِرْسَالَه",
      "english": "Its Mursal status",
      "urdu": "اس کا مرسل ہونا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ پانی کی عدم دستیابی پر تیمم کی اجازت ہمیشہ کے لیے ہے، لیکن جیسے ہی پانی دستیاب ہو جائے تو اللہ کے حکم کی پیروی کرتے ہوئے اصل طہارت (پانی سے غسل یا وضو) کو اختیار کرنا فرض ہو جاتا ہے۔",
    "english": "This Hadith clarifies that the permission for Tayammum is permanent during water scarcity, even for a long period, but upon finding water, it becomes an obligation to fear Allah and immediately transition to major purification (Wudu' or Ghusl) using the water."
  },
  "references": [
    {
      "arabic": "رواه البزار (310 زوائد)",
      "english": "Reported by Al-Bazzar (310 Zawa'id)"
    },
    {
      "arabic": "رواه الترمذي (124)",
      "english": "Reported by At-Tirmidhi (124)"
    },
    {
      "arabic": "صححه ابن القطان والحاكم",
      "english": "Authenticated by Ibn Al-Qattan and Al-Hakim"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurayrah"
      },
      "slug": "abu-hurayrah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو ذر الغفاري",
        "english": "Abu Dharr Al-Ghifari"
      },
      "slug": "abu-dharr-al-ghifari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=hadith_tayammum_112",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تیمم کی مدت اور حکم",
        "english": "Duration and Ruling of Tayammum"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لامحدود اجازت",
              "english": "Unlimited Permission"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ اگر کسی شخص کو برسوں پانی نہ ملے تو وہ پاک مٹی کے ذریعے طہارت حاصل کر سکتا ہے۔",
                "لفظ 'دس برس تک' مدت کی لامتناہیت کو ظاہر کرتا ہے، نہ کہ کوئی حتمی حد مقرر کرتا ہے۔",
                "یہ حکم شریعت کی آسانی اور یہ کہ عبادت (نماز) کسی بھی حال میں ترک نہیں کی جا سکتی، کی دلیل ہے۔"
              ],
              "english": [
                "This Hadith explicitly states that a person may continue to use Tayammum for purification if they cannot find water, even for years.",
                "The phrase 'for ten years' signifies the unlimited duration of this permission, rather than setting a fixed time limit.",
                "This rule demonstrates the ease of the Shariah and the principle that worship (Salah) must not be abandoned under any circumstance."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقیقی طہارت کی طرف واپسی",
              "english": "Reverting to True Purification"
            },
            "content": {
              "urdu": [
                "حدیث کا اگلا حصہ اصل طہارت (پانی) کی موجودگی میں تیمم کے حکم کو منسوخ کر دیتا ہے۔",
                "جب پانی مل جائے تو 'فَلْيَتَّقِ اَللَّهَ' کا مطلب ہے کہ اللہ سے ڈرو اور شرعی حکم کی پیروی کرو۔",
                "یہ اس بات کی دلیل ہے کہ پانی طہارت کا اصل ذریعہ ہے اور تیمم صرف عذر کی حالت میں عارضی متبادل ہے۔"
              ],
              "english": [
                "The latter part of the Hadith abrogates the ruling of Tayammum once the primary purifying agent (water) is found.",
                "The command 'Falyattaqi Allaha' (let him fear Allah) means one must adhere to the obligatory Shariah ruling when able.",
                "This proves that water is the original means of purification, and Tayammum is merely a temporary substitute during incapacity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور احکام",
        "english": "Jurisprudential Issues and Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیمم کے بعد نماز",
              "english": "Prayer After Tayammum"
            },
            "content": {
              "urdu": [
                "اگر کسی شخص نے تیمم کر کے نماز ادا کر لی اور پھر اسے پانی مل جائے تو اس کی نماز صحیح ہو گی۔",
                "فقہاء کے صحیح قول کے مطابق، اسے اس نماز کو دوبارہ دہرانے کی ضرورت نہیں ہے کیونکہ اس نے حکم الٰہی کی تعمیل کی تھی۔",
                "یہ حکم امت پر اللہ کی رحمت اور فضل کو ظاہر کرتا ہے تاکہ نماز کی ادائیگی میں کوئی رکاوٹ نہ ہو۔"
              ],
              "english": [
                "If a person performs Tayammum and prays, and then finds water, his prayer is valid and accepted.",
                "According to the soundest juristic opinion, he is not required to repeat that specific prayer because he fulfilled the divine command at the time.",
                "This ruling demonstrates Allah's mercy and grace upon the Ummah, ensuring there is no hindrance to performing Salah."
              ]
            }
          },
          {
            "title": {
              "urdu": "صعید کا مفہوم",
              "english": "Meaning of 'Sa'id'"
            },
            "content": {
              "urdu": [
                "'الصعید' سے مراد پاک زمین کی سطح ہے، خواہ وہ مٹی ہو، ریت ہو یا پتھر، جس پر گرد و غبار موجود ہو۔",
                "امام شافعی، امام احمد اور امام مالک کے نزدیک مٹی کے علاوہ پاک زمین کے اجزاء بھی تیمم کے لیے کافی ہیں۔",
                "یہ حکم طہارت کو صرف ایک عنصر (مٹی) تک محدود نہیں کرتا بلکہ طہارت کے مقصد کو وسیع کرتا ہے۔"
              ],
              "english": [
                "'As-Sa'id' refers to the surface of clean earth, whether it is soil, sand, or stone, as long as it has some dust on it.",
                "Imams Shafi'i, Ahmad, and Malik hold that clean earth elements other than just soft soil are sufficient for performing Tayammum.",
                "This ruling does not restrict purification to a single element but broadens the scope of available purifying agents."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی صحت اور دلائل",
        "english": "Authenticity and Evidences of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دارقطنی کا موقف",
              "english": "Ad-Daraqutni's Stance"
            },
            "content": {
              "urdu": [
                "اگرچہ دارقطنی نے ابو ہریرہ رضی اللہ عنہ کی روایت کو مرسل (صحابی کا نام حذف) قرار دیا، جو اس کی سند کو کمزور کرتا ہے۔",
                "لیکن مرسل ہونے کے باوجود، ابوذر رضی اللہ عنہ کی صحیح حدیث اس مفہوم کی مکمل تائید کرتی ہے۔",
                "اس لیے علماء نے اس حکم کو صحیح مانا ہے اور اسے فقہی استدلال کے لیے استعمال کیا ہے۔"
              ],
              "english": [
                "Although Ad-Daraqutni judged Abu Hurayrah's narration as Mursal (lacking a Companion in the chain), which weakens its direct attribution.",
                "However, the authentic Hadith of Abu Dharr (RA) fully corroborates the meaning and ruling contained within this text.",
                "Therefore, scholars have accepted this ruling and used it for jurisprudential derivation due to its overall strength through corroborating evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور عمل",
              "english": "Piety and Action"
            },
            "content": {
              "urdu": [
                "حدیث کا جملہ 'فَلْيَتَّقِ اَللَّهَ' مسلمان کو پاکیزگی کے معاملے میں تقویٰ کی تعلیم دیتا ہے۔",
                "تقویٰ کا مطلب ہے کہ عذر ختم ہوتے ہی آسانی کو چھوڑ کر اصل حکم کی طرف رجوع کیا جائے۔",
                "جس طرح نماز کے لیے وقت کی پابندی ضروری ہے، اسی طرح پانی کی دستیابی پر فوراً استعمال بھی ضروری ہے۔"
              ],
              "english": [
                "The phrase 'Falyattaqi Allaha' (let him fear Allah) instructs the Muslim to maintain piety and heedfulness in matters of purification.",
                "Piety here means immediately abandoning the concession when the necessity is gone and returning to the primary command.",
                "Just as punctuality is essential for prayer, the immediate use of water upon its availability is also obligatory."
              ]
            }
          }
        ]
      }
    }
  ]
}
