{
  "hadithId": 1343,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh:1522"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "كتاب الجامع",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه النسائي في عمل اليوم والليلة (67)، وأبو داود (521)، والترمذي (212)، وأحمد (3/119). وصححه الألباني في صحيح الجامع (3408).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام نسائی، ابوداؤد، اور ترمذی نے روایت کیا ہے۔ علامہ البانی نے اسے 'صحیح الجامع' میں صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic). Reported by An-Nasa'i, Abu Dawud (521), At-Tirmidhi (212), and Ahmad. Authenticated by Al-Albani in Sahih al-Jami' (3408)."
  },
  "importantWords": [
    {
      "arabic": "الدُّعَاءُ",
      "english": "Supplication",
      "urdu": "دعا / پکار"
    },
    {
      "arabic": "الأَذَانِ",
      "english": "Call to prayer",
      "urdu": "اذان"
    },
    {
      "arabic": "الإِقَامَةِ",
      "english": "Second call to prayer",
      "urdu": "اقامت"
    },
    {
      "arabic": "لَا يُرَدُّ",
      "english": "Is not rejected",
      "urdu": "رد نہیں کی جاتی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث دعا کی قبولیت کے ایک خاص اور سنہری وقت کی نشاندہی کرتی ہے کہ جب اذان ہو جائے اور ابھی نماز کی اقامت نہ ہوئی ہو، تو اس درمیانی وقت میں مانگی گئی دعا اللہ کے ہاں بہت مقبول ہوتی ہے۔",
    "english": "This Hadith points out a golden opportunity for the acceptance of supplication: the interval between the Adhan and the Iqamah is a time when prayers are highly likely to be answered by Allah."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (521)",
      "english": "Sunan Abu Dawud (521)"
    },
    {
      "arabic": "سنن الترمذي (212)",
      "english": "Sunan at-Tirmidhi (212)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبولیتِ دعا کا خاص وقت",
        "english": "A Special Time for Acceptance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی اہمیت",
              "english": "The Significance of the Interval"
            },
            "content": {
              "urdu": [
                "اذان اور اقامت کے درمیان کا وقت اللہ کی رحمت کے نزول کا وقت ہوتا ہے۔",
                "اس وقت بندہ نماز کے انتظار میں ہوتا ہے، اور نماز کا انتظار کرنا خود ایک عبادت ہے۔",
                "نبی ﷺ نے اس مبارک وقت کو ضائع کرنے کے بجائے اللہ سے اپنی حاجتیں مانگنے کا حکم دیا۔"
              ],
              "english": [
                "The time between Adhan and Iqamah is a period when Allah's mercy descends.",
                "During this time, the believer is waiting for prayer, and waiting for prayer is itself an act of worship.",
                "The Prophet (ﷺ) encouraged asking Allah for one's needs during this blessed time instead of wasting it."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا رد نہ ہونے کا مطلب",
              "english": "The Meaning of 'Not Rejected'"
            },
            "content": {
              "urdu": [
                "اس کا مطلب یہ ہے کہ اللہ تعالیٰ اس وقت کی دعا کو خاص اہمیت دیتا ہے اور اسے ضرور قبول فرماتا ہے۔",
                "قبولیت کی صورتیں مختلف ہو سکتی ہیں: یا تو وہی چیز مل جاتی ہے، یا کوئی بلا ٹل جاتی ہے، یا وہ آخرت کے لیے ذخیرہ ہو جاتی ہے۔",
                "مومن کو اس وعدہِ نبوی پر پختہ یقین رکھتے ہوئے دعا کرنی چاہیے۔"
              ],
              "english": [
                "It means that Allah gives special attention to supplications during this time and answers them.",
                "Acceptance can take various forms: granting the request, averting an evil, or storing the reward for the Hereafter.",
                "A believer should supplicate with firm faith in this Prophetic promise."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کیا مانگا جائے؟",
        "english": "What Should One Ask For?"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عافیت کا سوال",
              "english": "Asking for 'Afiyah"
            },
            "content": {
              "urdu": [
                "جامع ترمذی کی ایک روایت میں ہے کہ صحابہ نے پوچھا: 'ہم کیا مانگیں؟' آپ ﷺ نے فرمایا: 'اللہ سے دنیا اور آخرت کی عافیت مانگو'۔",
                "عافیت ایک جامع دعا ہے جس میں بیماریوں، فتنوں اور پریشانیوں سے نجات شامل ہے۔",
                "اپنے لیے، اپنے والدین اور پوری امت کے لیے دعائے خیر کرنی چاہیے۔"
              ],
              "english": [
                "In a narration of At-Tirmidhi, the Sahaba asked, 'What should we say?' He (ﷺ) replied, 'Ask Allah for 'Afiyah (well-being) in this world and the Hereafter.'",
                "‘Afiyah is a comprehensive prayer that includes safety from illnesses, trials, and worries.",
                "One should pray for themselves, their parents, and the entire Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد میں جلد حاضری",
              "english": "Early Arrival at the Mosque"
            },
            "content": {
              "urdu": [
                "اس فضیلت کو پانے کے لیے ضروری ہے کہ اذان ہوتے ہی مسجد کا رخ کیا جائے۔",
                "اذان کا جواب دینے کے بعد اور اقامت سے پہلے کے منٹوں کو موبائل یا باتوں میں ضائع کرنے کے بجائے دعا میں صرف کریں۔",
                "خواتین گھروں میں اذان کے فوراً بعد مصلے پر بیٹھ کر یہ برکت حاصل کر سکتی ہیں۔"
              ],
              "english": [
                "To attain this virtue, it is necessary to head to the mosque as soon as the Adhan is called.",
                "Instead of wasting the minutes after the Adhan response and before the Iqamah on phones or talking, spend them in Du'a.",
                "Women can attain this blessing at home by sitting on their prayer mat immediately after the Adhan."
              ]
            }
          }
        ]
      }
    }
  ]
}