{
  "hadithId": 595,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/595"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 39
  },
  
  "takhreej": {
    "arabic": "حسن. رواه الترمذي (830)، والدارقطني (2/221)، والبيهقي (5/32). وقال الترمذي: 'حسن غريب'. وله شواهد من حديث عائشة وابن عباس تقوي معناه.",
    "urdu": "حسن روایت ہے۔ اسے ترمذی (830)، دارقطنی (2/221) اور بیہقی (5/32) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن غریب کہا ہے، اور سیدہ عائشہ و ابن عباس کی روایات اس کی تائید کرتی ہیں۔",
    "english": "Hasan. Reported by At-Tirmidhi (830), Ad-Daraqutni (2/221), and Al-Bayhaqi (5/32). At-Tirmidhi classified it as Hasan Gharib, and it has supporting narrations from Aisha and Ibn Abbas."
  },
  "importantWords": [
    {
      "arabic": "تَجَرَّدَ",
      "english": "Took off clothes / Divested",
      "urdu": "کپڑے اتارے / علیحدہ کیا"
    },
    {
      "arabic": "إِهْلَالِهِ",
      "english": "Raising voice for Ihram",
      "urdu": "احرام کے لیے لبیک پکارنا"
    },
    {
      "arabic": "اغْتَسَلَ",
      "english": "Took a bath / Ghusl",
      "urdu": "غسل کیا"
    },
    {
      "arabic": "إِحْرَام",
      "english": "State of Consecration",
      "urdu": "احرام باندھنا"
    },
    {
      "arabic": "سُنَّة",
      "english": "Prophetic Tradition",
      "urdu": "سنت"
    }
  ],
  "summary": {
    "urdu": "حج یا عمرہ کا احرام باندھنے سے پہلے غسل کرنا اور سلے ہوئے کپڑے اتار کر احرام کی چادریں پہننا سنتِ نبوی ہے۔",
    "english": "It is a Prophetic Sunnah to take a bath (Ghusl) and remove stitched garments before entering the state of Ihram for Hajj or Umrah."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (830)",
      "english": "Reported by At-Tirmidhi (830)"
    },
    {
      "arabic": "سنن الدارقطني (2/221)",
      "english": "Sunan Ad-Daraqutni (2/221)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "زيد بن ثابت",
        "english": "Zaid bin Thabit"
      },
      "slug": "zaid-bin-thabit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احرام کے لیے غسل کی اہمیت",
        "english": "Significance of Ghusl for Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صفائی اور ستھرائی",
              "english": "Cleanliness and Purification"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا احرام سے پہلے غسل کرنا اس بات کی دلیل ہے کہ اسلام صفائی کو کس قدر اہمیت دیتا ہے۔",
                "یہ غسل صرف جسمانی ناپاکی دور کرنے کے لیے نہیں بلکہ ایک عظیم عبادت کی تیاری کے لیے ہے۔",
                "اس سے انسان تروتازہ ہو کر عبادت میں بہتر طور پر مشغول ہو سکتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) Ghusl before Ihram proves the great importance Islam places on hygiene.",
                "This bath is not just to remove impurity but to prepare spiritually for a major act of worship.",
                "It helps the individual feel refreshed and fully engaged in the upcoming rituals."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل کا شرعی حکم",
              "english": "Legal Status of this Ghusl"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک احرام کے لیے غسل کرنا سنتِ مؤکدہ ہے، واجب نہیں ہے۔",
                "اگر پانی میسر نہ ہو یا کوئی عذر ہو تو تیمم کی ضرورت نہیں کیونکہ یہ غسل نظافت (صفائی) کے لیے ہے۔",
                "حائضہ عورت کے لیے بھی احرام کے وقت غسل کرنا مسنون ہے تاکہ میل کچیل صاف ہو جائے۔"
              ],
              "english": [
                "Most jurists consider taking a bath for Ihram to be an emphasized Sunnah, not obligatory.",
                "If water is unavailable, Tayammum is not required as this Ghusl is primarily for cleanliness.",
                "Even for menstruating women, taking this Ghusl is Sunnah to ensure physical purity before Ihram."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تجرد اور لباسِ احرام",
        "english": "Divestment and Ihram Clothing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سلے ہوئے کپڑوں سے علیحدگی",
              "english": "Removing Stitched Clothing"
            },
            "content": {
              "urdu": [
                "حدیث میں 'تجرد' کا مطلب تمام سلے ہوئے کپڑے اتار کر غیر سلا لباس پہننا ہے۔",
                "یہ عمل انسان کو دنیاوی جاہ و جلال اور امتیازات سے پاک کر کے اللہ کے حضور عاجز بناتا ہے۔",
                "احرام کی چادریں امیر اور غریب کے درمیان فرق کو مٹا کر مساوات کا درس دیتی ہیں۔"
              ],
              "english": [
                "The term 'Tajarrud' in the Hadith refers to removing all stitched garments for unstitched ones.",
                "This act strips a person of worldly status and distinctions, making them humble before Allah.",
                "Ihram sheets erase the visible gap between the rich and poor, teaching the lesson of equality."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت اور تلبیہ کا سنگم",
              "english": "Merging Intention and Talbiyah"
            },
            "content": {
              "urdu": [
                "غسل اور لباس تبدیل کرنے کے بعد اصل احرام دل کی نیت اور زبان سے 'لبیک' پکارنے کا نام ہے۔",
                "نبی ﷺ نے غسل کے فوراً بعد تلبیہ نہیں پکارا بلکہ نماز ادا کرنے کے بعد پکارا۔",
                "یہ ترتیب ہمیں عبادات کو بتدریج اور منظم طریقے سے انجام دینے کا سبق دیتی ہے۔"
              ],
              "english": [
                "After Ghusl and changing clothes, Ihram essentially begins with intention and the Talbiyah.",
                "The Prophet (ﷺ) did not recite Talbiyah immediately after Ghusl but after offering prayer.",
                "This sequence teaches us to perform acts of worship in a gradual and organized manner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و طبی فوائد",
        "english": "Juristic and Health Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوشبو اور نظافت",
              "english": "Perfume and Cleanliness"
            },
            "content": {
              "urdu": [
                "غسل کے بعد بدن پر خوشبو لگانا مسنون ہے، بشرطیکہ وہ احرام کی نیت سے پہلے ہو۔",
                "احرام کی حالت میں خوشبو لگانا منع ہے، اس لیے پہلے سے غسل اور خوشبو بدن کو معطر رکھتے ہیں۔",
                "یہ عمل سفر کے دوران پسینے کی بدبو اور بے سکونی سے بچاتا ہے۔"
              ],
              "english": [
                "It is Sunnah to apply perfume to the body after Ghusl, provided it is before the formal intention.",
                "Since perfume is forbidden during Ihram, applying it beforehand keeps the body fragrant.",
                "This practice prevents body odor and discomfort during the long journey of Hajj or Umrah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی صحت کا خیال",
              "english": "Public Health Consideration"
            },
            "content": {
              "urdu": [
                "حج کے عظیم اجتماع میں لاکھوں لوگ اکٹھے ہوتے ہیں، جہاں صفائی بیماریوں سے بچاتی ہے۔",
                "نبی ﷺ نے انفرادی صفائی کو اجتماعی صحت کا ضامن قرار دیا۔",
                "ہر حاجی کا غسل کر کے آنا پورے ماحول کو پاکیزہ اور خوشگوار بناتا ہے۔"
              ],
              "english": [
                "Millions gather during Hajj, and personal hygiene is key to preventing the spread of diseases.",
                "The Prophet (ﷺ) established individual cleanliness as a safeguard for public health.",
                "Every pilgrim performing Ghusl contributes to a pure and pleasant atmosphere for everyone."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کا ادب",
              "english": "Etiquette of Worship"
            },
            "content": {
              "urdu": [
                "کسی بھی نیک کام سے پہلے خود کو ظاہری اور باطنی طور پر تیار کرنا بندگی کا ادب ہے۔",
                "سنت کی اتباع میں ہی خیر و برکت اور اللہ کی رضا پوشیدہ ہے۔",
                "نبی ﷺ کے ہر چھوٹے عمل میں امت کے لیے گہری حکمتیں موجود ہیں۔"
              ],
              "english": [
                "Preparing oneself outwardly and inwardly before any good deed is a form of respect for worship.",
                "Goodness, blessings, and the pleasure of Allah are hidden in following the Sunnah.",
                "Deep wisdom for the Ummah is embedded in every single action of the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "سادگی اور عاجزی",
              "english": "Simplicity and Humility"
            },
            "content": {
              "urdu": [
                "احرام کی حالت انسان کو اس کی حقیقت یاد دلاتی ہے کہ وہ اللہ کا ایک عاجز بندہ ہے۔",
                "قیمتی لباس چھوڑ کر دو چادروں میں آنا تکبر کو ختم کرنے کا بہترین نسخہ ہے۔",
                "مومن کو ہمیشہ اپنی موت اور اللہ کے حضور پیشی کو یاد رکھنا چاہیے۔"
              ],
              "english": [
                "The state of Ihram reminds a person of their reality as a humble servant of Allah.",
                "Leaving expensive clothes for two simple sheets is the best remedy for arrogance.",
                "A believer should always remain mindful of death and their eventual meeting with Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}