{
  "hadithId": 638,
  "hadithNo": 32,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh-al-maram/6/58"
    ],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه أبو داود (1953)، والنسائي في الكبرى (4074)، والبيهقي (5/151). والحديث له شواهد تقويه، وإن كان في سنده مقال يسير.",
    "urdu": "صحیح (شواہد کی بنا پر)۔ اسے ابوداؤد (1953)، نسائی اور بیہقی نے روایت کیا ہے۔ اگرچہ اس کی سند میں کچھ کلام ہے، لیکن دیگر صحیح احادیث اس کے مفہوم کی تائید کرتی ہیں۔",
    "english": "Sahih through corroborating evidences. Reported by Abu Dawud (1953), An-Nasa'i, and Al-Baihaqi. Despite minor discussions on its chain, its meaning is supported by other authentic narrations."
  },
  "importantWords": [
    {
      "arabic": "يَوْمَ اَلرُّءُوسِ",
      "english": "Day of the Heads",
      "urdu": "سروں والا دن"
    },
    {
      "arabic": "أَوْسَطَ",
      "english": "Middle",
      "urdu": "درمیانہ"
    },
    {
      "arabic": "أَيَّامِ اَلتَّشْرِيقِ",
      "english": "Days of Tashriq",
      "urdu": "ایامِ تشریق"
    },
    {
      "arabic": "خَطَبَنَا",
      "english": "Addressed us",
      "urdu": "ہمیں خطبہ دیا"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے 12 ذوالحجہ (ایامِ تشریق کے دوسرے دن) کو منیٰ میں صحابہ سے خطاب فرمایا۔ اس دن کو قربانی کے جانوروں کے سر پکانے کی نسبت سے 'یوم الرؤوس' کہا جاتا ہے۔",
    "english": "The Prophet (ﷺ) addressed the companions in Mina on the 12th of Dhul-Hijjah. This day is called 'Yawm al-Ru'us' because it was the day people traditionally cooked the heads of their sacrificed animals."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1953)",
      "english": "Sunan Abi Dawud (1953)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سراء بنت نبهان الغنوية",
        "english": "Sarra' bint Nabhan"
      },
      "slug": "sarra-bint-nabhan"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "حَسَن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایامِ تشریق اور یوم الرؤوس کی وضاحت",
        "english": "Explanation of Ayyam al-Tashriq and Yawm al-Ru'us"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یوم الرؤوس کا مطلب",
              "english": "Meaning of Yawm al-Ru'us"
            },
            "content": {
              "urdu": [
                "10 ذوالحجہ کو قربانی کی جاتی تھی، اور اگلے دن (11 ذوالحجہ) کو 'یوم القر' (منیٰ میں ٹہرنے کا دن) کہا جاتا تھا۔",
                "12 ذوالحجہ کو 'یوم الرؤوس' کہا جاتا ہے کیونکہ اس دن لوگ ذبح کیے گئے جانوروں کے سر پکاتے اور کھاتے تھے۔",
                "یہ ایامِ تشریق (11، 12، 13 ذوالحجہ) کا درمیانہ دن ہے۔"
              ],
              "english": [
                "Sacrifices were made on the 10th, and the 11th was known as 'Yawm al-Qarr' (the day of settling in Mina).",
                "The 12th is called 'Yawm al-Ru'us' because pilgrims would typically cook and eat the heads of their animals on this day.",
                "It constitutes the middle of the three days of Tashriq (11th, 12th, and 13th)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منیٰ میں نبوی خطبات",
        "english": "Prophetic Sermons in Mina"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعلیمِ مناسک اور حرمت کا بیان",
              "english": "Teaching Rituals and Declaring Sanctity"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے حج کے دوران مختلف ایام میں خطبے دیے تاکہ لوگ مناسکِ حج کو اچھی طرح سیکھ لیں۔",
                "ان خطبات میں آپ ﷺ نے مسلمانوں کے خون، مال اور آبرو کی حرمت کو اس مبارک دن اور مہینے کی حرمت کے برابر قرار دیا۔",
                "ایامِ تشریق کے درمیانے دن خطاب کرنا اس دن کی اہمیت اور لوگوں کی بڑی تعداد کی موجودگی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) delivered sermons on various days during Hajj to ensure the rituals were correctly understood.",
                "In these addresses, he equated the sanctity of a Muslim's blood, property, and honor to the sanctity of that holy day and month.",
                "Speaking on the middle day of Tashriq highlights the significance of the timing when a vast number of pilgrims were gathered."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی فوائد",
        "english": "Juristic and Practical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کوچ کرنے کی اجازت (نفرِ اول)",
              "english": "Permission to Depart (Nafru-l-Awwal)"
            },
            "content": {
              "urdu": [
                "12 ذوالحجہ وہ دن ہے جس میں حاجی کو اختیار ہوتا ہے کہ وہ رمی کے بعد سورج غروب ہونے سے پہلے منیٰ سے مکہ کوچ کر جائے۔",
                "اسے 'نفرِ اول' کہا جاتا ہے۔ جو رکنا چاہے وہ 13 تاریخ تک رک سکتا ہے۔",
                "نبی ﷺ کا اس دن خطاب فرمانا رخصت ہونے والوں کے لیے الوداعی نصیحت کی حیثیت بھی رکھتا تھا۔"
              ],
              "english": [
                "The 12th of Dhul-Hijjah is the day when a pilgrim has the option to leave Mina for Makkah before sunset after stoning.",
                "This is known as 'Nafru-l-Awwal'. Those who wish to stay can remain until the 13th.",
                "The Prophet's (ﷺ) address on this day served as a final guidance for those departing early."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی اہمیت اور یاد دہانی",
              "english": "Significance of Timing and Reminder"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا یہ سوال 'کیا یہ درمیانہ دن نہیں ہے؟' حاضرین کی توجہ مبذول کروانے کا ایک بہترین انداز تھا۔",
                "مومن کو چاہیے کہ وہ مبارک ایام کی قدر کرے اور ان میں ذکر و اذکار کی کثرت کرے۔",
                "عورتوں کا ان خطبات کو محفوظ کرنا اس بات کی دلیل ہے کہ اسلام میں خواتین کی تعلیم و تربیت پر خصوصی توجہ دی گئی۔"
              ],
              "english": [
                "The Prophet's question, 'Is this not the middle day?' was an effective teaching method to capture the audience's attention.",
                "A believer should value blessed days and increase in the remembrance of Allah during them.",
                "The fact that women preserved these narrations proves the emphasis Islam placed on female education and participation."
              ]
            }
          }
        ]
      }
    }
  ]
}