{
  "hadithId": 709,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:2205"
    ],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2205)، ومسلم (1542). والمزابنة مشتقة من الزبن وهو الدفع، فكل واحد من المتبايعين يزبن صاحبه عما يريد.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (2205) اور مسلم (1542) کی متفقہ روایت ہے۔ 'مزابنہ' کا لفظ 'زبن' سے نکلا ہے جس کے معنی 'دھکا دینے' کے ہیں، کیونکہ اس میں ہر فریق دوسرے کو دھوکہ دینے کی کوشش کرتا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2205) and Muslim (1542). Al-Muzabanah is derived from 'Zabn' (to push), as both parties might push each other into a bad deal due to estimation errors."
  },
  "importantWords": [
    {
      "arabic": "الْمُزَابَنَةِ",
      "english": "Al-Muzabanah",
      "urdu": "بیع مزابنہ (تخمینے والی بیع)"
    },
    {
      "arabic": "حَائِطِهِ",
      "english": "His orchard / garden",
      "urdu": "اس کا باغ"
    },
    {
      "arabic": "كَيْلاً",
      "english": "By measure",
      "urdu": "ناپ کر / پیمانہ سے"
    },
    {
      "arabic": "زَبِيبٍ",
      "english": "Raisins",
      "urdu": "کشمش / منقی"
    },
    {
      "arabic": "نَخْلاً",
      "english": "Date-palm",
      "urdu": "کھجور کا درخت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیع مزابنہ کی ممانعت ہے، جس میں درخت پر لگے تازہ پھلوں کا تبادلہ اسی جنس کے خشک پھلوں کے ساتھ ناپ تول کر کیا جاتا ہے، کیونکہ اس میں برابری یقینی نہیں ہوتی اور سود (ربا) کا اندیشہ ہوتا ہے۔",
    "english": "This Hadith prohibits Al-Muzabanah: the exchange of fresh produce still on trees for its dry counterpart by measure, because exact equality is impossible to determine, leading to potential Riba."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2205)",
      "english": "Sahih al-Bukhari (2205)"
    },
    {
      "arabic": "صحيح مسلم (1542)",
      "english": "Sahih Muslim (1542)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیع مزابنہ کی حقیقت اور ممانعت",
        "english": "Nature and Prohibition of Al-Muzabanah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر یقینی برابری",
              "english": "Uncertain Equality"
            },
            "content": {
              "urdu": [
                "درخت پر لگے پھلوں کا وزن یا ناپ صرف اندازے (تخمینے) سے ہی کیا جا سکتا ہے۔",
                "جب اسی جنس کی دو چیزوں کا تبادلہ ہو تو وزن میں سو فیصد برابری شرط ہے۔",
                "اگر خشک ہونے کے بعد وزن کم یا زیادہ نکل آئے تو یہ 'ربا الفضل' (سود) بن جاتا ہے۔"
              ],
              "english": [
                "Produce still on trees can only be estimated, not measured accurately.",
                "In the exchange of items of the same genus, 100% equality in weight/measure is mandatory.",
                "If weight differs after drying, it falls under Riba al-Fadl (usury of excess)."
              ]
            }
          },
          {
            "title": {
              "urdu": "جہالت اور غرر",
              "english": "Ignorance and Risk"
            },
            "content": {
              "urdu": [
                "سودے کے وقت مبیع (فروخت شدہ چیز) کی مقدار کا نا معلوم ہونا 'جہالت' کہلاتا ہے۔",
                "ایسے مبہم سودے اکثر فریقین کے درمیان جھگڑے اور دشمنی کا باعث بنتے ہیں۔",
                "شریعت نے ہر اس تجارتی صورت کو روکا ہے جس میں کسی ایک فریق کا نقصان یقینی ہو۔"
              ],
              "english": [
                "Not knowing the exact quantity of the commodity at the time of sale is called 'Jahalah'.",
                "Such ambiguous deals often lead to disputes and animosity between parties.",
                "Sharia blocks any trade form where there is a risk of exploitation of one party."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مختلف اشیاء کے احکام",
        "english": "Rulings on Different Commodities"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھجور اور انگور",
              "english": "Dates and Grapes"
            },
            "content": {
              "urdu": [
                "تازہ کھجور (رطب) کا تبادلہ خشک کھجور (تمر) سے کرنا اسی لیے منع ہے کہ تازہ کھجور خشک ہو کر سکڑ جاتی ہے۔",
                "اسی طرح انگور اور کشمش کا معاملہ ہے کہ وزن میں فرق آنا لازمی ہے۔",
                "نبی ﷺ نے واضح فرمایا کہ ربا سے بچنے کے لیے برابری کا یقینی ہونا ضروری ہے۔"
              ],
              "english": [
                "Exchanging fresh dates (Rutab) for dry dates (Tamr) is forbidden as fresh ones shrink when dry.",
                "The same applies to grapes and raisins; a difference in final weight is inevitable.",
                "The Prophet (PBUH) clarified that certainty of equality is required to avoid Riba."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھیتی اور غلہ",
              "english": "Crops and Grain"
            },
            "content": {
              "urdu": [
                "کھڑی فصل کو کاٹے ہوئے صاف اناج کے بدلے اندازے سے بیچنا بھی مزابنہ میں شامل ہے۔",
                "اس میں یہ خطرہ بھی ہوتا ہے کہ فصل میں کیڑا لگ جائے یا کوئی آفت آ جائے۔",
                "اسلام مادی اور حقیقی تبادلے پر مبنی معیشت کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Selling standing crops for processed grain by estimation is also Al-Muzabanah.",
                "There is an added risk of crop disease or natural disasters affecting the standing harvest.",
                "Islam promotes an economy based on tangible and real exchanges."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی استثناء: بیع عرايا",
        "english": "Juristic Exception: Bay' al-Araya"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت کی رعایت",
              "english": "Concession for Need"
            },
            "content": {
              "urdu": [
                "شریعت نے 'عرايا' کے تحت پانچ وسق تک کی بیع کی اجازت دی ہے۔",
                "یہ ان غریب لوگوں کے لیے ہے جن کے پاس خشک کھجوریں ہوں اور وہ تازہ کھانا چاہیں۔",
                "یہ رعایت عام تجارت کے لیے نہیں بلکہ صرف انفرادی ضرورت کے لیے مخصوص ہے۔"
              ],
              "english": [
                "Sharia allows the sale of 'Araya' up to five 'Wasaq' (a measurement unit).",
                "This is a concession for poor people who have dry dates and wish to eat fresh ones.",
                "This exception is for individual need, not for general commercial profit."
              ]
            }
          },
          {
            "title": {
              "urdu": "قاعدہ کلیہ",
              "english": "General Rule"
            },
            "content": {
              "urdu": [
                "استثناء صرف وہیں ہے جہاں نص (حدیث) موجود ہو۔",
                "باقی تمام معاملات میں 'مثلاً بمثل' (برابری) کا قاعدہ لاگو ہوگا۔",
                "اسلامی معاشی نظام میں 'برکت' اتباعِ سنت اور عدل میں ہے۔"
              ],
              "english": [
                "Exceptions are limited to areas where explicit textual evidence (Nass) exists.",
                "In all other dealings, the rule of 'Like for Like' (equality) prevails.",
                "In the Islamic economic system, 'blessing' lies in following the Sunnah and justice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور معاشی سبق",
        "english": "Moral and Economic Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفافیت کی اہمیت",
              "english": "Importance of Transparency"
            },
            "content": {
              "urdu": [
                "تجارت میں ابہام اور شک و شبہ انسان کے رزق سے سکون چھین لیتے ہیں۔",
                "سود کی ادنیٰ سی ملاوٹ بھی پورے مال کو برباد کر سکتی ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی بیع و شرا میں شفافیت کو مقدم رکھے۔"
              ],
              "english": [
                "Ambiguity and doubt in trade strip one's provision of peace.",
                "Even the slightest mixture of usury can ruin one's entire wealth.",
                "A Muslim must prioritize transparency in his buying and selling."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "بیع مزابنہ سے روکنے کا مقصد مارکیٹ میں سٹہ بازی اور دھوکے کا خاتمہ ہے۔",
                "اسلامی معیشت دیانتداری اور واضع شرائط پر قائم ہے۔",
                "رزقِ حلال کی طلب ہر مسلمان پر فرض ہے تاکہ اس کی عبادات قبول ہوں۔"
              ],
              "english": [
                "The goal of prohibiting Al-Muzabanah is to end speculation and fraud in the market.",
                "Islamic economics stands on integrity and clear contract terms.",
                "Seeking Halal sustenance is an obligation for every Muslim for the acceptance of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}