{
  "hadithId": 195,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (6/279)، وأبو داود في كتاب الصلاة، باب الأمر بتنظيف المساجد (455)، والترمذي في أبواب الصلاة، باب ما جاء في تطييب المساجد (594). قال سفيان بن عيينة في قوله: 'ببناء المساجد في الدور' يعني: في القبائل والمحلات.",
    "urdu": "صحیح ہے۔ اسے احمد (6/279)، ابو داؤد (455)، اور ترمذی (594) نے روایت کیا ہے۔ سفیان بن عیینہ نے 'الدور' (گھروں/ڈور) میں مساجد بنانے کے حکم کا مطلب قبائل اور محلوں میں مسجدیں بنانا بیان کیا ہے۔",
    "english": "Authentic (Sahih). Reported by Ahmad (6/279), Abu Dawud in the Book of Prayer, Chapter: Command for cleaning the mosques (455), and At-Tirmidhi in the Chapters on Prayer, Chapter: What has been related about perfuming the mosques (594). Sufyan ibn Uyaynah explained the phrase 'building of mosques in Ad-Dur' to mean building mosques in the tribes and districts."
  },
  "importantWords": [
    {
      "arabic": "أمر",
      "english": "Commanded",
      "urdu": "حکم دیا"
    },
    {
      "arabic": "المساجد",
      "english": "Mosques",
      "urdu": "مسجدیں"
    },
    {
      "arabic": "الدور",
      "english": "Districts/Houses",
      "urdu": "محلے/بستیاں"
    },
    {
      "arabic": "تنظف",
      "english": "Should be cleaned",
      "urdu": "صاف ستھری رکھی جائیں"
    },
    {
      "arabic": "تطيب",
      "english": "Should be perfumed",
      "urdu": "خوشبو لگائی جائے"
    },
    {
      "arabic": "ببناء",
      "english": "Building/Erecting",
      "urdu": "تعمیر کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی اکرم صلی اللہ علیہ وسلم نے اسلامی بستیوں اور محلوں میں مسجدیں بنانے کی اہمیت کو اجاگر کیا ہے، اور ساتھ ہی مساجد کو ہر طرح کی گندگی سے پاک رکھنے اور انہیں خوشبوؤں سے معطر رکھنے کی تاکید فرمائی ہے تاکہ عبادت کا ماحول پاکیزہ اور پُرسکون رہے۔",
    "english": "This Hadith highlights the importance of establishing mosques within Islamic settlements and districts, and strongly emphasizes the command to keep them clean from all filth and to perfume them with fragrances, ensuring a pure and tranquil environment for worship."
  },
  "references": [
    {
      "arabic": "رواه أبو داود، كتاب الصلاة، باب الأمر بتنظيف المساجد (455)",
      "english": "Reported by Abu Dawud, Book of Prayer, Chapter: Command for cleaning the mosques (455)"
    },
    {
      "arabic": "رواه الترمذي، أبواب الصلاة، باب ما جاء في تطييب المساجد (594)",
      "english": "Reported by At-Tirmidhi, Chapters on Prayer, Chapter: What has been related about perfuming the mosques (594)"
    },
    {
      "arabic": "رواه الإمام أحمد في مسنده (6/279)",
      "english": "Reported by Imam Ahmad in his Musnad (6/279)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9oD6QfL-tM",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مساجد کی تعمیر اور مقام",
        "english": "Construction and Status of Mosques"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بستیوں میں مساجد",
              "english": "Mosques in Settlements"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا کہ بستیوں اور محلوں میں مساجد کی تعمیر کا اہتمام کیا جائے۔",
                "مسجد مسلمانوں کی روحانی اور معاشرتی زندگی کا مرکزی نقطہ ہوتی ہے۔",
                "قبیلوں میں مساجد کی موجودگی سے یہ یقینی ہوتا ہے کہ لوگ باجماعت نماز ادا کر سکیں۔"
              ],
              "english": [
                "The Prophet (PBUH) commanded the establishment of mosques in districts and settlements.",
                "The mosque serves as the central point for the spiritual and social life of Muslims.",
                "The presence of mosques in tribes ensures that people can perform congregational prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد کی اہمیت",
              "english": "The Importance of the Mosque"
            },
            "content": {
              "urdu": [
                "مسجد اللہ کا گھر ہے اور زمین پر اللہ کے ہاں سب سے زیادہ محبوب مقام ہے۔",
                "مسجدیں معاشرتی بگاڑ کو روکنے اور اسلامی تعلیمات کو پھیلانے کا ذریعہ ہیں۔",
                "نبی صلی اللہ علیہ وسلم نے مسلمانوں کو اس اہم دینی ادارے کی حفاظت کا حکم دیا۔"
              ],
              "english": [
                "The mosque is the House of Allah and the dearest place to Allah on earth.",
                "Mosques serve as a means to prevent social corruption and propagate Islamic teachings.",
                "The Prophet (PBUH) commanded Muslims to maintain and preserve this vital religious institution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صفائی اور ستھرائی کا حکم",
        "english": "Command for Cleanliness and Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت کا تقاضا",
              "english": "Requirement of Purity"
            },
            "content": {
              "urdu": [
                "مساجد کو ہر طرح کی ظاہری گندگی اور نجاست سے پاک صاف رکھنا ضروری ہے۔",
                "صفائی کا حکم اس لیے دیا گیا تاکہ نمازی اطمینان اور پاکیزگی کے ساتھ عبادت کر سکیں۔",
                "جو شخص مسجد کی صفائی کرتا ہے اس کے لیے بہت بڑا اجر و ثواب ہے۔"
              ],
              "english": [
                "It is mandatory to keep mosques clean and free from all types of external filth and impurity.",
                "The command for cleanliness was given so that worshippers can pray with tranquility and purity.",
                "There is a great reward for those who maintain the cleanliness of the mosque."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشبو لگانا (تطیب)",
              "english": "Perfuming the Mosques (Tatyeeb)"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے مساجد کو خوشبو سے معطر رکھنے کا بھی حکم دیا۔",
                "خوشبو لگانے سے مسجد کا ماحول پرسکون، دلکش اور عبادت کے لیے زیادہ سازگار ہو جاتا ہے۔",
                "یہ مساجد کی تعظیم اور اللہ کے گھر کے آداب میں شامل ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) also commanded that mosques should be kept perfumed with fragrances.",
                "Perfuming the mosques makes the environment tranquil, appealing, and more conducive to worship.",
                "This falls under the reverence due to the mosques and the etiquette of Allah's House."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر و ثواب اور فقہی حیثیت",
        "english": "Reward and Juristic Status"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صفائی کی فضیلت",
              "english": "Virtue of Cleanliness"
            },
            "content": {
              "urdu": [
                "اسلام میں طہارت کو نصف ایمان قرار دیا گیا ہے، مساجد کی طہارت تو اور بھی افضل ہے۔",
                "مسجد کی صفائی میں حصہ لینے والے پر اللہ کی رحمت اور مغفرت ہوتی ہے۔",
                "یہ حکم ہمیں یہ سکھاتا ہے کہ عبادات میں ظاہری اور باطنی دونوں پاکیزگی ضروری ہے۔"
              ],
              "english": [
                "Purity is considered half of faith in Islam; hence, the purity of mosques is even more virtuous.",
                "Allah's mercy and forgiveness are upon those who participate in cleaning the mosque.",
                "This command teaches us that both external and internal purity are essential in worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہل خانہ کی تعلیم",
              "english": "Educating the Family"
            },
            "content": {
              "urdu": [
                "چونکہ حدیث میں 'الدور' (گھر) کا ذکر ہے، اس سے مراد گھروں کے احاطے کی مساجد بھی ہو سکتی ہیں۔",
                "مسجدوں کی صفائی اور خوشبو لگانے میں گھر والوں کو شامل کرنا بھی حکم کے تحت آتا ہے۔",
                "سیدہ عائشہ رضی اللہ عنہا کی روایت کا ذکر اس امر کو عیاں کرتا ہے کہ ازواجِ مطہرات بھی اس کام میں شامل تھیں۔"
              ],
              "english": [
                "Since 'Ad-Dur' (houses/districts) is mentioned in the Hadith, it can also refer to smaller mosques within residential areas.",
                "Involving family members in cleaning and perfuming the mosques also falls under this command.",
                "The narration by 'Aishah (RA) highlights that the Prophet's wives were also involved in this practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اقدامات اور پیغام",
        "english": "Practical Measures and Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موجودہ دور میں اطلاق",
              "english": "Application in the Modern Era"
            },
            "content": {
              "urdu": [
                "موجودہ دور میں مساجد کو ہوا دار، روشن اور ہر قسم کی آلائش سے پاک رکھنا چاہیے۔",
                "فرشوں، قالینوں اور دیواروں کی مسلسل صفائی کو یقینی بنایا جانا فرض کے قریب ہے۔",
                "مسجد میں شدید بدبو دار چیزیں (جیسے لہسن، پیاز) کھا کر آنے سے گریز کیا جائے۔"
              ],
              "english": [
                "In the modern era, mosques should be kept airy, well-lit, and free from all kinds of pollution.",
                "Ensuring continuous cleaning of floors, carpets, and walls is close to being obligatory.",
                "One should avoid entering the mosque after consuming things that produce a strong offensive smell (like garlic, onions)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کا عالمی پیغام",
              "english": "Islam's Universal Message"
            },
            "content": {
              "urdu": [
                "صفائی، پاکیزگی اور حسنِ انتظام اسلام کا ایک عالمی اور بنیادی پیغام ہے۔",
                "مساجد کو بہترین حالت میں رکھنا دراصل اسلام کے وقار اور شان کو ظاہر کرتا ہے۔",
                "یہ حکم مسلمانوں کو اپنی عبادت گاہوں کے ساتھ فعال اور ذمہ دارانہ تعلق سکھاتا ہے۔"
              ],
              "english": [
                "Cleanliness, purity, and good management are a universal and foundational message of Islam.",
                "Maintaining mosques in the best condition reflects the dignity and glory of Islam.",
                "This command teaches Muslims to have an active and responsible relationship with their places of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
