{
  "hadithId": 99,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 99 (related context)"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": " صحيح. وهو في \"مصنف عبد الرازق\" (6/9-10/9834) وفيه: \"فأمره أن يغتسل فاغتسل\". البخاري (4372)، ومسلم (1764) من حديث أبي هريرة أيضا، وفيه: \"فانطلق -أي: ثمامة- إلى نخل قريب من المسجد، فاغتسل\".",
    "urdu": "صحیح (درست) روایت۔ یہ \"مصنف عبدالرزاق\" (6/9-10/9834) میں موجود ہے، جس میں ہے: \"آپ نے اسے غسل کا حکم دیا تو اس نے غسل کیا\"۔ بخاری (4372) اور مسلم (1764) میں بھی یہ ابوہریرہ رضی اللہ عنہ کی حدیث سے موجود ہے، اور اس میں ہے: \"پھر وہ - یعنی ثمامہ - مسجد کے قریب کھجور کے باغ کی طرف گیا اور غسل کیا۔\"",
    "english": "Sahih (Authentic). It is found in 'Musannaf 'Abdur-Razzaq' (6/9-10/9834) with the wording: \"So he commanded him to perform Ghusl, and he did Ghusl.\" It is also found in Al-Bukhari (4372) and Muslim (1764) from the Hadith of Abu Hurairah, where it states: \"Then he—meaning Thumamah—went to a date-palm tree near the mosque and performed Ghusl.\""
  },
  "importantWords": [
    {
      "arabic": "أَسْلَم",
      "english": "He embraced Islam",
      "urdu": "اسلام لایا"
    },
    {
      "arabic": "أَمَرَهُ",
      "english": "He commanded him",
      "urdu": "اسے حکم دیا"
    },
    {
      "arabic": "يَغْتَسِلَ",
      "english": "To perform Ghusl",
      "urdu": "غسل کرے"
    },
    {
      "arabic": "قِصَّة",
      "english": "Story/incident",
      "urdu": "واقعہ"
    },
    {
      "arabic": "اَلْإِسْلَام",
      "english": "Islam",
      "urdu": "اسلام"
    },
    {
      "arabic": "فَاغْتَسَلَ",
      "english": "So he performed Ghusl",
      "urdu": "اس نے غسل کیا"
    },
    {
      "arabic": "ثُمَامَةَ",
      "english": "Thumamah (The person)",
      "urdu": "ثمامہ (نام)"
    },
    {
      "arabic": "اَلْمُسْلِمُ اَلْجَدِيد",
      "english": "The new Muslim",
      "urdu": "نیا مسلمان"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس اصول کو واضح کرتی ہے کہ جب کوئی شخص اسلام قبول کرے تو نبی اکرم ﷺ کی سنت کے مطابق اسے غسل کرنے کا حکم دیا جاتا ہے، جو اس کی سابقہ حالت کی نجاست حکمی کو دور کرتا ہے۔",
    "english": "This Hadith establishes the principle that when a person embraces Islam, they are commanded to perform Ghusl (ritual bath) according to the Prophet's Sunnah, which cleanses the ritual impurity from their previous state."
  },
  "references": [
    {
      "arabic": "رواه عبد الرزاق (6/9-10/9834)",
      "english": "Reported by 'Abdur-Razzaq (6/9-10/9834)"
    },
    {
      "arabic": "أصله في البخاري (4372)",
      "english": "Basis in Al-Bukhari (4372)"
    },
    {
      "arabic": "أصله في مسلم (1764)",
      "english": "Basis in Muslim (1764)"
    },
    {
      "arabic": "أصله متفق عليه",
      "english": "Its basis is Muttafaqun 'alayhi"
    }
  ],
  "narrators": [
    {
      "id": 9901,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 9902,
      "name": {
        "arabic": "ثمامة بن أثال",
        "english": "Thumamah ibn Uthal"
      },
      "slug": "thumamah-ibn-uthal"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اسلام قبول کرنے پر غسل کا حکم",
        "english": "The Ruling of Ghusl Upon Embracing Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غسل کا وجوب یا استحباب",
              "english": "Obligation vs. Recommendation of Ghusl"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے ثمامہ رضی اللہ عنہ کو اسلام قبول کرنے پر غسل کرنے کا حکم دیا، جس سے فقہاء نے یہ اصول اخذ کیا۔",
                "جمہور فقہاء کے نزدیک نئے مسلمان کے لیے غسل کرنا **مستحب** ہے تاکہ وہ پاکیزگی سے دین میں داخل ہو۔",
                "بعض علماء، بشمول حنبلیوں، نے نبی ﷺ کے صریح حکم کی بنا پر اسے **واجب** قرار دیا ہے، اگر وہ حالت جنابت میں ہو۔"
              ],
              "english": [
                "The Prophet ﷺ commanded Thumamah (RA) to perform Ghusl upon accepting Islam, from which jurists derived this principle.",
                "According to the majority of jurists, Ghusl is **recommended (Mustahabb)** for the new Muslim to enter the religion in a state of purity.",
                "Some scholars, including the Hanbalis, consider it **obligatory (Wajib)** based on the Prophet's direct command, especially if they were in a state of Janabah."
              ]
            }
          },
          {
            "title": {
              "urdu": "سبب اور حکمت",
              "english": "The Reason and Wisdom"
            },
            "content": {
              "urdu": [
                "غسل کا حکم دینے کی حکمت یہ ہے کہ انسان اپنے تمام سابقہ نجاسات (خواہ وہ جنابت ہو) سے پاک ہو کر عبادت کے لیے تیار ہو جائے۔",
                "یہ جسمانی صفائی سے زیادہ روحانی طہارت کا اعلان ہے جو ایک نئے باب کا آغاز ہے۔",
                "بہر حال، اگر کوئی شخص پہلے ہی پاکی کی حالت میں ہو، تو بھی غسل کرنا اس عمل کی فضیلت اور خیر ہے۔"
              ],
              "english": [
                "The wisdom behind commanding Ghusl is that the person should cleanse themselves of all previous impurities (including Janabah) and prepare for worship.",
                "It is a declaration of spiritual purification more than physical cleanliness, marking the start of a new religious chapter.",
                "In any case, even if a person was already clean, performing Ghusl carries virtue and goodness for this momentous occasion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ثمامہ بن اثال کا واقعہ",
        "english": "The Incident of Thumamah ibn Uthal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمت نبوی کی مثال",
              "english": "Example of Prophetic Wisdom"
            },
            "content": {
              "urdu": [
                "ثمائمہ رضی اللہ عنہ کا واقعہ طویل ہے، جس میں نبی ﷺ نے انہیں قید میں رکھنے کے باوجود ان کے ساتھ نرمی کا رویہ اپنایا۔",
                "مسلمان ہونے کے بعد آپ کا حکم غسل کرنا تھا تاکہ وہ پاکی حاصل کر کے ایمان اور عبادت کی تیاری کریں۔",
                "یہ واقعہ اس بات کی دلیل ہے کہ اسلام تلوار سے نہیں بلکہ حسن اخلاق اور حکمت سے پھیلایا گیا۔"
              ],
              "english": [
                "Thumamah's (RA) story is lengthy, in which the Prophet ﷺ treated him gently despite his captivity.",
                "After he embraced Islam, the command was for him to perform Ghusl to achieve purity and prepare for faith and worship.",
                "This incident proves that Islam was spread not by the sword but by good manners and wisdom."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمل کی تفصیل",
              "english": "Details of the Act"
            },
            "content": {
              "urdu": [
                "متفق علیہ روایت میں یہ ذکر ہے کہ ثمامہ مسجد کے قریب کھجور کے باغ کی طرف گئے اور غسل کیا۔",
                "اس سے معلوم ہوتا ہے کہ نبی ﷺ کے دور میں مسجد کے قریب یا اس سے متصل پانی کی جگہ موجود تھی۔",
                "یہ غسل اس بات کی علامت ہے کہ اب وہ اپنے سابقہ مشرکانہ دور کو چھوڑ کر نئے صاف ستھرے دور میں داخل ہو چکے ہیں۔"
              ],
              "english": [
                "The Muttafaqun 'alayhi narration mentions that Thumamah went to a palm grove near the mosque and performed Ghusl.",
                "This shows that a source of water was available near or adjacent to the mosque during the Prophet's time.",
                "This Ghusl symbolizes his leaving behind his former polytheistic life and entering a new era of cleanliness and purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور ترجیح",
        "english": "Juristic Difference and Preference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وجوب اور سنت میں فرق",
              "english": "Difference between Obligation and Sunnah"
            },
            "content": {
              "urdu": [
                "جن لوگوں کا مذہب اسلام میں داخلے کے وقت غسل کو **واجب** قرار دیتا ہے، وہ نبی ﷺ کے صریح حکم کو بطور دلیل لیتے ہیں۔",
                "وہ علماء جو اسے **مستحب** قرار دیتے ہیں، کہتے ہیں کہ چونکہ کفار بذات خود نجس نہیں ہوتے، لہٰذا غسل کا حکم وجوبی نہیں ہے۔",
                "بہترین اور زیادہ محتاط عمل یہی ہے کہ جب بھی کوئی اسلام قبول کرے تو غسل ضرور کرے۔"
              ],
              "english": [
                "Those schools that consider Ghusl **obligatory** upon conversion use the Prophet's direct command as their evidence.",
                "The scholars who deem it **recommended** argue that since non-Muslims are not physically impure, the command for Ghusl is not strictly mandatory.",
                "The best and most cautious practice is that whenever someone embraces Islam, they should definitely perform Ghusl."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل کا حکم کب ضروری؟",
              "english": "When is Ghusl Definitely Necessary?"
            },
            "content": {
              "urdu": [
                "اگر کوئی کافر اسلام قبول کرے اور اسے یقین ہو کہ اس نے حالت جنابت میں غسل نہیں کیا تھا، تو غسل واجب ہوگا۔",
                "یہ وجوب دراصل حالت جنابت سے ہے، نہ کہ صرف کفر سے، اس طرح پچھلا غسل ادا ہو جاتا ہے۔",
                "اس طرح یہ غسل مسلمان کو اس قابل بنا دیتا ہے کہ وہ فوراً نماز، طواف اور دیگر عبادات شروع کر سکے۔"
              ],
              "english": [
                "If a non-Muslim embraces Islam and is certain that they did not perform Ghusl while in a state of Janabah, then Ghusl becomes obligatory.",
                "This obligation is actually due to the state of Janabah, not merely the state of disbelief, thus fulfilling the previous bath's necessity.",
                "This Ghusl enables the new Muslim to immediately start performing Salah, Tawaf, and other acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پاکیزگی اور نئے آغاز کا تصور",
        "english": "Concept of Purity and New Beginning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہوں کی معافی",
              "english": "Forgiveness of Sins"
            },
            "content": {
              "urdu": [
                "اسلام قبول کرنے سے پچھلے تمام گناہ معاف ہو جاتے ہیں، اور غسل اس روحانی پاکیزگی کو جسمانی صورت میں ظاہر کرتا ہے۔",
                "غسل کرنا گویا پرانی زندگی کی نجاستوں کو دھو کر ایک نئے باب کا آغاز کرنا ہے جہاں پاکیزگی سب سے اہم ہے۔",
                "نیا مسلمان غسل کر کے اللہ تعالیٰ سے مکمل طور پر جڑنے اور اس کی رحمت کو حاصل کرنے کے لیے تیار ہو جاتا ہے۔"
              ],
              "english": [
                "Embracing Islam results in the forgiveness of all previous sins, and Ghusl physically manifests this spiritual purification.",
                "Performing Ghusl is like washing away the impurities of the old life and starting a new chapter where cleanliness is paramount.",
                "The new Muslim performs Ghusl to become fully prepared to connect with Allah and receive His mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "پاکی اور عبادت",
              "english": "Purity and Worship"
            },
            "content": {
              "urdu": [
                "اسلام میں طہارت کو اتنی اہمیت دی گئی ہے کہ اسے ایمان کا نصف قرار دیا گیا ہے، اس کی شروعات غسل سے ہوتی ہے۔",
                "ثمائمہ رضی اللہ عنہ کا غسل کرنا اس بات کا عملی ثبوت ہے کہ دین میں طہارت کو کتنی بنیادی اہمیت حاصل ہے۔",
                "عبادات کی ادائیگی کے لیے ہمیشہ پاک ہونا ضروری ہے، اس لیے اسلام قبول کرتے ہی یہ پہلا عملی حکم دیا گیا۔"
              ],
              "english": [
                "Purity is given such importance in Islam that it is considered half of the faith, beginning with Ghusl.",
                "Thumamah's (RA) act of performing Ghusl is practical evidence of the fundamental importance of purity in the religion.",
                "Being pure is necessary for performing acts of worship, hence this first practical command was given immediately upon conversion."
              ]
            }
          }
        ]
      }
    }
  ]
}
