{
  "hadithId": 524,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/524"],
    "kitabId": 4,
    "inKitabBab": 4,
    "arabicBook": "كتاب الزكاة",
    "babId": 32
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (3140)، والنسائي (4137)، وأبو داود (2982). والحديث أصل في تقسيم الخمس وقرابة النبي ﷺ.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (3140) نے روایت کیا ہے۔ اس میں خمس کی تقسیم اور بنو ہاشم و بنو المطلب کی یکجائی کا ذکر ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (3140), An-Nasa'i (4137), and Abu Dawud (2982). It is a foundational text regarding the distribution of the Khumus."
  },
  "importantWords": [
    {
      "arabic": "خُمُسِ",
      "english": "One-fifth",
      "urdu": "پانچواں حصہ"
    },
    {
      "arabic": "بِمَنْزِلَةٍ",
      "english": "Degree / Rank",
      "urdu": "مرتبہ / درجہ"
    },
    {
      "arabic": "شَيْءٌ وَاحِدٌ",
      "english": "One thing / One entity",
      "urdu": "ایک ہی چیز / متحد"
    },
    {
      "arabic": "تَرَكْتَنَا",
      "english": "You left us",
      "urdu": "آپ نے ہمیں چھوڑ دیا"
    },
    {
      "arabic": "أَعْطَيْتَ",
      "english": "You gave",
      "urdu": "آپ نے عطا فرمایا"
    },
    {
      "arabic": "بَنُو هَاشِمٍ",
      "english": "Descendants of Hashim",
      "urdu": "بنو ہاشم"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے مالِ خمس (مالِ غنیمت کا پانچواں حصہ) بنو ہاشم اور بنو عبدالمطلب میں تقسیم فرمایا اور ان دونوں کو رشتہ داری اور وفاداری کی بنا پر ایک ہی قرار دیا۔",
    "english": "The Prophet (ﷺ) distributed the Khumus (one-fifth of spoils) among Banu Hashim and Banu al-Muttalib, identifying them as a single entity due to their kinship and support."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (3140)",
      "english": "Sahih al-Bukhari (3140)"
    },
    {
      "arabic": "سنن النسائي (4137)",
      "english": "Sunan an-Nasa'i (4137)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جبير بن مطعم",
        "english": "Jubair bin Mut'im"
      },
      "slug": "jubair-bin-mutim"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عثمان بن عفان",
        "english": "Uthman bin Affan"
      },
      "slug": "uthman-bin-affan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خمس اور آلِ رسول ﷺ",
        "english": "Khumus and the Prophet's Family"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خمس کا شرعی مصرف",
              "english": "Usage of the Khumus"
            },
            "content": {
              "urdu": [
                "مالِ غنیمت کا پانچواں حصہ (خمس) اللہ اور اس کے رسول ﷺ کے لیے مخصوص ہے۔",
                "نبی ﷺ اس حصے کو اپنے قرابت داروں کی ضروریات پوری کرنے کے لیے استعمال فرماتے تھے۔",
                "یہ حصہ ان کے لیے زکوٰۃ کی حرمت کے بدلے ایک شرعی معاوضہ اور اعزاز تھا۔"
              ],
              "english": [
                "The one-fifth of war spoils (Khumus) is designated for Allah and His Messenger (ﷺ).",
                "The Prophet (ﷺ) utilized this portion to fulfill the needs of his close relatives.",
                "This share served as a legal compensation and honor since Zakat was forbidden to them."
              ]
            }
          },
          {
            "title": {
              "urdu": "بنو ہاشم اور بنو المطلب",
              "english": "Banu Hashim and Banu al-Muttalib"
            },
            "content": {
              "urdu": [
                "بنو ہاشم اور بنو عبدالمطلب زمانہ جاہلیت اور اسلام دونوں میں متحد رہے۔",
                "ان دونوں خاندانوں نے شعبِ ابی طالب کے بائیکاٹ میں نبی ﷺ کا بھرپور ساتھ دیا۔",
                "اسی وفاداری کی بنا پر نبی ﷺ نے انہیں خمس میں برابر کا شریک رکھا۔"
              ],
              "english": [
                "Banu Hashim and Banu al-Muttalib remained united in both Pre-Islamic and Islamic eras.",
                "Both clans supported the Prophet (ﷺ) during the social boycott in the valley of Abu Talib.",
                "Due to this unwavering loyalty, the Prophet (ﷺ) shared the Khumus equally among them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبیلوں کے درمیان فرق",
        "english": "Distinction Between Tribes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بنو امیہ اور بنو نوفل",
              "english": "Banu Umayya and Banu Nawfal"
            },
            "content": {
              "urdu": [
                "عثمان بن عفان بنو امیہ سے اور جبیر بن مطعم بنو نوفل سے تعلق رکھتے تھے۔",
                "ان قبیلوں نے اس مشکل وقت میں نبی ﷺ کا اس طرح ساتھ نہیں دیا تھا۔",
                "نبی ﷺ نے واضح کیا کہ محض رشتہ داری نہیں بلکہ تعاون اصل بنیاد ہے۔"
              ],
              "english": [
                "Uthman (RA) belonged to Banu Umayya and Jubair (RA) to Banu Nawfal.",
                "These tribes did not support the Prophet (ﷺ) in the same manner during hardships.",
                "The Prophet (ﷺ) clarified that loyalty, not just kinship, was the deciding factor."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیء واحد کا مفہوم",
              "english": "Meaning of 'One and the Same'"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا 'ایک ہی چیز' کہنا ان کی گہری قلبی اور سیاسی وابستگی کو ظاہر کرتا ہے۔",
                "اسلام میں حقوق کی ادائیگی صرف رشتہ داری پر نہیں بلکہ قربانی پر مبنی ہوتی ہے۔",
                "بنو المطلب نے کافر ہونے کے باوجود اسلام کی خاطر تکلیفیں برداشت کیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) statement 'one thing' signifies deep emotional and social ties.",
                "In Islam, the allocation of rights is based on sacrifice as much as lineage.",
                "Banu al-Muttalib endured suffering for Islam's sake despite some being non-Muslims then."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدلِ نبوی ﷺ اور جواب",
        "english": "Prophetic Justice and Response"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کے سوال کا انداز",
              "english": "Manner of the Companions' Inquiry"
            },
            "content": {
              "urdu": [
                "صحابہ کرام اپنی الجھنوں کو دور کرنے کے لیے براہ راست نبی ﷺ سے سوال کرتے تھے۔",
                "حضرت عثمان اور جبیر کا سوال کسی حسد پر نہیں بلکہ علم کی طلب پر مبنی تھا۔",
                "نبی ﷺ نے نہایت خوبصورت اور منطقی جواب سے ان کی تسلی فرمائی۔"
              ],
              "english": [
                "The Companions would directly ask the Prophet (ﷺ) to clear their confusion.",
                "The inquiry of Uthman and Jubair was based on seeking knowledge, not envy.",
                "The Prophet (ﷺ) satisfied them with a beautiful and logical explanation."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیاسی اور سماجی بصیرت",
              "english": "Political and Social Insight"
            },
            "content": {
              "urdu": [
                "اس فیصلے سے ثابت ہوتا ہے کہ نبی ﷺ اپنے محسنوں کی قدر فرماتے تھے۔",
                "نبی ﷺ کے فیصلے ہمیشہ حکمت اور الٰہی منشاء کے مطابق ہوتے تھے۔",
                "اتحاد و اتفاق برکت کا باعث ہے اور اسے اللہ کے ہاں اجر ملتا ہے۔"
              ],
              "english": [
                "This decision proves that the Prophet (ﷺ) valued those who stood by him.",
                "The Prophet's decisions were always aligned with wisdom and Divine Will.",
                "Unity and cooperation bring blessings and are rewarded by Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محسنوں کی قدر شناسی",
              "english": "Appreciating Benefactors"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں سکھاتا ہے کہ مشکل وقت میں ساتھ دینے والوں کو فراموش نہ کریں۔",
                "وفاداری کا بدلہ احسان اور مالی تعاون کی صورت میں دینا سنت ہے۔",
                "نیکی کرنے والوں کے درمیان فرق کرنا عدل و انصاف کا تقاضا ہے۔"
              ],
              "english": [
                "Islam teaches us never to forget those who support us in difficult times.",
                "Returning loyalty with kindness and financial support is a Sunnah.",
                "Distinguishing between those who do good is a requirement of justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحاد کی اہمیت",
              "english": "Importance of Unity"
            },
            "content": {
              "urdu": [
                "خاندانوں اور گروہوں کا اتحاد ان کی طاقت اور وقار میں اضافہ کرتا ہے۔",
                "حق کے لیے ایک ہونا دنیا اور آخرت میں کامیابی کی ضمانت ہے۔",
                "دین میں باہمی تعاون کو عبادت کا درجہ دیا گیا ہے۔"
              ],
              "english": [
                "Unity among families and groups increases their strength and dignity.",
                "Being united for the truth is a guarantee for success in both worlds.",
                "Mutual cooperation within the religion is considered a form of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}