{
  "hadithId": 1182,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1182"],
    "kitabId": 13,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام - كتاب الأيمان والنذور",
    "babId": 96
  },
  
  "takhreej": {
    "arabic": "صحيح بمجموع طرقه. أصله في البخاري (1866) ومسلم (1644). أما زيادة الأمر بالصيام ففيها ضعف في السند عند أحمد والأربعة، لكن أصل النهي عن المشقة في النذر ثابت صحيح.",
    "urdu": "یہ روایت اپنی اصل کے اعتبار سے صحیح ہے اور بخاری (1866) و مسلم (1644) میں موجود ہے۔ تاہم تین دن کے روزوں کا ذکر جن الفاظ میں آیا ہے اس کی سند میں کلام ہے، لیکن نذر میں بلاوجہ مشقت کی ممانعت صحیح ثابت ہے۔",
    "english": "Authentic in its core. Recorded by Al-Bukhari (1866) and Muslim (1644). The addition regarding fasting three days has some weakness in its chain (Ahmad and the Four), but the core principle of forbidding unnecessary hardship in vows is sound."
  },
  "importantWords": [
    {
      "arabic": "نَذَرَتْ",
      "english": "Vowed",
      "urdu": "نذر مانی"
    },
    {
      "arabic": "حَافِيَةً",
      "english": "Barefoot",
      "urdu": "ننگے پاؤں"
    },
    {
      "arabic": "بِشَقَاءِ",
      "english": "Hardship",
      "urdu": "مشقت / تکلیف"
    },
    {
      "arabic": "فَلْتَخْتَمِرْ",
      "english": "Let her cover",
      "urdu": "وہ دوپٹہ اوڑھ لے"
    },
    {
      "arabic": "وَلْتَرْكَبْ",
      "english": "Let her ride",
      "urdu": "اور سوار ہو جائے"
    }
  ],
  "summary": {
    "urdu": "اسلام بلاوجہ کی جسمانی مشقت اور ننگے پاؤں چلنے جیسی نذروں کی حوصلہ شکنی کرتا ہے اور ایسی صورت میں سواری استعمال کرنے اور کفارہ دینے کا حکم دیتا ہے۔",
    "english": "Islam discourages unnecessary physical hardship and vows like walking barefoot; in such cases, it commands using transport and providing atonement."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1866)",
      "english": "Reported by Al-Bukhari (1866)"
    },
    {
      "arabic": "رواه مسلم (1644)",
      "english": "Reported by Muslim (1644)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عقبة بن عامر الجهني",
        "english": "Uqbah bin Amir Al-Juhani"
      },
      "slug": "uqbah-bin-amir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9_N_vXU2jI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نذر اور مشقت کا تصور",
        "english": "Vows and the Concept of Hardship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نذر میں اعتدال",
              "english": "Moderation in Vows"
            },
            "content": {
              "urdu": [
                "ایسی نذر ماننا جس میں صرف جسمانی مشقت ہو اور کوئی شرعی نیکی نہ ہو، ناپسندیدہ ہے۔",
                "اللہ تعالیٰ بندوں کو بلاوجہ تکلیف میں دیکھ کر خوش نہیں ہوتا۔",
                "نذر کا مقصد اللہ کی اطاعت ہونا چاہیے نہ کہ اپنے نفس کو سزا دینا۔"
              ],
              "english": [
                "Making a vow that only involves physical pain without religious merit is disliked.",
                "Allah does not take pleasure in seeing His servants in unnecessary distress.",
                "The purpose of a vow should be obedience to Allah, not self-punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ نبوی ﷺ",
              "english": "Prophetic Wisdom"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے ننگے پاؤں چلنے کی مشقت کو ختم کرنے کا حکم دیا۔",
                "آپ ﷺ نے دین میں آسانی اور سہولت پیدا کرنے کی تعلیم دی ہے۔",
                "غیر شرعی مشقت کو نیکی سمجھنا ایک جاہلانہ تصور ہے جس کی اصلاح فرمائی گئی۔"
              ],
              "english": [
                "The Prophet (SAW) ordered the removal of the hardship of walking barefoot.",
                "He taught us to create ease and facility within the religion.",
                "Considering non-legislated hardship as a virtue is an ignorant concept he corrected."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نذر کا کفارہ",
        "english": "Atonement for Vows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزے کا حکم",
              "english": "Command to Fast"
            },
            "content": {
              "urdu": [
                "جب نذر کو پورا کرنا مشقت یا گناہ کا باعث ہو تو اسے توڑ دینا چاہیے۔",
                "نذر توڑنے کی صورت میں کفارہ ادا کرنا واجب ہوتا ہے۔",
                "اس حدیث کی ایک روایت میں تین دن کے روزوں کو بطور کفارہ ذکر کیا گیا ہے۔"
              ],
              "english": [
                "When fulfilling a vow causes undue hardship or sin, it must be broken.",
                "In the event of breaking a vow, paying atonement (Kaffarah) becomes obligatory.",
                "One narration of this Hadith mentions fasting three days as atonement."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف",
              "english": "Juristic Difference"
            },
            "content": {
              "urdu": [
                "کچھ علماء کے نزدیک ایسی نذر کا کفارہ قسم کے کفارے کے برابر ہے۔",
                "امام شافعی کے نزدیک ایسی نذر میں صرف نیکی کا پہلو پورا کرنا کافی ہے۔",
                "جمہور کے نزدیک نذرِ مشقت کو چھوڑ کر سواری استعمال کرنا اور کفارہ دینا بہتر ہے۔"
              ],
              "english": [
                "Some scholars believe the atonement for such a vow is equal to that of an oath.",
                "According to Imam Shafi'i, fulfilling the virtuous aspect of the vow is sufficient.",
                "The majority suggest using transport and atoning instead of self-inflicted pain."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کے لیے خصوصی احکام",
        "english": "Specific Rulings for Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پردہ اور حیا",
              "english": "Modesty and Hijab"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے نذر کے دوران بھی پردے (خمار) کا حکم دیا ہے۔",
                "عبادت کے جوش میں شرعی حدود اور حیا کو پامال نہیں کرنا چاہیے۔",
                "خواتین کے لیے ننگے پاؤں یا بے پردہ سفر کرنا فتنے کا باعث ہو سکتا ہے۔"
              ],
              "english": [
                "The Prophet (SAW) commanded covering (Khimar) even while fulfilling a vow.",
                "Religious enthusiasm should not lead to violating Sharia boundaries or modesty.",
                "For women, traveling barefoot or without proper covering can lead to Fitnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "محرم کی اہمیت",
              "english": "Importance of Mahram"
            },
            "content": {
              "urdu": [
                "بہن کا اپنے بھائی (عقبہ) کے ذریعے فتویٰ پوچھنا ایک بہترین اسوہ ہے۔",
                "خواتین کو چاہیے کہ وہ مشکل معاملات میں اپنے محرم مردوں سے مدد لیں۔",
                "دین کے معاملے میں شرم و حیا علم حاصل کرنے میں رکاوٹ نہیں ہونی چاہیے۔"
              ],
              "english": [
                "The sister asking for a Fatwa through her brother (Uqbah) is an excellent example.",
                "Women should seek assistance from their Mahram men in difficult matters.",
                "Modesty should not prevent a person from seeking knowledge in religious affairs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دین میں آسانی",
        "english": "Ease in Religion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی بے نیازی",
              "english": "Allah's Self-Sufficiency"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ ہماری تکلیفوں کا محتاج نہیں ہے بلکہ وہ نیتوں کو دیکھتا ہے۔",
                "دین اسلام فطرت کا دین ہے جو انسان پر بوجھ نہیں ڈالتا۔",
                "نبی کریم ﷺ نے ہمیشہ دو کاموں میں سے آسان کام کو ترجیح دی۔"
              ],
              "english": [
                "Allah is not in need of our suffering; rather, He looks at our intentions.",
                "Islam is the religion of nature (Fitrah) and does not burden humans.",
                "The Prophet (SAW) always preferred the easier of two options."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی سبق",
              "english": "Practical Lesson"
            },
            "content": {
              "urdu": [
                "بغیر سوچے سمجھے مانی گئی نذریں بعد میں پچھتاوے کا باعث بنتی ہیں۔",
                "عبادات میں سنت کے طریقے پر عمل کرنا ہی اصل کامیابی ہے۔",
                "جذبات میں آکر ایسے وعدے نہ کریں جنہیں پورا کرنا ناممکن یا مشکل ہو۔"
              ],
              "english": [
                "Vows made without forethought often lead to later regret.",
                "Following the Sunnah method in worship is the true success.",
                "Do not make promises in emotional states that are impossible or difficult to keep."
              ]
            }
          }
        ]
      }
    }
  ]
}