{
  "hadithId": 963,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1105"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (6818)‏، ومسلم (1458) من حديث أبي هريرة.‏ ورواه البخاري (6817)‏، ومسلم (1457) من حديث عائشة في قصة نزاع عبد بن زمعة وسعد بن أبي وقاص.‏ ورواه النسائي (3484) من حديث ابن مسعود.‏",
    "urdu": "صحیح۔ اسے بخاری (6818) اور مسلم (1458) نے حضرت ابوہریرہ سے روایت کیا ہے۔ بخاری (6817) اور مسلم (1457) نے حضرت عائشہ سے عبد بن زمعہ اور سعد بن ابی وقاص کے جھگڑے والے واقعے میں بھی اسے ذکر کیا ہے۔ نسائی نے ابن مسعود سے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6818) and Muslim (1458) from Abu Hurairah. Also reported by Al-Bukhari (6817) and Muslim (1457) from Aisha regarding the dispute between 'Abd bin Zam'ah and Sa'd bin Abi Waqqas. An-Nasa'i (3484) reported it from Ibn Mas'ud."
  },
  "importantWords": [
    {
      "arabic": "الْوَلَدُ لِلْفِرَاشِ",
      "english": "The child belongs to the bed",
      "urdu": "بچہ بستر والے (شوہر) کا ہے"
    },
    {
      "arabic": "الْعَاهِرِ",
      "english": "The adulterer",
      "urdu": "زنا کرنے والا / زانی"
    },
    {
      "arabic": "الْحَجَرُ",
      "english": "The stone",
      "urdu": "پتھر (محرومی یا رجم)"
    }
  ],
  "summary": {
    "urdu": "اسلامی قانون میں نسب ثابت کرنے کا بنیادی قاعدہ یہ ہے کہ بچہ اس مرد کا مانا جائے گا جس کے نکاح میں وہ عورت ہے، جبکہ زنا کرنے والے کا نسب پر کوئی حق نہیں۔",
    "english": "The fundamental Shariah rule for establishing lineage is that a child belongs to the husband of the woman who gave birth, while the adulterer has no legal claim to the child."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6818)",
      "english": "Sahih al-Bukhari (6818)"
    },
    {
      "arabic": "صحيح مسلم (1458)",
      "english": "Sahih Muslim (1458)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_vW0BTo",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نسب کی بنیاد اور اسلامی ضابطہ",
        "english": "The Basis of Lineage and Islamic Regulation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الولد للفراش کا مفہوم",
              "english": "Meaning of 'Al-Waladu lil-Firash'"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ اگر کسی شادی شدہ عورت کے ہاں بچہ پیدا ہو، تو اس کا نسب اس کے شوہر سے ہی ثابت ہوگا۔",
                "نکاح کا رشتہ نسب کے ثبوت کے لیے سب سے مضبوط شرعی بنیاد ہے۔",
                "جب تک شوہر صریح طور پر لعان کے ذریعے انکار نہ کرے، بچہ اسی کا کہلائے گا۔"
              ],
              "english": [
                "It means if a child is born to a married woman, the lineage is legally attributed to her husband.",
                "The marriage contract is the strongest Shariah basis for establishing paternity.",
                "Unless the husband explicitly denies it through the process of Li'an, the child is legally his."
              ]
            }
          },
          {
            "title": {
              "urdu": "زانی کی محرومی",
              "english": "Deprivation of the Adulterer"
            },
            "content": {
              "urdu": [
                "'العاہر الحجر' کا مطلب ہے کہ زانی کے حصے میں صرف پتھر (محرومی) ہے۔",
                "زنا سے پیدا ہونے والے بچے کا نسب زانی سے ثابت نہیں ہوتا، خواہ وہ کتنا ہی دعویٰ کرے۔",
                "اسلام غیر فطری اور غیر قانونی تعلقات کے نتیجے میں نسب کے اختلاط کی حوصلہ شکنی کرتا ہے۔"
              ],
              "english": [
                "'Al-Ahir al-Hajar' means the adulterer receives only the stone (total deprivation).",
                "The lineage of a child born from adultery is not attributed to the adulterer, regardless of his claims.",
                "Islam discourages the confusion of lineage resulting from illicit and illegal relationships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تاریخی پس منظر اور واقعہ",
        "english": "Historical Background and Incident"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زمعہ کے بیٹے کا قصہ",
              "english": "The Story of Zam'ah's Son"
            },
            "content": {
              "urdu": [
                "سعد بن ابی وقاص اور عبد بن زمعہ کے درمیان ایک بچے کے نسب پر جھگڑا ہوا۔",
                "سعد نے دعویٰ کیا کہ یہ میرے بھائی کا بچہ ہے، جبکہ عبد نے کہا یہ میرے باپ کے بستر پر پیدا ہوا۔",
                "نبی ﷺ نے 'الولد للفراش' کا سنہری اصول بیان کرتے ہوئے بچہ زمعہ کے خاندان کو دے دیا۔"
              ],
              "english": [
                "A dispute arose between Sa'd bin Abi Waqqas and 'Abd bin Zam'ah over a child's paternity.",
                "Sa'd claimed the child was his brother's, while 'Abd claimed the child was born on his father's bed.",
                "The Prophet (ﷺ) applied the principle of 'the child belongs to the bed' and gave the child to Zam'ah's family."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاطی حکم",
              "english": "Precautionary Instruction"
            },
            "content": {
              "urdu": [
                "اگرچہ بچہ زمعہ کا قرار پایا، مگر اس کی شباہت سعد کے بھائی سے ملتی تھی۔",
                "نبی ﷺ نے احتیاطاً اپنی زوجہ سودہ (جو زمعہ کی بیٹی تھیں) کو اس بچے سے پردہ کرنے کا حکم دیا۔",
                "اس سے معلوم ہوا کہ قانونی نسب اور ظاہری شباہت میں فرق ہو تو احتیاط بہتر ہے۔"
              ],
              "english": [
                "Although the child was legally Zam'ah's, he physically resembled Sa'd's brother.",
                "As a precaution, the Prophet (ﷺ) ordered his wife Sawdah (Zam'ah's daughter) to observe Hijab from him.",
                "This shows that when legal lineage and physical resemblance differ, caution is preferred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سماجی حکمت",
        "english": "Juristic and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کا تحفظ",
              "english": "Protection of the Family System"
            },
            "content": {
              "urdu": [
                "یہ اصول معاشرے کو انتشار اور بے جا شکوک و شبہات سے بچاتا ہے۔",
                "اگر نسب کا فیصلہ محض شباہت پر ہوتا تو خاندانی نظام درہم برہم ہو جاتا۔",
                "قانون کی حتمیت ہی معاشرتی سکون کی ضامن ہوتی ہے۔"
              ],
              "english": [
                "This principle protects society from chaos and unwarranted suspicions.",
                "If paternity were decided solely on resemblance, the family system would collapse.",
                "The certainty of law is the guarantor of social tranquility."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچے کے حقوق",
              "english": "Rights of the Child"
            },
            "content": {
              "urdu": [
                "اسلام ہر بچے کو ایک معتبر شناخت اور سرپرست فراہم کرنا چاہتا ہے۔",
                "بچے کو 'حرام زادہ' کہہ کر معاشرے سے کاٹنے کے بجائے اسے قانونی بستر کی طرف منسوب کیا جاتا ہے۔",
                "اس سے بچے کی پرورش، وراثت اور نفقہ کے حقوق محفوظ ہو جاتے ہیں۔"
              ],
              "english": [
                "Islam aims to provide every child with a dignified identity and a guardian.",
                "Instead of outcasting a child as 'illegitimate', the child is attributed to the legal bed.",
                "This secures the child's rights to upbringing, inheritance, and maintenance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کی اہمیت",
              "english": "Importance of Marriage"
            },
            "content": {
              "urdu": [
                "نکاح ایک ایسی ڈھال ہے جو انسان کی نسل اور عزت کی حفاظت کرتی ہے۔",
                "غیر قانونی تعلقات کے نتیجے میں انسان نہ صرف گناہ گار ہوتا ہے بلکہ حقوق سے بھی محروم رہتا ہے۔",
                "پاکیزہ زندگی گزارنا ہی دنیا اور آخرت کی کامیابی ہے۔"
              ],
              "english": [
                "Marriage is a shield that protects one's lineage and honor.",
                "Through illicit relationships, one not only sins but also loses legal rights.",
                "Leading a chaste life is the path to success in both worlds."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدگمانی سے بچاؤ",
              "english": "Avoiding Suspicion"
            },
            "content": {
              "urdu": [
                "مردوں کو چاہیے کہ وہ اپنی بیویوں پر بلاوجہ شک نہ کریں اور نسب کی نفی نہ کریں۔",
                "شریعت نے ایک واضح بنیاد فراہم کر دی ہے تاکہ گھریلو زندگی میں تلخی پیدا نہ ہو۔",
                "اللہ کی حدود کا احترام کرنا ہر مسلمان کا فریضہ ہے۔"
              ],
              "english": [
                "Men should not harbor baseless doubts about their wives or deny paternity.",
                "Shariah has provided a clear foundation to prevent bitterness in domestic life.",
                "Respecting the limits set by Allah is a duty upon every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}