{
  "hadithId": 1104,
  "hadithNo": 25,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/25"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "ضعيف لإرساله. أخرجه أبو داود في المراسيل (337). وسعيد بن جبير تابعي جليل، لكن الحديث مرسل. والذين قتلوا صبراً يوم بدر هم: عقبة بن أبي معيط، والنضر بن الحارث، وطعيمة بن عدي.",
    "urdu": "یہ روایت مرسل ہونے کی وجہ سے ضعیف ہے۔ امام ابوداؤد نے اسے المراسیل (337) میں روایت کیا ہے۔ سعید بن جبیر تابعی ہیں، انہوں نے براہِ راست نبی ﷺ سے روایت کیا ہے۔ بدر کے دن جنہیں قتل کیا گیا وہ عقبہ بن ابی معیط، نضر بن حارث اور طعیمہ بن عدی تھے۔",
    "english": "Weak due to its Mursal nature. Reported by Abu Dawud in Al-Marasil (337). Sa'id bin Jubair is a Tabi'i, hence the chain is broken. The individuals executed were Uqbah bin Abi Mu'ayt, An-Nadr bin al-Harith, and Tu'aymah bin Adi."
  },
  "importantWords": [
    {
      "arabic": "صَبْراً",
      "english": "In captivity/Bound",
      "urdu": "باندھ کر/قید کی حالت میں"
    },
    {
      "arabic": "قَتَلَ",
      "english": "Executed/Killed",
      "urdu": "قتل کیا"
    },
    {
      "arabic": "يَوْمَ بَدْرٍ",
      "english": "Day of Badr",
      "urdu": "بدر کا دن"
    },
    {
      "arabic": "اَلْمَرَاسِيلِ",
      "english": "Mursal Traditions",
      "urdu": "مرسل روایتیں"
    },
    {
      "arabic": "ثِقَاتٌ",
      "english": "Trustworthy",
      "urdu": "قابلِ اعتماد راوی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں غزوہ بدر کے ان تین بڑے مجرموں کا ذکر ہے جنہیں ان کے سنگین جنگی جرائم اور اسلام دشمنی کی بنا پر قید کے بعد موت کی سزا دی گئی تھی۔",
    "english": "This Hadith refers to the execution of three major criminals after the Battle of Badr who were sentenced to death due to their grave war crimes and intense hostility toward Islam."
  },
  "references": [
    {
      "arabic": "مراسیل أبي داود (337)",
      "english": "Marasil Abi Dawud (337)"
    },
    {
      "arabic": "السنن الكبرى للبيهقي (9/64)",
      "english": "Al-Sunan al-Kubra by al-Bayhaqi (9/64)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعيد بن جبير",
        "english": "Sa'id bin Jubair"
      },
      "slug": "said-bin-jubair"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "ضعيف (مرسل)",
    "english": "Da'if (Mursal)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قتلِ صبراً کی وضاحت",
        "english": "Explanation of Execution in Captivity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اصطلاحی معنی",
              "english": "Technical Meaning"
            },
            "content": {
              "urdu": [
                "قتلِ صبراً کا مطلب ہے کسی جاندار کو باندھ کر یا قید کر کے قتل کرنا۔",
                "عام حالات میں اسلام جانداروں کو اس طرح مارنے سے سختی سے منع کرتا ہے۔",
                "لیکن جنگی جرائم کے مرتکب افراد کے لیے یہ سزا بطور عبرت دی جا سکتی ہے۔"
              ],
              "english": [
                "Qatl al-Sabr refers to killing a living being while it is bound or restrained.",
                "In general circumstances, Islam strictly forbids killing animals or humans this way.",
                "However, for those guilty of severe war crimes, it can be applied as a deterrent."
              ]
            }
          },
          {
            "title": {
              "urdu": "مجرمین کی شناخت",
              "english": "Identity of the Criminals"
            },
            "content": {
              "urdu": [
                "یہ تین افراد نضر بن حارث، عقبہ بن ابی معیط اور طعیمہ بن عدی تھے۔",
                "ان لوگوں نے مکہ میں مسلمانوں پر بدترین مظالم ڈھائے اور رسول اللہ ﷺ کو اذیت دی۔",
                "انہیں عام قیدیوں کی طرح نہیں چھوڑا گیا بلکہ ان کے جرائم کی سزا دی گئی۔"
              ],
              "english": [
                "The three individuals were An-Nadr, Uqbah bin Abi Mu'ayt, and Tu'aymah bin Adi.",
                "These men had committed heinous atrocities against Muslims in Makkah.",
                "They were not treated as ordinary prisoners but were executed for their crimes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیدیوں کے متعلق احکام",
        "english": "Rulings on Prisoners of War"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاکمِ وقت کا اختیار",
              "english": "Discretion of the Ruler"
            },
            "content": {
              "urdu": [
                "جنگی قیدیوں کے بارے میں اسلامی حاکم کو مختلف اختیارات حاصل ہیں۔",
                "وہ چاہے تو فدیہ لے کر چھوڑ دے، چاہے تو احسان کر کے بلا معاوضہ رہا کر دے۔",
                "اگر مصلحت ہو تو سنگین مجرموں کو موت کی سزا دینا بھی حاکم کا حق ہے۔"
              ],
              "english": [
                "The Islamic leader has several options regarding prisoners of war.",
                "He may release them for ransom or out of grace without any compensation.",
                "He also has the right to execute severe criminals if it serves public interest."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کا تقاضا",
              "english": "Requirement of Justice"
            },
            "content": {
              "urdu": [
                "اسلام دشمنی میں حد پار کرنے والوں کو معاف کرنا انصاف کے خلاف ہو سکتا تھا۔",
                "نبی ﷺ نے ثابت کیا کہ رحم کے ساتھ ساتھ عدل کا قیام بھی ضروری ہے۔",
                "سزا کا مقصد معاشرے سے فتنہ و فساد کے جڑ کا خاتمہ کرنا ہوتا ہے۔"
              ],
              "english": [
                "Pardoning those who crossed all limits of hostility would be contrary to justice.",
                "The Prophet (ﷺ) demonstrated that justice must accompany mercy.",
                "The purpose of punishment is to eradicate the roots of mischief from society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی علمی حیثیت",
        "english": "Scientific Status of the Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرسل روایت کی کمزوری",
              "english": "Weakness of Mursal Report"
            },
            "content": {
              "urdu": [
                "سعید بن جبیر تابعی ہیں اور انہوں نے صحابی کا واسطہ ذکر نہیں کیا ہے۔",
                "محدثین کے نزدیک ایسی روایت ضعیف سمجھی جاتی ہے کیونکہ سند میں انقطاع ہے۔",
                "تاہم، سیرت کی دیگر مستند کتابوں میں ان ہلاکتوں کی تفصیلات موجود ہیں۔"
              ],
              "english": [
                "Sa'id bin Jubair is a Tabi'i and did not mention the Companion source.",
                "Scholars consider such narrations weak due to the break in the chain.",
                "However, details of these executions are found in authentic Seerah books."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام ابوداؤد کا اسلوب",
              "english": "Style of Imam Abu Dawud"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد نے 'المراسیل' میں ایسی روایات جمع کی ہیں جو فقہی اہمیت رکھتی ہیں۔",
                "سعید بن جبیر کے تمام راوی ثقہ ہیں، جو روایت کی بنیاد کو مضبوط کرتے ہیں۔",
                "فقہاء بعض اوقات مراسیل سے بھی استدلال کرتے ہیں جب وہ مشہور ہوں۔"
              ],
              "english": [
                "Imam Abu Dawud collected narrations of juristic importance in 'Al-Marasil'.",
                "All sub-narrators of Sa'id bin Jubair are reliable, strengthening the report.",
                "Jurists sometimes derive rulings from Mursal reports when they are well-known."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور حکمت",
        "english": "Practical Lesson and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دشمنِ دین کا انجام",
              "english": "End of the Enemy of Faith"
            },
            "content": {
              "urdu": [
                "اللہ کے دین اور اس کے رسول کا مذاق اڑانے والوں کا انجام ہمیشہ برا ہوتا ہے۔",
                "ظلم کتنا ہی طویل کیوں نہ ہو، ایک دن اسے مٹنا ہی ہوتا ہے۔",
                "بدر کا معرکہ حق کی فتح اور باطل کی ذلت کا نشان بن کر رہے گا۔"
              ],
              "english": [
                "Those who mock Allah's religion and His Messenger always face a bad end.",
                "No matter how long oppression lasts, it is destined to perish one day.",
                "The Battle of Badr remains a sign of truth's victory and falsehood's disgrace."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیادت کی ذمہ داری",
              "english": "Leader's Responsibility"
            },
            "content": {
              "urdu": [
                "ایک اسلامی سپہ سالار کو سخت اور نرم فیصلوں میں توازن رکھنا چاہیے۔",
                "جہاں معافی فتنہ بڑھائے، وہاں سزا دینا ہی اصل رحمت اور دانائی ہے۔",
                "صحابہ کرام نے ہر مشکل فیصلے میں نبی ﷺ کی کامل اطاعت کی۔"
              ],
              "english": [
                "An Islamic commander must balance between stern and lenient decisions.",
                "Where pardon increases mischief, punishment is the true mercy and wisdom.",
                "The Companions showed perfect obedience to the Prophet (ﷺ) in every tough decision."
              ]
            }
          }
        ]
      }
    }
  ]
}