{
  "hadithId": 936,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/936", "muslim/1493"],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (1493)، وأصله في البخاري (4745) و (5308).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام مسلم (1493) نے روایت کیا ہے اور اس کی اصل بخاری میں بھی موجود ہے۔",
    "english": "Sahih. Reported by Muslim (1493) and Al-Bukhari (4745, 5308)."
  },
  "importantWords": [
    {
      "arabic": "فَاحِشَةٍ",
      "english": "Adultery / Lewdness",
      "urdu": "بے حیائی / زنا"
    },
    {
      "arabic": "ابتليت",
      "english": "Afflicted / Tested",
      "urdu": "مبتلا ہوا"
    },
    {
      "arabic": "أَهْوَنُ",
      "english": "Lighter / Easier",
      "urdu": "ہلکا / آسان"
    },
    {
      "arabic": "فَرَّقَ",
      "english": "Separated",
      "urdu": "جدائی کرا دی"
    },
    {
      "arabic": "شَهَادَاتٍ",
      "english": "Testimonies",
      "urdu": "گواہیاں / قسمیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں لعان کا شرعی طریقہ بتایا گیا ہے کہ جب میاں بیوی ایک دوسرے پر زنا کا الزام لگائیں اور گواہ نہ ہوں تو وہ قسموں کے ذریعے علیحدگی اختیار کر لیتے ہیں۔",
    "english": "This Hadith explains the legal process of Li'an, where spouses separate through specific oaths when one accuses the other of adultery without external witnesses."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1493)",
      "english": "Reported by Muslim (1493)"
    },
    {
      "arabic": "رواه البخاري (4745)",
      "english": "Reported by Al-Bukhari (4745)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لعان کی مشروعیت اور پس منظر",
        "english": "Legitimacy and Background of Li'an"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمِ الہی کا نزول",
              "english": "Revelation of Divine Decree"
            },
            "content": {
              "urdu": [
                "لعان کا حکم ان حالات کے لیے ہے جب شوہر بیوی کو بدکاری میں دیکھے مگر چار گواہ نہ ہوں۔",
                "سورۃ النور کی آیات (6-9) میں اس کا تفصیلی طریقہ کار اللہ نے خود بیان فرمایا ہے۔",
                "یہ حکم مرد کو حدِ قذف (الزام تراشی کی سزا) سے اور عورت کو حدِ زنا سے بچاتا ہے۔"
              ],
              "english": [
                "The ruling of Li'an is for situations where a husband witnesses adultery but lacks four witnesses.",
                "Allah detailed this process personally in Surah An-Nur, verses 6 to 9.",
                "This decree protects the man from the penalty of slander and the woman from the penalty of adultery."
              ]
            }
          },
          {
            "title": {
              "urdu": "دنیاوی سزا بمقابلہ آخرت",
              "english": "Worldly vs. Eternal Punishment"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے دونوں فریقین کو آخرت کے سخت عذاب سے ڈرا کر سچ بولنے کی تلقین فرمائی۔",
                "آپ ﷺ نے واضح کیا کہ دنیا کی شرمندگی یا سزا آخرت کی آگ سے بہت معمولی ہے۔",
                "یہ اسوہ ہمیں سکھاتا ہے کہ قانونی کارروائی سے پہلے اخلاقی نصیحت اور خوفِ خدا ضروری ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) urged both parties to speak the truth by warning them of the Hereafter's punishment.",
                "He clarified that worldly shame or penalties are negligible compared to the fire of the Hereafter.",
                "This example teaches that moral exhortation and fear of Allah should precede legal action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لعان کا عملی طریقہ کار",
        "english": "Practical Procedure of Li'an"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قسموں کی ترتیب",
              "english": "Sequence of Oaths"
            },
            "content": {
              "urdu": [
                "مرد چار بار اللہ کی قسم کھا کر کہتا ہے کہ وہ سچا ہے اور پانچویں بار اپنے اوپر لعنت کرتا ہے۔",
                "عورت چار بار قسم کھا کر اسے جھوٹا قرار دیتی ہے اور پانچویں بار غضبِ الہی کی دعا کرتی ہے۔",
                "ان قسموں کا پورا ہونا فریقین کے درمیان حتمی قانونی فیصلے کی بنیاد بنتا ہے۔"
              ],
              "english": [
                "The man swears by Allah four times that he is truthful and invokes a curse on himself the fifth time.",
                "The woman swears four times that he is a liar and invokes Allah's wrath on herself the fifth time.",
                "Completing these oaths forms the basis for the final legal judgment between the parties."
              ]
            }
          },
          {
            "title": {
              "urdu": "فریقین کے درمیان تفریق",
              "english": "Separation Between Parties"
            },
            "content": {
              "urdu": [
                "لعان مکمل ہونے کے بعد نبی ﷺ نے ان کے درمیان دائمی علیحدگی فرما دی۔",
                "اس علیحدگی کے بعد وہ مرد اور عورت دوبارہ کبھی نکاح نہیں کر سکتے۔",
                "یہ تفریق خاندانی پاکیزگی اور شک و شبہات سے پاک معاشرے کے قیام کے لیے ہے۔"
              ],
              "english": [
                "After the Li'an was completed, the Prophet (ﷺ) enforced a permanent separation between them.",
                "Following this separation, the man and woman can never remarry each other again.",
                "This division aims to preserve family purity and establish a society free from suspicion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی اثرات",
        "english": "Juristic and Legal Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالتی مداخلت کا وجوب",
              "english": "Necessity of Judicial Intervention"
            },
            "content": {
              "urdu": [
                "لعان کا عمل صرف قاضی یا حاکمِ وقت کی موجودگی میں ہی معتبر ہوتا ہے۔",
                "عام حالات میں الزام لگانا گناہ ہے، مگر لعان ایک قانونی استثناء فراہم کرتا ہے۔",
                "یہ نظام ثابت کرتا ہے کہ اسلام میں نجی معاملات کو بھی قانونی تحفظ حاصل ہے۔"
              ],
              "english": [
                "The process of Li'an is only valid in the presence of a judge or the ruler.",
                "Accusation is a sin in normal cases, but Li'an provides a specific legal exception.",
                "This system proves that in Islam, even private matters are granted legal protection."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسب اور وراثت",
              "english": "Lineage and Inheritance"
            },
            "content": {
              "urdu": [
                "اگر حمل موجود ہو اور شوہر لعان کرے تو بچے کا نسب شوہر سے منقطع ہو جاتا ہے۔",
                "ایسا بچہ صرف اپنی ماں کی طرف منسوب کیا جاتا ہے اور اسی سے وراثت پاتا ہے۔",
                "یہ قانون نسب کی حفاظت اور خاندان میں غیروں کی شمولیت روکنے کے لیے ہے۔"
              ],
              "english": [
                "If a pregnancy exists and the husband performs Li'an, the child's lineage to the husband is severed.",
                "Such a child is attributed only to the mother and inherits only from her side.",
                "This law exists to protect lineage and prevent the inclusion of outsiders in the family."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تربیتی اسباق",
        "english": "Moral and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ستار العیوبی اور احتیاط",
              "english": "Concealing Faults and Caution"
            },
            "content": {
              "urdu": [
                "غیر ضروری طور پر عیب اچھالنا اسلام میں سخت ناپسندیدہ عمل ہے۔",
                "اگر گواہ نہ ہوں تو خاموشی یا علیحدگی کا راستہ فتنہ روکنے میں مددگار ہے۔",
                "لعان کا راستہ صرف اس وقت اپنایا جائے جب معاملہ ناگزیر ہو جائے۔"
              ],
              "english": [
                "Unnecessarily exposing faults is highly discouraged in Islamic teachings.",
                "In the absence of witnesses, silence or separation helps in preventing social discord.",
                "The path of Li'an should only be adopted when the matter becomes unavoidable."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی عدالت کا خوف",
              "english": "Fear of Allah's Court"
            },
            "content": {
              "urdu": [
                "دنیاوی عدالت سے بچنا ممکن ہے مگر اللہ کی گرفت سے کوئی نہیں بچ سکتا۔",
                "جھوٹی قسم کھانا لعنت اور غضبِ الہی کو دعوت دینا ہے۔",
                "انسان کو ہر حال میں سچائی کا دامن تھامے رکھنا چاہیے چاہے وہ کتنا ہی کڑوا ہو۔"
              ],
              "english": [
                "It is possible to escape a worldly court, but no one escapes Allah's grasp.",
                "Taking a false oath is an invitation to Allah's curse and wrath.",
                "A human being must adhere to the truth in all circumstances, no matter how bitter it is."
              ]
            }
          }
        ]
      }
    }
  ]
}