{
  "hadithId": 808,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/808"],
    "kitabId": 7,
    "inKitabBab": 20,
    "arabicBook": "بلوغ المرام",
    "babId": 61
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أحمد (2/178)، وأبو داود (2911)، والنسائي في الكبرى (4/82)، وابن ماجه (2731). صححه الحاكم والدارقطني وغيرهم.",
    "urdu": "یہ روایت حسن ہے۔ اسے امام احمد، ابوداؤد (2911)، نسائی اور ابن ماجہ نے روایت کیا ہے۔ حاکم اور دارقطنی نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan. Reported by Ahmad (2/178), Abu Dawud (2911), An-Nasa'i in al-Kubra (4/82), and Ibn Majah (2731). Authenticated by Al-Hakim and others."
  },
  "importantWords": [
    {
      "arabic": "لَا يَتَوَارَثُ",
      "english": "Do not inherit from each other",
      "urdu": "ایک دوسرے کے وارث نہیں ہوں گے"
    },
    {
      "arabic": "أَهْلُ",
      "english": "People of / Followers of",
      "urdu": "پیروکار / والے"
    },
    {
      "arabic": "مِلَّتَيْنِ",
      "english": "Two religions / creeds",
      "urdu": "دو مختلف دین"
    },
    {
      "arabic": "شَتَّى",
      "english": "Different / Diverse",
      "urdu": "مختلف / الگ الگ"
    },
    {
      "arabic": "دِيَة",
      "english": "Blood money",
      "urdu": "خون بہا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا بنیادی پیغام یہ ہے کہ وراثت کا حق صرف اسی صورت میں قائم ہوتا ہے جب مرنے والا اور وارث دونوں کا دین ایک ہو؛ دین کا اختلاف وراثت میں رکاوٹ ہے۔",
    "english": "The core message of this Hadith is that inheritance is only established when the deceased and the heir share the same religion; religious difference acts as a barrier."
  },
  "references": [
    {
      "arabic": "مسند أحمد (6842)",
      "english": "Musnad Ahmad (6842)"
    },
    {
      "arabic": "سنن أبي داود (2911)",
      "english": "Sunan Abu Dawud (2911)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-Aas"
      },
      "slug": "abdullah-bin-amr-bin-al-aas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دین کا اختلاف اور وراثت",
        "english": "Religious Divergence and Succession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وراثت کی عالمی ممانعت",
              "english": "Universal Prohibition of Inheritance"
            },
            "content": {
              "urdu": [
                "حدیث کا مفہوم عام ہے کہ کسی بھی دو مختلف مذاہب کے لوگ ایک دوسرے کے وارث نہیں بن سکتے۔",
                "یہ صرف مسلمان اور کافر تک محدود نہیں، بلکہ دو مختلف غیر مسلم مذاہب پر بھی لاگو ہوتا ہے۔",
                "جمہور فقہاء کے نزدیک کفر کے تمام طبقات ایک ہی ملت شمار ہوتے ہیں سوائے مخصوص صورتوں کے۔"
              ],
              "english": [
                "The meaning is general: followers of any two different religions cannot inherit from each other.",
                "This is not limited to Muslims and non-Muslims but applies to different non-Muslim creeds too.",
                "Most jurists consider all types of disbelief as one nation, except in specific legal scenarios."
              ]
            }
          },
          {
            "title": {
              "urdu": "میت اور وارث کا تعلق",
              "english": "Connection Between Deceased and Heir"
            },
            "content": {
              "urdu": [
                "وراثت کی بنیاد باہمی ہمدردی، ولایت اور ایک ہی نظریاتی بنیاد پر ہوتی ہے۔",
                "جب عقیدہ بدل جائے تو وہ شرعی نصرت اور ولایت ختم ہو جاتی ہے جو وراثت کا تقاضا کرتی ہے۔",
                "اسلامی قانون میں مال کی منتقلی کو عقیدے کی مطابقت کے ساتھ مشروط کیا گیا ہے۔"
              ],
              "english": [
                "Inheritance is based on mutual support, loyalty, and a shared ideological foundation.",
                "When beliefs differ, the legal alliance and guardianship required for inheritance are severed.",
                "Islamic law conditions the transfer of wealth upon the compatibility of religious faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور استثناء",
        "english": "Juristic Details and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مسلموں کی باہمی وراثت",
              "english": "Mutual Inheritance Among Non-Muslims"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک اگر دو کافروں کے مذاہب الگ ہوں تو وہ وارث نہیں ہوں گے۔",
                "دیگر ائمہ کے نزدیک 'کفر ایک ہی ملت ہے'، لہذا وہ ایک دوسرے کے وارث بن سکتے ہیں۔",
                "یہ حدیث اس اختلاف میں امام شافعی کے موقف کی تائید کرتی نظر آتی ہے۔"
              ],
              "english": [
                "According to Imam Shafi'i, if two non-believers have different religions, they do not inherit.",
                "Other Imams hold that 'disbelief is one nation,' thus they can inherit from each other.",
                "This Hadith appears to support Imam Shafi'i's stance regarding this specific legal dispute."
              ]
            }
          },
          {
            "title": {
              "urdu": "قتل اور وراثت کا تعلق",
              "english": "Relationship Between Homicide and Inheritance"
            },
            "content": {
              "urdu": [
                "تخریج میں ذکر کردہ اضافے کے مطابق قاتل مقتول کی وراثت سے محروم رہتا ہے۔",
                "اگر قتل جان بوجھ کر ہو تو قاتل مال اور دیت (خون بہا) دونوں سے محروم ہوگا۔",
                "خطا کی صورت میں قاتل مال سے حصہ پا سکتا ہے مگر دیت سے اسے کچھ نہیں ملے گا۔"
              ],
              "english": [
                "According to additional narrations, a killer is barred from inheriting from the victim.",
                "If the murder is intentional, the killer is deprived of both the estate and blood money.",
                "In case of accidental killing, the killer may inherit from property but not from blood money."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی و اخلاقی حکمت",
        "english": "Social and Ethical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینی حمیت کا تحفظ",
              "english": "Protection of Religious Honor"
            },
            "content": {
              "urdu": [
                "وراثت کے یہ قوانین مسلمانوں کو اپنے دین پر ثابت قدم رہنے کی ترغیب دیتے ہیں۔",
                "یہ نظام اس بات کو یقینی بناتا ہے کہ مسلمانوں کا سرمایہ غیر مسلم حلقوں میں منتقل نہ ہو۔",
                "اس سے خاندانی ڈھانچے میں عقیدے کی مرکزیت اور اہمیت واضح ہوتی ہے۔"
              ],
              "english": [
                "These inheritance laws encourage Muslims to remain steadfast in their faith.",
                "The system ensures that the capital of Muslims does not transfer to non-Muslim circles.",
                "It clarifies the centrality and importance of faith within the family structure."
              ]
            }
          },
          {
            "title": {
              "urdu": "صلہ رحمی کے دیگر طریقے",
              "english": "Other Ways of Maintaining Ties"
            },
            "content": {
              "urdu": [
                "وراثت کی محرومی کا مطلب یہ نہیں کہ غیر مسلم رشتہ داروں کی مدد نہ کی جائے۔",
                "اسلام نے تحفہ، ہبہ اور صدقہ کے ذریعے ان کی مالی اعانت کی اجازت دی ہے۔",
                "یہ توازن برقرار رکھتا ہے کہ شرعی وراثت کے اصول بھی محفوظ رہیں اور انسانی ہمدردی بھی۔"
              ],
              "english": [
                "Barring inheritance does not mean one cannot help their non-Muslim relatives.",
                "Islam allows financial support through gifts, grants, and general charity.",
                "This maintains a balance: preserving Shariah principles while allowing human compassion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالتی فیصلوں کی بنیاد",
              "english": "Basis for Judicial Decisions"
            },
            "content": {
              "urdu": [
                "اسلامی عدالتیں وراثت کے مقدمات میں دین کے فرق کو بنیادی اہمیت دیتی ہیں۔",
                "کسی بھی وراثت کی تقسیم سے قبل وارثین کے عقیدے کی تصدیق لازمی ہے۔",
                "یہ حدیث ججوں اور مفتیوں کے لیے ایک واضح قانونی دستاویز کی حیثیت رکھتی ہے۔"
              ],
              "english": [
                "Islamic courts give fundamental importance to religious difference in inheritance cases.",
                "Verification of the heirs' faith is mandatory before any distribution of the estate.",
                "This Hadith serves as a clear legal document for judges and Muftis."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلم اقلیتوں کے لیے رہنمائی",
              "english": "Guidance for Muslim Minorities"
            },
            "content": {
              "urdu": [
                "غیر مسلم ممالک میں رہنے والے مسلمانوں کو اپنے وصیت نامے شرعی اصولوں پر تیار کرنے چاہئیں۔",
                "انہیں معلوم ہونا چاہیے کہ دین بدلنے سے وراثت کے قانونی حقوق پر کیا اثر پڑتا ہے۔",
                "ایسے حالات میں قانونی پیچیدگیوں سے بچنے کے لیے علماء سے رجوع کرنا ضروری ہے۔"
              ],
              "english": [
                "Muslims living in non-Muslim countries should prepare their wills based on Shariah.",
                "They should know how changing one's faith affects legal inheritance rights.",
                "In such situations, consulting scholars is necessary to avoid legal complications."
              ]
            }
          }
        ]
      }
    }
  ]
}