{
  "hadithId": 420,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/nasai:5144"],
    "kitabId": 2,
    "inKitabBab": 17,
    "arabicBook": "كتاب اللباس",
    "babId": 27
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (4/394)‏، والنسائي (8/161)‏، والترمذي (1720)‏، وقال الترمذي: \"حديث حسن صحيح\".",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، نسائی اور ترمذی نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے اور دیگر شواہد کی بنا پر یہ درجہ صحت کو پہنچتی ہے۔",
    "english": "Authentic (Sahih). Reported by Ahmad (4/394), An-Nasa'i (8/161), and At-Tirmidhi (1720). At-Tirmidhi graded it as 'Hasan Sahih'."
  },
  "importantWords": [
    {
      "arabic": "أُحِلَّ",
      "english": "Permitted / Halal",
      "urdu": "حلال کیا گیا"
    },
    {
      "arabic": "اَلذَّهَبُ",
      "english": "Gold",
      "urdu": "سونا"
    },
    {
      "arabic": "الْحَرِيرُ",
      "english": "Silk",
      "urdu": "ریشم"
    },
    {
      "arabic": "إِنَاثِ",
      "english": "Females",
      "urdu": "عورتیں / خواتین"
    },
    {
      "arabic": "ذُكُورِ",
      "english": "Males",
      "urdu": "مردوں"
    },
    {
      "arabic": "حُرِّمَ",
      "english": "Forbidden / Haram",
      "urdu": "حرام کیا گیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ سونا اور ریشم پہننا صرف خواتین کے لیے جائز ہے، جبکہ مردوں کے لیے ان کا استعمال شرعاً منع ہے۔",
    "english": "This Hadith clarifies that wearing gold and silk is only permissible for women, while it is strictly forbidden for men in Islam."
  },
  "references": [
    {
      "arabic": "جامع الترمذي (1720)",
      "english": "Jami' at-Tirmidhi (1720)"
    },
    {
      "arabic": "سنن النسائي (5144)",
      "english": "Sunan an-Nasa'i (5144)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa al-Ash'ari"
      },
      "slug": "abu-musa-al-ashari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=5rL9E2Xm-x0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حلت و حرمت کی حکمت",
        "english": "Wisdom of Permission and Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواتین کے لیے زینت",
              "english": "Adornment for Women"
            },
            "content": {
              "urdu": [
                "اسلام نے خواتین کی فطری ضرورت یعنی بناؤ سنگھار کا لحاظ رکھا ہے۔",
                "سونا اور ریشم خواتین کی نسوانیت اور خوبصورتی کے لیے مباح کیا گیا۔",
                "یہ ان کے لیے شوہروں کی خوشنودی حاصل کرنے کا ایک ذریعہ بھی ہے۔"
              ],
              "english": [
                "Islam acknowledges the natural need for adornment and beauty in women.",
                "Gold and silk were made permissible to cater to feminine nature.",
                "It serves as a means for them to seek the pleasure of their husbands."
              ]
            }
          },
          {
            "title": {
              "urdu": "مردوں کے لیے ممانعت",
              "english": "Prohibition for Men"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے سونا اور ریشم ان کی مردانگی کے وقار کے خلاف ہے۔",
                "یہ اشیاء عیش و عشرت اور تکبر کا باعث بنتی ہیں جو مرد کو نرم بناتی ہیں۔",
                "اسلام چاہتا ہے کہ مرد اپنی شخصیت میں وقار، سادگی اور سختی برقرار رکھیں۔"
              ],
              "english": [
                "For men, gold and silk are contrary to the dignity of masculinity.",
                "These items lead to luxury and pride, which may weaken a man's character.",
                "Islam intends for men to maintain dignity, simplicity, and strength in their persona."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی حدود و قیود",
        "english": "Legal Boundaries and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ریشم کی استثنائی صورتیں",
              "english": "Exceptions for Silk"
            },
            "content": {
              "urdu": [
                "شدید خارش یا طبی ضرورت کی بنا پر مردوں کو ریشم کی اجازت مل سکتی ہے۔",
                "چار انگلیوں کے برابر ریشم کی پٹی یا بارڈر قمیص پر لگانا جائز ہے۔",
                "مجبوری کی حالت میں حرام اشیاء کا استعمال بقدرِ ضرورت درست ہوتا ہے۔"
              ],
              "english": [
                "Men may be allowed to wear silk for severe itching or medical necessity.",
                "A silk border or strip equivalent to four fingers on a shirt is permissible.",
                "In cases of absolute necessity, forbidden items may be used within limits."
              ]
            }
          },
          {
            "title": {
              "urdu": "سونے کا استعمال",
              "english": "Use of Gold"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے سونے کی انگوٹھی، گھڑی یا چین پہننا سخت ممنوع ہے۔",
                "چاندی کی انگوٹھی (ساڑھے چار ماشہ سے کم) مردوں کے لیے جائز ہے۔",
                "خواتین کے لیے بھی سونے کے استعمال میں اسراف اور نمائش سے بچنا لازم ہے۔"
              ],
              "english": [
                "Wearing gold rings, watches, or chains is strictly forbidden for men.",
                "A silver ring (less than 4.37g) is permissible for men to wear.",
                "Women must also avoid extravagance and showing off when using gold."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی و اخلاقی اثرات",
        "english": "Social and Moral Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکبر کا خاتمہ",
              "english": "Eradication of Arrogance"
            },
            "content": {
              "urdu": [
                "قیمتی اشیاء کا بے جا استعمال معاشرے میں طبقاتی فرق پیدا کرتا ہے۔",
                "مردوں کو ان سے روک کر سادگی اور مساوات کا سبق دیا گیا ہے۔",
                "دولت کی نمائش سے غریب طبقے میں احساسِ محرومی جنم لیتا ہے۔"
              ],
              "english": [
                "Excessive use of precious items creates class divisions in society.",
                "Restricting men from these teaches a lesson in simplicity and equality.",
                "Flaunting wealth creates a sense of deprivation among the poor."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی فکر",
              "english": "Concern for the Hereafter"
            },
            "content": {
              "urdu": [
                "دنیا کی عارضی لذتوں کو چھوڑنا آخرت میں عظیم اجر کا باعث ہے۔",
                "نبی ﷺ نے فرمایا جو دنیا میں ریشم پہنے گا وہ آخرت میں محروم رہے گا۔",
                "مومن کا اصل مقصد اللہ کی رضا اور جنت کی دائمی نعمتیں ہونی چاہئیں۔"
              ],
              "english": [
                "Giving up temporary worldly pleasures leads to great rewards in the Afterlife.",
                "The Prophet (PBUH) said whoever wears silk here is deprived of it hereafter.",
                "A believer's true goal should be Allah's pleasure and eternal bliss."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا پیغام",
        "english": "Practical Life Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباعِ سنت کا جذبہ",
              "english": "Spirit of Following Sunnah"
            },
            "content": {
              "urdu": [
                "ہر معاملے میں اللہ اور اس کے رسول ﷺ کے حکم کو مقدم رکھیں۔",
                "فیشن کے نام پر حرام لباس اور زیورات سے خود کو بچائیں۔",
                "سنت پر عمل کرنے میں ہی دونوں جہانوں کی کامیابی چھپی ہے۔"
              ],
              "english": [
                "Prioritize the commands of Allah and His Messenger (PBUH) in all matters.",
                "Avoid forbidden clothing and jewelry even in the name of fashion.",
                "Success in both worlds is hidden in following the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسلِ نو کی تربیت",
              "english": "Training the New Generation"
            },
            "content": {
              "urdu": [
                "بچوں کو شروع سے حلال و حرام لباس کے فرق کی تعلیم دیں۔",
                "لڑکوں کو سونے اور ریشم سے دور رکھ کر ان میں مردانگی پیدا کریں۔",
                "گھروں میں اسلامی طرزِ زندگی کو رواج دینا والدین کی ذمہ داری ہے۔"
              ],
              "english": [
                "Teach children the difference between halal and haram clothing early on.",
                "Build masculinity in boys by keeping them away from gold and silk.",
                "It is the parents' duty to promote an Islamic lifestyle at home."
              ]
            }
          }
        ]
      }
    }
  ]
}
