{
  "hadithId": 1210,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/22"],
    "kitabId": 14,
    "inKitabBab": 3,
    "arabicBook": "كتاب القضاء",
    "babId": 99
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (4552)، ومسلم (1711). ورواية البيهقي (10/252) صحيحة ولها شواهد كثيرة.",
    "urdu": "صحیح۔ اسے بخاری (4552) اور مسلم (1711) نے روایت کیا ہے۔ بیہقی کی روایت (10/252) بھی صحیح سند سے مروی ہے اور اس کے کئی شواہد موجود ہیں۔",
    "english": "Sahih. Reported by al-Bukhari (4552) and Muslim (1711). The narration by al-Bayhaqi (10/252) is authentic and supported by numerous other chains."
  },
  "importantWords": [
    {
      "arabic": "بِدَعْوَاهُمْ",
      "english": "By their claims",
      "urdu": "ان کے دعوؤں کی بنیاد پر"
    },
    {
      "arabic": "دِمَاءَ",
      "english": "Blood (Lives)",
      "urdu": "خون / جانیں"
    },
    {
      "arabic": "أَمْوَالَهُمْ",
      "english": "Their properties",
      "urdu": "ان کے مال و دولت"
    },
    {
      "arabic": "اَلْيَمِينُ",
      "english": "The oath",
      "urdu": "قسم"
    },
    {
      "arabic": "اَلْبَيِّنَةُ",
      "english": "The proof / Evidence",
      "urdu": "دلیل / گواہی"
    },
    {
      "arabic": "اَلْمُدَّعِي",
      "english": "The claimant / Plaintiff",
      "urdu": "مدعی / دعویٰ کرنے والا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اسلامی قانونِ شہادت کا بنیادی قاعدہ بیان کرتی ہے: ثبوت فراہم کرنا دعویٰ کرنے والے کی ذمہ داری ہے، جبکہ انکار کرنے والے پر صرف قسم لازم ہے۔",
    "english": "This Hadith establishes the fundamental rule of Islamic evidence: the burden of proof lies with the claimant, while the defendant is only required to take an oath."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب التفسير، رقم 4552",
      "english": "Sahih al-Bukhari, Book of Prophetic Commentary, No. 4552"
    },
    {
      "arabic": "صحيح مسلم، كتاب الأقضية، رقم 1711",
      "english": "Sahih Muslim, Book of Judicial Decisions, No. 1711"
    },
    {
      "arabic": "سنن البيهقي الكبرى، كتاب الدعاوى والبيئات، رقم 21102",
      "english": "Sunan al-Bayhaqi al-Kubra, Book of Claims and Evidence, No. 21102"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اسلامی قانونِ شہادت کا بنیادی اصول",
        "english": "Fundamental Principle of Islamic Jurisprudence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بارِ ثبوت مدعی پر",
              "english": "Burden of Proof on the Claimant"
            },
            "content": {
              "urdu": [
                "اسلامی عدالت کا قاعدہ ہے کہ جو شخص دعویٰ کرے، وہ اس کی دلیل بھی پیش کرے۔",
                "بغیر کسی ٹھوس ثبوت کے کسی کا دعویٰ محض زبانی کلامی بنیاد پر قبول نہیں کیا جاتا۔",
                "یہ اصول لوگوں کی جان، مال اور آبرو کے تحفظ کے لیے انتہائی ضروری اور اہم ہے۔"
              ],
              "english": [
                "It is a rule of the Islamic court that whoever makes a claim must also provide proof.",
                "Without solid evidence, a claim is not accepted based on mere verbal assertions.",
                "This principle is crucial for protecting people's lives, property, and honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "منکر پر قسم کی ذمہ داری",
              "english": "Defendant's Duty to Take an Oath"
            },
            "content": {
              "urdu": [
                "اگر مدعی کے پاس گواہ نہ ہوں تو مدعا علیہ (انکار کرنے والے) سے قسم لی جائے گی۔",
                "مدعا علیہ کی قسم اس کے بے گناہ ہونے کی ظاہری علامت سمجھی جاتی ہے۔",
                "اگر وہ قسم کھانے سے انکار کر دے تو فیصلہ مدعی کے حق میں ہو سکتا ہے۔"
              ],
              "english": [
                "If the claimant has no witnesses, the defendant (the denier) will be asked to take an oath.",
                "The defendant's oath is considered an apparent sign of their innocence in court.",
                "If the defendant refuses to take the oath, the verdict may be given in favor of the claimant."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "افراتفری اور جھوٹے دعوؤں کا سدِ باب",
        "english": "Preventing Chaos and False Claims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی امن کا تحفظ",
              "english": "Protection of Social Peace"
            },
            "content": {
              "urdu": [
                "اگر محض دعوے پر مال ملنا شروع ہو جائے تو معاشرے میں لوٹ مار مچ جائے گی۔",
                "حاسد لوگ نیک اور مالدار لوگوں کے خون اور جائیداد پر جھوٹے مقدمات قائم کریں گے۔",
                "شریعت نے 'البینہ' کی شرط لگا کر جھوٹے دعوے داروں کا راستہ ہمیشہ کے لیے بند کر دیا ہے۔"
              ],
              "english": [
                "If property were granted based on mere claims, looting would become rampant in society.",
                "Envious people would file false cases against the lives and assets of the righteous and wealthy.",
                "By mandating 'clear proof', Sharia has permanently blocked the path for false claimants."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل کا استحکام",
              "english": "Stability of Justice"
            },
            "content": {
              "urdu": [
                "یہ حدیث عدالتی نظام میں استحکام پیدا کرتی ہے تاکہ کوئی کسی پر ناحق الزام نہ لگائے۔",
                "قاضی کے لیے یہ ایک واضح گائیڈ لائن ہے کہ وہ کس سے ثبوت مانگے اور کس سے قسم۔",
                "اس سے فیصلوں میں شفافیت آتی ہے اور ظالم کی سرکوبی ممکن ہوتی ہے۔"
              ],
              "english": [
                "This Hadith stabilizes the judicial system so that no one unjustly accuses another.",
                "It provides a clear guideline for the judge on from whom to demand proof and from whom an oath.",
                "This brings transparency to verdicts and makes it possible to suppress the oppressor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی باریکیاں",
        "english": "Legal and Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مدعی اور مدعا علیہ کی تعریف",
              "english": "Defining Plaintiff and Defendant"
            },
            "content": {
              "urdu": [
                "مدعی وہ ہے جو کسی ایسی چیز کا مطالبہ کرے جو ظاہر کے خلاف ہو۔",
                "مدعا علیہ وہ ہے جو اصل حالت (براءتِ ذمہ) پر قائم ہو اور دعویٰ کا انکار کرے۔",
                "ان دونوں کی صحیح پہچان ہی عدالتی کارروائی کو درست سمت میں چلاتی ہے۔"
              ],
              "english": [
                "The claimant is one who demands something that goes against the apparent state of affairs.",
                "The defendant is one who stands by the original state (innocence) and denies the claim.",
                "Correct identification of both is essential for conducting judicial proceedings properly."
              ]
            }
          },
          {
            "title": {
              "urdu": "قسم کی اہمیت",
              "english": "Significance of the Oath"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں اللہ کی قسم کو ایک بہت بڑا قانونی ثبوت مانا گیا ہے۔",
                "ایک مسلمان سے یہ توقع کی جاتی ہے کہ وہ جھوٹی قسم کھا کر اپنی آخرت تباہ نہیں کرے گا۔",
                "اگر کوئی جھوٹی قسم کھاتا ہے تو دنیاوی طور پر بچنے کے باوجود آخرت میں سخت عذاب کا مستحق ہے۔"
              ],
              "english": [
                "In Islamic law, an oath by Allah is considered a major piece of legal evidence.",
                "A Muslim is expected not to ruin their Hereafter by taking a false oath.",
                "If someone takes a false oath, they deserve severe punishment in the afterlife despite escaping in this world."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہدات کی لکھائی",
              "english": "Documentation of Contracts"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ سبق ملتا ہے کہ ہمیں اپنے مالی معاملات کو تحریری شکل میں لانا چاہیے۔",
                "تحریری ثبوت ہونے کی صورت میں مدعی کو 'البینہ' پیش کرنے میں آسانی رہتی ہے۔",
                "قرآن مجید نے بھی قرض اور تجارت کے معاملات کو لکھنے کی پرزور تاکید فرمائی ہے۔"
              ],
              "english": [
                "This Hadith teaches us that we should put our financial dealings into writing.",
                "Having written proof makes it easier for the claimant to present 'clear evidence'.",
                "The Holy Quran also strongly emphasizes documenting debt and trade transactions."
              ]
            }
          },
          {
            "title": {
              "urdu": "الزام تراشی سے بچنا",
              "english": "Avoiding Accusations"
            },
            "content": {
              "urdu": [
                "بغیر ثبوت کسی پر الزام لگانا اسلامی اخلاقیات کے سراسر منافی ہے۔",
                "سچا مومن وہی ہے جو اپنی زبان سے کسی کی آبرو یا مال پر حملہ نہ کرے۔",
                "معاشرے میں افواہوں اور جھوٹے دعوؤں سے بچنا ہی ایمانی تقاضا ہے۔"
              ],
              "english": [
                "Accusing someone without proof is entirely contrary to Islamic ethics.",
                "A true believer is one who does not attack someone's honor or property with their tongue.",
                "Avoiding rumors and false claims in society is a requirement of faith."
              ]
            }
          }
        ]
      }
    }
  ]
}