{
  "hadithId": 430,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/6", "muslim/920", "riyadussalihin/7/22"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (920).",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح (920) میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Muslim (920)."
  },
  "importantWords": [
    {
      "arabic": "شُقَّ بَصَرُهُ",
      "english": "His eyes were fixedly open",
      "urdu": "اس کی آنکھیں کھلی رہ گئیں"
    },
    {
      "arabic": "أَغْمَضَهُ",
      "english": "He closed them",
      "urdu": "آپ ﷺ نے انہیں بند کر دیا"
    },
    {
      "arabic": "قُبِضَ",
      "english": "Is taken / Is seized",
      "urdu": "قبض کی جاتی ہے"
    },
    {
      "arabic": "فَضَجَّ",
      "english": "Cried out / wailed",
      "urdu": "وہ چیخنے لگے / شور مچایا"
    },
    {
      "arabic": "تُؤَمِّنُ",
      "english": "Say Amen",
      "urdu": "آمین کہتی ہیں"
    },
    {
      "arabic": "اخْلُفْهُ",
      "english": "Be his successor",
      "urdu": "اس کا نائب بن جا"
    }
  ],
  "summary": {
    "urdu": "موت کے وقت میت کی آنکھیں بند کرنا سنت ہے اور غم کی گھڑی میں زبان سے صرف کلماتِ خیر ادا کرنے چاہئیں کیونکہ فرشتے ان پر آمین کہتے ہیں۔",
    "english": "It is Sunnah to close the eyes of the deceased and to utter only good words during bereavement, as angels say 'Amen' to the supplications made at that time."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الجنائز، رقم 920",
      "english": "Sahih Muslim, The Book of Prayer - Funerals, Hadith 920"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة هند بنت أبي أمية",
        "english": "Umm Salama Hind bint Abi Umayya"
      },
      "slug": "umm-salama"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R6u_D8WvTGo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "موت کے فوری بعد کے آداب",
        "english": "Etiquettes Immediately After Death"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میت کی آنکھیں بند کرنا",
              "english": "Closing the Eyes of the Deceased"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے وفات کے بعد ابوسلمہ رض کی آنکھیں بند کیں جو کہ ایک مسنون عمل ہے۔",
                "وفات کے وقت نظر روح کا پیچھا کرتی ہے جس کی وجہ سے آنکھیں کھلی رہ جاتی ہیں۔",
                "میت کی آنکھوں کو بند کرنا اس کی حرمت اور ظاہری وضع قطع کو بہتر رکھنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) closed Abu Salama's eyes after his death, establishing this as a Sunnah.",
                "At the time of death, the gaze follows the soul, often leaving the eyes open.",
                "Closing the eyes is necessary to maintain the dignity and appearance of the deceased."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرشتوں کی موجودگی اور آمین",
              "english": "Presence of Angels and Their 'Amen'"
            },
            "content": {
              "urdu": [
                "موت کے وقت فرشتے حاضر ہوتے ہیں اور وہاں کہی جانے والی باتوں پر آمین کہتے ہیں۔",
                "اس نازک وقت میں آہ و بکا اور الٹے سیدھے کلمات کہنے سے سختی سے بچنا چاہیے۔",
                "انسان کو چاہیے کہ وہ اس وقت اپنے اور میت کے لیے صرف رحمت کی دعا کرے۔"
              ],
              "english": [
                "Angels are present at the time of death and say 'Amen' to the words spoken.",
                "One must strictly avoid wailing or uttering improper words during this sensitive time.",
                "A person should only offer prayers of mercy for themselves and the deceased."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "میت کے لیے جامع دعائیں",
        "english": "Comprehensive Prayers for the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغفرت اور بلندیِ درجات",
              "english": "Forgiveness and Elevation of Status"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے ابوسلمہ رض کے لیے ہدایت یافتہ لوگوں میں بلند درجے کی دعا فرمائی۔",
                "میت کے لیے مغفرت کی دعا اس کے برزخی سفر کا بہترین تحفہ ہے۔",
                "یہ دعا ظاہر کرتی ہے کہ وفات کے بعد میت کے درجات میں اضافے کی گنجائش رہتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) prayed for Abu Salama to have a high rank among the guided.",
                "Praying for the forgiveness of the deceased is the best gift for their journey in Barzakh.",
                "This supplication shows that there is always room for the elevation of the deceased's status."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبر میں وسعت اور روشنی",
              "english": "Expansiveness and Light in the Grave"
            },
            "content": {
              "urdu": [
                "قبر کی تنگی اور اندھیرے سے نجات کے لیے اللہ سے وسعت اور نور مانگنا چاہیے۔",
                "آپ ﷺ کی دعا 'افسح له في قبره' قبر کی وحشت کو ختم کرنے کا ذریعہ ہے۔",
                "مومن کی قبر کو اس کے نیک اعمال اور دعاؤں کی بدولت جنت کا باغ بنا دیا جاتا ہے۔"
              ],
              "english": [
                "One should ask Allah for space and light to find relief from the grave's narrowness and darkness.",
                "The Prophet’s prayer for an expanded grave is a means to remove the terrors of the grave.",
                "A believer's grave is turned into a garden of Paradise through good deeds and prayers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پسماندگان کی کفالت اور تسلی",
        "english": "Succession and Comfort for the Family"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ خانہ کے لیے خیر کی دعا",
              "english": "Praying for the Family's Welfare"
            },
            "content": {
              "urdu": [
                "میت کے بعد اس کے پیچھے رہ جانے والے اہل و عیال کے لیے اللہ کو نگران بنانا چاہیے۔",
                "آپ ﷺ نے ابوسلمہ رض کے بچوں اور بیوہ کے لیے بہترین نعم البدل کی دعا کی۔",
                "یہ دعا اس بات کا سبق دیتی ہے کہ اسلام پسماندگان کی مادی اور روحانی کفالت پر زور دیتا ہے۔"
              ],
              "english": [
                "One should ask Allah to be the guardian of the family left behind by the deceased.",
                "The Prophet (ﷺ) prayed for a better successor for Abu Salama’s children and widow.",
                "This prayer teaches that Islam emphasizes the material and spiritual welfare of survivors."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبرِ جمیل کی تلقین",
              "english": "Exhorting to Beautiful Patience"
            },
            "content": {
              "urdu": [
                "گھر والوں کا چیخنا چلانا سنت کے خلاف ہے، اس کے بجائے صبر کی تلقین کرنی چاہیے۔",
                "مایوسی کے کلمات فرشتوں کی آمین کی وجہ سے انسان کے لیے نقصان دہ ہو سکتے ہیں۔",
                "اسلامی تعلیمات ہمیں غم کے وقت جذبات کو قابو میں رکھنے کا فن سکھاتی ہیں۔"
              ],
              "english": [
                "The family's wailing is contrary to the Sunnah; instead, patience should be encouraged.",
                "Words of despair can be harmful to a person due to the 'Amen' of the angels.",
                "Islamic teachings teach us the art of controlling emotions during times of grief."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمانی اور تربیتی سبق",
        "english": "Faith and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقیتِ موت کی پہچان",
              "english": "Recognizing the Reality of Death"
            },
            "content": {
              "urdu": [
                "روح کا قبض ہونا ایک اٹل حقیقت ہے جسے دیکھ کر انسان کی آنکھیں دنگ رہ جاتی ہیں۔",
                "یہ حدیث ہمیں عالمِ غیب اور روح کے سفر کے بارے میں مستند معلومات فراہم کرتی ہے۔",
                "موت کا مشاہدہ انسان کو اپنی زندگی کے مقصد پر غور کرنے کی دعوت دیتا ہے۔"
              ],
              "english": [
                "The seizing of the soul is an absolute reality that leaves the human eye amazed.",
                "This Hadith provides authentic information about the unseen world and the soul's journey.",
                "Witnessing death invites a person to reflect on the purpose of their own life."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی شفقت",
              "english": "The Compassion of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ اپنے صحابہ کی وفات پر ان کے گھر تشریف لے جاتے اور ان کی غمخواری کرتے۔",
                "آپ ﷺ کا ابوسلمہ رض کے لیے خود دعا کرنا ان کے ساتھ گہری محبت کا ثبوت ہے۔",
                "ایک لیڈر اور نبی کے طور پر آپ ﷺ نے مصیبت زدہ خاندان کی بہترین رہنمائی فرمائی۔"
              ],
              "english": [
                "The Prophet (ﷺ) would visit his companions' homes upon their death and offer solace.",
                "The Prophet's personal prayer for Abu Salama is proof of his deep love for him.",
                "As a leader and Prophet, he provided the best guidance to the afflicted family."
              ]
            }
          }
        ]
      }
    }
  ]
}