{
  "hadithId": 111,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["Daruqutni 753"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب التيمم (Tayamum)",
    "babId": 9
  },

  "takhreej": {
    "arabic": "موقوف صحيح (حكمه الرفع). رواه الدارقطني (753) . قال ابن حجر في التلخيص: 'والصحيح وقفه على ابن عمر'",
    "urdu": "صحیح موقوف (صرف صحابی کا قول)؛ تاہم اس کا حکم مرفوع (نبی کا قول) ہے۔ اسے دارقطنی (753) نے روایت کیا ہے۔ ابن حجرؒ نے 'التلخیص' میں کہا: 'اور صحیح یہ ہے کہ یہ ابن عمر رضی اللہ عنہما کا قول ہے۔'",
    "english": "Sahih Mauquf (Authentic statement of the Companion, but carries the ruling of Marfu' - Prophet's statement in practice). Reported by Ad-Daraqutni (753). Ibn Hajar in 'At-Talkhis' stated: 'The correct view is that it is stopped (Mauquf) at Ibn 'Umar.'"
  },
  "importantWords": [
    {
      "arabic": "اَلتَّيَمُّمُ",
      "english": "Tayammum (Dry Ablution)",
      "urdu": "تیمم"
    },
    {
      "arabic": "ضَرْبَتَانِ",
      "english": "Two strikes",
      "urdu": "دو ضربیں"
    },
    {
      "arabic": "لِلْوَجْهِ",
      "english": "For the face",
      "urdu": "چہرے کے لیے"
    },
    {
      "arabic": "لِلْيَدَيْنِ",
      "english": "For the two hands",
      "urdu": "دونوں ہاتھوں کے لیے"
    },
    {
      "arabic": "اَلْمِرْفَقَيْنِ",
      "english": "The two elbows",
      "urdu": "کہنیوں تک"
    },
    {
      "arabic": "رَوَاهُ",
      "english": "Reported it",
      "urdu": "اسے روایت کیا"
    },
    {
      "arabic": "وَقْفَه",
      "english": "Its being Mauquf (stopped)",
      "urdu": "موقوف ہونا"
    },
    {
      "arabic": "اَلْأَئِمَّةُ",
      "english": "The Imams (Scholars)",
      "urdu": "ائمہ"
    }
  ],
  "summary": {
    "urdu": "یہ روایت تیمم کے طریقے میں ایک مختلف فقہی رائے کی وضاحت کرتی ہے، جس میں کہنیوں تک مسح کرنے اور اس کے لیے دو مرتبہ مٹی پر ہاتھ مارنے کا ذکر ہے، جو کہ بعض علماء کے نزدیک ابن عمر رضی اللہ عنہما کا قول ہے۔",
    "english": "This narration clarifies a differing juristic opinion regarding the method of Tayammum, stating that it involves two strikes on the earth and requires wiping the hands up to the elbows, a view held by some scholars to be the statement of Ibn 'Umar (RA)."
  },
  "references": [
    {
      "arabic": "رواه الدارقطني (753)",
      "english": "Reported by Ad-Daraqutni (753)"
    },
    {
      "arabic": "صححه الأئمة وقفه",
      "english": "Authenticated by the Imams as Mauquf"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin 'Umar bin Al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=hadith_tayammum_111",
  "grade": {
    "arabic": "موقوف صحيح",
    "english": "Authentic Mauquf (Suspended)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تیمم میں فقہی اختلاف",
        "english": "Juristic Disagreement in Tayammum"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دو ضربوں کا اصول",
              "english": "The Principle of Two Strikes"
            },
            "content": {
              "urdu": [
                "یہ روایت تیمم کے لیے دو ضربوں (مٹی پر دو مرتبہ ہاتھ مارنے) کو بنیادی اصول قرار دیتی ہے۔",
                "ایک ضرب چہرے کے لیے اور دوسری ضرب کہنیوں سمیت دونوں ہاتھوں پر مسح کرنے کے لیے تجویز کی گئی ہے۔",
                "یہ طریقہ امام شافعی اور امام احمد بن حنبل رحمہم اللہ کے ہاں تیمم کے مشہور طریقوں میں شامل ہے۔"
              ],
              "english": [
                "This narration establishes the principle of two strikes (Dharbatan) on the earth as the basis for performing Tayammum.",
                "It suggests one strike for wiping the face and a second strike for wiping both hands up to and including the elbows.",
                "This methodology is commonly adopted as the preferred method in the Shafi'i and Hanbali schools of jurisprudence."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہاتھوں پر مسح کی حد",
              "english": "The Limit of Wiping the Hands"
            },
            "content": {
              "urdu": [
                "اس روایت میں تیمم کے دوران ہاتھوں پر مسح کی حد کہنیوں (مرفقین) تک مقرر کی گئی ہے۔",
                "یہ حد وضو کے مسح کی حد کے مماثل ہے، جو قیاس کے ذریعے تیمم پر لاگو کی جاتی ہے۔",
                "جبکہ سیدنا عمار بن یاسر رضی اللہ عنہ کی صحیح مرفوع حدیث میں صرف ہتھیلیوں تک مسح کرنے کا ذکر ہے۔"
              ],
              "english": [
                "The narration specifies that the wiping of the hands during Tayammum must extend up to the elbows (mirfaqayn).",
                "This limit is analogous to the washing requirement in Wudu', which is applied to Tayammum via analogical deduction (Qiyas).",
                "However, the authentic Marfu' Hadith of 'Ammar bin Yasir (RA) clearly indicates wiping only the face and palms."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "درجہ حدیث اور استدلال",
        "english": "Hadith Grading and Derivation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موقوف بمقابلہ مرفوع",
              "english": "Mauquf vs. Marfu'"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ روایت مرفوع (نبی صلی اللہ علیہ وسلم کے قول) کے طور پر بھی نقل ہوئی، لیکن محدثین نے اسے موقوف (ابن عمر کا قول) قرار دیا۔",
                "جب موقوف روایت، مرفوع روایت کے خلاف ہو تو مرفوع روایت کو ترجیح دی جاتی ہے، جیسا کہ عمار بن یاسر رضی اللہ عنہ کی حدیث ہے۔",
                "لہٰذا، صحیح فقہی رائے یہی ہے کہ تیمم میں ایک ہی ضرب اور صرف چہرے و ہتھیلیوں پر مسح کافی ہے۔"
              ],
              "english": [
                "Although this narration was transmitted as Marfu' (Prophet's statement), the Hadith specialists judged it to be Mauquf (Ibn 'Umar's statement).",
                "When a Mauquf narration contradicts a Marfu' narration, the Marfu' (Prophet's statement), like the Hadith of 'Ammar bin Yasir, is prioritized.",
                "Therefore, the strongest juristic opinion holds that one strike and wiping only the face and palms is sufficient for Tayammum."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام بخاری کا موقف",
              "english": "The Stance of Imam Al-Bukhari"
            },
            "content": {
              "urdu": [
                "امام بخاری نے اپنی 'صحیح' میں عمار بن یاسر رضی اللہ عنہ کی روایت کو ترجیح دی، جس میں ایک ضرب کا ذکر ہے۔",
                "اس سے ظاہر ہوتا ہے کہ امام بخاری کے نزدیک یہ موقوف روایت تیمم کے مستند طریقۂ کار کے لیے قابل استدلال نہیں ہے۔",
                "زیادہ تر محدثین نے اس روایت کے ضعیف ہونے یا موقوف ہونے پر اتفاق کیا ہے۔"
              ],
              "english": [
                "Imam Al-Bukhari prioritized the narration of 'Ammar bin Yasir (RA) in his 'Sahih', which details the single-strike method.",
                "This indicates that in Imam Al-Bukhari's view, this Mauquf narration is not sufficient evidence for the definitive method of Tayammum.",
                "The majority of Hadith critics agreed on the weakness (or Mauquf status) of this two-strike narration attributed to the Prophet (PBUH)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی مسائل",
        "english": "Practical Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسانی کی تلاش",
              "english": "Seeking Ease"
            },
            "content": {
              "urdu": [
                "عمار بن یاسر کی صحیح حدیث پر عمل کرنا زیادہ آسان ہے، جس میں تیمم کا طریقہ نہایت مختصر اور سادہ ہے۔",
                "شریعت نے طہارت میں مشقت نہیں رکھی، لہٰذا آسان اور صحیح ثابت شدہ طریقے پر عمل کرنا چاہیے۔",
                "مسلمان کو دو ضربوں اور کہنیوں تک مسح کرنے کے اختلاف کی صورت میں ایک ضرب کے صحیح طریقے کو اختیار کرنا چاہیے۔"
              ],
              "english": [
                "Following the authentic Hadith of 'Ammar bin Yasir is easier, as it prescribes a very concise and simple method for Tayammum.",
                "The Shariah avoids hardship in purification, so one should adopt the easiest and authentically established method.",
                "In case of disagreement regarding two strikes versus one, and wiping up to the elbows versus wrists, a Muslim should follow the authentic single-strike method."
              ]
            }
          },
          {
            "title": {
              "urdu": "تیمم کے اجزاء",
              "english": "Components of Tayammum"
            },
            "content": {
              "urdu": [
                "قرآن اور سنت کی روشنی میں تیمم کے بنیادی اجزاء صرف چہرہ اور ہاتھ ہیں، وضو کے دیگر اعضاء نہیں۔",
                "دو ضربوں والی روایت پر عمل کرنے والوں کے لیے یہ اجزاء زیادہ ہیں، مگر قرآن کی آیت مطلق ہے۔",
                "تیمم چہرے کو چھوئے بغیر یا ہاتھوں کو زمین پر مارے بغیر صحیح نہیں ہوتا۔"
              ],
              "english": [
                "In light of the Qur'an and Sunnah, the basic components of Tayammum are only the face and the hands, excluding other Wudu' parts.",
                "Those following the two-strike narration include more components, but the Qur'anic verse is general (Mutlaq).",
                "Tayammum is not valid without wiping the face and striking the earth with the hands."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور اخلاقی پہلو",
        "english": "Educational and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ائمہ کا مقام",
              "english": "The Status of the Imams"
            },
            "content": {
              "urdu": [
                "اس حدیث سے معلوم ہوتا ہے کہ محدثین اور ائمہ صحیح اور ضعیف روایت کی تمیز اور درجہ بندی میں کتنے محتاط تھے۔",
                "ابن عمر رضی اللہ عنہما کا یہ قول اگرچہ صحیح موقوف ہے، لیکن اس کی نقل حدیث کے طور پر ہوئی، جو ایک اہم علمی نکتہ ہے۔",
                "یہ ان کے علم اور فقہی بصیرت کو بھی ظاہر کرتا ہے کہ وہ قرآن کے حکم اور قیاس سے استدلال کرتے تھے۔"
              ],
              "english": [
                "This Hadith shows how meticulous the scholars and Imams were in distinguishing and grading authentic and weak narrations.",
                "Ibn 'Umar's statement, though authentically his own, was transmitted as a Prophetic Hadith, which is a crucial point of scholarly distinction.",
                "It also demonstrates his jurisprudential insight in deriving rulings based on the Qur'anic command and analogical deduction (Qiyas)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختلاف کا احترام",
              "english": "Respect for Disagreement"
            },
            "content": {
              "urdu": [
                "فقہی اختلافات کے باوجود ایک دوسرے کے ساتھ احترام اور محبت کا رویہ رکھنا ضروری ہے۔",
                "ہر فقیہ نے اپنی رائے صحیح دلائل پر مبنی سمجھی، اگرچہ صحیح ترین سنت ایک ہی ہو سکتی ہے۔",
                "مسلمانوں کو علمی دلائل کو سمجھنے اور بہترین رائے پر عمل کرنے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "It is essential to maintain a relationship of respect and affection toward each other despite jurisprudential disagreements.",
                "Every jurist based their opinion on what they believed to be authentic evidence, even though the most authentic Sunnah might be one specific method.",
                "Muslims should strive to understand the scholarly evidence and follow the opinion supported by the strongest authentic proofs."
              ]
            }
          }
        ]
      }
    }
  ]
}
