{
  "hadithId": 1312,
  "hadithNo": 36,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/82"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "الجامع - باب الترهيب من مساوئ الأخلاق",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "ضعيف جداً أو موضوع. رواه الحارث بن أبي أسامة في مسنده (بغية الباحث: 1011)، والبيهقي في الشعاب (6344). في سنده عنبسة بن عبد الرحمن، وهو متروك ومتهم بالوضع. قال الحافظ في التلخيص (4/195): إسناده ضعيف.",
    "urdu": "یہ روایت سخت ضعیف یا موضوع ہے۔ اس کی سند میں عنبسہ بن عبدالرحمن ہے جو متروک اور حدیث گھڑنے میں متہم ہے۔ حافظ ابن حجر نے تلخیص میں اسے ضعیف قرار دیا ہے۔ تاہم، سلف صالحین کے اقوال سے اس کا مفہوم ثابت ہے کہ غیبت کے بعد دعا اور استغفار کرنا چاہیے۔",
    "english": "Very weak or fabricated. Reported by Al-Harith bin Abi Usamah and Al-Bayhaqi. The chain includes 'Anbasah bin 'Abd al-Rahman, who is rejected (matruk) and accused of fabricating hadiths. Al-Hafiz Ibn Hajar stated the chain is weak."
  },
  "importantWords": [
    {
      "arabic": "كَفَّارَةٌ",
      "english": "Atonement / Expiation",
      "urdu": "کفارہ / گناہ مٹانے والا عمل"
    },
    {
      "arabic": "اِغْتَبْتَهُ",
      "english": "You backbited him",
      "urdu": "تم نے اس کی غیبت کی"
    },
    {
      "arabic": "تَسْتَغْفِرَ لَهُ",
      "english": "You seek forgiveness for him",
      "urdu": "تم اس کے لیے مغفرت طلب کرو"
    }
  ],
  "summary": {
    "urdu": "اگرچہ یہ حدیث سنداً ضعیف ہے، مگر اس کا اخلاقی پیغام یہ ہے کہ اگر کسی کی غیبت ہو جائے تو اللہ سے توبہ کے ساتھ ساتھ اس شخص کے لیے دعا کرنا بھی ایک مستحسن عمل ہے تاکہ پہنچنے والے نقصان کی تلافی ہو سکے۔",
    "english": "Though the narration is technically weak, its moral lesson suggests that if one commits backbiting, they should repent to Allah and supplicate for the victim's forgiveness to mend the spiritual harm caused."
  },
  "references": [
    {
      "arabic": "مسند الحارث (زوائد الهيثمي)، رقم 1011",
      "english": "Musnad al-Harith (Zawa'id al-Haythami), No. 1011"
    },
    {
      "arabic": "شعب الإيمان للبيهقي، رقم 6344",
      "english": "Shu'ab al-Iman by Al-Bayhaqi, No. 6344"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیبت کی سنگینی اور توبہ کا طریقہ",
        "english": "The Gravity of Backbiting and Method of Repentance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیبت کا شرعی مفہوم",
              "english": "Sharia Concept of Backbiting"
            },
            "content": {
              "urdu": [
                "غیبت سے مراد کسی کی عدم موجودگی میں ایسی بات کرنا ہے جو اسے ناگوار گزرے۔",
                "قرآن میں اسے اپنے مردہ بھائی کا گوشت کھانے کے مترادف قرار دیا گیا ہے۔",
                "یہ حقوق العباد میں سے ہے، اس لیے اس کی معافی کے لیے توبہ کے ساتھ ساتھ متاثرہ شخص سے معاملہ درست کرنا ضروری ہے۔"
              ],
              "english": [
                "Backbiting means mentioning something about a person in their absence that they would dislike.",
                "The Quran equates it to eating the flesh of one's dead brother.",
                "Since it concerns human rights, repentance requires both seeking Allah's forgiveness and rectifying the matter with the victim."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کفارے کی مختلف صورتیں",
        "english": "Forms of Atonement"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استغفار اور دعا",
              "english": "Istighfar and Supplication"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک اگر اس شخص کو غیبت کی خبر نہ پہنچی ہو تو اس کے سامنے ذکر کرنا فتنہ پیدا کر سکتا ہے۔",
                "ایسی صورت میں اس کے لیے کثرت سے دعا کرنا اور اللہ سے اس کی مغفرت مانگنا ہی کفارہ ہے۔",
                "اس حدیث کا مفہوم اسی تلافی کی طرف اشارہ کرتا ہے۔"
              ],
              "english": [
                "Jurists state that if the victim is unaware of the backbiting, informing them might cause further strife.",
                "In such cases, supplicating for them and seeking Allah's mercy on their behalf is the best atonement.",
                "The essence of this Hadith points toward this method of spiritual compensation."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوبیوں کا تذکرہ",
              "english": "Mentioning Their Virtues"
            },
            "content": {
              "urdu": [
                "جس محفل میں برائی کی گئی تھی، وہیں اس شخص کی خوبیوں کا تذکرہ کرنا بھی تلافی کا ایک طریقہ ہے۔",
                "یہ عمل اس منفی اثر کو زائل کرتا ہے جو غیبت کی وجہ سے پیدا ہوا تھا۔",
                "سچی توبہ وہی ہے جو انسان کے طرزِ عمل کو بدل دے۔"
              ],
              "english": [
                "Another way to atone is to mention the person's virtues in the same gathering where they were slandered.",
                "This act negates the negative impact created by the backbiting.",
                "True repentance is that which transforms a person's behavior."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی حیثیت اور فقہی موقف",
        "english": "Chain Status and Juristic Stance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محدثین کی تحقیق",
              "english": "Scholarly Research"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ الفاظ نبی ﷺ سے صحیح سند سے ثابت نہیں، لیکن بہت سے سلف سے یہی عمل منقول ہے۔",
                "امام ابن تیمیہ اور دیگر محققین کے نزدیک متاثرہ شخص کو بتانا ضروری نہیں اگر اس سے دشمنی بڑھنے کا خطرہ ہو۔",
                "اللہ تعالیٰ غیبت کرنے والے کی توبہ اور اس کی خیر خواہی (دعا) کی وجہ سے دوسرے فریق کو قیامت کے دن راضی کر دے گا۔"
              ],
              "english": [
                "While these specific words are not authentically proven from the Prophet (ﷺ), this practice is narrated from many early scholars.",
                "According to Ibn Taymiyyah and others, informing the victim is not mandatory if it risks increasing enmity.",
                "Allah may satisfy the victim on the Day of Judgment due to the backbiter's sincere repentance and prayers for them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی سبق",
        "english": "Moral Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "بہترین راستہ یہ ہے کہ شروع سے ہی اپنی زبان کو دوسروں کی عیب جوئی سے پاک رکھا جائے۔",
                "اگر غلطی ہو جائے تو فوری نیکی (دعا و استغفار) سے اس برائی کو مٹانے کی کوشش کرنی چاہیے۔",
                "دوسروں کے لیے خیر مانگنا انسان کے اپنے دل سے کینہ اور بغض ختم کرنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "The best path is to safeguard the tongue from seeking faults in others from the outset.",
                "If a slip occurs, one should immediately follow it with a good deed (prayer and seeking forgiveness).",
                "Wishing well for others helps eradicate malice and resentment from one's own heart."
              ]
            }
          }
        ]
      }
    }
  ]
}