{
  "hadithId": 954,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/954"
    ],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
 
  "takhreej": {
    "arabic": "ضعيف.‏ رواه أحمد (403)‏، وأبو داود (2308)‏، وابن ماجه (2083)‏ من طريق قبيصة بن ذؤيب عن عمرو بن العاص. وعلته انقطاع بين قبيصة وعمرو، والصحيح أنها تعتد بحيضة واحدة للاستبراء كما هو مذهب الجمهور.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے احمد، ابوداؤد (2308) اور ابن ماجہ نے قبیصہ بن ذویب کے واسطے سے روایت کیا ہے۔ امام دارقطنی نے صراحت کی ہے کہ قبیصہ کا عمرو بن العاص سے سماع نہیں ہے، لہذا یہ روایت منقطع ہے۔",
    "english": "Weak. Reported by Ahmad (403), Abu Dawud (2308), and Ibn Majah (2083). The defect is the disconnection between Qabisa bin Dhu'ayb and 'Amr bin al-'As. The majority of scholars hold that her Iddah is only one menstrual cycle."
  },
  "importantWords": [
    {
      "arabic": "لَا تُلْبِسُوا",
      "english": "Do not confuse / obscure",
      "urdu": "خلط ملط نہ کرو / مشتبہ نہ بناؤ"
    },
    {
      "arabic": "أُمِّ اَلْوَلَدِ",
      "english": "Mother of the child (slave)",
      "urdu": "ام ولد (وہ لونڈی جس کے بطن سے مالک کا بچہ ہو)"
    },
    {
      "arabic": "تُوُفِّيَ",
      "english": "Passed away / Died",
      "urdu": "فوت ہو گیا"
    },
    {
      "arabic": "سَيِّدُهَا",
      "english": "Her master",
      "urdu": "اس کا آقا / سردار"
    },
    {
      "arabic": "عِدَّةُ",
      "english": "Waiting period",
      "urdu": "عدت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ام ولد (وہ لونڈی جس سے مالک کی اولاد ہو) کی عدت وفات کو آزاد عورت کی طرح چار ماہ دس دن بیان کیا گیا ہے، اگرچہ یہ روایت سنداً ضعیف ہے۔",
    "english": "This Hadith states that the Iddah for an Umm al-Walad after her master's death is four months and ten days, similar to a free woman, though the narration is weak."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2308)",
      "english": "Reported by Abu Dawud (2308)"
    },
    {
      "arabic": "رواه ابن ماجه (2083)",
      "english": "Reported by Ibn Majah (2083)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن العاص",
        "english": "Amr bin al-As"
      },
      "slug": "amr-bin-al-as"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9U0K07_z0U",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ام ولد کی شرعی حیثیت اور عدت",
        "english": "Status and Iddah of Umm al-Walad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ام ولد کی تعریف",
              "english": "Definition of Umm al-Walad"
            },
            "content": {
              "urdu": [
                "ام ولد وہ لونڈی ہے جس کے بطن سے اس کے مالک کا بچہ پیدا ہو۔",
                "ایسی لونڈی مالک کی وفات کے بعد خود بخود آزاد ہو جاتی ہے۔",
                "اسلام نے اسے ایک خاص مقام دے کر اس کی آزادی کی راہ ہموار کی ہے۔"
              ],
              "english": [
                "Umm al-Walad is a slave-woman who has borne a child for her master.",
                "She automatically gains freedom upon the death of her master in Islam.",
                "Islam granted her a special status to facilitate her eventual liberation."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدت کی مدت کا اختلاف",
              "english": "Difference in Iddah Duration"
            },
            "content": {
              "urdu": [
                "اس روایت کے مطابق اس کی عدت چار ماہ دس دن ہونی چاہیے۔",
                "اکثر فقہاء کے نزدیک اس کی عدت صرف ایک حیض (استبراء) ہے۔",
                "عدت کا مقصد صرف یہ اطمینان کرنا ہے کہ وہ حاملہ تو نہیں ہے۔"
              ],
              "english": [
                "According to this report, her Iddah should be four months and ten days.",
                "Most jurists hold that her waiting period is only one menstrual cycle.",
                "The primary purpose is to ensure that the womb is clear of pregnancy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت کی حفاظت اور انتباہ",
        "english": "Preserving the Sunnah and Warning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمرو بن العاصؓ کا سخت لہجہ",
              "english": "Stern Tone of Amr bin al-As"
            },
            "content": {
              "urdu": [
                "عمرو بن العاصؓ نے 'سنت کو خلط ملط نہ کرو' کہہ کر سختی دکھائی۔",
                "وہ اس بات پر زور دے رہے تھے کہ شرعی ضوابط میں تبدیلی نہ ہو۔",
                "صحابہ کرام سنتِ نبوی کے معاملے میں نہایت حساس اور چوکنا رہتے تھے۔"
              ],
              "english": [
                "Amr bin al-As (RA) was stern, saying 'do not confuse our Sunnah'.",
                "He was emphasizing that Shariah regulations should remain unadulterated.",
                "The companions were extremely sensitive and vigilant regarding the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "روایت کے معلول ہونے کی وجہ",
              "english": "Reason for the Narrative Defect"
            },
            "content": {
              "urdu": [
                "امام دارقطنی کے مطابق اس کے راوی قبیصہ نے عمرو بن العاص سے نہیں سنا۔",
                "انقطاعِ سند کی وجہ سے یہ روایت علمی طور پر کمزور سمجھی جاتی ہے۔",
                "محدثین نے سنت کی حفاظت کے لیے راویوں کے باہمی سماع کی باریک بینی سے جانچ کی۔"
              ],
              "english": [
                "Ad-Daraqutni stated that the narrator Qabisa did not hear from Amr.",
                "The disconnection in the chain makes this narration scholarly weak.",
                "Hadith experts scrutinize links between narrators to protect the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب اور دلائل",
        "english": "Juristic Schools and Arguments"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آزاد عورت سے مشابہت",
              "english": "Analogy with Free Women"
            },
            "content": {
              "urdu": [
                "بعض اہل علم اسے آزاد عورت پر قیاس کر کے چار ماہ دس دن کہتے ہیں۔",
                "ان کا استدلال یہ ہے کہ وہ ام ولد بننے کے بعد آزاد کے قریب ہے۔",
                "تاہم، صحیح روایات اور جمہور کا عمل اس قیاس کے خلاف ہے۔"
              ],
              "english": [
                "Some scholars use an analogy with free women for the long duration.",
                "They argue she is closer to a free status after bearing a child.",
                "However, authentic narrations and the majority's practice oppose this."
              ]
            }
          },
          {
            "title": {
              "urdu": "استبراءِ رحم کی اہمیت",
              "english": "Importance of Istibra"
            },
            "content": {
              "urdu": [
                "ام ولد کے معاملے میں اصل مقصد رحم کی صفائی کا اطمینان حاصل کرنا ہے۔",
                "اسی لیے ایک حیض گزار لینا ہی نسب کی حفاظت کے لیے کافی ہے۔",
                "شریعت میں غیر ضروری مشقت میں ڈالنے سے گریز کیا گیا ہے۔"
              ],
              "english": [
                "The core objective for an Umm al-Walad is ensuring a clear womb.",
                "Therefore, one cycle is sufficient to protect the child's lineage.",
                "Shariah avoids putting people through unnecessary hardships and delays."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی نکات",
        "english": "Educational and Practical Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی ضرورت",
              "english": "The Need for Verification"
            },
            "content": {
              "urdu": [
                "دینی معاملات میں سنی سنائی باتوں کے بجائے تحقیق کرنا ضروری ہے۔",
                "محدثین کی جرح و تعدیل ہمیں صحیح اور ضعیف میں فرق سکھاتی ہے۔",
                "صحیح علم ہی انسان کو اللہ کے راستے پر ثابت قدم رکھتا ہے۔"
              ],
              "english": [
                "Verification is essential in religious matters rather than mere hearsay.",
                "Criticism and appraisal by experts help us distinguish Sahih from Da'if.",
                "Authentic knowledge keeps a person steadfast on the path of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء کی رہنمائی",
              "english": "Guidance of Scholars"
            },
            "content": {
              "urdu": [
                "پیچیدہ فقہی مسائل میں جید علماء کے اقوال سے مدد لینی چاہیے۔",
                "روایات میں موجود تضاد کو صرف ماہرینِ فن ہی حل کر سکتے ہیں۔",
                "صحابہ کرام کا طرزِ عمل ہمارے لیے مشعلِ راہ اور مینارہ نور ہے۔"
              ],
              "english": [
                "One should seek help from eminent scholars in complex juristic issues.",
                "Only experts can resolve apparent contradictions found in narrations.",
                "The conduct of the companions is a guiding light and beacon for us."
              ]
            }
          }
        ]
      }
    }
  ]
}