{
  "hadithId": 890,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/80"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه أبو داود (2117)، والحاكم (2/181). وله شاهد من حديث عائشة رضي الله عنها عند أحمد والبيهقي بلفظ: 'أعظم النساء بركة أيسرهن مؤونة'.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام ابوداؤد (2117) اور حاکم (2/181) نے روایت کیا ہے۔ اس کی تائید سیدہ عائشہ رضی اللہ عنہا کی اس روایت سے بھی ہوتی ہے جس میں فرمایا گیا کہ سب سے زیادہ برکت والی عورت وہ ہے جس کے اخراجات سب سے کم ہوں۔",
    "english": "Sahih. Reported by Abu Dawud (2117) and Al-Hakim (2/181). It is supported by a narration from Aisha (RA) stating: 'The most blessed of women are those whose maintenance is easiest.'"
  },
  "importantWords": [
    {
      "arabic": "خَيْرُ",
      "english": "The best",
      "urdu": "بہترین"
    },
    {
      "arabic": "الصَّدَاقِ",
      "english": "Mahr / Dower",
      "urdu": "حق مہر"
    },
    {
      "arabic": "أَيْسَرُهُ",
      "english": "The easiest / Simplest",
      "urdu": "سب سے زیادہ آسان"
    }
  ],
  "summary": {
    "urdu": "اسلام مہر کی مقدار میں سادگی اور آسانی کی حوصلہ افزائی کرتا ہے تاکہ نکاح کا عمل معاشرے کے تمام طبقات کے لیے سہل ہو سکے اور برکت کا باعث بنے۔",
    "english": "Islam encourages simplicity and ease in the amount of Mahr to ensure that marriage remains accessible to all members of society and brings divine blessings."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب النكاح، رقم الحديث ٢١١٧",
      "english": "Sunan Abi Dawud, Book of Marriage, Hadith No. 2117"
    },
    {
      "arabic": "المستدرك للحاكم، كتاب النكاح، رقم الحديث ٢٧٤٢",
      "english": "Al-Mustadrak al-Hakim, Book of Marriage, Hadith No. 2742"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عقبة بن عامر الجهني",
        "english": "Uqba bin Amir al-Juhani"
      },
      "slug": "uqba-bin-amir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S-tS_V6X2Yw",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہر میں سادگی کی فضیلت",
        "english": "The Virtue of Simplicity in Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بہترین مہر کا معیار",
              "english": "Criteria for the Best Mahr"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے نزدیک مہر کی فضیلت اس کی کثرت میں نہیں بلکہ اس کی آسانی میں ہے۔",
                "آسان مہر سے مراد وہ مقدار ہے جسے مرد خوش دلی سے اور بغیر کسی مالی بوجھ کے ادا کر سکے۔",
                "سنت کے مطابق مہر طے کرنا نکاح میں برکت اور میاں بیوی کے درمیان الفت کا باعث بنتا ہے۔"
              ],
              "english": [
                "According to the Prophet (ﷺ), the virtue of Mahr lies in its ease, not its abundance.",
                "Easy Mahr refers to an amount the husband can pay willingly without undue financial strain.",
                "Setting the dower according to the Sunnah invites blessings and fosters love between spouses."
              ]
            }
          },
          {
            "title": {
              "urdu": "برکت کا سبب",
              "english": "A Source of Blessing"
            },
            "content": {
              "urdu": [
                "جس نکاح میں بوجھ کم ہوتا ہے، اس میں اللہ کی طرف سے سکون اور خیر زیادہ ہوتی ہے۔",
                "بھاری مہر بعض اوقات شوہر کے دل میں بیوی کے خلاف ناگواری یا قرض کا احساس پیدا کر دیتا ہے۔",
                "نبی ﷺ نے اپنی صاحبزادیوں اور ازواج کے لیے بھی اعتدال پسند مہر مقرر فرما کر نمونہ پیش کیا۔"
              ],
              "english": [
                "Marriages with fewer burdens are characterized by more tranquility and divine goodness.",
                "Excessive Mahr can sometimes create resentment or a feeling of heavy debt in the husband's heart.",
                "The Prophet (ﷺ) set a moderate standard for his own daughters and wives as an example."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد اور آسانی",
        "english": "Social Benefits and Ease"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کو عام کرنا",
              "english": "Facilitating Universal Marriage"
            },
            "content": {
              "urdu": [
                "مہر کو آسان بنانا معاشرے میں نکاح کو فروغ دینے اور بے حیائی کو روکنے کا بہترین راستہ ہے۔",
                "جب مہر اور شادی کے اخراجات بڑھ جاتے ہیں تو نوجوان شادی سے دور بھاگنے لگتے ہیں۔",
                "اسلام چاہتا ہے کہ حلال رشتہ قائم کرنا ہر مسلمان کے لیے ممکن ہو، خواہ وہ امیر ہو یا غریب۔"
              ],
              "english": [
                "Making Mahr easy is the best way to promote marriage and curb immorality in society.",
                "When Mahr and wedding expenses escalate, young people tend to delay or avoid marriage.",
                "Islam aims to make forming a lawful union possible for every Muslim, regardless of wealth."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظاہری نمود و نمائش کی نفی",
              "english": "Negating Superficial Display"
            },
            "content": {
              "urdu": [
                "مہر کو سماجی حیثیت کا پیمانہ بنانا جاہلانہ رسم ہے جس کی شریعت میں کوئی اصل نہیں ہے۔",
                "اعلیٰ خاندانوں کو چاہیے کہ وہ مہر میں سادگی اپنا کر غریبوں کے لیے مثال قائم کریں۔",
                "حق مہر عورت کا قانونی حق ہے، اسے خاندانی فخر کا ذریعہ نہیں بنانا چاہیے۔"
              ],
              "english": [
                "Using Mahr as a measure of social status is an ignorant custom with no basis in Shariah.",
                "Respected families should lead by example by choosing simplicity to help the needy.",
                "Mahr is a legal right of the woman; it should not be treated as a tool for family pride."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حدود اور وسعت",
        "english": "Juristic Limits and Scope"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کوئی حتمی حد مقرر نہیں",
              "english": "No Fixed Maximum Limit"
            },
            "content": {
              "urdu": [
                "شریعت نے مہر کی کوئی زیادہ سے زیادہ حد مقرر نہیں کی، یہ فریقین کی رضامندی پر منحصر ہے۔",
                "تاہم، حدیث میں 'خیر' (بہتری) کا لفظ استعمال کر کے اعتدال کی ترغیب دی گئی ہے۔",
                "اگر شوہر امیر ہو تو وہ زیادہ مہر دے سکتا ہے، لیکن بوجھ ڈالنے کی نیت نہیں ہونی چاہیے۔"
              ],
              "english": [
                "Shariah has not set a maximum limit for Mahr; it depends on mutual consent.",
                "However, the Hadith uses the word 'Khair' (best) to encourage moderation and ease.",
                "A wealthy husband may give more, provided it is not done to boast or create hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "فوری ادائیگی کی اہمیت",
              "english": "Importance of Prompt Payment"
            },
            "content": {
              "urdu": [
                "آسان مہر کا ایک مطلب یہ بھی ہے کہ وہ جلد اور آسانی سے ادا کیا جا سکے۔",
                "مہر کو صرف کاغذات کی حد تک لکھنا اور عملی طور پر ادا نہ کرنا سنت کے خلاف ہے۔",
                "اسلام مہر کی نقد ادائیگی کو ترجیح دیتا ہے تاکہ عورت کو اس کا حق فوری ملے۔"
              ],
              "english": [
                "Easy Mahr also implies an amount that can be paid promptly and without difficulty.",
                "Recording Mahr only on paper without intending to pay it is contrary to the Sunnah.",
                "Islam prefers prompt payment of Mahr so that the woman receives her right immediately."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "والدین کے لیے نصیحت",
              "english": "Advice for Parents"
            },
            "content": {
              "urdu": [
                "والدین کو چاہیے کہ وہ اپنی بیٹیوں کے لیے دیندار اور اچھے اخلاق والے شوہر تلاش کریں۔",
                "بھاری مہر کا مطالبہ کر کے اچھے رشتوں کو ہاتھ سے نہیں جانے دینا چاہیے۔",
                "بیٹی کی اصل خوشی سکون والے گھر میں ہے، نہ کہ تجوری میں جمع مہر کی رقم میں۔"
              ],
              "english": [
                "Parents should seek pious and well-mannered husbands for their daughters.",
                "They should not reject good proposals simply because of a desire for high Mahr.",
                "A daughter's true happiness lies in a peaceful home, not in a large sum of money in a safe."
              ]
            }
          },
          {
            "title": {
              "urdu": "نوجوانوں کی تربیت",
              "english": "Training of Youth"
            },
            "content": {
              "urdu": [
                "نوجوانوں کو چاہیے کہ وہ اپنی استطاعت کے مطابق سچائی کے ساتھ مہر پیش کریں۔",
                "نکاح کو ایک پاکیزہ عبادت سمجھیں اور اسے رسومات کا بوجھ نہ بنائیں۔",
                "اللہ کی رضا اور سنت کی اتباع میں ہی دنیا اور آخرت کی فلاح پوشیدہ ہے۔"
              ],
              "english": [
                "Young men should offer Mahr truthfully and according to their actual means.",
                "Treat marriage as a pure act of worship and not a burden of societal rituals.",
                "Success in this life and the next lies in seeking Allah's pleasure and following the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}