{
  "hadithId": 1093,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/14"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1817)، وأبو داود (2732)، والترمذي (1558)، وأحمد (24719). والقصة أن الرجل كان شجاعاً فأبى النبي صلى الله عليه وسلم حتى أسلم.",
    "urdu": "صحیح۔ اسے مسلم (1817) نے روایت کیا ہے۔ مکمل قصہ یہ ہے کہ وہ شخص بہت بہادر تھا، صحابہ اس کے آنے پر خوش ہوئے مگر آپ ﷺ نے اس کے اسلام لانے تک اسے ساتھ لینے سے انکار کر دیا، بالاخر اس نے اسلام قبول کر لیا۔",
    "english": "Sahih. Reported by Muslim (1817), Abu Dawud (2732), and At-Tirmidhi (1558). The full report mentions the man was known for his courage; the Prophet (ﷺ) refused his help twice until he finally embraced Islam."
  },
  "importantWords": [
    {
      "arabic": "تَبِعَهُ",
      "english": "Followed him",
      "urdu": "آپ کے پیچھے آیا"
    },
    {
      "arabic": "يَوْمَ بَدْرٍ",
      "english": "Day of Badr",
      "urdu": "بدر کا دن"
    },
    {
      "arabic": "ارْجِعْ",
      "english": "Go back",
      "urdu": "واپس لوٹ جا"
    },
    {
      "arabic": "أَسْتَعِينَ",
      "english": "Seek help",
      "urdu": "مدد طلب کروں"
    },
    {
      "arabic": "بِمُشْرِكٍ",
      "english": "From a polytheist",
      "urdu": "کسی مشرک سے"
    }
  ],
  "summary": {
    "urdu": "غزوہ بدر کے موقع پر نبی کریم ﷺ نے ایک مشرک شخص کی فوجی مدد لینے سے انکار فرما دیا اور اسے اسلام لانے کی شرط پر ساتھ شامل ہونے کی اجازت دی۔",
    "english": "On the occasion of Badr, the Prophet (ﷺ) refused military assistance from a polytheist, emphasizing that such help is only accepted from those who believe."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1817)",
      "english": "Narrated by Muslim (1817)"
    },
    {
      "arabic": "رواه أبو داود (2732)",
      "english": "Narrated by Abu Dawud (2732)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYmX7G6f48A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیر مسلم سے عسکری مدد کا حکم",
        "english": "Ruling on Military Aid from Non-Muslims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلامی فوج کا امتیاز",
              "english": "Distinction of the Islamic Army"
            },
            "content": {
              "urdu": [
                "اسلامی جہاد صرف زمین یا مال کے لیے نہیں بلکہ اللہ کے کلمے کی سربلندی کے لیے ہے۔",
                "نبی ﷺ نے ابتدا میں مشرک کی مدد سے انکار کر کے لشکر کے نظریاتی تشخص کو برقرار رکھا۔",
                "ایمان کے بغیر کی جانے والی قتال کی نیت خالص نہیں ہو سکتی۔"
              ],
              "english": [
                "Islamic Jihad is not for land or wealth but for the supremacy of Allah's Word.",
                "By initially refusing the polytheist, the Prophet (ﷺ) maintained the army's ideological identity.",
                "Combat without faith lacks the sincere intention required for divine reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "استثناء اور مصلحت",
              "english": "Exceptions and Public Interest"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک اگر ضرورت شدید ہو اور غیر مسلم قابلِ اعتماد ہو تو مدد لی جا سکتی ہے۔",
                "جیسے غزوہ حنین میں آپ ﷺ نے صفوان بن امیہ سے زرہیں مستعار لی تھیں۔",
                "تاہم، یہ فیصلہ حاکمِ وقت کی صوابدید اور مسلمانوں کے مفاد پر منحصر ہے۔"
              ],
              "english": [
                "Jurists state that if necessity is dire and the non-Muslim is trustworthy, aid can be sought.",
                "For example, at Hunayn, the Prophet (ﷺ) borrowed armor from Safwan bin Umayyah.",
                "However, this decision rests on the ruler's discretion and the collective interest of Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعوتِ دین کی حکمت",
        "english": "Wisdom in Dawah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دباؤ کے بغیر رغبت",
              "english": "Attraction Without Coercion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اس شخص کو ساتھ لینے کے بجائے پہلے ایمان لانے کی ترغیب دی۔",
                "آپ ﷺ کی ثابت قدمی دیکھ کر وہ شخص متاثر ہوا اور بالاخر مسلمان ہو گیا۔",
                "مقصد فوجی قوت بڑھانا نہیں بلکہ انسانوں کو جہنم سے بچانا تھا۔"
              ],
              "english": [
                "Instead of accepting military aid, the Prophet (ﷺ) first encouraged him towards faith.",
                "The man was moved by the Prophet's (ﷺ) firmness and eventually embraced Islam.",
                "The goal was not merely increasing military strength but saving souls from Hellfire."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصول پر سمجھوتہ نہ کرنا",
              "english": "No Compromise on Principles"
            },
            "content": {
              "urdu": [
                "بدر کے نازک موقع پر جب مسلمانوں کی تعداد کم تھی، تب بھی آپ ﷺ نے اصول کو مقدم رکھا۔",
                "یہ اس بات کی دلیل ہے کہ مادی وسائل سے زیادہ اللہ پر بھروسہ ضروری ہے۔",
                "حق کے معاملے میں دنیاوی فائدے کے لیے نظریات کا سودا نہیں کرنا چاہیے۔"
              ],
              "english": [
                "Even at the critical moment of Badr with few men, the Prophet (ﷺ) prioritized principle.",
                "This proves that reliance on Allah is far more important than material resources.",
                "Ideologies should not be traded for worldly gains in the path of truth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سیاسی پہلو",
        "english": "Juristic and Political Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مدد لینے کی شرائط",
              "english": "Conditions for Seeking Help"
            },
            "content": {
              "urdu": [
                "غیر مسلم سے مدد لینے کے لیے ضروری ہے کہ وہ مسلمانوں کا خیر خواہ ہو۔",
                "دوسری شرط یہ ہے کہ مسلمانوں کو ان پر عسکری غلبہ حاصل ہو تاکہ وہ دھوکہ نہ دے سکیں۔",
                "اگر اندیشہ ہو کہ وہ مسلمانوں کے راز دشمن کو دیں گے تو مدد لینا حرام ہے۔"
              ],
              "english": [
                "To seek help from non-Muslims, it is essential that they are well-wishers of Muslims.",
                "The second condition is that Muslims maintain military upper hand to prevent betrayal.",
                "If there is a fear they will leak secrets to the enemy, seeking their help is forbidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاکم کی اتھارٹی",
              "english": "Authority of the Ruler"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ جنگی پالیسی اور بھرتیاں صرف حاکم کے اختیار میں ہیں۔",
                "کوئی بھی انفرادی طور پر لشکر میں کسی کو شامل کرنے کا مجاز نہیں ہے۔",
                "فوجی نظم و ضبط اور امیر کی اطاعت اسلامی نظام کا حسن ہے۔"
              ],
              "english": [
                "This Hadith clarifies that military policy and recruitment are the ruler's sole authority.",
                "No individual is authorized to include anyone in the army on their own.",
                "Military discipline and obedience to the leader are the beauty of the Islamic system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ پر توکل کا ثمر",
              "english": "Fruits of Trust in Allah"
            },
            "content": {
              "urdu": [
                "جب انسان اللہ پر بھروسہ کر کے غلط ذرائع کو ٹھکرا دیتا ہے تو اللہ مدد بھیجتا ہے۔",
                "اس شخص کے ایمان لانے سے مسلمانوں کو ایک سچا اور بہادر ساتھی مل گیا۔",
                "اللہ کی نصرت کے لیے ظاہری اسباب سے زیادہ باطنی صفائی اہم ہے۔"
              ],
              "english": [
                "When a person rejects wrong means while trusting Allah, Divine help descends.",
                "The conversion of that man provided Muslims with a sincere and brave companion.",
                "Spiritual purity is more vital for Allah's victory than outward material means."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت کی اصلاح",
              "english": "Rectification of Intention"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اس سے پوچھا 'کیا تم اللہ اور اس کے رسول پر ایمان لاتے ہو؟'۔",
                "یہ سوال اس کی لڑائی کے مقصد کو درست کرنے کے لیے تھا۔",
                "ہمیں اپنے ہر کام کی بنیاد ایمان اور رضا الٰہی پر رکھنی چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) asked him, 'Do you believe in Allah and His Messenger?'",
                "This question was intended to correct the objective of his fighting.",
                "We must base all our actions on faith and the pursuit of Allah's pleasure."
              ]
            }
          }
        ]
      }
    }
  ]
}