{
  "hadithId": 400,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/abudawud:1160"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "كتاب الصلاة",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "منكر.‏ رواه أبو داود (1160)، وابن ماجه (1313)، والحاكم (1/295)، والبيهقي (3/310)، وفي إسناده عيسى بن عبد الأعلى الحجازي وهو مجهول.",
    "urdu": "یہ روایت منکر (ضعیف) ہے۔ اسے امام ابو داؤد (1160) اور ابن ماجہ (1313) نے روایت کیا ہے۔ اس کی سند میں عیسیٰ بن عبد الاعلیٰ حجازی مجہول راوی ہے جس کی وجہ سے محدثین نے اسے ضعیف قرار دیا ہے۔",
    "english": "Munkar (Weak). Reported by Abu Dawud (1160) and Ibn Majah (1313). Its chain contains 'Isa bin 'Abdul A'la al-Hijazi, who is unknown (Majhul), rendering the narration weak."
  },
  "importantWords": [
    {
      "arabic": "أَصَابَهُمْ",
      "english": "Befell them",
      "urdu": "انہیں پہنچا / آ لیا"
    },
    {
      "arabic": "مَطَرٌ",
      "english": "Rain",
      "urdu": "بارش"
    },
    {
      "arabic": "عِيدٍ",
      "english": "Eid (Festival)",
      "urdu": "عید"
    },
    {
      "arabic": "اَلْمَسْجِدِ",
      "english": "The Mosque",
      "urdu": "مسجد"
    },
    {
      "arabic": "إِسْنَادٍ",
      "english": "Chain of narration",
      "urdu": "سند"
    },
    {
      "arabic": "لَيِّنٍ",
      "english": "Weak / Flexible",
      "urdu": "کمزور / نرم"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث عید کی نماز بارش کی صورت میں مسجد میں ادا کرنے کے جواز پر دلالت کرتی ہے، اگرچہ اس کی سند میں کلام ہے۔",
    "english": "This Hadith suggests the permissibility of performing Eid prayer in the mosque during rain, although its chain of narration is criticized by scholars."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1160)",
      "english": "Sunan Abu Dawud (1160)"
    },
    {
      "arabic": "سنن ابن ماجه (1313)",
      "english": "Sunan Ibn Majah (1313)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A_WpW9zW5Vw",
  "grade": {
    "arabic": "ضعيف / منكر",
    "english": "Weak (Da'if) / Munkar"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شرعی حکم اور بارش",
        "english": "Legal Ruling and Rain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد میں عید کی نماز",
              "english": "Eid Prayer in Mosque"
            },
            "content": {
              "urdu": [
                "عید کی نماز اصل سنت کے مطابق کھلے میدان (عیدگاہ) میں ہونی چاہیے۔",
                "بارش یا شدید عذر کی صورت میں مسجد میں نماز پڑھنا جائز ہے۔",
                "یہ حدیث ضعیف ہونے کے باوجود فقہاء کے نزدیک اس مسئلے میں مستعمل ہے۔"
              ],
              "english": [
                "According to the Sunnah, Eid prayer should be held in an open field.",
                "It is permissible to pray in the mosque in case of rain or necessity.",
                "Despite its weakness, jurists use this narration for this specific ruling."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی اور سہولت",
              "english": "Prophetic Sunnah and Ease"
            },
            "content": {
              "urdu": [
                "دین اسلام میں عبادات کی ادائیگی میں آسانی اور سہولت کا پہلو نمایاں ہے۔",
                "نبی کریم ﷺ نے امت کو مشقت سے بچانے کے لیے متبادل راستے فراہم کیے۔",
                "بارش میں مسجد کا رخ کرنا مومنین کے لیے اللہ کی طرف سے رعایت ہے۔"
              ],
              "english": [
                "Islam emphasizes ease and flexibility in performing acts of worship.",
                "The Prophet (PBUH) provided alternatives to save the Ummah from hardship.",
                "Moving to the mosque during rain is a concession from Allah for believers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی فنی حیثیت",
        "english": "Technical Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری",
              "english": "Weakness of the Chain"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد نے خود اس حدیث کی سند کو 'لین' (کمزور) قرار دیا ہے۔",
                "عیسیٰ بن عبد الاعلیٰ نامی راوی کے حالاتِ زندگی نامعلوم یا مجہول ہیں۔",
                "محدثین کے نزدیک ایسی روایات فضائل یا عام احکام میں تائیدی طور پر آتی ہیں۔"
              ],
              "english": [
                "Imam Abu Dawud himself described the chain as 'Layyin' (weak).",
                "The narrator 'Isa bin 'Abdul A'la is unknown or 'Majhul' in status.",
                "Scholars use such narrations supportively for general rulings or virtues."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر ائمہ کی رائے",
              "english": "Opinions of Other Imams"
            },
            "content": {
              "urdu": [
                "امام حاکم نے اسے صحیح کہا مگر دیگر محدثین نے ان سے اتفاق نہیں کیا۔",
                "امام بیہقی اور دیگر نے بھی اس کی سند پر جرح کی ہے۔",
                "حدیث کا متن شریعت کے 'رفعِ حرج' (تنگی دور کرنے) کے اصول کے موافق ہے۔"
              ],
              "english": [
                "Imam Al-Hakim graded it Sahih, but other scholars disagreed.",
                "Imam Al-Bayhaqi and others also criticized its chain of narration.",
                "The text aligns with the Sharia principle of 'removing hardship'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی فوائد",
        "english": "Juristic Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عیدگاہ اور مسجد کا فرق",
              "english": "Eidgah vs Mosque"
            },
            "content": {
              "urdu": [
                "بلا عذر عیدگاہ چھوڑ کر مسجد میں نماز پڑھنا سنت کے خلاف ہے۔",
                "اگر بارش نہ ہو تو نبی ﷺ ہمیشہ عیدگاہ تشریف لے جاتے تھے۔",
                "مسجد میں نماز پڑھنے سے نماز کی صحت پر اثر نہیں پڑتا، بس فضیلت کم ہوتی ہے۔"
              ],
              "english": [
                "Praying in the mosque without an excuse goes against the preferred Sunnah.",
                "Without rain, the Prophet (PBUH) always went to the prayer ground (Musalla).",
                "Praying in the mosque doesn't invalidate the prayer; it only reduces the reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "بارش ایک شرعی عذر",
              "english": "Rain as a Legal Excuse"
            },
            "content": {
              "urdu": [
                "بارش ان اعذار میں سے ہے جو باجماعت نماز کی جگہ بدلنے کا سبب بنتے ہیں۔",
                "اس سے ثابت ہوا کہ اسلام میں جان اور سہولت کی حفاظت کو اہمیت دی گئی ہے۔",
                "عید کی خوشی کو بارش کی وجہ سے ضائع نہیں کرنا چاہیے بلکہ مسجد میں جمع ہونا چاہیے۔"
              ],
              "english": [
                "Rain is among the valid excuses to change the location of congregational prayer.",
                "This proves that Islam values life and the preservation of ease for people.",
                "The joy of Eid should not be lost due to rain; instead, people should gather in mosques."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی سبق",
        "english": "Educational and Moral Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی اہمیت",
              "english": "Importance of Discipline"
            },
            "content": {
              "urdu": [
                "موسمی حالات کے مطابق حکمتِ عملی بدلنا سنتِ نبوی کا حصہ ہے۔",
                "مسلمانوں کو ہر حال میں اجتماعیت اور اتحاد کو برقرار رکھنا چاہیے۔",
                "عید کے اجتماعات مسلمانوں کی قوت اور شان و شوکت کا مظہر ہیں۔"
              ],
              "english": [
                "Adapting strategies according to weather conditions is part of the Sunnah.",
                "Muslims must maintain unity and congregation in all circumstances.",
                "Eid gatherings are a manifestation of the strength and glory of Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء سے رجوع",
              "english": "Consulting Scholars"
            },
            "content": {
              "urdu": [
                "حدیث کی صحت اور ضعف کو سمجھنے کے لیے ماہرینِ فن سے پوچھنا ضروری ہے۔",
                "ہر سنی سنائی بات کو بغیر تحقیق کے رسول اللہ ﷺ کی طرف منسوب نہ کریں۔",
                "دین کے معاملے میں احتیاط اور علم ہی اصل نجات کا راستہ ہے۔"
              ],
              "english": [
                "It is essential to consult experts to understand the authenticity of Hadith.",
                "Do not attribute reports to the Prophet (PBUH) without verification.",
                "Precaution and knowledge are the true paths to salvation in religion."
              ]
            }
          }
        ]
      }
    }
  ]
}
