{
  "hadithId": 43,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 15 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب المسح على العمامة والخفين",
    "babId": 4
  },

  "takhreej": {
    "arabic": "صحيح.  رواه مسلم (274)  (83) . ",
    "urdu": "صحیح (درجہ)۔ اسے مسلم (274) (83) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Muslim (274) (83)."
  },
  "importantWords": [
    {
      "arabic": "تَوَضَّأَ",
      "english": "Performed Wudu",
      "urdu": "وضو کیا"
    },
    {
      "arabic": "مَسَحَ",
      "english": "Wiped over",
      "urdu": "مسح کیا"
    },
    {
      "arabic": "بِنَاصِيَتِهِ",
      "english": "His forelock (front hair)",
      "urdu": "پیشانی کے بالوں"
    },
    {
      "arabic": "اَلْعِمَامَةِ",
      "english": "The Turban",
      "urdu": "پگڑی"
    },
    {
      "arabic": "اَلْخُفَّيْنِ",
      "english": "The leather socks/Khuffayn",
      "urdu": "موزوں"
    },
    {
      "arabic": "اَلْمُغِيرَةِ بْنِ شُعْبَةٍ",
      "english": "Al-Mughīrah ibn Shuʿbah",
      "urdu": "مغیرہ بن شعبہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سر کے مسح اور پاؤں کے دھونے کے فریضہ میں دو اہم رعایتوں (رخصتوں) کو بیان کرتی ہے: سر کے مسح میں عمامہ پر مسح کی اجازت، اور پاؤں کے دھونے کے بجائے موزوں پر مسح کی اجازت۔",
    "english": "This Hadith establishes two important concessions (Rukhaṣ) in Wudu: the permissibility of wiping over the turban in place of fully wiping the hair, and the permissibility of wiping over leather socks (Khuffayn) instead of washing the feet."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الطهارة، رقم 274",
      "english": "Sahih Muslim, The Book of Purification, Hadith 274"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "اَلْمُغِيرَةِ بْنِ شُعْبَةٍ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Al-Mughīrah ibn Shuʿbah (May Allah be pleased with him)"
      },
      "slug": "al-mughirah-ibn-shubah"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-21-wiping-turban-socks",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طہارت میں رخصت کا اصول",
        "english": "The Principle of Concession (Rukhṣah) in Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح علی العمامہ (پگڑی پر مسح)",
              "english": "Wiping Over the Turban (Mas'h 'ala al-'Imāmah)"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ ثابت ہوتا ہے کہ نبی اکرم ﷺ نے پگڑی (عمامہ) پر مسح فرمایا، جو سر کے پورے حصے کو بار بار کھولنے کی **مشقت** سے بچنے کے لیے ایک رخصت ہے۔",
                "نبی ﷺ نے مسح کا آغاز پیشانی کے بالوں (ناصیہ) پر کیا اور باقی مسح پگڑی پر مکمل کیا، جو دونوں کے جمع ہونے کا سنت طریقہ ہے۔",
                "یہ مسح صرف اس صورت میں جائز ہے جب عمامہ (یا ٹوپی/اسکارف) صحیح طریقے سے سر پر باندھا/پہنا گیا ہو اور اسے اتارنا مشکل ہو، جو آسانی کی دلیل ہے۔"
              ],
              "english": [
                "This Hadith proves that the Prophet (ﷺ) wiped over his turban (ʿImāmah), which is a concession (Rukhṣah) to avoid the **hardship** of uncovering the head repeatedly.",
                "The Prophet (ﷺ) started the wipe on his forelock (Nāṣiyah, front hair) and completed the rest of the wipe over the turban, which is the Sunnah method of combining both.",
                "This wipe is only permissible if the turban (or a cap/scarf used as a substitute) is properly worn and removal causes hardship, which indicates the principle of ease."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح علی الخفین (موزوں پر مسح)",
              "english": "Wiping Over the Socks (Mas'h 'ala al-Khuffayn)"
            },
            "content": {
              "urdu": [
                "حدیث میں پاؤں کے دھونے کے بجائے چمڑے کے موزوں (خفین) پر مسح کی اجازت کا ذکر ہے، جو ایک عظیم شرعی آسانی ہے۔",
                "مسح کی اجازت کی شرط یہ ہے کہ موزے طہارت کی حالت (مکمل وضو) کے بعد پہنے گئے ہوں، اور ان کو شرعی حدود کے مطابق مسح کیا جائے۔",
                "یہ رخصت سفر اور حضر (قیام) دونوں میں جائز ہے، لیکن اس کی مدت سفر میں تین دن اور تین رات، اور قیام میں ایک دن اور ایک رات مقرر ہے۔"
              ],
              "english": [
                "The Hadith mentions the permission to wipe over leather socks (Khuffayn) instead of washing the feet, which is a great legal concession.",
                "The condition for this permission is that the socks must have been put on after completing a state of ritual purity (full Wudu), and they must be wiped according to the legal rules.",
                "This concession is permitted both while travelling and while resident, with a time limit of three days and three nights for the traveler and one day and one night for the resident."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسح کے طریقہ کار کی تفصیل",
        "english": "Details of the Wiping Procedure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح کی نوعیت",
              "english": "The Nature of the Wiping"
            },
            "content": {
              "urdu": [
                "عمامہ پر مسح کرتے وقت صرف مسح کے فرض حصے (سر کے کچھ حصے) پر اکتفا کرنا اور باقی حصہ عمامہ پر کرنا شرعی طور پر جائز ہے۔",
                "موزوں پر مسح صرف موزے کے **اوپری حصے** پر کیا جاتا ہے اور یہ پاؤں کو دھونے کے فریضے کا نعم البدل ہے، نہ کہ مسح کرنے کا۔",
                "دونوں صورتوں میں مسح کا طریقہ یہ ہے کہ گیلے ہاتھ کو ہلکے سے ایک بار گزارا جائے، نہ کہ رگڑ کر دھونا، جو مسح کی نوعیت کے خلاف ہے۔"
              ],
              "english": [
                "When wiping over the turban, it is legally permissible to wipe the minimum obligatory part of the head (the forelock) and complete the remainder over the turban.",
                "The wipe over the socks is done only on the **upper surface** of the Khuffayn and serves as a substitute for the obligatory washing of the feet, not the wiping of the feet.",
                "In both cases, the method of wiping involves lightly passing the wet hand over the surface once, not rubbing or scrubbing, which would negate the nature of Mas'h."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشابہت کا حکم (جوربین)",
              "english": "Ruling on Similar Items (Socks/Jawrabayn)"
            },
            "content": {
              "urdu": [
                "اس حکم کی توسیع کرتے ہوئے، بعض فقہاء نے چمڑے کے موزوں کی مشابہت میں ایسے موٹے اور مضبوط **سوتی موزوں (جوربین)** پر بھی مسح کی اجازت دی ہے۔",
                "شرط یہ ہے کہ وہ موزے اتنے مضبوط ہوں کہ ان میں پانی نہ ٹہر سکے اور وہ بغیر جوتے کے پہن کر چلنے کے قابل ہوں، یہ وسعت آسانی کی دلیل ہے۔",
                "البتہ، فقہ کے بعض دیگر مسالک (جیسے شافعی) میں اس حکم کو صرف چمڑے کے موزوں تک ہی محدود رکھا گیا ہے، تاہم رخصت پر عمل جائز ہے۔"
              ],
              "english": [
                "Extending this ruling, some jurists permit wiping over thick, durable **non-leather socks (Jawrabayn)** that resemble leather socks in durability.",
                "The condition is that these socks must be thick enough not to absorb water easily and durable enough to walk in without shoes, demonstrating the ease of the Sharia.",
                "However, some schools of Fiqh (like Shafi'i) strictly limit this ruling only to leather socks, though following the concession is permissible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور رخصت کا وقت",
        "english": "The Narrator and Timing of the Concession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغیرہ بن شعبہؓ کا مشاہدہ",
              "english": "Mughīrah ibn Shuʿbah's Observation"
            },
            "content": {
              "urdu": [
                "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ نبی اکرم ﷺ کے ساتھ سفر میں تھے جب انہوں نے یہ وضو دیکھا، اور یہ ان کی طرف سے ایک اہم عملی روایت ہے۔",
                "نبی ﷺ کے سفر میں ہونے کی وجہ سے اس رخصت پر عمل کیا گیا، کیونکہ سفر میں موزے اتارنا اور سردی میں سر کھولنا زیادہ مشکل ہوتا ہے۔",
                "مغیرہؓ کی یہ روایت اس بات کی یقینی دلیل ہے کہ رخصت پر عمل کرنا بھی سنتِ نبوی ہے اور شریعت کی آسانی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Sayyiduna Al-Mughīrah ibn Shuʿbah (RA) was traveling with the Prophet (ﷺ) when he observed this Wudu, making it a crucial practical narration.",
                "The Prophet (ﷺ) exercised this concession during travel, where removing socks and uncovering the head in the cold is more burdensome.",
                "Mughīrah's narration provides definitive proof that acting upon a concession (Rukhṣah) is also part of the Sunnah and demonstrates the ease of the Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "قربت اور مسح",
              "english": "Closeness and Wiping (Mas'h)"
            },
            "content": {
              "urdu": [
                "یہ حدیث طہارت کے اصول کو ظاہر کرتی ہے کہ جو اعضاء دھونے کے بجائے مسح کیے جاتے ہیں، وہ قریب تر اعضاء سے متصل ہوتے ہیں۔",
                "یعنی، عمامہ کا مسح سر کے مسح کا ایک حصہ ہے اور موزوں کا مسح پاؤں کے دھونے کا نعم البدل ہے، دونوں میں مسح کی مقدار کم ہے۔",
                "مختصر طور پر، یہ حدیث اسلامی قانون سازی کے دو بنیادی مقاصد کو پورا کرتی ہے: اللہ کا حکم پورا کرنا اور امت کو آسانی فراہم کرنا۔"
              ],
              "english": [
                "This Hadith illustrates the principle that limbs that are wiped instead of washed are often connected to adjacent limbs, such as the forelock and turban being part of the head.",
                "The wiping of the turban is an extension of the head wipe, and wiping the socks substitutes the foot washing; in both cases, the act of wiping is minimal.",
                "In summary, this Hadith fulfills two core objectives of Islamic legislation: fulfilling Allah's command and providing ease to the Muslim Ummah."
              ]
            }
          }
        ]
      }
    }
  ]
}
