{
  "hadithId": 725,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/muslim:1600a"
    ],
    "kitabId": 7,
    "inKitabBab": 5,
    "arabicBook": "كتاب البيوع",
    "babId": 46
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1600). وأخرجه أيضاً الترمذي (1316) والنسائي (7/290) وأبو داود (3346) وابن ماجه (2285).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1600) نے اسے روایت کیا ہے۔ یہ حدیث قرض کی ادائیگی میں حسنِ سلوک اور فضیلت کی دلیل ہے۔",
    "english": "Sahih. Reported by Muslim (1600). Also reported by At-Tirmidhi, An-Nasa'i, Abu Dawud, and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "اسْتَسْلَفَ",
      "english": "Borrowed",
      "urdu": "قرض لیا"
    },
    {
      "arabic": "بَكْرًا",
      "english": "Young camel",
      "urdu": "جوان اونٹ"
    },
    {
      "arabic": "خَيَارًا",
      "english": "Superior / Best",
      "urdu": "بہترین / عمدہ"
    },
    {
      "arabic": "أَحْسَنُهُمْ قَضَاءً",
      "english": "Best in repaying",
      "urdu": "ادائیگی میں سب سے اچھا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں قرض کی واپسی کے وقت اصل سے بہتر چیز دینے کے جواز اور اس کی اخلاقی فضیلت کا بیان ہے، بشرطیکہ یہ پہلے سے طے شدہ نہ ہو۔",
    "english": "This Hadith highlights the permissibility and virtue of repaying a debt with something better than what was borrowed, provided it was not a pre-agreed condition."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1600)",
      "english": "Sahih Muslim (1600)"
    },
    {
      "arabic": "جامع الترمذي (1316)",
      "english": "Jami' At-Tirmidhi (1316)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو رافع المدني",
        "english": "Abu Rafi' al-Madani"
      },
      "slug": "abu-rafi-al-madani"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرض کی ادائیگی میں حسنِ سلوک",
        "english": "Excellence in Debt Repayment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بہتر چیز کی واپسی",
              "english": "Returning Something Better"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص قرض میں لی گئی چیز سے بہتر چیز خوشی سے واپس کرے تو یہ جائز اور مستحب ہے۔",
                "نبی ﷺ نے خود ایک جوان اونٹ کے بدلے اس سے مہنگا اور بڑا اونٹ واپس کر کے نمونہ پیش کیا۔",
                "یہ عمل قرض دینے والے کے احسان کا بدلہ شکریہ کے ساتھ چکانے کی ایک صورت ہے۔"
              ],
              "english": [
                "Repaying a debt with something better out of goodwill is permissible and recommended.",
                "The Prophet (PBUH) set an example by returning a more valuable camel than the one he borrowed.",
                "This act is a way of showing gratitude and reciprocating the kindness of the lender."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشروط زیادتی اور سود میں فرق",
              "english": "Difference from Usury"
            },
            "content": {
              "urdu": [
                "اگر واپسی پر زیادہ دینے کی شرط پہلے سے لگی ہو تو وہ 'سود' (Riba) بن جائے گا۔",
                "اس حدیث میں زیادتی مقروض کی طرف سے اپنی مرضی اور احسان کے طور پر تھی، جو کہ عین سنت ہے۔",
                "اسلامی معاشیات میں 'قرضِ حسنہ' کا مقصد ہی باہمی ہمدردی اور مروت کو فروغ دینا ہے۔"
              ],
              "english": [
                "If an extra amount or better quality is pre-conditioned, it becomes usury (Riba).",
                "In this Hadith, the excess was voluntary and a gesture of kindness, which is the Sunnah.",
                "The purpose of 'Qard al-Hasan' in Islamic economics is to foster mutual empathy and generosity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بہترین انسان کی پہچان",
        "english": "Recognition of the Best Person"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانت داری اور دیانت",
              "english": "Trustworthiness and Integrity"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے واضح فرمایا کہ بہترین لوگ وہ ہیں جو حقوق کی ادائیگی میں ٹال مٹول نہیں کرتے۔",
                "وقت پر اور مکمل حق ادا کرنا مومن کی شان اور اعلیٰ اخلاق کی علامت ہے۔",
                "قرض خواہ کو پریشان نہ کرنا بلکہ اسے توقع سے زیادہ خوش کرنا اللہ کو پسند ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) clarified that the best people do not procrastinate in fulfilling rights.",
                "Timely and full repayment is a sign of a believer's high moral character.",
                "Not distressing the lender, and instead making them happier than expected, is beloved to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اثرات",
              "english": "Social Impact"
            },
            "content": {
              "urdu": [
                "جب لوگ ادائیگی میں اچھے ہوں گے تو معاشرے میں ایک دوسرے کی مدد کا جذبہ بڑھے گا۔",
                "ٹال مٹول اور بددیانتی سے نیک لوگ قرض دینے سے کترانے لگتے ہیں، جو معاشرے کا نقصان ہے۔",
                "سنت کے مطابق ادائیگی سے باہمی اعتماد اور معاشی برکت پیدا ہوتی ہے۔"
              ],
              "english": [
                "When people excel in repayment, the spirit of mutual aid increases in society.",
                "Dishonesty and delay discourage good people from lending, which harms the community.",
                "Repaying according to the Sunnah builds trust and invites economic blessings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور قانونی فوائد",
        "english": "Juristic and Legal Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جانوروں کا قرض",
              "english": "Lending Animals"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس بات کی دلیل ہے کہ جانوروں کا قرض لینا اور دینا شرعاً جائز ہے۔",
                "امام شافعی اور اوزاعی اسی کے قائل ہیں، جبکہ بعض نے اسے 'سلم' کی ایک صورت مانا ہے۔",
                "اسلامی شریعت زندگی کے ہر شعبے میں لین دین کے واضح ضوابط فراہم کرتی ہے۔"
              ],
              "english": [
                "This Hadith serves as evidence that borrowing and lending animals is legally permissible.",
                "Imams Shafi'i and Awza'i uphold this view, while some see it as a form of Salam.",
                "Sharia provides clear regulations for transactions in every aspect of life."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ کے مال سے ادائیگی",
              "english": "Repayment from Sadaqah Assets"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے عوامی مفاد (بیت المال) کے لیے قرض لیا اور صدقہ کے مال سے اسے چکایا۔",
                "یہ ثابت کرتا ہے کہ حاکمِ وقت ضرورت کے تحت بیت المال کے لیے قرض لے سکتا ہے۔",
                "اس میں یہ حکمت بھی ہے کہ قرض کی واپسی کو ترجیح دی جانی چاہیے۔"
              ],
              "english": [
                "The Prophet (PBUH) borrowed for public interest and repaid it from the Sadaqah assets.",
                "This proves that the head of state can borrow for the public treasury when necessary.",
                "It also signifies that returning a debt should be given priority."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احسان کا بدلہ احسان",
              "english": "Reciprocating Kindness"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ جس نے ہماری مشکل میں مدد کی ہو، اسے بہترین طریقے سے نوازیں۔",
                "ضروری نہیں کہ ہم بڑی رقم دیں، اچھے الفاظ اور دعا بھی 'احسن قضاء' میں شامل ہے۔",
                "مومن کا اخلاق اس کے مالی معاملات میں جھلکنا چاہیے۔"
              ],
              "english": [
                "We should generously reward anyone who assisted us during our difficult times.",
                "It is not always about money; kind words and prayers are also part of 'being best in repayment'.",
                "A believer's character should be evident in their financial dealings."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "ادائیگی میں ٹال مٹول سے بچیں اور سچی نیت کے ساتھ قرض چکائیں۔",
                "اگر استطاعت ہو تو اصل سے کچھ زائد یا بہتر دینا عظیم سنتِ نبوی ﷺ ہے۔",
                "یہی وہ راستہ ہے جو انسان کو اللہ اور اس کی مخلوق کی نظر میں معزز بناتا ہے۔"
              ],
              "english": [
                "Avoid procrastination and repay debts with a sincere intention.",
                "If capable, giving a little more or something better is a great Prophetic Sunnah.",
                "This path makes a person honorable in the sight of Allah and His creation."
              ]
            }
          }
        ]
      }
    }
  ]
}