{
  "hadithId": 953,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1094"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1480/41). وأصله في قصة طلاقها من أبي عمرو بن حفص، حيث أمرها النبي صلى الله عليه وسلم أن تعتد في بيت ابن أم مكتوم لسلامتها ولأنه رجل أعمى.",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح (1480) میں روایت کیا ہے۔ یہ واقعہ اس وقت پیش آیا جب ابوعمرو بن حفص نے انہیں طلاقِ بتہ (آخری طلاق) دی، اور وہ تنہا رہائش میں خود کو غیر محفوظ محسوس کر رہی تھیں۔",
    "english": "Sahih. Reported by Muslim (1480/41). This incident occurred after her husband gave her the final divorce; she felt unsafe in her current residence, so the Prophet (ﷺ) permitted her relocation for her safety."
  },
  "importantWords": [
    {
      "arabic": "يُقْتَحَمَ",
      "english": "To be broken into / Harassed",
      "urdu": "گھس آنا / حملہ کرنا"
    },
    {
      "arabic": "طَلَّقَنِي",
      "english": "Divorced me",
      "urdu": "مجھے طلاق دی"
    },
    {
      "arabic": "فَأَمَرَهَا",
      "english": "He commanded her",
      "urdu": "پس آپ نے اسے حکم دیا"
    },
    {
      "arabic": "فَتَحَوَّلَتْ",
      "english": "She moved / Relocated",
      "urdu": "پس وہ منتقل ہو گئی"
    },
    {
      "arabic": "ثَلَاثًا",
      "english": "Three times",
      "urdu": "تین بار"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ اگر معتدہ (عدت گزارنے والی عورت) اپنی رہائش گاہ پر خطرہ یا خوف محسوس کرے، تو وہ حفاظت کی خاطر وہاں سے دوسری جگہ منتقل ہو سکتی ہے۔",
    "english": "This Hadith establishes that if a woman observing Iddah feels unsafe or fears for her security at her residence, she is permitted to relocate for protection."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1480)",
      "english": "Sahih Muslim (1480)"
    },
    {
      "arabic": "سنن أبي داود (2290)",
      "english": "Sunan Abu Dawud (2290)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "فاطمة بنت قيس",
        "english": "Fatima bint Qais"
      },
      "slug": "fatima-bint-qais"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_vW0BTo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دورانِ عدت رہائش کی تبدیلی",
        "english": "Changing Residence During Iddah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جان و مال کی حفاظت",
              "english": "Protection of Life and Wealth"
            },
            "content": {
              "urdu": [
                "اصل حکم یہ ہے کہ معتدہ اسی گھر میں رہے جہاں طلاق کے وقت تھی، مگر ضرورت مستثنیٰ ہے۔",
                "اگر گھر خستہ حال ہو یا وہاں چوروں اور بدقماشوں کا ڈر ہو تو جگہ بدلنا جائز ہے۔",
                "اسلام انسانی جان اور عزت و آبرو کے تحفظ کو تمام رسمی احکام پر مقدم رکھتا ہے۔"
              ],
              "english": [
                "The primary rule is to stay in the home where the divorce occurred, but necessity is an exception.",
                "If the house is dilapidated or there is a fear of thieves or harassment, moving is allowed.",
                "Islam prioritizes the protection of human life and honor over routine procedural rulings."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناگزیر حالات کی رعایت",
              "english": "Allowance for Unavoidable Circumstances"
            },
            "content": {
              "urdu": [
                "فاطمہ بنت قیس نے اپنے سسرال والوں کے شر اور حملے کے اندیشے کا ذکر کیا تھا۔",
                "آپ ﷺ نے ان کے عذر کو قبول فرمایا اور انہیں محفوظ مقام پر منتقل ہونے کی ہدایت دی۔",
                "یہ لچک ظاہر کرتی ہے کہ شریعت کے قوانین انسان کو تنگی میں ڈالنے کے لیے نہیں ہیں۔"
              ],
              "english": [
                "Fatima bint Qais mentioned fears regarding her in-laws and potential intrusion.",
                "The Prophet (ﷺ) accepted her excuse and directed her to move to a safer location.",
                "This flexibility shows that Shariah laws are not meant to put humans into undue hardship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اور نفسیاتی پہلو",
        "english": "Social and Psychological Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کا وقار اور سکون",
              "english": "Woman's Dignity and Peace"
            },
            "content": {
              "urdu": [
                "عدت کا زمانہ پہلے ہی عورت کے لیے جذباتی طور پر بہت مشکل ہوتا ہے۔",
                "ایسے میں اسے مزید خوف یا عدم تحفظ کے سائے میں رکھنا اس پر ظلم کے مترادف ہے۔",
                "نبی ﷺ نے ان کی نفسیاتی راحت کے لیے انہیں نابینا صحابی کے ہاں ٹھہرنے کا مشورہ دیا۔"
              ],
              "english": [
                "The period of Iddah is already emotionally challenging for a woman.",
                "Keeping her in a state of fear or insecurity during this time is a form of oppression.",
                "The Prophet (ﷺ) advised her to stay with a blind companion for her psychological ease."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "مطلقہ عورت کی حفاظت اور اس کے رہنے سہنے کا انتظام کرنا معاشرے کی ذمہ داری ہے۔",
                "اگر سابقہ شوہر کا گھر محفوظ نہیں تو ولی یا ریاست کو اس کا متبادل فراہم کرنا چاہیے۔",
                "اسلامی معاشرے میں بیواؤں اور مطلقہ خواتین کو کبھی اکیلا یا بے یار و مددگار نہیں چھوڑا جاتا۔"
              ],
              "english": [
                "Ensuring the safety and accommodation of a divorced woman is a societal responsibility.",
                "If the former husband's home is unsafe, the guardian or state must provide an alternative.",
                "In an Islamic society, widows and divorced women are never left helpless or isolated."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منتقلی کے لیے شرائط",
              "english": "Conditions for Relocation"
            },
            "content": {
              "urdu": [
                "بغیر کسی شرعی عذر کے عدت کے دوران گھر بدلنا گناہ اور سنت کے خلاف ہے۔",
                "منتقلی صرف اسی صورت میں جائز ہے جب وہاں رہنا ناممکن یا خطرناک ہو جائے۔",
                "قانون کا غلط فائدہ اٹھانے کے بجائے ہمیشہ تقویٰ اور سچائی کو مدنظر رکھنا چاہیے۔"
              ],
              "english": [
                "Moving during Iddah without a valid Shariah excuse is sinful and against the Sunnah.",
                "Relocation is only permissible when staying becomes impossible or genuinely dangerous.",
                "One should prioritize piety and truthfulness instead of misusing legal concessions."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی مصلحت اور حکمت",
              "english": "Prophetic Expediency and Wisdom"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے انہیں ابن ام مکتوم کے گھر بھیجا کیونکہ وہاں وہ پردے کے ساتھ آرام سے رہ سکتی تھیں۔",
                "وہاں وہ اپنے حجاب کا خیال رکھتے ہوئے کسی بھی غیر مرد کی مداخلت سے بچ سکتی تھیں۔",
                "نبی ﷺ کی ہر ہدایت میں امت کے لیے دور رس فوائد اور حکمتیں پوشیدہ ہوتی ہیں۔"
              ],
              "english": [
                "The Prophet sent her to Ibn Umm Maktum's house so she could stay comfortably with privacy.",
                "There, she could maintain her hijab while avoiding unwanted intrusion from non-mahrams.",
                "Every instruction of the Prophet (ﷺ) contains far-reaching benefits and wisdom for the Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشورے کی برکت",
              "english": "Blessing of Consultation"
            },
            "content": {
              "urdu": [
                "فاطمہ بنت قیس کا خود فیصلہ کرنے کے بجائے نبی ﷺ سے مشورہ کرنا ایک بہترین اسوہ ہے۔",
                "پیچیدہ گھریلو اور شرعی معاملات میں مستند علماء اور بزرگوں سے رہنمائی لینی چاہیے۔",
                "مشورے سے کیے گئے کاموں میں اللہ کی مدد اور برکت شامل ہوتی ہے۔"
              ],
              "english": [
                "Fatima bint Qais consulting the Prophet instead of deciding alone is an excellent example.",
                "Guidance should be sought from authentic scholars in complex domestic and legal matters.",
                "Allah's help and blessing are found in actions taken through proper consultation."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں تنگی نہیں",
              "english": "No Hardship in Religion"
            },
            "content": {
              "urdu": [
                "اسلام ایک آسان اور فطری دین ہے جو ہر مشکل گھڑی میں انسان کے لیے راستہ نکالتا ہے۔",
                "عدت کے قوانین کا مقصد عورت کو تکلیف دینا نہیں بلکہ معاشرتی نظم کو قائم رکھنا ہے۔",
                "جہاں انسانی جان یا عزت خطرے میں ہو، وہاں شریعت لچک اور سہولت فراہم کرتی ہے۔"
              ],
              "english": [
                "Islam is a simple and natural religion that provides solutions for every difficult moment.",
                "Iddah laws aim to maintain social order rather than inflicting pain on the woman.",
                "Where human life or honor is at stake, Shariah provides flexibility and ease."
              ]
            }
          }
        ]
      }
    }
  ]
}