{
  "hadithId": 633,
  "hadithNo": 27,
  "hadithReferences": {
    "sunnah.com": ["bulugh/633"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "رواه أحمد (6/143)، وأبو داود (1978). في سنده الحجاج بن أرطأة وهو مدلس، لكن متن الحديث ثابت بشواهد أخرى صحيحة، منها حديث عائشة في الصحيحين أنها طيبت النبي ﷺ لحله قبل أن يطوف.",
    "urdu": "اسے احمد (6/143) اور ابوداؤد (1978) نے روایت کیا ہے۔ اس کی سند میں حجاج بن ارطاہ ہے جو کہ تدلیس کرتا تھا، لیکن اس کے شواہد صحیح بخاری و مسلم میں موجود ہیں جس سے معلوم ہوتا ہے کہ طوافِ افاضہ سے پہلے خوشبو لگانا جائز ہے۔",
    "english": "Reported by Ahmad (6/143) and Abu Dawud (1978). The chain includes al-Hajjaj bin Artah, who is a Mudallis. However, the core meaning is supported by Sahih narrations in Bukhari and Muslim where Aisha (RA) scented the Prophet (ﷺ) before his Tawaf."
  },
  "importantWords": [
    {
      "arabic": "رَمَيْتُمْ",
      "english": "You threw pebbles (Ramy)",
      "urdu": "تم نے کنکریاں ماریں"
    },
    {
      "arabic": "حَلَقْتُمْ",
      "english": "You shaved your heads",
      "urdu": "تم نے سر منڈوائے"
    },
    {
      "arabic": "حَلَّ لَكُمْ",
      "english": "Became permissible for you",
      "urdu": "تمہارے لیے حلال ہو گیا"
    },
    {
      "arabic": "الطِّيبُ",
      "english": "Perfume",
      "urdu": "خوشبو"
    },
    {
      "arabic": "النِّسَاءَ",
      "english": "Women (Intercourse)",
      "urdu": "عورتیں (جماع/بیویاں)"
    }
  ],
  "summary": {
    "urdu": "10 ذوالحجہ کو جمرہ عقبہ کی رمی اور سر منڈوانے کے بعد حاجی 'تحللِ اول' حاصل کر لیتا ہے، جس کے بعد وہ سلے ہوئے کپڑے پہن سکتا ہے اور خوشبو لگا سکتا ہے، صرف بیوی سے تعلقات کی ممانعت باقی رہتی ہے۔",
    "english": "After stoning Jamrat al-Aqaba and shaving the head on the 10th of Dhul-Hijjah, a pilgrim enters 'First Tahallul,' making everything permissible except marital relations."
  },
  "references": [
    {
      "arabic": "رواه أحمد (24283)",
      "english": "Reported by Ahmad (24283)"
    },
    {
      "arabic": "رواه أبو داود (1978)",
      "english": "Reported by Abu Dawud (1978)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYI7H7_nO6o",
  "grade": {
    "arabic": "ضعيف (بهذا اللفظ)",
    "english": "Weak (with this specific wording)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تحللِ اول کی حقیقت",
        "english": "Reality of the First Partial Exit (Tahallul)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممنوعات سے آزادی",
              "english": "Freedom from Prohibitions"
            },
            "content": {
              "urdu": [
                "جب حاجی 10 ذوالحجہ کے دو بڑے کام (رمی اور حلق) کر لیتا ہے تو وہ احرام کی زیادہ تر پابندیوں سے آزاد ہو جاتا ہے۔",
                "اس حالت میں حاجی غسل کر کے اپنے سلے ہوئے کپڑے پہن سکتا ہے اور خوشبو لگا سکتا ہے۔",
                "اسے 'تحللِ اصغر' یا 'تحللِ اول' کہا جاتا ہے۔"
              ],
              "english": [
                "Once a pilgrim completes two major tasks (stoning and shaving) on the 10th, they are freed from most Ihram restrictions.",
                "In this state, the pilgrim can bathe, wear stitched clothes, and apply perfume.",
                "This stage is known as 'Tahallul al-Asghar' or the 'First Tahallul'."
              ]
            }
          },
          {
            "title": {
              "urdu": "جماع کی ممانعت",
              "english": "Prohibition of Intercourse"
            },
            "content": {
              "urdu": [
                "تحللِ اول کے بعد بھی ازدواجی تعلقات (جماع) حرام رہتے ہیں۔",
                "بیوی سے تعلق کی مکمل اجازت صرف طوافِ افاضہ (زیارت) اور سعی کے بعد ملتی ہے۔",
                "یہ اس بات کی علامت ہے کہ حج کی مکمل روح کی بحالی آخری رکن تک برقرار رہتی ہے۔"
              ],
              "english": [
                "Even after the first Tahallul, marital relations (intercourse) remain forbidden.",
                "Full permissibility regarding the spouse is only granted after performing Tawaf al-Ifadah and Sa'i.",
                "This indicates that the complete spiritual sanctity of Hajj is maintained until the final major pillar."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب اور عمل",
        "english": "Juristic Schools and Practice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحلل کس عمل سے ہوتا ہے؟",
              "english": "What Act Triggers Tahallul?"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک رمی اور حلق (یا تقصیر) دونوں کے بعد تحلل ہوتا ہے۔",
                "بعض علماء کے نزدیک صرف جمرہ عقبہ کی رمی سے ہی تحلل حاصل ہو جاتا ہے۔",
                "احتیاط اسی میں ہے کہ رمی کے بعد سر کے بال منڈوائے یا کٹوائے جائیں پھر احرام کھولا جائے۔"
              ],
              "english": [
                "According to Shafi'i and Hanbali schools, both stoning and shaving (or cutting) are required for Tahallul.",
                "Some scholars believe that stoning Jamrat al-Aqaba alone is sufficient to achieve Tahallul.",
                "Precaution lies in shaving or cutting the hair after stoning before exiting the state of Ihram."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشبو کا استعمال",
              "english": "Use of Perfume"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے طوافِ افاضہ سے پہلے خوشبو لگائی تھی، جو اس حدیث کے حکم کی عملی تائید ہے۔",
                "اگر کوئی طواف سے پہلے خوشبو لگانا بھول جائے تو وہ طواف کے بعد بھی لگا سکتا ہے۔",
                "یہ عمل بندگی میں نشاط اور صفائی کی اہمیت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) applied perfume before Tawaf al-Ifadah, supporting the ruling of this Hadith practically.",
                "If someone forgets to apply perfume before Tawaf, they may do so after it as well.",
                "This practice highlights the importance of spiritual energy and hygiene in worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی اسنادی حیثیت",
        "english": "Status of the Hadith Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حجاج بن ارطاہ پر کلام",
              "english": "Discussion on al-Hajjaj bin Artah"
            },
            "content": {
              "urdu": [
                "اس حدیث کے راوی حجاج بن ارطاہ کی وجہ سے محدثین نے اسے ضعیف کہا ہے۔",
                "وہ کثرت سے غلطیاں کرتے تھے اور احادیث میں تدلیس (راوی کا نام چھپانا) کے عادی تھے۔",
                "تاہم، دیگر صحیح روایات اس کے مفہوم کی تائید کرتی ہیں، اس لیے اس پر عمل جائز ہے۔"
              ],
              "english": [
                "Hadith critics graded this weak due to the narrator al-Hajjaj bin Artah.",
                "He was known for frequent errors and practiced Tadlis (concealing a narrator's name).",
                "However, other Sahih narrations support its meaning, making its application acceptable."
              ]
            }
          },
          {
            "title": {
              "urdu": "شواہد کی قوت",
              "english": "Strength of Supporting Evidence"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کی دوسری صحیح روایت جو بخاری میں ہے، اس کا ایک حصہ اس کی تائید کرتا ہے۔",
                "حدیثِ ابن عباس بھی اس مفہوم میں مروی ہے، جس سے حکم مضبوط ہو جاتا ہے۔",
                "محدثین کا قاعدہ ہے کہ ضعیف حدیث جب کئی طرق سے آئے تو وہ حسن بن جاتی ہے۔"
              ],
              "english": [
                "Another authentic report from Aisha (RA) in Bukhari partially supports this text.",
                "Ibn 'Abbas (RA) also reported a similar meaning, strengthening the legal ruling.",
                "It is a rule of Hadith science that a weak report can become Hasan when narrated through multiple routes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفاست اور صفائی",
              "english": "Refinement and Hygiene"
            },
            "content": {
              "urdu": [
                "احرام کی مشقت کے بعد غسل اور خوشبو انسان کو ذہنی سکون عطا کرتی ہے۔",
                "اسلام نے عبادات کے درمیان بھی انسانی نفاست کا خیال رکھا ہے۔",
                "ایک مومن کو اللہ کے گھر کی طرف بہترین حالت میں جانا چاہیے۔"
              ],
              "english": [
                "Bathing and scenting after the rigors of Ihram provide mental and physical relief.",
                "Islam maintains standards of human refinement even within strict rituals.",
                "A believer should approach Allah's House in the best possible state."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدود کی پابندی",
              "english": "Adherence to Limits"
            },
            "content": {
              "urdu": [
                "ہر کام اپنے مقررہ وقت اور شرط کے ساتھ ہی حلال ہوتا ہے۔",
                "نیکی میں جلد بازی اچھی ہے مگر شرعی ترتیب کا لحاظ رکھنا ضروری ہے۔",
                "بیوی سے تعلق میں تاخیر سکھاتی ہے کہ صبر بندگی کا لازمی جزو ہے۔"
              ],
              "english": [
                "Everything becomes permissible only at its designated time and condition.",
                "Haste in goodness is virtuous, but respecting the Sharia-based order is essential.",
                "The delay in marital relations teaches that patience is an integral part of servitude."
              ]
            }
          }
        ]
      }
    }
  ]
}