{
  "hadithId": 630,
  "hadithNo": 24,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh-al-maram/6/50"
    ],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1727)، ومسلم (1301). واللفظ للبخاري، وفي رواية لمسلم أنه دعا للمحلقين ثلاثاً وللمقصرين مرة.",
    "urdu": "صحیح۔ اسے امام بخاری (1727) اور امام مسلم (1301) نے روایت کیا ہے۔ مسلم کی ایک روایت میں صراحت ہے کہ آپ ﷺ نے منڈانے والوں کے لیے تین بار اور کتروانے والوں کے لیے ایک بار دعا فرمائی۔",
    "english": "Sahih. Reported by Al-Bukhari (1727) and Muslim (1301). A narration in Muslim specifies that the Prophet (ﷺ) supplicated for those who shave three times and for those who clip once."
  },
  "importantWords": [
    {
      "arabic": "ارْحَمِ",
      "english": "Have mercy",
      "urdu": "رحم فرما"
    },
    {
      "arabic": "اَلْمُحَلِّقِينَ",
      "english": "Those who shave (heads)",
      "urdu": "سر منڈانے والے"
    },
    {
      "arabic": "اَلْمُقَصِّرِينَ",
      "english": "Those who shorten (hair)",
      "urdu": "بال کتروانے والے"
    },
    {
      "arabic": "اَلثَّالِثَةِ",
      "english": "The third time",
      "urdu": "تیسری بار"
    }
  ],
  "summary": {
    "urdu": "حج یا عمرہ کے بعد احرام سے نکلنے کے لیے سر منڈانا (حلق) بال کتروانے (قصر) سے افضل ہے، کیونکہ نبی ﷺ نے منڈانے والوں کے حق میں تکرار کے ساتھ رحمت کی دعا فرمائی۔",
    "english": "Shaving the head (Halq) is superior to shortening the hair (Qasr) after Hajj or Umrah, as the Prophet (ﷺ) repeatedly supplicated for mercy for those who shave."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1727)",
      "english": "Sahih al-Bukhari (1727)"
    },
    {
      "arabic": "صحيح مسلم (1301)",
      "english": "Sahih Muslim (1301)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حلق اور قصر کی شرعی حیثیت",
        "english": "Sharia Status of Halq and Qasr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منڈانے کی فضیلت",
              "english": "Virtue of Shaving"
            },
            "content": {
              "urdu": [
                "سر منڈانا (حلق) اللہ کے سامنے مکمل سپردگی اور عاجزی کی علامت ہے۔",
                "نبی ﷺ نے منڈانے والوں کے لیے تین بار رحمت کی دعا فرما کر اس کی برتری ثابت کر دی۔",
                "یہ عمل گناہوں سے پاک ہونے اور نئی روحانی زندگی کے آغاز کی علامت سمجھا جاتا ہے۔"
              ],
              "english": [
                "Shaving the head (Halq) symbolizes complete surrender and humility before Allah.",
                "The Prophet (ﷺ) established its superiority by supplicating for mercy three times for those who shave.",
                "This act is viewed as a sign of being cleansed of sins and starting a new spiritual life."
              ]
            }
          },
          {
            "title": {
              "urdu": "بال کتروانے کا جواز",
              "english": "Permissibility of Shortening"
            },
            "content": {
              "urdu": [
                "بال کتروانا (قصر) بھی شرعاً جائز ہے اور اس سے احرام کی پابندیاں ختم ہو جاتی ہیں۔",
                "اگر کسی نے حجِ تمتع کرنا ہو اور عمرے کے بعد بال کتروائے تاکہ حج کے لیے کچھ بال بچ جائیں، تو یہ بہتر حکمتِ عملی ہے۔",
                "تاہم، عام حالات میں مکمل منڈانا ہی سنتِ موکدہ اور افضل ہے۔"
              ],
              "english": [
                "Shortening the hair (Qasr) is also legally valid and ends the restrictions of Ihram.",
                "If one is performing Hajj al-Tamattu', clipping hair after Umrah to save length for Hajj is a sound strategy.",
                "However, under normal circumstances, a complete shave is the emphasized Sunnah and is superior."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کے لیے خصوصی حکم",
        "english": "Specific Ruling for Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صرف قصر کی اجازت",
              "english": "Only Qasr Permitted"
            },
            "content": {
              "urdu": [
                "خواتین کے لیے سر منڈانا حرام ہے؛ ان کے لیے صرف بال کتروانے کا حکم ہے۔",
                "انہیں اپنی مینڈھیوں یا بالوں کے سروں سے ایک پور (انگلی کے ایک جوڑ) کے برابر بال کاٹنے ہوتے ہیں۔",
                "یہ اسلام کی وہ خوبصورت تعلیم ہے جو عورت کی زینت اور فطرت کا لحاظ رکھتی ہے۔"
              ],
              "english": [
                "It is forbidden for women to shave their heads; they are commanded only to shorten their hair.",
                "They are required to cut a fingertip's length from the ends of their braids or hair.",
                "This reflects Islam's beautiful teachings that respect a woman's natural adornment and disposition."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاجزی کا پیکر",
              "english": "Embodiment of Humility"
            },
            "content": {
              "urdu": [
                "بال انسان کی زینت ہوتے ہیں، انہیں اللہ کی خاطر قربان کرنا نفس کی اصلاح کا ذریعہ ہے۔",
                "حاجی اپنے ظاہری حسن کو خیرباد کہہ کر مسکینی کی حالت میں اللہ کی رحمت کا طلبگار ہوتا ہے۔",
                "نبی ﷺ کی دعا کا مستحق بننا دنیا و آخرت کی سب سے بڑی دولت ہے۔"
              ],
              "english": [
                "Hair is an adornment for humans; sacrificing it for Allah serves to reform the ego.",
                "The pilgrim bids farewell to outward beauty, seeking Allah's mercy in a state of humbleness.",
                "Becoming worthy of the Prophet's (ﷺ) supplication is the greatest wealth in both worlds."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتباعِ سنت میں برکت",
              "english": "Blessing in Following Sunnah"
            },
            "content": {
              "urdu": [
                "صحابہ کا بار بار سوال کرنا اس بات کی دلیل ہے کہ وہ ہر طبقے کے لیے رحمت چاہتے تھے۔",
                "دین میں درجاتی فرق (افضل اور جائز) کو سمجھنا علمِ نافع کا حصہ ہے۔",
                "عبادت کو اسی طریقے سے انجام دینا چاہیے جس پر نبی ﷺ نے زیادہ خوشی کا اظہار فرمایا۔"
              ],
              "english": [
                "The repeated questioning by the Companions shows their desire for mercy for every category of pilgrim.",
                "Understanding the hierarchy of deeds (superior vs. permissible) is part of beneficial knowledge.",
                "Worship should be performed in the manner that brought the most joy to the Prophet (ﷺ)."
              ]
            }
          }
        ]
      }
    }
  ]
}