{
  "hadithId": 467,
  "hadithNo": 43,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3207"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (3207) ، وابن ماجه (1616) من حديث عائشة. وزيادة ابن ماجه (1617) 'في الإثم' من حديث أم سلمة فيها مقال، لكن المعنى صحيح عند أهل العلم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (3207) اور ابن ماجہ (1616) نے سیدہ عائشہ سے روایت کیا ہے۔ ابن ماجہ کی 'گناہ میں' والی زیادتی (1617) اگرچہ سنداً کمزور ہے مگر شرعی طور پر اس کا مفہوم درست تسلیم کیا گیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3207) and Ibn Majah (1616). The addition in Ibn Majah (1617) \"in sin\" is from Umm Salamah's narration; though its specific chain has weakness, its meaning is supported by scholars."
  },
  "importantWords": [
    {
      "arabic": "كَسْرُ",
      "english": "Breaking",
      "urdu": "توڑنا"
    },
    {
      "arabic": "عَظْمِ",
      "english": "Bone",
      "urdu": "ہڈی"
    },
    {
      "arabic": "الْمَيِّتِ",
      "english": "The Deceased",
      "urdu": "مردہ / میت"
    },
    {
      "arabic": "حَيًّا",
      "english": "Alive",
      "urdu": "زندہ"
    },
    {
      "arabic": "الإِثْمِ",
      "english": "Sin",
      "urdu": "گناہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں میت کی حرمت اور احترام کو واضح کیا گیا ہے کہ مرنے کے بعد بھی انسانی جسم کو تکلیف دینا یا اس کی بے حرمتی کرنا ویسا ہی سنگین گناہ ہے جیسا زندگی میں ہے۔",
    "english": "This Hadith emphasizes the sanctity of the deceased, stating that harming or disrespecting a dead body is as sinful as harming a living person."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3207)",
      "english": "Sunan Abu Dawud (3207)"
    },
    {
      "arabic": "سنن ابن ماجه (1616)",
      "english": "Sunan Ibn Majah (1616)"
    },
    {
      "arabic": "مشكاة المصابيح (1714)",
      "english": "Mishkat al-Masabih (1714)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "میت کی حرمت اور وقار",
        "english": "Sanctity and Dignity of the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردہ جسم کا احترام",
              "english": "Respect for the Dead Body"
            },
            "content": {
              "urdu": [
                "اسلام نے انسانی جسم کی حرمت کو صرف زندگی تک محدود نہیں رکھا۔",
                "مرنے کے بعد بھی انسان کی عزت اور اس کی حفاظت واجب ہے۔",
                "میت کی ہڈی توڑنا اس کی روح کو تکلیف پہنچانے کے مترادف ہے۔"
              ],
              "english": [
                "Islam does not limit human sanctity to life alone.",
                "Respect and protection of the human body remain obligatory after death.",
                "Breaking the bones of the deceased is akin to causing pain to their soul."
              ]
            }
          },
          {
            "title": {
              "urdu": "زندہ اور مردہ کا تقابل",
              "english": "Comparison of Living and Dead"
            },
            "content": {
              "urdu": [
                "جس طرح زندہ کو دکھ دینا حرام ہے، میت کو تکلیف دینا بھی حرام ہے۔",
                "اس تقابل کا مقصد گناہ کی سنگینی کو واضح کرنا ہے۔",
                "میت کے ساتھ برتاؤ میں انتہائی نرمی برتنے کی تاکید کی گئی ہے۔"
              ],
              "english": [
                "Just as hurting the living is forbidden, hurting the deceased is also haram.",
                "This comparison aims to clarify the severity of the sin involved.",
                "Extreme gentleness is emphasized when handling the deceased person."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور طبی احکام",
        "english": "Juristic and Medical Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پوسٹ مارٹم کا مسئلہ",
              "english": "The Issue of Post-mortem"
            },
            "content": {
              "urdu": [
                "بغیر کسی شرعی یا قانونی ضرورت کے میت کی چیر پھاڑ جائز نہیں۔",
                "اگر قتل کی تحقیق یا بیماری سے بچاؤ لازم ہو تو ضرورت کے تحت گنجائش ہے۔",
                "ضرورت کے وقت بھی میت کی بے حرمتی سے ہر ممکن بچنا چاہیے۔"
              ],
              "english": [
                "Dissecting the deceased without a legal or religious necessity is not allowed.",
                "If required for murder investigation or disease prevention, it is permitted.",
                "Even during necessity, one must avoid disrespecting the body as much as possible."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل اور تدفین میں نرمی",
              "english": "Gentleness in Ghusl and Burial"
            },
            "content": {
              "urdu": [
                "غسل دیتے وقت اعضاء کو سختی سے نہیں موڑنا چاہیے۔",
                "قبر میں اتارتے وقت بھی میت کے وقار کا خیال رکھنا ضروری ہے۔",
                "سنت طریقہ یہی ہے کہ میت کو پھول کی طرح نرمی سے سنبھالا جائے۔"
              ],
              "english": [
                "Limbs should not be bent forcefully while performing the ritual bath.",
                "It is essential to maintain dignity while lowering the body into the grave.",
                "The Sunnah method is to handle the deceased as gently as a flower."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اثرات",
        "english": "Spiritual Implications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برزخی احساسات",
              "english": "Feelings in the Barzakh"
            },
            "content": {
              "urdu": [
                "بعض احادیث کے مطابق میت اپنے ارد گرد کے ماحول کو محسوس کرتی ہے۔",
                "میت کو تکلیف دینے سے اس کی روح کو اذیت ہوتی ہے۔",
                "یہ حدیث ہمیں غیب کی زندگی کے احترام کا سبق دیتی ہے۔"
              ],
              "english": [
                "According to some Hadiths, the deceased sense their immediate surroundings.",
                "Hurting the body causes distress and pain to the soul of the departed.",
                "This Hadith teaches us to respect the unseen life after death."
              ]
            }
          },
          {
            "title": {
              "urdu": "مومن کی تکریم",
              "english": "Honoring the Believer"
            },
            "content": {
              "urdu": [
                "مومن کا خون اور مال جس طرح زندگی میں محترم ہے، مرنے کے بعد بھی ہے۔",
                "اللہ کے نزدیک مومن کی جان کی بہت زیادہ قیمت ہے۔",
                "انسانی جسم اللہ کی امانت ہے جس کی حفاظت مرنے کے بعد بھی لازم ہے۔"
              ],
              "english": [
                "A believer's blood and property are sacred in life and after death.",
                "In the sight of Allah, the life and dignity of a believer are precious.",
                "The human body is a trust from Allah, requiring protection even after death."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاموشی اور دعا",
              "english": "Silence and Supplication"
            },
            "content": {
              "urdu": [
                "میت کے پاس برائی کرنے یا اسے تکلیف پہنچانے سے گریز کریں۔",
                "ہمارا فرض ہے کہ ہم میت کے لیے صرف خیر اور مغفرت کی دعا کریں۔",
                "میت کی کمزوری کا فائدہ اٹھانا غیر اخلاقی اور گناہ کا کام ہے۔"
              ],
              "english": [
                "Avoid speaking ill or causing any harm near the deceased person.",
                "It is our duty to pray only for the goodness and forgiveness of the dead.",
                "Taking advantage of the deceased's helplessness is immoral and sinful."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کی جامعیت",
              "english": "Comprehensiveness of Islam"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلام کے نظامِ اخلاق کی کاملیت کو ظاہر کرتی ہے۔",
                "اسلام نے زندگی کے ہر مرحلے کے لیے حقوق مقرر کیے ہیں۔",
                "حقوق العباد کی ادائیگی موت کے بعد بھی ختم نہیں ہوتی۔"
              ],
              "english": [
                "This Hadith demonstrates the perfection of Islamic ethical systems.",
                "Islam has established rights for every single stage of human existence.",
                "Fulfilling the rights of people does not terminate with their death."
              ]
            }
          }
        ]
      }
    }
  ]
}