{
  "hadithId": 100,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 100"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": " صحيح.  رواه البخاري (879) ، ومسلم (846) ، وأبو داود (341) ، والنسائي (3/92) ، وابن ماجه (1089) ، وأحمد (3 /60) .  \"تنبيه\": وهم الحافظ رحمه الله في عزوه الحديث للترمذي.",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (879)، مسلم (846)، ابو داؤد (341)، نسائی (3/92)، ابن ماجہ (1089)، اور احمد (3/60) نے روایت کیا ہے۔ \"تنبیہ\": حافظ (ابن حجر) سے اس حدیث کو ترمذی کی طرف منسوب کرنے میں غلطی ہوئی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (879), Muslim (846), Abu Dawud (341), An-Nasa'i (3/92), Ibn Majah (1089), and Ahmad (3/60). 'Note': The Hafiz (Ibn Hajar) was mistaken in attributing the Hadith to At-Tirmidhi."
  },
  "importantWords": [
    {
      "arabic": "غُسْلُ اَلْجُمُعَةِ",
      "english": "Ghusl of Friday",
      "urdu": "جمعہ کا غسل"
    },
    {
      "arabic": "وَاجِبٌ",
      "english": "Obligatory/Necessary",
      "urdu": "واجب ہے"
    },
    {
      "arabic": "كُلِّ",
      "english": "Every",
      "urdu": "ہر ایک"
    },
    {
      "arabic": "مُحْتَلِمٍ",
      "english": "Mature (reached puberty)",
      "urdu": "بالغ"
    },
    {
      "arabic": "اَلْأَفْضَل",
      "english": "The best/superior",
      "urdu": "افضل"
    },
    {
      "arabic": "فَضِيلَة",
      "english": "Virtue/merit",
      "urdu": "فضیلت"
    },
    {
      "arabic": "اَلصَّحِيح",
      "english": "The authentic (ruling)",
      "urdu": "صحیح حکم"
    },
    {
      "arabic": "نَاسِخ",
      "english": "Abrogator (ruling)",
      "urdu": "ناسخ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث جمعہ کے روز غسل کرنے کو ہر بالغ مسلمان پر \"واجب\" قرار دیتی ہے، اگرچہ فقہاء نے اس حکم کو بعد کی روایات کی بنا پر **سنت مؤکدہ** قرار دیا ہے جس کی بہت تاکید کی گئی ہے۔",
    "english": "This Hadith states that Ghusl on Friday is **obligatory** upon every mature Muslim. However, jurists generally classify this ruling as a highly emphasized Sunnah (Sunnah Mu'akkadah) based on later narrations."
  },
  "references": [
    {
      "arabic": "أخرجه البخاري (879)",
      "english": "Reported by Al-Bukhari (879)"
    },
    {
      "arabic": "أخرجه مسلم (846)",
      "english": "Reported by Muslim (846)"
    },
    {
      "arabic": "أخرجه أبو داود (341)",
      "english": "Reported by Abu Dawud (341)"
    },
    {
      "arabic": "أخرجه النسائي (3/92)",
      "english": "Reported by An-Nasa'i (3/92)"
    },
    {
      "arabic": "أخرجه ابن ماجه (1089)",
      "english": "Reported by Ibn Majah (1089)"
    },
    {
      "arabic": "أخرجه أحمد (3 /60)",
      "english": "Reported by Ahmad (3/60)"
    }
  ],
  "narrators": [
    {
      "id": 10001,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کے غسل کا فقہی درجہ",
        "english": "The Juristic Status of Friday Ghusl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "واجب اور سنت مؤکدہ میں اختلاف",
              "english": "Difference between Obligatory and Emphasized Sunnah"
            },
            "content": {
              "urdu": [
                "اس حدیث میں \"واجب\" کا لفظ موجود ہے، جس کی وجہ سے بعض علماء نے غسل جمعہ کو فرض یا واجب قرار دیا ہے۔",
                "لیکن جمہور علماء اسے **سنت مؤکدہ** قرار دیتے ہیں، کیونکہ دیگر صحیح احادیث میں اس کے متبادل (وضو یا معمولی طہارت) کا ذکر ہے۔",
                "نبی ﷺ نے فرمایا: \"جس نے وضو کیا، اچھی بات، اور جس نے غسل کیا، وہ افضل ہے\"، جو وجوب کی نفی کرتا ہے۔"
              ],
              "english": [
                "The word 'Wajib' (obligatory) in this Hadith led some scholars to consider Friday Ghusl Fardh or Wajib.",
                "However, the majority of scholars classify it as **Sunnah Mu'akkadah** due to other authentic narrations mentioning alternatives (Wudu' or simple cleansing).",
                "The Prophet ﷺ said: 'Whoever performs Wudu', that is good, but whoever performs Ghusl, that is better,' which negates strict obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "وجوب کا معنی",
              "english": "The Meaning of 'Wajib' in this Context"
            },
            "content": {
              "urdu": [
                "بعض علماء کے نزدیک اس حدیث میں 'واجب' کا لفظ 'مؤکدہ سنت' یا 'بڑے زور کا حکم' کے معنی میں استعمال ہوا ہے۔",
                "واجب کا یہاں معنی ہے کہ یہ اتنا ضروری ہے کہ اس کو چھوڑنا ناپسندیدہ اور ترک کرنے والے کو سخت ملامت ہو گی۔",
                "اسلام میں اجتماعیت کی اہمیت کے پیش نظر، یہ حکم صفائی کو اجتماعی ذمہ داری قرار دیتا ہے۔"
              ],
              "english": [
                "According to some scholars, the word 'Wajib' here is used in the sense of an 'emphasized Sunnah' or a 'highly stressed command'.",
                "Here, 'Wajib' means it is so important that neglecting it is disliked, and the one who leaves it will be strongly rebuked.",
                "Given the importance of congregational gathering in Islam, this ruling makes cleanliness a collective responsibility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت جمعہ کی فضیلت اور حکمت",
        "english": "Virtue and Wisdom of the Friday Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سماجی ضرورت",
              "english": "Social Necessity"
            },
            "content": {
              "urdu": [
                "جمعہ کا غسل مدینہ میں مسلمانوں کے بڑے اجتماع کے لیے تھا جہاں لوگ محنت مزدوری کے بعد آتے تھے۔",
                "اس کا مقصد بدبو اور پسینہ کی ناگوار مہک سے بچنا تھا تاکہ کسی نمازی کو تکلیف نہ ہو۔",
                "طہارت اور اچھی بو کا اہتمام کرنا اسلامی معاشرت کا ایک اہم آداب اور حق ہے۔"
              ],
              "english": [
                "The Friday Ghusl was instituted for the large congregational gathering in Madinah, where people often came after physical labor.",
                "Its purpose was to prevent unpleasant odors from sweat and dirt so that no worshipper would be bothered.",
                "Maintaining purity and using pleasant scents is a significant etiquette and right in the Islamic community."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجر و ثواب میں اضافہ",
              "english": "Increase in Reward"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے جمعہ کے دن غسل کرنے اور جلدی مسجد جانے پر بہت بڑا ثواب اور اونٹ کی قربانی جیسا اجر دینے کا وعدہ فرمایا۔",
                "یہ حکم مسلمانوں کو نیک اعمال کی طرف راغب کرنے اور انہیں فضیلت حاصل کرنے کی ترغیب دیتا ہے۔",
                "ہر بالغ پر حکم اس لیے ہے تاکہ تمام جماعت ایک ہی طرح کی صفائی کے ساتھ جمع ہو۔"
              ],
              "english": [
                "The Prophet ﷺ promised a great reward, comparable to sacrificing a camel, for performing Ghusl and going early to the mosque on Friday.",
                "This ruling motivates Muslims toward good deeds and encourages them to achieve spiritual merit.",
                "The command being for every mature person ensures that the entire congregation gathers with a uniform standard of cleanliness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اطلاق کا دائرہ",
        "english": "Scope of Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بالغ پر غسل کا وجوب",
              "english": "Ghusl Obligatory on the Mature"
            },
            "content": {
              "urdu": [
                "حدیث میں 'محْتَلِم' (بالغ) کی شرط یہ واضح کرتی ہے کہ یہ حکم صرف بالغ مردوں پر ہی لاگو ہوتا ہے۔",
                "عورتوں پر جمعہ کا غسل لازم نہیں، البتہ اگر وہ نماز جمعہ کے لیے مسجد جانا چاہیں تو غسل کر سکتی ہیں، جو مستحب ہے۔",
                "بچوں اور نابالغوں پر بھی یہ غسل واجب نہیں ہوتا، لیکن انہیں بھی عادت ڈالنے کے لیے صفائی کروانی چاہیے۔"
              ],
              "english": [
                "The condition of being 'Muhtalim' (mature) in the Hadith clarifies that this ruling primarily applies to adult men.",
                "Ghusl is not mandatory for women on Friday, although it is recommended if they wish to attend the Jumu'ah prayer at the mosque.",
                "This bath is not obligatory for children and minors, but they should be encouraged to clean themselves to form good habits."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل کا وقت",
              "english": "Time for Ghusl"
            },
            "content": {
              "urdu": [
                "غسل جمعہ کا افضل وقت طلوع فجر سے لے کر نماز جمعہ کے لیے روانگی سے قبل تک ہے، تاکہ طہارت تازہ رہے۔",
                "زیادہ تر فقہاء کے نزدیک غسل نماز جمعہ سے پہلے ہونا ضروری ہے، تاکہ اسے نماز کے لیے صفائی کا ذریعہ بنایا جا سکے۔",
                "جمعہ کے روز صرف غسل کرنا ہی عبادت نہیں، بلکہ دیگر سنتوں، جیسے مسواک اور خوشبو کا استعمال، کو بھی شامل کرنا چاہیے۔"
              ],
              "english": [
                "The preferable time for Friday Ghusl is from Fajr (dawn) until just before setting out for Jumu'ah prayer, ensuring freshness.",
                "According to most jurists, the Ghusl must take place before the Jumu'ah prayer so that it serves its purpose of cleansing for the prayer.",
                "Performing Ghusl alone is not the only act of worship on Friday; it should be combined with other Sunnahs like using the Miswak and perfume."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی سند اور اصول",
        "english": "Narration Chain (Isnad) and Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "متفق علیہ کی صحت",
              "english": "Authenticity of Muttafaqun 'alayhi"
            },
            "content": {
              "urdu": [
                "یہ حدیث بخاری اور مسلم دونوں میں موجود ہے، اس لیے اس کا حکم اپنی سند کے لحاظ سے قطعی طور پر صحیح ہے۔",
                "ساتوں محدثین (السبعۃ) سے روایت ہونے کے باوجود، اس کے وجوب کے معنی پر اختلاف ہے۔",
                "نبی اکرم ﷺ کے قول میں وجوب کا لفظ بہت مضبوط دلیل ہے، لیکن دوسرے صحیح اقوال اس کو سنت کی طرف پھیرتے ہیں۔"
              ],
              "english": [
                "This Hadith is found in both Al-Bukhari and Muslim, making its ruling absolutely authentic in terms of its chain of narration.",
                "Despite being narrated by the Seven compilers (As-Sab'ah), there is a difference of opinion regarding the meaning of its obligation.",
                "The word 'Wajib' in the Prophet's saying is very strong evidence, but other authentic statements interpret it as Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہمیت اور عمل",
              "english": "Importance and Practice"
            },
            "content": {
              "urdu": [
                "کسی بھی صورت میں، غسل جمعہ کو ترک کرنا ایک ایسی فضیلت سے محرومی ہے جس کا بڑا اجر ہے۔",
                "علماء کی اکثر رائے کے مطابق، اگر کوئی بغیر غسل کے نماز جمعہ پڑھ لے تو اس کی نماز درست ہو گی، مگر وہ ثواب سے محروم رہا۔",
                "مسلمان کو چاہیے کہ وہ غسل جمعہ کو اپنی ایک مستحکم عادت بنا لے تاکہ اللہ کے احکامات میں سستی نہ ہو۔"
              ],
              "english": [
                "In any case, neglecting the Friday Ghusl results in the loss of a great virtue that carries a huge reward.",
                "According to the majority of scholars, if someone prays Jumu'ah without Ghusl, their prayer is valid, but they lose the potential reward.",
                "A Muslim should establish the Friday Ghusl as a consistent habit to avoid negligence in Allah's commands."
              ]
            }
          }
        ]
      }
    }
  ]
}
