{
  "hadithId": 443,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/ibnmajah:1465"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },

  "takhreej": {
    "arabic": "صحيح. رواه أحمد (6/228) ، وابن ماجه (1465) ، وصححه ابن حبان (3029) والحاكم. وأصله في البخاري تعليقاً. والحديث حجة في جواز غسل الرجل زوجته.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد (6/228) اور ابن ماجہ (1465) نے روایت کیا ہے، اور ابن حبان (3029) اور حاکم نے اسے صحیح قرار دیا ہے۔ یہ حدیث اس بات کی دلیل ہے کہ شوہر اپنی بیوی کو غسل دے سکتا ہے۔",
    "english": "Sahih. Reported by Ahmad (6/228), Ibn Majah (1465), and graded Sahih by Ibn Hibban (3029) and Al-Hakim. It serves as primary evidence for a husband being permitted to wash his deceased wife."
  },
  "importantWords": [
    {
      "arabic": "لَوْ",
      "english": "If",
      "urdu": "اگر"
    },
    {
      "arabic": "مُتِّ",
      "english": "You die",
      "urdu": "تم فوت ہو جاؤ"
    },
    {
      "arabic": "قَبْلِي",
      "english": "Before me",
      "urdu": "مجھ سے پہلے"
    },
    {
      "arabic": "فَغَسَّلْتُكِ",
      "english": "I would wash you",
      "urdu": "تو میں تمہیں غسل دوں گا"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "Authenticated it",
      "urdu": "اسے صحیح قرار دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ میاں بیوی ایک دوسرے کو غسل دے سکتے ہیں، کیونکہ موت سے نکاح کا رشتہ مکمل طور پر ختم نہیں ہوتا۔",
    "english": "This Hadith establishes that it is permissible for spouses to wash each other after death, as the marital bond remains respected even after passing."
  },
  "references": [
    {
      "arabic": "سنن ابن ماجه (1465)",
      "english": "Sunan Ibn Majah (1465)"
    },
    {
      "arabic": "مسند أحمد (25908)",
      "english": "Musnad Ahmad (25908)"
    },
    {
      "arabic": "صحيح ابن حبان (3029)",
      "english": "Sahih Ibn Hibban (3029)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYJvB0_V_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شرعی مسئلہ اور نکاح کا اثر",
        "english": "Legal Ruling and Marital Bond"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شوہر کا بیوی کو غسل دینا",
              "english": "Husband Washing the Wife"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک شوہر اپنی وفات یافتہ بیوی کو غسل دے سکتا ہے۔",
                "نبی کریم ﷺ کا یہ فرمان اس مسئلے میں نص اور واضح دلیل ہے۔",
                "سیدنا ابوبکر صدیق رضی اللہ عنہ کو بھی ان کی اہلیہ نے غسل دیا تھا۔"
              ],
              "english": [
                "The majority of jurists permit a husband to wash his deceased wife.",
                "This statement of the Prophet (ﷺ) is a clear and direct evidence.",
                "Abu Bakr (RA) was also washed by his wife, Asma bint Umays."
              ]
            }
          },
          {
            "title": {
              "urdu": "نکاح کا رشتہ",
              "english": "The Marital Relationship"
            },
            "content": {
              "urdu": [
                "موت کے بعد بھی میاں بیوی کی حرمت اور تعلق برقرار رہتا ہے۔",
                "ستر اور حجاب کے احکامات میں زوجین کے لیے رعایت موجود ہے۔",
                "یہ عمل میت کے لیے آخری ہمدردی اور تکریم کا اظہار ہے۔"
              ],
              "english": [
                "The sanctity and bond between spouses continue even after death.",
                "There is a legal concession regarding privacy (Satr) for spouses.",
                "This act is an expression of final compassion and respect for the dead."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اہلِ بیت اور صحابہ کا عمل",
        "english": "Practice of the Prophet's Family"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدہ فاطمہ کا غسل",
              "english": "The Washing of Lady Fatima"
            },
            "content": {
              "urdu": [
                "سیدہ فاطمہ رضی اللہ عنہا کو سیدنا علی رضی اللہ عنہ نے غسل دیا تھا۔",
                "یہ عمل صحابہ کرام کے درمیان مشہور تھا اور کسی نے اعتراض نہیں کیا۔",
                "اس سے ثابت ہوتا ہے کہ یہ سنت اور پسندیدہ طریقہ رہا ہے۔"
              ],
              "english": [
                "Lady Fatima (RA) was washed by her husband, Ali (RA).",
                "This practice was known among the companions without any objection.",
                "It proves that this method has been established and preferred."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب کی آراء",
              "english": "Views of Juristic Schools"
            },
            "content": {
              "urdu": [
                "امام شافعی، امام احمد اور امام مالک اس کے جواز کے قائل ہیں۔",
                "امام ابوحنیفہ کے نزدیک صرف عورت شوہر کو غسل دے سکتی ہے۔",
                "احادیثِ صحیحہ کی روشنی میں دونوں کا ایک دوسرے کو غسل دینا درست ہے۔"
              ],
              "english": [
                "Imams Shafi'i, Ahmad, and Malik all permit this practice.",
                "Imam Abu Hanifa views that only the wife can wash the husband.",
                "In light of Sahih Hadiths, both are correctly allowed to wash each other."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محبت اور ہمدردی کا پہلو",
        "english": "Aspect of Love and Compassion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ازواج کے درمیان تعلق",
              "english": "Relationship Between Spouses"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا سیدہ عائشہ سے یہ فرمانا گہری محبت کا اظہار ہے۔",
                "یہ جملہ دکھ کی گھڑی میں تسلی اور ہمدردی فراہم کرتا ہے۔",
                "نبی کریم ﷺ اپنے اہل خانہ کا بہت زیادہ خیال رکھتے تھے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) words to Aisha reflect deep affection and care.",
                "This statement provides comfort and sympathy during moments of grief.",
                "The Prophet (ﷺ) was exceptionally mindful and caring towards his family."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی وقار",
              "english": "Family Dignity"
            },
            "content": {
              "urdu": [
                "قریبی رشتہ داروں کا غسل دینا میت کے لیے باعثِ راحت ہے۔",
                "اس سے میت کی نجی معلومات اور جسمانی حالت پوشیدہ رہتی ہے۔",
                "اسلام نے پردہ پوشی اور خاندان کی رازداری پر زور دیا ہے۔"
              ],
              "english": [
                "Washing by close relatives is more comforting for the deceased.",
                "It ensures that private information and physical states remain hidden.",
                "Islam emphasizes maintaining the privacy and secrets of the family."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موت کی تیاری",
              "english": "Preparation for Death"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے باتوں باتوں میں موت کی یاد دہانی کرائی۔",
                "مومن کو ہر وقت اپنی اور اپنوں کی موت کے لیے تیار رہنا چاہیے۔",
                "موت کا تذکرہ زندگی میں اعتدال اور توبہ کا سبب بنتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) reminded of death even in casual conversation.",
                "A believer should always be prepared for their own or loved ones' end.",
                "Mentioning death leads to moderation in life and sincere repentance."
              ]
            }
          },
          {
            "title": {
              "urdu": "احکامِ شرعیہ کی اہمیت",
              "english": "Importance of Shariah Rulings"
            },
            "content": {
              "urdu": [
                "زندگی کے ہر موڑ پر سنتِ نبوی ﷺ سے رہنمائی لینی چاہیے۔",
                "تجہیزی معاملات میں جذبات کے بجائے احکامِ دین پر عمل ضروری ہے۔",
                "نبی ﷺ کی زندگی ہمارے لیے ہر شعبے میں کامل نمونہ ہے۔"
              ],
              "english": [
                "One must seek guidance from the Sunnah at every stage of life.",
                "In funeral matters, religious rulings take priority over emotions.",
                "The life of the Prophet (ﷺ) is a perfect model in every sphere."
              ]
            }
          }
        ]
      }
    }
  ]
}