{
  "hadithId": 761,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/761"],
    "kitabId": 7,
    "inKitabBab": 13,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 54
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2258). القصة تتعلق ببيع أبي رافع بيته لسعد بن أبي وقاص رضي الله عنهما، حيث عرض عليه البيت أولاً عملاً بهذا الحديث.",
    "urdu": "صحیح۔ اسے امام بخاری (2258) نے روایت کیا ہے۔ اس قصے میں مذکور ہے کہ ابورافع رضی اللہ عنہ نے اپنا گھر سعد بن ابی وقاص رضی اللہ عنہ کو فروخت کرنے کی پیشکش کی کیونکہ وہ ان کے پڑوسی تھے۔",
    "english": "Sahih. Reported by Al-Bukhari (2258). The mentioned story involves Abu Rafi offering to sell his house to Sa'd bin Abi Waqqas (RA) first, honoring the Prophet's (ﷺ) teaching on neighborly rights."
  },
  "importantWords": [
    {
      "arabic": "اَلْجَارُ",
      "english": "The Neighbor",
      "urdu": "ہمسایہ"
    },
    {
      "arabic": "أَحَقُّ",
      "english": "More deserving / Has more right",
      "urdu": "زیادہ حقدار"
    },
    {
      "arabic": "بِصَقَبِهِ",
      "english": "Nearness / Adjacency",
      "urdu": "اپنے قریب ہونا"
    },
    {
      "arabic": "قِصَّةٌ",
      "english": "Story / Incident",
      "urdu": "واقعہ / قصہ"
    },
    {
      "arabic": "ابْتَعْ",
      "english": "Buy / Purchase",
      "urdu": "خرید لو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ جائیداد کی فروخت میں پڑوسی کو ترجیح دینا مستحب اور اخلاقی طور پر ضروری ہے، تاکہ پڑوسیوں کے مابین تعلقات بہتر رہیں اور اجنبیوں کی وجہ سے تکلیف نہ ہو۔",
    "english": "This Hadith establishes that a neighbor has a preferential right to purchase adjacent property, emphasizing neighborly bonds and minimizing potential harm from strangers."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2258)",
      "english": "Reported by Al-Bukhari (2258)"
    },
    {
      "arabic": "فتح الباري (4/436)",
      "english": "Fath al-Bari (4/436)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو رافع",
        "english": "Abu Rafi'"
      },
      "slug": "abu-rafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر اور قصہ",
        "english": "Background and Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابورافع اور سعد بن ابی وقاص کا واقعہ",
              "english": "Incident of Abu Rafi and Sa'd"
            },
            "content": {
              "urdu": [
                "ابورافع رضی اللہ عنہ اپنا گھر بیچنا چاہتے تھے اور انہوں نے سعد بن ابی وقاص کو پیشکش کی۔",
                "سعد رضی اللہ عنہ کم قیمت لگا رہے تھے مگر ابورافع نے نبوی فرمان کی وجہ سے انہیں ترجیح دی۔",
                "انہوں نے فرمایا کہ اگر میں نے نبی ﷺ سے یہ نہ سنا ہوتا تو میں تمہیں اتنی کم قیمت پر نہ دیتا۔"
              ],
              "english": [
                "Abu Rafi (RA) wanted to sell his house and offered it to Sa'd bin Abi Waqqas (RA) first.",
                "Although Sa'd offered a lower price, Abu Rafi prioritized him due to the Prophet's instruction.",
                "He stated that he wouldn't have sold it so cheaply if not for the rights of the neighbor."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہمسائے کے حقوق کی پاسداری",
              "english": "Upholding Neighborly Rights"
            },
            "content": {
              "urdu": [
                "صحابہ کرام رضی اللہ عنہم ان احکامات پر سختی سے عمل پیرا تھے۔",
                "معمولی مالی فائدے پر نبوی اخلاقیات کو ترجیح دی جاتی تھی۔",
                "یہ عمل معاشرے میں باہمی محبت اور ایثار کو فروغ دینے کا باعث تھا۔"
              ],
              "english": [
                "The Sahaba were strictly committed to acting upon these Prophetic instructions.",
                "They prioritized Prophetic ethics over minor financial gains or higher market offers.",
                "This practice promoted mutual love and selflessness within the Muslim community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی نقطہ نظر: پڑوسی کا شفعہ",
        "english": "Juristic View: Pre-emption for Neighbors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کیا پڑوسی کے لیے شفعہ واجب ہے؟",
              "english": "Is Shuf'a Mandatory for Neighbors?"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک دیوار بہ دیوار پڑوسی کو حقِ شفعہ حاصل ہے چاہے وہ شریک نہ ہو۔",
                "جمہور فقہاء کے نزدیک شفعہ صرف اس صورت میں ہے جب جائیداد تقسیم نہ ہوئی ہو۔",
                "یہ حدیث احناف کی ایک بڑی دلیل ہے کہ پڑوسی کو ترجیح ملنی چاہیے۔"
              ],
              "english": [
                "According to Hanafis, an adjacent neighbor has the right of pre-emption even if not a partner.",
                "The majority of jurists limit Shuf'a only to cases where the property remains undivided.",
                "This Hadith serves as a primary evidence for those who grant pre-emption rights to neighbors."
              ]
            }
          },
          {
            "title": {
              "urdu": "صقب (قربت) کی وضاحت",
              "english": "Explanation of Saqb (Proximity)"
            },
            "content": {
              "urdu": [
                "لفظ 'صقب' کا مطلب بالکل ساتھ جڑا ہوا یا قریب ہونا ہے۔",
                "اس سے مراد وہ جائیداد ہے جو ایک دوسرے کے ساتھ پیوست ہو۔",
                "قریبی پڑوسی کا حق دور والے پڑوسی سے زیادہ مقدم ہوتا ہے۔"
              ],
              "english": [
                "The word 'Saqb' refers to being closely adjacent or directly connected.",
                "It signifies properties that share common boundaries or are very close.",
                "The right of a closer neighbor takes precedence over one who is further away."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد اور حکمت",
        "english": "Social Benefits and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرر اور تکلیف کا ازالہ",
              "english": "Removal of Harm and Hardship"
            },
            "content": {
              "urdu": [
                "نیا خریدار اگر نامناسب ہو تو پرانے پڑوسی کو ذہنی تکلیف ہو سکتی ہے۔",
                "پڑوسی کو موقع دینے سے جائیداد کے استعمال میں ہم آہنگی رہتی ہے۔",
                "اسلامی قانون کا بنیادی مقصد ہی لوگوں سے تکلیف کو دور کرنا ہے۔"
              ],
              "english": [
                "If a new buyer is incompatible, it can cause mental distress to the existing neighbor.",
                "Giving the neighbor a chance to buy ensures harmony in property usage.",
                "The fundamental goal of Islamic law is to eliminate hardship from people's lives."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی حسنِ سلوک",
              "english": "Mutual Excellence in Conduct"
            },
            "content": {
              "urdu": [
                "پڑوسی کو مطلع کرنا اور اسے ترجیح دینا حسنِ اخلاق کی نشانی ہے۔",
                "اس سے پڑوسیوں کے درمیان اعتماد کی فضا قائم ہوتی ہے۔",
                "یہ قانون جائیداد کے معاملات میں حسد اور لڑائی جھگڑے کو روکتا ہے۔"
              ],
              "english": [
                "Informing and prioritizing the neighbor is a mark of excellent character.",
                "It builds an atmosphere of trust and reliability between neighbors.",
                "This law prevents envy and disputes in property-related transactions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیچنے سے قبل اطلاع دینا",
              "english": "Informing Before Selling"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ گھر یا زمین بیچتے وقت پہلے پڑوسی سے مشورہ کرے۔",
                "اگر پڑوسی ضرورت مند ہو تو اسے خریدنے کا موقع فراہم کرنا چاہیے۔",
                "خفیہ طور پر اجنبی کو فروخت کرنا اخلاقی طور پر ناپسندیدہ ہے۔"
              ],
              "english": [
                "A Muslim should consult their neighbor before selling a house or land.",
                "If the neighbor is in need, they should be given the first opportunity to buy.",
                "Selling secretly to a stranger is considered ethically undesirable."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیمت میں نرمی",
              "english": "Leniency in Price"
            },
            "content": {
              "urdu": [
                "جیسا کہ ابورافع رضی اللہ عنہ نے کیا، پڑوسی کے لیے قیمت میں کچھ رعایت کرنا مستحب ہے۔",
                "یہ صدقہ اور خیر خواہی کے زمرے میں آتا ہے۔",
                "معاملات میں نرمی اللہ کی رحمت کے حصول کا ذریعہ ہے۔"
              ],
              "english": [
                "As Abu Rafi (RA) did, it is recommended to be lenient in price for a neighbor.",
                "Such an act falls under the category of charity and goodwill.",
                "Leniency in business dealings is a means of attaining Allah's mercy."
              ]
            }
          }
        ]
      }
    }
  ]
}