{
  "hadithId": 557,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/557"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 34
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5195)، ومسلم (1026)، وأبو داود (2458).",
    "urdu": "صحیح۔ اسے بخاری (5195) اور مسلم (1026) نے روایت کیا ہے۔ ابوداؤد (2458) کی روایت میں 'غیر رمضان' کی صراحت موجود ہے جو کہ سنداً صحیح ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (5195), Muslim (1026), and Abu Dawud (2458). The addition in Abu Dawud's version is also authentic."
  },
  "importantWords": [
    {
      "arabic": "لَا يَحِلُّ",
      "english": "It is not lawful",
      "urdu": "حلال نہیں / جائز نہیں"
    },
    {
      "arabic": "شَاهِدٌ",
      "english": "Present",
      "urdu": "موجود / گھر میں"
    },
    {
      "arabic": "إِذْنِهِ",
      "english": "His permission",
      "urdu": "اس کی اجازت"
    },
    {
      "arabic": "غَيْرَ",
      "english": "Other than / Except",
      "urdu": "سواۓ / علاوہ"
    },
    {
      "arabic": "تَصُومَ",
      "english": "To fast",
      "urdu": "روزہ رکھے"
    }
  ],
  "summary": {
    "urdu": "شادی شدہ خاتون کے لیے ضروری ہے کہ وہ اپنے شوہر کی موجودگی میں نفلی روزہ رکھنے سے پہلے اس سے اجازت لے۔ البتہ رمضان کے فرض روزوں کے لیے اجازت کی ضرورت نہیں۔",
    "english": "It is mandatory for a married woman to seek her husband's permission for voluntary fasts if he is present. However, this does not apply to the obligatory fasts of Ramadan."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5195)",
      "english": "Reported by Al-Bukhari (5195)"
    },
    {
      "arabic": "رواه مسلم (1026)",
      "english": "Reported by Muslim (1026)"
    },
    {
      "arabic": "رواه أبو داود (2458)",
      "english": "Reported by Abu Dawud (2458)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqS79vOqX-A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شوہر کے حقوق اور نفلی عبادت",
        "english": "Rights of the Husband and Voluntary Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجازت کی اہمیت",
              "english": "Importance of Permission"
            },
            "content": {
              "urdu": [
                "شوہر کے حقوق کی ادائیگی ایک عورت کے لیے نفلی عبادت سے زیادہ مقدم ہے۔",
                "نفلی روزہ شوہر کی جنسی یا گھریلو ضروریات میں رکاوٹ بن سکتا ہے۔",
                "اسلامی معاشرت میں میاں بیوی کے درمیان ہم آہنگی اور حقوق کا تحفظ بنیادی اصول ہے۔"
              ],
              "english": [
                "Fulfilling the husband's rights takes precedence over voluntary acts of worship for a wife.",
                "Voluntary fasting might interfere with the husband's physical or domestic needs.",
                "Harmony and protection of rights between spouses are fundamental principles in Islamic society."
              ]
            }
          },
          {
            "title": {
              "urdu": "شوہر کی موجودگی کی شرط",
              "english": "Condition of the Husband's Presence"
            },
            "content": {
              "urdu": [
                "حدیث میں 'شاہد' (موجود) کی قید سے معلوم ہوتا ہے کہ اگر شوہر سفر پر ہو تو اجازت ضروری نہیں۔",
                "اگر شوہر گھر پر موجود ہے تو اس کی رضا مندی حاصل کرنا واجب ہے۔",
                "یہ حکم صرف ان حالات کے لیے ہے جہاں شوہر کو بیوی کی رفاقت کی ضرورت ہو سکتی ہے۔"
              ],
              "english": [
                "The term 'Shahid' (present) implies that permission is not required if the husband is traveling.",
                "If the husband is present at home, obtaining his consent becomes obligatory.",
                "This ruling applies to situations where the husband may require his wife's companionship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فرض اور نفل روزوں میں فرق",
        "english": "Difference Between Obligatory and Voluntary Fasts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمضان کے روزے",
              "english": "Fasts of Ramadan"
            },
            "content": {
              "urdu": [
                "رمضان کے فرض روزوں کے لیے کسی انسان (شوہر) کی اجازت کی ضرورت نہیں ہے۔",
                "خالق کی اطاعت مخلوق کی اطاعت پر مقدم ہے جب بات فرض عبادت کی ہو۔",
                "ابوداؤد کی روایت میں 'غیر رمضان' کا لفظ اسی فرق کو واضح کرتا ہے۔"
              ],
              "english": [
                "No human permission, including a husband's, is needed for the obligatory fasts of Ramadan.",
                "Obedience to the Creator takes precedence over obedience to creation regarding mandatory worship.",
                "The phrase 'other than Ramadan' in Abu Dawud's narration clarifies this distinction."
              ]
            }
          },
          {
            "title": {
              "urdu": "قضا روزوں کا حکم",
              "english": "Ruling on Make-up (Qada) Fasts"
            },
            "content": {
              "urdu": [
                "قضا روزوں کے لیے بھی اگر وقت کشادہ ہو تو شوہر کی اجازت لینا بہتر ہے۔",
                "سیدہ عائشہ رضی اللہ عنہا اپنے قضا روزے شعبان تک موخر کرتی تھیں تاکہ نبی ﷺ کی رفاقت متاثر نہ ہو۔",
                "اگر رمضان قریب آ جائے تو قضا روزے رکھنا واجب ہو جاتا ہے اور پھر اجازت ضروری نہیں رہتی۔"
              ],
              "english": [
                "It is better to seek permission for Qada fasts if there is plenty of time before the next Ramadan.",
                "Aisha (RA) used to delay her Qada fasts until Sha'ban out of consideration for the Prophet (ﷺ).",
                "If the next Ramadan is imminent, Qada fasts become a priority and permission is no longer required."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گھریلو نظم و ضبط اور تربیت",
        "english": "Domestic Discipline and Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی مشاورت",
              "english": "Mutual Consultation"
            },
            "content": {
              "urdu": [
                "میاں بیوی کو چاہیے کہ وہ عبادات اور دیگر معاملات میں ایک دوسرے کو اعتماد میں لیں۔",
                "شوہر کو بھی چاہیے کہ وہ نیکی کے کاموں میں بیوی کی حوصلہ افزائی کرے اور بلاوجہ نہ روکے۔",
                "اجازت مانگنا عاجزی اور محبت کی علامت ہے جو ازدواجی تعلق کو مضبوط کرتا ہے۔"
              ],
              "english": [
                "Spouses should take each other into confidence regarding worship and other matters.",
                "Husbands should encourage their wives in good deeds and not prevent them without a valid reason.",
                "Seeking permission is a sign of humility and love that strengthens the marital bond."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترجیحات کا تعین",
              "english": "Setting Priorities"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں سکھاتا ہے کہ فرائض پہلے ہیں اور نوافل بعد میں۔",
                "خاندان کی خدمت اور شوہر کا سکون بھی ایک طرح کی عبادت ہے۔",
                "ایک نیک عورت وہی ہے جو اللہ کی بندگی اور گھر کی ذمہ داریوں میں توازن رکھے۔"
              ],
              "english": [
                "Islam teaches us that obligatory duties come before voluntary ones.",
                "Serving the family and providing peace for the husband is also a form of worship.",
                "A righteous woman balances her devotion to Allah with her domestic responsibilities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور خلاصہ",
        "english": "Juristic Aspects and Summary"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خلاف ورزی کا اثر",
              "english": "Effect of Violation"
            },
            "content": {
              "urdu": [
                "اگر عورت نے بلا اجازت نفلی روزہ رکھ لیا تو شوہر کو حق ہے کہ وہ اسے روزہ توڑنے کا کہے۔",
                "بلا اجازت روزہ رکھنا مکروہ یا ممنوع قرار دیا گیا ہے کیونکہ یہ شوہر کی حق تلفی ہے۔",
                "ایسی صورت میں روزہ رکھنے کا ثواب نہیں ملے گا اگر اس سے فتنہ پیدا ہو۔"
              ],
              "english": [
                "If a woman fasts voluntarily without permission, the husband has the right to ask her to break it.",
                "Fasting without permission is considered disliked or prohibited as it violates the husband's rights.",
                "In such cases, the spiritual reward may be lost if it causes domestic strife."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی نظامِ عدل",
              "english": "Islamic System of Justice"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ اسلام میں ہر ایک کے حقوق اور فرائض متعین ہیں۔",
                "عبادت کے نام پر دوسروں کی حق تلفی کرنا اسلامی تعلیمات کے خلاف ہے۔",
                "اعتدال اور علم ہی صراطِ مستقیم کی بنیاد ہے۔"
              ],
              "english": [
                "This Hadith clarifies that rights and duties are well-defined for everyone in Islam.",
                "Violating the rights of others in the name of worship is against Islamic teachings.",
                "Moderation and knowledge are the foundations of the Straight Path."
              ]
            }
          }
        ]
      }
    }
  ]
}