{
  "hadithId": 1303,
  "hadithNo": 27,
  "hadithReferences": {
    "sunnah.com": ["tirmidhi:1947", "tirmidhi:1964"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه الترمذي (1947 و 1964). وفي إسناده فرقد السبخي وهو ضعيف الحفظ. ومع ذلك، فإن معاني خصال الشر المذكورة ثابتة في نصوص أخرى صحيحة.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے امام ترمذی (1947 اور 1964) نے روایت کیا ہے۔ اس کی سند میں فرقد السبخی ہیں جو ضعیف الحفظ ہیں۔ تاہم، دھوکہ دہی، بخل اور ماتحتوں پر ظلم کی ممانعت دیگر صحیح احادیث سے ثابت ہے۔",
    "english": "Weak. Reported by At-Tirmidhi (1947 & 1964). Its chain includes Farqad as-Sabakhi, who is weak in memory. However, the prohibition of deception, stinginess, and mistreating subordinates is established in other authentic texts."
  },
  "importantWords": [
    {
      "arabic": "خِبٌّ",
      "english": "Deceiver / Swindler",
      "urdu": "دھوکہ باز / مکار"
    },
    {
      "arabic": "بَخِيلٌ",
      "english": "Miser",
      "urdu": "کنجوس / بخیل"
    },
    {
      "arabic": "سَيِّئُ اَلْمَلَكَةِ",
      "english": "One who mistreats subordinates",
      "urdu": "ماتحتوں سے برا سلوک کرنے والا"
    },
    {
      "arabic": "لَا يَدْخُلُ",
      "english": "Will not enter",
      "urdu": "داخل نہیں ہوگا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث تین مہلک سماجی برائیوں: دھوکہ دہی، بخل اور ماتحتوں (خادموں یا ملازمین) کے ساتھ بدسلوکی سے بچنے کی تاکید کرتی ہے، کیونکہ یہ صفات جنت کی راہ میں رکاوٹ ہیں۔",
    "english": "This Hadith warns against three destructive social evils: deception, stinginess, and the mistreatment of subordinates (servants or employees), as these traits hinder entry into Paradise."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1947)",
      "english": "Sunan at-Tirmidhi (1947)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكر الصديق",
        "english": "Abu Bakr as-Siddiq"
      },
      "slug": "abu-bakr-as-siddiq"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دھوکہ دہی اور مکر و فریب",
        "english": "Deception and Fraud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خِبّ (دھوکہ باز) کی تعریف",
              "english": "Definition of a Deceiver"
            },
            "content": {
              "urdu": [
                "خِبّ اس مکار کو کہتے ہیں جو لوگوں کو دھوکہ دے کر ان کا حق مارتا ہے۔",
                "دھوکہ دہی ایمان کے منافی ہے، نبی ﷺ نے فرمایا: 'جس نے دھوکہ دیا وہ ہم میں سے نہیں'۔",
                "تجارت، معاملات اور باہمی تعلقات میں شفافیت اسلامی تعلیمات کا جوہر ہے۔"
              ],
              "english": [
                "A 'Khabb' is a swindler who deceives people to deprive them of their rights.",
                "Deception is contrary to faith; the Prophet (ﷺ) said: 'He who deceives is not of us.'",
                "Transparency in trade, dealings, and relationships is the essence of Islamic teachings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بخل اور کنجوسی کی مذمت",
        "english": "Condemnation of Stinginess"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی ہوس اور بخل",
              "english": "Greed and Miserliness"
            },
            "content": {
              "urdu": [
                "بخیل وہ ہے جو اللہ کے دیے ہوئے مال میں سے واجب حقوق (زکوٰۃ و صدقات) ادا نہیں کرتا۔",
                "بخل دل کی تنگی اور ایمان کی کمزوری کی علامت ہے۔",
                "سخاوت اللہ سے قریب کرتی ہے جبکہ بخل اللہ سے دور کر دیتا ہے۔"
              ],
              "english": [
                "A miser is one who refuses to pay obligatory rights (Zakat/Charity) from Allah's wealth.",
                "Stinginess is a sign of a constricted heart and weak faith.",
                "Generosity brings one closer to Allah, while miserliness distances one from Him."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ماتحتوں کے ساتھ سلوک",
        "english": "Treatment of Subordinates"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سَيِّئُ اَلْمَلَكَةِ (بدسلوکی)",
              "english": "Mistreatment of Servants"
            },
            "content": {
              "urdu": [
                "اس سے مراد وہ شخص ہے جو اپنے خادموں، ملازمین یا زیرِ کفالت افراد کے ساتھ سختی اور بدتمیزی کرے۔",
                "اسلام نے خادموں کو 'تمہارے بھائی' قرار دیا ہے جنہیں ویسا ہی کھلانا اور پہنانا چاہیے جیسا خود کھاتے پہنتے ہیں۔",
                "ماتحتوں پر ظلم کرنا قیامت کے دن رسوائی کا باعث بنے گا۔"
              ],
              "english": [
                "This refers to a person who is harsh and rude to their servants, employees, or dependents.",
                "Islam regards servants as 'your brothers' who should be fed and clothed as you feed and clothe yourself.",
                "Oppressing subordinates will lead to humiliation on the Day of Resurrection."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کردار کی تعمیر",
              "english": "Character Building"
            },
            "content": {
              "urdu": [
                "مومن کو چاہیے کہ وہ اپنی زندگی میں دیانتداری، سخاوت اور نرم مزاجی کو اپنائے۔",
                "جنت میں داخلہ صرف عبادات سے نہیں بلکہ بہترین اخلاق اور انسانی حقوق کی پاسداری سے بھی مشروط ہے۔",
                "اپنے اخلاق کو درست کرنا ہی اصل کامیابی کی کنجی ہے۔"
              ],
              "english": [
                "A believer should adopt integrity, generosity, and gentleness in their life.",
                "Entry into Paradise is not only based on worship but also on high morals and respecting human rights.",
                "Rectifying one's character is the key to true success."
              ]
            }
          }
        ]
      }
    }
  ]
}