{
  "hadithId": 370,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/317"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (935)‏، ومسلم (852).",
    "urdu": "یہ حدیث متفق علیہ (بخاری: 935 اور مسلم: 852) ہے۔ یہ انتہائی مستند اور صحیح ترین درجہ کی حدیث ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (935) and Muslim (852). It is a Muttafaqun Alayh (agreed upon) Hadith."
  },
  "importantWords": [
    {
      "arabic": "سَاعَةٌ",
      "english": "A specific time / hour",
      "urdu": "گھڑی / خاص وقت"
    },
    {
      "arabic": "لَا يُوَافِقُهَا",
      "english": "Does not happen to coincide with",
      "urdu": "اسے پا نہیں لیتا"
    },
    {
      "arabic": "قَائِمٌ يُصَلِّي",
      "english": "Standing in prayer",
      "urdu": "کھڑا نماز پڑھ رہا ہو"
    },
    {
      "arabic": "يُقَلِّلُهَا",
      "english": "Indicating its briefness",
      "urdu": "اسے تھوڑا قرار دیتے ہوئے"
    },
    {
      "arabic": "خَفِيفَةٌ",
      "english": "Short / Brief",
      "urdu": "ہلکی / مختصر"
    },
    {
      "arabic": "يَسْأَلُ",
      "english": "Asking / Supplicating",
      "urdu": "مانگتا ہے / سوال کرتا ہے"
    }
  ],
  "summary": {
    "urdu": "جمعہ کے دن ایک ایسی مختصر سی گھڑی آتی ہے جس میں کی جانے والی ہر جائز دعا قبول ہوتی ہے، لہٰذا اس دن خوب دعا کرنی چاہیے۔",
    "english": "There is a very brief moment on Friday during which any lawful supplication made by a praying Muslim is granted by Allah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (935)",
      "english": "Sahih al-Bukhari (935)"
    },
    {
      "arabic": "صحيح مسلم (852)",
      "english": "Sahih Muslim (852)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9MszK2Bny4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبولیتِ دعا کی گھڑی",
        "english": "The Hour of Acceptance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھڑی کی حقیقت",
              "english": "Nature of the Moment"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے واضح کیا کہ جمعہ کے دن دعا کی قبولیت کا ایک خاص وقت متعین ہے۔",
                "آپ ﷺ کے اشارے سے معلوم ہوتا ہے کہ یہ وقت نہایت مختصر اور قیمتی ہے۔",
                "یہ اللہ تعالیٰ کا اپنے بندوں پر خاص فضل ہے کہ اس نے ہفتہ وار ایک موقع رکھا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that there is a specific time on Friday for the acceptance of dua.",
                "The Prophet's gesture indicates that this duration is extremely brief and precious.",
                "It is a special favor from Allah to provide a weekly opportunity for His slaves."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی شرائط",
              "english": "Conditions for the Supplication"
            },
            "content": {
              "urdu": [
                "دعا کرنے والا مسلمان ہو اور خلوصِ دل سے اللہ سے رجوع کر رہا ہو۔",
                "لفظ 'یصلی' سے مراد نماز میں ہونا یا نماز کا انتظار کرنا بھی ہو سکتا ہے۔",
                "مانگی جانے والی چیز جائز ہو اور اس میں قطع رحمی کا پہلو نہ ہو۔"
              ],
              "english": [
                "The supplicant must be a Muslim turning to Allah with a sincere heart.",
                "The term 'praying' can refer to actual Salah or waiting for the prayer to begin.",
                "The request must be for something lawful and not involve severing ties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وقت کا تعین",
        "english": "Determining the Time"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشہور اقوال",
              "english": "Notable Scholarly Opinions"
            },
            "content": {
              "urdu": [
                "ایک قول کے مطابق یہ وقت امام کے منبر پر بیٹھنے سے نماز کے خاتمے تک ہے۔",
                "دوسرا اور مضبوط قول یہ ہے کہ یہ عصر کے بعد سورج غروب ہونے سے پہلے ہے۔",
                "اس وقت کو پوشیدہ رکھنے میں حکمت یہ ہے کہ بندہ سارا دن دعا میں مصروف رہے۔"
              ],
              "english": [
                "One opinion states it is from the time the Imam sits on the pulpit until the prayer ends.",
                "The second stronger opinion is that it is after Asr until the sun sets.",
                "The wisdom in keeping it hidden is to encourage Muslims to stay in worship all day."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی حالت",
              "english": "State of Prayer"
            },
            "content": {
              "urdu": [
                "عصر کے بعد اگر کوئی شخص جائے نماز پر بیٹھ کر دعا کا منتظر ہے تو وہ نماز ہی میں ہے۔",
                "نماز کے انتظار والے کو بھی 'قائم یصلی' کے حکم میں شامل کیا گیا ہے۔",
                "مومن کو چاہیے کہ ان دونوں اوقات میں خصوصی طور پر دعاؤں کا اہتمام کرے۔"
              ],
              "english": [
                "A person waiting for prayer on their mat after Asr is considered to be in prayer.",
                "One who waits for Salah is included in the ruling of 'standing in prayer'.",
                "A believer should strive to supplicate especially during both these likely periods."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمانی فوائد",
        "english": "Spiritual Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ سے تعلق",
              "english": "Connection with Allah"
            },
            "content": {
              "urdu": [
                "یہ حدیث بندے کا اپنے رب پر اعتماد اور توکل بڑھاتی ہے۔",
                "قبولیت کا یقین دعا میں رقت اور عاجزی پیدا کرتا ہے۔",
                "اللہ تعالیٰ اپنے بندے کی پکار سننے اور اسے عطا کرنے کو پسند فرماتا ہے۔"
              ],
              "english": [
                "This Hadith strengthens a servant's trust and reliance upon their Lord.",
                "Certainty of acceptance creates tenderness and humility in supplication.",
                "Allah loves to hear the call of His servant and loves to grant their requests."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمعہ کی عظمت",
              "english": "The Greatness of Friday"
            },
            "content": {
              "urdu": [
                "جمعہ کا دن تمام دنوں کا سردار ہے اور اس کی اپنی ایک خاص شان ہے۔",
                "دعا کی یہ گھڑی اس دن کی فضیلت کو مزید چار چاند لگا دیتی ہے۔",
                "مسلمانوں کو اس دن لہو و لعب کے بجائے ذکر و دعا میں وقت گزارنا چاہیے۔"
              ],
              "english": [
                "Friday is the leader of all days and possesses its own unique status.",
                "This hour of acceptance further enhances the virtue of this blessed day.",
                "Muslims should spend time in dhikr and dua rather than idle talk on this day."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کی کثرت",
              "english": "Abundance in Supplication"
            },
            "content": {
              "urdu": [
                "ہمیں اپنی دنیاوی اور اخروی تمام ضروریات اللہ سے مانگنی چاہئیں۔",
                "خاص طور پر جمعہ کے آخری لمحات کو ضائع نہیں کرنا چاہیے۔",
                "اجتماعی دعاؤں کے ساتھ ساتھ انفرادی مناجات کا بھی اہتمام کریں۔"
              ],
              "english": [
                "We should ask Allah for all our worldly and otherworldly needs.",
                "Specifically, the final moments of Friday should not be wasted in distraction.",
                "In addition to congregational prayers, arrange for private intimate supplications."
              ]
            }
          },
          {
            "title": {
              "urdu": "حصولِ خیر کی جستجو",
              "english": "Seeking Goodness"
            },
            "content": {
              "urdu": [
                "نیکی کے مواقع تلاش کرنا اور ان سے فائدہ اٹھانا عقلمندی ہے۔",
                "وقت کی اہمیت کو سمجھیں، کیونکہ یہ گھڑی بہت مختصر ہو سکتی ہے۔",
                "ہمیشہ باوضو رہنے اور خیر کے کاموں میں مشغول رہنے کی عادت ڈالیں۔"
              ],
              "english": [
                "It is wise to look for opportunities for good and to take advantage of them.",
                "Understand the value of time, as this specific moment can be very brief.",
                "Develop the habit of remaining in wudu and engaging in beneficial acts."
              ]
            }
          }
        ]
      }
    }
  ]
}