{
  "hadithId": 766,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/766"],
    "kitabId": 7,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 55
  },
 
  "takhreej": {
    "arabic": "صحيح موقوف.‏ رواه الدار قطني (3/63)، والموطأ (2/688). وقوى الحافظ إسناده في التلخيص (3/58). هذا الأثر يدل على جواز وضع الشروط في عقد المضاربة.",
    "urdu": "صحیح موقوف۔ اسے دارقطنی (3/63) اور امام مالک نے موطا (2/688) میں روایت کیا ہے۔ حافظ ابن حجر نے تلخیص الحبیر (3/58) میں اس کی سند کو قوی قرار دیا ہے۔",
    "english": "Sahih Mauquf. Reported by Ad-Daraqutni (3/63) and Malik in Al-Muwatta (2/688). Al-Hafiz Ibn Hajar strengthened its chain in At-Talkhis (3/58)."
  },
  "importantWords": [
    {
      "arabic": "مُقَارَضَةً",
      "english": "Profit-sharing (Mudarabah)",
      "urdu": "مضاربت / شراکت"
    },
    {
      "arabic": "كَبِدٍ رَطْبَةٍ",
      "english": "Livestock (living beings)",
      "urdu": "جاندار (حیوان)"
    },
    {
      "arabic": "بَحْرٍ",
      "english": "Sea",
      "urdu": "سمندر"
    },
    {
      "arabic": "مَسِيلٍ",
      "english": "Watercourse / Riverbed",
      "urdu": "سیلاب کی جگہ"
    },
    {
      "arabic": "ضَمِنْتَ",
      "english": "Liable / Responsible",
      "urdu": "ضامن ہونا"
    },
    {
      "arabic": "مَوْقُوفٌ",
      "english": "Mauquf (Statement of Sahabi)",
      "urdu": "صحابی کا قول یا فعل"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ مضاربت (کاروباری شراکت) میں سرمایہ دار اپنی رقم کی حفاظت کے لیے مخصوص شرائط رکھ سکتا ہے اور شرائط کی خلاف ورزی پر نقصان کی ذمہ داری عامل پر ہوگی۔",
    "english": "This narration proves that in a Mudarabah contract, the investor can set specific conditions to protect the capital, and the worker becomes liable for losses if these conditions are violated."
  },
  "references": [
    {
      "arabic": "رواه الدار قطني (3/63)",
      "english": "Reported by Ad-Daraqutni (3/63)"
    },
    {
      "arabic": "الموطأ للإمام مالك (2/688)",
      "english": "Al-Muwatta by Imam Malik (2/688)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "حكيم بن حزام",
        "english": "Hakim bin Hizam"
      },
      "slug": "hakim-bin-hizam"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عثمان بن عفان",
        "english": "Uthman bin Affan"
      },
      "slug": "uthman-bin-affan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T-XQYqBvI",
  "grade": {
    "arabic": "صحيح موقوف",
    "english": "Sahih Mauquf (Authentic Statement of Companion)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مضاربت میں شرائط کا جواز",
        "english": "Permissibility of Conditions in Mudarabah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سرمایہ کار کا اختیار",
              "english": "Authority of the Investor"
            },
            "content": {
              "urdu": [
                "سرمایہ کار کو یہ حق حاصل ہے کہ وہ اپنے مال کی سرمایہ کاری کے لیے حدود مقرر کرے۔",
                "ایسی شرائط جو مال کو بڑے خطرات سے بچانے کے لیے ہوں، وہ شرعی طور پر جائز ہیں۔",
                "حکیم بن حزام رضی اللہ عنہ کا عمل اس بات کی واضح دلیل فراہم کرتا ہے۔"
              ],
              "english": [
                "The investor has the right to set boundaries for how their capital is invested.",
                "Conditions aimed at protecting the wealth from excessive risks are Islamically valid.",
                "The practice of Hakim bin Hizam (RA) provides clear evidence for this legal point."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطرے والے کاموں سے ممانعت",
              "english": "Prohibition of High-Risk Ventures"
            },
            "content": {
              "urdu": [
                "حیوانوں کی تجارت (کبد رطبہ) میں اچانک بیماری یا موت کا خطرہ زیادہ ہوتا ہے۔",
                "سمندری سفر اور نشیبی جگہوں پر قیام اس دور میں مال کے ضائع ہونے کے بڑے اسباب تھے۔",
                "اسلام مال کی حفاظت کا حکم دیتا ہے اور غیر ضروری رسک سے بچنے کی حوصلہ افزائی کرتا ہے۔"
              ],
              "english": [
                "Trading in livestock involves higher risks of sudden disease or death.",
                "Sea travel and staying in low-lying wadis were major causes of property loss in that era.",
                "Islam commands the preservation of wealth and encourages avoiding unnecessary risks."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ضمان (ذمہ داری) کے اصول",
        "english": "Principles of Liability (Daman)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرائط کی خلاف ورزی کا اثر",
              "english": "Effect of Violating Stipulations"
            },
            "content": {
              "urdu": [
                "عامل (کام کرنے والا) عام حالات میں نقصان کا ضامن نہیں ہوتا بشرطیکہ وہ خیانت نہ کرے۔",
                "لیکن اگر وہ سرمایہ کار کی لگائی گئی جائز شرائط کو توڑتا ہے، تو وہ ضمان کا ذمہ دار ہو جاتا ہے۔",
                "اس صورت میں اگر مال ضائع ہو جائے تو اسے اپنے پاس سے اصل رقم ادا کرنی ہوگی۔"
              ],
              "english": [
                "The worker is generally not liable for losses unless they are negligent or dishonest.",
                "However, if they violate valid stipulations set by the investor, they become liable (Damin).",
                "In such a case, if the wealth is lost, they must repay the principal amount from their own pocket."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت سے ضمان کی طرف منتقلی",
              "english": "Transition from Trust to Liability"
            },
            "content": {
              "urdu": [
                "عامل کے ہاتھ میں مال 'امانت' ہوتا ہے جب تک وہ قواعد کی پابندی کرتا ہے۔",
                "خلاف ورزی کرتے ہی اس کی حیثیت 'امین' سے بدل کر 'ضامن' کی ہو جاتی ہے۔",
                "یہ قانون سرمایہ کار کے مفادات کی حفاظت کو یقینی بنانے کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "The wealth in the worker's hands is a 'trust' (Amanah) as long as they follow rules.",
                "Upon violation, their status changes from a 'trustee' (Amin) to a 'guarantor' (Damin).",
                "This law is designed to ensure the protection of the investor's interests."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلفائے راشدین کا عمل",
        "english": "Practice of the Rightly Guided Caliphs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عثمان کا طریقہ کار",
              "english": "Method of 'Uthman (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عثمان رضی اللہ عنہ بھی مضاربت کی بنیاد پر اپنے مال سے تجارت کرواتے تھے۔",
                "ان کا یہ عمل ثابت کرتا ہے کہ صحابہ کے دور میں یہ ایک مروج اور مقبول طریقہ تھا۔",
                "نفع کی تقسیم فریقین کی باہمی رضا مندی سے طے کی جاتی تھی۔"
              ],
              "english": [
                "Uthman (RA) used to engage in trade with his wealth on the basis of Mudarabah.",
                "His practice proves that this was a common and accepted method during the era of the Sahaba.",
                "Profit distribution was settled through the mutual agreement of both parties."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا اتفاق (اجماع سکوتی)",
              "english": "Consensus of the Companions"
            },
            "content": {
              "urdu": [
                "عہدِ صحابہ میں مضاربت پر کوئی اعتراض منقول نہیں ہے جو اس کے جواز کی مضبوط دلیل ہے۔",
                "بڑے صحابہ کرام نے اسے معاشی سرگرمیوں کے لیے بہترین ذریعہ سمجھا۔",
                "یہ عمل آج کے جدید بینکنگ اور انویسٹمنٹ سسٹمز کے لیے بنیاد فراہم کرتا ہے۔"
              ],
              "english": [
                "No objection was reported against Mudarabah during the time of the Sahaba, indicating consensus.",
                "Senior companions viewed it as an excellent means for economic activities.",
                "This practice provides the foundation for modern Islamic banking and investment systems."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہدے کی تحریر",
              "english": "Writing the Contract"
            },
            "content": {
              "urdu": [
                "کاروبار شروع کرنے سے پہلے تمام شرائط کو تحریری شکل میں لانا ضروری ہے۔",
                "خطرے کے پہلوؤں کو واضح کرنے سے مستقبل کے تنازعات سے بچا جا سکتا ہے۔",
                "سرمایہ کار کو اپنی ترجیحات بتانے کا پورا حق استعمال کرنا چاہیے۔"
              ],
              "english": [
                "It is essential to document all conditions in writing before starting a business.",
                "Clarifying risk factors helps in avoiding future disputes and misunderstandings.",
                "The investor should fully exercise their right to communicate their preferences."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیانتداری اور ذمہ داری",
              "english": "Integrity and Responsibility"
            },
            "content": {
              "urdu": [
                "عامل کو چاہیے کہ وہ سرمایہ کار کے اعتماد کی ہر حال میں لاج رکھے۔",
                "اگر وہ کسی شرط کو پورا نہیں کر سکتا تو اسے پہلے ہی آگاہ کر دینا چاہیے۔",
                "رزقِ حلال کے لیے کاروباری اخلاقیات اور قواعد کی پابندی لازمی ہے۔"
              ],
              "english": [
                "The worker must uphold the investor's trust under all circumstances.",
                "If they cannot fulfill a certain condition, they should inform the investor beforehand.",
                "Adhering to business ethics and rules is mandatory for attaining Halal provision."
              ]
            }
          }
        ]
      }
    }
  ]
}