{
  "hadithId": 88,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 12"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب الطهارة",
    "babId": 7
  },

  "takhreej": {
    "arabic": " صحيح.  رواه البخاري (156) .  رواه أحمد (1 /450) ، والدارقطني (1 /55)  واللفظ للدارقطني، وأما لفظ أحمد، فهو: \"ائتني بحجر\".  وهي زيادة صحيحة.",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (156) نے روایت کیا ہے۔ اسے احمد (1/450) اور دارقطنی (1/55) نے بھی روایت کیا ہے، دارقطنی کا لفظ یہ ہے: \"ائتنی بغیره\" (میرے لیے اس کے علاوہ کوئی چیز لے آؤ)۔ یہ اضافہ صحیح ہے۔",
    "english": "Sahih (Authentic) narration. Reported by Al-Bukhari (156). Also reported by Ahmad (1/450) and Ad-Daraqutni (1/55). The wording for Ad-Daraqutni is included, and the addition is considered Sahih (authentic)."
  },
  "importantWords": [
    {
      "arabic": "اَلْغَائِطَ",
      "english": "The place of relief",
      "urdu": "قضائے حاجت"
    },
    {
      "arabic": "أَحْجَارٍ",
      "english": "Stones",
      "urdu": "پتھر"
    },
    {
      "arabic": "بِرَوْثَةٍ",
      "english": "A piece of dung",
      "urdu": "گوبر کا ٹکڑا"
    },
    {
      "arabic": "رِكْسٌ",
      "english": "Filth/Impurity",
      "urdu": "پلیدی/ناپاکی"
    },
    {
      "arabic": "أَلْقَى",
      "english": "He cast away/threw",
      "urdu": "پھینک دیا"
    },
    {
      "arabic": "بِغَيْرِهَا",
      "english": "With something else",
      "urdu": "اس کے علاوہ"
    },
    {
      "arabic": "اَلْاِسْتِنْجَاء",
      "english": "Cleansing/Istinja'",
      "urdu": "طہارت کرنا"
    },
    {
      "arabic": "فَأَمَرَنِي",
      "english": "He commanded me",
      "urdu": "انہوں نے مجھے حکم دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے بعد طہارت (استنجاء) کے لیے کم از کم تین پتھروں کے استعمال کی سنت کو واضح کرتی ہے اور گوبر کو ناپاک اور ناپسندیدہ قرار دیتے ہوئے اس کے استعمال سے منع کرتی ہے۔",
    "english": "This Hadith clarifies the Sunnah of using at least three stones for cleaning (Istinja') after relieving oneself and prohibits the use of dried dung, declaring it to be impure and unsuitable for purification."
  },
  "references": [
    {
      "arabic": "أخرجه البخاري (156)",
      "english": "Reported by Al-Bukhari (156)"
    },
    {
      "arabic": "زاد أحمد (1 /450)",
      "english": "Addition by Ahmad (1/450)"
    },
    {
      "arabic": "زاد الدارقطني (1 /55)",
      "english": "Addition by Ad-Daraqutni (1/55)"
    }
  ],
  "narrators": [
    {
      "id": 8801,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استنجاء کے آداب اور شرائط",
        "english": "Etiquettes and Conditions of Istinja'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت میں طاق عدد",
              "english": "Odd Number in Purification"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے طہارت کے لیے تین پتھروں کا مطالبہ کیا، جس سے یہ اصول اخذ ہوتا ہے کہ استنجاء میں طاق عدد کا استعمال مسنون ہے۔",
                "اگر تین پتھروں سے صفائی حاصل نہ ہو تو پانچ، سات یا اس سے زیادہ طاق عدد میں پتھر استعمال کرنے چاہئیں۔",
                "مسلمانوں کی تمام عبادات میں صفائی اور پاکیزگی کو بنیادی حیثیت حاصل ہے، یہ اسی کا حصہ ہے۔"
              ],
              "english": [
                "The Prophet ﷺ requested three stones for cleansing, from which the principle is derived that using an odd number of objects for Istinja' is Sunnah.",
                "If cleanliness is not achieved with three stones, one should use five, seven, or any higher odd number until purity is attained.",
                "Cleanliness and purity hold fundamental importance in all Muslim acts of worship, and this is part of it."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناپاک چیزوں کا استعمال منع",
              "english": "Prohibition of Using Impure Objects"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے گوبر کو پلید (رِکْس) قرار دے کر استنجاء کے لیے اس کے استعمال سے منع فرما دیا۔",
                "استنجاء کے لیے ہر وہ چیز ممنوع ہے جو بذات خود ناپاک ہو، جیسے گوبر، یا جو محترم ہو جیسے ہڈی۔",
                "یہ حکم اس اصول کی وضاحت کرتا ہے کہ ناپاکی کو دور کرنے کے لیے خود ناپاک چیز کا استعمال نہیں ہو سکتا۔"
              ],
              "english": [
                "The Prophet ﷺ rejected the dung, calling it 'Riks' (filth), and forbade its use for cleansing.",
                "Any object that is itself impure (like dung) or is revered (like bone) is forbidden for Istinja'.",
                "This ruling clarifies the principle that an impure item cannot be used to remove impurity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گوبر کی نجاست اور حکمت",
        "english": "Impurity of Dung and its Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گوبر کا رِکس ہونا",
              "english": "Dung being Filth (Riks)"
            },
            "content": {
              "urdu": [
                "گوبر جانوروں کی نجاست ہے اور اسے استنجاء کے لیے استعمال کرنے سے نجاست دور نہیں ہوتی بلکہ مزید لگ جاتی ہے۔",
                "رِکْس کا معنی گندی چیز یا ناپاک خوراک ہے، اور اسے طہارت کے لیے استعمال کرنا اسلامی تعلیمات کے منافی ہے۔",
                "اس حکم سے اندازہ ہوتا ہے کہ نبی اکرم ﷺ صفائی اور طہارت کے معاملے میں کتنا محتاط تھے۔"
              ],
              "english": [
                "Dung is animal waste, and using it for Istinja' does not remove impurity but rather adds to it.",
                "Riks means a foul or impure substance, and using it for purification contradicts Islamic teachings.",
                "This command shows how meticulous the Prophet ﷺ was regarding matters of cleanliness and purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "جن و جانوروں کا حق",
              "english": "The Right of Jinn and Animals"
            },
            "content": {
              "urdu": [
                "ایک اور صحیح حدیث کے مطابق، گوبر جنات کے جانوروں کی خوراک ہے، اور ہڈی ان کی خوراک ہے۔",
                "اس لیے ان چیزوں کا استعمال ممنوع قرار دیا گیا تاکہ جنات اور جانوروں کے حقوق کی خلاف ورزی نہ ہو۔",
                "اسلام ہر مخلوق کے حقوق کا خیال رکھتا ہے، یہاں تک کہ ایسی چیزوں میں بھی جو روزمرہ کے استعمال میں آتی ہیں۔"
              ],
              "english": [
                "According to another authentic Hadith, dung is the food for the animals of the Jinn, and bones are their food.",
                "Therefore, the use of these materials was prohibited so as not to infringe upon the rights of the Jinn and animals.",
                "Islam observes the rights of all creation, even in matters concerning everyday items."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسنون طریقہ استنجاء",
        "english": "The Sunnah Method of Istinja'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین کا قاعدہ",
              "english": "The Rule of Three"
            },
            "content": {
              "urdu": [
                "طہارت میں کم از کم تین پتھر یا پتھر کے قائم مقام (ٹشو پیپر وغیرہ) استعمال کرنا ضروری ہے۔",
                "مقصد جگہ کو مکمل طور پر صاف کرنا ہے، اور صفائی کے بعد پانی کا استعمال افضل ہے۔",
                "صرف پتھروں سے صفائی کو استجمار کہتے ہیں اور پانی سے صفائی کو استنجاء کہتے ہیں، دونوں جائز ہیں۔"
              ],
              "english": [
                "It is necessary to use at least three stones or their equivalents (like tissue paper) for cleaning.",
                "The goal is to thoroughly clean the area, and using water after solid objects is considered superior.",
                "Cleansing with stones alone is called Istijmar, and cleansing with water is Istinja', both are permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختیار اور احتیاط",
              "english": "Choice and Caution"
            },
            "content": {
              "urdu": [
                "آج کے دور میں پانی ہر جگہ دستیاب ہے، لہٰذا پانی سے استنجاء کرنا سب سے بہتر اور افضل طریقہ ہے۔",
                "اگر پانی دستیاب نہ ہو تو پتھر یا مناسب اشیاء کا استعمال تین کی طاق تعداد میں کیا جا سکتا ہے۔",
                "مسلمان کو ہمیشہ مکمل طہارت کے حصول میں احتیاط اور توجہ سے کام لینا چاہیے۔"
              ],
              "english": [
                "In the modern era, water is generally available everywhere, making Istinja' with water the best and most preferred method.",
                "If water is unavailable, stones or suitable materials can be used, adhering to the odd number of three.",
                "A Muslim should always act with caution and care to achieve complete purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور اخلاقی درس",
        "english": "Educational and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کا تواضع",
              "english": "Humility of the Prophet ﷺ"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا اپنے خادم سے طہارت کی اشیاء طلب کرنا ان کی تواضع اور سادگی کو ظاہر کرتا ہے۔",
                "یہ ایک اہم مثال ہے کہ شرعی احکام کی پابندی کے لیے ذاتی طور پر انتظام کرنا ضروری ہے۔",
                "آپ ﷺ کا ہر عمل ہمارے لیے شریعت اور سنت کا ماخذ ہے، خواہ وہ کتنا ہی چھوٹا کیوں نہ ہو۔"
              ],
              "english": [
                "The Prophet's request for cleansing objects from his companion shows his humility and simplicity.",
                "It is an important example that personal arrangements are necessary to comply with legal Islamic rulings.",
                "Every action of the Prophet ﷺ is a source of Shari'ah and Sunnah for us, no matter how small."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابن مسعود کا مقام",
              "english": "The Status of Ibn Mas'ud"
            },
            "content": {
              "urdu": [
                "حضرت ابن مسعود رضی اللہ عنہ کا نبی ﷺ کی خدمت میں حاضر ہونا ان کی فضیلت اور قریب ہونے کی نشانی ہے۔",
                "صحابہ کرام ہر وقت نبی ﷺ کی خدمت کے لیے تیار رہتے تھے اور شرعی احکام کو براہ راست سیکھتے تھے۔",
                "اس واقعہ میں شاگرد اور استاد کے درمیان شرعی علم کی ترسیل کا طریقہ واضح ہوتا ہے۔"
              ],
              "english": [
                "The readiness of Ibn Mas'ud (RA) to serve the Prophet ﷺ indicates his virtue and closeness to him.",
                "The companions were always prepared to serve the Prophet ﷺ and learn religious rulings directly from him.",
                "This incident clearly illustrates the method of transmitting sacred knowledge between the teacher and the student."
              ]
            }
          }
        ]
      }
    }
  ]
}
