{
  "hadithId": 1208,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/21"],
    "kitabId": 14,
    "inKitabBab": 2,
    "arabicBook": "كتاب القضاء",
    "babId": 98
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1712)، وأبو داود (3608)، والنسائي في الكبرى (3/490)، وابن ماجه (2368).",
    "urdu": "صحیح۔ اسے مسلم (1712)، ابوداؤد (3608) اور نسائی نے روایت کیا ہے۔ اس کی سند کو امام نسائی نے جید (بہترین) قرار دیا ہے۔",
    "english": "Sahih. Reported by Muslim (1712), Abu Dawud (3608), and An-Nasa'i in Al-Kubra (3/490). An-Nasa'i stated its chain is Jayyid (good)."
  },
  "importantWords": [
    {
      "arabic": "قَضَى",
      "english": "Judged / Decreed",
      "urdu": "فیصلہ فرمایا"
    },
    {
      "arabic": "بِيَمِينٍ",
      "english": "By an oath",
      "urdu": "قسم کے ساتھ"
    },
    {
      "arabic": "وَشَاهِدٍ",
      "english": "And a witness",
      "urdu": "اور ایک گواہ"
    },
    {
      "arabic": "إِسْنَادُه",
      "english": "Its chain of narration",
      "urdu": "اس کی سند"
    },
    {
      "arabic": "جَيِّدٌ",
      "english": "Good / Reliable",
      "urdu": "عمدہ / بہترین"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مالی معاملات میں ثبوت کے ایک متبادل طریقے کو بیان کرتی ہے کہ اگر دو گواہ نہ ہوں تو ایک گواہ اور مدعی کی قسم پر بھی فیصلہ کیا جا سکتا ہے۔",
    "english": "This Hadith establishes that in financial disputes, a judgment can be passed based on one witness along with the claimant's oath if two witnesses are unavailable."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الأقضية، باب القضاء باليمين والشاهد، رقم 1712",
      "english": "Sahih Muslim, Book of Judicial Decisions, No. 1712"
    },
    {
      "arabic": "سنن أبي داود، كتاب الأقضية، باب القضاء باليمين والشاهد، رقم 3608",
      "english": "Sunan Abi Dawud, Book of Judicial Decisions, No. 3608"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ثبوت کے شرعی طریقے",
        "english": "Sharia Methods of Proof"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی معاملات میں وسعت",
              "english": "Flexibility in Financial Matters"
            },
            "content": {
              "urdu": [
                "اصل قانون دو گواہ یا ایک مرد اور دو عورتوں کی گواہی کا ہے۔",
                "لیکن مالی معاملات میں شریعت نے آسانی پیدا کرتے ہوئے ایک گواہ اور قسم کو کافی قرار دیا ہے۔",
                "یہ طریقہ کار لوگوں کے مالی حقوق کے تحفظ کے لیے انتہائی مفید ہے۔"
              ],
              "english": [
                "The primary rule requires two male witnesses or one male and two females.",
                "However, in financial cases, Sharia offers flexibility by accepting one witness plus an oath.",
                "This procedure is highly beneficial for protecting the financial rights of individuals."
              ]
            }
          },
          {
            "title": {
              "urdu": "قسم کی قانونی حیثیت",
              "english": "Legal Status of the Oath"
            },
            "content": {
              "urdu": [
                "جب مدعی ایک گواہ لاتا ہے، تو اس کی سچائی کی تائید کے لیے اس سے قسم لی جاتی ہے۔",
                "یہ قسم دوسرے گواہ کے قائم مقام تصور کی جاتی ہے۔",
                "اس سے ثابت ہوتا ہے کہ اسلامی قانون میں قسم کو ایک مضبوط ثبوت مانا جاتا ہے۔"
              ],
              "english": [
                "When a claimant brings one witness, an oath is required to support their truthfulness.",
                "This oath is considered to stand in the place of a second witness.",
                "This proves that the oath is regarded as a strong piece of evidence in Islamic law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کا موقف",
        "english": "Positions of Jurisprudential Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کی رائے",
              "english": "Opinion of the Majority"
            },
            "content": {
              "urdu": [
                "امام مالک، شافعی اور احمد کے نزدیک ایک گواہ اور قسم پر فیصلہ جائز ہے۔",
                "ان کا استدلال اسی صحیح حدیث اور رسول اللہ ﷺ کے عمل سے ہے۔",
                "یہ حکم صرف مالی اور جائیداد کے معاملات تک محدود رکھا گیا ہے۔"
              ],
              "english": [
                "Imams Malik, Shafi'i, and Ahmad allow judgment based on one witness and an oath.",
                "Their evidence is derived from this Sahih Hadith and the practice of the Prophet (ﷺ).",
                "This ruling is specifically restricted to financial and property-related matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر حدود میں پابندی",
              "english": "Restrictions in Other Crimes"
            },
            "content": {
              "urdu": [
                "حدود اور قصاص کے معاملات میں ایک گواہ اور قسم پر فیصلہ نہیں کیا جا سکتا۔",
                "وہاں مکمل شہادت (دو یا چار گواہ) کی شرط برقرار رہے گی۔",
                "یہ فرق اس لیے ہے کہ جان اور عزت کے معاملات میں احتیاط کا تقاضا زیادہ ہے۔"
              ],
              "english": [
                "Judgments based on one witness and an oath are not applicable in Hudud or Qisas cases.",
                "In those cases, the requirement for full testimony (two or four witnesses) remains.",
                "This distinction exists because matters of life and honor demand greater caution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی بصیرت اور انصاف",
        "english": "Judicial Insight and Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاضی کا اختیار",
              "english": "Authority of the Judge"
            },
            "content": {
              "urdu": [
                "قاضی کو حالات دیکھ کر یہ فیصلہ کرنا ہوتا ہے کہ گواہ کتنا معتبر ہے۔",
                "اگر گواہ مشکوک ہو تو صرف قسم پر فیصلہ نہیں کیا جائے گا۔",
                "اسلامی عدلیہ میں ظاہری الفاظ کے ساتھ ساتھ قرائن کو بھی اہمیت دی جاتی ہے۔"
              ],
              "english": [
                "The judge must evaluate the circumstances to determine the witness's credibility.",
                "If the witness is doubtful, a verdict will not be passed based on the oath alone.",
                "In Islamic judiciary, circumstantial evidence is valued alongside verbal testimony."
              ]
            }
          },
          {
            "title": {
              "urdu": "مظلوم کی دادرسی",
              "english": "Redressing the Oppressed"
            },
            "content": {
              "urdu": [
                "اکثر اوقات مالی لین دین میں دو گواہ میسر نہیں ہوتے۔",
                "اگر اس طریقے کی اجازت نہ ہوتی تو بہت سے لوگوں کے مال ضائع ہو جاتے۔",
                "یہ شریعت کی حق پرستی ہے کہ وہ حقدار کو اس کا حق دلانے کے متبادل راستے فراہم کرتی ہے۔"
              ],
              "english": [
                "Often, in financial transactions, two witnesses are not readily available.",
                "If this method were not allowed, many people would lose their rightful property.",
                "It is the justice of Sharia that it provides alternative ways to secure a person's rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "احتیاط اور تقویٰ",
        "english": "Caution and Piety"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جھوٹی قسم کا وبال",
              "english": "The Burden of a False Oath"
            },
            "content": {
              "urdu": [
                "مدعی کو یاد رکھنا چاہیے کہ جھوٹی قسم کھا کر لیا گیا مال جہنم کی آگ ہے۔",
                "دنیاوی عدالت سے جیت کر بھی وہ اللہ کی گرفت سے نہیں بچ سکتا۔",
                "ایمان کا تقاضا ہے کہ انسان صرف سچے دعوے پر ہی قسم کھائے۔"
              ],
              "english": [
                "The claimant must remember that wealth acquired through a false oath is fire of Hell.",
                "Even by winning in a worldly court, they cannot escape Allah's seizure.",
                "Faith requires that a person takes an oath only upon a truthful claim."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحریری معاہدات کی اہمیت",
              "english": "Importance of Written Contracts"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ طریقہ موجود ہے، لیکن قرآن نے لین دین کو لکھنے کا حکم دیا ہے۔",
                "تحریر اور گواہ جھگڑوں کو جڑ سے ختم کرنے کا بہترین ذریعہ ہیں۔",
                "مسلمانوں کو چاہیے کہ وہ اپنے معاملات میں احتیاط برتیں تاکہ نوبت عدالت تک نہ آئے۔"
              ],
              "english": [
                "Although this method exists, the Quran commands writing down transactions.",
                "Documentation and witnesses are the best ways to eliminate disputes at the root.",
                "Muslims should exercise caution in their affairs so that matters do not reach the court."
              ]
            }
          }
        ]
      }
    }
  ]
}