{
  "hadithId": 117,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["1:117"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب الطهارة",
    "babId": 9
  },

  "takhreej": {
    "arabic": " ضعيف جداً (منكر). رواه الدار قطني (413/1) . هذا القول لابن عباس لم يثبت عنه. والأصل في الشريعة أن التيمم يقوم مقام الوضوء، والوضوء لا يجب تجديده لكل صلاة ما لم ينتقض.",
    "urdu": "ضعیف جداً (سخت کمزور یا منکر)۔ اسے دارقطنی (413/1) نے روایت کیا ہے۔ یہ قول ابن عباس رضی اللہ عنہما سے ثابت نہیں ہے۔ شریعت میں اصل یہ ہے کہ تیمم وضو کے قائم مقام ہے، اور وضو ہر نماز کے لیے دوبارہ کرنا واجب نہیں جب تک کہ ٹوٹ نہ جائے۔",
    "english": "Da'if Jiddan (Very Weak/Rejected). Reported by Ad-Daraqutni (1/413). This statement is not established as a saying of Ibn Abbas. The fundamental principle in Sharia is that Tayammum takes the place of Wudu, and Wudu does not have to be renewed for every prayer unless it is nullified."
  },
  "importantWords": [
    {
      "arabic": "اَلسُّنَّةِ",
      "english": "The Sunnah (Prophetic way)",
      "urdu": "سنت"
    },
    {
      "arabic": "بِالتَّيَمُّمِ",
      "english": "With Tayammum",
      "urdu": "تیمم کے ذریعے"
    },
    {
      "arabic": "صَلَاةً وَاحِدَةً",
      "english": "One prayer",
      "urdu": "ایک نماز"
    },
    {
      "arabic": "يَتَيَمَّمُ",
      "english": "He performs Tayammum",
      "urdu": "وہ تیمم کرے"
    },
    {
      "arabic": "اَلْأُخْرَى",
      "english": "The next/other",
      "urdu": "دوسری"
    },
    {
      "arabic": "بِإِسْنَادٍ ضَعِيفٍ جِدًّ ا",
      "english": "With a very weak chain",
      "urdu": "بہت ضعیف سند سے"
    }
  ],
  "summary": {
    "urdu": "یہ روایت ابن عباس رضی اللہ عنہما سے منسوب ہے کہ ایک تیمم سے صرف ایک فرض نماز پڑھنی چاہیے اور ہر اگلی نماز کے لیے دوبارہ تیمم کرنا سنت ہے۔ تاہم، محدثین کے نزدیک اس روایت کی سند نہایت ہی کمزور اور ناقابلِ اعتماد ہے۔",
    "english": "This narration, attributed to Ibn Abbas (RA), states that it is part of the Sunnah to perform only one obligatory prayer with a single Tayammum, necessitating renewal for the next prayer. However, Hadith specialists deem the chain of this narration to be extremely weak and unreliable."
  },
  "references": [
    {
      "arabic": "رواه الدارقطني (413/1)",
      "english": "Reported by Ad-Daraqutni (1/413)"
    },
    {
      "arabic": "بإسناد ضعيف جداً",
      "english": "With a very weak chain"
    }
  ],
  "narrators": [
    {
      "id": 11701,
      "name": {
        "arabic": "عَبْدُ اَللَّهِ بْنُ عَبَّاسٍ",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "ضعيف جداً",
    "english": "Very Weak (Da'if Jiddan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تیمم کے احکام اور صحت",
        "english": "Rulings and Validity of Tayammum"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک نماز کا مسئلہ",
              "english": "The Issue of Single Prayer"
            },
            "content": {
              "urdu": [
                "اس روایت کے مطابق، ہر نئی نماز کے لیے نیا تیمم کرنا سنت قرار دیا گیا ہے۔",
                "یہ حکم اس تصور پر مبنی ہے کہ تیمم بذاتِ خود طہارت نہیں بلکہ صرف رخصت اور عذر کو ختم کرتا ہے۔",
                "فقہاء کی اکثریت کے نزدیک، اگر عذر باقی ہو اور تیمم ٹوٹا نہ ہو تو ایک سے زیادہ نمازیں جائز ہیں۔"
              ],
              "english": [
                "According to this narration, renewing Tayammum for every new prayer is considered Sunnah.",
                "This ruling is based on the idea that Tayammum is not purity itself but only removes the excuse temporarily.",
                "The majority of jurists hold that if the excuse remains and Tayammum is not invalidated, multiple prayers are permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "سند کا ضعیف ہونا",
              "english": "Weakness of the Narration Chain"
            },
            "content": {
              "urdu": [
                "محدثین نے اس روایت کی سند کو 'ضعیف جداً' قرار دیا ہے، لہٰذا اس پر عمل واجب نہیں ہے۔",
                "ضعیف ہونے کی وجہ سے اس کو شرعی حکم کی بنیاد نہیں بنایا جا سکتا، خاص طور پر جہاں صحیح احادیث مختلف حکم دیتی ہوں۔",
                "صحیح رائے یہ ہے کہ تیمم وضو کی طرح ہے اور جب تک ٹوٹے نہ، باقی رہتا ہے۔"
              ],
              "english": [
                "Hadith scholars graded this narration as 'very weak,' hence acting upon it is not obligatory.",
                "Due to its weakness, it cannot be used as the basis for a Sharia ruling, especially where authentic Hadiths suggest otherwise.",
                "The sound opinion is that Tayammum is like Wudu and remains valid until nullified."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی موقف",
        "english": "Juristic and Practical Stance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور کا حکم",
              "english": "Ruling of the Majority"
            },
            "content": {
              "urdu": [
                "چاروں ائمہ (احناف، مالکی، شافعی اور حنبلی) کے نزدیک، تیمم سے کئی فرض نمازیں پڑھی جا سکتی ہیں۔",
                "تیمم صرف اس وقت ٹوٹتا ہے جب پانی دستیاب ہو جائے یا وضو کے نواقض (توڑنے والی چیزیں) میں سے کوئی واقع ہو۔",
                "بار بار تیمم کرنے کا حکم صرف احتیاطاً تھا، نہ کہ فرض کی حیثیت سے۔"
              ],
              "english": [
                "According to the four Imams (Hanafi, Maliki, Shafi'i, Hanbali), multiple obligatory prayers can be performed with one Tayammum.",
                "Tayammum is only nullified if water becomes available or if any of the nullifiers of Wudu occur.",
                "The command for frequent renewal was likely based on prudence (Ihtiyat), not as a compulsory obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت میں آسانی",
              "english": "Ease in Worship"
            },
            "content": {
              "urdu": [
                "شریعت کا عمومی اصول یہ ہے کہ عبادت کو آسان بنایا جائے، اور ہر نماز کے لیے تیمم کرنا مشقت کا باعث ہے۔",
                "اگرچہ یہ روایت کمزور ہے، بعض فقہاء نے استحباب کے طور پر نیا تیمم کرنے کو ترجیح دی ہے۔",
                "تیمم ایک عذر کی رخصت ہے، اور رخصت میں سہولت کو اہمیت دی جاتی ہے۔"
              ],
              "english": [
                "The general principle of Sharia is to make worship easy, and performing Tayammum for every prayer causes hardship.",
                "Although the narration is weak, some jurists prefer renewing Tayammum as a desirable (Mustahab) act of precaution.",
                "Tayammum is a concession due to an excuse, and ease is given importance in concessions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علم الحدیث کا درس",
        "english": "Lesson from Hadith Science"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعیف روایت پر تنقید",
              "english": "Critique on Weak Narration"
            },
            "content": {
              "urdu": [
                "اس حدیث کی مثال سے علم الحدیث کی اہمیت واضح ہوتی ہے کہ ہر قول کو قبول نہیں کیا جاتا۔",
                "محدثین کی تحقیق نے اس قول کو ثابت شدہ سنت کے خلاف اور ضعیف پایا ہے۔",
                "قیاس اور دیگر صحیح اصولوں کو ترجیح دی جاتی ہے جہاں مرفوع یا صحیح موقوف روایت موجود نہ ہو۔"
              ],
              "english": [
                "This example highlights the importance of Hadith science, showing that not every statement is accepted.",
                "Scholarly research found this statement to be weak and contrary to established Sunnah.",
                "Analogy (Qiyas) and other sound principles are preferred where an authentic Marfu' or Mawquf narration is missing."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتہاد کی گنجائش",
              "english": "Scope for Ijtihad"
            },
            "content": {
              "urdu": [
                "تیمم کے مسائل میں چونکہ واضح اور صریح صحیح حدیث کم ہے، اس لیے فقہاء کا اجتہاد زیادہ ہوتا ہے۔",
                "جو شخص احتیاطاً ہر نماز کے لیے نیا تیمم کرے، اسے اجر ملے گا، جیسا کہ پہلی حدیث (113) میں گزرا۔",
                "بہر حال، ایک تیمم سے کئی نمازیں پڑھنا شرعی طور پر جائز ہے اگر عذر باقی ہو۔"
              ],
              "english": [
                "Since there are few clear and explicit authentic Hadiths on Tayammum issues, there is more scope for Ijtihad by jurists.",
                "A person who renews Tayammum for every prayer out of caution will be rewarded, as seen in the earlier Hadith (113).",
                "Nevertheless, performing multiple prayers with one Tayammum is legally permissible as long as the excuse remains."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و تربیتی پہلو",
        "english": "Ethical and Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "افضل عمل کی تلاش",
              "english": "Seeking the Best Practice"
            },
            "content": {
              "urdu": [
                "مسلمان کو ہمیشہ شریعت میں افضل اور آسان عمل کی تلاش کرنی چاہیے۔",
                "اگر پانی مل جائے تو فوراً وضو یا غسل کر لینا ضروری ہے، کیونکہ تیمم عارضی ہے۔",
                "نیا تیمم کرنا افضل ہے، لیکن واجب نہیں، اس لیے آسانی سے کام لیا جا سکتا ہے۔"
              ],
              "english": [
                "A Muslim should always seek the practice that is both superior and easier in Sharia.",
                "If water becomes available, it is mandatory to immediately perform Wudu or Ghusl, as Tayammum is temporary.",
                "Renewing Tayammum is better (Afdal) but not obligatory, so one can take the path of ease."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتباعِ دلیل",
              "english": "Following the Evidence"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک اہم سبق سکھاتی ہے کہ دین میں دلیل کی بنیاد پر عمل کیا جائے۔",
                "کمزور روایات کی بنیاد پر عبادات میں غیر ضروری سختی نہیں کرنی چاہیے۔",
                "صحابی کا قول بھی اسی وقت حجت بنتا ہے جب وہ صحیح سند سے ثابت ہو۔"
              ],
              "english": [
                "This Hadith teaches the crucial lesson of acting in religion based on reliable evidence.",
                "One should not impose unnecessary strictness in worship based on weak narrations.",
                "A Companion's statement only becomes a legal proof when established through an authentic chain."
              ]
            }
          }
        ]
      }
    }
  ]
}
