{
  "hadithId": 1127,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/57"],
    "kitabId": 11,
    "inKitabBab": 2,
    "arabicBook": "كتاب الجهاد",
    "babId": 90
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2167) في كتاب السلام، باب النهي عن ابتداء أهل الكتاب بالسلام وكيف يرد عليهم.",
    "urdu": "صحیح۔ اسے امام مسلم نے کتاب السلام (2167) میں روایت کیا ہے۔ یہ حدیث غیر مسلموں کے ساتھ سماجی برتاؤ کے ایک خاص پہلو کی وضاحت کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (2167) in the Book of Salam, Chapter on the Prohibition of initiating the greeting to the People of the Book."
  },
  "importantWords": [
    {
      "arabic": "لَا تَبْدَؤُوا",
      "english": "Do not initiate",
      "urdu": "پہل نہ کرو"
    },
    {
      "arabic": "بِالسَّلَامِ",
      "english": "With Salam (Greeting)",
      "urdu": "سلام کے ساتھ"
    },
    {
      "arabic": "فَاضْطَرُّوهُ",
      "english": "Compel them / Force them",
      "urdu": "انہیں مجبور کر دو"
    },
    {
      "arabic": "أَضْيَقِهِ",
      "english": "Its narrowest part",
      "urdu": "اس کا سب سے تنگ حصہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مسلمانوں کو یہود و نصاریٰ کے ساتھ سماجی تعلقات میں اسلامی وقار برقرار رکھنے اور سلام میں پہل نہ کرنے کی تعلیم دی گئی ہے۔",
    "english": "This Hadith instructs Muslims on maintaining Islamic dignity in social interactions with Jews and Christians, specifically regarding not being the first to offer the Salam greeting."
  },
  "references": [
    {
      "arabic": "رواه مسلم (2167)",
      "english": "Narrated by Muslim (2167)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dusi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سلام میں پہل نہ کرنے کی حکمت",
        "english": "Wisdom of Not Initiating Salam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظ 'سلام' کا خاص مقام",
              "english": "Special Status of 'Salam'"
            },
            "content": {
              "urdu": [
                "لفظ 'السلام' اللہ کا نام ہے اور یہ اہل جنت کا تحیہ ہے۔",
                "یہ دعا صرف مسلمانوں کے لیے مخصوص ہے جو ایک دوسرے کی سلامتی چاہتے ہیں۔",
                "غیر مسلموں کو سلام میں پہل نہ کرنا ان کی تحقیر نہیں بلکہ اسلامی شعار کا تحفظ ہے۔"
              ],
              "english": [
                "The word 'As-Salam' is one of Allah's names and the greeting of the people of Paradise.",
                "It is a specific prayer of peace meant for believers who share the same faith.",
                "Not initiating it with non-Muslims is about preserving Islamic identity, not personal hatred."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی وقار کا اظہار",
              "english": "Expression of Islamic Dignity"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ اپنے دین پر فخر کرے اور احساسِ کمتری کا شکار نہ ہو۔",
                "سلام میں پہل کرنا اکثر مودت اور دلی محبت کا اظہار ہوتا ہے۔",
                "دین کے معاملے میں مداہنت (سمجھوتہ) سے بچنا ایک مومن کا شیوہ ہے۔"
              ],
              "english": [
                "A Muslim should take pride in their faith and avoid developing an inferiority complex.",
                "Initiating Salam often signifies deep affection and religious intimacy.",
                "Avoiding compromise (mudahanah) in religious distinction is a trait of a believer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راستے کے متعلق حکم کی تشریح",
        "english": "Explaining the Command Regarding the Road"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنگ راستے کا مفہوم",
              "english": "Meaning of the Narrow Path"
            },
            "content": {
              "urdu": [
                "اس کا مطلب یہ نہیں کہ انہیں گڑھے میں دھکیل دیا جائے یا ان پر ظلم کیا جائے۔",
                "بلکہ مقصد یہ ہے کہ مسلمان ان کے لیے اپنا راستہ چھوڑ کر دب کر نہ چلیں۔",
                "یہ حکم اس وقت ہے جب وہ حق کے مقابلے میں تکبر اور دشمنی کا مظاہرہ کریں۔"
              ],
              "english": [
                "This does not mean pushing them into ditches or treating them with physical cruelty.",
                "Rather, it means Muslims should not shrink away or yield their rightful path out of weakness.",
                "This instruction applies when they display arrogance or hostility toward the Truth."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل اور حسنِ اخلاق",
              "english": "Justice and Good Manners"
            },
            "content": {
              "urdu": [
                "اسلام ہر انسان کے ساتھ انصاف اور حسنِ سلوک کی تعلیم دیتا ہے۔",
                "دوسری احادیث میں غیر مسلموں کے حقوق کی ادائیگی کا سختی سے حکم دیا گیا ہے۔",
                "علماء کے نزدیک یہ حکم خاص طور پر اس دور کے لیے تھا جب جنگی حالات یا تناؤ موجود تھا۔"
              ],
              "english": [
                "Islam commands justice and kind treatment toward all human beings.",
                "Other Hadiths strictly enjoin fulfilling the rights of non-Muslim citizens (Dhimmis).",
                "Scholars interpret this specific command in the context of times of political tension or active hostility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جواب دینے کا طریقہ",
        "english": "Method of Responding"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علیک کے ساتھ جواب",
              "english": "Responding with 'Wa 'Alaikum'"
            },
            "content": {
              "urdu": [
                "اگر وہ سلام میں پہل کریں تو جواب میں صرف 'وعلیکم' (اور تم پر بھی) کہنا چاہیے۔",
                "پورا جواب (وعلیکم السلام) کہنے سے اکثر فقہاء نے منع کیا ہے۔",
                "یہ اس لیے ہے تاکہ ان کی دعا یا بددعا کا بدلہ اسی طرح ہو جائے۔"
              ],
              "english": [
                "If they initiate the greeting, one should respond with 'Wa 'Alaikum' (And upon you too).",
                "Most jurists advise against giving the full response 'Wa 'Alaikum Assalam'.",
                "This ensures that whatever prayer or intent they have is reflected back appropriately."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر کلماتِ خیر کی اجازت",
              "english": "Permission for Other Well-Wishes"
            },
            "content": {
              "urdu": [
                "دنیاوی خیر سگالی کے کلمات جیسے 'صبح بخیر' یا 'ہیلو' کہنے میں حرج نہیں۔",
                "مصلحت اور دعوتِ دین کے لیے اچھے انداز میں بات کرنا مطلوب ہے۔",
                "اسلامی اخلاقیات سماجی روابط کو قطع کرنے کے حق میں نہیں ہیں۔"
              ],
              "english": [
                "Using worldly greetings like 'Good morning' or 'Hello' is generally permissible.",
                "Speaking in a kind manner for the sake of public interest or dawah is encouraged.",
                "Islamic ethics do not advocate for complete social isolation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمانی غیرت",
              "english": "Faith-based Honor"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کو اپنے عقیدے کے معاملے میں ہمیشہ باوقار رہنا چاہیے۔",
                "دنیاداری کے لیے اپنے دینی اعزازات کو قربان نہیں کرنا چاہیے۔",
                "نبی ﷺ کی تعلیمات کا مقصد مسلمانوں میں خود اعتمادی پیدا کرنا تھا۔"
              ],
              "english": [
                "A Muslim must always maintain dignity regarding their creed.",
                "Religious distinctions should not be sacrificed for worldly compromise.",
                "The Prophet's (ﷺ) teachings aimed to instill self-confidence in Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم سے پرہیز",
              "english": "Avoiding Oppression"
            },
            "content": {
              "urdu": [
                "وقار برقرار رکھنے کا مطلب دوسروں پر ظلم کرنا ہرگز نہیں ہے۔",
                "غیر مسلموں کے ساتھ لین دین میں دیانت داری اسلام کا بنیادی تقاضا ہے۔",
                "سچی دعوتِ دین ہمارے قول سے زیادہ ہمارے عمل سے ہونی چاہیے۔"
              ],
              "english": [
                "Maintaining dignity does not ever mean oppressing others.",
                "Integrity in dealings with non-Muslims is a fundamental requirement of Islam.",
                "True dawah should be reflected more through our actions than just our words."
              ]
            }
          }
        ]
      }
    }
  ]
}