{
  "hadithId": 184,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["1:5:5"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
  
  "takhreej": {
    "arabic": " صحيح .‏ رواه البخاري (509)‏ ، ومسلم (505)‏ وعند مسلم : \"فليدفع في نحره\" .‏ صحيح .‏ وهي لمسلم (506)‏ من حديث ابن عمر ، ووهم الصنعاني في \"السبل\" فجعلها من حديث أبي هريرة !.‏",
    "urdu": "صحیح۔ اسے بخاری (509) اور مسلم (505) نے روایت کیا ہے۔ اور مسلم کے ہاں یہ الفاظ ہیں: ”تو وہ اس کی گردن میں دھکا دے۔“ صحیح۔ یہ روایت مسلم (506) میں ابن عمرؓ سے ہے، اور صنعانی کو ”السبل“ میں وہم ہوا، تو انہوں نے اسے ابوہریرہؓ کی حدیث قرار دے دیا!",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (509) and Muslim (505). Muslim's wording is: 'Let him push him on his chest/throat (Falyadfa' fī naḥrih).' Authentic (Ṣaḥīḥ). This narration is from Ibn 'Umar in Muslim (506). As-Ṣan'ānī erred in 'As-Subul' by attributing it to Abū Hurayrah!",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "يَسْتُرُهُ مِنْ اَلنَّاسِ",
      "english": "Serves as a Sutrah against people",
      "urdu": "لوگوں سے سترہ قائم کرے"
    },
    {
      "arabic": "أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ",
      "english": "Intends to pass in front of him",
      "urdu": "اس کے آگے سے گزرنے لگے"
    },
    {
      "arabic": "فَلْيَدْفَعْهُ",
      "english": "Let him repel/push him",
      "urdu": "تو وہ اسے روکے"
    },
    {
      "arabic": "فَإِنْ أَبَى فَلْيُقَاتِلْهُ",
      "english": "If he refuses, let him fight him",
      "urdu": "اگر وہ باز نہ آئے تو اس سے لڑائی کرے"
    },
    {
      "arabic": "فَإِنَّمَا هُوَ شَيْطَانٌ",
      "english": "For he is a devil",
      "urdu": "کیونکہ وہ شیطان ہے"
    },
    {
      "arabic": "اَلْقَرِينَ",
      "english": "The Qarin (companion devil)",
      "urdu": "اس کا ساتھی (شیطان)"
    },
    {
      "arabic": "شَيْطَان",
      "english": "Devil/Satan",
      "urdu": "شیطان"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نمازی کو ایک مضبوط حکم دیتی ہے کہ اگر کسی نے سترہ قائم کر رکھا ہو اور کوئی شخص اس کے آگے سے گزرنے کی کوشش کرے تو نمازی کو اسے روکنا چاہیے، اور اگر وہ نہ رُکے تو سختی سے اسے مزاحمت کرنی چاہیے، کیونکہ ایسا شخص شیطان ہے یا وہ شیطانی اثر کے تحت ہے۔ یہ حکم نماز کے تقدس اور خشوع کی حفاظت کے لیے ہے۔",
    "english": "This Hadith gives a strong command to the worshipper: If a Sutrah has been set up and someone attempts to pass in front of it, the worshipper must stop him. If the passerby refuses to yield, the worshipper should resist him vigorously, as such a person is a devil or is acting under a demonic influence. This ruling is aimed at protecting the sanctity and reverence (Khushu') of the prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري (509)",
      "english": "Reported by Al-Bukhārī (509)"
    },
    {
      "arabic": "رواه مسلم (505)",
      "english": "Reported by Muslim (505)"
    },
    {
      "arabic": "رواه مسلم (506) عن ابن عمر",
      "english": "Reported by Muslim (506) from Ibn 'Umar"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abū Sa'īd Al-Khudrī"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "گزرنے والے کو روکنے کا حکم",
        "english": "The Command to Repel the Passerby"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روکنے کا وجوب",
              "english": "Obligation to Repel"
            },
            "content": {
              "urdu": [
                "جب کسی نمازی کے سامنے سترہ ہو تو اس پر لازم ہے کہ وہ گزرنے والے کو ہاتھ یا اشارے سے روکے۔",
                "مسلم کی روایت میں «فليدفع في نحره» (اس کی گردن میں دھکا دے) کا حکم سختی کا اظہار ہے، جو معمولی دھکا دینے کا مطلب ہے۔",
                "یہ حکم اس لیے دیا گیا تاکہ نمازی اپنی نماز اور سترہ کے حقوق کی حفاظت کرے۔"
              ],
              "english": [
                "When a worshipper has a Sutrah, it is obligatory for him to repel the passerby with his hand or a gesture.",
                "Muslim's wording 'Falyadfa' fī naḥrih' (Let him push him on his chest/throat) signifies the seriousness, implying a firm push.",
                "This command is given so that the worshipper defends the sanctity of his prayer and the right of the Sutrah."
              ]
            }
          },
          {
            "title": {
              "urdu": "لڑائی کا حکم اور اس کا مفہوم",
              "english": "The Command to Fight and its Meaning"
            },
            "content": {
              "urdu": [
                "«فَلْيُقَاتِلْهُ» (اس سے لڑائی کرے) سے مراد یہ ہے کہ وہ پوری قوت سے مزاحمت کرے اور اسے ہرگز آگے نہ گزرنے دے۔",
                "جمہور فقہاء کے نزدیک اس سے مراد 'مدافعت' ہے، نہ کہ حقیقی قتل یا شدید لڑائی، جو اس عمل کے گناہ کی شدت کو بیان کرتا ہے۔",
                "یہ حکم نماز کو بچانے کے لیے عملِ کثیر کی اجازت دیتا ہے، جو صرف ضرورت کے تحت جائز ہے۔"
              ],
              "english": [
                "'Falyuqātilhu' (Let him fight him) means he should resist with all his strength and absolutely prevent him from passing.",
                "The majority of jurists interpret this as 'resistance' or 'defensive action,' not actual killing, highlighting the extreme gravity of the sin.",
                "This ruling permits even seemingly excessive movement ('Amal Kathīr) to protect the prayer, which is only allowable under necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گزرنے والے کا وصف (شیطان)",
        "english": "Description of the Passerby (Devil)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان یا قرین",
              "english": "Devil or Qarin (Companion)"
            },
            "content": {
              "urdu": [
                "گزرنے والے کو 'شیطان' قرار دینے کا مطلب یہ ہے کہ وہ شیطانی وسوسوں یا تحریک پر یہ گناہ کر رہا ہے۔",
                "ابن عمرؓ کی روایت میں «معہ القرين» (اس کے ساتھ قرین ہے) کا اضافہ بھی اسی مفہوم کو واضح کرتا ہے کہ شیطان اس کام پر ابھار رہا ہے۔",
                "یہ حکم کسی شخص کی ذات پر طعن نہیں، بلکہ اس عمل کی شدت اور شیطانی وابستگی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Calling the passerby a 'devil' means he is committing this sin due to satanic whispers or incitement.",
                "Ibn 'Umar's narration with the addition 'For with him is the Qarin' reinforces the idea that Satan is encouraging this action.",
                "This is not an insult to the person but indicates the severity of the act and its connection to demonic influence."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان کی پہچان",
              "english": "Identifying the Devil"
            },
            "content": {
              "urdu": [
                "یہاں شیطان سے مراد وہ شخص ہے جو جانتا ہے کہ یہ گزرنا ممنوع ہے، لیکن پھر بھی جان بوجھ کر گزرے۔",
                "یہ حکم نماز کے دوران نمازی کو اس بات کی اجازت دیتا ہے کہ وہ شیطان یا اس کے ساتھیوں کو اپنے اور اللہ کے درمیان نہ آنے دے۔",
                "نماز کی حرمت اور خشوع کو برقرار رکھنا ہر مسلمان کا بنیادی فرض ہے۔"
              ],
              "english": [
                "The 'devil' here refers to the person who knows passing is forbidden yet deliberately proceeds.",
                "This ruling permits the worshipper to prevent the devil or his associates from coming between him and Allah during prayer.",
                "Maintaining the sanctity and reverence of the prayer is a primary duty of every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}
