{
  "hadithId": 914,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/914", "bukhari:5273", "nasai:3463"],
    "kitabId": 8,
    "inKitabBab": 7,
    "arabicBook": "كتاب الطلاق",
    "babId": 70
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5273) ، وأبو داود (2227) ، والترمذي (1185) واللفظ للبخاري. ورواية العدة بحيضة صححها الألباني في صحيح أبي داود.",
    "urdu": "یہ روایت صحیح ہے۔ اسے امام بخاری (5273)، ابوداؤد (2227) اور ترمذی (1185) نے روایت کیا ہے۔ خلع کی عدت ایک حیض ہونے کی روایت کو علامہ البانی نے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5273), Abu Dawud (2227), and At-Tirmidhi (1185). The ruling of one menstrual cycle for Iddah is authenticated by Al-Albani in Sahih Abu Dawud."
  },
  "importantWords": [
    {
      "arabic": "أَعِيبُ",
      "english": "Blame / Find fault",
      "urdu": "عیب لگاتی ہوں"
    },
    {
      "arabic": "أَكْرَهُ",
      "english": "Dislike",
      "urdu": "ناپسند کرتی ہوں"
    },
    {
      "arabic": "الْكُفْرَ",
      "english": "Ingratitude / Disbelief",
      "urdu": "ناشکری / کفر"
    },
    {
      "arabic": "حَدِيقَتَهُ",
      "english": "His garden",
      "urdu": "اس کا باغ"
    },
    {
      "arabic": "اِخْتَلَعَتْ",
      "english": "Divorced by Khul'",
      "urdu": "خلع کیا"
    },
    {
      "arabic": "حَيْضَةً",
      "english": "Menstrual cycle",
      "urdu": "ایک حیض"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اسلام میں خلع کے قانون کی بنیاد ہے، جس میں عورت کو ناپسندیدگی کی صورت میں مہر واپس کر کے علیحدگی کا حق دیا گیا ہے۔",
    "english": "This Hadith forms the legal basis for Khul' in Islam, allowing a woman to seek divorce by returning the dower if she cannot live with her husband."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5273)",
      "english": "Reported by Al-Bukhari (5273)"
    },
    {
      "arabic": "رواه أبو داود (2227)",
      "english": "Reported by Abu Dawud (2227)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خلع کی حقیقت اور مشروعیت",
        "english": "Reality and Legitimacy of Khul'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خلع کا تصور",
              "english": "Concept of Khul'"
            },
            "content": {
              "urdu": [
                "خلع وہ علیحدگی ہے جو عورت کی طرف سے مہر کی واپسی کے بدلے ہوتی ہے۔",
                "اسلام نے مرد کو طلاق کا حق دیا تو عورت کو خلع کا حق عطا کیا۔",
                "یہ قانون خاندانی نظام میں توازن اور عورت کی آزادی کو یقینی بناتا ہے۔"
              ],
              "english": [
                "Khul' is the separation initiated by the wife in exchange for returning dower.",
                "While Islam gave men the right to divorce, it granted women the right to Khul'.",
                "This law ensures balance in the family system and protects women's freedom."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلع کی وجوہات",
              "english": "Reasons for Khul'"
            },
            "content": {
              "urdu": [
                "صرف بدصورتی یا قلبی عدمِ میلان کی بنیاد پر بھی خلع لیا جا سکتا ہے۔",
                "اگر عورت کو ڈر ہو کہ وہ حدود اللہ قائم نہ رکھ سکے گی تو خلع جائز ہے۔",
                "ثابت بن قیس کی اہلیہ نے ان کے دین یا اخلاق کی برائی نہیں کی تھی۔"
              ],
              "english": [
                "Khul' can be sought based on physical dislike or lack of emotional affinity.",
                "It is permissible if the wife fears she cannot fulfill the limits of Allah.",
                "Thabit bin Qais's wife did not criticize his character or religious practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات اور مہر",
        "english": "Juristic Rulings and Dower"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہر کی واپسی",
              "english": "Return of the Dower"
            },
            "content": {
              "urdu": [
                "خلع کے بدلے شوہر کو وہی مہر واپس ملتا ہے جو اس نے دیا تھا۔",
                "جمہور علماء کے نزدیک مہر سے زیادہ لینا ناپسندیدہ مگر جائز ہے۔",
                "نبی کریم ﷺ نے باغ واپس کرنے کو خلع کی شرط قرار دیا تھا۔"
              ],
              "english": [
                "In Khul', the husband receives back the dower he originally provided.",
                "Most scholars consider taking more than the dower disliked but valid.",
                "The Prophet (ﷺ) stipulated the return of the garden as a condition for Khul'."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدتِ خلع",
              "english": "Waiting Period for Khul'"
            },
            "content": {
              "urdu": [
                "خلع حاصل کرنے والی عورت کی عدت صرف ایک حیض مقرر کی گئی ہے۔",
                "عام طلاق کی عدت تین حیض ہے، مگر خلع میں اسے کم کیا گیا ہے۔",
                "اس کا مقصد صرف رحم کی صفائی اور حمل کا اطمینان کرنا ہے۔"
              ],
              "english": [
                "The waiting period (Iddah) for Khul' is fixed at one menstrual cycle.",
                "Regular divorce requires three cycles, but Khul' has been reduced.",
                "The purpose is solely to ensure the womb is clear and there is no pregnancy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور نفسیاتی پہلو",
        "english": "Social and Psychological Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبردستی کے رشتے کی ممانعت",
              "english": "Prohibition of Forced Relationships"
            },
            "content": {
              "urdu": [
                "اسلام کسی عورت کو ایسی زندگی پر مجبور نہیں کرتا جو وہ نہیں چاہتی۔",
                "قلبی نفرت کے ساتھ نباہ کرنا دونوں کے لیے گناہ کا سبب بن سکتا ہے۔",
                "خلع کا راستہ معاشرے میں فساد اور بے راہ روی کو روکتا ہے۔"
              ],
              "english": [
                "Islam does not force a woman into a living situation she finds unbearable.",
                "Living together despite deep-seated hatred can lead to sins for both.",
                "The path of Khul' prevents corruption and moral decay in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناموافقت اور کفر",
              "english": "Incompatibility and Ingratitude"
            },
            "content": {
              "urdu": [
                "حدیث میں 'کفر' سے مراد شوہر کی ناشکری یا ناموافقت ہے۔",
                "عورت کو خوف تھا کہ نفرت کی وجہ سے وہ شوہر کے حقوق ادا نہ کر سکے گی۔",
                "یہ دیانت داری ایمان کی علامت ہے کہ انسان حدودِ الہی کا خیال رکھے۔"
              ],
              "english": [
                "In this Hadith, 'Kufr' refers to ingratitude or marital incompatibility.",
                "The wife feared her dislike would lead to neglecting her husband's rights.",
                "This honesty is a sign of faith, prioritizing the limits set by Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی نظامِ عدل",
        "english": "Islamic Judicial System"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالت کا کردار",
              "english": "Role of the Court"
            },
            "content": {
              "urdu": [
                "اگر شوہر خلع پر راضی نہ ہو تو قاضی اسے مجبور کر سکتا ہے۔",
                "نبی کریم ﷺ نے ثابت بن قیس کو باغ لے کر طلاق دینے کا حکم دیا۔",
                "عدالت کا کام فریقین کے حقوق کا تحفظ اور انصاف فراہم کرنا ہے۔"
              ],
              "english": [
                "If the husband refuses Khul', the judge (Qadi) can compel him.",
                "The Prophet (ﷺ) ordered Thabit to take the garden and grant the divorce.",
                "The court's role is to protect the rights of both parties and provide justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "پہلا خلع",
              "english": "The First Khul'"
            },
            "content": {
              "urdu": [
                "یہ واقعہ اسلام کی تاریخ میں پہلا خلع قرار دیا جاتا ہے۔",
                "اس سے ثابت ہوتا ہے کہ اسلامی قانون ارتقائی اور فطری ہے۔",
                "قیامت تک کے لیے یہ واقعہ خواتین کے حقوق کی دستاویز بن گیا۔"
              ],
              "english": [
                "This incident is recognized as the first case of Khul' in Islamic history.",
                "It proves that Islamic law is progressive and aligned with nature.",
                "This event became a lasting charter for women's rights until the end of time."
              ]
            }
          }
        ]
      }
    }
  ]
}