{
  "hadithId": 866,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/56"],
    "kitabId": 8,
    "inKitabBab": 2,
    "arabicBook": "كتاب النكاح",
    "babId": 65
  },
 
  "takhreej": {
    "arabic": "ضعيف من هذا الوجه وصحيح من وجه آخر . رواه ابن أبي شيبة (17282) وعبد الرزاق (10328). ورواه ابن أبي شيبة عن ابن مسعود بسند صحيح بلفظ: 'يؤجل العنين سنة، فإن جامع وإلا فرق بينهما'.",
    "urdu": "یہ روایت اس سند سے ضعیف ہے مگر دیگر اسناد اور ابن مسعود رضی اللہ عنہ سے مروی صحیح روایت سے اس کی تائید ہوتی ہے۔ اسے ابن ابی شیبہ اور عبدالرزاق نے روایت کیا ہے۔",
    "english": "Weak through this specific chain but authentic through others. Reported by Ibn Abi Shaybah (17282) and Abdur Razzaq. A Sahih version from Ibn Mas'ud confirms: 'The impotent is given a year; if he has intercourse, fine; otherwise, they are separated.'"
  },
  "importantWords": [
    {
      "arabic": "قَضَى",
      "english": "Decided / Adjudicated",
      "urdu": "فیصلہ کیا"
    },
    {
      "arabic": "الْعِنِّينِ",
      "english": "Impotent man",
      "urdu": "نامرد / وہ مرد جو ہمبستری پر قادر نہ ہو"
    },
    {
      "arabic": "يُؤَجَّلَ",
      "english": "To be delayed / Given a period",
      "urdu": "مہلت دی جائے"
    },
    {
      "arabic": "سَنَةً",
      "english": "One year",
      "urdu": "ایک سال"
    },
    {
      "arabic": "ثِقَاتٌ",
      "english": "Trustworthy narrators",
      "urdu": "قابلِ اعتماد راوی"
    }
  ],
  "summary": {
    "urdu": "سیدنا عمر رضی اللہ عنہ کے فیصلے کے مطابق اگر شوہر میں جسمانی کمزوری یا نامردی کا مسئلہ ہو، تو اسے علاج کے لیے ایک سال کی مہلت دی جائے گی، بصورتِ دیگر نکاح فسخ کر دیا جائے گا۔",
    "english": "According to Umar's (RA) verdict, an impotent husband is granted a one-year grace period for medical recovery; if he fails to consumate the marriage after that, annulment is granted."
  },
  "references": [
    {
      "arabic": "مصنف ابن أبي شيبة، كتاب النكاح، رقم الحديث ١٧٢٨٢",
      "english": "Musannaf Ibn Abi Shaybah, Book of Marriage, Hadith No. 17282"
    },
    {
      "arabic": "مصنف عبد الرزاق، رقم الحديث ١٠٣٢٨",
      "english": "Musannaf Abdur Razzaq, Hadith No. 10328"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعيد بن المسيب",
        "english": "Sa'id bin al-Musayyib"
      },
      "slug": "said-bin-al-musayyib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح عن الصحابة",
    "english": "Authentic (Athar from Sahaba)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عنین (نامرد) کا شرعی حکم",
        "english": "Legal Status of the Impotent Man"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کے مقاصد اور عیب",
              "english": "Objectives of Marriage and Defects"
            },
            "content": {
              "urdu": [
                "نکاح کا ایک بنیادی مقصد عفت و عصمت کی حفاظت اور نسلِ انسانی کی بقا ہے۔",
                "اگر شوہر جنسی طور پر معذور ہو تو نکاح کا یہ مقصد فوت ہو جاتا ہے۔",
                "شریعت نے ایسی صورت میں عورت کو علیحدگی اختیار کرنے کا حق دیا ہے۔"
              ],
              "english": [
                "A primary goal of marriage is preserving chastity and the continuation of the human race.",
                "If the husband is sexually incapacitated, this fundamental objective of marriage is lost.",
                "Shariah grants the wife the right to seek separation in such circumstances to prevent harm."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایک سال کی مہلت کی حکمت",
              "english": "Wisdom of the One-Year Grace Period"
            },
            "content": {
              "urdu": [
                "سیدنا عمر رضی اللہ عنہ نے ایک سال کی مدت اس لیے مقرر کی تاکہ چاروں موسم گزر جائیں۔",
                "بعض اوقات بیماری موسمی اثرات یا عارضی نفسیاتی دباؤ کی وجہ سے ہوتی ہے۔",
                "ایک سال کی مدت علاج اور طبی معائنے کے لیے کافی وقت فراہم کرتی ہے۔"
              ],
              "english": [
                "Umar (RA) specified a one-year period to allow all four seasons to pass for the individual.",
                "Sometimes incapacity is due to seasonal effects or temporary psychological stress.",
                "The duration of one year provides ample time for medical treatment and recovery."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عورت کے حقوق کا تحفظ",
        "english": "Protection of Women's Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان سے بچنے کا حق",
              "english": "Right to Avoid Harm"
            },
            "content": {
              "urdu": [
                "عورت کو یہ حق حاصل ہے کہ وہ ایک مکمل اور صحت مند ازدواجی زندگی گزارے۔",
                "شوہر کی نامردی عورت کے لیے فتنہ اور گناہ کی طرف مائل ہونے کا سبب بن سکتی ہے۔",
                "اسلامی قانون 'لا ضرر ولا ضرار' (نہ نقصان اٹھاؤ نہ پہنچاؤ) کے اصول پر مبنی ہے۔"
              ],
              "english": [
                "A woman has the right to lead a fulfilling and healthy marital life.",
                "Husband's impotence can lead to fitnah and the temptation toward sinful behavior for the wife.",
                "Islamic law is based on the maxim 'No harm shall be inflicted nor reciprocated'."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدالتی مداخلت اور فسخِ نکاح",
              "english": "Judicial Intervention and Annulment"
            },
            "content": {
              "urdu": [
                "اگر ایک سال کے بعد بھی شوہر ہمبستری پر قادر نہ ہو، تو قاضی نکاح فسخ کر دے گا۔",
                "یہ علیحدگی طلاقِ بائن کے حکم میں ہوگی تاکہ عورت کسی اور سے نکاح کر سکے۔",
                "عورت کی مرضی کے بغیر اسے ایسے رشتے میں مجبوراً باندھ کر نہیں رکھا جا سکتا۔"
              ],
              "english": [
                "If the husband remains unable to consummate after a year, the judge annuls the marriage.",
                "This separation functions as an irrevocable divorce, allowing the woman to remarry.",
                "A woman cannot be forced to remain in such a union against her will and interests."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ضوابط",
        "english": "Juristic Regulations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرائطِ دعویٰ",
              "english": "Conditions of the Claim"
            },
            "content": {
              "urdu": [
                "یہ حق صرف اس صورت میں ہے جب بیوی کو نکاح سے پہلے عیب کا علم نہ ہو۔",
                "اگر بیوی عیب جانتے ہوئے نکاح پر راضی ہوئی، تو اسے فسخ کا حق نہیں ملے گا۔",
                "دعویٰ ثابت کرنے کے لیے طبی ماہرین کی رائے اور شہادت کو اہمیت دی جاتی ہے۔"
              ],
              "english": [
                "This right exists only if the wife was unaware of the defect before the marriage contract.",
                "If she consented to the marriage knowing the defect, she forfeits the right to annulment.",
                "Medical expert opinions and testimonies are prioritized to prove the claim in court."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہر کا حکم",
              "english": "Ruling on Mahr"
            },
            "content": {
              "urdu": [
                "اگر خلوتِ صحیحہ (تنہائی) ہو چکی ہو تو عورت پورے مہر کی حقدار ہوتی ہے۔",
                "فسخِ نکاح کی صورت میں عورت کی عدت لازم ہوتی ہے تاکہ نسب کی حفاظت ہو۔",
                "اسلامی فقہ میں ہر ممکن کوشش کی جاتی ہے کہ فریقین میں سے کسی کی حق تلفی نہ ہو۔"
              ],
              "english": [
                "If valid privacy (Khalwa) has occurred, the woman is entitled to the full dower (Mahr).",
                "Upon annulment, the waiting period (Iddah) is mandatory to ensure lineage protection.",
                "Islamic jurisprudence strives to ensure that neither party's rights are violated during the process."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلفائے راشدین کا اسوہ",
        "english": "Example of the Rightly Guided Caliphs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عمر رضی اللہ عنہ کی بصیرت",
              "english": "Vision of Umar (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عمر کے فیصلے قرآن و سنت کی روح کے عین مطابق اور عدل پر مبنی ہوتے تھے۔",
                "انہوں نے معاشرتی مسائل کے حل کے لیے واضح پیمانے اور مدتیں مقرر فرمائیں۔",
                "صحابہ کرام کے آثار اسلامی قانون سازی میں ایک بنیادی ماخذ کی حیثیت رکھتے ہیں۔"
              ],
              "english": [
                "Umar's (RA) decisions were perfectly aligned with the spirit of the Quran and Sunnah.",
                "He established clear standards and timeframes to resolve complex social and marital issues.",
                "The precedents of the Companions serve as a fundamental source for Islamic legislation."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماعِ صحابہ",
              "english": "Consensus of the Companions"
            },
            "content": {
              "urdu": [
                "سیدنا ابن مسعود اور مغیرہ بن شعبہ رضی اللہ عنہم سے بھی اسی طرح کے فیصلے منقول ہیں۔",
                "اس مسئلے پر صحابہ کا اتفاق اس کی شرعی اہمیت کو واضح کرتا ہے۔",
                "امتِ مسلمہ نے ہمیشہ صحابہ کے ان اجتہادی فیصلوں سے رہنمائی حاصل کی ہے۔"
              ],
              "english": [
                "Similar verdicts are narrated from Ibn Mas'ud and Mughira bin Shu'bah (RA).",
                "The agreement of the Companions on this issue highlights its legal and social weight.",
                "The Muslim Ummah has always derived guidance from these Ijtihadi rulings of the Sahaba."
              ]
            }
          }
        ]
      }
    }
  ]
}