{
  "hadithId": 623,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": ["bulugh/623"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1942)، والبيهقي (5/140). وإن كان الإمام أحمد قد أنكره قديماً إلا أن الشواهد من حديث ابن عباس وأسماء بنت أبي بكر تقويه وتثبت جواز الدفع للضعفة والنساء ليلاً.",
    "urdu": "صحیح۔ اسے ابوداؤد (1942) نے روایت کیا ہے۔ اگرچہ امام احمد جیسے جلیل القدر محدثین نے اس کے کچھ حصوں پر کلام کیا ہے، لیکن دیگر صحیح احادیث (ابن عباس اور اسماء بنت ابی بکر سے مروی) اس بات کی تائید کرتی ہیں کہ خواتین اور معذوروں کے لیے رات میں مزدلفہ سے نکلنا اور صبح سے پہلے رمی کرنا جائز ہے۔",
    "english": "Sahih. Reported by Abu Dawud (1942). Although Imam Ahmad and others raised technical concerns about the wording, multiple supporting narrations (from Ibn 'Abbas and Asma' bint Abi Bakr) confirm the permissibility for women and the weak to leave Muzdalifah and stone the pillars before dawn."
  },
  "importantWords": [
    {
      "arabic": "لَيْلَةَ اَلنَّحْرِ",
      "english": "Night of Sacrifice",
      "urdu": "قربانی کی رات (10 ذوالحجہ کی رات)"
    },
    {
      "arabic": "فَرَمَتِ",
      "english": "She stoned",
      "urdu": "اس نے کنکریاں ماریں / رمی کی"
    },
    {
      "arabic": "فَأَفَاضَتْ",
      "english": "She performed Tawaf al-Ifadah",
      "urdu": "اس نے طوافِ افاضہ کیا"
    },
    {
      "arabic": "قَبْلَ اَلْفَجْرِ",
      "english": "Before Dawn",
      "urdu": "فجر سے پہلے"
    }
  ],
  "summary": {
    "urdu": "خواتین اور کمزوروں کے لیے یہ شرعی رعایت ہے کہ وہ ہجوم سے بچنے کے لیے 10 ذوالحجہ کی صبح صادق سے پہلے ہی جمرہ عقبہ کی رمی اور طوافِ افاضہ کر سکتے ہیں۔",
    "english": "There is a Sharia concession for women and the weak to stone the Jamrat al-Aqaba and perform Tawaf al-Ifadah before dawn on the 10th of Dhul-Hijjah to avoid the crowds."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1942)",
      "english": "Reported by Abu Dawud (1942)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أم سلمة هند بنت أبي أمية",
        "english": "Umm Salamah Hind bint Abi Umayyah"
      },
      "slug": "umm-salamah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رمی کا وقت اور خواتین کے لیے رعایت",
        "english": "Time of Ramy and Concessions for Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فجر سے پہلے رمی کا جواز",
              "english": "Permissibility of Ramy before Dawn"
            },
            "content": {
              "urdu": [
                "عام حاجیوں کے لیے سنت یہ ہے کہ وہ سورج نکلنے کے بعد جمرہ عقبہ کی رمی کریں۔",
                "سیدہ ام سلمہ کا واقعہ بتاتا ہے کہ عورتوں کے لیے فجر سے پہلے (رات کے آخری پہر میں) رمی کرنا جائز ہے۔",
                "یہ رعایت اس لیے دی گئی تاکہ وہ مردوں کے شدید ہجوم میں دھکم پیل اور اذیت سے محفوظ رہیں۔"
              ],
              "english": [
                "The Sunnah for general pilgrims is to stone the Jamrat al-Aqaba after sunrise.",
                "Umm Salamah's (RA) report indicates that it is permissible for women to stone before dawn (in the last part of the night).",
                "This concession is granted to protect them from the physical hardship and congestion of the massive crowd."
              ]
            }
          },
          {
            "title": {
              "urdu": "مزدلفہ سے پہلے روانگی",
              "english": "Early Departure from Muzdalifah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنے گھر والوں (سودہ اور ام سلمہ) کو مزدلفہ سے رات ہی کو روانہ کر دیا تھا۔",
                "چاند چھپنے کے بعد یا آدھی رات کے بعد مزدلفہ سے منیٰ کی طرف جانا سنت سے ثابت ہے۔",
                "اسلامی شریعت انسانی جان کی حفاظت اور تنگی کو دور کرنے پر خصوصی توجہ دیتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) allowed members of his household to leave Muzdalifah for Mina during the night.",
                "Departing from Muzdalifah after the moon sets or after midnight is established from the Sunnah for those with excuses.",
                "Islamic Sharia places high priority on protecting human life and removing undue hardship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طوافِ افاضہ کی جلدی",
        "english": "Haste in Tawaf al-Ifadah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمی کے بعد مکہ روانگی",
              "english": "Heading to Makkah after Ramy"
            },
            "content": {
              "urdu": [
                "ام سلمہ نے فجر سے پہلے رمی کی اور پھر فوراً مکہ جا کر طوافِ افاضہ (زیارت) کیا۔",
                "طوافِ افاضہ حج کا رکنِ اعظم ہے جس کے بغیر حج مکمل نہیں ہوتا۔",
                "عورتوں کے لیے رات کے وقت طواف کرنا پردے اور سکون کے لحاظ سے زیادہ بہتر ہے۔"
              ],
              "english": [
                "Umm Salamah (RA) performed Ramy before dawn and immediately headed to Makkah for Tawaf al-Ifadah.",
                "Tawaf al-Ifadah is a primary pillar of Hajj without which Hajj is incomplete.",
                "Performing Tawaf at night is often more suitable for women regarding privacy and ease of movement."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترتیبِ مناسک میں وسعت",
              "english": "Flexibility in the Order of Rituals"
            },
            "content": {
              "urdu": [
                "نبی ﷺ سے پوچھا گیا کہ اگر کوئی رمی، قربانی یا طواف کی ترتیب بدل دے تو کیا حکم ہے؟",
                "آپ ﷺ نے ہر بار یہی فرمایا: 'کرو اور کوئی حرج نہیں' (افعل ولا حرج)۔",
                "ام سلمہ کا فجر سے پہلے یہ کام کرنا اسی وسعت اور آسانی کا حصہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was asked about changing the order of stoning, sacrificing, and Tawaf.",
                "He repeatedly replied: \"Do it, and there is no harm\" (If'al wa la haraj).",
                "Umm Salamah's actions before dawn fall under this general category of ease and flexibility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی بحث اور علمی نکتہ",
        "english": "Juristic Discussion and Scholarly Point"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی حیثیت",
              "english": "Status of the Chain"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر نے اسے مسلم کی شرط پر قرار دیا، جو کہ اس کی مضبوطی کی دلیل ہے۔",
                "اگرچہ بعض ائمہ نے اس کے کسی راوی پر جرح کی، لیکن مفہومِ حدیث دیگر صحیح روایات کے موافق ہے۔",
                "فقہاء نے اس حدیث سے یہ مسئلہ نکالا ہے کہ عذر کی حالت میں فجر سے پہلے رمی جائز ہے۔"
              ],
              "english": [
                "Ibn Hajar classified the chain according to Muslim's criteria, indicating its strength.",
                "Although some Imams critiqued specific narrators, the meaning aligns with other authentic reports.",
                "Jurists derive from this Hadith that Ramy before dawn is permissible in cases of necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورتوں کے لیے نمازِ فجر کہاں؟",
              "english": "Where should women pray Fajr?"
            },
            "content": {
              "urdu": [
                "سیدہ ام سلمہ نے فجر کی نماز منیٰ میں پڑھی یا مکہ پہنچ کر، اس میں دونوں احتمال ہیں۔",
                "اصل یہ ہے کہ وہ فجر کے وقت تک مزدلفہ سے نکل چکی تھیں تاکہ ہجوم میں نہ پھنسیں۔",
                "مومن عورت کو چاہیے کہ وہ اپنی عبادت کے ساتھ ساتھ اپنی عفت و حیا کا بھی خیال رکھے۔"
              ],
              "english": [
                "Whether Umm Salamah (RA) prayed Fajr in Mina or upon reaching Makkah is debated.",
                "The key point is that she had departed Muzdalifah by Fajr time to avoid the congestion.",
                "A believing woman should be mindful of her modesty and safety alongside her worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواتین کا احترام اور سہولت",
              "english": "Respect and Facility for Women"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنی ازواج کے لیے خصوصی انتظام فرمایا تاکہ انہیں حج میں مشقت نہ ہو۔",
                "گھر کے ذمہ داروں کو چاہیے کہ وہ سفرِ حج میں خواتین کی ضروریات اور کمزوری کا لحاظ رکھیں۔",
                "دین میں دی گئی رخصتوں پر عمل کرنا بھی اللہ کی اطاعت کا حصہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) made special arrangements for his wives to ensure they didn't suffer during Hajj.",
                "Heads of households should consider the needs and physical limits of women during the pilgrimage.",
                "Utilizing the concessions provided in religion is a form of obedience to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہجوم کے انتظام کی حکمت",
              "english": "Wisdom of Crowd Management"
            },
            "content": {
              "urdu": [
                "اگر سب لوگ ایک ہی وقت میں رمی کے لیے نکلیں گے تو جان کا خطرہ ہو سکتا ہے۔",
                "اسلام نے چودہ سو سال پہلے ہی اوقات کی تقسیم کے ذریعے ہجوم کو سنبھالنے کا طریقہ سکھایا۔",
                "دوسروں کے لیے راستہ چھوڑنا اور جگہ دینا حج کی اصل روح ہے۔"
              ],
              "english": [
                "If everyone departs for Ramy at the same time, it can lead to life-threatening situations.",
                "Islam taught crowd management 1,400 years ago by distributing ritual times.",
                "Leaving a path for others and making space is the true spirit of Hajj."
              ]
            }
          }
        ]
      }
    }
  ]
}