{
  "hadithId": 1101,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/22"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (3141)، ومسلم (1752) في كتاب الجهاد والسير، باب استحقاق القاتل سلب القتيل.",
    "urdu": "صحیح۔ اسے امام بخاری (3141) اور امام مسلم (1752) نے روایت کیا ہے۔ یہ روایت اس بات کی دلیل ہے کہ مقتول کا سامان اسی کو ملتا ہے جو اسے قتل کرے۔",
    "english": "Sahih. Reported by Al-Bukhari (3141) and Muslim (1752) in the Book of Jihad, Chapter on the killer's right to the spoils of the person he killed."
  },
  "importantWords": [
    {
      "arabic": "فَابْتَدَرَاهُ",
      "english": "They raced towards him",
      "urdu": "وہ دونوں اس کی طرف لپکے"
    },
    {
      "arabic": "مَسَحْتُمَا",
      "english": "You both wiped",
      "urdu": "تم دونوں نے پونچھا / صاف کیا"
    },
    {
      "arabic": "سَلْبُهُ",
      "english": "His spoils (personal gear)",
      "urdu": "اس کا ساز و سامان (مقتول کا)"
    },
    {
      "arabic": "كِلَاكُمَا",
      "english": "Both of you",
      "urdu": "تم دونوں نے"
    },
    {
      "arabic": "انْصَرَفَا",
      "english": "They both returned",
      "urdu": "وہ دونوں واپس لوٹے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ابوجہل کے قتل کا واقعہ اور یہ شرعی اصول بیان ہوا ہے کہ میدانِ جنگ میں دشمن کو قتل کرنے والے کو اس کا ذاتی سامان (سلب) انعام کے طور پر ملتا ہے۔",
    "english": "This Hadith details the killing of Abu Jahl and establishes the rule that the personal belongings of a slain enemy soldier are awarded to the one who killed him."
  },
  "references": [
    {
      "arabic": "رواه البخاري (3141)",
      "english": "Narrated by Al-Bukhari (3141)"
    },
    {
      "arabic": "رواه مسلم (1752)",
      "english": "Narrated by Muslim (1752)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الرحمن بن عوف",
        "english": "Abdur-Rahman bin 'Auf"
      },
      "slug": "abdur-rahman-bin-auf"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قتلِ ابوجہل کا واقعہ",
        "english": "The Killing of Abu Jahl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کم عمر صحابہ کی شجاعت",
              "english": "Bravery of Young Companions"
            },
            "content": {
              "urdu": [
                "معاذ اور معوذ دو کم عمر بھائی تھے جنہوں نے ابوجہل کو مارنے کا عزم کیا تھا۔",
                "انہوں نے عبدالرحمٰن بن عوف سے پوچھا تھا کہ ابوجہل کون ہے کیونکہ اس نے اللہ کے رسول کو گالی دی تھی۔",
                "یہ واقعہ نوجوان صحابہ کے دلوں میں عشقِ رسول ﷺ اور غیرتِ ایمانی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Mu'adh and Mu'awwidh were two young brothers who resolved to kill Abu Jahl.",
                "They asked Abdur-Rahman bin Auf to point him out because he had insulted the Prophet (ﷺ).",
                "This incident highlights the intense love for the Prophet and religious zeal among young Sahaba."
              ]
            }
          },
          {
            "title": {
              "urdu": "تلواروں کا معائنہ",
              "english": "Inspection of the Swords"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ان سے پوچھا کہ کیا تم نے تلواریں صاف کر لی ہیں تاکہ سچائی کا ثبوت مل سکے۔",
                "تلواروں پر خون کے نشانات اس بات کی گواہی دے رہے تھے کہ دونوں نے وار کیے ہیں۔",
                "آپ ﷺ نے دونوں کی محنت کو سراہا اور دونوں کو قتل میں شریک قرار دیا۔"
              ],
              "english": [
                "The Prophet (ﷺ) asked if they wiped their swords to verify the truth of their claim.",
                "Bloodstains on the swords served as physical evidence that both had struck him.",
                "The Prophet (ﷺ) praised their efforts and declared them both participants in the kill."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سلب (مقتول کے سامان) کا حکم",
        "english": "Ruling on 'Salab' (Spoils of the Slain)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاتل کا حق",
              "english": "The Right of the Killer"
            },
            "content": {
              "urdu": [
                "اسلامی قانون کے مطابق دشمن کا ذاتی سامان (زرہ، ہتھیار، گھوڑا) قاتل کو ملتا ہے۔",
                "اس سامان کو 'سلب' کہا جاتا ہے اور یہ عام مالِ غنیمت کے پانچویں حصے (خمس) سے مستثنیٰ ہے۔",
                "یہ انعام مجاہدین کی حوصلہ افزائی اور دشمن کے بڑے مہروں کو نشانہ بنانے کے لیے ہے۔"
              ],
              "english": [
                "According to Islamic law, the personal gear of the enemy goes to the one who kills him.",
                "This is called 'Salab' and is exempt from the standard one-fifth (Khums) distribution.",
                "This incentive encourages warriors and targets high-value enemy leaders."
              ]
            }
          },
          {
            "title": {
              "urdu": "فیصلے کی حکمت",
              "english": "Wisdom of the Decision"
            },
            "content": {
              "urdu": [
                "اگرچہ دونوں شریک تھے، مگر آپ ﷺ نے سامان صرف معاذ بن عمرو کو دینے کا فیصلہ کیا۔",
                "فقہاء کے مطابق شاید معاذ کا وار زیادہ کاری تھا یا وہ پہلے پہنچے تھے۔",
                "حاکمِ وقت کو اختیار ہے کہ وہ حالات دیکھ کر سلب کی تقسیم کا فیصلہ کرے۔"
              ],
              "english": [
                "Although both were involved, the Prophet (ﷺ) awarded the spoils specifically to Mu'adh bin 'Amr.",
                "Jurists suggest Mu'adh's strike might have been more fatal or he reached him first.",
                "The ruler has the authority to decide on 'Salab' distribution based on specific circumstances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدل و انصاف کی مثال",
        "english": "An Example of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق اور ثبوت",
              "english": "Investigation and Proof"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے محض دعوے پر فیصلہ نہیں کیا بلکہ تلواروں کا معائنہ فرمایا۔",
                "یہ عدالتی نظام کے لیے ایک سبق ہے کہ فیصلے ٹھوس ثبوتوں کی بنیاد پر ہونے چاہئیں۔",
                "آپ ﷺ نے دونوں نوجوانوں کا مان رکھا اور ان کی بہادری کو تسلیم کیا۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not judge based on claims alone but inspected the physical evidence.",
                "This serves as a lesson for judiciary systems that rulings must be based on solid proof.",
                "He honored both young men and formally recognized their bravery on the field."
              ]
            }
          },
          {
            "title": {
              "urdu": "دشمنِ خدا کا انجام",
              "english": "The End of Allah's Enemy"
            },
            "content": {
              "urdu": [
                "ابوجہل قریش کا سب سے بڑا فرعون تھا جس نے اسلام کو مٹانے کی ہر ممکن کوشش کی۔",
                "اللہ نے اسے ان بچوں کے ہاتھوں ذلیل کروایا جن کو وہ حقیر سمجھتا تھا۔",
                "یہ واقعہ ظالموں کے لیے عبرت ہے کہ اللہ کا دین ہمیشہ غالب رہتا ہے۔"
              ],
              "english": [
                "Abu Jahl was the Pharaoh of the Quraysh, who tried everything to destroy Islam.",
                "Allah humiliated him at the hands of youngsters whom he considered insignificant.",
                "This incident is a warning to tyrants that Allah's religion will always prevail."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیرتِ ایمانی",
              "english": "Religious Honor"
            },
            "content": {
              "urdu": [
                "صحابہ کرام کے نزدیک سب سے بڑی تکلیف اللہ اور اس کے رسول کی شان میں گستاخی تھی۔",
                "نوجوانوں کا جوش اس بات کی علامت ہے کہ ایمان عمر کا محتاج نہیں ہوتا۔",
                "دین کے دفاع کے لیے ہر مسلمان کو ہمہ وقت تیار رہنا چاہیے۔"
              ],
              "english": [
                "For the Sahaba, the greatest pain was any insult to Allah and His Messenger.",
                "The zeal of the youth signifies that faith is not dependent on age.",
                "Every Muslim should remain ready at all times to defend the faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالِ غنیمت کی حقیقت",
              "english": "Reality of War Booty"
            },
            "content": {
              "urdu": [
                "جہاد میں مال مقصد نہیں ہوتا بلکہ یہ اللہ کی طرف سے ایک اضافی فضل ہے۔",
                "صحابہ نے کبھی مال کے لیے نہیں بلکہ اللہ کی رضا کے لیے جنگ لڑی۔",
                "مال کی تقسیم کے احکامات معاشرے میں نظم و ضبط پیدا کرنے کے لیے ہیں۔"
              ],
              "english": [
                "Wealth is not the goal of Jihad; it is an additional grace from Allah.",
                "The Sahaba fought for Allah's pleasure, never for material gain.",
                "Rulings on property distribution are meant to instill discipline in society."
              ]
            }
          }
        ]
      }
    }
  ]
}