{
  "hadithId": 1026,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1176"],
    "kitabId": 9,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام",
    "babId": 82
  },
  
  "takhreej": {
    "arabic": "صحيح رواه مسلم (1852). وزاد: \"على رجل واحد، يريد أن يشق عصاكم، أو يفرق جماعتكم، فاقتلوه\".",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے (1852) پر روایت کیا ہے۔ اس میں یہ الفاظ بھی ہیں: 'ایک آدمی پر متفق ہو، اور وہ تمہاری لاٹھی توڑنا (وحدت ختم کرنا) چاہے یا جماعت میں تفریق پیدا کرے تو اسے قتل کر دو۔'",
    "english": "Sahih (Authentic). Reported by Muslim (1852). Additional wording states: '...united under one man, and he seeks to break your strength or divide your unity, then kill him.'"
  },
  "importantWords": [
    {
      "arabic": "أَمَرَكُمْ",
      "english": "Your leadership / command",
      "urdu": "تمہارا معاملہ / امیر"
    },
    {
      "arabic": "جَمِيعٌ",
      "english": "United / Together",
      "urdu": "متحد / اکٹھے"
    },
    {
      "arabic": "يُرِيدُ",
      "english": "Desires / Intends",
      "urdu": "چاہتا ہے / ارادہ کرتا ہے"
    },
    {
      "arabic": "يُفَرِّقَ",
      "english": "To divide / Scatter",
      "urdu": "تقسیم کرنا / تفریق ڈالنا"
    },
    {
      "arabic": "جَمَاعَتَكُمْ",
      "english": "Your community / group",
      "urdu": "تمہاری جماعت / وحدت"
    },
    {
      "arabic": "فَاقْتُلُوهُ",
      "english": "Kill him",
      "urdu": "پس اسے قتل کر دو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسلم معاشرے کی وحدت اور ریاست کے استحکام کی اہمیت بیان کرتی ہے، جس میں بغاوت پھیلانے والے مفسد کے خلاف سخت ترین سزا کا حکم دیا گیا ہے۔",
    "english": "This Hadith emphasizes the importance of Muslim unity and state stability, mandating the harshest penalty for those seeking to incite rebellion or divide the community."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1852)",
      "english": "Sahih Muslim (1852)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عرفجة بن شريح الأشجعي",
        "english": "Arfajah bin Shuraih Al-Ashja'i"
      },
      "slug": "arfajah-bin-shuraih"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R0uW4K_7V9M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اتحادِ امت کی اہمیت",
        "english": "Importance of Ummah's Unity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وحدتِ قیادت کا اصول",
              "english": "Principle of Unified Leadership"
            },
            "content": {
              "urdu": [
                "اسلام میں ایک وقت میں ایک ہی سربراہِ مملکت کی اطاعت کا حکم دیا گیا ہے۔",
                "مسلمانوں کا کسی ایک امیر پر متفق ہونا ریاست کی بقا کے لیے لازم ہے۔",
                "انتشار اور گروہ بندی سے قومیں اندرونی طور پر کمزور اور تباہ ہو جاتی ہیں۔"
              ],
              "english": [
                "Islam mandates obedience to a single head of state at any given time.",
                "Unity under one leader is essential for the survival and integrity of the state.",
                "Internal division and factionalism weaken and eventually destroy nations."
              ]
            }
          },
          {
            "title": {
              "urdu": "بغاوت کی سنگینی",
              "english": "Gravity of Rebellion"
            },
            "content": {
              "urdu": [
                "منظم ریاست کے خلاف مسلح بغاوت کرنا ایک سنگین شرعی جرم ہے۔",
                "بغاوت سے خونریزی، لاقانونیت اور عوامی امن و امان کی تباہی جنم لیتی ہے۔",
                "شریعت نے ایک مفسد کے خاتمے کو پوری جماعت کے تحفظ پر ترجیح دی ہے۔"
              ],
              "english": [
                "Armed rebellion against an organized state is a severe Shariah crime.",
                "Insurrection leads to bloodshed, lawlessness, and the ruin of public peace.",
                "Shariah prioritizes eliminating a single mischief-maker to protect the entire community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قتلِ مفسد کی شرائط",
        "english": "Conditions for Capital Punishment of Agitators"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالتی و ریاستی کارروائی",
              "english": "Judicial and State Action"
            },
            "content": {
              "urdu": [
                "قتل کا حکم صرف ریاست اور قانونی عدالتیں ہی نافذ کر سکتی ہیں۔",
                "کسی فردِ واحد کو اپنی مرضی سے کسی کو قتل کرنے کی ہرگز اجازت نہیں ہے۔",
                "اس سزا کا مقصد معاشرتی فساد کو جڑ سے اکھاڑنا اور عبرت پیدا کرنا ہے۔"
              ],
              "english": [
                "The order of execution can only be implemented by the state and legal courts.",
                "No individual is permitted to take the law into their own hands or kill at will.",
                "The purpose of this penalty is to uproot social strife and create a deterrent."
              ]
            }
          },
          {
            "title": {
              "urdu": "تفریق اور فتنہ گری",
              "english": "Division and Incitement"
            },
            "content": {
              "urdu": [
                "سخت سزا اس کے لیے ہے جو شعوری طور پر مسلمانوں کو تقسیم کرنے کی کوشش کرے۔",
                "اگر کوئی شخص صرف علمی اختلاف رکھے تو اس پر یہ حکم لاگو نہیں ہوتا۔",
                "یہ حکم ان فتنہ پرور لوگوں کے لیے ہے جو حکومت گرانے کے درپے ہوں۔"
              ],
              "english": [
                "The severe penalty is for those who consciously strive to divide Muslims.",
                "One who merely holds an intellectual disagreement is not subject to this ruling.",
                "This directive targets agitators who actively seek to overthrow the established order."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و سیاسی حکمت",
        "english": "Juristic and Political Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کم تر برائی کا انتخاب",
              "english": "Choosing the Lesser Evil"
            },
            "content": {
              "urdu": [
                "ایک باغی کا قتل ہزاروں معصوموں کے خون کے مقابلے میں چھوٹی برائی ہے۔",
                "اسلامی فقہ میں بڑے نقصان کو روکنے کے لیے چھوٹے نقصان کو گوارا کیا جاتا ہے۔",
                "اجتماعی مفاد کو انفرادی زندگی پر مقدم رکھنا سیاستِ شرعیہ کا اصول ہے۔"
              ],
              "english": [
                "Executing one rebel is a lesser evil than the bloodshed of thousands of innocents.",
                "In Islamic jurisprudence, a smaller harm is accepted to prevent a larger catastrophe.",
                "Prioritizing collective interest over individual life is a core principle of Shariah politics."
              ]
            }
          },
          {
            "title": {
              "urdu": "امن و امان کی ضمانت",
              "english": "Guarantee of Law and Order"
            },
            "content": {
              "urdu": [
                "مضبوط مرکزی قیادت کے بغیر اسلامی نظام کا نفاذ ممکن نہیں ہے۔",
                "یہ حدیث ریاست کے باغیوں (خوارج وغیرہ) کے خلاف قانونی بنیاد فراہم کرتی ہے۔",
                "قومی وحدت ہی دشمنوں کے خلاف مسلمانوں کی اصل طاقت ہے۔"
              ],
              "english": [
                "Implementing the Islamic system is impossible without strong central leadership.",
                "This Hadith provides the legal basis for action against state rebels like Kharijites.",
                "National unity is the true strength of Muslims against external adversaries."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گروہ بندی سے اجتناب",
              "english": "Avoiding Sectarianism"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ فرقہ واریت اور گروہ بندی سے مکمل پرہیز کریں۔",
                "اتحادِ امت کے لیے اپنی چھوٹی موٹی خواہشات اور نظریات کی قربانی دیں۔",
                "جو لوگ مسلمانوں کو آپس میں لڑاتے ہیں وہ درحقیقت دشمن کے ایجنٹ ہیں۔"
              ],
              "english": [
                "Muslims must completely avoid sectarianism and factional divisions.",
                "Personal desires and narrow ideologies should be sacrificed for Ummah's unity.",
                "Those who incite Muslims against each other are effectively serving the enemy."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمہ دارانہ شہریت",
              "english": "Responsible Citizenship"
            },
            "content": {
              "urdu": [
                "ریاست کے قوانین کی پاسداری کرنا ہر مسلمان کی دینی ذمہ داری ہے۔",
                "فتنے کے وقت خاموشی اور صلح کی کوشش کرنا بہترین عمل ہے۔",
                "ہمیں اپنے قول و فعل سے معاشرے کو جوڑنے والا بننا چاہیے، توڑنے والا نہیں۔"
              ],
              "english": [
                "Abiding by the laws of the state is a religious duty for every Muslim.",
                "Practicing silence and striving for peace during times of fitna is highly virtuous.",
                "We must become connectors of society through our words and deeds, not dividers."
              ]
            }
          }
        ]
      }
    }
  ]
}