{
  "hadithId": 84,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["muslim:262"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": " صحيح. رواه مسلم (262) . قيل لسلمان: قد علمكم نبيكم صلى الله عليه وسلم كل شيء حتى الخراءة. قال: أجل. لقد نهانا. . . الحديث",
    "urdu": "یہ حدیث **صحیح** ہے۔ اسے مسلم (262) نے روایت کیا ہے۔ سلمان رضی اللہ عنہ سے کہا گیا: 'کیا تمہارے نبی صلی اللہ علیہ وسلم نے تمہیں ہر چیز کی تعلیم دی، یہاں تک کہ قضائے حاجت کے آداب کی بھی؟' انہوں نے فرمایا: 'ہاں! انہوں نے ہمیں منع فرمایا کہ...' پھر حدیث بیان کی۔",
    "english": "Sahih (Authentic). Reported by Muslim (262). It was said to Salman: 'Your Prophet (PBUH) has taught you everything, even about relieving yourselves.' He replied: 'Yes, indeed! He forbade us...' and then recited the Hadith."
  },
  "importantWords": [
    {
      "arabic": "نَهَانَا",
      "english": "He forbade us",
      "urdu": "ہمیں منع فرمایا"
    },
    {
      "arabic": "نَسْتَقْبِلَ",
      "english": "We face",
      "urdu": "ہم رخ کریں"
    },
    {
      "arabic": "اَلْقِبْلَةَ",
      "english": "The Qiblah (direction of prayer)",
      "urdu": "قبلہ"
    },
    {
      "arabic": "بِغَائِطٍ",
      "english": "While defecating (Faeces)",
      "urdu": "بڑی حاجت / پاخانہ"
    },
    {
      "arabic": "بَوْلٍ",
      "english": "Or urinating (Urine)",
      "urdu": "پیشاب"
    },
    {
      "arabic": "نَسْتَنْجِيَ",
      "english": "We cleanse ourselves (Istinja')",
      "urdu": "استنجاء کریں"
    },
    {
      "arabic": "أَحْجَارٍ",
      "english": "Stones",
      "urdu": "ڈھیلے / پتھر"
    },
    {
      "arabic": "رَجِيعٍ",
      "english": "Dung / Animal dropping (dried)",
      "urdu": "گوبر / لید"
    },
    {
      "arabic": "عَظْمٍ",
      "english": "Bone",
      "urdu": "ہڈی"
    },
    {
      "arabic": "سَلْمَانَ",
      "english": "Salman (the Persian)",
      "urdu": "سیدنا سلمان فارسی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت اور استنجاء کے پانچ اہم ممنوعہ آداب کو بیان کرتی ہے: **قبلہ رخ ہونا، دایاں ہاتھ استعمال کرنا، تین سے کم ڈھیلے استعمال کرنا، اور گوبر یا ہڈی سے استنجاء کرنا۔**",
    "english": "This Hadith summarizes five key prohibited acts regarding relieving oneself and Istinja': **facing the Qiblah, using the right hand for cleansing, using less than three stones for wiping, and using dung or bones for purification.**"
  },
  "references": [
    {
      "arabic": "رواه مسلم (262)",
      "english": "Reported by Muslim (No. 262)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سَلْمَانَ  - رضى الله عنه",
        "english": "Salman (May Allah be pleased with him)"
      },
      "slug": "salman-al-farsi"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبلہ کی بے حرمتی سے ممانعت",
        "english": "Prohibition of Disrespecting the Qiblah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبلہ رخ ہونے کی ممانعت",
              "english": "Prohibition on Facing the Qiblah"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے قضائے حاجت کے دوران **قبلہ رخ ہونے یا قبلہ کی طرف پیٹھ کرنے سے منع** فرمایا ہے۔",
                "یہ حکم اس لیے ہے تاکہ کعبہ اور نماز کی جہت کی تعظیم و احترام کو ہر حالت میں برقرار رکھا جائے۔",
                "جمہور فقہاء کے نزدیک یہ ممانعت **کھلی جگہوں** کے لیے ہے، جب کہ پختہ عمارتوں کے اندر اس میں رخصت دی گئی ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) forbade **facing the Qiblah or turning one's back toward it** while relieving oneself.",
                "This command is designed to maintain the reverence and honor of the Ka'bah and the direction of prayer in all circumstances.",
                "The majority of jurists hold that this prohibition applies primarily to **open spaces**, while leniency is allowed inside permanent structures."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائیں ہاتھ سے استنجاء کی ممانعت",
              "english": "Prohibition of Cleansing with the Right Hand"
            },
            "content": {
              "urdu": [
                "یہ حکم پچھلی حدیث (ابو قتادہ) کی تصدیق کرتا ہے کہ **دائیں ہاتھ سے استنجاء کرنا سخت ممنوع** ہے، خواہ وہ پانی ہو یا ڈھیلا۔",
                "دایاں ہاتھ اکرام اور پاکیزگی کے کاموں کے لیے مختص ہے، لہٰذا نجاست کو چھونے کے لیے صرف بایاں ہاتھ استعمال کیا جانا چاہیے۔",
                "یہ اسلامی آداب اور فطری حیا کے اصولوں کو مزید تقویت دیتا ہے، اور اسے حرام یا مکروہ تحریمی سمجھا جاتا ہے۔"
              ],
              "english": [
                "This command reaffirms the previous Hadith (of Abu Qatadah): **it is strictly forbidden to use the right hand for Istinja'**, whether using water or stones.",
                "The right hand is reserved for honorable and pure deeds, so only the left hand must be used for touching impurities.",
                "This further reinforces the principles of Islamic etiquette and innate modesty (Fitrah), making the forbidden act Tahrīman Makrūh or haram."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استنجاء کے صحیح وسائل کا حکم",
        "english": "Ruling on Proper Means of Cleansing (Istijmar)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ڈھیلے کی تعداد کی شرط",
              "english": "Condition of Number of Stones"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے **تین ڈھیلوں سے کم** استعمال کرنے سے منع فرمایا، جس سے یہ ثابت ہوتا ہے کہ طاق عدد افضل ہے۔",
                "تین ڈھیلوں کی شرط اس بات کو یقینی بناتی ہے کہ کم از کم ضروری صفائی حاصل ہو جائے، خواہ مزید ضرورت ہو یا نہ ہو۔",
                "اگر تین ڈھیلوں سے بھی صفائی نہ ہو تو زیادہ ڈھیلے استعمال کیے جائیں گے، لیکن آخری ڈھیلا ہمیشہ طاق ہونا سنت ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) forbade cleansing with **less than three stones (or similar items)**, establishing that an odd number is preferable.",
                "The condition of three stones ensures that the minimum necessary level of cleanliness is achieved, regardless of further need.",
                "If three stones are insufficient for purification, more should be used, but the final wipe should always be with an odd number of stones (Istijmar)."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممنوعہ اشیاء سے استنجاء",
              "english": "Cleansing with Prohibited Items"
            },
            "content": {
              "urdu": [
                "حدیث میں واضح طور پر **گوبر (جانوروں کی لید/رجیع)** اور **ہڈی** سے استنجاء کرنے سے منع کیا گیا ہے۔",
                "گوبر سے ممانعت اس لیے ہے کہ یہ نجس ہے یا یہ جنات کے جانوروں کا چارہ ہے، جبکہ ہڈی جنات کا کھانا ہے۔",
                "ان دونوں اشیاء سے منع کرنا اس بات کی دلیل ہے کہ نجاست کو پاک کرنے کے لیے استعمال ہونے والی چیز خود پاک ہونی چاہیے، اور جنات کا حق ہے۔"
              ],
              "english": [
                "The Hadith explicitly prohibits performing Istinja' with **dung (Raji')** and **bone ('Azm)**.",
                "Dung is forbidden because it is impure or sustenance for the Jinn's animals, while bone is the food of the Jinn.",
                "This dual prohibition establishes that the cleansing agent itself must be pure, and it respects the rights of the Jinn's provisions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت کا فلسفہ اور تعظیم",
        "english": "Philosophy of Purity and Reverence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینی اور دنیاوی آداب کی تکمیل",
              "english": "Completion of Religious and Worldly Manners"
            },
            "content": {
              "urdu": [
                "سیدنا سلمان رضی اللہ عنہ کا مکالمہ (کیا نبی نے سب کچھ سکھا دیا؟) ظاہر کرتا ہے کہ اسلام زندگی کے ہر چھوٹے پہلو میں رہنمائی فراہم کرتا ہے۔",
                "یہ آداب دراصل انسان کے لیے **عزت اور شرافت** کے معیار کو متعین کرتے ہیں، جو طہارت کے بعد بھی قائم رہے۔",
                "ان قواعد پر سختی سے عمل کرنا ایمان کا حصہ ہے اور یہ اللہ اور اس کے رسول کی اطاعت کا اظہار ہے۔"
              ],
              "english": [
                "Salman's conversation (Did the Prophet teach you everything?) reveals that Islam provides guidance for every minute aspect of life.",
                "These etiquettes actually set the standard of **dignity and honor** for humans, which must be maintained even after purification.",
                "Strict adherence to these rules is part of faith and expresses obedience to Allah and His Messenger."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف اور احتیاط",
              "english": "Juristic Differences and Precaution"
            },
            "content": {
              "urdu": [
                "بیت الخلاء کے اندر قبلہ رخ ہونے پر فقہاء میں اختلاف ہے، لیکن اکثر کی رائے **عمار بن یاسر** کی روایت پر مبنی ہے کہ اندر اجازت ہے۔",
                "تاہم، سلمان رضی اللہ عنہ کی یہ حدیث سب سے زیادہ واضح ممانعت بیان کرتی ہے، اس لیے کھلے میں احتیاط واجب ہے۔",
                "تمام فقہاء ان چاروں ممانعتوں (قبلہ، دایاں ہاتھ، کم ڈھیلے، رجیع و ہڈی) کو درست اور قابل عمل مانتے ہیں۔"
              ],
              "english": [
                "Jurists differ on facing the Qiblah inside the toilet; most rely on the Hadith of **'Ammar ibn Yasir** which allows it indoors.",
                "However, Salman's Hadith provides the clearest prohibition, making caution mandatory in open spaces.",
                "All jurists agree that the four prohibitions (Qiblah, right hand, insufficient stones, dung/bone) are correct and enforceable principles."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حفظان صحت اور ماحولیاتی تحفظ",
        "english": "Hygiene and Environmental Protection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طاق عدد کی فضیلت",
              "english": "Virtue of the Odd Number"
            },
            "content": {
              "urdu": [
                "استنجاء میں طاق عدد (تین، پانچ، سات) کا استعمال سنت ہے، جو صرف صفائی نہیں بلکہ ایک تعبدی حکم ہے۔",
                "یہ اصول اس بات کی طرف بھی اشارہ کرتا ہے کہ صفائی کے بعد بھی جسمانی پاکیزگی کے عمل میں سادگی اور ادب کا خیال رکھا جائے۔",
                "جو شخص پانی نہ ملنے پر صرف ڈھیلوں کا استعمال کرے، اس کے لیے کم از کم تین پتھروں سے صفائی واجب ہے۔"
              ],
              "english": [
                "Using an odd number (three, five, seven) for Istinja' with stones is Sunnah, representing a devotional as well as a cleaning command.",
                "This principle also indicates that even in the process of physical cleansing, simplicity and manners must be observed.",
                "For a person without water, cleansing with at least three stones or suitable solid objects is obligatory."
              ]
            }
          },
          {
            "title": {
              "urdu": "ماحولیاتی حکمت",
              "english": "Environmental Wisdom"
            },
            "content": {
              "urdu": [
                "ہڈی اور گوبر سے ممانعت میں ایک **ماحولیاتی حکمت** پوشیدہ ہے، تاکہ زمین پر موجود وسائل کا غلط استعمال نہ ہو۔",
                "گوبر کو ایندھن یا کھاد کے لیے استعمال کیا جاتا تھا، اور ہڈی جنات کے لیے رزق تھی، اس لیے ان کی قدر کرنا سکھایا گیا۔",
                "اسلامی شریعت کی یہ تفصیلات ظاہر کرتی ہیں کہ احکام صرف انسانوں کے درمیان نہیں بلکہ **ماحول اور مافوق الفطرت مخلوق** کے ساتھ بھی حسن سلوک سکھاتے ہیں۔"
              ],
              "english": [
                "There is an **environmental wisdom** in prohibiting bone and dung, preventing the misuse of resources on earth.",
                "Dung was used as fuel or fertilizer, and bone was considered food for the Jinn; thus, their value was taught.",
                "These details of Islamic law show that the rulings govern not only relations between humans but also proper conduct towards the **environment and the supernatural creation**."
              ]
            }
          }
        ]
      }
    }
  ]
}
