{
  "hadithId": 389,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-389"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (324)‏، ومسلم (890)‏. واللفظ للبخاري، وفيه تأكيد على خروج النساء لصلاة العيد وشهود دعوة المسلمين.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (324) و مسلم (890) میں موجود ہے۔ اس میں خواتین کو عید گاہ لے جانے کی تاکید ہے تاکہ وہ خیر کی دعاؤں میں شریک ہوسکیں۔",
    "english": "Sahih. Reported by Al-Bukhari (324) and Muslim (890). The narration emphasizes the participation of women in the Eid gathering to witness the blessings and supplications."
  },
  "importantWords": [
    {
      "arabic": "الْعَوَاتِقَ",
      "english": "Young / Adolescent girls",
      "urdu": "جوان لڑکیاں"
    },
    {
      "arabic": "الْحُيَّضَ",
      "english": "Menstruating women",
      "urdu": "حائضہ عورتیں"
    },
    {
      "arabic": "يَشْهَدْنَ",
      "english": "They witness",
      "urdu": "وہ حاضر ہوں / شریک ہوں"
    },
    {
      "arabic": "دَعْوَةَ",
      "english": "Supplication / Call",
      "urdu": "دعا / پکار"
    },
    {
      "arabic": "يَعْتَزِلُ",
      "english": "Stay away / Keep apart",
      "urdu": "علیحدہ رہیں"
    },
    {
      "arabic": "الْمُصَلَّى",
      "english": "Place of prayer",
      "urdu": "عیدگاہ / جائے نماز"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں عورتوں بالخصوص جوان اور حائضہ خواتین کو عید گاہ جانے کا حکم دیا گیا ہے تاکہ وہ خیر کی دعا میں شریک ہوں، تاہم حائضہ خواتین جائے نماز سے دور رہیں۔",
    "english": "The Hadith commands bringing all women, including the young and menstruating, to the Eid gathering for the collective prayer's blessings, while menstruating women stay apart from the prayer area."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (324)",
      "english": "Sahih al-Bukhari (324)"
    },
    {
      "arabic": "صحيح مسلم (890)",
      "english": "Sahih Muslim (890)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم عطية الأنصارية",
        "english": "Umm 'Atiyya al-Ansariyah"
      },
      "slug": "umm-atiya-al-ansariyah"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=women+going+to+eidgah+hadith+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواتین کی شرکت کی اہمیت",
        "english": "Importance of Women's Participation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتماعی عبادت کی برکات",
              "english": "Blessings of Collective Worship"
            },
            "content": {
              "urdu": [
                "عید گاہ میں مسلمانوں کا اجتماع اللہ کی رحمت کے نزول کا وقت ہوتا ہے۔",
                "نبی ﷺ نے خواتین کو بھی اس برکت سے محروم نہ رہنے کی تاکید فرمائی۔",
                "یہ عمل مسلمانوں کی کثرت اور قوت کے اظہار کا ذریعہ بھی ہے۔"
              ],
              "english": [
                "The gathering of Muslims in the Eidgah is a time for Allah's descending mercy.",
                "The Prophet (ﷺ) emphasized that women should not be deprived of this blessing.",
                "This participation also serves as a display of the strength and numbers of Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا میں شرکت کا شوق",
              "english": "Desire to Join Supplications"
            },
            "content": {
              "urdu": [
                "حدیث میں 'دعوة المسلمین' کا لفظ مسلمانوں کی اجتماعی دعا کی اہمیت ظاہر کرتا ہے۔",
                "خواتین کی موجودگی معاشرے میں دینی بیداری اور تعلق باللہ کو مضبوط کرتی ہے۔",
                "خیر کے کاموں میں ہر طبقہ فکر اور عمر کی خواتین کو شامل کرنا سنت ہے۔"
              ],
              "english": [
                "The term 'Call of Muslims' highlights the significance of collective supplication.",
                "The presence of women strengthens religious awareness and the bond with Allah.",
                "It is Sunnah to include women of all ages and conditions in virtuous acts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حائضہ خواتین کے لیے احکام",
        "english": "Rulings for Menstruating Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز سے علیحدگی",
              "english": "Separation from Prayer"
            },
            "content": {
              "urdu": [
                "حائضہ خواتین عید گاہ میں حاضر تو ہوں گی لیکن نماز کی جگہ سے دور بیٹھیں گی۔",
                "وہ براہ راست نماز میں شریک نہیں ہوں گی بلکہ خطبہ اور دعا سنیں گی۔",
                "یہ حکم مسجد اور جائے نماز کے تقدس کو برقرار رکھنے کے لیے دیا گیا ہے۔"
              ],
              "english": [
                "Menstruating women should attend the Eidgah but sit away from the prayer rows.",
                "They do not participate in the prayer but listen to the sermon and supplication.",
                "This command is given to maintain the sanctity of the place of prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی عذر اور اجر",
              "english": "Sharia Excuse and Reward"
            },
            "content": {
              "urdu": [
                "شرعی عذر کے باوجود عید گاہ جانا ان کے جذبہ بندگی کی عکاسی کرتا ہے۔",
                "اللہ تعالیٰ نیتوں کے مطابق اجر عطا فرماتا ہے چاہے نماز نہ بھی پڑھی جائے۔",
                "اس سے معلوم ہوتا ہے کہ ذکر و دعا کے لیے پاکیزگی (وضو/غسل) شرط نہیں ہے۔"
              ],
              "english": [
                "Going to the Eidgah despite a Sharia excuse reflects the spirit of devotion.",
                "Allah grants rewards based on intentions even if the prayer is not performed.",
                "This shows that ritual purity is not a condition for general remembrance and dua."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور تربیتی پہلو",
        "english": "Social and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواتین کی دینی تعلیم",
              "english": "Religious Education of Women"
            },
            "content": {
              "urdu": [
                "عید کا خطبہ خواتین کے لیے دینی معلومات اور اصلاح کا بہترین ذریعہ ہے۔",
                "جوان لڑکیوں کو لانے کا مقصد ان کی دینی تربیت اور شعور بیدار کرنا ہے۔",
                "خاندانوں کا اکٹھے نکلنا اسلامی ثقافت اور اتحاد کی پہچان ہے۔"
              ],
              "english": [
                "The Eid sermon is a great source of religious knowledge and reform for women.",
                "Bringing young girls aims to nurture their religious upbringing and awareness.",
                "Families going out together is a hallmark of Islamic culture and unity."
              ]
            }
          },
          {
            "title": {
              "urdu": "پردے اور حیا کا خیال",
              "english": "Observing Hijab and Modesty"
            },
            "content": {
              "urdu": [
                "خواتین کو عید گاہ جاتے وقت مکمل شرعی پردے اور وقار کا خیال رکھنا چاہیے۔",
                "اس حکم کا مقصد خوشی کے موقع پر بھی اللہ کی حدود میں رہنا ہے۔",
                "صحابہ کرام کی خواتین سادہ لباس میں اور خوشبو لگائے بغیر نکلتی تھیں۔"
              ],
              "english": [
                "Women should observe complete Sharia hijab and dignity while going to the Eidgah.",
                "The purpose is to remain within Allah's limits even during celebrations.",
                "The women of the Sahaba used to go out in simple attire without perfume."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عید گاہ کا حکم",
              "english": "Status of the Eidgah"
            },
            "content": {
              "urdu": [
                "حائضہ خواتین کا مصلّٰی سے دور رہنا ثابت کرتا ہے کہ عید گاہ مسجد کے حکم میں ہے۔",
                "فقہاء کے نزدیک عید گاہ کے آداب مسجد کے قریب تر ہوتے ہیں۔",
                "نماز کی جگہ کو پاک رکھنا اور اس کا احترام کرنا ہر حال میں لازم ہے۔"
              ],
              "english": [
                "Menstruating women staying away from the rows proves the Eidgah's sacred status.",
                "According to jurists, the etiquettes of the Eidgah are similar to those of a mosque.",
                "Keeping the prayer area clean and respecting it is mandatory in all situations."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکم کی نوعیت",
              "english": "Nature of the Command"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا 'حکم دینا' اس عمل کی تاکید اور فضیلت کو ظاہر کرتا ہے۔",
                "عورتوں کا عید گاہ جانا سنتِ مؤکدہ یا مستحب کے درجے میں آتا ہے۔",
                "اگر فتنہ کا خوف نہ ہو تو خواتین کو عید گاہ جانے سے نہیں روکنا چاہیے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) command signifies the emphasis and virtue of this act.",
                "Women attending the Eidgah is considered a stressed Sunnah or highly recommended.",
                "If there is no fear of fitna, women should not be prevented from attending."
              ]
            }
          }
        ]
      }
    }
  ]
}
