{
  "hadithId": 1014,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1164"],
    "kitabId": 9,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام",
    "babId": 80
  },
 
  "takhreej": {
    "arabic": "رواه أبو داود (4586)، والنسائي (4830)، وابن ماجه (3466)، والدارقطني (3/252)، والحاكم (4/212) وصححه، والخطابي في معالم السنن.",
    "urdu": "اسے ابوداؤد، نسائی اور ابن ماجہ نے روایت کیا ہے۔ حاکم نے اسے صحیح قرار دیا ہے، اگرچہ بعض محدثین نے اس کے مرسل ہونے کو ترجیح دی ہے لیکن اس کے شواہد اسے تقویت دیتے ہیں۔",
    "english": "Reported by Abu Dawud (4586), An-Nasa'i (4830), and Ibn Majah (3466). Al-Hakim graded it Sahih, though some scholars prefer the Mursal version, its meanings are accepted in Shariah."
  },
  "importantWords": [
    {
      "arabic": "تَطَبَّبَ",
      "english": "Practiced medicine",
      "urdu": "طبیب بن بیٹھا / علاج کیا"
    },
    {
      "arabic": "مَعْرُوفًا",
      "english": "Known / Qualified",
      "urdu": "مشہور / ماہر"
    },
    {
      "arabic": "نَفْسًا",
      "english": "A soul / life",
      "urdu": "ایک جان"
    },
    {
      "arabic": "ضَامِنٌ",
      "english": "Responsible / Liable",
      "urdu": "ضامن / تاوان بھرنے والا"
    },
    {
      "arabic": "أَصَابَ",
      "english": "Afflicted / Caused harm",
      "urdu": "پہنچایا / واقع ہوا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث میڈیکل اخلاقیات اور قانونی ذمہ داری کے بارے میں ہے؛ غیر ماہر شخص اگر علاج کے دوران کسی کا نقصان کرے تو وہ دیت کا ذمہ دار ہوگا۔",
    "english": "This Hadith addresses medical ethics and liability; an unqualified person practicing medicine is legally responsible for any harm or death caused to a patient."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4586)",
      "english": "Sunan Abu Dawud (4586)"
    },
    {
      "arabic": "المستدرك للحاكم (4/212)",
      "english": "Al-Mustadrak al-Hakim (4/212)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S8wT9Y8eO_0",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طبابت اور قانونی ذمہ داری",
        "english": "Medical Practice and Liability"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماہر اور غیر ماہر کا فرق",
              "english": "Expert vs. Unqualified"
            },
            "content": {
              "urdu": [
                "اگر کوئی مستند ڈاکٹر علاج کرے اور پھر نقصان ہو جائے تو وہ ضامن نہیں ہوتا۔",
                "لیکن ایک جاہل شخص جس کے پاس علم نہ ہو، اس کا ہاتھ ڈالنا ہی جرم ہے۔",
                "ایسا شخص مقتول کی جان کی دیت یا زخمی کے ہرجانے کا مکمل ذمہ دار ہے۔"
              ],
              "english": [
                "If a qualified doctor treats a patient and harm occurs unintentionally, they are not liable.",
                "However, it is a crime for an unlearned person to intervene without knowledge.",
                "Such a person is fully liable for the blood-money or compensation for injuries caused."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضمانت (تاوان) کی نوعیت",
              "english": "Nature of Liability"
            },
            "content": {
              "urdu": [
                "غیر ماہر کا علاج کرنا 'قتلِ خطا' یا 'شبہ عمد' کے زمرے میں آتا ہے۔",
                "اس میں قصاص (جان کے بدلے جان) نہیں بلکہ مالی تاوان (دیت) ہوتا ہے۔",
                "یہ قانون انسانی جانوں کو عطائیوں اور نیم حکیموں کے تجربات سے بچاتا ہے۔"
              ],
              "english": [
                "Treatment by an unqualified person falls under accidental or quasi-intentional homicide.",
                "It does not invoke Qisas (retaliation) but requires financial Diyat (compensation).",
                "This law protects human lives from the experiments of quacks and pretenders."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انسانی جان کی حرمت",
        "english": "Sanctity of Human Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لاپرواہی کی ممانعت",
              "english": "Prohibition of Negligence"
            },
            "content": {
              "urdu": [
                "اسلام انسانی زندگی کی حفاظت کو ریاست اور افراد کی اولین ترجیح قرار دیتا ہے۔",
                "بغیر مہارت کے طبی مشورے دینا یا سرجری کرنا ایک سنگین سماجی برائی ہے۔",
                "شریعت ایسے شخص کو 'متعدی' (تجاوز کرنے والا) قرار دے کر سزا دیتی ہے۔"
              ],
              "english": [
                "Islam makes the protection of human life a top priority for the state and individuals.",
                "Giving medical advice or performing surgery without expertise is a grave social evil.",
                "Shariah punishes such individuals by classifying them as transgressors."
              ]
            }
          },
          {
            "title": {
              "urdu": "پیشہ ورانہ مہارت کی ترغیب",
              "english": "Encouraging Professionalism"
            },
            "content": {
              "urdu": [
                "حدیث اس بات پر زور دیتی ہے کہ ہر شعبے میں ماہرین کی خدمات لی جائیں۔",
                "علمِ طب سیکھنا فرضِ کفایہ ہے تاکہ معاشرہ بیماریوں سے محفوظ رہے۔",
                "اسلامی ریاست کا فرض ہے کہ وہ طبیبوں کے لائسنس اور مہارت کی جانچ کرے۔"
              ],
              "english": [
                "The Hadith emphasizes utilizing expert services in every specialized field.",
                "Learning medicine is a collective obligation (Fard al-Kifayah) to protect society.",
                "The Islamic state is responsible for verifying the licenses and skills of doctors."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عطائیوں کا معاشرتی فتنہ",
        "english": "Social Menace of Quacks"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیم حکیم خطرہ جان",
              "english": "Danger of Quackery"
            },
            "content": {
              "urdu": [
                "بغیر علم کے علاج کرنا دھوکہ دہی اور فراڈ کے زمرے میں آتا ہے۔",
                "ایسے لوگ انسانی مجبوریوں اور بیماریوں کا ناجائز فائدہ اٹھاتے ہیں۔",
                "حدیث نے 1400 سال پہلے میڈیکل ریگولیٹری اتھارٹی کی بنیاد فراہم کر دی تھی۔"
              ],
              "english": [
                "Practicing medicine without knowledge falls under deception and fraud.",
                "Such people exploit human vulnerabilities and illnesses for personal gain.",
                "The Hadith provided the basis for medical regulatory authorities 1400 years ago."
              ]
            }
          },
          {
            "title": {
              "urdu": "مریض کی ذمہ داری",
              "english": "Patient's Responsibility"
            },
            "content": {
              "urdu": [
                "مریض کو بھی چاہیے کہ وہ مستند اور ماہر طبیب ہی سے رجوع کرے۔",
                "اپنے جسم اور جان کو خطرے میں ڈالنا بھی شرعاً ناپسندیدہ ہے۔",
                "تحقیق کے بعد علاج کروانا سنتِ نبوی ﷺ کے عین مطابق ہے۔"
              ],
              "english": [
                "Patients should also ensure they only consult qualified and expert physicians.",
                "Endangering one's own body and life is religiously discouraged.",
                "Seeking treatment after proper verification aligns with the Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تعلیمی اسباق",
        "english": "Juristic and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جدید میڈیکل لاء",
              "english": "Modern Medical Law"
            },
            "content": {
              "urdu": [
                "یہ حدیث 'میڈیکل نیگلیجنس' (طبی غفلت) کے قوانین کی بنیاد ہے۔",
                "اگر ڈاکٹر اپنی حدود سے تجاوز کرے تو وہ قانونی پکڑ میں آئے گا۔",
                "اسلامی فقہ میں ہر عمل کے بدلے ذمہ داری (Liability) کا اصول واضح ہے۔"
              ],
              "english": [
                "This Hadith is the foundation of 'medical negligence' laws.",
                "If a doctor exceeds their professional bounds, they face legal consequences.",
                "Islamic jurisprudence clearly defines the principle of liability for every action."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی و دنیوی علوم",
              "english": "Religious and Worldly Sciences"
            },
            "content": {
              "urdu": [
                "دین میں جس طرح بغیر علم کے فتویٰ دینا جرم ہے، دنیا میں بغیر علم کے علاج کرنا جرم ہے۔",
                "مسلمانوں کو چاہیے کہ وہ سائنس اور طب میں مہارت حاصل کریں۔",
                "علم کے بغیر دعویٰ کرنا جھوٹ ہے اور جھوٹ پر سزا مقرر ہے۔"
              ],
              "english": [
                "Just as giving a fatwa without knowledge is a sin, practicing medicine without it is a crime.",
                "Muslims are encouraged to attain mastery in science and medical fields.",
                "Claiming expertise without knowledge is a lie, and lies are subject to punishment."
              ]
            }
          }
        ]
      }
    }
  ]
}