{
  "hadithId": 885,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/84"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (4/279-280)، وأبو داود (2115)، والنسائي (6/121)، والترمذي (1145)، وابن ماجه (1891). وقال الترمذي: حسن صحيح. وهو من أقوى الأدلة في مقتضيات عقد النكاح.",
    "urdu": "صحیح۔ اسے امام احمد، ابوداؤد، نسائی، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح قرار دیا ہے۔ یہ حدیث نکاح کے واجبات کے حوالے سے اہم ترین دلائل میں سے ایک ہے۔",
    "english": "Sahih. Reported by Ahmad (4/279), Abu Dawud (2115), An-Nasa'i (6/121), At-Tirmidhi (1145), and Ibn Majah (1891). At-Tirmidhi graded it Hasan Sahih. It is a fundamental evidence regarding the implications of a marriage contract."
  },
  "importantWords": [
    {
      "arabic": "لَمْ يَفْرِضْ",
      "english": "Did not fix / specify",
      "urdu": "مقرر نہیں کیا"
    },
    {
      "arabic": "مِثْلُ صَدَاقِ",
      "english": "Equivalent dower (Mahr al-Mithl)",
      "urdu": "خاندان کی عورتوں کے برابر مہر"
    },
    {
      "arabic": "لَا وَكْسَ",
      "english": "Without decrease",
      "urdu": "نہ کمی"
    },
    {
      "arabic": "لَا شَطَطَ",
      "english": "Without excess",
      "urdu": "نہ زیادتی"
    },
    {
      "arabic": "مِيرَاثُ",
      "english": "Inheritance",
      "urdu": "وراثت"
    }
  ],
  "summary": {
    "urdu": "اگر شوہر مہر مقرر کیے بغیر اور ہمبستری سے پہلے فوت ہو جائے، تو بیوی کو خاندان کی عورتوں کے برابر مہر ملے گا، وہ وراثت کی حقدار ہوگی اور اس پر عدت بھی لازم ہوگی۔",
    "english": "If a husband dies before fixing Mahr and before consummation, the wife is entitled to 'Mahr al-Mithl' (dower of her peers), her share of inheritance, and she must observe the Iddah."
  },
  "references": [
    {
      "arabic": "جامع الترمذي (1145)",
      "english": "Jami' at-Tirmidhi (1145)"
    },
    {
      "arabic": "سنن أبي داود (2115)",
      "english": "Sunan Abi Dawud (2115)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah bin Mas'ud"
      },
      "slug": "abdullah-bin-masud"
    },
    {
      "id": 2,
      "name": {
        "arabic": "معقل بن سنان الأشجعي",
        "english": "Ma'qil bin Sinan al-Ashja'i"
      },
      "slug": "maqil-bin-sinan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح کے قانونی اثرات",
        "english": "Legal Effects of Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہرِ مثل کا وجوب",
              "english": "Obligation of Mahr al-Mithl"
            },
            "content": {
              "urdu": [
                "مہرِ مثل سے مراد وہ مہر ہے جو عورت کے خاندان کی ہم پلہ عورتوں (بہنوں، پھوپھیوں) کو دیا گیا ہو۔",
                "اگر نکاح کے وقت مہر طے نہ کیا گیا ہو، تب بھی عورت مہر کی حقدار ہوتی ہے۔",
                "شوہر کی وفات کی صورت میں یہ مہر شوہر کے ترکے سے نکالا جائے گا۔"
              ],
              "english": [
                "Mahr al-Mithl refers to the average dower given to women of similar standing in the wife's family.",
                "Even if Mahr was not specified during the contract, the woman's right to it remains intact.",
                "In case of the husband's death, this dower is paid from his estate before inheritance is distributed."
              ]
            }
          },
          {
            "title": {
              "urdu": "وراثت اور عدت کا حکم",
              "english": "Ruling on Inheritance and Iddah"
            },
            "content": {
              "urdu": [
                "محض عقدِ نکاح (نکاح ہو جانے) سے وراثت کے حقوق قائم ہو جاتے ہیں، خواہ رخصتی نہ ہوئی ہو۔",
                "بیوہ پر شوہر کی وفات کی عدت (4 ماہ 10 دن) گزارنا شرعاً لازم ہے۔",
                "یہ حکم ثابت کرتا ہے کہ نکاح محض ایک معاہدہ نہیں بلکہ ایک مضبوط قانونی رشتہ ہے۔"
              ],
              "english": [
                "Inheritance rights are established by the marriage contract itself, even without consummation.",
                "The widow must observe the Iddah period for death (4 months and 10 days).",
                "This ruling proves that marriage is a solid legal bond, not just a casual contract."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتہاد اور سنت کی موافقت",
        "english": "Ijtihad and Alignment with Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا ابن مسعود کا اجتہاد",
              "english": "Ijtihad of Ibn Mas'ud"
            },
            "content": {
              "urdu": [
                "ابن مسعود رضی اللہ عنہ نے اس مسئلے میں اپنی رائے اور شرعی بصیرت سے فیصلہ کیا تھا۔",
                "وہ ایک ماہ تک اس پر غور کرتے رہے اور آخرکار عدل و انصاف کی بنیاد پر یہ جواب دیا۔",
                "ان کا یہ اجتہاد قرآنی اصولوں اور روحِ شریعت کے عین مطابق تھا۔"
              ],
              "english": [
                "Ibn Mas'ud (RA) initially decided this matter using his legal reasoning and Sharia insight.",
                "He deliberated on the issue for a month before providing his answer based on justice.",
                "His Ijtihad was in total harmony with Quranic principles and the spirit of Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت سے تائید کی خوشی",
              "english": "Joy of Confirmation by Sunnah"
            },
            "content": {
              "urdu": [
                "جب معقل بن سنان نے بتایا کہ نبی ﷺ نے بھی یہی فیصلہ فرمایا تھا، تو ابن مسعود بہت خوش ہوئے۔",
                "ان کی خوشی اس بات پر تھی کہ ان کا اجتہاد فرمانِ رسول ﷺ کے عین مطابق نکلا۔",
                "صحابہ کرام کے نزدیک سب سے بڑی کامیابی سنتِ نبوی کی موافقت تھی۔"
              ],
              "english": [
                "When Ma'qil bin Sinan confirmed that the Prophet (ﷺ) had ruled similarly, Ibn Mas'ud was overjoyed.",
                "His delight stemmed from the fact that his reasoning matched the Prophetic command.",
                "For the Companions, the greatest success was aligning their opinions with the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و معاشرتی حکمت",
        "english": "Juristic and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کے حقوق کا تحفظ",
              "english": "Safeguarding Women's Rights"
            },
            "content": {
              "urdu": [
                "اسلام نے عورت کو بے سہارا نہیں چھوڑا بلکہ اس کے مالی حقوق (مہر و میراث) کو یقینی بنایا۔",
                "نکاح کے وقت مہر کا ذکر بھول جانا عورت کے حق کو ختم نہیں کر سکتا۔",
                "یہ حدیث خواتین کو معاشی تحفظ فراہم کرنے کی ایک عظیم مثال ہے۔"
              ],
              "english": [
                "Islam ensures that women are not left helpless by securing their financial rights (Mahr and inheritance).",
                "Forgetting to mention Mahr during the contract does not nullify the woman's entitlement.",
                "This Hadith is a great example of providing economic security to women."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کا معیار",
              "english": "Standard of Justice"
            },
            "content": {
              "urdu": [
                "حدیث میں 'لا وکس ولا شطط' (نہ کمی نہ زیادتی) کے الفاظ عدل کے تقاضے ظاہر کرتے ہیں۔",
                "مہر نہ اتنا کم ہو کہ عورت کا نقصان ہو، اور نہ اتنا زیادہ کہ شوہر کے ورثاء پر بوجھ بنے۔",
                "معاشرتی توازن برقرار رکھنے کے لیے مہرِ مثل ایک بہترین پیمانہ ہے۔"
              ],
              "english": [
                "The phrase 'without decrease or excess' highlights the requirements of absolute fairness.",
                "The dower should neither be too low to harm the woman nor too high to burden the heirs.",
                "Mahr al-Mithl is an excellent metric for maintaining social and economic balance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق اور علم کی اہمیت",
              "english": "Importance of Research and Knowledge"
            },
            "content": {
              "urdu": [
                "ابن مسعود رضی اللہ عنہ کا طویل غور و فکر سکھاتا ہے کہ فتوے میں جلد بازی نہیں کرنی چاہیے۔",
                "ہمیں پیچیدہ مسائل میں جلیل القدر صحابہ اور فقہاء کی آراء سے استفادہ کرنا چاہیے۔",
                "علمِ دین میں پختگی کے لیے مآخذِ شریعت کا فہم ضروری ہے۔"
              ],
              "english": [
                "Ibn Mas'ud's long deliberation teaches that one should not rush when issuing a Fatwa.",
                "We should benefit from the opinions of great Companions and Jurists in complex matters.",
                "Understanding the sources of Sharia is vital for firm grounding in religious knowledge."
              ]
            }
          },
          {
            "title": {
              "urdu": "حق کی گواہی",
              "english": "Testifying to the Truth"
            },
            "content": {
              "urdu": [
                "معقل بن سنان نے بروقت گواہی دے کر ایک شرعی حکم کو پختہ کر دیا۔",
                "اگر کسی کے پاس علم ہو تو اسے دوسروں کی اصلاح کے لیے ضرور بیان کرنا چاہیے۔",
                "باہمی مشاورت اور علم کے تبادلے سے حق واضح ہوتا ہے۔"
              ],
              "english": [
                "Ma'qil bin Sinan provided timely testimony that solidified a Sharia ruling.",
                "If someone possesses knowledge, they must share it for the benefit of others.",
                "Truth becomes evident through mutual consultation and the exchange of knowledge."
              ]
            }
          }
        ]
      }
    }
  ]
}