{
  "hadithId": 1061,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/10/88"],
    "kitabId": 10,
    "inKitabBab": 3,
    "arabicBook": "كتاب الحدود",
    "babId": 86
  },

  "takhreej": {
    "arabic": "حسن. أخرجه أبو داود (1710)، والنسائي (4958)، والحاكم (4/384) وصححه، وأصله في الموطأ والمسند.",
    "urdu": "حسن۔ اسے ابوداؤد (1710) اور نسائی (4958) نے روایت کیا ہے۔ حاکم نے اسے صحیح کہا ہے۔ اس کی اصل موطا اور مسند احمد میں بھی موجود ہے۔",
    "english": "Hasan. Reported by Abu Dawud (1710), An-Nasa'i (4958), and Al-Hakim (4/384) who graded it Sahih. The core of this ruling is also found in Muwatta and Musnad Ahmad."
  },
  "importantWords": [
    {
      "arabic": "الْمُعَلَّقِ",
      "english": "Hanging (on trees)",
      "urdu": "لٹکا ہوا (درخت پر)"
    },
    {
      "arabic": "بِفِيهِ",
      "english": "With his mouth (eating)",
      "urdu": "اپنے منہ سے (کھانا)"
    },
    {
      "arabic": "خُبْنَةً",
      "english": "Bundle in a garment",
      "urdu": "کپڑے میں چھپا کر لینا"
    },
    {
      "arabic": "الْغَرَامَةُ",
      "english": "Fine/Compensation",
      "urdu": "تاوان یا جرمانہ"
    },
    {
      "arabic": "الْجَرِينُ",
      "english": "Drying place/Barn",
      "urdu": "کھلیان یا گودام"
    },
    {
      "arabic": "الْمِجَنِّ",
      "english": "Shield",
      "urdu": "ڈھال"
    }
  ],
  "summary": {
    "urdu": "حدیث میں بھوک کی حالت میں درخت سے پھل کھانے کی اجازت دی گئی ہے، لیکن اسے ذخیرہ کر کے لے جانے پر جرمانہ اور محفوظ جگہ سے چوری کرنے پر ہاتھ کاٹنے کی سزا بیان کی گئی ہے۔",
    "english": "The Hadith permits eating fruit from trees for the needy, but taking it away incurs a fine, and stealing from a secure storage leads to the legal penalty of amputation."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1710)",
      "english": "Reported by Abu Dawud (1710)"
    },
    {
      "arabic": "رواه النسائي (4958)",
      "english": "Reported by An-Nasa'i (4958)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-As"
      },
      "slug": "abdullah-bin-amr-bin-al-as"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fm2p6iYqXwU",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پھل کھانے کی شرعی اجازت",
        "english": "Permission to Eat Fruit"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت مند کے لیے رعایت",
              "english": "Ease for the Needy"
            },
            "content": {
              "urdu": [
                "اسلام میں بھوکے اور ضرورت مند کے لیے درخت سے گرے یا لٹکے پھل کھانے کی گنجائش ہے۔",
                "یہ رعایت صرف اتنی ہے کہ وہ موقع پر کھا کر اپنی بھوک مٹا لے۔",
                "اس عمل پر مالک کی طرف سے کوئی شرعی گرفت یا سزا نہیں ہوتی۔"
              ],
              "english": [
                "Islam allows a hungry or needy person to eat fruit hanging from or fallen from trees.",
                "This concession is limited to eating on the spot to satisfy one's hunger.",
                "There is no legal penalty or punishment from the owner for this specific act."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذخیرہ اندوزی کی ممانعت",
              "english": "Prohibition of Storing"
            },
            "content": {
              "urdu": [
                "پھل کھا لینا جائز ہے مگر اسے کپڑے یا برتن میں بھر کر لے جانا منع ہے۔",
                "ایسا کرنا چوری کے زمرے میں آتا ہے کیونکہ یہ ضرورت سے تجاوز ہے۔",
                "اسلامی قانون انفرادی ضرورت اور اجتماعی ملکیت کے درمیان توازن برقرار رکھتا ہے۔"
              ],
              "english": [
                "While eating is allowed, carrying it away in garments or containers is prohibited.",
                "Doing so is considered theft as it exceeds the immediate personal need.",
                "Islamic law maintains a balance between individual needs and property rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سزا اور تاوان کے اصول",
        "english": "Principles of Punishment and Fine"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر محفوظ جگہ سے چوری",
              "english": "Theft from Unsecured Places"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص کھلی جگہ سے پھل لے کر جائے تو اس پر دوگنا جرمانہ ہوتا ہے۔",
                "ایسی صورت میں ہاتھ کاٹنے کی حد نافذ نہیں ہوتی کیونکہ جگہ محفوظ نہیں تھی۔",
                "تعزیری سزا اس لیے دی جاتی ہے تاکہ لوگوں کے اموال کا تحفظ ہو سکے۔"
              ],
              "english": [
                "If someone takes fruit from an open area, they are liable for a double fine.",
                "In this case, the legal penalty of amputation is not applied because the place was not secure.",
                "Discretionary punishment is given to ensure the protection of people's property."
              ]
            }
          },
          {
            "title": {
              "urdu": "محفوظ جگہ (حرز) کی اہمیت",
              "english": "Importance of Secure Storage (Hirz)"
            },
            "content": {
              "urdu": [
                "ہاتھ کاٹنے کی سزا تب ہوتی ہے جب مال کسی محفوظ گودام یا کھلیان سے چوری ہو۔",
                "محفوظ جگہ سے چوری کرنا جرم کی سنگینی کو بڑھا دیتا ہے۔",
                "شریعت میں 'حرز' (حفاظت) چوری کی حد نافذ ہونے کے لیے ایک بنیادی شرط ہے۔"
              ],
              "english": [
                "Amputation occurs only when property is stolen from a secure storehouse or barn.",
                "Stealing from a protected area increases the severity of the crime.",
                "In Sharia, 'Hirz' (security) is a fundamental condition for the implementation of the theft penalty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مالی نصاب اور حد",
        "english": "Financial Threshold (Nisab) and Penalty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نصاب کی شرط",
              "english": "The Condition of Threshold"
            },
            "content": {
              "urdu": [
                "چوری کی حد (ہاتھ کاٹنا) اسی وقت نافذ ہوگی جب چوری شدہ مال نصاب تک پہنچے۔",
                "اس حدیث میں نصاب کی مقدار ایک 'ڈھال' کی قیمت مقرر کی گئی ہے۔",
                "معمولی چیزوں کی چوری پر ہاتھ کاٹنے جیسی بڑی سزا نہیں دی جاتی۔"
              ],
              "english": [
                "The penalty of amputation is only enforced if the stolen property reaches the Nisab.",
                "In this Hadith, the threshold amount is specified as the price of a 'shield'.",
                "Amputation is not applied for the theft of trivial or very low-value items."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوگنا جرمانہ (غرامہ)",
              "english": "Double Compensation (Gharamah)"
            },
            "content": {
              "urdu": [
                "غیر محفوظ مال کی چوری پر مالی جرمانہ گناہ کی تلافی کے طور پر لیا جاتا ہے۔",
                "یہ تاوان مالک کے نقصان کا ازالہ اور چور کے لیے عبرت ہوتا ہے۔",
                "مالی جرمانہ ان سزاؤں میں شامل ہے جو حد سے کم درجے کی ہوتی ہیں۔"
              ],
              "english": [
                "A financial fine is taken for stealing unsecured property as atonement.",
                "This compensation compensates the owner and serves as a lesson for the thief.",
                "Financial fines are among the punishments categorized below the level of 'Hadd'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اخلاقیات",
        "english": "Social Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہمدردی اور قانون کا توازن",
              "english": "Balance of Compassion and Law"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلام کے نظام عدل میں موجود ہمدردی اور سختی کے توازن کو واضح کرتی ہے۔",
                "بھوکے کے لیے کھانا ہمدردی ہے جبکہ ذخیرہ کرنا قانون شکنی ہے۔",
                "قانون کی سختی معاشرے میں امن برقرار رکھنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "This Hadith clarifies the balance of compassion and severity in the Islamic justice system.",
                "Eating for the hungry is compassion, while hoarding is a violation of the law.",
                "The strictness of the law is necessary to maintain peace in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالکان کی ذمہ داری",
              "english": "Responsibility of Owners"
            },
            "content": {
              "urdu": [
                "مالک کو چاہیے کہ وہ اپنے اموال کی حفاظت کے لیے مناسب انتظام کرے۔",
                "غیر محفوظ مال لوگوں کو گناہ کی ترغیب دینے کا باعث بن سکتا ہے۔",
                "اپنی چیزوں کی حفاظت کرنا اسلامی تعلیمات کا ایک اہم حصہ ہے۔"
              ],
              "english": [
                "Owners should make proper arrangements to protect their property.",
                "Unsecured property can tempt people into committing sins.",
                "Protecting one's belongings is an important part of Islamic teachings."
              ]
            }
          }
        ]
      }
    }
  ]
}