{
  "hadithId": 465,
  "hadithNo": 41,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3211"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },

  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (3211)، والحاكم (1/363)، والبيهقي (4/54). وصححه الألباني في أحكام الجنائز.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (3211) نے روایت کیا ہے۔ اس کے راوی عبداللہ بن یزید صحابی ہیں اور ان کا قول 'یہ سنت ہے' حکماً مرفوع حدیث کے درجے میں آتا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3211). The statement of the Companion 'This is from the Sunnah' carries the weight of a Marfu' (elevated) Hadith."
  },
  "importantWords": [
    {
      "arabic": "أَدْخَلَ",
      "english": "Entered / Inserted",
      "urdu": "داخل کیا / اتارا"
    },
    {
      "arabic": "الْمَيِّتَ",
      "english": "The Deceased",
      "urdu": "میت"
    },
    {
      "arabic": "قِبَلِ",
      "english": "Side / Direction",
      "urdu": "جانب / طرف"
    },
    {
      "arabic": "رِجْلَيِ",
      "english": "The feet",
      "urdu": "پاؤں"
    },
    {
      "arabic": "السُّنَّةِ",
      "english": "The Prophetic Way",
      "urdu": "سنت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تدفین کا ایک مسنون طریقہ بتایا گیا ہے کہ میت کو قبر میں اتارتے وقت اسے قبر کے پائینتی (پاؤں والی جگہ) سے داخل کرنا سنت ہے۔",
    "english": "This Hadith describes a Sunnah method of burial where the deceased is lowered into the grave starting from the feet-end of the grave."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3211)",
      "english": "Sunan Abu Dawud (3211)"
    },
    {
      "arabic": "المستدرك للحاكم (1/363)",
      "english": "Al-Mustadrak al-Hakim (1/363)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن يزيد الخطمي",
        "english": "Abdullah bin Yazid Al-Khatmi"
      },
      "slug": "abdullah-bin-yazid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبر میں اتارنے کا طریقہ",
        "english": "Method of Lowering into the Grave"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پاؤں کی جانب سے داخل کرنا",
              "english": "Entry from the Feet Side"
            },
            "content": {
              "urdu": [
                "میت کو قبر کے اس حصے سے داخل کرنا چاہیے جہاں میت کے پاؤں ہونے ہوں۔",
                "اس طریقے میں میت کا سر پہلے قبر میں جاتا ہے اور پھر باقی جسم۔",
                "یہ طریقہ میت کی حفاظت اور سہولت کے لحاظ سے بہترین سمجھا جاتا ہے۔"
              ],
              "english": [
                "The deceased should be inserted from the end where the feet will rest.",
                "In this manner, the head enters the grave first followed by the rest.",
                "This method is considered optimal for the deceased's safety and ease."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ صحابہ و رسول ﷺ",
              "english": "Practice of Prophet and Companions"
            },
            "content": {
              "urdu": [
                "عبداللہ بن یزید رضی اللہ عنہ نے اسے صراحتاً سنت قرار دیا ہے۔",
                "صحابہ کرام کا کسی عمل کو سنت کہنا اس کے نبوی ہونے کی دلیل ہے۔",
                "تدفین کے معاملے میں من گھڑت طریقوں کے بجائے سنت کی اتباع لازم ہے۔"
              ],
              "english": [
                "Abdullah bin Yazid (RA) explicitly identified this as the Sunnah.",
                "A Companion labeling an act as Sunnah proves its Prophetic origin.",
                "Adhering to Sunnah is mandatory over fabricated methods during burial."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی وسعت اور احکامات",
        "english": "Juristic Scope and Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف فقہی آراء",
              "english": "Various Juristic Opinions"
            },
            "content": {
              "urdu": [
                "اکثر ائمہ کے نزدیک میت کو چوڑائی کی طرف سے اتارنا بھی جائز ہے۔",
                "اصل مقصد میت کو نہایت نرمی اور عزت کے ساتھ قبر میں پہنچانا ہے۔",
                "اگر جگہ کی تنگی ہو تو جس طرح آسانی ہو، میت کو اتارا جا سکتا ہے۔"
              ],
              "english": [
                "Most Imams allow lowering the body from the side (width) as well.",
                "The primary goal is to place the body with gentleness and respect.",
                "If space is tight, the body can be lowered in any convenient way."
              ]
            }
          },
          {
            "title": {
              "urdu": "میت کی تکریم",
              "english": "Honor of the Deceased"
            },
            "content": {
              "urdu": [
                "میت کو قبر میں اتارتے وقت جھٹکوں اور بے ادبی سے بچنا ضروری ہے۔",
                "اسلام نے مردہ جسم کی حرمت کو زندہ جسم کی طرح قرار دیا ہے۔",
                "سنت طریقے پر عمل کرنا میت کے وقار میں اضافے کا باعث ہے۔"
              ],
              "english": [
                "It is vital to avoid jerks or disrespect when lowering the body.",
                "Islam equates the sanctity of a dead body to that of a living one.",
                "Following the Sunnah method enhances the dignity of the deceased."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تدفین کے دیگر مسنون اعمال",
        "english": "Other Sunnah Burial Acts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بسم اللہ پڑھنا",
              "english": "Reciting Bismillah"
            },
            "content": {
              "urdu": [
                "میت کو اتارتے وقت 'بسم اللہ و علی ملۃ رسول اللہ' کہنا سنت ہے۔",
                "یہ دعا میت کے ایمان پر خاتمے اور اللہ کی پناہ کی علامت ہے۔",
                "حاضرین کو خاموشی اور عبرت کے ساتھ اس عمل کا مشاہدہ کرنا چاہیے۔"
              ],
              "english": [
                "Reciting 'Bismillah wa 'ala millati Rasulillah' is a Sunnah act.",
                "This prayer signifies a righteous end and seeking Allah's refuge.",
                "Those present should observe the process with silence and reflection."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبلہ رخ لٹانا",
              "english": "Facing the Qiblah"
            },
            "content": {
              "urdu": [
                "میت کو دائیں کروٹ پر قبلہ رخ لٹانا تمام ائمہ کے نزدیک ضروری ہے۔",
                "یہ قبلہ کی عظمت اور اسلامی پہچان کا آخری اظہار ہے۔",
                "کفن کی گرہیں کھول دینا بھی مستحب اعمال میں شامل ہے۔"
              ],
              "english": [
                "Laying the body on the right side facing Qiblah is essential.",
                "It is the final expression of the greatness of Qiblah and Islamic identity.",
                "Untying the knots of the shroud is also among the recommended acts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تعلیمی سبق",
        "english": "Spiritual and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی اہمیت",
              "english": "Importance of Sunnah"
            },
            "content": {
              "urdu": [
                "زندگی کے آخری مرحلے تک سنت کی رہنمائی ہمارے پاس موجود ہے۔",
                "مسلمان کو چاہیے کہ وہ ہر چھوٹے بڑے معاملے میں سنت تلاش کرے۔",
                "سنت پر عمل کرنا ہی بدعت کے اندھیروں سے بچنے کا راستہ ہے۔"
              ],
              "english": [
                "Sunnah guidance is available even for the very final stage of life.",
                "A Muslim should seek the Sunnah in every minor and major matter.",
                "Adhering to the Sunnah is the only way to avoid the darkness of Bid'ah."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی فکر",
              "english": "Concern for the Hereafter"
            },
            "content": {
              "urdu": [
                "قبر کا منظر انسان کو دنیا کی حقیقت سے آگاہ کرتا ہے۔",
                "ہم سب کو ایک دن اسی طرح قبر کے اندھیرے میں اترنا ہے۔",
                "یہ حدیث ہمیں اس آخری گھر کی تیاری کی طرف متوجہ کرتی ہے۔"
              ],
              "english": [
                "The sight of the grave informs man about the reality of this world.",
                "We all must descend into the darkness of the grave one day.",
                "This Hadith draws our attention to preparing for this final abode."
              ]
            }
          }
        ]
      }
    }
  ]
}