{
  "hadithId": 1264,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/29"],
    "kitabId": 16,
    "inKitabBab": 2,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 103
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1893)، والترمذي (2671)، وأبو داود (5129)، وأحمد (4/120).",
    "urdu": "صحیح۔ اسے امام مسلم (1893) نے روایت کیا ہے۔ اس حدیث کا پس منظر یہ ہے کہ ایک شخص نبی ﷺ کے پاس سواری مانگنے آیا، آپ کے پاس سواری نہ تھی تو ایک دوسرے شخص نے اس کی رہنمائی کی کہ فلاں شخص اسے سواری دے سکتا ہے، جس پر آپ ﷺ نے یہ ارشاد فرمایا۔",
    "english": "Sahih. Reported by Muslim (1893), At-Tirmidhi (2671), and Abu Dawud (5129). It was spoken when a man directed another to someone who could provide him with a mount for travel."
  },
  "importantWords": [
    {
      "arabic": "دَلَّ",
      "english": "Directed / Guided / Led",
      "urdu": "رہنمائی کی / راستہ دکھایا"
    },
    {
      "arabic": "خَيْرٍ",
      "english": "Good / Virtue",
      "urdu": "بھلائی / نیکی"
    },
    {
      "arabic": "مِثْلُ أَجْرِ",
      "english": "Similar reward",
      "urdu": "اجر کے برابر"
    },
    {
      "arabic": "فَاعِلِهِ",
      "english": "Its doer",
      "urdu": "اس (نیکی) کو کرنے والا"
    }
  ],
  "summary": {
    "urdu": "نیکی کی دعوت دینا یا کسی کو نیکی کا راستہ بتانا خود نیکی کرنے کے برابر ہے اور اللہ تعالیٰ دونوں کو یکساں اجر عطا فرماتا ہے۔",
    "english": "Inviting toward good or guiding someone to a righteous path is equivalent to doing the deed itself, and Allah grants equal rewards to both."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الإمارة، باب فضل إعانة الغازي في سبيل الله، رقم 1893",
      "english": "Sahih Muslim, Book of Leadership, No. 1893"
    },
    {
      "arabic": "سنن الترمذي، كتاب العلم، باب ما جاء في الدال على الخير، رقم 2671",
      "english": "Sunan at-Tirmidhi, Book of Knowledge, No. 2671"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو مسعود البدري",
        "english": "Abu Mas'ud al-Badri"
      },
      "slug": "abu-masud-al-badri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نیکی کی رہنمائی کی فضیلت",
        "english": "The Virtue of Guiding to Good"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجر میں شراکت",
              "english": "Partnership in Reward"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ کی رحمت اتنی وسیع ہے کہ وہ نیکی کرنے والے کے ساتھ ساتھ اس کا راستہ دکھانے والے کو بھی اجر دیتا ہے۔",
                "رہنمائی کرنے والے کا اجر نیکی کرنے والے کے ثواب میں کوئی کمی نہیں کرتا بلکہ اللہ اپنے پاس سے دیتا ہے۔",
                "یہ اصول مسلمانوں کو ایک دوسرے کی اصلاح اور خیر کی ترغیب دینے پر ابھارتا ہے۔"
              ],
              "english": [
                "Allah's mercy is so vast that He rewards the guide alongside the doer of the good deed.",
                "The guide's reward does not decrease the doer's reward; Allah grants it from His infinite treasures.",
                "This principle encourages Muslims to reform one another and promote goodness."
              ]
            }
          },
          {
            "title": {
              "urdu": "خیر کی مختلف صورتیں",
              "english": "Various Forms of 'Good'"
            },
            "content": {
              "urdu": [
                "خیر سے مراد ہر وہ کام ہے جو اللہ اور اس کے رسول ﷺ کو پسند ہو، چاہے وہ دینی ہو یا دنیاوی۔",
                "کسی کو نماز کی دعوت دینا، علم سکھانا یا کسی ضرورت مند کا پتہ بتانا بھی اسی میں شامل ہے۔",
                "زبان سے نصیحت کرنا، تحریر کے ذریعے پیغام پہنچانا یا عملی نمونہ بننا سب رہنمائی کی شکلیں ہیں۔"
              ],
              "english": [
                "Goodness refers to everything pleasing to Allah and His Messenger, whether religious or worldly.",
                "Inviting someone to prayer, teaching knowledge, or directing someone to a needy person are all included.",
                "Advice by speech, spreading messages via writing, or being a role model are all forms of guidance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تبلیغ اور دعوتِ دین",
        "english": "Preaching and Dawah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "داعی کے لیے بشارت",
              "english": "Glad Tidings for the Caller"
            },
            "content": {
              "urdu": [
                "جو لوگ دین کی تبلیغ کرتے ہیں، ان کے پاس نیکیوں کے انبار جمع ہو جاتے ہیں کیونکہ وہ سینکڑوں کی رہنمائی کرتے ہیں۔",
                "اگر آپ کی وجہ سے ایک انسان بھی سیدھے راستے پر آ جائے تو یہ دنیا و مافیہا سے بہتر ہے۔",
                "نبی کریم ﷺ نے فرمایا تھا کہ 'اللہ کی قسم! اگر اللہ تمہارے ذریعے ایک آدمی کو ہدایت دے دے تو یہ سرخ اونٹوں سے بہتر ہے۔'"
              ],
              "english": [
                "Those who preach the religion accumulate immense rewards because they guide hundreds of people.",
                "If even one person is guided to the right path through you, it is better than the whole world and what it contains.",
                "The Prophet (ﷺ) said: 'By Allah, if Allah guides one person through you, it is better for you than red camels.'"
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ جاریہ",
              "english": "Ongoing Charity (Sadaqah Jariyah)"
            },
            "content": {
              "urdu": [
                "نیکی کی رہنمائی ایک ایسا بیج ہے جو آپ کے مرنے کے بعد بھی اجر کے پھل دیتا رہتا ہے۔",
                "جب تک وہ نیکی معاشرے میں جاری رہے گی، رہنمائی کرنے والے کو اس کا حصہ ملتا رہے گا۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ ہمیں نیکی کو خود تک محدود نہیں رکھنا چاہیے بلکہ اسے پھیلانا چاہیے۔"
              ],
              "english": [
                "Guiding to good is a seed that continues to bear the fruit of rewards even after your death.",
                "As long as that good deed continues in society, the guide will continue to receive a share.",
                "This Hadith teaches us not to limit goodness to ourselves but to spread it to others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انتباہ اور احتیاط",
        "english": "Warning and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برائی کی رہنمائی کا وبال",
              "english": "The Burden of Guiding to Evil"
            },
            "content": {
              "urdu": [
                "اسی طرح جو شخص برائی کا راستہ دکھاتا ہے، اسے بھی برائی کرنے والے کے برابر گناہ ملتا ہے۔",
                "غلط باتوں کو پھیلانا یا گناہ کی ترغیب دینا اخروی تباہی کا باعث ہے۔",
                "انسان کو اپنی زبان اور سوشل میڈیا کے استعمال میں بہت محتاط رہنا چاہیے کہ وہ کیا پھیلا رہا ہے۔"
              ],
              "english": [
                "Similarly, whoever leads to evil receives a burden of sin equal to the one who commits it.",
                "Spreading falsehood or encouraging sin leads to destruction in the Hereafter.",
                "A person must be very cautious with their speech and social media usage regarding what they promote."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "نیکی کا راستہ بتانے کے لیے عالم ہونا ضروری نہیں، آپ جو خیر جانتے ہیں وہ دوسروں تک پہنچائیں۔",
                "کسی بھوکے کو لنگر خانے کا پتہ بتانا یا کسی بے روزگار کو کام کی جگہ بتانا بھی اسی اجر میں شامل ہے۔",
                "مثبت سوچ اور خیر خواہی کے جذبے سے ہم ایک بہترین معاشرہ تشکیل دے سکتے ہیں۔"
              ],
              "english": [
                "One doesn't need to be a scholar to guide others to good; simply convey whatever goodness you know.",
                "Directing a hungry person to a food center or an unemployed person to a job site earns this reward.",
                "With positive thinking and a spirit of well-wishing, we can build an ideal society."
              ]
            }
          }
        ]
      }
    }
  ]
}