{
  "hadithId": 604,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/26"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحج",
    "babId": 39
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2434)، ومسلم (1355). واللفظ للبخاري في كتاب اللقطة، ومسلم في كتاب الحج.",
    "urdu": "صحیح۔ اسے امام بخاری (2434) اور امام مسلم (1355) نے روایت کیا ہے۔ یہ حدیث حرمِ مکہ کی ابدی حرمت اور وہاں کے مخصوص احکامات پر مبنی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2434) and Muslim (1355). This Hadith outlines the eternal sanctity of the Haram of Makkah and its unique legal rulings."
  },
  "importantWords": [
    {
      "arabic": "حَبَسَ",
      "english": "Held back / Prevented",
      "urdu": "روک دیا"
    },
    {
      "arabic": "أُحِلَّتْ",
      "english": "Was made lawful",
      "urdu": "حلال کی گئی"
    },
    {
      "arabic": "يُنَفَّرُ",
      "english": "Be chased / Scared away",
      "urdu": "بھگایا جائے"
    },
    {
      "arabic": "سَاقِطَتُهَا",
      "english": "Lost property / Fallen item",
      "urdu": "گری ہوئی چیز / لقطہ"
    },
    {
      "arabic": "الْإِذْخِرَ",
      "english": "Idhkhir (Fragrant grass)",
      "urdu": "اذخر گھاس"
    }
  ],
  "summary": {
    "urdu": "مکہ مکرمہ ایک محترم شہر ہے جہاں خونریزی، شکار، درخت کاٹنا اور گری ہوئی چیز اٹھانا (بغیر اعلان کے) حرام ہے، سوائے اذخر گھاس کے۔",
    "english": "Makkah is a sacred sanctuary where fighting, hunting, cutting plants, and taking lost items (without publicizing) are forbidden, with an exception for Idhkhir grass."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2434)",
      "english": "Sahih al-Bukhari (2434)"
    },
    {
      "arabic": "صحيح مسلم (1355)",
      "english": "Sahih Muslim (1355)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A8eLp8N7WbI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرمِ مکہ کی تاریخی اور شرعی حیثیت",
        "english": "Historical and Legal Status of the Makkah Sanctuary"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اصحابِ فیل کا تذکرہ",
              "english": "Mention of the People of the Elephant"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے 'فیل' (ہاتھی والے واقعے) کا ذکر کر کے یاد دلایا کہ اللہ نے ہمیشہ اس شہر کی حفاظت کی ہے۔",
                "ابرہہ کے لشکر کو ہاتھیوں سمیت تباہ کرنا اس شہر کی عظمت کی علامت تھا۔",
                "اللہ نے اس شہر کو مرکزِ توحید بنایا ہے اور اسے ہر قسم کے شر سے محفوظ رکھا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) mentioned the 'Elephant' incident to remind people of Allah's protection of Makkah.",
                "The destruction of Abrahah's army and his elephants was a sign of the city's sanctity.",
                "Allah established this city as the center of Monotheism and safeguarded it from evil."
              ]
            }
          },
          {
            "title": {
              "urdu": "عارضی حلت اور ابدی حرمت",
              "english": "Temporary Lawfulness and Eternal Sanctity"
            },
            "content": {
              "urdu": [
                "مکہ میں قتال ہمیشہ سے حرام رہا ہے، صرف فتح مکہ کے دن چند گھنٹوں کے لیے آپ ﷺ کو اجازت ملی۔",
                "اس کے بعد یہ حرمت قیامت تک کے لیے دوبارہ بحال کر دی گئی۔",
                "اس سے ثابت ہوتا ہے کہ مکہ 'دار الامن' ہے جہاں کسی کو خون بہانے کی اجازت نہیں۔"
              ],
              "english": [
                "Fighting in Makkah was always forbidden, except for a few hours granted to the Prophet (ﷺ) on the day of Victory.",
                "After that, its sanctity was reinstated until the Day of Resurrection.",
                "This proves Makkah is the 'Abode of Peace' where no blood-spilling is allowed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حرم کی نباتیات اور جنگلی حیات",
        "english": "Flora and Fauna of the Sanctuary"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شکار اور درختوں کی حفاظت",
              "english": "Protection of Game and Trees"
            },
            "content": {
              "urdu": [
                "حدودِ حرم میں کسی بھی جنگلی جانور کو نہ مارا جائے اور نہ ہی اسے ڈرایا جائے۔",
                "خود سے اگنے والے سبزے اور کانٹے دار جھاڑیوں کو کاٹنا بھی منع ہے۔",
                "یہ حکم ماحولیاتی توازن اور امن کی فضا کو برقرار رکھنے کے لیے ہے۔"
              ],
              "english": [
                "Within the Haram boundaries, no wild animal should be killed or even frightened.",
                "It is forbidden to uproot naturally growing vegetation or thorny bushes.",
                "This ruling aims to maintain ecological balance and an atmosphere of peace."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذخر گھاس کا استثناء",
              "english": "The Exception of Idhkhir Grass"
            },
            "content": {
              "urdu": [
                "سیدنا عباس کی درخواست پر آپ ﷺ نے 'اذخر' گھاس کاٹنے کی اجازت عطا فرمائی۔",
                "یہ گھاس گھروں کی چھتوں، ایندھن اور قبروں میں استعمال ہوتی تھی۔",
                "اس سے ثابت ہوتا ہے کہ انسانی ضرورت اور مصلحت کے تحت شریعت میں استثناء ممکن ہے۔"
              ],
              "english": [
                "Upon Al-Abbas's request, the Prophet (ﷺ) permitted the cutting of Idhkhir grass.",
                "This grass was essential for roofing, fuel, and strengthening graves.",
                "This proves that Sharia allows exceptions based on genuine human necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لقطہ (گری ہوئی چیز) کے احکام",
        "english": "Rulings on Lost Property (Luqatah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرم کی گری ہوئی چیز",
              "english": "Items Found in the Sanctuary"
            },
            "content": {
              "urdu": [
                "عام جگہوں پر گری چیز کا اعلان ایک سال تک ضروری ہے، مگر مکہ کی چیز کا اعلان ہمیشہ واجب ہے۔",
                "کوئی بھی شخص اسے ذاتی استعمال کے لیے نہیں اٹھا سکتا، صرف شناخت کے لیے اٹھا سکتا ہے۔",
                "مقصد یہ ہے کہ حاجی کی گمشدہ چیز ضائع نہ ہو اور اس کے اصل مالک کو مل جائے۔"
              ],
              "english": [
                "While items found elsewhere require a one-year announcement, items in Makkah must be announced forever.",
                "No one can pick it up for personal use; it can only be picked up to find its owner.",
                "The goal is to ensure a pilgrim's lost item is returned and not wasted."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانتداری کی تربیت",
              "english": "Training in Trustworthiness"
            },
            "content": {
              "urdu": [
                "یہ حکم حاجیوں کے مال کی حفاظت کی ضمانت دیتا ہے۔",
                "حرم کے مسافروں کو ذہنی سکون فراہم کرنا اس قانون کا بنیادی مقصد ہے۔",
                "اسلامی معاشرت میں امانت اور دیانت کا یہ اعلیٰ ترین نمونہ ہے۔"
              ],
              "english": [
                "This ruling guarantees the protection of pilgrims' property.",
                "Providing peace of mind to travelers of the Haram is the core objective of this law.",
                "This is the highest example of trust and integrity in Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق اور عدل و انصاف",
        "english": "Educational Lessons and Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قصاص اور دیت کا اختیار",
              "english": "Choice of Retaliation or Blood Money"
            },
            "content": {
              "urdu": [
                "قتل کی صورت میں مقتول کے ورثاء کو اختیار ہے کہ وہ بدلہ لیں یا خون بہا قبول کریں۔",
                "یہ عدلِ الٰہی ہے جو مظلوم کو اس کا حق دیتا ہے۔",
                "جنگ اور فتح کے ماحول میں بھی آپ ﷺ نے قانونی حقوق اور حدود کو واضح فرمایا۔"
              ],
              "english": [
                "In case of murder, the heirs have the choice between retaliation (Qisas) or blood-money (Diyah).",
                "This is Divine Justice giving the victim's family their rightful due.",
                "Even in a state of victory, the Prophet (ﷺ) clarified legal rights and boundaries."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشاورت اور اصلاح",
              "english": "Consultation and Rectification"
            },
            "content": {
              "urdu": [
                "سیدنا عباس کا لقمہ دینا اور آپ ﷺ کا اسے قبول کرنا صحابہ کی علمی بیداری کو ظاہر کرتا ہے۔",
                "دین کے معاملات میں سوال کرنا یا مصلحت کی طرف توجہ دلانا ایک مستحسن عمل ہے۔",
                "نبی ﷺ نے 'ابو شاہ' کے لیے خطبہ لکھوانے کا حکم دے کر علم کو قلمبند کرنے کی اہمیت بتائی۔"
              ],
              "english": [
                "Al-Abbas's suggestion and the Prophet's (ﷺ) acceptance show the intellectual alertness of the companions.",
                "Asking questions or pointing out necessities in religious matters is encouraged.",
                "The Prophet's command to write the sermon for 'Abu Shah' emphasizes the importance of documenting knowledge."
              ]
            }
          }
        ]
      }
    }
  ]
}