{
  "hadithId": 1357,
  "hadithNo": 26,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh:1534"
    ],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "كتاب الجامع",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه ابن ماجه (3846)، وأحمد (6/133)، وابن حبان (869)، والحاكم (1/521). وصححه الألباني في صحيح الجامع (1276).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام ابن ماجہ، امام احمد اور امام ابن حبان نے روایت کیا ہے۔ علامہ البانی نے اسے 'صحیح الجامع' میں صحیح قرار دیا ہے۔ یہ دعاؤں میں سے ایک نہایت جامع دعا ہے۔",
    "english": "Sahih (Authentic). Reported by Ibn Majah (3846), Ahmad (6/133), Ibn Hibban (869), and Al-Hakim (1/521). Authenticated by Al-Albani in Sahih al-Jami' (1276)."
  },
  "importantWords": [
    {
      "arabic": "عَاجِلِهِ وَآجِلِهِ",
      "english": "Present and Future",
      "urdu": "جلد ملنے والی اور دیر سے ملنے والی"
    },
    {
      "arabic": "عَاذَ بِهِ",
      "english": "Sought refuge from",
      "urdu": "پناہ مانگی"
    },
    {
      "arabic": "قَرَّبَ إِلَيْهَا",
      "english": "Brings closer to it",
      "urdu": "اس کے قریب کر دے"
    },
    {
      "arabic": "قَضَاءٍ",
      "english": "Decree / Fate",
      "urdu": "فیصلہ / تقدیر"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نہایت جامع دعا پر مشتمل ہے جس میں دنیا و آخرت کی تمام بھلائیوں، جنت کے حصول، جہنم سے بچاؤ اور تقدیر کے ہر فیصلے پر راضی رہنے کی التجا کی گئی ہے۔",
    "english": "This Hadith contains a comprehensive supplication seeking all types of goodness, entry into Paradise, protection from Hellfire, and contentment with divine decrees."
  },
  "references": [
    {
      "arabic": "سنن ابن ماجه (3846)",
      "english": "Sunan Ibn Majah (3846)"
    },
    {
      "arabic": "صحيح ابن حبان (869)",
      "english": "Sahih Ibn Hibban (869)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کی جامعیت اور وسعت",
        "english": "The Comprehensiveness of the Du'a"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیر و شر کا مکمل احاطہ",
              "english": "Complete Coverage of Good and Evil"
            },
            "content": {
              "urdu": [
                "اس دعا میں 'الخیر کلہ' (تمام بھلائی) مانگی گئی ہے، جس میں مادی، روحانی، دنیاوی اور اخروی ہر قسم کی خیر شامل ہے۔",
                "انسان بہت سی چیزوں کو اپنے لیے بہتر سمجھتا ہے جو حقیقت میں نہیں ہوتیں، اس لیے 'جو میں نہیں جانتا' کے الفاظ نہایت اہم ہیں۔",
                "شر سے پناہ مانگنا بھی اتنا ہی ضروری ہے جتنا خیر کا سوال کرنا، کیونکہ بلاؤں سے بچنا نفع حاصل کرنے پر مقدم ہے۔"
              ],
              "english": [
                "This prayer asks for 'all goodness' (Al-Khair kullihi), covering material, spiritual, worldly, and eternal benefits.",
                "Humans often perceive things as good that are actually harmful; hence, the phrase 'what I do not know' is vital.",
                "Seeking refuge from evil is as important as asking for good, as averting harm takes precedence over gaining benefit."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی دعاؤں کا خلاصہ",
              "english": "Summary of Prophetic Supplications"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے وہ تمام خیر مانگنے کی تعلیم دی جو آپ ﷺ نے خود مانگی، یہ امت کے لیے ایک شارٹ کٹ ہے کہ وہ تمام برکتیں سمیٹ لیں۔",
                "انبیاء کی مانگی ہوئی پناہ سب سے زیادہ محفوظ پناہ گاہ ہے۔",
                "یہ حصہ اس بات کی دلیل ہے کہ ایک مومن کو اپنے نبی ﷺ کے نقشِ قدم پر چلتے ہوئے دعا کرنی چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) taught to ask for all the good he himself asked for, providing a 'shortcut' to all divine blessings.",
                "Seeking refuge where the Prophets sought refuge is the most secure sanctuary.",
                "This part proves that a believer should follow the footsteps of the Prophet (ﷺ) even in supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مقصدِ حیات: جنت اور نجات",
        "english": "The Goal of Life: Paradise and Salvation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قول و عمل کی توفیق",
              "english": "Guidance for Words and Deeds"
            },
            "content": {
              "urdu": [
                "صرف جنت کی تمنا کافی نہیں، بلکہ ان اسباب (نیک اعمال اور سچی گفتگو) کی توفیق بھی مانگی گئی ہے جو جنت لے جائیں۔",
                "برے اعمال اور کلمات سے دوری کی التجا کی گئی ہے کیونکہ یہی جہنم کا راستہ ہیں۔",
                "یہ دعا انسان کو اپنے روزمرہ کے کردار کی اصلاح کی طرف متوجہ کرتی ہے۔"
              ],
              "english": [
                "Desiring Paradise is not enough; one must ask for the means (righteous deeds and truthful speech) that lead to it.",
                "Seeking distance from evil deeds and words is requested as they are the pathways to Hell.",
                "This supplication redirects the individual toward rectifying their daily character."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رضا بالرضا اور تقدیر",
        "english": "Contentment with Destiny"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فیصلوں میں خیر کی طلب",
              "english": "Seeking Good in Decrees"
            },
            "content": {
              "urdu": [
                "دعا کا آخری حصہ تقدیر پر راضی رہنے اور اللہ کے ہر فیصلے میں بہتری تلاش کرنے کا سبق دیتا ہے۔",
                "انسان اللہ کی حکمتوں کو مکمل طور پر نہیں سمجھ سکتا، اس لیے اللہ سے یہ مانگنا کہ وہ 'ہر فیصلے کو بہتر بنا دے' سکونِ قلب کا باعث ہے۔",
                "یہ کلمات بندے کے اندر عاجزی اور اللہ پر مکمل بھروسہ پیدا کرتے ہیں۔"
              ],
              "english": [
                "The final part teaches contentment with fate and looking for the silver lining in every divine decree.",
                "Human understanding of divine wisdom is limited; asking Allah to 'make every decree good' leads to tranquility.",
                "These words foster humility and total reliance (Tawakkul) on Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جامع دعا کا انتخاب",
              "english": "Choosing Comprehensive Supplications"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ جامع کلمات کو پسند فرماتے تھے، ہمیں بھی ان مسنون دعاؤں کو زبانی یاد کرنا چاہیے۔",
                "اپنی ذاتی ضرورتوں کو ان جامع الفاظ میں سمیٹ کر مانگنا قبولیت کے زیادہ قریب ہے۔",
                "اس دعا کو اپنی زندگی کے ہر اہم موڑ اور روزانہ کے اذکار کا حصہ بنائیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) preferred comprehensive words; we should memorize these Sunnah supplications.",
                "Folding personal needs into these broad phrases increases the likelihood of acceptance.",
                "Make this Du'a a part of every major life event and daily remembrance."
              ]
            }
          }
        ]
      }
    }
  ]
}