{
  "hadithId": 996,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1146"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },

  "takhreej": {
    "arabic": "رواه أحمد (5/12)، وأبو داود (4515)، والنسائي (4736)، والترمذي (1414)، وابن ماجه (2663). والحسن البصري عن سمرة مختلف في سماعه، لكن الحديث له شواهد تقويه.",
    "urdu": "اسے امام احمد، ابوداؤد، نسائی، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ حسن بصری کا سمرہ سے سماع اختلافی ہے، تاہم دیگر شواہد اس مفہوم کی تائید کرتے ہیں۔",
    "english": "Reported by Ahmad (5/12), Abu Dawud (4515), An-Nasa'i (4736), At-Tirmidhi (1414), and Ibn Majah (2663). Although the hearing of Hasan al-Basri from Samurah is debated, the core principle is supported by other evidences."
  },
  "importantWords": [
    {
      "arabic": "قَتَلَ",
      "english": "Killed",
      "urdu": "قتل کیا"
    },
    {
      "arabic": "عَبْدَهُ",
      "english": "His Slave",
      "urdu": "اپنا غلام"
    },
    {
      "arabic": "جَدَعَ",
      "english": "Mutilated (Cut off nose/ear)",
      "urdu": "ناک یا کان کاٹا"
    },
    {
      "arabic": "خَصَى",
      "english": "Castrated",
      "urdu": "خصی کیا"
    },
    {
      "arabic": "قَتَلْنَاهُ",
      "english": "We shall kill him",
      "urdu": "ہم اسے قتل کریں گے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غلاموں کے انسانی حقوق اور ان پر ہونے والے تشدد کے خلاف قصاص (برابری کی سزا) کے قانون کو واضح کرتی ہے۔",
    "english": "This Hadith establishes the law of Qisas (retaliation) for slaves, ensuring their human rights against murder and physical mutilation by their owners."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1414)",
      "english": "Sunan At-Tirmidhi (1414)"
    },
    {
      "arabic": "سنن أبي داود (4515)",
      "english": "Sunan Abu Dawud (4515)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundab"
      },
      "slug": "samurah-bin-jundab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غلاموں کے انسانی حقوق",
        "english": "Human Rights of Slaves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جان کی برابری",
              "english": "Equality of Life"
            },
            "content": {
              "urdu": [
                "اسلام نے غلام کو محض جائیداد نہیں بلکہ ایک انسان قرار دیا ہے۔",
                "اگر کوئی مالک اپنے غلام کو قتل کرے گا تو بدلے میں اسے بھی قتل کیا جائے گا۔",
                "یہ حکم غلاموں کی زندگیوں کے تحفظ کے لیے ایک مضبوط ڈھال ہے۔"
              ],
              "english": [
                "Islam treats a slave as a human being, not just mere property.",
                "If an owner kills his slave, he is subject to the death penalty in return.",
                "This ruling serves as a strong shield to protect the lives of slaves."
              ]
            }
          },
          {
            "title": {
              "urdu": "تشدد کی ممانعت",
              "english": "Prohibition of Torture"
            },
            "content": {
              "urdu": [
                "غلام کے اعضاء کاٹنا یا اسے مسخ کرنا سخت حرام اور قابلِ سزا جرم ہے۔",
                "ناک، کان کاٹنے والے مالک کے ساتھ ویسا ہی برتاؤ کیا جائے گا۔",
                "اسلام نے غلاموں پر کسی بھی قسم کے غیر انسانی تشدد کا دروازہ بند کر دیا۔"
              ],
              "english": [
                "Mutilating a slave's limbs or disfiguring them is strictly forbidden and punishable.",
                "An owner who cuts a slave's nose or ear will face the same treatment.",
                "Islam closed the door on all forms of inhuman torture against slaves."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قصاص کا جامع قانون",
        "english": "The Universal Law of Retaliation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل و انصاف کی فراہمی",
              "english": "Providing Justice"
            },
            "content": {
              "urdu": [
                "قصاص کا مطلب ہے 'برابری کا بدلہ'، جو معاشرے میں توازن پیدا کرتا ہے۔",
                "قانون کی نظر میں مالک اور غلام کی انسانی جان کی قیمت برابر رکھی گئی ہے۔",
                "یہ اصول کمزور طبقات کو طاقتور کے ظلم سے بچانے کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "Qisas means 'equal retaliation,' which creates balance in society.",
                "In the eyes of the law, the human life of a master and a slave is equal.",
                "This principle is designed to protect weak classes from the oppression of the powerful."
              ]
            }
          },
          {
            "title": {
              "urdu": "اضافی سزاؤں کی حکمت",
              "english": "Wisdom Behind Additional Penalties"
            },
            "content": {
              "urdu": [
                "خصی کرنے کی ممانعت انسانی فطرت اور حقوق کی سنگین خلاف ورزی کو روکتی ہے۔",
                "ایسی زیادتی کرنے والے مالک کو عبرت ناک سزا دی جائے گی۔",
                "اسلامی قانون مجرم کی سماجی حیثیت کے بجائے جرم کی نوعیت دیکھتا ہے۔"
              ],
              "english": [
                "The prohibition of castration prevents a grave violation of human nature and rights.",
                "An owner committing such an excess will be given an exemplary punishment.",
                "Islamic law looks at the nature of the crime rather than the social status of the criminal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند اور سماع کی بحث",
        "english": "Discussion on Narration and Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسن بصری کی روایت",
              "english": "Narration of Hasan al-Basri"
            },
            "content": {
              "urdu": [
                "محدثین کے درمیان حسن بصری کا سمرہ سے سماع (سننا) ایک علمی بحث ہے۔",
                "اکثر علماء کے نزدیک ان کی سمرہ سے روایت 'کتاب' کی صورت میں معتبر ہے۔",
                "امام ترمذی نے اسے 'حسن' قرار دے کر اس کے مفہوم کی تائید کی ہے۔"
              ],
              "english": [
                "The hearing of Hasan al-Basri from Samurah is an academic debate among scholars.",
                "Most scholars consider his narrations from Samurah valid via written manuscripts.",
                "Imam At-Tirmidhi classified it as 'Hasan,' supporting its legal context."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر احادیث سے تائید",
              "english": "Confirmation from Other Hadiths"
            },
            "content": {
              "urdu": [
                "اس حدیث کا مفہوم قرآن کی عام آیاتِ قصاص سے مطابقت رکھتا ہے۔",
                "دیگر روایات بھی غلاموں کے ساتھ حسنِ سلوک کی تاکید کرتی ہیں۔",
                "فقہاء کی ایک جماعت اس حدیث کی بنیاد پر مالک پر قصاص واجب کرتی ہے۔"
              ],
              "english": [
                "The meaning of this Hadith aligns with general Quranic verses on retaliation.",
                "Other narrations also emphasize the kind treatment of slaves.",
                "A group of jurists makes Qisas obligatory on the owner based on this Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظلم کا خاتمہ",
              "english": "Elimination of Injustice"
            },
            "content": {
              "urdu": [
                "اسلام سے پہلے غلاموں کے ساتھ جانوروں سے بدتر سلوک کیا جاتا تھا۔",
                "اس قانون نے مالکوں کے دلوں میں اللہ اور قانون کا خوف پیدا کیا۔",
                "اسلامی ریاست میں ہر شہری، خواہ وہ غلام ہو، انصاف کا حقدار ہے۔"
              ],
              "english": [
                "Before Islam, slaves were treated worse than animals.",
                "This law instilled the fear of Allah and the legal system in the hearts of owners.",
                "In an Islamic state, every citizen, even a slave, is entitled to justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی تربیت",
              "english": "Moral Training"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے طاقتور کو کمزور پر ظلم کرنے سے سختی سے روکا ہے۔",
                "غلاموں کے معاملے میں اللہ سے ڈرنے کی وصیت آپ ﷺ کے آخری کلمات میں شامل تھی۔",
                "یہ حدیث ایک مثالی اور رحمدل معاشرے کی تشکیل کی بنیاد فراہم کرتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) strictly forbade the powerful from oppressing the weak.",
                "Fearing Allah regarding slaves was among the final words of the Prophet (ﷺ).",
                "This Hadith provides the basis for forming an ideal and merciful society."
              ]
            }
          }
        ]
      }
    }
  ]
}