{
  "hadithId": 774,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/774"],
    "kitabId": 7,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 56
  },
 
  "takhreej": {
    "arabic": "حديث صحيح بشواهده. رواه ابن ماجه (2443). وله شواهد من حديث أبي هريرة عند البيهقي (6/121) وسنده حسن، وحديث جابر عند الطبراني في الصغير (34).",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے ابن ماجہ (2443) نے روایت کیا ہے۔ اس کے شواہد حضرت ابوہریرہ (بیہقی) اور حضرت جابر (طبرانی) سے مروی ہیں جو اس کی تقویت کرتے ہیں۔",
    "english": "This Hadith is Sahih due to its supporting evidences. Reported by Ibn Majah (2443). Supporting narrations are found from Abu Hurairah in Al-Bayhaqi (6/121) with a Hasan chain, and from Jabir in At-Tabarani."
  },
  "importantWords": [
    {
      "arabic": "أَعْطُوا",
      "english": "Give / Pay",
      "urdu": "تم ادا کرو"
    },
    {
      "arabic": "اَلْأَجِيرَ",
      "english": "The Worker / Laborer",
      "urdu": "مزدور"
    },
    {
      "arabic": "أَجْرَهُ",
      "english": "His wages",
      "urdu": "اس کی مزدوری"
    },
    {
      "arabic": "يَجِفَّ",
      "english": "Dries",
      "urdu": "خشک ہو جائے"
    },
    {
      "arabic": "عَرَقُهُ",
      "english": "His sweat",
      "urdu": "اس کا پسینہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مزدور کے حقوق اور اسے بروقت اجرت دینے کی تاکید کرتی ہے، تاکہ اس کی محنت کا صلہ اسے فوری مل سکے اور اس کا استحصال نہ ہو۔",
    "english": "This Hadith emphasizes the rights of workers and the importance of paying their wages promptly to ensure their labor is rewarded without delay or exploitation."
  },
  "references": [
    {
      "arabic": "رواه ابن ماجه (2443)",
      "english": "Reported by Ibn Majah (2443)"
    },
    {
      "arabic": "رواه البيهقي (6/121)",
      "english": "Reported by Al-Bayhaqi (6/121)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic due to others)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اجرت کی بروقت ادائیگی",
        "english": "Prompt Payment of Wages"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پسینہ خشک ہونے سے پہلے کا مطلب",
              "english": "Meaning of 'Before Sweat Dries'"
            },
            "content": {
              "urdu": [
                "اس سے مراد کام مکمل ہوتے ہی بغیر کسی تاخیر کے مزدوری دینا ہے۔",
                "یہ ایک بلیغ استعارہ ہے جو فوری ادائیگی کی اہمیت کو واضح کرتا ہے۔",
                "اگر اجرت روزانہ کی بنیاد پر طے ہے تو دن ختم ہوتے ہی ادا کرنا لازم ہے۔"
              ],
              "english": [
                "It means paying the wages immediately after the task is completed without delay.",
                "This is an eloquent metaphor emphasizing the urgency of payment.",
                "If wages are daily, they must be paid as soon as the workday ends."
              ]
            }
          },
          {
            "title": {
              "urdu": "تاخیر کی ممانعت",
              "english": "Prohibition of Delay"
            },
            "content": {
              "urdu": [
                "استطاعت کے باوجود مزدور کی اجرت روکنا ظلم شمار ہوتا ہے۔",
                "بلاوجہ ٹال مٹول کرنا مزدور کی معاشی تنگی کا باعث بنتا ہے۔",
                "اسلامی معاشرت میں حق دار کو اس کا حق فوری دینا عدل کا تقاضا ہے۔"
              ],
              "english": [
                "Withholding a worker's wages despite having the means is considered oppression.",
                "Unnecessary delays cause financial hardship for the laborer.",
                "In Islamic society, giving a rightful person their due immediately is a requirement of justice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مزدور کے معاشی حقوق",
        "english": "Economic Rights of the Worker"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی وقار کا تحفظ",
              "english": "Protection of Human Dignity"
            },
            "content": {
              "urdu": [
                "بروقت ادائیگی سے مزدور کو اپنی ضروریات پوری کرنے میں آسانی ہوتی ہے۔",
                "اس سے آجر اور اجیر کے درمیان باہمی اعتماد اور محبت پیدا ہوتی ہے۔",
                "مزدور کا استحصال کرنا معاشرتی بے امنی کا سبب بنتا ہے۔"
              ],
              "english": [
                "Timely payment enables the worker to meet his basic needs easily.",
                "It fosters mutual trust and respect between the employer and employee.",
                "Exploiting workers leads to social unrest and instability."
              ]
            }
          },
          {
            "title": {
              "urdu": "طے شدہ اجرت کی پابندی",
              "english": "Adherence to Agreed Wages"
            },
            "content": {
              "urdu": [
                "کام شروع کرنے سے پہلے اجرت کا تعین کر لینا سنت ہے۔",
                "طے شدہ رقم میں بلاوجہ کٹوتی کرنا شرعی طور پر ناجائز ہے۔",
                "مزدور کو اس کی محنت کے مطابق پورا معاوضہ ملنا چاہیے۔"
              ],
              "english": [
                "It is a Sunnah to fix the wages before the work begins.",
                "Making arbitrary deductions from the agreed amount is Islamically prohibited.",
                "A worker must receive full compensation commensurate with his effort."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Juristic and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظلم سے بچنا",
              "english": "Avoiding Oppression"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ 'مالدار کا ٹال مٹول کرنا ظلم ہے'۔",
                "مزدور کا حق مارنا ان گناہوں میں سے ہے جن کا اللہ خود حساب لے گا۔",
                "آخرت کی پکڑ سے بچنے کے لیے مالی معاملات کو صاف رکھنا ضروری ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said, 'Delay in payment by a rich person is injustice.'",
                "Usurping a worker's rights is a sin for which Allah Himself will demand accountability.",
                "Clear financial dealings are essential to avoid punishment in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاہدے کی پاسداری",
              "english": "Fulfilling Contracts"
            },
            "content": {
              "urdu": [
                "اجرت کی ادائیگی ایک شرعی معاہدہ ہے جسے پورا کرنا فرض ہے۔",
                "اگر ادائیگی کی کوئی مدت (جیسے ماہانہ) طے ہے تو اس کی پابندی لازم ہے۔",
                "معاہدے کی خلاف ورزی کرنا نفاق کی علامات میں سے ہے۔"
              ],
              "english": [
                "Paying wages is a Shariah contract that must be fulfilled.",
                "If a specific period (like monthly) is agreed upon, it must be strictly followed.",
                "Violating a contract is among the signs of hypocrisy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملازمین کے ساتھ حسنِ سلوک",
              "english": "Kindness Toward Employees"
            },
            "content": {
              "urdu": [
                "اپنے ماتحتوں کی ضروریات کا خیال رکھنا بہترین اخلاق ہے۔",
                "انہیں وقت پر تنخواہ دے کر ان کی زندگی میں سکون پیدا کریں۔",
                "خوش دل ملازم زیادہ بہتر اور ایمانداری سے کام کرتا ہے۔"
              ],
              "english": [
                "Caring for the needs of subordinates is a sign of excellent character.",
                "Paying them on time creates peace and stability in their lives.",
                "A satisfied employee works with greater efficiency and honesty."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی انصاف کا قیام",
              "english": "Establishing Social Justice"
            },
            "content": {
              "urdu": [
                "اسلامی تعلیمات پر عمل کر کے ایک عادلانہ نظام قائم کیا جا سکتا ہے۔",
                "مزدور کی محنت کی قدر کرنا معاشرے کی معاشی بنیادوں کو مضبوط کرتا ہے۔",
                "حقوق کی بروقت ادائیگی سے طبقاتی کشمکش کا خاتمہ ہوتا ہے۔"
              ],
              "english": [
                "A just system can be established by following Islamic teachings.",
                "Valuing a worker's labor strengthens the economic foundations of society.",
                "Prompt fulfillment of rights eliminates class conflict and resentment."
              ]
            }
          }
        ]
      }
    }
  ]
}