{
  "hadithId": 889,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/88"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
 
  "takhreej": {
    "arabic": "ضعيف جداً. رواه الدارقطني (3/245) والبيهقي (7/240). في سنده داود بن يزيد الأودي وهو ضعيف، والشعبي لم يسمع من علي، فهو منقطع.",
    "urdu": "یہ روایت سخت ضعیف ہے۔ اسے دارقطنی اور بیہقی نے روایت کیا ہے۔ اس کی سند میں داود الاودی ضعیف ہے اور امام شعبی کا سیدنا علی سے سماع ثابت نہیں، لہٰذا یہ منقطع بھی ہے۔",
    "english": "Very Weak. Reported by Ad-Daraqutni (3/245) and Al-Bayhaqi (7/240). Dawud bin Yazid al-Awdi in the chain is weak, and Ash-Sha'bi did not hear from 'Ali, making the chain disconnected (Munqati')."
  },
  "importantWords": [
    {
      "arabic": "اَلْمَهْرُ",
      "english": "Dower",
      "urdu": "مہر"
    },
    {
      "arabic": "أَقَلَّ",
      "english": "Less / Minimum",
      "urdu": "کم سے کم"
    },
    {
      "arabic": "عَشَرَةِ دَرَاهِمَ",
      "english": "Ten dirhams",
      "urdu": "دس درہم"
    },
    {
      "arabic": "مَوْقُوفًا",
      "english": "Mauquf (Reported from Companion)",
      "urdu": "موقوف (صحابی کا قول)"
    }
  ],
  "summary": {
    "urdu": "اس روایت میں مہر کی کم از کم حد دس درہم بتائی گئی ہے، جو احناف کا مسلک ہے، تاہم علمی و سندی اعتبار سے یہ روایت ضعیف ہے۔",
    "english": "This narration sets the minimum Mahr at ten dirhams, which is the position of the Hanafi school, though the narration itself is weak and disconnected."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني (3683)",
      "english": "Sunan ad-Daraqutni (3683)"
    },
    {
      "arabic": "سنن البيهقي الكبرى (14358)",
      "english": "Sunan al-Bayhaqi al-Kubra (14358)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "ضعيف / منقطع",
    "english": "Weak / Disconnected"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہر کی کم از کم مقدار اور فقہی اختلاف",
        "english": "Minimum Dower and Juristic Differences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احناف کا موقف",
              "english": "Hanafi School's Position"
            },
            "content": {
              "urdu": [
                "امام ابو حنیفہ اور ان کے اصحاب کے نزدیک مہر کی کم از کم مقدار دس درہم ہے۔",
                "وہ اس روایت اور چوری کی حد (دس درہم) پر قیاس کرتے ہوئے یہ موقف رکھتے ہیں۔",
                "ان کے نزدیک مہر عورت کی عزت کا بدلہ ہے، اس لیے اسے ایک معقول حد سے کم نہیں ہونا چاہیے۔"
              ],
              "english": [
                "According to Imam Abu Hanifa and his followers, the minimum Mahr is ten dirhams.",
                "They base this on such narrations and an analogy with the minimum theft amount for cutting hands.",
                "They view Mahr as a sanctification of the marriage bond, thus requiring a substantial minimum."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Position of the Majority"
            },
            "content": {
              "urdu": [
                "امام شافعی، احمد اور اسحاق کے نزدیک مہر کی کوئی کم از کم حد مقرر نہیں ہے۔",
                "وہ صحیح احادیث (مثلاً لوہے کی انگوٹھی یا سورہ قرآنی) سے استدلال کرتے ہیں۔",
                "ان کے نزدیک ہر وہ چیز مہر بن سکتی ہے جس کی کچھ نہ کچھ مالی قیمت ہو۔"
              ],
              "english": [
                "Imams Shafi'i, Ahmad, and Ishaq believe there is no fixed minimum amount for Mahr.",
                "They derive evidence from Sahih Hadiths, like the iron ring or teaching Quranic verses.",
                "Anything that has some financial value is acceptable as Mahr in their view."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت کی سندی کمزوری",
        "english": "Weakness of the Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انقطاعِ سند",
              "english": "Broken Chain"
            },
            "content": {
              "urdu": [
                "امام شعبی نے سیدنا علی رضی اللہ عنہ سے براہِ راست کچھ نہیں سنا۔",
                "علمِ حدیث میں ایسی روایت 'منقطع' کہلاتی ہے جو کہ حجت نہیں ہوتی۔",
                "اس لیے اس قول کو قطعی طور پر سیدنا علی کی طرف منسوب کرنا مشکل ہے۔"
              ],
              "english": [
                "Imam Ash-Sha'bi never heard directly from Ali bin Abi Talib (RA).",
                "In Hadith science, such a narration is called 'Munqati' (disconnected) and is not binding evidence.",
                "Therefore, it is difficult to definitively attribute this statement to Ali (RA)."
              ]
            }
          },
          {
            "title": {
              "urdu": "راوی پر جرح",
              "english": "Criticism of Narrators"
            },
            "content": {
              "urdu": [
                "سند میں موجود داود بن یزید الاودی محدثین کے نزدیک ضعیف راوی ہے۔",
                "اسی وجہ سے امام دارقطنی اور حافظ ابن حجر نے اس کی سند میں کلام کی نشاندہی کی ہے۔",
                "جب کسی مسئلے میں صحیح احادیث موجود ہوں تو ضعیف روایت کو ترجیح نہیں دی جاتی۔"
              ],
              "english": [
                "Dawud bin Yazid al-Awdi in the chain is considered weak by Hadith scholars.",
                "This is why Ad-Daraqutni and Ibn Hajar pointed out the defects in its transmission.",
                "Weak narrations are generally not prioritized when authentic Hadiths are available on the subject."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی تعلیمات کی روح",
        "english": "Spirit of Islamic Teachings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح میں آسانی",
              "english": "Ease in Marriage"
            },
            "content": {
              "urdu": [
                "اسلام کا اصل مقصد نکاح کو معاشرے میں آسان بنانا ہے۔",
                "مہر کی کوئی کم از کم حد مقرر نہ کرنا غریب طبقے کے لیے بہت بڑی سہولت ہے۔",
                "بہترین نکاح وہ ہے جو اخراجات اور مہر کے لحاظ سے سب سے آسان ہو۔"
              ],
              "english": [
                "The primary goal of Islam is to facilitate easy marriages within society.",
                "Not fixing a mandatory minimum Mahr provides great relief for the less wealthy.",
                "The most blessed marriage is the one which is simplest regarding expenses and dower."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کا مقام اور مرضی",
              "english": "Women's Status and Consent"
            },
            "content": {
              "urdu": [
                "مہر عورت کا حق ہے، اگر وہ خوشی سے تھوڑی مقدار پر راضی ہو تو اس کا احترام ضروری ہے۔",
                "شریعت نے مرد کو حکم دیا ہے کہ اپنی استطاعت کے مطابق مہر ادا کرے۔",
                "مالی تنگی کی صورت میں علم یا ہنر کی تعلیم بھی مہر قرار دی جا سکتی ہے۔"
              ],
              "english": [
                "Mahr is the woman's right; if she willingly agrees to a small amount, it must be respected.",
                "Sharia commands the man to pay dower according to his actual financial capacity.",
                "In cases of financial hardship, teaching a skill or knowledge can also serve as Mahr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیقِ مسائل کی ضرورت",
              "english": "Need for Investigating Matters"
            },
            "content": {
              "urdu": [
                "دینی مسائل میں صرف کسی کے قول پر تکیہ کرنے کے بجائے اس کی دلیل دیکھنی چاہیے۔",
                "فقہی اختلافات اللہ کی رحمت ہیں جن سے مختلف حالات میں آسانی پیدا ہوتی ہے۔",
                "مستند علماء سے رجوع کرنا ہی صحیح راہنمائی کے حصول کا راستہ ہے۔"
              ],
              "english": [
                "In religious matters, one should look at the evidence rather than just following a statement.",
                "Juristic differences are a mercy, providing flexibility in varying circumstances.",
                "Consulting reliable scholars is the path to attaining correct guidance."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی بالادستی",
              "english": "Supremacy of the Sunnah"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ کا طرزِ عمل تمام اقوال پر مقدم ہے۔",
                "صحیح احادیث ثابت کرتی ہیں کہ آپ ﷺ نے مہر کی تنگی کو نکاح میں رکاوٹ نہیں بننے دیا۔",
                "ہمیں اپنے رسم و رواج کو سنتِ نبوی ﷺ کے تابع بنانا چاہیے۔"
              ],
              "english": [
                "The practice of the Prophet (ﷺ) takes precedence over all other opinions.",
                "Authentic Hadiths prove that he did not allow a small dower to block a marriage.",
                "We must subordinate our customs and traditions to the Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}