{
  "hadithId": 1007,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/15"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (6896). وقد وردت القصة كاملة عند مالك في الموطأ (2/871) بسند صحيح أن أربعة قتلوا غلاماً.",
    "urdu": "یہ اثر صحیح ہے۔ اسے امام بخاری نے روایت کیا ہے۔ اس کی مکمل تفصیل موطا امام مالک میں ہے کہ چار افراد نے مل کر ایک لڑکے کو قتل کیا تھا جس پر حضرت عمر نے یہ تاریخی فیصلہ دیا۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (6896). The full incident is recorded in Muwatta Malik (2/871) with a Sahih chain, stating that four people were involved in the murder of the boy."
  },
  "importantWords": [
    {
      "arabic": "غِيلَةً",
      "english": "Assassination / Trickery",
      "urdu": "دھوکہ سے قتل کرنا"
    },
    {
      "arabic": "اِشْتَرَكَ",
      "english": "Participated / Joined",
      "urdu": "شریک ہوئے"
    },
    {
      "arabic": "صَنْعَاءَ",
      "english": "Sana'a (City in Yemen)",
      "urdu": "صنعاء (یمن کا شہر)"
    },
    {
      "arabic": "لَقَتَلْتُهُمْ",
      "english": "I would have killed them",
      "urdu": "میں ان سب کو قتل کر دیتا"
    },
    {
      "arabic": "غُلَامٌ",
      "english": "Young boy",
      "urdu": "لڑکا / غلام"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے یہ عظیم فقہی اصول ثابت ہوتا ہے کہ اگر کئی لوگ مل کر ایک شخص کو قتل کریں تو قصاص میں ان تمام شریک افراد کو قتل کیا جائے گا۔",
    "english": "This narration establishes the vital juristic principle that if a group of people collectively murder one person, all participants are subject to execution in Qisas."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6896)",
      "english": "Reported by Al-Bukhari (6896)"
    },
    {
      "arabic": "رواه مالك في الموطأ (2/871)",
      "english": "Reported by Malik in Al-Muwatta (2/871)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XW9Vl8-F-O4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اجتماعی قتل کا حکم",
        "english": "Ruling on Collective Murder"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کئی افراد کا ایک کے بدلے قصاص",
              "english": "Retaliation of Many for One"
            },
            "content": {
              "urdu": [
                "اگر ایک گروہ مل کر ایک فرد کو قتل کرے تو سب کو سزائے موت دی جائے گی۔",
                "یہ حضرت عمر فاروق رضی اللہ عنہ کا وہ فیصلہ ہے جس پر صحابہ کا اجماع تھا۔",
                "اگر ایسا نہ ہوتا تو لوگ گروہ بنا کر قتل کرتے اور قصاص سے بچ جاتے۔"
              ],
              "english": [
                "If a group collectively murders an individual, all are executed in Qisas.",
                "This was a landmark decision by Umar (RA) on which the Companions agreed.",
                "Without this law, people would form groups to kill and escape retaliation."
              ]
            }
          },
          {
            "title": {
              "urdu": "قتلِ غیلہ کی سنگینی",
              "english": "Severity of Murder by Deception"
            },
            "content": {
              "urdu": [
                "دھوکے سے قتل کرنا (غیلہ) ایک انتہائی سنگین اور قبیح جرم ہے۔",
                "ایسے قتل میں مقتول کو اپنا دفاع کرنے کا موقع نہیں ملتا۔",
                "سیدنا عمر نے اس طرح کے جرائم کے خلاف انتہائی سخت موقف اختیار فرمایا۔"
              ],
              "english": [
                "Murder by trickery or deception (Ghilah) is a particularly heinous crime.",
                "In such cases, the victim has no opportunity to defend themselves.",
                "Umar (RA) took an extremely firm stance against such calculated crimes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدلِ فاروقی کی حکمت",
        "english": "Wisdom of Umar's Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسدادِ جرائم",
              "english": "Crime Prevention"
            },
            "content": {
              "urdu": [
                "سخت سزا کا مقصد معاشرے سے قتل و غارت گری کا جڑ سے خاتمہ ہے۔",
                "جب پورے شہر کو تنبیہ کی گئی تو مجرموں میں خوفِ خدا اور قانون پیدا ہوا۔",
                "یہ اصول انسانی جان کی حرمت کو یقینی بنانے کے لیے ناگزیر ہے۔"
              ],
              "english": [
                "The purpose of severe punishment is to uproot violence from society.",
                "Warning an entire city instilled fear of God and the law in criminals.",
                "This principle is indispensable for ensuring the sanctity of human life."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانون کی بالادستی",
              "english": "Supremacy of Law"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں طاقتور یا گروہ بندی کو کوئی استثنیٰ حاصل نہیں ہے۔",
                "عدل کا تقاضا ہے کہ ہر شریکِ جرم کو اس کے کیے کی سزا ملے۔",
                "حضرت عمر کا قول 'اہلِ صنعاء' ایک ضرب المثل کے طور پر استعمال ہوتا ہے۔"
              ],
              "english": [
                "In Islamic law, no group or powerful entity is granted immunity.",
                "Justice requires that every accomplice faces the penalty of their actions.",
                "Umar's reference to 'People of San'a' is used as a legal proverb."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرکت کی نوعیت",
              "english": "Nature of Participation"
            },
            "content": {
              "urdu": [
                "قصاص تب واجب ہوتا ہے جب سب نے قتل کے ارادے سے وار کیا ہو۔",
                "اگر کوئی صرف پہرہ دے رہا ہو تو اس کی سزا مختلف ہو سکتی ہے۔",
                "مگر ارادے اور عمل میں شرکت سب کو قصاص کا حقدار بنا دیتی ہے۔"
              ],
              "english": [
                "Qisas is mandatory when all participants strike with intent to kill.",
                "If one is merely a lookout, their punishment might be different.",
                "However, joint intent and action make all liable for capital punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماعِ صحابہ",
              "english": "Consensus of the Companions"
            },
            "content": {
              "urdu": [
                "اس فیصلے پر کسی صحابی نے اختلاف نہیں کیا، جو اجماع کی دلیل ہے۔",
                "چاروں ائمہ فقہ نے اس اصول کو اپنی قانونی کتب میں جگہ دی ہے۔",
                "یہ فیصلہ اسلامی فوجداری قانون کا ایک ستون بن چکا ہے۔"
              ],
              "english": [
                "No companion disagreed with this verdict, indicating a consensus (Ijma).",
                "All four Imams of Fiqh incorporated this principle into their legal texts.",
                "This verdict has become a pillar of Islamic criminal jurisprudence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی سبق",
        "english": "Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی جان کی قیمت",
              "english": "The Value of Human Life"
            },
            "content": {
              "urdu": [
                "ایک غلام یا غریب بچے کی جان بھی اتنی ہی قیمتی ہے جتنی کسی سردار کی۔",
                "عدالت مقتول کی سماجی حیثیت نہیں بلکہ اس کی جان کی حرمت دیکھتی ہے۔",
                "اسلامی نظامِ عدل مساوات کی بہترین مثال پیش کرتا ہے۔"
              ],
              "english": [
                "The life of a slave or poor child is as valuable as that of a leader.",
                "The court looks at the sanctity of life, not the social status of the victim.",
                "The Islamic justice system presents the best example of equality."
              ]
            }
          },
          {
            "title": {
              "urdu": "برائی میں تعاون کا انجام",
              "english": "Consequence of Cooperation in Evil"
            },
            "content": {
              "urdu": [
                "برائی اور گناہ کے کام میں ایک دوسرے کی مدد کرنا ہلاکت کا باعث ہے۔",
                "گروہ بندی کر کے قانون سے بچنے کی کوشش ناکام ہو جاتی ہے۔",
                "ہر شخص کو اپنے گروہ کے اعمال کی ذمہ داری اٹھانی ہوگی۔"
              ],
              "english": [
                "Helping one another in evil and sin leads to total destruction.",
                "Attempting to escape the law through group numbers will fail.",
                "Every individual must bear responsibility for the actions of their group."
              ]
            }
          }
        ]
      }
    }
  ]
}