{
  "hadithId": 990,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1140"],
    "kitabId": 8,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 78
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2699)، وأحمد (770) من حديث علي بن أبي طالب رضي الله عنه.",
    "urdu": "یہ حدیث صحیح ہے۔ امام بخاری نے اسے (2699) پر اور امام احمد نے سیدنا علی کی روایت سے (770) پر تخریج کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2699) and Ahmad (770) from the narration of Ali bin Abi Talib (RA)."
  },
  "importantWords": [
    {
      "arabic": "قَضَى",
      "english": "Judged / Decided",
      "urdu": "فیصلہ فرمایا"
    },
    {
      "arabic": "ابْنَةِ",
      "english": "Daughter",
      "urdu": "بیٹی"
    },
    {
      "arabic": "خَالَتِهَا",
      "english": "Maternal Aunt",
      "urdu": "اس کی خالہ"
    },
    {
      "arabic": "بِمَنْزِلَةِ",
      "english": "In the position of",
      "urdu": "کے درجے میں"
    },
    {
      "arabic": "وَالِدَةٌ",
      "english": "Mother",
      "urdu": "ماں"
    },
    {
      "arabic": "اَلْجَارِيَةُ",
      "english": "The girl / Child",
      "urdu": "لڑکی"
    }
  ],
  "summary": {
    "urdu": "اگر ماں موجود نہ ہو تو بچی کی پرورش کا حق خالہ کو دیا جائے گا کیونکہ خالہ شفقت اور حقوق میں ماں کے برابر قرار دی گئی ہے۔",
    "english": "If the mother is unavailable, the right of custody for a child goes to the maternal aunt, as she is legally positioned like a mother in terms of care."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2699)",
      "english": "Sahih al-Bukhari (2699)"
    },
    {
      "arabic": "مسند أحمد (770)",
      "english": "Musnad Ahmad (770)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "البراء بن عازب",
        "english": "Al-Bara' bin 'Azib"
      },
      "slug": "al-bara-bin-azib"
    },
    {
      "id": 2,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R0uW4K_7V9M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خالہ کا شرعی مقام",
        "english": "Shariah Status of Maternal Aunt"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماں کے قائم مقام",
              "english": "Replacement for Mother"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے واضح فرمایا کہ خالہ شفقت اور پرورش میں ماں کے درجے میں ہے۔",
                "اگر ماں وفات پا جائے یا نااہل ہو، تو خالہ کو دیگر رشتہ داروں پر فوقیت حاصل ہے۔",
                "یہ حکم خالہ کی فطری محبت اور قریبی خونی تعلق کی بنیاد پر دیا گیا ہے۔"
              ],
              "english": [
                "The Prophet ﷺ clarified that the maternal aunt is like the mother in affection and care.",
                "If the mother passes away or is unfit, the aunt takes precedence over others.",
                "This ruling is based on the aunt's natural love and close biological tie."
              ]
            }
          },
          {
            "title": {
              "urdu": "حضانت میں ترجیح",
              "english": "Priority in Custody"
            },
            "content": {
              "urdu": [
                "اس کیس میں حضرت علی، جعفر اور زید بن حارثہ کے درمیان نزاع تھا۔",
                "آپ ﷺ نے خونی رشتے اور مامتا کے متبادل کو ترجیح دے کر فیصلہ فرمایا۔",
                "بچی کی تربیت کے لیے خالہ کا گھر سب سے زیادہ محفوظ اور موزوں قرار پایا۔"
              ],
              "english": [
                "In this case, there was a dispute between Ali, Ja'far, and Zaid bin Harithah.",
                "The Prophet ﷺ decided based on blood relations and the substitute for motherhood.",
                "The aunt's home was deemed the safest and most suitable for the girl's upbringing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رشتہ داروں کے حقوق",
        "english": "Rights of Relatives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صلہ رحمی کی اہمیت",
              "english": "Importance of Family Ties"
            },
            "content": {
              "urdu": [
                "اسلام میں ننھیال کے رشتوں کو بہت اہمیت دی گئی ہے۔",
                "خالہ کے ساتھ اچھا سلوک کرنا درحقیقت ماں کے ساتھ نیکی کرنے کے مترادف ہے۔",
                "یتیم بچوں کی کفالت میں قریبی رشتہ داروں کو آگے آنا چاہیے۔"
              ],
              "english": [
                "Maternal relations are given great importance in Islamic law.",
                "Treating a maternal aunt well is equivalent to being kind to one's mother.",
                "Close relatives should step forward for the guardianship of orphaned children."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچیوں کی حفاظت",
              "english": "Protection of Young Girls"
            },
            "content": {
              "urdu": [
                "اسلام بچیوں کی بہترین پرورش اور ان کی عزت و عفت کا ضامن ہے۔",
                "خالہ کے پاس بچی کی تربیت نسائی تقاضوں کے مطابق بہتر ہو سکتی ہے۔",
                "معاشرتی نظام میں عورتوں کے کردار کو اس حدیث سے تقویت ملتی ہے۔"
              ],
              "english": [
                "Islam guarantees the best upbringing and honor for young girls.",
                "A girl's upbringing is better handled by an aunt according to feminine needs.",
                "The role of women in the social structure is strengthened by this Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدل و انصاف کا نمونہ",
        "english": "Example of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نزاع کا بہترین حل",
              "english": "Resolution of Conflict"
            },
            "content": {
              "urdu": [
                "صحابہ کے درمیان فضیلت کے بجائے شرعی اصول پر فیصلہ کیا گیا۔",
                "نبی ﷺ نے فریقین کے دلائل سننے کے بعد ایک جامع اصول وضع فرمایا۔",
                "یہ فیصلہ قیامت تک کے لیے حضانت کے مقدمات میں دلیل بن گیا۔"
              ],
              "english": [
                "The decision was made on Shariah principles rather than personal status.",
                "After hearing all parties, the Prophet ﷺ established a universal principle.",
                "This ruling serves as a precedent for custody cases until the Day of Judgment."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ نبوی ﷺ",
              "english": "Prophetic Wisdom"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے رشتے داری کے حقوق کو جوڑنے کے لیے یہ فیصلہ فرمایا۔",
                "اس سے ثابت ہوتا ہے کہ پرورش کا حق شفقت پر مبنی ہے۔",
                "قانون سازی میں بچوں کے مفاد کو سب سے زیادہ اہمیت حاصل ہے۔"
              ],
              "english": [
                "The Prophet ﷺ issued this ruling to uphold the rights of kinship.",
                "It proves that the right to custody is fundamentally based on compassion.",
                "In legislation, the best interest of the child is given supreme importance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یتیم کی کفالت",
              "english": "Guardian of the Orphan"
            },
            "content": {
              "urdu": [
                "سیدنا حمزہ کی بیٹی یتیم تھی، جس کی کفالت پر صحابہ میں مقابلہ تھا۔",
                "نیک کاموں میں ایک دوسرے سے سبقت لے جانا صحابہ کا شیوہ تھا۔",
                "یتیم کی پرورش کرنا جنت میں نبی ﷺ کی رفاقت کا ذریعہ ہے۔"
              ],
              "english": [
                "Hamzah's daughter was an orphan, and Sahaba competed to care for her.",
                "Competing in good deeds was the characteristic of the Companions.",
                "Taking care of an orphan is a means to be with the Prophet ﷺ in Jannah."
              ]
            }
          },
          {
            "title": {
              "urdu": "گھریلو ہم آہنگی",
              "english": "Domestic Harmony"
            },
            "content": {
              "urdu": [
                "خالہ کے گھر میں بچے کو ماں جیسی ممتا ملتی ہے، جو نفسیاتی صحت کے لیے ضروری ہے۔",
                "خاندانوں کو چاہیے کہ وہ مشکل وقت میں ایک دوسرے کے بچوں کا سہارا بنیں۔",
                "اسلامی معاشرہ باہمی ہمدردی اور مدد پر قائم ہے۔"
              ],
              "english": [
                "A child finds motherly love in an aunt's house, vital for mental health.",
                "Families should support each other's children during difficult times.",
                "The Islamic society is built on mutual sympathy and assistance."
              ]
            }
          }
        ]
      }
    }
  ]
}