{
  "hadithId": 1057,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1253"],
    "kitabId": 10,
    "inKitabBab": 3,
    "arabicBook": "بلوغ المرام",
    "babId": 86
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (3/352)، وأبو داود (4391)، والترمذي (1448)، والنسائي (8/17)، وابن ماجه (2591)، وصححه الترمذي وابن حبان (4411).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام احمد، ابو داؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ امام ترمذی اور ابن حبان نے اس کی تصحیح کی ہے۔",
    "english": "Sahih. Reported by Ahmad (3/352), Abu Dawud (4391), At-Tirmidhi (1448), An-Nasa'i (8/17), and Ibn Majah (2591). Graded Sahih by At-Tirmidhi and Ibn Hibban (4411)."
  },
  "importantWords": [
    {
      "arabic": "خَائِنٍ",
      "english": "Embezzler / Breacher of trust",
      "urdu": "خیانت کرنے والا"
    },
    {
      "arabic": "مُنْتَهِبٍ",
      "english": "Plunderer / Looter",
      "urdu": "لوٹ مار کرنے والا"
    },
    {
      "arabic": "مُخْتَلِسٍ",
      "english": "Snatcher / Pickpocket",
      "urdu": "اچک کر لے جانے والا"
    },
    {
      "arabic": "قَطْعٌ",
      "english": "Cutting (of the hand)",
      "urdu": "ہاتھ کاٹنا"
    },
    {
      "arabic": "لَيْسَ",
      "english": "Is not",
      "urdu": "نہیں ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں واضح کیا گیا ہے کہ خیانت، لوٹ مار اور اچکا گری میں ہاتھ کاٹنے کی شرعی حد نہیں لگتی، کیونکہ ان میں 'حرز' (حفاظت) کی شرط پوری نہیں ہوتی۔",
    "english": "This Hadith clarifies that the legal punishment of hand-cutting does not apply to breach of trust, plundering, or snatching, as the condition of 'Hirz' (secure storage) is not met."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1448)",
      "english": "Reported by At-Tirmidhi (1448)"
    },
    {
      "arabic": "رواه أبو داود (4391)",
      "english": "Reported by Abu Dawud (4391)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0hWqW_U8P8g",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فقہی اصطلاحات کی وضاحت",
        "english": "Clarification of Juristic Terms"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خائن اور منتهب کا فرق",
              "english": "Difference between Embezzler and Plunderer"
            },
            "content": {
              "urdu": [
                "خائن وہ ہے جو امانت میں خیانت کرے یعنی مال اس کے پاس خود دیا گیا ہو۔",
                "منتهب وہ ہے جو لوگوں کے سامنے علانیہ طور پر زبردستی مال لوٹ لے۔",
                "مختلس وہ ہے جو لوگوں کی غفلت کا فائدہ اٹھا کر تیزی سے مال اچک لے۔"
              ],
              "english": [
                "An embezzler is one who breaches trust with property entrusted to him.",
                "A plunderer is one who openly and forcefully seizes property from people.",
                "A snatcher takes property swiftly by taking advantage of people's inattention."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرز (حفاظت) کی شرط",
              "english": "The Condition of Hirz"
            },
            "content": {
              "urdu": [
                "ہاتھ کاٹنے کی سزا کے لیے مال کا محفوظ جگہ (حرز) سے چرایا جانا ضروری ہے۔",
                "خیانت میں مال پہلے ہی خائن کے قبضے میں ہوتا ہے، اس لیے حرز نہیں پایا گیا۔",
                "لوٹ مار اور اچکا گری میں بھی مال باقاعدہ حرز سے نہیں نکالا جاتا۔"
              ],
              "english": [
                "For the punishment of hand-cutting, the property must be taken from a secure place.",
                "In breach of trust, the item is already in the person's possession, so there's no Hirz.",
                "In snatching or plundering, the property is not taken from a formal secure storage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سزا کے نفاذ کے اصول",
        "english": "Principles of Executing Penalties"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعزیری سزا کا نفاذ",
              "english": "Application of Ta'zir"
            },
            "content": {
              "urdu": [
                "اگرچہ ان جرائم میں ہاتھ نہیں کٹتا، لیکن یہ گناہ اور جرم ضرور ہیں۔",
                "حکومت وقت ان مجرموں کو قید یا کوڑوں کی تعزیری سزا دے سکتی ہے۔",
                "حد کا نہ ہونا اس بات کی دلیل نہیں کہ مجرم کو بالکل چھوڑ دیا جائے۔"
              ],
              "english": [
                "Although the hand is not cut for these crimes, they remain serious sins and offenses.",
                "The state can apply discretionary punishments (Ta'zir) like imprisonment or lashing.",
                "The absence of a fixed 'Hadd' does not mean the criminal goes unpunished."
              ]
            }
          },
          {
            "title": {
              "urdu": "شبہات کا فائدہ",
              "english": "The Benefit of Doubt"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں حدود کو شبہات کی بنیاد پر ٹال دیا جاتا ہے۔",
                "چونکہ ان صورتوں میں چوری کی مکمل تعریف صادق نہیں آتی، حد نہیں لگتی۔",
                "یہ شریعت کے عدل اور توازن کی ایک بہترین مثال ہے۔"
              ],
              "english": [
                "In Islamic law, 'Hadd' punishments are averted in the presence of doubts.",
                "Since these cases do not meet the full definition of theft, Hadd is not applied.",
                "This is a prime example of the justice and balance inherent in Sharia."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی پہلو",
        "english": "Social Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالک کی ذمہ داری",
              "english": "Responsibility of the Owner"
            },
            "content": {
              "urdu": [
                "اچکا گری اور لوٹ مار میں اکثر مالک کی غفلت کا بھی عمل دخل ہوتا ہے۔",
                "شریعت لوگوں کو اپنے مال کی خود حفاظت کرنے کی ترغیب دیتی ہے۔",
                "جب مال غیر محفوظ ہو تو چور کے لیے حد کی سزا میں تخفیف ہو جاتی ہے۔"
              ],
              "english": [
                "Snatching and plundering often involve an element of negligence by the owner.",
                "Sharia encourages people to take responsibility for securing their own property.",
                "When property is left unsecured, the specific 'Hadd' punishment is mitigated."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت کی اہمیت",
              "english": "Importance of Trust"
            },
            "content": {
              "urdu": [
                "خیانت کرنا منافق کی نشانیوں میں سے ایک بڑی نشانی ہے۔",
                "اگرچہ خائن کا ہاتھ نہیں کٹتا، مگر وہ اللہ کے ہاں سخت جوابدہ ہے۔",
                "معاشرتی اعتماد کی بحالی کے لیے دیانت داری کو فروغ دینا ضروری ہے۔"
              ],
              "english": [
                "Breaching trust is one of the major signs of a hypocrite (Munafiq).",
                "Although an embezzler's hand is not cut, he is severely accountable to Allah.",
                "Promoting honesty is essential for restoring social and communal trust."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جرائم کی درجہ بندی",
              "english": "Classification of Crimes"
            },
            "content": {
              "urdu": [
                "شریعت نے ہر جرم کی نوعیت کے اعتبار سے الگ سزا مقرر کی ہے۔",
                "چوری (سرقہ) ایک مخصوص جرم ہے جس کی شرائط سخت ہیں۔",
                "دوسرے مالی جرائم کو ان کے اپنے دائرہ کار میں رکھا گیا ہے۔"
              ],
              "english": [
                "Sharia has prescribed different punishments based on the nature of each crime.",
                "Theft (Sariqah) is a specific crime with very strict conditions for 'Hadd'.",
                "Other financial crimes are kept within their own specific legal frameworks."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم اور آگاہی",
              "english": "Education and Awareness"
            },
            "content": {
              "urdu": [
                "ایسی احادیث مسلمانوں کو قانونی باریکیوں سے آگاہ کرتی ہیں۔",
                "اس سے ججوں اور مفتیوں کو درست فیصلے کرنے میں مدد ملتی ہے۔",
                "علمِ دین کا حصول ہر مسلمان کے لیے دنیا و آخرت کی کامیابی ہے۔"
              ],
              "english": [
                "Such Hadiths inform Muslims about the finer points of the law.",
                "This helps judges and Muftis in making correct and just legal decisions.",
                "Acquiring religious knowledge is success for every Muslim in both worlds."
              ]
            }
          }
        ]
      }
    }
  ]
}