{
  "hadithId": 183,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["1:5:4"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
 
  "takhreej": {
    "arabic": "- صحيح .‏ رواه مسلم (510)‏ ، وساقه الحافظ بمعناه ، وإلا فلفظه عند مسلم هو : \"إذا قام أحدكم يصلي ، فإنه يستره إذا كان بين يديه مثل مؤخرة الرحل .‏ فإذا لم يكن بين يديه مثل مؤخرة الرحل فإنه يقطع صلاته الحمار ، والمرأة والكلب الأسود\".‏ قال عبد الله بن الصامت : قلت يا أبا ذر ! ما بال الكلب الأسود من الكلب الأحمر من الكلب الأصفر ؟! قال يا ابن أخي ! سألت رسول الله ‏-صلى الله عليه وسلم‏- فقال : \"الكلب الأسود شيطان\" .‏ صحيح .‏ رواه مسلم (511)‏ ولفظه : \"يقطع الصلاة المرأة ، والحمار ، والكلب ، ويقي ذلك مثل مؤخرة الرحل\" .‏ وقول الحافظ : \"دون الكلب\" لعله وهم ، وإلا فهذا لفظ مسلم وفيه لفظ \"الكلب\" أو لعل الحافظ أراد دون وصف الكلب .‏ والله أعلم .‏ صحيح مرفوعا .‏ رواه أبو داود (703)‏ ولفظه : \"يقطع الصلاة :المرأة الحائض .‏ والكلب\".‏ وأما النسائي فرواه موقوفا ومرفوعا عن ابن عباس (2/64)‏ .‏",
    "urdu": "صحیح۔ اسے مسلم (510) نے روایت کیا ہے، اور حافظ ابن حجر نے اسے معنی کے ساتھ نقل کیا ہے، وگرنہ مسلم کے ہاں اس کا لفظ یہ ہے: ”جب تم میں سے کوئی کھڑا ہو کر نماز پڑھے تو اس کے لیے سترہ ہو جاتا ہے جب اس کے آگے پالان کے پچھلے حصے کے برابر سترہ ہو جائے۔ اور جب اس کے آگے پالان کے پچھلے حصے کے برابر سترہ نہ ہو تو اس کی نماز کو گدھا، عورت اور کالا کتا توڑ دیتا ہے۔“ عبداللہ بن صامت نے کہا: میں نے ابو ذرؓ سے کہا: کالے کتے کو سرخ اور پیلے کتے پر کیا فوقیت ہے؟ انہوں نے فرمایا: اے میرے بھتیجے! میں نے رسول اللہ ﷺ سے سوال کیا تو آپ نے فرمایا: ”کالا کتا شیطان ہوتا ہے۔“ صحیح۔ اسے مسلم (511) نے روایت کیا ہے اور اس کا لفظ ہے: ”نماز کو عورت، گدھا، اور کتا توڑ دیتے ہیں، اور پالان کے پچھلے حصے کے برابر سترہ اس سے بچاتا ہے۔“ اور حافظ ابن حجر کا قول ”دون الکلب“ (کتے کے بغیر) شاید وہم ہے، وگرنہ مسلم کا یہ لفظ ہے اور اس میں کتے کا لفظ ہے، یا شاید حافظ نے کتے کے وصف (سیاہ) کو مراد لیا ہو۔ واللہ اعلم۔ صحیح مرفوعاً۔ اسے ابوداؤد (703) نے روایت کیا ہے اور اس کا لفظ ہے: ”نماز کو توڑ دیتا ہے: حائضہ عورت، اور کتا۔“ اور نسائی نے اسے ابن عباسؓ سے موقوفاً اور مرفوعاً (2/64) روایت کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (510). The full wording in Muslim is: 'When one of you stands to pray, he is protected if he has before him a Sutrah like the back of a saddle. If he does not have before him a Sutrah like the back of a saddle, his prayer is severed by the donkey, the woman, and the black dog.' 'Abdullāh ibn Aṣ-Ṣāmit said: I asked Abū Dharr: Why the black dog, rather than the red or yellow dog? He said: My nephew, I asked the Messenger of Allah (ﷺ), and he said: 'The black dog is a devil.' Authentic (Ṣaḥīḥ). Reported by Muslim (511) with the wording: 'The prayer is severed by the woman, the donkey, and the dog, and a Sutrah like the back of the saddle protects against that.' Al-Ḥāfiz's note 'without mentioning the dog' is likely an error, as this wording from Muslim includes the dog, or perhaps he meant without the description 'black.' And Allah knows best. Authentic as Marfū'. Reported by Abu Dawud (703) with the wording: 'The prayer is severed by: the menstruating woman (Al-Mar'ah Al-Ḥā'iḍ), and the dog.' An-Nasā'ī reported it as Mauqūf and Marfū' from Ibn 'Abbās (2/64)."
  },
  "importantWords": [
    {
      "arabic": "يَقْطَعُ صَلَاةَ",
      "english": "Severes/interrupts the prayer",
      "urdu": "نماز کو توڑ دیتا ہے"
    },
    {
      "arabic": "مِثْلُ مُؤْخِرَةِ اَلرَّحْلِ",
      "english": "Like the back of the saddle",
      "urdu": "پالان کے پچھلے حصہ کے برابر"
    },
    {
      "arabic": "اَلْمَرْأَةُ",
      "english": "The woman",
      "urdu": "عورت"
    },
    {
      "arabic": "وَالْحِمَارُ",
      "english": "And the donkey",
      "urdu": "اور گدھا"
    },
    {
      "arabic": "وَالْكَلْبُ اَلْأَسْوَدُ",
      "english": "And the black dog",
      "urdu": "اور کالا کتا"
    },
    {
      "arabic": "اَلْكَلْبُ اَلْأَسْوَدِ شَيْطَانٌ",
      "english": "The black dog is a devil",
      "urdu": "کالا کتا شیطان ہوتا ہے"
    },
    {
      "arabic": "اَلْمَرْأَةَ بِالْحَائِضِ",
      "english": "Restricted the woman by the menstruating (woman)",
      "urdu": "عورت کو حائضہ ہونے کی قید"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ اگر نمازی کے آگے پالان کے پچھلے حصے کے برابر سترہ نہ ہو تو عورت، گدھا، اور کالا کتا اس کی نماز کو باطل کر دیتے ہیں۔ اس حدیث میں کالے کتے کو شیطان قرار دیا گیا ہے۔ یہ حکم سترہ کی اہمیت، نماز کے خشوع کی حفاظت اور بعض جانوروں اور عورت (یا حائضہ) کے گزرنے کے اثر کو واضح کرتا ہے (اگرچہ اس مسئلہ میں فقہاء کے درمیان اختلاف پایا جاتا ہے)۔",
    "english": "This Hadith states that if a worshipper does not have a Sutrah equivalent to the height of the saddle's back, the passing of a woman, a donkey, or a black dog will nullify the prayer. The black dog is specifically identified as a devil. This ruling highlights the importance of the Sutrah, the protection of Khushu', and the effect of these specific beings passing in front (though jurists hold differing views on the interpretation of this issue).",
    "english_alternative": ""
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز کو توڑنے والی چیزیں",
        "english": "Things That Nullify the Prayer (Qāṭi' As-Ṣalāh)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز ٹوٹنے کا حکم",
              "english": "The Ruling of Nullification"
            },
            "content": {
              "urdu": [
                "«يَقْطَعُ صَلَاةَ» کا مطلب ہے کہ نماز کا باطل ہو جانا، اور اسے نئے سرے سے ادا کرنا واجب ہو جاتا ہے۔",
                "یہ حکم اس صورت میں ہے جب نمازی کے سامنے مؤخرۃ الرحل کے برابر سترہ نہ ہو، جس سے سترہ کی اہمیت مزید واضح ہوتی ہے۔",
                "عورت، گدھے اور کالے کتے کے علاوہ کسی اور چیز کے گزرنے سے نماز باطل نہیں ہوتی، اگرچہ گزرنا گناہ ہے۔"
              ],
              "english": [
                "'Yaqaṭ'u ṣalāt' means the prayer is invalidated, making it obligatory to repeat the prayer from the start.",
                "This ruling applies when the worshipper lacks a Sutrah of the specified height, which underscores the extreme importance of the Sutrah.",
                "The prayer is not nullified by the passing of anything other than the woman, the donkey, and the black dog, although passing is still a sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف اور ترجیحات",
              "english": "Juristic Differences and Preferences"
            },
            "content": {
              "urdu": [
                "فقہاء (خاص کر شافعی اور حنفی) نے اس حدیث کی تاویل کی ہے کہ «يَقْطَعُ» سے مراد مکمل باطل ہونا نہیں، بلکہ خشوع میں کمی آنا ہے۔",
                "جبکہ امام احمد اور دیگر اہل ظاہر نے اس کو ظاہری حکم پر محمول کیا ہے کہ نماز باطل ہو جاتی ہے۔",
                "صحیح قول یہی ہے کہ سترہ نہ ہونے پر ان تینوں چیزوں کا گزرنا نماز کو باطل کر دیتا ہے۔"
              ],
              "english": [
                "Jurists (especially Shāfi'ī and Ḥanafī) have interpreted 'Yaqaṭ'u' not as complete nullification, but as reducing the prayer's reverence (Khushu').",
                "However, Imām Aḥmad and other literalists hold that the prayer is indeed nullified based on the apparent meaning of the Hadith.",
                "The correct view is that without a Sutrah, the passing of these three specifically mentioned items invalidates the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تین مخصوص چیزوں کی وجہ",
        "english": "The Reason Behind the Three Specific Items"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کالا کتا اور شیطان",
              "english": "The Black Dog and the Devil"
            },
            "content": {
              "urdu": [
                "کالے کتے کو شیطان قرار دیا گیا ہے، یعنی یہ شیطان کی شکل اختیار کر سکتا ہے یا شیطانی اثرات رکھتا ہے۔",
                "اس کے گزرنے سے نماز میں شیطانی وسوسے اور نماز کے ارکان میں خلل پیدا ہوتا ہے، جس سے نماز باطل ہو جاتی ہے۔",
                "دیگر رنگ کے کتے نماز کو نہیں توڑتے کیونکہ ان میں شیطانی اثر کی تخصیص نہیں ہے۔"
              ],
              "english": [
                "The black dog is specified as a devil (Shayṭān), meaning it may appear in its form or possess a demonic influence.",
                "Its passing brings satanic whispers and disrupts the prayer's pillars, leading to nullification.",
                "Dogs of other colors do not nullify the prayer because the specific demonic influence is not attributed to them."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت اور گدھا",
              "english": "Woman and Donkey"
            },
            "content": {
              "urdu": [
                "عورت کو فتنے اور مرد کے طبعی میلان کی وجہ سے اس زمرے میں رکھا گیا ہے، اور یہ حکم اس کی عظمت یا اس پر طعن نہیں ہے۔",
                "گدھا (حمار) اپنی سستی اور بدحواسی کی وجہ سے نماز میں خلل ڈالتا ہے اور اس کا گزرنا بھی نماز کے خشوع کو توڑتا ہے۔",
                "ابوداؤد اور نسائی میں 'حائضہ' کی قید اگرچہ ہے، لیکن یہ بالغ عورت کی حالت کا بیان ہے، نہ کہ مخصوص خون والی عورت کی۔"
              ],
              "english": [
                "The woman is included due to the potential for distraction and man's natural inclination, which is not a degradation but a factual statement.",
                "The donkey (Ḥimār) disrupts prayer with its restlessness and movement, thus damaging Khushu'.",
                "Although Abū Dāwūd and An-Nasā'ī mention 'menstruating woman' (Ḥā'iḍ), this refers to a post-pubescent woman, not one actually bleeding."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سترہ کا علاج اور عملی اصول",
        "english": "Sutrah as a Remedy and Practical Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سترہ کی افادیت",
              "english": "Effectiveness of the Sutrah"
            },
            "content": {
              "urdu": [
                "حدیث میں واضح ہے کہ «وَيَقِي ذَلِكَ مِثْلُ مُؤْخِرَةِ اَلرَّحْلِ» (پالان کا پچھلا حصہ اس سے بچاتا ہے)، یعنی سترہ ان چیزوں کے اثر کو زائل کر دیتا ہے۔",
                "اگر نمازی کے سامنے سترہ ہو تو ان میں سے کسی چیز کے گزرنے سے نماز باطل نہیں ہوتی۔",
                "یہ اصول مسلمانوں کو سترہ کے اہتمام کی طرف مضبوطی سے مائل کرتا ہے۔"
              ],
              "english": [
                "The Hadith clarifies: 'A Sutrah like the back of the saddle protects against that,' meaning the Sutrah neutralizes the effect of these passing objects.",
                "If the worshipper has a Sutrah, the passing of any of these three will not invalidate the prayer.",
                "This principle strongly encourages Muslims to ensure they have a Sutrah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختلافِ الفاظ اور حکم",
              "english": "Variation in Wording and Rulings"
            },
            "content": {
              "urdu": [
                "حدیث میں 'عورت' اور 'کالا کتا' کی مختلف روایات میں تخصیص سے معلوم ہوتا ہے کہ کالا کتا اور بالغہ عورت کو دیگر جانوروں پر زیادہ اہمیت حاصل ہے۔",
                "عورت، گدھے اور کالے کتے کے علاوہ کسی بھی انسان یا جانور کے گزرنے سے نماز باطل نہیں ہوتی، اگرچہ گزرنا گناہ ہے۔",
                "مسلمان کو چاہیے کہ وہ اس حدیث کے حکم پر عمل کرے اور اپنی نماز کی حفاظت کرے۔"
              ],
              "english": [
                "The variations in narrations (woman, black dog, donkey) suggest a greater significance given to the black dog and the post-pubescent woman compared to other animals.",
                "The passing of any human or animal other than these three does not invalidate the prayer, although passing remains sinful.",
                "A Muslim should adhere to the ruling of this Hadith and protect the sanctity of their prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
