{
  "hadithId": 912,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/912", "bukhar:2593", "muslim:2770"],
    "kitabId": 8,
    "inKitabBab": 6,
    "arabicBook": "كتاب النكاح",
    "babId": 69
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (2593)‏ ، ومسلم ( 2770 )‏ وهو طرف من حديث الإفك المطول الذي ترويه عائشة رضي الله عنها.‏",
    "urdu": "یہ روایت صحیح ہے۔ اسے امام بخاری (2593) اور امام مسلم (2770) نے روایت کیا ہے۔ یہ اس طویل حدیث کا حصہ ہے جو واقعہ افک کے متعلق سیدہ عائشہ سے مروی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2593) and Muslim (2770). It is a part of the long Hadith of Ifk (the slander) narrated by 'Aishah (RA)."
  },
  "importantWords": [
    {
      "arabic": "أَرَادَ",
      "english": "Intended",
      "urdu": "ارادہ کیا"
    },
    {
      "arabic": "سَفَرًا",
      "english": "Journey",
      "urdu": "سفر"
    },
    {
      "arabic": "أَقْرَعَ",
      "english": "Cast lots",
      "urdu": "قرعہ اندازی کی"
    },
    {
      "arabic": "سَهْمُهَا",
      "english": "Her share / lot",
      "urdu": "اس کا حصہ / نام"
    },
    {
      "arabic": "خَرَجَ",
      "english": "Came out",
      "urdu": "نکلا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سفر کے دوران بیویوں کے درمیان عدل و انصاف قائم کرنے کے لیے قرعہ اندازی کا طریقہ بتایا گیا ہے۔",
    "english": "This Hadith demonstrates the method of casting lots to maintain justice among wives when choosing a companion for a journey."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2593)",
      "english": "Reported by Al-Bukhari (2593)"
    },
    {
      "arabic": "رواه مسلم (2770)",
      "english": "Reported by Muslim (2770)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0uA_mH_v9o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سفر میں عدل کا طریقہ",
        "english": "Method of Justice in Travel"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرعہ اندازی کی مشروعیت",
              "english": "Legitimacy of Casting Lots"
            },
            "content": {
              "urdu": [
                "بیویوں کے درمیان کسی ایک کے انتخاب کے لیے قرعہ اندازی ایک شرعی طریقہ ہے۔",
                "اس سے کسی کی دل شکنی نہیں ہوتی کیونکہ انتخاب اللہ کی تقدیر پر چھوڑ دیا جاتا ہے۔",
                "نبی کریم ﷺ نے اس طریقے سے گھریلو تنازعات کا بہترین حل پیش فرمایا۔"
              ],
              "english": [
                "Casting lots is a Shariah-compliant method to choose among wives for travel.",
                "It prevents hurt feelings as the choice is left to divine decree and chance.",
                "The Prophet (ﷺ) provided an excellent solution to avoid domestic disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی ادائیگی",
              "english": "Fulfillment of Rights"
            },
            "content": {
              "urdu": [
                "سفر میں ایک بیوی کا ساتھ ہونا دوسریوں کی حق تلفی نہیں سمجھا جاتا۔",
                "واپسی کے بعد باریوں کی تقسیم از سرِ نو شروع کی جاتی ہے۔",
                "یہ طریقہ کار تعدد ازواج میں نظم و ضبط برقرار رکھنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "Having one wife accompany the husband is not considered a violation of others' rights.",
                "The rotation of nights is typically resumed afresh upon returning from the journey.",
                "This procedure helps maintain discipline and fairness in polygynous households."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Juristic and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترجیح سے گریز",
              "english": "Avoiding Personal Preference"
            },
            "content": {
              "urdu": [
                "آپ ﷺ اپنی پسند کے بجائے انصاف کو ترجیح دیتے تھے۔",
                "قرعہ اندازی اس بات کی ضمانت ہے کہ فیصلہ ذاتی خواہش پر مبنی نہیں ہے۔",
                "ایک منصف شوہر ہمیشہ شک و شبہات سے بچنے کی کوشش کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) prioritized absolute justice over personal preferences.",
                "Casting lots guarantees that the decision is not based on mere desire.",
                "A just husband always strives to avoid situations that create suspicion."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشگوار ازدواجی زندگی",
              "english": "Happy Marital Life"
            },
            "content": {
              "urdu": [
                "بیویوں کو یہ اطمینان رہتا تھا کہ حق سب کا برابر ہے۔",
                "اس شفافیت سے حسد اور جلن کے جذبات پیدا نہیں ہوتے تھے۔",
                "اسلامی تعلیمات گھر میں سکون اور باہمی اعتماد کو فروغ دیتی ہیں۔"
              ],
              "english": [
                "The wives remained satisfied knowing that their rights were equal.",
                "This transparency prevented feelings of envy and jealousy from arising.",
                "Islamic teachings promote peace and mutual trust within the household."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد",
        "english": "Social Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنازعات کا حل",
              "english": "Conflict Resolution"
            },
            "content": {
              "urdu": [
                "قرعہ اندازی پیچیدہ معاملات کو حل کرنے کا ایک منصفانہ ذریعہ ہے۔",
                "یہ طریقہ کار معاشرے کے دیگر شعبوں میں بھی استعمال کیا جا سکتا ہے۔",
                "اسلام نے انسانی فطرت کے مطابق حل تجویز کیے ہیں۔"
              ],
              "english": [
                "Casting lots is a fair means of resolving complex administrative issues.",
                "This methodology can be applied to other sectors of social life as well.",
                "Islam suggests practical solutions that align with human nature."
              ]
            }
          },
          {
            "title": {
              "urdu": "مرد کی ذمہ داری",
              "english": "Responsibility of the Man"
            },
            "content": {
              "urdu": [
                "گھر کا سربراہ انصاف قائم کرنے کا براہِ راست ذمہ دار ہے۔",
                "اسے چاہیے کہ وہ اپنے عمل سے کسی کو شکایت کا موقع نہ دے۔",
                "نبی ﷺ کی زندگی ہر مسلمان مرد کے لیے مکمل رہنمائی ہے۔"
              ],
              "english": [
                "The head of the household is directly responsible for establishing justice.",
                "He must act in a way that gives no one a reason for valid grievance.",
                "The life of the Prophet (ﷺ) is complete guidance for every Muslim man."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تقویٰ اور انصاف",
              "english": "Piety and Justice"
            },
            "content": {
              "urdu": [
                "انصاف کا قیام تقویٰ کے حصول کا ایک اہم ذریعہ ہے۔",
                "اللہ تعالیٰ عدل کرنے والوں کو پسند فرماتا ہے۔",
                "گھریلو معاملات میں انصاف کرنا ایمان کی پختگی کی علامت ہے۔"
              ],
              "english": [
                "Establishing justice is a vital means of achieving true piety (Taqwa).",
                "Allah Almighty loves those who act with fairness and equity.",
                "Doing justice in domestic affairs is a sign of mature faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "سنتِ نبوی پر عمل کرنے سے زندگی میں برکت آتی ہے۔",
                "مشکل فیصلوں میں سنت سے رہنمائی لینا بہترین طریقہ ہے۔",
                "مومن وہی ہے جو ہر معاملے میں اللہ اور اس کے رسول کی مانے۔"
              ],
              "english": [
                "Following the Prophetic Sunnah brings blessings into one's life.",
                "Seeking guidance from the Sunnah for tough decisions is the best path.",
                "A true believer is one who obeys Allah and His Messenger in every matter."
              ]
            }
          }
        ]
      }
    }
  ]
}