{
  "hadithId": 274,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["urn:1265"],
    "kitabId": 2,
    "inKitabBab": 8,
    "arabicBook": "Bulugh al-Maram",
    "babId": 18
  },
  
  "takhreej": {
    "arabic": "مرسل حسن الإسناد. رواه أبو داود في 'المراسيل' (78). وضعيف (الموصول): رواه أحمد (4/151) والترمذي (578) من طريق ابن لهيعة عن مشرح بن هاعان عن عقبة. قال الترمذي: 'ليس إسناده بالقوي'. وعلته تفرد ابن لهيعة ومشرح بن هاعان.",
    "urdu": "مرسل حسن الاسناد۔ اسے ابوداؤد نے 'المراسیل' (78) میں روایت کیا ہے۔ اور موصول روایت ضعیف ہے جسے احمد (4/151) اور ترمذی (578) نے ابن لہیعہ کے طریق سے مشرح بن ہاعان سے، انہوں نے عقبہ سے روایت کیا ہے۔ ترمذی نے کہا: 'اس کی سند قوی نہیں ہے'۔ اس کی علت ابن لہیعہ اور مشرح بن ہاعان کا تفرد ہے۔",
    "english": "Mursal with a Hasan chain. Reported by Abu Dawud in 'Al-Marasil' (78). The connected (Mawsul) version is Weak; reported by Ahmad (4/151) and At-Tirmidhi (578) via Ibn Lahi'ah from Mishrah bin Ha'an from Uqbah. At-Tirmidhi said: 'Its chain is not strong.' The defect lies in the solitariness of Ibn Lahi'ah and Mishrah bin Ha'an."
  },
  "importantWords": [
    {
      "arabic": "فضلت",
      "english": "Favored / Preferred",
      "urdu": "فضیلت دی گئی"
    },
    {
      "arabic": "سجدتين",
      "english": "Two prostrations",
      "urdu": "دو سجدے"
    },
    {
      "arabic": "لا يقرأها",
      "english": "Should not recite it",
      "urdu": "اسے نہ پڑھے"
    },
    {
      "arabic": "مرسل",
      "english": "Mursal (Hurried/Skipped Link)",
      "urdu": "مرسل"
    },
    {
      "arabic": "موصولا",
      "english": "Connected (Chain)",
      "urdu": "موصول (متصل)"
    },
    {
      "arabic": "سنده ضعيف",
      "english": "Its chain is weak",
      "urdu": "اس کی سند ضعیف ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سورۃ الحج کی فضیلت بیان کرتی ہے کہ اس میں دو سجدے ہیں۔ اگرچہ 'نہ پڑھنے' والی وعید ضعیف ہے، مگر دو سجدوں کا ہونا دیگر شواہد سے ثابت اور راجح ہے۔",
    "english": "This Hadith highlights the virtue of Surah Al-Hajj containing two prostrations. Although the warning regarding 'not reciting it' is weak, the existence of two prostrations is established and preferred."
  },
  "references": [
    {
      "arabic": "رواه أبو داود في المراسيل (78)",
      "english": "Reported by Abu Dawud in Al-Marasil (78)"
    },
    {
      "arabic": "رواه الترمذي (578)",
      "english": "Reported by At-Tirmidhi (578)"
    },
    {
      "arabic": "رواه أحمد (4 / 151)",
      "english": "Reported by Ahmad (4/151)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عقبة بن عامر",
        "english": "Uqbah bin Amir"
      },
      "slug": "uqbah-bin-amir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=EXAMPLE_ID_SURAH_HAJJ",
  "grade": {
    "arabic": "إسناده ضعيف (الموصول)، والمرسل حسن",
    "english": "Weak Chain (Connected), Hasan (Mursal)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سورۃ الحج کی فضیلت",
              "english": "Virtue of Surah Al-Hajj"
            },
            "content": {
              "urdu": [
                "قرآن مجید میں سورۃ الحج واحد سورۃ ہے جس میں دو سجدے ہیں۔",
                "یہ اس سورۃ کی خاص فضیلت اور شان ہے۔",
                "خالد بن معدان (تابعی) سے یہ بات صحیح سند کے ساتھ مرسلاً ثابت ہے۔"
              ],
              "english": [
                "Surah Al-Hajj is the only Surah in the Quran containing two prostrations.",
                "This is a special virtue and honor of this Surah.",
                "This fact is established as Mursal with a sound chain from Khalid bin Ma'dan (Tabi'i)."
              ]
            }
          },
          {
            "title": {
              "urdu": "وعید کی حقیقت",
              "english": "Reality of the Warning"
            },
            "content": {
              "urdu": [
                "حدیث کا وہ حصہ جس میں ہے کہ 'سجدہ نہ کرے تو پڑھے بھی نہ'، ضعیف ہے۔",
                "یہ الفاظ ابن لہیعہ کے تفرد کی وجہ سے غیر محفوظ ہیں۔",
                "لہذا تلاوت کرنا بہرحال ثواب ہے، چاہے سجدہ کیا جائے یا نہیں۔"
              ],
              "english": [
                "The part of the Hadith stating 'whoever does not prostrate should not recite' is weak.",
                "These words are not preserved due to the solitariness of Ibn Lahi'ah.",
                "Therefore, reciting it is rewarding in any case, whether one prostrates or not."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل",
        "english": "Juristic Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دوسرے سجدے کا حکم",
              "english": "Ruling on Second Prostration"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک سورۃ الحج میں دو سجدے تلاوت ہیں۔",
                "امام ابو حنیفہ اور امام مالک کے نزدیک صرف پہلا سجدہ تلاوت ہے، دوسرا نماز کا ہے۔",
                "راجح مسلک یہ ہے کہ دونوں مقامات پر سجدہ تلاوت مشروع ہے۔"
              ],
              "english": [
                "According to Imam Shafi'i and Imam Ahmad, there are two Sujuds in Surah Al-Hajj.",
                "According to Imam Abu Hanifa and Imam Malik, only the first is Sujud at-Tilawah.",
                "The preferred view is that Sujud at-Tilawah is prescribed in both places."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختلاف کی وجہ",
              "english": "Reason for Disagreement"
            },
            "content": {
              "urdu": [
                "دوسری آیت (رکوع کے آخر میں) میں لفظ 'ارکعوا واسجدوا' آیا ہے۔",
                "بعض فقہاء اسے نماز کے رکوع و سجود پر محمول کرتے ہیں۔",
                "تاہم، حدیثِ باب اور آثار صحابہ دوسرے سجدے کی تائید کرتے ہیں۔"
              ],
              "english": [
                "The second verse (at end of Ruku) contains the command 'Bow and Prostrate'.",
                "Some jurists interpret this as the Ruku and Sujud of obligatory prayer.",
                "However, the Hadith of the chapter and Athar of Companions support the second Sujud."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصول حدیث",
        "english": "Principles of Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرسل اور موصول",
              "english": "Mursal and Mawsul"
            },
            "content": {
              "urdu": [
                "اس روایت میں مرسل (تابعی کا قول) کی سند حسن ہے۔",
                "موصول (نبی ﷺ تک متصل) کی سند ضعیف ہے۔",
                "محدثین اکثر ایسی صورت میں مرسل کو زیادہ صحیح مانتے ہیں۔"
              ],
              "english": [
                "The chain of the Mursal (Tabi'i's statement) in this narration is Hasan.",
                "The chain of the Mawsul (connected to Prophet) is Weak.",
                "Muhaddithin often consider the Mursal more correct in such cases."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضعیف پر عمل",
              "english": "Acting on Weak Hadith"
            },
            "content": {
              "urdu": [
                "فضائل اعمال میں ضعیف حدیث بھی قابل قبول ہوتی ہے۔",
                "چونکہ دیگر شواہد موجود ہیں، اس لیے دو سجدوں پر عمل کرنا بہتر ہے۔",
                "وعید والے حصے کو چھوڑ کر فضیلت والے حصے کو لیا جاتا ہے۔"
              ],
              "english": [
                "Weak Hadith is acceptable in matters of virtues (Fada'il).",
                "Since there are other supporting evidences, practicing two Sujuds is better.",
                "The virtue part is accepted while the warning part is disregarded."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن کا حق",
              "english": "Right of the Quran"
            },
            "content": {
              "urdu": [
                "جب ہم ایسی آیات پڑھیں تو سجدہ کر کے ان کا حق ادا کریں۔",
                "سجدہ نہ کرنے سے گناہ نہیں ہوتا مگر ایک بڑی نیکی چھوٹ جاتی ہے۔",
                "سستی کی وجہ سے سجدہ چھوڑنا محرومی کی بات ہے۔"
              ],
              "english": [
                "When we recite such verses, we should fulfill their right by prostrating.",
                "Not prostrating is not a sin, but one misses a great virtue.",
                "Leaving prostration out of laziness is a deprivation."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کا قرب",
              "english": "Nearness to Allah"
            },
            "content": {
              "urdu": [
                "بندہ سجدے کی حالت میں اللہ کے سب سے زیادہ قریب ہوتا ہے۔",
                "سجدہ تلاوت دعا کی قبولیت کا بہترین وقت ہے۔",
                "اپنی تلاوت کو سجدوں سے مزین کریں۔"
              ],
              "english": [
                "A servant is closest to Allah while in prostration.",
                "Sujud at-Tilawah is an excellent time for acceptance of Dua.",
                "Adorn your recitation with prostrations."
              ]
            }
          }
        ]
      }
    }
  ]
}
