{
  "hadithId": 95,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 95"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": " صحيح.  رواه البخاري (291) ، ومسلم (348) . وهذا الحديث هو الناسخ لحديث \"الماء من الماء\".",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (291) اور مسلم (348) نے روایت کیا ہے۔ یہ حدیث پچھلی حدیث \"الماء من الماء\" (پانی کا استعمال خروج پانی سے ہے) کو منسوخ کرنے والی (ناسخ) ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (291) and Muslim (348). This Hadith is the abrogator (Nasikh) of the Hadith, 'Water is from water'."
  },
  "importantWords": [
    {
      "arabic": "جَلَسَ",
      "english": "He sat/positioned himself",
      "urdu": "بیٹھے"
    },
    {
      "arabic": "شُعَبِهَا اَلْأَرْبَعِ",
      "english": "Her four parts/branches",
      "urdu": "چار شاخیں"
    },
    {
      "arabic": "جَهَدَهَا",
      "english": "He exerted himself with her (penetration/intimacy)",
      "urdu": "اپنی کوشش کر لے"
    },
    {
      "arabic": "وَجَبَ اَلْغُسْلُ",
      "english": "Ghusl became obligatory",
      "urdu": "غسل واجب ہو گیا"
    },
    {
      "arabic": "أَنْزَل",
      "english": "He discharged semen (ejaculated)",
      "urdu": "انزال ہوا"
    },
    {
      "arabic": "وُجُوب",
      "english": "Obligation/necessity",
      "urdu": "وجوب"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْه",
      "english": "Agreed upon (by Bukhari & Muslim)",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "ناسخ",
      "english": "Abrogator",
      "urdu": "منسوخ کرنے والا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غسل کے واجب ہونے کا حتمی شرعی حکم واضح کرتی ہے کہ محض جنسی ملاپ میں دخول (اندام نہانی میں عضو مخصوص کا داخل ہونا)، خواہ انزال ہو یا نہ ہو، غسل کو واجب کر دیتا ہے۔",
    "english": "This Hadith clarifies the conclusive legal ruling for the obligation of Ghusl: mere penetration during sexual intercourse, regardless of whether ejaculation occurs or not, necessitates the major ritual bath."
  },
  "references": [
    {
      "arabic": "رواه البخاري (291)",
      "english": "Reported by Al-Bukhari (291)"
    },
    {
      "arabic": "رواه مسلم (348)",
      "english": "Reported by Muslim (348)"
    },
    {
      "arabic": "مسلم نے اضافہ کیا: وإن لم يُنْزِل",
      "english": "Muslim added: Even if he does not ejaculate"
    }
  ],
  "narrators": [
    {
      "id": 9501,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وجوب غسل کا حتمی حکم",
        "english": "The Conclusive Ruling for Ghusl Obligation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار شاخوں کے درمیان بیٹھنا",
              "english": "Sitting Between the Four Parts"
            },
            "content": {
              "urdu": [
                "حدیث میں 'چار شاخوں کے درمیان بیٹھنا' سے مراد بیوی کے ہاتھ اور پاؤں کے درمیان جماع کے لیے بیٹھنا ہے۔",
                "لفظ 'جہدھا' (اپنی کوشش کر لے) سے مراد جنسی ملاپ میں عضو تناسل کا اندام نہانی میں دخول ہے۔",
                "غسل صرف دخول کی شرط کے پورا ہوتے ہی واجب ہو جاتا ہے، قطع نظر اس کے کہ انزال ہوا ہو یا نہیں۔"
              ],
              "english": [
                "The phrase 'sitting between her four parts' refers to positioning oneself for intercourse between the wife's hands and legs.",
                "The term 'exerted himself with her' implies the act of penetration of the penis into the vagina.",
                "Ghusl becomes obligatory immediately upon the fulfillment of the penetration condition, regardless of whether ejaculation occurs or not."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث ناسخ کا اثر",
              "english": "Effect of the Abrogating Hadith"
            },
            "content": {
              "urdu": [
                "یہ حدیث (غسل دخول سے واجب ہے) پچھلی حدیث (غسل صرف انزال سے واجب ہے) کو منسوخ کرتی ہے، جسے 'ناسخ' کہا جاتا ہے۔",
                "نبی اکرم ﷺ نے یہ آخری حکم اس لیے دیا تاکہ طہارت مکمل ہو اور معاملات میں کوئی شک باقی نہ رہے۔",
                "یہ حکم مسلمانوں کے لیے طہارت کے اصول کو دخول کے ذریعے ہونے والی تمام مباشرت پر عام کر دیتا ہے۔"
              ],
              "english": [
                "This Hadith (Ghusl is required by penetration) abrogates the previous ruling (Ghusl is required only by semen), and is therefore the 'Nasikh'.",
                "The Prophet ﷺ gave this final ruling to ensure complete purity and remove any doubt in the matter.",
                "This command generalizes the principle of purity for Muslims to cover all forms of intercourse that involve penetration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور شرعی دلیل",
        "english": "Juristic and Legal Proof"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجماع کا قیام",
              "english": "Establishment of Consensus (Ijma')"
            },
            "content": {
              "urdu": [
                "یہ حدیث صحیحین (بخاری و مسلم) میں متفق علیہ ہے اور جمہور فقہاء کی دلیل بناتی ہے۔",
                "چاروں مذاہب فقہاء (حنفی، مالکی، شافعی، حنبلی) اس بات پر متفق ہیں کہ دخول سے غسل واجب ہو جاتا ہے۔",
                "یہ حکم طہارت کی بلند ترین معیار کو قائم کرتا ہے جو اسلامی شریعت کا امتیازی وصف ہے۔"
              ],
              "english": [
                "This Hadith is 'Muttafaqun 'alayhi' (agreed upon by Bukhari and Muslim) and serves as the proof for the majority of jurists.",
                "All four schools of jurisprudence (Hanafi, Maliki, Shafi'i, Hanbali) agree that Ghusl becomes obligatory upon penetration.",
                "This ruling establishes the highest standard of purity, which is a distinguishing feature of Islamic Shari'ah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نجاست حکمی",
              "english": "Hukmi (Ritual) Impurity",
              "content": {
                "urdu": [
                  "غسل کا وجوب دخول کے بعد نجاست حکمی (Ritual Impurity) کی وجہ سے ہوتا ہے، نہ کہ صرف نجاست حسی (Physical Impurity) کی وجہ سے۔",
                  "جنابت ایک ایسی حالت ہے جو ظاہری نجاست نہ ہونے کے باوجود غسل کو لازم کرتی ہے۔",
                  "یہ حکم جسمانی عمل اور روحانی حالت کے درمیان تعلق کو واضح کرتا ہے، جو اسلام میں طہارت کا فلسفہ ہے۔"
                ],
                "english": [
                  "The obligation of Ghusl after penetration is due to **Hukmi (Ritual) Impurity** (Janabah), not just Hisi (Physical Impurity).",
                  "Janabah is a state that necessitates Ghusl even without visible physical filth.",
                  "This ruling clarifies the connection between a physical act and the spiritual state, which is the philosophy of purity in Islam."
                ]
              }
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غسل سے متعلق اہم نکات",
        "english": "Important Points Regarding Ghusl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت پر بھی غسل کا وجوب",
              "english": "Obligation of Ghusl on the Woman too"
            },
            "content": {
              "urdu": [
                "یہ حکم مرد اور عورت دونوں پر یکساں لاگو ہوتا ہے، یعنی مرد کے دخول سے عورت پر بھی غسل واجب ہو جاتا ہے۔",
                "عورت کے لیے انزال ہونے کی صورت میں تو غسل واجب ہوتا ہی ہے، لیکن صرف دخول سے بھی واجب ہے۔",
                "دخول کے بعد غسل کرنے میں مرد اور عورت کی صفائی اور صحت دونوں کی بہتری شامل ہے۔"
              ],
              "english": [
                "This ruling applies equally to both the man and the woman; Ghusl becomes obligatory for the woman upon the man's penetration.",
                "While Ghusl is required for a woman upon her own emission/orgasm, it is also obligatory solely upon penetration.",
                "Bathing after penetration involves the cleanliness and health benefits for both the husband and the wife."
              ]
            }
          },
          {
            "title": {
              "urdu": "دخول کی حد",
              "english": "The Boundary of Penetration"
            },
            "content": {
              "urdu": [
                "دخول سے مراد مرد کے عضو مخصوص کا حشفہ (سر) کا عورت کی شرمگاہ میں داخل ہو جانا ہے۔",
                "اگر دخول اس حد تک نہ ہو تو غسل واجب نہیں ہوتا، اگرچہ شہوت ہو۔",
                "یہ حد نماز کی صحت اور طہارت کے لیے ضروری ہے اور فقہاء نے اس کی وضاحت کی ہے۔"
              ],
              "english": [
                "Penetration means the entry of the head (hashfah) of the male organ into the female private part.",
                "If penetration does not reach this threshold, Ghusl is not mandatory, even if sexual arousal occurs.",
                "This boundary is essential for the validity of prayer and purity, and jurists have clarified its definition."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و عملی سبق",
        "english": "Ethical and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیا اور پرہیزگاری",
              "english": "Modesty and Piety"
            },
            "content": {
              "urdu": [
                "غسل کا فوری واجب ہونا اس بات کا احساس دلاتا ہے کہ عبادت کے لیے ہمیں کتنی کامل طہارت چاہیے۔",
                "یہ حکم حیا اور پاکیزگی کو یقینی بناتا ہے، جو اسلامی طرز زندگی کا لازمی جز ہیں۔",
                "جنابت کے بعد جلد غسل کرنا ایمان کی نشانی اور اللہ کے سامنے صاف ہونے کا عمل ہے۔"
              ],
              "english": [
                "The immediate obligation of Ghusl reminds us of the level of complete purity required for worship.",
                "This ruling ensures modesty and purity, which are inseparable components of the Islamic way of life.",
                "Performing Ghusl promptly after Janabah is a sign of faith and an act of spiritual cleansing before Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت کی آسانی",
              "english": "Ease in Purification"
            },
            "content": {
              "urdu": [
                "اسلام میں غسل کے وجوب کو واضح اور دو ٹوک طریقے سے بیان کیا گیا ہے تاکہ کسی کو شبہ نہ ہو۔",
                "وضاحت کا یہ اصول مسلمانوں کے لیے آسانی پیدا کرتا ہے اور انہیں غیر ضروری وسوسوں سے بچاتا ہے۔",
                "طہارت کے معاملات میں شک سے بچنے کے لیے ہمیشہ آسان اور متفق علیہ حکم پر عمل کرنا چاہیے۔"
              ],
              "english": [
                "The obligation of Ghusl is stated clearly and unequivocally in Islam to leave no room for doubt.",
                "This clarity facilitates ease for Muslims and protects them from unnecessary obsessive doubts (Waswas).",
                "In matters of purity, one should always adhere to the clear and agreed-upon ruling to avoid confusion."
              ]
            }
          }
        ]
      }
    }
  ]
}
