{
  "hadithId": 158,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["1:3:15"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه النسائي في \"عمل اليوم والليلة \" (67و68و69)‏ ، وابن خزيمة في \"صحيحه\" (425و426و427)‏ .‏ ورواه الترمذي (3594)‏ وذاد فيه : \"فماذا نقول يا رسول الله ؟ قال : سلوا الله العافية في الدنيا والآخرة \".‏ قلت : وهي زيادة ضعيفة تفرد بها يحيى بن يمان ، وفي حفظه ضعف ، وفي \"الأصل\" زيادة تفصيل في طرق الحديث وألفاظه.‏",
    "urdu": "صحیح۔ اسے نسائی نے ”عمل الیوم واللیلہ“ (67، 68، 69) اور ابن خزیمہ نے ”صحیح ابن خزیمہ“ (425، 426، 427) میں روایت کیا ہے۔ اور ترمذی (3594) نے اسے روایت کیا اور اس میں اضافہ کیا: ”تو ہم کیا کہیں یا رسول اللہ؟ آپ نے فرمایا: اللہ سے دنیا اور آخرت کی عافیت مانگو۔“ میں (حافظ ابن حجر) کہتا ہوں: یہ اضافہ ضعیف ہے کیونکہ اس کے روایت کرنے میں یحییٰ بن یمان منفرد ہیں، اور ان کے حافظے میں ضعف ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by An-Nasā'ī in 'Amal Al-Yawm wal-Laylah' (67, 68, 69) and Ibn Khuzaymah in his 'Ṣaḥīḥ' (425, 426, 427). At-Tirmidhī (3594) also reported it and added: 'What should we say, O Messenger of Allah? He said: Ask Allah for well-being ('Āfiyah) in this world and the Hereafter.' I say: This addition is weak (Ḍa'īf) as Yaḥyā ibn Yamān is the only one who narrated it, and he had a weak memory.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَا يُرَدُّ اَلدُّعَاءُ",
      "english": "The supplication is not rejected",
      "urdu": "دعا مسترد نہیں کی جاتی"
    },
    {
      "arabic": "بَيْنَ اَلْأَذَانِ وَالْإِقَامَةِ",
      "english": "Between the Adhān and the Iqāmah",
      "urdu": "اذان اور اقامت کے درمیان"
    },
    {
      "arabic": "اَلْعَافِيَة",
      "english": "Well-being/Safety",
      "urdu": "عافیت"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "He graded it as authentic",
      "urdu": "اسے صحیح قرار دیا"
    },
    {
      "arabic": "اَلدُّنْيَا وَالْآخِرَةِ",
      "english": "The world and the Hereafter",
      "urdu": "دنیا اور آخرت"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اذان اور اقامت کے درمیان کے وقت کی عظیم فضیلت بیان کرتی ہے کہ اس دوران کی جانے والی دعا اللہ تعالیٰ کے ہاں مقبول ہوتی ہے اور رد نہیں کی جاتی۔ یہ اس وقت کو دعا، استغفار اور اللہ سے اپنی حاجات طلب کرنے کے لیے ایک قیمتی موقع بناتی ہے۔",
    "english": "This Hadith highlights the great virtue of the time between the Adhān and the Iqāmah, stating that any supplication made during this period is accepted by Allah and is not rejected. This establishes it as a precious opportunity for remembrance, seeking forgiveness, and asking Allah for one's needs."
  },
  "references": [
    {
      "arabic": "رواه النسائي في عمل اليوم والليلة (67)",
      "english": "Reported by An-Nasā'ī in 'Amal Al-Yawm wal-Laylah' (67)"
    },
    {
      "arabic": "صححه ابن خزيمة في صحيحه (425)",
      "english": "Authenticated by Ibn Khuzaymah in his Ṣaḥīḥ (425)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Mālik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کی قبولیت کا وقت",
        "english": "The Time for Acceptance of Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان و اقامت کے درمیان کی فضیلت",
              "english": "Virtue Between Adhān and Iqāmah"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے واضح فرمایا کہ اذان اور اقامت کے درمیان دعا کو خاص اہمیت حاصل ہے اور وہ مسترد نہیں ہوتی۔",
                "یہ وقت ایک ایسا درمیانی دور ہے جس میں لوگ اللہ کی طرف متوجہ ہو چکے ہوتے ہیں اور نماز کے لیے تیار ہوتے ہیں۔",
                "مسلمانوں کو چاہیے کہ وہ اس قیمتی وقت کو غنیمت سمجھیں اور اپنی دینی و دنیوی حاجات طلب کریں۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that the supplication made between the Adhān and Iqāmah holds special significance and is not rejected.",
                "This period is an interim time when people are already focused on Allah and preparing for prayer.",
                "Muslims should regard this precious time as an opportunity and ask for their spiritual and worldly needs."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبولیت کی حکمت",
              "english": "The Wisdom of Acceptance"
            },
            "content": {
              "urdu": [
                "اس وقت دعا کی قبولیت کی ایک حکمت یہ ہے کہ لوگ اذان کا جواب دے کر اللہ کی اطاعت کا اقرار کر چکے ہوتے ہیں۔",
                "اذان اور اقامت کے درمیان کا سکون اور انتظار دل میں خشوع اور تضرع (عاجزی) پیدا کرتا ہے۔",
                "یہ وہ وقت ہوتا ہے جب شیطان کا اثر زائل ہوتا ہے اور دل اللہ کی طرف زیادہ مائل ہوتا ہے۔"
              ],
              "english": [
                "One reason for the acceptance of Du'ā' at this time is that people have just affirmed their obedience to Allah by responding to the Adhān.",
                "The tranquility and anticipation between the Adhān and Iqāmah foster reverence (Khushu') and humility in the heart.",
                "This is a time when the influence of Satan diminishes, and the heart is more inclined toward Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ترغیب اور مسنون عمل",
        "english": "Encouragement and Recommended Practice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا میں افضل الفاظ",
              "english": "Preferred Wording in Supplication"
            },
            "content": {
              "urdu": [
                "اگرچہ ترمذی کی روایت میں 'اللہ سے عافیت مانگنے' کا اضافہ ضعیف ہے، لیکن یہ دعا بذاتِ خود بہت جامع اور افضل ہے۔",
                "عافیت مانگنا دین و دنیا کے ہر شر سے سلامتی کا جامع مطلب رکھتا ہے، اور نبی ﷺ نے اسے پسند فرمایا ہے۔",
                "اس وقت میں انسان کو اپنے لیے، اپنے والدین اور تمام مسلمانوں کے لیے عافیت کی دعا مانگنی چاہیے۔"
              ],
              "english": [
                "Although the addition in At-Tirmidhī's narration to 'ask Allah for well-being' is weak, this Du'ā' itself is comprehensive and virtuous.",
                "Asking for 'Āfiyah (well-being) comprehensively covers safety from all evil in religion and the world, and the Prophet (ﷺ) encouraged it.",
                "During this time, one should pray for well-being for oneself, one's parents, and all Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "فضیلت کا حصول",
              "english": "Attaining the Virtue"
            },
            "content": {
              "urdu": [
                "اذان اور اقامت کے درمیانی وقفے میں نوافل پڑھنے کی بجائے دعا میں مشغول ہونا زیادہ افضل ہے۔",
                "فقہاء نے اس وقت میں دعا کی فضیلت کے پیش نظر نوافل پڑھنے سے منع کیا ہے (سوائے تحیۃ المسجد کے)۔",
                "مسلمانوں کو اذان کے فوراً بعد درود اور مسنون دعا پڑھنے کے بعد اپنی حاجتیں طلب کرنی چاہییں۔"
              ],
              "english": [
                "Engaging in supplication during the pause between Adhān and Iqāmah is more virtuous than performing voluntary prayers.",
                "Jurists discouraged voluntary prayers during this time (except Tahiyyat Al-Masjid) due to the greater virtue of Du'ā'.",
                "Muslims should recite the Ṣalāh 'ala an-Nabī (peace and blessings) and the prescribed Du'ā' immediately after the Adhān, and then proceed with their personal requests."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اہمیت",
        "english": "Significance in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی اہمیت کا احساس",
              "english": "Sense of Time's Importance"
            },
            "content": {
              "urdu": [
                "یہ حدیث زندگی میں ہر وقفے کی قدر اور وقت کے صحیح استعمال کا شعور پیدا کرتی ہے۔",
                "نمازی کو چاہیے کہ وہ اذان کے بعد مسجد میں پہنچ کر فوراً دعا میں مشغول ہو جائے۔",
                "دنیاوی باتوں میں مشغول ہونے کے بجائے، اس وقت کو اللہ کی طرف مکمل توجہ کے لیے استعمال کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith fosters an awareness of the value of every interval and the correct utilization of time in life.",
                "The worshipper should reach the mosque immediately after the Adhān and engage in supplication.",
                "Instead of occupying oneself with worldly talk, this time should be used for full devotion to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسنون طریقہ",
              "english": "The Recommended Procedure"
            },
            "content": {
              "urdu": [
                "اذان کے جواب کے بعد کی فضیلتیں مکمل ہو جانے پر، جماعت کے آغاز کا انتظار دعا میں مشغول ہو کر کرنا چاہیے۔",
                "اقامت کے وقت دعا کو ختم کر کے نماز کے لیے تیار ہو جانا، اس وقت کا صحیح طریقہ عمل ہے۔",
                "مسلمان کو چاہیے کہ وہ اس حدیث پر عمل کر کے دعا کی قبولیت کے اس خاص موقع سے فائدہ اٹھائے۔"
              ],
              "english": [
                "After completing the virtuous acts of responding to the Adhān, the wait for the congregation should be spent in continuous supplication.",
                "The correct practice for this period is to conclude the Du'ā' when the Iqāmah begins and prepare for the prayer.",
                "A Muslim should follow this Hadith and benefit from this special opportunity for the acceptance of Du'ā'."
              ]
            }
          }
        ]
      }
    }
  ]
}
