{
  "hadithId": 598,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/20"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحج",
    "babId": 39
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1409). وهو عمدة في منع عقد النكاح حال الإحرام.",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح (1409) میں روایت کیا ہے۔ یہ حدیث حالتِ احرام میں نکاح کے عقد اور پیغامِ نکاح کی ممانعت پر بنیادی دلیل ہے۔",
    "english": "Sahih. Reported by Muslim (1409). It is a fundamental evidence regarding the prohibition of marriage contracts and proposals while in the state of Ihram."
  },
  "importantWords": [
    {
      "arabic": "لَا يَنْكِحُ",
      "english": "Shall not marry",
      "urdu": "نکاح نہ کرے"
    },
    {
      "arabic": "اَلْمُحْرِمُ",
      "english": "One in Ihram",
      "urdu": "احرام والا"
    },
    {
      "arabic": "يُنْكِحُ",
      "english": "Give in marriage",
      "urdu": "نکاح نہ کروائے"
    },
    {
      "arabic": "يَخْطُبُ",
      "english": "Propose marriage",
      "urdu": "منگنی / پیغام نہ دے"
    },
    {
      "arabic": "عَقْد",
      "english": "Contract",
      "urdu": "معاہدہ / نکاح"
    }
  ],
  "summary": {
    "urdu": "احرام کی حالت میں انسان کے لیے اپنا نکاح کرنا، کسی دوسرے کا نکاح پڑھانا یا منگنی کا پیغام دینا شرعاً ممنوع ہے۔",
    "english": "While in the state of Ihram, it is legally prohibited for an individual to get married, perform a marriage ceremony for others, or propose for marriage."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1409)",
      "english": "Sahih Muslim (1409)"
    },
    {
      "arabic": "سنن الترمذي (840)",
      "english": "Sunan at-Tirmidhi (840)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عثمان بن عفان",
        "english": "Uthman bin Affan"
      },
      "slug": "uthman-bin-affan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0f5u4L8Nl8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حالتِ احرام میں نکاح کی ممانعت",
        "english": "Prohibition of Marriage in Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کے عقد کا حکم",
              "english": "Ruling on Marriage Contract"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک احرام کی حالت میں نکاح کا عقد باطل ہے۔",
                "اگر کوئی احرام میں نکاح کر لے تو وہ شرعاً منعقد نہیں ہوگا۔",
                "نبی ﷺ نے اس سے سختی سے منع فرمایا تاکہ عبادت کی یکسوئی رہے۔"
              ],
              "english": [
                "According to the majority, a marriage contract in Ihram is void.",
                "If someone marries while in Ihram, the contract is legally invalid.",
                "The Prophet (ﷺ) strictly forbade it to ensure devotion to worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "ولی بننے کی ممانعت",
              "english": "Prohibition of Acting as Guardian"
            },
            "content": {
              "urdu": [
                "معتکف یا محرم کسی دوسرے کا نکاح (بطور ولی یا وکیل) نہیں کروا سکتا۔",
                "لفظ 'لا ینکح' میں اپنی شادی اور دوسروں کی شادی کروانا دونوں شامل ہیں۔",
                "یہ پابندی مرد اور عورت دونوں محرموں کے لیے یکساں لاگو ہوتی ہے۔"
              ],
              "english": [
                "A person in Ihram cannot perform marriage for others as a guardian.",
                "The phrase 'shall not give in marriage' covers all roles of proxy.",
                "This restriction applies equally to both male and female Muhrims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منگنی اور پیغامِ نکاح",
        "english": "Engagement and Proposals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیغام دینے کی ممانعت",
              "english": "Prohibition of Proposing"
            },
            "content": {
              "urdu": [
                "احرام کے دوران منگنی کا پیغام بھیجنا بھی منع قرار دیا گیا ہے۔",
                "اس کا مقصد یہ ہے کہ بندہ تمام دنیاوی علائق سے کٹ جائے۔",
                "شریعت حج کے دوران شہوانی جذبات کے ابھار سے بچانا چاہتی ہے۔"
              ],
              "english": [
                "Sending a marriage proposal during Ihram is also forbidden.",
                "The goal is for the servant to detach from all worldly ties.",
                "Sharia aims to prevent sexual inclinations during the pilgrimage."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ شرعیہ",
              "english": "Sharia Wisdom"
            },
            "content": {
              "urdu": [
                "حج اور عمرہ عاجزی اور توبہ کے خصوصی ایام ہوتے ہیں۔",
                "نکاح جیسی سرگرمی ذہنی یکسوئی کو متاثر کر سکتی ہے۔",
                "یہ پابندی حرم اور شعائرِ اللہ کی تعظیم کا حصہ ہے۔"
              ],
              "english": [
                "Hajj and Umrah are specific days for humility and repentance.",
                "Activities like marriage contracts can disturb mental focus.",
                "This restriction is part of venerating the Haram and Allah's rites."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کا اختلاف",
        "english": "Differences in Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام ابوحنیفہ کا موقف",
              "english": "Imam Abu Hanifa's View"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک احرام میں نکاح کا عقد جائز ہے مگر رخصتی منع ہے۔",
                "وہ اس حدیث میں ممانعت کو صرف جماع یا رخصتی پر محمول کرتے ہیں۔",
                "تاہم، جمہور (شافعی، مالکی، حنبلی) اس حدیث کے ظاہری الفاظ پر عمل کرتے ہیں۔"
              ],
              "english": [
                "Hanafis allow the contract but forbid consummation during Ihram.",
                "They interpret the prohibition as applying to sexual intimacy only.",
                "However, the majority follow the literal meaning of this Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابن عباس کی روایت اور تطبیق",
              "english": "Ibn Abbas's Narration and Reconciliation"
            },
            "content": {
              "urdu": [
                "ایک روایت میں ہے کہ نبی ﷺ نے میمونہ سے احرام میں نکاح کیا۔",
                "سیدہ میمونہ نے خود گواہی دی کہ آپ ﷺ اس وقت احرام میں نہیں تھے۔",
                "اس لیے عثمان بن عفان کی یہ روایت زیادہ راجح اور محفوظ مانی جاتی ہے۔"
              ],
              "english": [
                "One report suggests the Prophet married Maymunah while in Ihram.",
                "Maymunah (RA) herself testified that he was not in Ihram then.",
                "Therefore, this narration from Uthman is more authentic and preserved."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کی حرمت کا پاس",
              "english": "Respecting the Sanctity of Worship"
            },
            "content": {
              "urdu": [
                "احرام کی حالت میں بہت سی حلال چیزیں بھی عارضی طور پر حرام ہو جاتی ہیں۔",
                "یہ اللہ کے حکم کے سامنے سر تسلیم خم کرنے کی بہترین مشق ہے۔",
                "مومن کو چاہیے کہ وہ اپنی خواہشات کو شریعت کے تابع رکھے۔"
              ],
              "english": [
                "In Ihram, many otherwise halal things become temporarily haram.",
                "This is an excellent exercise in surrendering to Allah's will.",
                "A believer must keep their desires subordinate to the Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی نظم و ضبط",
              "english": "Social Discipline"
            },
            "content": {
              "urdu": [
                "حج کے دوران صرف اللہ اور آخرت کی فکر ہونی چاہیے۔",
                "نکاح کے معاملات کو حج سے پہلے یا بعد کے لیے چھوڑ دینا چاہیے۔",
                "یہ حدیث ہمیں ترجیحات کے درست تعین کی تعلیم دیتی ہے۔"
              ],
              "english": [
                "During Hajj, focus should be solely on Allah and the Hereafter.",
                "Matters of marriage should be left for before or after Hajj.",
                "This Hadith teaches us how to properly set our priorities."
              ]
            }
          }
        ]
      }
    }
  ]
}