{
  "hadithId": 1180,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/13/10"],
    "kitabId": 13,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 96
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6608)، ومسلم (1639). وفي رواية لمسلم: (وإنما يستخرج به من الشحيح).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (6608) اور امام مسلم (1639) نے روایت کیا ہے۔ اس کے الفاظ واضح طور پر نذر کی کراہت پر دلالت کرتے ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (6608) and Muslim (1639). In a version by Muslim: 'It is only a means of extracting something from the stingy.'"
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "اَلنَّذْرِ",
      "english": "The Vow",
      "urdu": "نذر / منت"
    },
    {
      "arabic": "لَا يَأْتِي",
      "english": "Does not bring",
      "urdu": "نہیں لاتی"
    },
    {
      "arabic": "بِخَيْرٍ",
      "english": "Good / Benefit",
      "urdu": "خیر / بھلائی"
    },
    {
      "arabic": "يُسْتَخْرَجُ",
      "english": "Is extracted",
      "urdu": "نکالا جاتا ہے"
    },
    {
      "arabic": "اَلْبَخِيلِ",
      "english": "The Miser",
      "urdu": "بخیل / کنجوس"
    }
  ],
  "summary": {
    "urdu": "نذر ماننے سے تقدیر نہیں بدلتی؛ یہ صرف ایک ایسا ذریعہ ہے جس سے بخیل انسان اللہ کی راہ میں مال خرچ کرنے پر مجبور ہوتا ہے۔",
    "english": "Taking a vow does not change destiny; it is merely a way through which a miser is compelled to spend in the way of Allah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6608)",
      "english": "Sahih al-Bukhari (6608)"
    },
    {
      "arabic": "صحيح مسلم (1639)",
      "english": "Sahih Muslim (1639)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=f-w5oTndxR8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نذر کی شرعی حیثیت",
        "english": "Legal Status of Vows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نذر کی ممانعت کا مفہوم",
              "english": "Meaning of Prohibition"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے نذر ماننے سے اس لیے منع فرمایا کہ یہ تقدیر کو نہیں بدلتی۔",
                "یہ ممانعت 'تنزہی' ہے، یعنی نذر ماننا پسندیدہ عمل نہیں ہے۔",
                "عبادت کو کسی شرط کے ساتھ معلق کرنا اخلاص کے منافی سمجھا جاتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) forbade vows because they do not change divine destiny.",
                "This prohibition is 'Tanzihi' (disliked), meaning it is not a recommended act.",
                "Conditioning an act of worship is considered contrary to pure sincerity."
              ]
            }
          },
          {
            "title": {
              "urdu": "نذر اور تقدیر کا تعلق",
              "english": "Vows and Destiny"
            },
            "content": {
              "urdu": [
                "اکثر لوگ یہ سمجھتے ہیں کہ نذر ماننے سے ان کا کام ہو جائے گا۔",
                "حقیقت میں نذر اللہ کے کسی فیصلے کو ٹالنے کی طاقت نہیں رکھتی۔",
                "صرف دعا اور اللہ پر بھروسہ ہی مومن کا اصل ہتھیار ہونا چاہیے۔"
              ],
              "english": [
                "Many people mistakenly believe that taking a vow ensures their success.",
                "In reality, a vow has no power to avert or change Allah's decree.",
                "Only supplication (Dua) and trust in Allah should be a believer's tool."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بخیل کی نذر",
        "english": "The Miser's Vow"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشروط عبادت",
              "english": "Conditional Worship"
            },
            "content": {
              "urdu": [
                "بخیل انسان بغیر نذر کے اللہ کی راہ میں خرچ کرنے سے کتراتا ہے۔",
                "نذر اسے مجبور کرتی ہے کہ وہ کام ہونے کی صورت میں کچھ صدقہ کرے۔",
                "اللہ تعالیٰ ایسی عبادت کو پسند نہیں کرتا جو صرف بدلے کی بنیاد پر ہو۔"
              ],
              "english": [
                "A miserly person hesitates to spend for Allah without a prior vow.",
                "A vow forces them to give charity only if their desired task is completed.",
                "Allah does not prefer worship that is based solely on a trade-off."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاص کی کمی",
              "english": "Lack of Sincerity"
            },
            "content": {
              "urdu": [
                "نذر ماننے والے کی نیت میں اکثر اللہ کی رضا کے بجائے غرض ہوتی ہے۔",
                "سچی نیکی وہ ہے جو بندہ اللہ کی محبت میں بغیر کسی شرط کے کرے۔",
                "حدیث میں بخیل کا ذکر نذر کے نفسیاتی پہلو کو واضح کرنے کے لیے ہے۔"
              ],
              "english": [
                "A person taking a vow often acts out of self-interest rather than Allah's love.",
                "True righteousness is what a servant does unconditionally for Allah's sake.",
                "The mention of a miser clarifies the psychological aspect of taking vows."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نذر پوری کرنے کا حکم",
        "english": "Obligation to Fulfill Vows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نذر ماننے کے بعد کی ذمہ داری",
              "english": "Responsibility After a Vow"
            },
            "content": {
              "urdu": [
                "اگرچہ نذر ماننا ناپسندیدہ ہے، لیکن مان لی جائے تو پوری کرنا فرض ہے۔",
                "قرآن میں نذر پوری کرنے والوں کی تعریف بیان کی گئی ہے۔",
                "نذر پوری نہ کرنا وعدہ خلافی اور اللہ کی نافرمانی شمار ہوتا ہے۔"
              ],
              "english": [
                "Although taking a vow is disliked, once taken, fulfilling it is obligatory.",
                "The Quran praises those who remain faithful to their vows once made.",
                "Failure to fulfill a vow is considered a breach of promise to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نافرمانی کی نذر",
              "english": "Vows of Disobedience"
            },
            "content": {
              "urdu": [
                "اگر کسی گناہ یا معصیت کی نذر مانی جائے تو اسے پورا کرنا حرام ہے۔",
                "ایسی صورت میں نذر توڑنا واجب ہے اور اس کا کفارہ دینا ہوگا۔",
                "اسلام صرف نیکی اور اطاعت کے کاموں میں نذر کو تسلیم کرتا ہے۔"
              ],
              "english": [
                "If a vow is made to commit a sin, it is prohibited to fulfill it.",
                "In such a case, breaking the vow is mandatory and requires expiation.",
                "Islam only recognizes vows that involve acts of piety and obedience."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توکل علی اللہ",
              "english": "Reliance on Allah"
            },
            "content": {
              "urdu": [
                "ہمیں نذر کے بجائے دعا اور محنت پر یقین رکھنا چاہیے۔",
                "اللہ کے فیصلوں پر راضی رہنا ہی اصل بندگی اور ایمان ہے۔",
                "نذر کے چکر میں پڑنے سے انسان وسوسوں اور تنگیوں کا شکار ہوتا ہے۔"
              ],
              "english": [
                "We should rely on supplication and hard work instead of taking vows.",
                "Being content with Allah's decrees is the essence of true worship.",
                "Engaging in vows often makes a person susceptible to doubts and stress."
              ]
            }
          },
          {
            "title": {
              "urdu": "سخاوت کی ترغیب",
              "english": "Encouraging Generosity"
            },
            "content": {
              "urdu": [
                "مومن کو چاہیے کہ وہ ہر حال میں اللہ کی راہ میں خرچ کرنے کا عادی بنے۔",
                "کسی شرط کے بغیر صدقہ و خیرات کرنا برکتوں کا باعث بنتا ہے۔",
                "نبی ﷺ کی یہ نصیحت ہمیں بخل سے بچنے اور سخی بننے کا درس دیتی ہے۔"
              ],
              "english": [
                "A believer should habituate spending in Allah's way in every situation.",
                "Giving charity without conditions brings immense divine blessings.",
                "This Prophetic advice teaches us to avoid stinginess and embrace generosity."
              ]
            }
          }
        ]
      }
    }
  ]
}