{
  "hadithId": 366,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/313"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "صحيح لغيره.‏ رواه أبو داود (1070)‏، والنسائي (3/194)‏، وابن ماجه (1310)‏، وأحمد (4/372)‏، وابن خزيمة (1464)‏، والحديث صححه علي بن المديني، والحاكم.",
    "urdu": "یہ حدیث 'صحیح لغیرہ' ہے۔ اسے ابو داؤد (1070)، نسائی (3/194)، ابن ماجہ (1310)، اور احمد نے روایت کیا ہے۔ امام ابن خزیمہ، علی بن المدینی اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih lighairihi. Reported by Abu Dawud (1070), An-Nasa'i (3/194), Ibn Majah (1310), and Ahmad (4/372). It was authenticated by Ibn Khuzaymah, Ali bin al-Madini, and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "رَخَّصَ",
      "english": "Granted a concession",
      "urdu": "رخصت دی / آسانی دی"
    },
    {
      "arabic": "مَنْ شَاءَ",
      "english": "Whoever wishes",
      "urdu": "جو چاہے"
    },
    {
      "arabic": "اَلْعِيدَ",
      "english": "The Eid prayer",
      "urdu": "عید کی نماز"
    },
    {
      "arabic": "الْجُمُعَةِ",
      "english": "The Friday prayer",
      "urdu": "جمعہ کی نماز"
    },
    {
      "arabic": "فَلْيُصَلِّ",
      "english": "Let him pray",
      "urdu": "پس وہ پڑھ لے"
    }
  ],
  "summary": {
    "urdu": "اگر عید اور جمعہ ایک ہی دن آجائیں، تو عید کی نماز پڑھنے والوں کے لیے جمعہ کی نماز چھوڑنے کی رخصت ہے، تاہم جمعہ پڑھنا افضل ہے۔",
    "english": "When Eid and Jumu'ah fall on the same day, performing the Eid prayer provides a concession for individuals to skip Jumu'ah prayer if they wish, though attending is better."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1070)",
      "english": "Sunan Abi Dawud (1070)"
    },
    {
      "arabic": "سنن ابن ماجه (1310)",
      "english": "Sunan Ibn Majah (1310)"
    },
    {
      "arabic": "مسند أحمد (4/372)",
      "english": "Musnad Ahmad (4/372)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "زيد بن أرقم",
        "english": "Zaid bin Arqam"
      },
      "slug": "zaid-bin-arqam"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9MszK2Bny4",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic due to corroborating evidences)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عید اور جمعہ کا اجتماع",
        "english": "Coincidence of Eid and Jumu'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی رخصت کا ثبوت",
              "english": "Proof of Legal Concession"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے عید کے دن جمعہ کی حاضری میں رخصت عطا فرمائی۔",
                "یہ رخصت ان لوگوں کے لیے ہے جنہوں نے عید کی نماز ادا کر لی ہو۔",
                "اسلام میں مشقت کو کم کرنے کے لیے ایسی رعایتیں موجود ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) granted a concession for attending Jumu'ah on the day of Eid.",
                "This permission is specifically for those who have already performed the Eid prayer.",
                "Islam provides such facilities to remove hardship from the believers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختیار اور ترجیح",
              "english": "Choice and Preference"
            },
            "content": {
              "urdu": [
                "حدیث کے الفاظ 'جو چاہے پڑھ لے' سے مراد جمعہ کا اختیار ہے۔",
                "رخصت کے باوجود امام کو جمعہ قائم کرنا چاہیے تاکہ جو پڑھنا چاہیں پڑھ سکیں۔",
                "علماء کے نزدیک افضل یہی ہے کہ رخصت کے باوجود جمعہ ادا کیا جائے۔"
              ],
              "english": [
                "The phrase 'whoever wishes to pray' indicates an option regarding Jumu'ah.",
                "Despite the concession, the Imam must still establish Jumu'ah for those who wish to attend.",
                "Scholars maintain that attending Jumu'ah remains superior even when the concession is available."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور احکامات",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظہر کی ادائیگی",
              "english": "Performing Dhuhr"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص جمعہ کی رخصت پر عمل کرے، تو اسے ظہر کی نماز پڑھنی ہوگی۔",
                "جمعہ کی معافی کا مطلب نماز کی مکمل معافی نہیں بلکہ جماعت کی حاضری کی رخصت ہے۔",
                "اکثریت کے نزدیک ظہر بہرحال فرض رہتی ہے۔"
              ],
              "english": [
                "If a person takes the concession for Jumu'ah, they must still perform the Dhuhr prayer.",
                "The exemption from Jumu'ah does not mean total exemption from prayer, but from the Friday congregation.",
                "According to the majority, Dhuhr remains obligatory for those not attending Jumu'ah."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام کے لیے حکم",
              "english": "Ruling for the Imam"
            },
            "content": {
              "urdu": [
                "شہر کی بڑی مساجد میں جمعہ کی اذان اور نماز کا اہتمام ضروری ہے۔",
                "امام کو ان لوگوں کے لیے مسجد میں موجود ہونا چاہیے جو عزمِ عزیمت رکھتے ہیں۔",
                "یہ شعائر اسلام کو زندہ رکھنے کا ایک اہم طریقہ ہے۔"
              ],
              "english": [
                "It is necessary to organize Jumu'ah calls and prayers in the main city mosques.",
                "The Imam should be present for those who choose to perform the Jumu'ah prayer.",
                "This is an essential way to keep the symbols of Islam active in the community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلام کی آسانی",
        "english": "Ease in Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین میں یسر",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلام کے دینِ فطرت اور آسان ہونے کی دلیل ہے۔",
                "خاص طور پر دور دراز سے آنے والوں کے لیے یہ بڑی سہولت ہے۔",
                "اللہ تعالیٰ اپنے بندوں کے لیے آسانی چاہتا ہے، تنگی نہیں۔"
              ],
              "english": [
                "This Hadith proves that Islam is a natural and easy religion.",
                "It provides great convenience, especially for those traveling from afar.",
                "Allah intends ease for His servants and does not intend hardship for them."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی کا اتباع",
              "english": "Following Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "رخصت پر عمل کرنا بھی سنت سے ثابت ہے اور اللہ کو پسند ہے۔",
                "صحابہ کرامؓ نے ان مواقع پر نبی ﷺ کے ارشادات پر عمل کیا۔",
                "سنت پر عمل کرنا ہی کامیابی کی ضمانت ہے۔"
              ],
              "english": [
                "Acting upon concessions is proven from the Sunnah and beloved to Allah.",
                "The Companions followed the Prophet's (ﷺ) guidance in such circumstances.",
                "Following the Sunnah is the ultimate guarantee of success."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی نکات",
        "english": "Educational and Reformative Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علمی دیانت",
              "english": "Academic Integrity"
            },
            "content": {
              "urdu": [
                "محدثین نے راویوں کی تحقیق میں بڑی محنت کی ہے۔",
                "ابن خزیمہ کی تصحیح پر حافظ ابن حجر کا تبصرہ ان کی باریک بینی ظاہر کرتا ہے۔",
                "حدیث کی صحت کے درجات کو سمجھنا ہر طالب علم کے لیے ضروری ہے۔"
              ],
              "english": [
                "Hadith scholars put immense effort into researching narrators.",
                "Ibn Hajar's comment on Ibn Khuzaymah's grading shows critical precision.",
                "Understanding the grades of Hadith is essential for every student of knowledge."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی عبادات کا ادب",
              "english": "Etiquette of Collective Worship"
            },
            "content": {
              "urdu": [
                "عید اور جمعہ دونوں خوشی اور اجتماع کے دن ہیں۔",
                "ان ایام میں مسلمانوں کا اتحاد اور بھائی چارہ ظاہر ہوتا ہے۔",
                "عبادات کے ذریعے نظم و ضبط کی تربیت حاصل ہوتی ہے۔"
              ],
              "english": [
                "Both Eid and Jumu'ah are days of joy and gathering.",
                "The unity and brotherhood of Muslims are manifested on these days.",
                "Discipline and training are acquired through regular collective worship."
              ]
            }
          }
        ]
      }
    }
  ]
}