{
  "hadithId": 372,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/319"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "موضوع.‏ رواه الدارقطني (2/3‏-4/1)‏ وفي سنده عبد العزيز بن عبد الرحمن القرشي، قال عنه ابن حبان: لا يحل الاحتجاج به بحال. والحديث ضعيف جداً أو موضوع.",
    "urdu": "یہ روایت سخت ضعیف بلکہ موضوع (من گھڑت) ہے۔ اسے دارقطنی نے روایت کیا ہے، اس کی سند میں عبدالعزیز بن عبدالرحمن القرشی ہے جسے ائمہ جرح و تعدیل نے کذاب اور ناقابلِ احتجاج قرار دیا ہے۔",
    "english": "Extremely weak/Fabricated (Maudu'). Reported by ad-Daraqutni. Its chain contains Abdul Aziz bin Abdur Rahman al-Qurashi, whom Ibn Hibban stated is not permissible to use as a witness/proof at all."
  },
  "importantWords": [
    {
      "arabic": "مَضَتِ",
      "english": "Passed / Continued",
      "urdu": "جاری رہا / گزرا"
    },
    {
      "arabic": "السُّنَّةُ",
      "english": "The Sunnah / Practice",
      "urdu": "سنت / طریقہ"
    },
    {
      "arabic": "أَرْبَعِينَ",
      "english": "Forty",
      "urdu": "چالیس"
    },
    {
      "arabic": "فَصَاعِدًا",
      "english": "And more / upwards",
      "urdu": "اور اس سے زیادہ"
    },
    {
      "arabic": "جُمُعَةً",
      "english": "Friday Prayer",
      "urdu": "نمازِ جمعہ"
    }
  ],
  "summary": {
    "urdu": "اس روایت میں جمعہ کی ادائیگی کے لیے چالیس افراد کی شرط بیان کی گئی ہے، لیکن یہ روایت سند کے لحاظ سے سخت ضعیف ہے، اس لیے یہ شرط لازمی نہیں۔",
    "english": "This narration suggests a requirement of forty people for the Jumu'ah prayer to be valid, but due to its extreme weakness, this specific number is not a binding condition."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني (2/4)",
      "english": "Sunan ad-Daraqutni (2/4)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0W8eW1Tj8mY",
  "grade": {
    "arabic": "ضعيف جداً / موضوع",
    "english": "Very Weak / Fabricated"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کے لیے تعداد کی شرط",
        "english": "The Condition of Number for Jumu'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چالیس افراد کی بحث",
              "english": "The Debate of Forty People"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک جمعہ کے لیے چالیس افراد کا ہونا ضروری ہے۔",
                "ان کا استدلال اس روایت سے ہے، مگر محدثین کے نزدیک یہ روایت ثابت نہیں ہے۔",
                "دیگر فقہاء کے نزدیک کم تعداد میں بھی جمعہ ادا کیا جا سکتا ہے۔"
              ],
              "english": [
                "Imam Shafi'i and Imam Ahmad consider forty people a requirement for Jumu'ah.",
                "Their evidence is based on this narration, but Hadith scholars deem it unauthentic.",
                "Other jurists maintain that Jumu'ah can be performed with fewer participants."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحیح موقف",
              "english": "The Authentic Stance"
            },
            "content": {
              "urdu": [
                "قرآن و حدیث میں جمعہ کے لیے کوئی خاص تعداد مقرر نہیں کی گئی۔",
                "اجتماع کے لیے کم از کم تین یا دو افراد بھی کافی ہو سکتے ہیں۔",
                "شریعت کا مقصد اجتماعیت کو فروغ دینا ہے نہ کہ تنگی پیدا کرنا۔"
              ],
              "english": [
                "No specific number is fixed for Jumu'ah in the Quran or authentic Sunnah.",
                "A minimum of two or three people may suffice to constitute a congregation.",
                "The Shariah aims to promote community gathering rather than creating hardship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت کی علمی حیثیت",
        "english": "Academic Status of the Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری",
              "english": "Weakness of the Chain"
            },
            "content": {
              "urdu": [
                "اس حدیث کا راوی عبدالعزیز بن عبدالرحمن سخت مجروح اور ناقابلِ اعتبار ہے۔",
                "محدثین کے نزدیک ایسی روایات پر شرعی احکامات کی بنیاد نہیں رکھی جا سکتی۔",
                "حافظ ابن حجر نے اسے صرف 'ضعیف' کہہ کر اس پر نرمی برتی ہے۔"
              ],
              "english": [
                "The narrator Abdul Aziz is heavily criticized and deemed unreliable by scholars.",
                "According to Hadith experts, legal rulings cannot be based on such narrations.",
                "Ibn Hajar was lenient in only labeling it 'weak' when it is actually more severe."
              ]
            }
          },
          {
            "title": {
              "urdu": "موضوع روایات سے اجتناب",
              "english": "Avoiding Fabricated Narrations"
            },
            "content": {
              "urdu": [
                "دین میں کسی بھی بات کو رسول اللہ ﷺ کی طرف منسوب کرنے میں احتیاط ضروری ہے۔",
                "سخت ضعیف روایات سے عقائد یا فرائض ثابت نہیں ہوتے۔",
                "تحقیق کے بغیر کسی بھی حدیث کو آگے پھیلانا خطرناک عمل ہے۔"
              ],
              "english": [
                "Caution is vital before attributing any statement to the Prophet (ﷺ) in religion.",
                "Severely weak narrations do not establish creeds or obligatory duties.",
                "Spreading any Hadith without verification is a dangerous practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی وسعت اور آسانی",
        "english": "Juristic Scope and Ease"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آبادی کی شرط",
              "english": "The Condition of Population"
            },
            "content": {
              "urdu": [
                "جمعہ کے لیے شہر یا گاؤں کا ہونا ضروری ہے جہاں لوگ مقیم ہوں۔",
                "مسافروں پر جمعہ فرض نہیں ہے جب تک وہ مستقل قیام نہ کریں۔",
                "جہاں مسلمان بستے ہوں وہاں جمعہ کا قیام شعائرِ اسلام میں سے ہے۔"
              ],
              "english": [
                "Jumu'ah is required in towns or villages where people are residents.",
                "Jumu'ah is not obligatory for travelers unless they have settled temporarily.",
                "Establishing Jumu'ah wherever Muslims reside is among the symbols of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور کا عمل",
              "english": "Practice of the Majority"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک مسجد میں جماعت کا ہونا ہی اصل مقصد ہے۔",
                "تعداد کی کمی بیشی سے نماز کے جواز پر فرق نہیں پڑتا۔",
                "اسلامی فقہ میں حالات کے مطابق گنجائش موجود ہوتی ہے۔"
              ],
              "english": [
                "According to most scholars, the primary goal is having a congregation in the mosque.",
                "Variation in numbers does not affect the basic validity of the prayer.",
                "Islamic jurisprudence offers flexibility based on specific circumstances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علم الحدیث کی اہمیت",
              "english": "Importance of Hadith Science"
            },
            "content": {
              "urdu": [
                "حدیث کی جانچ پرکھ کے بغیر غلط فہمیاں پیدا ہو سکتی ہیں۔",
                "راویوں کے حالات جاننا دین کی حفاظت کے لیے ناگزیر ہے۔",
                "طالب علم کو چاہیے کہ وہ مستند کتبِ احادیث کی طرف رجوع کرے۔"
              ],
              "english": [
                "Misunderstandings can arise without proper critical analysis of Hadith.",
                "Knowing the biographies of narrators is essential for guarding the religion.",
                "Students should refer back to authentic books of Hadith for guidance."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتہادی بصیرت",
              "english": "Ijtihad and Insight"
            },
            "content": {
              "urdu": [
                "فقہی اختلافات میں دلائل کی قوت کو دیکھنا چاہیے۔",
                "محض روایات کے ظاہر پر عمل کرنے سے پہلے ان کی صحت دیکھنا ضروری ہے۔",
                "علماء کا اختلاف امت کے لیے رحمت اور علمی وسعت کا باعث ہے۔"
              ],
              "english": [
                "In juristic differences, one must look at the strength of the evidence.",
                "The authenticity of a report must be checked before acting on its literal meaning.",
                "Scholarly disagreement is a source of mercy and intellectual depth for the Ummah."
              ]
            }
          }
        ]
      }
    }
  ]
}