{
  "hadithId": 916,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/916", "bukhari:5251", "muslim:1471"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5251) ومسلم (1471) واللفظ له. ورواية 'وحسبت عليه تطليقة' في البخاري (5253).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (5251) اور امام مسلم (1471) نے روایت کیا ہے۔ حیض میں طلاق کو ایک طلاق شمار کرنے کی روایت بخاری (5253) میں موجود ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5251) and Muslim (1471). The narration stating it was counted as one divorce is in Al-Bukhari (5253)."
  },
  "importantWords": [
    {
      "arabic": "حَائِضٌ",
      "english": "Menstruating",
      "urdu": "حالتِ حیض میں"
    },
    {
      "arabic": "فَلْيُرَاجِعْهَا",
      "english": "Take her back",
      "urdu": "رجوع کر لے"
    },
    {
      "arabic": "تَطْهُرَ",
      "english": "Becomes purified",
      "urdu": "پاک ہو جائے"
    },
    {
      "arabic": "يَمَسَّ",
      "english": "Touch (Intercourse)",
      "urdu": "ہاتھ لگائے (جماع)"
    },
    {
      "arabic": "عَصَيْتَ",
      "english": "Disobeyed",
      "urdu": "تم نے نافرمانی کی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں طلاقِ سنت کا طریقہ بتایا گیا ہے کہ حیض کے دوران طلاق دینا منع ہے، طلاق صرف طہر (پاکی) کی حالت میں جماع سے پہلے دی جا سکتی ہے۔",
    "english": "This Hadith outlines the Sunnah method of divorce, prohibiting divorce during menstruation and requiring it to occur during a period of purity without prior intercourse."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5251)",
      "english": "Reported by Al-Bukhari (5251)"
    },
    {
      "arabic": "رواه مسلم (1471)",
      "english": "Reported by Muslim (1471)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=7hR0_D8j6X8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طلاقِ سنت اور طلاقِ بدعی",
        "english": "Sunnah and Bidi'ah Divorce"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیض میں طلاق کی ممانعت",
              "english": "Prohibition in Menstruation"
            },
            "content": {
              "urdu": [
                "حیض کی حالت میں طلاق دینا شرعی طور پر گناہ اور بدعت ہے۔",
                "ایسی طلاق عورت کی عدت کو طویل اور دشوار بنا دیتی ہے۔",
                "نبی ﷺ نے غصے کا اظہار فرمایا اور رجوع کرنے کا حکم دیا۔"
              ],
              "english": [
                "Divorcing during menstruation is religiously sinful and an innovation.",
                "Such a divorce makes the waiting period (Iddah) long and difficult.",
                "The Prophet (ﷺ) expressed anger and ordered a mandatory revocation."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحیح وقت کا تعین",
              "english": "Determining the Correct Time"
            },
            "content": {
              "urdu": [
                "طلاق کے لیے بہترین وقت وہ طہر ہے جس میں جماع نہ کیا گیا ہو۔",
                "حالتِ حمل میں بھی طلاق دینا طلاقِ سنت کے زمرے میں آتا ہے۔",
                "یہ شرائط اس لیے ہیں تاکہ غصہ ٹھنڈا ہو اور صلح کی گنجائش رہے۔"
              ],
              "english": [
                "The ideal time for divorce is purity (Tuhr) without sexual contact.",
                "Divorcing during pregnancy is also considered a Sunnah divorce.",
                "These conditions exist to allow anger to subside and permit reconciliation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رجوع اور اس کا طریقہ",
        "english": "Revocation and its Method"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فوری رجوع کا حکم",
              "english": "Order of Immediate Return"
            },
            "content": {
              "urdu": [
                "غلط وقت پر دی گئی طلاق کے بعد رجوع کرنا واجب قرار دیا گیا۔",
                "رجوع کے بعد بیوی کو اگلے طہر تک نکاح میں رکھنا ضروری ہے۔",
                "یہ عمل شوہر کو اپنے فیصلے پر دوبارہ سوچنے کا موقع فراہم کرتا ہے۔"
              ],
              "english": [
                "Revoking a divorce given at the wrong time was made obligatory.",
                "After revocation, the wife must be kept until the next purity period.",
                "This process gives the husband a chance to rethink his decision."
              ]
            }
          },
          {
            "title": {
              "urdu": "طلاق کا شمار",
              "english": "Counting the Divorce"
            },
            "content": {
              "urdu": [
                "حیض میں دی گئی طلاق اگرچہ گناہ ہے، مگر وہ ایک شمار ہوتی ہے۔",
                "جمہور فقہاء کے نزدیک ایسی طلاق واقع ہو جاتی ہے اور رجوع لازم ہے۔",
                "نافرمانی کے باوجود قانونی طور پر اسے ایک طلاق مانا جاتا ہے۔"
              ],
              "english": [
                "Though divorcing in menstruation is a sin, it counts as one instance.",
                "According to most jurists, the divorce takes effect and return is required.",
                "Despite the disobedience, it is legally recognized as one divorce."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین طلاقوں کی ممانعت",
              "english": "Prohibition of Three Divorces"
            },
            "content": {
              "urdu": [
                "ایک ساتھ تین طلاقیں دینا اللہ کے حکم کی صریح نافرمانی ہے۔",
                "اسلام نے طلاق کو مرحلہ وار اور صلح کی گنجائش کے ساتھ رکھا ہے۔",
                "اکٹھی تین طلاقیں دینے سے رجوع کا راستہ ہمیشہ کے لیے بند ہو جاتا ہے۔"
              ],
              "english": [
                "Giving three divorces at once is explicit disobedience to Allah.",
                "Islam structured divorce in stages to allow for reconciliation.",
                "Giving three at once permanently closes the door to returning."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی حدود",
              "english": "The Limits of Allah"
            },
            "content": {
              "urdu": [
                "طلاق کے احکامات اللہ کی مقرر کردہ حدود میں شامل ہیں۔",
                "ان حدود کو پامال کرنا اپنی جان پر ظلم کرنے کے مترادف ہے۔",
                "مومن کو ہر حال میں شرعی ضابطوں کی پابندی کرنی چاہیے۔"
              ],
              "english": [
                "The rulings of divorce are among the limits prescribed by Allah.",
                "Violating these limits is equivalent to oppressing oneself.",
                "A believer must adhere to Shariah regulations in all circumstances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علم کی اہمیت",
              "english": "Importance of Knowledge"
            },
            "content": {
              "urdu": [
                "نکاح و طلاق کے مسائل کا علم حاصل کرنا ہر مسلمان پر فرض ہے۔",
                "جہالت کی بنا پر کیے گئے فیصلے خاندانی تباہی کا باعث بنتے ہیں۔",
                "مشکل وقت میں علماء اور سنت سے رہنمائی لینی چاہیے۔"
              ],
              "english": [
                "Learning the rulings of marriage and divorce is obligatory for Muslims.",
                "Decisions made out of ignorance lead to family destruction.",
                "One should seek guidance from scholars and Sunnah during tough times."
              ]
            }
          },
          {
            "title": {
              "urdu": "جذبات پر قابو",
              "english": "Emotional Control"
            },
            "content": {
              "urdu": [
                "طلاق کے معاملے میں عجلت اور غصے سے بچنا ایمان کا تقاضا ہے۔",
                "شریعت نے طلاق کے لیے طویل وقت اسی لیے رکھا ہے کہ صلح ہو سکے۔",
                "صبر اور ہوش مندی سے بہت سے گھر ٹوٹنے سے بچ سکتے ہیں۔"
              ],
              "english": [
                "Avoiding haste and anger in divorce is a requirement of faith.",
                "Shariah set a long timeframe for divorce to facilitate peace.",
                "Patience and wisdom can save many homes from collapsing."
              ]
            }
          }
        ]
      }
    }
  ]
}