{
  "hadithId": 682,
  "hadithNo": 35,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/35"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "صحيح موقوف. رواه البخاري (2149). وله حكم الرفع لأن هذا الحكم ورد صريحاً عن النبي صلى الله عليه وسلم في حديث أبي هريرة المتفق عليه.",
    "urdu": "یہ روایت موقوفاً صحیح ہے اور امام بخاری (2149) نے اسے روایت کیا ہے۔ اگرچہ یہ ابن مسعود کا قول ہے، مگر اس کا حکم مرفوع ہے کیونکہ یہی بات نبی ﷺ سے صحیح بخاری و مسلم کی دیگر روایات میں ثابت ہے۔",
    "english": "Sahih Mauquf. Reported by Al-Bukhari (2149). Although it is a statement of Ibn Mas'ud, its ruling is considered Marfu' (from the Prophet) as it aligns with Sahih Hadiths from Abu Hurairah."
  },
  "importantWords": [
    {
      "arabic": "مَحَفَّلَةً",
      "english": "Udder-tied / Milk-retained",
      "urdu": "دودھ روکی ہوئی بکری"
    },
    {
      "arabic": "فَرَدَّهَا",
      "english": "Returned it",
      "urdu": "اسے واپس کر دیا"
    },
    {
      "arabic": "صَاعًا",
      "english": "A Sa' (measurement unit)",
      "urdu": "ایک صاع (تقریباً ڈھائی کلو)"
    },
    {
      "arabic": "تَمْرٍ",
      "english": "Dates",
      "urdu": "کھجوریں"
    },
    {
      "arabic": "اشْتَرَى",
      "english": "Bought / Purchased",
      "urdu": "خریدا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'مصراۃ' (وہ جانور جس کا دودھ دھوکے کے لیے روکا گیا ہو) کی بیع اور اس کی واپسی کا طریقہ بیان کیا گیا ہے کہ دودھ کے بدلے ایک صاع کھجور دی جائے۔",
    "english": "This Hadith explains the ruling on returning an animal whose milk was withheld to deceive the buyer, requiring a Sa' of dates as compensation for the milk consumed."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "مستخرج الإسماعيلي",
      "english": "Mustakhraj al-Isma'ili"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p7U_pG_2Q",
  "grade": {
    "arabic": "صحيح موقوف",
    "english": "Sahih Mauquf (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیعِ مصراۃ اور دھوکہ دہی",
        "english": "Sale of Musarrah and Deception"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دھوکے کی ممانعت",
              "english": "Prohibition of Fraud"
            },
            "content": {
              "urdu": [
                "تھنوں میں دودھ روکنا ایک تجارتی دھوکہ ہے جسے 'تصریہ' کہا جاتا ہے۔",
                "اس سے خریدار یہ سمجھتا ہے کہ جانور بہت زیادہ دودھ دینے والا ہے۔",
                "اسلام ہر اس عمل سے روکتا ہے جس میں خریدار کو فریب دیا جائے۔"
              ],
              "english": [
                "Withholding milk in the udders is a deceptive practice called Tasriyah.",
                "It leads the buyer to believe the animal is a heavy milk producer.",
                "Islam prohibits any act intended to mislead or defraud the buyer."
              ]
            }
          },
          {
            "title": {
              "urdu": "تجارت میں سچائی",
              "english": "Truthfulness in Trade"
            },
            "content": {
              "urdu": [
                "بیچنے والے پر واجب ہے کہ وہ جانور کے عیب اور حقیقت واضح کرے۔",
                "دھوکے سے کمایا گیا نفع حرام اور برکت سے خالی ہوتا ہے۔",
                "سچا تاجر ہی معاشرے میں معاشی عدل و انصاف قائم کر سکتا ہے۔"
              ],
              "english": [
                "The seller is obligated to disclose any defects or the reality of the animal.",
                "Profit earned through deception is unlawful and lacks divine blessing.",
                "Only a truthful merchant can establish economic justice in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جانور کی واپسی اور معاوضہ",
        "english": "Return of Animal and Compensation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقِ فسخ (واپسی کا حق)",
              "english": "Right of Rescission"
            },
            "content": {
              "urdu": [
                "دھوکہ معلوم ہونے پر خریدار کو جانور واپس کرنے کا مکمل حق ہے۔",
                "یہ واپسی عیب کی بنیاد پر 'خیارِ عیب' کے تحت آتی ہے۔",
                "شریعت نے مظلوم فریق کے مالی تحفظ کے لیے یہ قانون بنایا ہے۔"
              ],
              "english": [
                "The buyer has the full right to return the animal upon discovering the fraud.",
                "This return falls under the 'Option of Defect' (Khiyar al-'Ayb).",
                "Sharia established this law to protect the financial interests of the victim."
              ]
            }
          },
          {
            "title": {
              "urdu": "دودھ کا معاوضہ",
              "english": "Compensation for Milk"
            },
            "content": {
              "urdu": [
                "خریدار نے جو دودھ دوہا، اس کے بدلے ایک صاع کھجور دینا ہوگی۔",
                "یہ ایک صاع کھجور اس دودھ کا شرعی بدل قرار دی گئی ہے۔",
                "تاکہ بیچنے والے کا بھی نقصان نہ ہو اور معاملہ برابر ہو جائے۔"
              ],
              "english": [
                "The buyer must provide one Sa' of dates for the milk they consumed.",
                "This Sa' of dates is designated as the legal equivalent of the milk.",
                "This ensures the seller is compensated and the matter is settled fairly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور عدل",
        "english": "Juristic Wisdom and Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھجور کا انتخاب کیوں؟",
              "english": "Why Dates?"
            },
            "content": {
              "urdu": [
                "کھجور اس دور میں عام خوراک تھی اور اس کی قیمت مستحکم تھی۔",
                "دودھ کی مقدار مختلف ہو سکتی ہے مگر معاوضہ ایک صاع طے کر دیا گیا۔",
                "اس سے جھگڑوں کا خاتمہ اور حساب کتاب میں آسانی مقصود ہے۔"
              ],
              "english": [
                "Dates were a staple food and had stable value during that era.",
                "While milk quantities vary, the compensation was fixed at one Sa'.",
                "This aims to prevent disputes and simplify the settlement process."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشی شفافیت",
              "english": "Economic Transparency"
            },
            "content": {
              "urdu": [
                "اسلامی منڈی میں اشیاء کی ظاہری حالت ان کی اصل کے مطابق ہونی چاہیے۔",
                "مصنوعی طریقے سے مال کی قدر بڑھانا معاشی جرم ہے۔",
                "شفافیت ہی خریدار کے اعتماد کو بحال رکھتی ہے۔"
              ],
              "english": [
                "In an Islamic market, the appearance of goods must match their reality.",
                "Artificially inflating the value of goods is an economic offense.",
                "Transparency is essential to maintaining consumer confidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروباری ایمانداری",
              "english": "Business Integrity"
            },
            "content": {
              "urdu": [
                "ہمیں ہر قسم کی ملاوٹ اور دھوکہ دہی سے بچنا چاہیے۔",
                "گاہک کو چیز کی تمام خامیاں بتا دینا سنتِ نبوی ہے۔",
                "ایمانداری سے کی گئی تجارت میں اللہ کی خاص برکت ہوتی ہے۔"
              ],
              "english": [
                "We must avoid all forms of adulteration and deception.",
                "Informing the customer of all defects is a Prophetic Sunnah.",
                "Trade conducted with honesty attracts special divine blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقصان کی تلافی",
              "english": "Restitution of Loss"
            },
            "content": {
              "urdu": [
                "اگر نادانستہ کسی کا حق مارا جائے تو اس کی تلافی کرنی چاہیے۔",
                "دوسرے کا مال ناحق استعمال کرنا گناہ اور وبال ہے۔",
                "معاملات کی صفائی آخرت کے مواخذے سے بچاتی ہے۔"
              ],
              "english": [
                "If someone's right is infringed unintentionally, restitution must be made.",
                "Unjustly using another's property is a sin and a burden.",
                "Clear financial dealings protect one from accountability in the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}