{
  "hadithId": 939,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1080"],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (2255)، والنسائي (3467). وصححه ابن حبان والحاكم. والحديث أصل في تغليظ اليمين الخامسة في اللعان للتنبيه على خطورتها.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام ابوداؤد (2255) اور امام نسائی (3467) نے روایت کیا ہے۔ اس کی سند کے تمام راوی ثقہ ہیں۔ امام ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔ یہ حدیث لعان کی پانچویں قسم کی سنگینی کو واضح کرتی ہے۔",
    "english": "Hasan. Reported by Abu Dawud (2255) and An-Nasa'i (3467). Graded Sahih by Ibn Hibban and Al-Hakim. The narrators are reliable (Thiqat). This Hadith emphasizes the gravity of the fifth oath in the process of Li'an."
  },
  "importantWords": [
    {
      "arabic": "أَمَرَ",
      "english": "Commanded",
      "urdu": "حکم دیا"
    },
    {
      "arabic": "يَضَعَ",
      "english": "Place / Put",
      "urdu": "رکھ دے"
    },
    {
      "arabic": "الْخَامِسَةِ",
      "english": "The Fifth",
      "urdu": "پانچویں"
    },
    {
      "arabic": "فِيهِ",
      "english": "His mouth",
      "urdu": "اس کا منہ"
    },
    {
      "arabic": "مُوجِبَةٌ",
      "english": "Obligatory / Bringing result",
      "urdu": "واجب کرنے والی"
    }
  ],
  "summary": {
    "urdu": "لعان کے عمل میں پانچویں قسم سب سے زیادہ خطرناک ہوتی ہے، اس لیے نبی ﷺ نے حکم دیا کہ پانچویں بار بولنے سے پہلے شخص کو روکا جائے تاکہ وہ جھوٹی قسم کھا کر ہلاک نہ ہو جائے۔",
    "english": "In the process of Li'an, the fifth oath is the most critical; the Prophet (ﷺ) ordered that the person be warned and stopped momentarily before the final testimony to prevent self-destruction through a false oath."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2255)",
      "english": "Sunan Abu Dawud (2255)"
    },
    {
      "arabic": "سنن النسائي (3467)",
      "english": "Sunan an-Nasa'i (3467)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_vW0BTo",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لعان کا شرعی طریقہ",
        "english": "Shariah Procedure of Li'an"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار شہادتیں اور پانچویں قسم",
              "english": "Four Testimonies and the Fifth Oath"
            },
            "content": {
              "urdu": [
                "لعان میں شوہر چار مرتبہ اللہ کی قسم کھا کر بیوی پر بدکاری کی گواہی دیتا ہے۔",
                "پانچویں مرتبہ وہ کہتا ہے کہ 'اگر میں جھوٹا ہوں تو مجھ پر اللہ کی لعنت ہو'۔",
                "یہ پانچویں قسم ہی وہ مرحلہ ہے جہاں معاملہ حتمی اور اللہ کے سپرد ہو جاتا ہے۔"
              ],
              "english": [
                "In Li'an, the husband swears four times by Allah that his accusation of adultery is true.",
                "The fifth time, he invokes Allah's curse upon himself if he is lying.",
                "This fifth oath is the final stage where the matter becomes definitive and left to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیوی کا دفاعی عمل",
              "english": "The Wife's Defense"
            },
            "content": {
              "urdu": [
                "بیوی بھی اسی طرح چار بار اللہ کی قسم کھا کر الزام کی تردید کرتی ہے۔",
                "پانچویں بار وہ کہتی ہے کہ 'اگر شوہر سچا ہے تو مجھ پر اللہ کا غضب نازل ہو'۔",
                "یہ طریقہ قرآن مجید کی سورہ نور میں تفصیل کے ساتھ بیان کیا گیا ہے۔"
              ],
              "english": [
                "Similarly, the wife swears four times by Allah to refute the accusation.",
                "The fifth time, she invokes Allah's wrath upon herself if the husband is truthful.",
                "This procedure is detailed in Surah An-Nur of the Holy Quran."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منہ پر ہاتھ رکھنے کی حکمت",
        "english": "Wisdom of Covering the Mouth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ خدا دلانا",
              "english": "Instilling Fear of Allah"
            },
            "content": {
              "urdu": [
                "پانچویں قسم کھانے سے پہلے منہ پر ہاتھ رکھ کر اسے ایک لمحے کے لیے رکنے کا موقع دیا جاتا ہے۔",
                "اس کا مقصد یہ ہے کہ اسے احساس ہو کہ وہ اپنی ہلاکت کی دعا کرنے جا رہا ہے۔",
                "اسلام گناہ گار کو بھی توبہ اور سچائی کی طرف واپسی کا آخری موقع فراہم کرتا ہے۔"
              ],
              "english": [
                "Placing a hand over the mouth allows the person to pause for a moment before the final oath.",
                "The goal is to make them realize they are about to invoke their own destruction.",
                "Islam provides even a sinner with a final opportunity for repentance and truth."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہلاکت سے بچاؤ",
              "english": "Prevention of Destruction"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ یہ قسم 'موجبہ' ہے یعنی اللہ کے عذاب کو واجب کرنے والی ہے۔",
                "جھوٹی قسم کھا کر دنیا کا مقدمہ جیتنا دراصل آخرت کی ہلاکت خریدنا ہے۔",
                "رسول اللہ ﷺ کی شفقت تھی کہ آپ ﷺ نہیں چاہتے تھے کہ کوئی جھوٹی قسم کھا کر ہلاک ہو۔"
              ],
              "english": [
                "The Prophet (ﷺ) stated this oath is 'Mujibah', meaning it seals Allah's punishment.",
                "Winning a worldly case through a false oath is actually buying destruction in the Hereafter.",
                "The Prophet's (ﷺ) compassion led him to want no one to perish due to a false oath."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی آداب اور سنجیدگی",
        "english": "Judicial Etiquette and Seriousness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاکم کی ذمہ داری",
              "english": "Responsibility of the Judge"
            },
            "content": {
              "urdu": [
                "حاکم یا قاضی پر لازم ہے کہ وہ لعان کرنے والوں کو بار بار اللہ سے ڈرائے۔",
                "عدالت کا کام صرف فیصلہ کرنا نہیں بلکہ فریقین کی اخروی فلاح کا خیال رکھنا بھی ہے۔",
                "لعان کی مجلس نہایت پروقار اور خوفِ خدا والی ہونی چاہیے تاکہ جھوٹ کی ہمت نہ ہو۔"
              ],
              "english": [
                "The judge or ruler must repeatedly warn the parties to fear Allah.",
                "The court's job is not just to rule, but also to consider the spiritual welfare of people.",
                "The assembly of Li'an should be solemn and God-fearing to discourage lying."
              ]
            }
          },
          {
            "title": {
              "urdu": "سچائی کی اہمیت",
              "english": "Importance of Truthfulness"
            },
            "content": {
              "urdu": [
                "یہ حدیث سکھاتی ہے کہ قانونی پیچیدگیوں سے بڑھ کر سچائی کی اہمیت ہے۔",
                "اللہ کی قسم کھانا کوئی معمولی کھیل نہیں ہے بلکہ یہ عرش کو ہلا دینے والا معاملہ ہے۔",
                "مومن کی پہچان یہ ہے کہ وہ ہر حال میں سچ بولے، خواہ اس کا نتیجہ کچھ بھی ہو۔"
              ],
              "english": [
                "This Hadith teaches that truthfulness outweighs legal technicalities.",
                "Swearing by Allah is not a game; it is a matter that shakes the heavens.",
                "A believer's hallmark is to speak the truth regardless of the worldly outcome."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان پر پہرہ",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "انسان کو اپنی زبان سے نکلنے والے ہر لفظ کا ذمہ دار ہونا چاہیے۔",
                "خاص طور پر غصے اور جذبات میں آکر ایسی باتیں نہیں کرنی چاہئیں جو اللہ کو ناراض کریں۔",
                "منہ پر ہاتھ رکھنا ایک علامتی اشارہ ہے کہ اپنی زبان کو لگام دو۔"
              ],
              "english": [
                "An individual must be responsible for every word that leaves their tongue.",
                "One should especially avoid saying things in anger that might displease Allah.",
                "Placing a hand over the mouth is a symbolic gesture to restrain the tongue."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کا تصور",
              "english": "Concept of the Hereafter"
            },
            "content": {
              "urdu": [
                "دنیا کے تمام فیصلے عارضی ہیں، جبکہ اللہ کا حساب حتمی اور دائمی ہے۔",
                "جھوٹی گواہی اور بہتان تراشی معاشرے کے لیے زہرِ قاتل ہے۔",
                "لعان کے احکام دراصل عفت اور پاکدامنی کے نظام کے تحفظ کے لیے ہیں۔"
              ],
              "english": [
                "All worldly judgments are temporary, while Allah's reckoning is final and eternal.",
                "False testimony and slander are deadly poisons for any society.",
                "The rulings of Li'an are designed to protect the system of modesty and chastity."
              ]
            }
          }
        ]
      }
    }
  ]
}