{
  "hadithId": 253,
  "hadithNo": 44,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/44"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (844) ، ومسلم (593) .",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (844) اور امام مسلم (593) نے اسے اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (844) and Muslim (593)."
  },
  "importantWords": [
    {
      "arabic": "دُبُرِ",
      "english": "End / After",
      "urdu": "آخر میں / بعد"
    },
    {
      "arabic": "مَكْتُوبَةٍ",
      "english": "Compulsory (Prayer)",
      "urdu": "فرض نماز"
    },
    {
      "arabic": "مَانِعَ",
      "english": "Withholder",
      "urdu": "روکنے والا"
    },
    {
      "arabic": "مُعْطِيَ",
      "english": "Giver",
      "urdu": "عطا کرنے والا"
    },
    {
      "arabic": "اَلْجَدِّ",
      "english": "Fortune / Wealth",
      "urdu": "نصیبہ / مال و جاہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں فرض نماز کے بعد پڑھے جانے والے ان مسنون کلمات کا ذکر ہے جو اللہ کی توحید، اس کی قدرت اور مکمل خود مختاری پر مشتمل ہیں۔",
    "english": "This Hadith mentions the Prophetic words recited after obligatory prayers, emphasizing Allah's Oneness, His power, and His absolute sovereignty."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (844)",
      "english": "Sahih Al-Bukhari (844)"
    },
    {
      "arabic": "صحيح مسلم (593)",
      "english": "Sahih Muslim (593)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "المغيرة بن شعبة",
        "english": "Al-Mughirah bin Shu'bah"
      },
      "slug": "al-mughirah-bin-shubah"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=Dua+after+compulsory+prayer+Mughirah+bin+Shubah",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عقیدہ توحید کا اظہار",
        "english": "Expression of Monotheism"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی وحدانیت کا اقرار",
              "english": "Affirming Allah's Oneness"
            },
            "content": {
              "urdu": [
                "نماز کے فوراً بعد توحید کے ان کلمات کا ورد ایمان کو تازگی بخشتا ہے۔",
                "یہ الفاظ اس بات کا اعتراف ہیں کہ کائنات کا ذرہ ذرہ اللہ کا محتاج ہے۔",
                "شرک کی نفی اور اللہ کی بڑائی بیان کرنا بندگی کا اصل جوہر ہے۔"
              ],
              "english": [
                "Reciting these words of Monotheism right after prayer refreshes one's faith.",
                "These words acknowledge that every atom in the universe depends on Allah.",
                "Negating partners and exalting Allah's greatness is the essence of servitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "قدرت اور حمد کا اعتراف",
              "english": "Acknowledgment of Power and Praise"
            },
            "content": {
              "urdu": [
                "تمام بادشاہت اور تعریفیں صرف اللہ ہی کے لیے خاص ہیں۔",
                "وہ ہر چیز پر مکمل قدرت رکھتا ہے اور اس کا کوئی شریک نہیں۔",
                "نمازی اپنی نماز کی تکمیل پر اللہ کی ان صفات کا گواہ بنتا ہے۔"
              ],
              "english": [
                "All sovereignty and praises are reserved exclusively for Allah Alone.",
                "He possesses complete power over everything and has no associate.",
                "The worshipper testifies to these attributes upon completing their prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توکل اور مشیتِ الٰہی",
        "english": "Trust and Divine Will"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عطا اور روک کا اختیار",
              "english": "Authority to Give and Withhold"
            },
            "content": {
              "urdu": [
                "اللہ جس کو جو دینا چاہے، کائنات کی کوئی طاقت اسے روک نہیں سکتی۔",
                "اسی طرح اگر اللہ کسی چیز سے محروم کر دے تو کوئی دے نہیں سکتا۔",
                "یہ عقیدہ انسان کو لوگوں کے سامنے ہاتھ پھیلانے سے بے نیاز کر دیتا ہے۔"
              ],
              "english": [
                "No power in the universe can stop what Allah intends to grant someone.",
                "Similarly, if Allah withholds something, no one can possibly provide it.",
                "This belief makes a person independent of seeking favors from people."
              ]
            }
          },
          {
            "title": {
              "urdu": "صرف اللہ پر بھروسہ",
              "english": "Relying Solely on Allah"
            },
            "content": {
              "urdu": [
                "انسان کا اصل بھروسہ صرف اللہ کی ذات اور اس کے فیصلے پر ہونا چاہیے۔",
                "ظاہری اسباب کے بجائے مسبب الاسباب پر نظر رکھنا ہی توکل ہے۔",
                "یہ دعا بندے کے دل میں سکون اور اطمینان پیدا کرتی ہے۔"
              ],
              "english": [
                "A person's true reliance should be only on Allah and His decrees.",
                "Focusing on the Creator rather than the means is the true trust.",
                "This supplication instills peace and tranquility within the servant's heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دنیاوی جاہ و جلال کی حقیقت",
        "english": "Reality of Worldly Status"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال و دولت کی بے وقعتی",
              "english": "Worthlessness of Wealth"
            },
            "content": {
              "urdu": [
                "اللہ کے سامنے کسی کا مال، مرتبہ یا حسب و نسب کام نہیں آئے گا۔",
                "صرف تقویٰ اور نیک اعمال ہی اللہ کے ہاں بلندی کا معیار ہیں۔",
                "امارت اور دنیوی طاقت اللہ کے عذاب سے کسی کو نہیں بچا سکتی۔"
              ],
              "english": [
                "Before Allah, no one's wealth, status, or lineage will be of benefit.",
                "Only piety and righteous deeds are the standards of high ranks with Allah.",
                "Wealth and worldly power cannot protect anyone from Allah's punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقیقی نفع کا ذریعہ",
              "english": "Source of True Benefit"
            },
            "content": {
              "urdu": [
                "انسان کو اپنی محنت کے بجائے اللہ کے فضل پر امید رکھنی چاہیے۔",
                "دنیا کی کامیابی عارضی ہے، جبکہ اللہ کی رضا ابدی کامیابی ہے۔",
                "یہ دعا بندے کو تکبر سے بچاتی اور عاجزی کی طرف لاتی ہے۔"
              ],
              "english": [
                "Man should hope for Allah's grace rather than relying on his efforts.",
                "Worldly success is temporary, whereas Allah's pleasure is eternal success.",
                "This prayer saves the servant from pride and brings them toward humility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اذکارِ مسنونہ کی اہمیت",
        "english": "Importance of Masnoon Adhkar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فرض نماز کے بعد کا وقت",
              "english": "Time After Compulsory Prayer"
            },
            "content": {
              "urdu": [
                "فرض نماز کے فوراً بعد ذکر و اذکار کرنا بڑی فضیلت کا باعث ہے۔",
                "نبی ﷺ کا مستقل معمول تھا کہ آپ ان کلمات کو باقاعدگی سے پڑھتے۔",
                "یہ وقت دعا کی قبولیت اور اللہ کے قرب کا بہترین موقع ہے۔"
              ],
              "english": [
                "Performing Adhkar immediately after Fard prayer carries great virtue.",
                "It was the Prophet's regular practice to recite these words consistently.",
                "This time is an excellent opportunity for acceptance of Dua and proximity."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی مداومت",
              "english": "Consistency in Sunnah"
            },
            "content": {
              "urdu": [
                "مسنون دعاؤں کو یاد کرنا اور ان پر عمل کرنا ہر مسلمان کی ضرورت ہے۔",
                "اذکار سے دل کو اطمینان ملتا ہے اور شیطانی وسوسوں سے حفاظت ہوتی ہے۔",
                "اپنی زندگی کو سنت کے مطابق ڈھالنا ہی دارین کی کامیابی ہے۔"
              ],
              "english": [
                "Memorizing and practicing Masnoon prayers is a necessity for every Muslim.",
                "Adhkar bring peace to the heart and protection from satanic whispers.",
                "Molding one's life according to the Sunnah is success in both worlds."
              ]
            }
          }
        ]
      }
    }
  ]
}
