{
  "hadithId": 350,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/210"],
    "kitabId": 2,
    "inKitabBab": 11,
    "arabicBook": "كتاب الصلاة - باب صلاة المسافر والمريض",
    "babId": 21
  },
  
  "takhreej": {
    "arabic": "ضعيف.‏ رواه الطبراني في الأوسط (921)، والبيهقي (3/141). فيه ابن لهيعة وهو ضعيف، وأبو الزبير مدلس وقد عنعن. وله شاهد مرسل عن سعيد بن المسيب عند الشافعي والبيهقي.",
    "urdu": "ضعیف۔ اسے طبرانی نے 'الاوسط' میں اور بیہقی نے روایت کیا ہے۔ اس کی سند میں ابن لہيعہ ضعیف راوی ہے اور ابو الزبیر مدلس ہیں جنہوں نے سماع کی صراحت نہیں کی۔ تاہم اس کا مفہوم دیگر صحیح احادیث سے ثابت ہے۔",
    "english": "Weak. Reported by At-Tabarani in Al-Awsat (921) and Al-Baihaqi (3/141). It contains Ibn Lahi'ah, who is weak, and Abu al-Zubayr, who is a Mudallis. However, its meaning is supported by other authentic narrations."
  },
  "importantWords": [
    {
      "arabic": "أَسَاءُوا",
      "english": "Did evil / acted wrongly",
      "urdu": "برائی کی / برا کیا"
    },
    {
      "arabic": "اِسْتَغْفَرُوا",
      "english": "Sought forgiveness",
      "urdu": "بخشش مانگی"
    },
    {
      "arabic": "أَفْطَرُوا",
      "english": "Broke the fast / did not fast",
      "urdu": "روزہ نہیں رکھا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مومن کی دو بڑی خوبیوں کو اجاگر کرتی ہے: پہلا یہ کہ گناہ کے بعد فوراً توبہ کرنا، اور دوسرا یہ کہ اللہ کی طرف سے دی گئی رخصتوں (سفر میں قصر اور روزہ نہ رکھنے) کو خوشی سے قبول کرنا۔",
    "english": "This Hadith highlights two great qualities of a believer: promptly seeking repentance after a sin, and gracefully accepting the concessions provided by Allah (shortening prayer and not fasting during travel)."
  },
  "references": [
    {
      "arabic": "المعجم الأوسط للطبراني، رقم 921",
      "english": "Al-Mu'jam al-Awsat by At-Tabarani, No. 921"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "گناہ کے بعد استغفار کی اہمیت",
        "english": "Importance of Repentance After Sin"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسان اور خطا",
              "english": "Humans and Errors"
            },
            "content": {
              "urdu": [
                "انسان فطرتاً خطاکار ہے، لیکن بہترین خطاکار وہ ہیں جو فوراً توبہ کر لیں۔",
                "استغفار دل کو گناہوں کی سیاہی سے پاک کرتا ہے اور اللہ کی رحمت کو متوجہ کرتا ہے۔",
                "برائی پر اصرار کرنے کے بجائے عاجزی کا اظہار کرنا بندگی کا جوہر ہے۔"
              ],
              "english": [
                "Humans are naturally prone to error, but the best of those who err are those who repent immediately.",
                "Seeking forgiveness purifies the heart from the darkness of sins and attracts Allah's mercy.",
                "Expressing humility instead of persisting in wrongdoing is the essence of servitude."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سفر کی رخصتوں کو قبول کرنا",
        "english": "Accepting Travel Concessions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کا صدقہ",
              "english": "Allah's Charity"
            },
            "content": {
              "urdu": [
                "سفر میں نماز کو مختصر کرنا اور روزہ نہ رکھنا اللہ کی طرف سے بندوں کے لیے ایک تحفہ (صدقہ) ہے۔",
                "اللہ تعالیٰ کو یہ پسند ہے کہ اس کی دی ہوئی رخصتوں پر عمل کیا جائے، جیسے وہ یہ پسند کرتا ہے کہ اس کے احکامات مانے جائیں۔",
                "رخصت پر عمل نہ کرنا بسا اوقات تکبر یا خود پسندی کی علامت بن سکتا ہے، اس لیے سنت کی پیروی ہی میں بہتری ہے۔"
              ],
              "english": [
                "Shortening the prayer and not fasting during travel is a gift (charity) from Allah to His servants.",
                "Allah loves for His concessions to be used, just as He loves for His commandments to be followed.",
                "Refusing a concession can sometimes stem from pride, so following the Sunnah is always best."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بہترین امت کے اوصاف",
        "english": "Qualities of the Best of the Ummah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال اور اتباع",
              "english": "Moderation and Adherence"
            },
            "content": {
              "urdu": [
                "بہترین لوگ وہ ہیں جو دین میں سختی کرنے کے بجائے اللہ کے بتائے ہوئے آسان راستے پر چلتے ہیں۔",
                "دین پر عمل کرنے میں اعتدال اور سنتِ نبوی ﷺ کی مکمل اتباع ہی اصل کامیابی ہے۔"
              ],
              "english": [
                "The best people are those who follow the easy path prescribed by Allah rather than imposing undue hardship in religion.",
                "Moderation in practicing religion and complete adherence to the Sunnah of the Prophet (ﷺ) is the true success."
              ]
            }
          }
        ]
      }
    }
  ]
}