{
  "hadithId": 705,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3462"
    ],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
 
  "takhreej": {
    "arabic": "صحيح بطرقه. رواه أبو داود (3462)، وأحمد (4825) وصححه ابن القطان وابن تيمية والشوكاني والألباني.",
    "urdu": "یہ حدیث اپنے مختلف طرق کی وجہ سے صحیح ہے۔ اسے ابوداؤد (3462) اور احمد نے روایت کیا ہے۔ ابن قطان، علامہ شوکانی اور علامہ البانی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic) due to its multiple chains. Reported by Abu Dawud (3462) and Ahmad (4825). Authenticated by Ibn al-Qattan, Ibn Taymiyyah, and Al-Albani."
  },
  "importantWords": [
    {
      "arabic": "الْعِينَةِ",
      "english": "'Inah transaction",
      "urdu": "بیع عینہ (سود کا ایک حیلہ)"
    },
    {
      "arabic": "أَذْنَابَ اَلْبَقَرِ",
      "english": "Tails of oxen",
      "urdu": "بیلوں کی دمیں (کاشتکاری کی علامت)"
    },
    {
      "arabic": "ذُلًّا",
      "english": "Disgrace / Humiliation",
      "urdu": "ذلت اور رسوائی"
    },
    {
      "arabic": "لَا يَنْزِعُهُ",
      "english": "Will not withdraw it",
      "urdu": "اسے دور نہیں کرے گا"
    },
    {
      "arabic": "تَرْجِعُوا",
      "english": "You return",
      "urdu": "تم واپس پلٹ جاؤ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں امتِ مسلمہ کے زوال کے اسباب بیان کیے گئے ہیں: مشتبہ سودی معاملات، دنیا پرستی، اور جدوجہد (جہاد) کو چھوڑ دینا۔ اس ذلت سے نکلنے کا واحد راستہ دینِ اسلام کی طرف حقیقی رجوع ہے۔",
    "english": "This Hadith highlights the causes of the Muslim Ummah's decline: engaging in usurious deals, excessive worldly attachment (materialism), and abandoning Jihad. The only remedy is a sincere return to the practice of the religion."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3462)",
      "english": "Sunan Abi Dawud (3462)"
    },
    {
      "arabic": "مسند أحمد (4825)",
      "english": "Musnad Ahmad (4825)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0O5vXJ4Xm4",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیع عینہ اور معاشی بگاڑ",
        "english": "The 'Inah Sale and Economic Decay"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیع عینہ کا مفہوم",
              "english": "Definition of 'Inah Sale"
            },
            "content": {
              "urdu": [
                "بیع عینہ یہ ہے کہ ایک شخص کوئی چیز ادھار مہنگے داموں بیچ کر وہی چیز نقد سستے داموں واپس خرید لے۔",
                "یہ بظاہر تجارت نظر آتی ہے مگر درحقیقت سود (Interest) کا ایک حیلہ اور طریقہ ہے۔",
                "اسلامی معیشت میں حیلوں کے ذریعے حرام کو حلال کرنے کی سخت ممانعت ہے۔"
              ],
              "english": [
                "Inah sale involves selling an item on credit for a high price and buying it back for cash at a lower price.",
                "Outwardly it looks like trade, but it is effectively a legal trick to hide a usurious loan.",
                "Islamic economics strictly prohibits using loopholes to make forbidden things appear permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "سودی نظام کے اثرات",
              "english": "Effects of Usurious Systems"
            },
            "content": {
              "urdu": [
                "سودی حیلے معاشرے میں پیداواری صلاحیت کو ختم کر دیتے ہیں۔",
                "جب لوگ بغیر محنت کے رقم سے رقم کمانے کے عادی ہو جائیں تو معیشت کھوکھلی ہو جاتی ہے۔",
                "یہ عمل معاشی برکت کو ختم کر کے امت پر ذلت مسلط کرنے کا پہلا زینہ ہے۔"
              ],
              "english": [
                "Usurious tricks destroy the productivity of a society.",
                "When people get used to making money from money without real labor, the economy hollows out.",
                "This practice removes economic blessings and is the first step toward collective disgrace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دنیا پرستی اور جہاد کا ترک",
        "english": "Materialism and Abandoning Jihad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیلوں کی دمیں پکڑنا",
              "english": "Following the Tails of Oxen"
            },
            "content": {
              "urdu": [
                "اس سے مراد دنیا کے معاشی دھندوں میں اس قدر غرق ہو جانا کہ فرائض بھلا دیے جائیں۔",
                "زراعت اور تجارت بذاتِ خود مباح ہیں، مگر جب یہ مقصدِ زندگی بن جائیں تو وبال بن جاتی ہیں۔",
                "دنیا کی محبت (Wahn) ہی وہ کمزوری ہے جو دشمنوں کو دلیر بناتی ہے۔"
              ],
              "english": [
                "This refers to being so engrossed in worldly gains that one neglects primary obligations.",
                "Agriculture and trade are permissible, but they become a liability when they become the sole purpose of life.",
                "The love of the world (Al-Wahn) is the weakness that emboldens enemies."
              ]
            }
          },
          {
            "title": {
              "urdu": "عزت کا راستہ: جہاد",
              "english": "The Path to Honor: Jihad"
            },
            "content": {
              "urdu": [
                "جہاد کو ترک کرنے کا مطلب حق کی سربلندی کے لیے جدوجہد اور قربانی کا جذبہ ختم ہو جانا ہے۔",
                "جو قوم آرام طلبی اور بزدلی کا شکار ہو جائے، ذلت اس کا مقدر بن جاتی ہے۔",
                "جہاد اسلام کی چوٹی (سنام الاسلام) ہے، اسے چھوڑنے سے پوری عمارت لرز جاتی ہے۔"
              ],
              "english": [
                "Abandoning Jihad means losing the spirit of struggle and sacrifice for the sake of truth.",
                "Any nation that falls prey to ease-seeking and cowardice is destined for humiliation.",
                "Jihad is the pinnacle of Islam (Sanam al-Islam); abandoning it causes the whole structure to tremble."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ذلت کا علاج: رجوع الی الدین",
        "english": "Remedy for Disgrace: Returning to Deen"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین کی طرف واپسی",
              "english": "Return to the Religion"
            },
            "content": {
              "urdu": [
                "ذلت سے نکلنے کا واحد حل یہ ہے کہ امت مجموعی طور پر اللہ کے احکامات کی طرف لوٹ آئے۔",
                "رجوع الی الدین کا مطلب عقیدہ، عمل اور لین دین میں اسلام کو نافذ کرنا ہے۔",
                "جب تک مسلمانوں کا اللہ پر بھروسہ اور دین پر عمل نہیں ہوگا، ظاہری اسباب کام نہیں آئیں گے۔"
              ],
              "english": [
                "The only solution to escape disgrace is for the Ummah to collectively return to Allah's commands.",
                "Returning to the Deen means implementing Islam in belief, action, and transactions.",
                "Until Muslims trust Allah and practice the Deen, material means alone will not help."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی توبہ کی ضرورت",
              "english": "The Need for Collective Repentance"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک معاشی اور سماجی نسخہ ہے جو موجودہ دور کے حالات پر بھی صادق آتا ہے۔",
                "انفرادی اصلاح کے ساتھ ساتھ معاشی نظام کی اسلامی بنیادوں پر تطہیر ضروری ہے۔",
                "اللہ کی مدد اسی وقت آتی ہے جب انسان اپنی حالت بدلنے کی مخلصانہ کوشش کرے۔"
              ],
              "english": [
                "This Hadith is an economic and social prescription that holds true even for modern times.",
                "Along with individual reformation, the purification of the economic system on Islamic foundations is vital.",
                "Allah's help only comes when people make a sincere effort to change their condition."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشتبہ مال سے بچنا",
              "english": "Avoiding Doubtful Wealth"
            },
            "content": {
              "urdu": [
                "تجارت میں شارٹ کٹ اور دھوکہ دہی کے طریقوں سے دور رہنا چاہیے۔",
                "قلیل حلال مال کثیر حرام سے کہیں زیادہ بابرکت اور پائیدار ہے۔",
                "تاجروں کو چاہیے کہ وہ اپنی تجارت کے شرعی مسائل سے واقف ہوں۔"
              ],
              "english": [
                "One must stay away from shortcuts and deceptive methods in trade.",
                "A small amount of Halal wealth is much more blessed and lasting than massive Haram gains.",
                "Merchants should be well-acquainted with the Sharia rulings of their business."
              ]
            }
          },
          {
            "title": {
              "urdu": "توازن برقرار رکھنا",
              "english": "Maintaining Balance"
            },
            "content": {
              "urdu": [
                "معیشت اور عبادات کے درمیان توازن قائم کرنا ایک مومن کا کمال ہے۔",
                "دنیا کمائیں مگر اسے دل میں جگہ نہ دیں اور اسے دین پر غالب نہ آنے دیں۔",
                "اسلامی غیرت اور حمیت کو ہر وقت بیدار رکھنا چاہیے۔"
              ],
              "english": [
                "A believer's perfection lies in balancing economic pursuits and worship.",
                "Earn the world, but do not let it enter your heart or overpower your faith.",
                "Islamic honor and zeal should be kept alive at all times."
              ]
            }
          }
        ]
      }
    }
  ]
}