{
  "hadithId": 1037,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/10/4"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6824). وتمامه أن النبي صلى الله عليه وسلم سأله بلفظ صريح عن الجماع فأقر، فأمر برجمه.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری نے اسے روایت کیا ہے۔ اس کا مکمل واقعہ یہ ہے کہ جب ماعز نے زنا کا اعتراف کیا تو آپ ﷺ نے شک دور کرنے کے لیے مختلف سوالات کیے، جب جرم قطعی ثابت ہو گیا تب رجم کا حکم دیا۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (6824). The full report states that the Prophet (ﷺ) asked him explicit questions to ensure no misunderstanding of the act occurred; only after his clear confession was the order for stoning given."
  },
  "importantWords": [
    {
      "arabic": "لَعَلَّكَ",
      "english": "Perhaps / Maybe",
      "urdu": "شاید کہ تم نے"
    },
    {
      "arabic": "قَبَّلْتَ",
      "english": "You kissed",
      "urdu": "تم نے بوسہ لیا"
    },
    {
      "arabic": "غَمَزْتَ",
      "english": "You touched / winked",
      "urdu": "تم نے چھوا یا اشارہ کیا"
    },
    {
      "arabic": "نَظَرْتَ",
      "english": "You looked",
      "urdu": "تم نے دیکھا"
    },
    {
      "arabic": "رَجْم",
      "english": "Stoning to death",
      "urdu": "سنگسار کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ثابت ہوتا ہے کہ حدود کے معاملات میں شبہات دور کرنے کے لیے تحقیق کرنا اور مجرم کو توبہ یا بچاؤ کا موقع دینا سنتِ نبوی ہے۔",
    "english": "This Hadith demonstrates the Prophetic method of thoroughly questioning a self-confessed offender to ensure no ambiguity exists before implementing Hudud."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6824)",
      "english": "Reported by Al-Bukhari (6824)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_I_OqXb8vM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدود میں تحقیق کا اصول",
        "english": "Principle of Investigation in Hudud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شک کا فائدہ مجرم کو دینا",
              "english": "Giving Benefit of Doubt"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے ماعز کو بار بار موقع دیا کہ شاید وہ کوئی چھوٹا گناہ کر بیٹھا ہو۔",
                "اسلامی قانون میں حدود کو شبہات کی بنیاد پر ساقط کرنے کی ترغیب دی گئی ہے۔",
                "آپ ﷺ کا مقصد یہ تھا کہ اگر حد سے بچنے کی کوئی گنجائش ہو تو وہ نکل آئے۔"
              ],
              "english": [
                "The Prophet (ﷺ) gave Ma'iz repeated chances to clarify if it was a lesser sin.",
                "Islamic law encourages averting legal penalties (Hudud) in case of ambiguities.",
                "The Prophet's intent was to find any possible excuse to waive the severe penalty."
              ]
            }
          },
          {
            "title": {
              "urdu": "صرف اعتراف کافی نہیں",
              "english": "Confession Alone is Not Enough"
            },
            "content": {
              "urdu": [
                "محض ایک بار کہنے پر آپ ﷺ نے سزا کا حکم جاری نہیں فرمایا۔",
                "آپ ﷺ نے اس کی ذہنی حالت اور فعل کی حقیقت کے بارے میں تفصیلی سوالات کیے۔",
                "عدل کا تقاضا ہے کہ سزا دینے سے پہلے جرم کا وقوع سو فیصد یقینی ہو۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not order the punishment upon the very first confession.",
                "He inquired about Ma'iz's mental state and the physical nature of the act.",
                "Justice requires absolute certainty of the crime before executing a sentence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ستر پوشی اور توبہ",
        "english": "Concealment and Repentance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہوں کو چھپانا",
              "english": "Concealing Sins"
            },
            "content": {
              "urdu": [
                "اسلام گناہگار کو اپنے گناہ پر پردہ ڈالنے اور توبہ کرنے کی تلقین کرتا ہے۔",
                "نبی کریم ﷺ نے ماعز کو اشاروں میں توبہ کر کے لوٹ جانے کا موقع دیا۔",
                "معاشرے میں بے حیائی کی تشہیر کے بجائے انفرادی اصلاح کو پسند کیا گیا ہے۔"
              ],
              "english": [
                "Islam encourages sinners to conceal their faults and seek private repentance.",
                "The Prophet (ﷺ) implicitly offered Ma'iz the chance to turn back and repent.",
                "Individual reform is preferred over the public advertisement of immorality."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعترافِ جرم کی فضیلت",
              "english": "Virtue of Confession"
            },
            "content": {
              "urdu": [
                "ماعز رضی اللہ عنہ کا بار بار اعتراف ان کے سچے جذبہ توبہ کی دلیل تھا۔",
                "انہوں نے دنیاوی سزا کو آخرت کے عذاب پر ترجیح دی تاکہ پاک ہو جائیں۔",
                "نبی ﷺ نے بعد میں ان کی توبہ کی تعریف کی کہ وہ سب کے لیے کافی ہے۔"
              ],
              "english": [
                "Ma'iz's (RA) persistent confession proved his sincere desire for purification.",
                "He preferred worldly punishment over the hereafter's torment to be cleansed.",
                "The Prophet (ﷺ) later praised his repentance as being sufficient for a nation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قاضی کی ذمہ داری",
        "english": "Responsibility of the Judge"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نرمی اور شفقت",
              "english": "Leniency and Compassion"
            },
            "content": {
              "urdu": [
                "قاضی کو چاہیے کہ وہ مجرم کو بچنے کا راستہ بتانے میں سختی نہ کرے۔",
                "نبی ﷺ کا اندازِ تخاطب ماعز کے ساتھ انتہائی رحیمانہ اور ہمدردانہ تھا۔",
                "سزا دینا مقصودِ اصلی نہیں بلکہ حدود اللہ کا قیام اور پاکیزگی مقصود ہے۔"
              ],
              "english": [
                "A judge should not be harsh but rather facilitate ways to avoid Hudud.",
                "The Prophet's manner of addressing Ma'iz was exceptionally merciful.",
                "Punishment is not the ultimate goal; rather, it is sanctity and legal order."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقیقتِ حال کی تلاش",
              "english": "Seeking the Truth"
            },
            "content": {
              "urdu": [
                "زنا کے مقدمے میں الفاظ کے ہیر پھیر سے بچنے کے لیے صراحت ضروری ہے۔",
                "آپ ﷺ نے اس سے پوچھا کہ کیا تم نے صرف چھوا یا دیکھا تو نہیں؟",
                "یہ باریک بینی نظامِ عدل میں معصوموں کے تحفظ کی ضمانت فراہم کرتی ہے۔"
              ],
              "english": [
                "In adultery cases, explicit clarity is required to avoid linguistic ambiguity.",
                "The Prophet (ﷺ) asked if he had merely touched or looked at the woman.",
                "This legal precision ensures the protection of the innocent in the justice system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی اسباق",
        "english": "Social and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پاکدامنی کی اہمیت",
              "english": "Importance of Chastity"
            },
            "content": {
              "urdu": [
                "نظر بازی اور بوس و کنار زنا کے ابتدائی زینے ہیں جن سے بچنا لازم ہے۔",
                "نبی ﷺ نے ان چھوٹے گناہوں کا ذکر کر کے ان کی سنگینی کی طرف اشارہ کیا۔",
                "پاکیزہ معاشرے کی بنیاد حیا اور شرم و لحاظ پر قائم ہوتی ہے۔"
              ],
              "english": [
                "Wandering gazes and physical intimacy are steps toward the grave sin of adultery.",
                "By mentioning these, the Prophet (ﷺ) alluded to their serious consequences.",
                "A pure society is built upon the foundations of modesty and self-restraint."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا خوفِ خدا",
              "english": "Companions' Fear of Allah"
            },
            "content": {
              "urdu": [
                "صحابہ کرام اپنے گناہوں سے پاک ہونے کے لیے خود کو پیش کر دیتے تھے۔",
                "ان کا ایمان اتنا مضبوط تھا کہ وہ موت کو گناہ کے ساتھ جینے پر ترجیح دیتے۔",
                "یہ واقعہ ہمیں اپنے گناہوں کی تلافی اور اللہ کی طرف رجوع کا سبق دیتا ہے۔"
              ],
              "english": [
                "The Companions would present themselves for punishment to be purified.",
                "Their faith was so strong they preferred death over living with a major sin.",
                "This incident teaches us to rectify our mistakes and return to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}