{
  "hadithId": 351,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bukhari:1117"],
    "kitabId": 2,
    "inKitabBab": 11,
    "arabicBook": "كتاب تقصير الصلاة",
    "babId": 21
  },
 
  "takhreej": {
    "arabic": "صحيح. أخرجه البخاري (1117). وفي رواية النسائي زيادة: \"فإن لم تستطع فمستلقياً، لا يكلف الله نفساً إلا وسعها\".",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (1117) نے اسے اپنی صحیح میں روایت کیا ہے۔ امام نسائی کی روایت میں یہ اضافہ بھی ہے: ”اگر اس کی بھی استطاعت نہ ہو تو چت لیٹ کر پڑھو، اللہ کسی جان پر اس کی طاقت سے زیادہ بوجھ نہیں ڈالتا۔“",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1117). An-Nasa'i added: 'If you are unable (to pray on your side), then pray lying on your back. Allah does not burden a soul beyond its capacity.'"
  },
  "importantWords": [
    {
      "arabic": "قَائِمًا",
      "english": "Standing",
      "urdu": "کھڑے ہو کر"
    },
    {
      "arabic": "قَاعِدًا",
      "english": "Sitting",
      "urdu": "بیٹھ کر"
    },
    {
      "arabic": "عَلَى جَنْبٍ",
      "english": "On the side",
      "urdu": "پہلو کے بل (لیٹ کر)"
    },
    {
      "arabic": "بَوَاسِيرُ",
      "english": "Hemorrhoids / Piles",
      "urdu": "بواسیر کا مرض"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیماری اور معذوری کی حالت میں نماز ادا کرنے کے درجات کو بیان کرتی ہے کہ شریعت میں ہر حال میں نماز کی ادائیگی ضروری ہے، مگر جسمانی استطاعت کے مطابق طریقہ کار میں رعایت دی گئی ہے۔",
    "english": "This Hadith outlines the levels of performing prayer during illness or disability. It emphasizes that prayer is mandatory in all circumstances, but the method is adjusted based on physical capacity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1117)",
      "english": "Sahih al-Bukhari (1117)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمران بن حصين",
        "english": "Imran bin Husain"
      },
      "slug": "imran-bin-husain"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیمار کی نماز کے احکام",
        "english": "Prayer Rulings for the Sick"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قیام کی فرضیت اور رخصت",
              "english": "Obligation and Concession of Standing"
            },
            "content": {
              "urdu": [
                "فرض نماز میں کھڑا ہونا (قیام) ایک رکن ہے، لیکن اگر بیماری کی وجہ سے کھڑا ہونا دشوار ہو یا مرض بڑھنے کا خطرہ ہو تو بیٹھ کر پڑھنا جائز ہے۔",
                "بیٹھ کر نماز پڑھنے والا اپنی استطاعت کے مطابق رکوع اور سجدہ کرے گا، اگر زمین پر سجدہ نہ کر سکے تو اشارے سے کرے گا۔",
                "اگر بیٹھنے کی بھی سکت نہ ہو تو دائیں پہلو پر قبلہ رخ ہو کر لیٹ کر نماز پڑھی جائے گی۔"
              ],
              "english": [
                "Standing (Qiyam) is a pillar of obligatory prayer, but if illness makes it difficult or risks worsening the condition, sitting is permissible.",
                "One praying while sitting should perform Ruku and Sujud normally if possible; otherwise, gestures (Isharah) should be used.",
                "If sitting is impossible, the prayer is offered lying on the right side facing the Qibla."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دینِ اسلام کی آسانی",
        "english": "The Ease of Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کسی حال میں معاف نہیں",
              "english": "Prayer is Never Waived"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ جب تک انسان کا ہوش و حواس قائم ہیں، نماز معاف نہیں ہے۔",
                "طریقہ کار میں تبدیلی کی اجازت 'تيسير' (آسانی پیدا کرنا) کے اصول پر مبنی ہے۔",
                "اگر کوئی شخص لیٹ کر بھی اشارے سے نماز نہیں پڑھ سکتا تو بعض فقہاء کے نزدیک وہ آنکھوں یا دل کے ارادے سے نماز ادا کرے گا۔"
              ],
              "english": [
                "This Hadith clarifies that as long as a person is conscious, prayer is not excused.",
                "The change in posture is based on the principle of 'Taysir' (making things easy).",
                "If even lying down with gestures is impossible, some jurists allow praying with eye movements or mental intention."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بہانے تراشی سے گریز",
              "english": "Avoiding Excuses"
            },
            "content": {
              "urdu": [
                "معمولی تکلیف یا سستی کی وجہ سے بیٹھ کر فرض نماز پڑھنا جائز نہیں ہے، اس سے نماز فاسد ہو سکتی ہے۔",
                "ہمیں چاہیے کہ صحت کی حالت میں اللہ کی عبادت کی قدر کریں اور بیماری میں بھی اسے ترک نہ کریں۔",
                "اللہ کی دی ہوئی رخصتوں سے فائدہ اٹھانا بھی اللہ کی محبت اور اطاعت کا حصہ ہے۔"
              ],
              "english": [
                "It is not permissible to pray obligatory prayers sitting due to minor pain or laziness; this may invalidate the prayer.",
                "We should value worship during health and remain steadfast even during illness.",
                "Utilizing Allah's concessions is a part of loving and obeying Him."
              ]
            }
          }
        ]
      }
    }
  ]
}