{
  "hadithId": 335,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["bukhari:636", "muslim:602"],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب الأذان",
    "babId": 20
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (636)‏، ومسلم (602)‏.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری اور امام مسلم دونوں نے روایت کیا ہے۔ یہ نماز کے لیے آنے کے آداب کے بارے میں ایک بنیادی ضابطہ ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (636) and Muslim (602). This is a foundational Hadith regarding the etiquettes of approaching the prayer."
  },
  "importantWords": [
    {
      "arabic": "السَّكِينَةُ",
      "english": "Calmness / Tranquility",
      "urdu": "اطمینان / ٹھہراؤ"
    },
    {
      "arabic": "الْوَقَارُ",
      "english": "Dignity / Solemnity",
      "urdu": "سنجیدگی / وقار"
    },
    {
      "arabic": "لَا تُسْرِعُوا",
      "english": "Do not rush / hurry",
      "urdu": "جلدی نہ کرو / دوڑو نہیں"
    },
    {
      "arabic": "فَأَتِمُّوا",
      "english": "Complete (it)",
      "urdu": "پس پورا کرو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا نچوڑ یہ ہے کہ نماز کے لیے دوڑ کر آنا منع ہے، بلکہ نمازی کو چاہیے کہ وہ نہایت سکون اور سنجیدگی سے مسجد آئے تاکہ اس کا خشوع برقرار رہے اور باقی ماندہ نماز وہ خود مکمل کر لے۔",
    "english": "The essence of this Hadith is the prohibition of rushing to the prayer. A worshiper should approach the mosque with tranquility and dignity to maintain focus (Khushu'), completing any missed parts individually afterward."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (636)",
      "english": "Sahih al-Bukhari (636)"
    },
    {
      "arabic": "صحيح مسلم (602)",
      "english": "Sahih Muslim (602)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز کی طرف آنے کے آداب",
        "english": "Etiquettes of Approaching Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سکینہ اور وقار کا مطلب",
              "english": "Meaning of Calmness and Dignity"
            },
            "content": {
              "urdu": [
                "سکینہ سے مراد حرکات میں ٹھہراؤ ہے، یعنی دوڑنے اور ہانپنے سے بچنا۔",
                "وقار سے مراد ظاہری ہیئت میں سنجیدگی، نظریں نیچی رکھنا اور آواز کو پست رکھنا ہے۔",
                "جب بندہ گھر سے نماز کی نیت سے نکلتا ہے تو وہ حالتِ نماز ہی میں شمار ہوتا ہے، اس لیے اسے باوقار رہنا چاہیے۔"
              ],
              "english": [
                "Sakina refers to tranquility in movement, avoiding running and panting.",
                "Waqar refers to solemnity in appearance, keeping the gaze lowered and voice quiet.",
                "Since a person is considered in a state of prayer as soon as they leave home for it, they should maintain dignity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جلدی اور عجلت کی ممانعت",
        "english": "Prohibition of Rushing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خشوع و خضوع کا تحفظ",
              "english": "Preserving Focus and Humility"
            },
            "content": {
              "urdu": [
                "دوڑ کر آنے سے انسان کی سانس پھول جاتی ہے، جس کی وجہ سے وہ نماز شروع کرتے ہی پوری یکسوئی حاصل نہیں کر پاتا۔",
                "اسلام ظاہری بھاگ دوڑ کے مقابلے میں باطنی سکون کو ترجیح دیتا ہے۔",
                "رکعت نکل جانے کے خوف سے سنت کے خلاف عمل کرنا ناپسندیدہ ہے۔"
              ],
              "english": [
                "Rushing causes breathlessness, preventing the worshiper from achieving immediate focus (Khushu') upon starting.",
                "Islam prioritizes internal peace over external haste.",
                "It is discouraged to act against the Sunnah out of fear of missing a Rak'ah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز مکمل کرنے کا طریقہ",
        "english": "Method of Completing missed units"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جو مل جائے وہی پہلا حصہ ہے",
              "english": "The portion caught is the start"
            },
            "content": {
              "urdu": [
                "امام کے ساتھ جو حصہ مل جائے وہ آپ کی نماز کا پہلا حصہ ہوگا (اکثر فقہاء کے نزدیک)۔",
                "امام کے سلام پھیرنے کے بعد بغیر کسی عجلت کے کھڑے ہو کر بقیہ نماز پوری کریں۔",
                "یہ حکم ہمیں یہ تسلی دیتا ہے کہ اگر ہم لیٹ بھی ہو جائیں تو ہماری نماز ضائع نہیں ہوتی۔"
              ],
              "english": [
                "The part caught with the Imam is considered the beginning of your prayer (according to most jurists).",
                "After the Imam finishes with Salam, stand up calmly to complete the remaining parts.",
                "This ruling provides reassurance that even if delayed, the prayer remains valid and rewardable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی پابندی اور ٹھہراؤ",
              "english": "Punctuality and Composure"
            },
            "content": {
              "urdu": [
                "بہترین صورت یہ ہے کہ اذان کے فوراً بعد مسجد کا رخ کیا جائے تاکہ بھاگنے کی نوبت ہی نہ آئے۔",
                "عبادت میں کوالٹی (کیفیت) کو کوانٹیٹی (رکعتوں کی گنتی) پر فوقیت دینی چاہیے۔",
                "زندگی کے دیگر معاملات میں بھی ہمیں عجلت پسندی کے بجائے وقار اور سکون کا راستہ اختیار کرنا چاہیے۔"
              ],
              "english": [
                "The ideal scenario is to head to the mosque immediately after the Adhan to avoid the need to rush.",
                "Prioritize the quality (focus) of worship over the quantity (catching every unit through haste).",
                "In all life matters, we should adopt dignity and composure over impulsive haste."
              ]
            }
          }
        ]
      }
    }
  ]
}