{
  "hadithId": 1081,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/2"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (3/124)، والنسائي (6/7)، والحاكم (2/81)، وأبو داود (2504)، والدارمي (2433). وصححه الألباني.",
    "urdu": "صحیح۔ اسے امام احمد (3/124)، نسائی (6/7)، حاکم (2/81) اور ابو داؤد (2504) نے روایت کیا ہے۔ علامہ البانی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (3/124), An-Nasa'i (6/7), Al-Hakim (2/81), Abu Dawud (2504), and Ad-Darimi (2433). Authenticated by Al-Albani."
  },
  "importantWords": [
    {
      "arabic": "جَاهِدُوا",
      "english": "Strive / Struggle",
      "urdu": "جہاد کرو / کوشش کرو"
    },
    {
      "arabic": "بِأَمْوَالِكُمْ",
      "english": "With your wealth",
      "urdu": "اپنے مالوں کے ساتھ"
    },
    {
      "arabic": "أَنْفُسِكُمْ",
      "english": "Your lives / selves",
      "urdu": "تمہاری جانیں"
    },
    {
      "arabic": "أَلْسِنَتِكُمْ",
      "english": "Your tongues",
      "urdu": "تمہاری زبانیں"
    },
    {
      "arabic": "الْمُشْرِكِينَ",
      "english": "Polytheists",
      "urdu": "مشرکین"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اللہ کی راہ میں کوشش (جہاد) کی مختلف اقسام بیان کی گئی ہیں جن میں مالی قربانی، جانی قربانی اور دعوت و زبان کے ذریعے دفاع شامل ہے۔",
    "english": "This Hadith outlines the three primary modes of Jihad (struggling for Allah's cause): through financial contribution, physical sacrifice, and intellectual or verbal defense."
  },
  "references": [
    {
      "arabic": "رواه أحمد (12268)",
      "english": "Narrated by Ahmad (12268)"
    },
    {
      "arabic": "رواه أبو داود (2504)",
      "english": "Narrated by Abu Dawud (2504)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جہاد کی ہمہ گیر وسعت",
        "english": "The Comprehensive Scope of Jihad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی جہاد کی اہمیت",
              "english": "Importance of Financial Jihad"
            },
            "content": {
              "urdu": [
                "مالی جہاد سے مراد اسلام کی سربلندی کے لیے اپنا حلال مال خرچ کرنا ہے۔",
                "اس میں دفاعی ساز و سامان کی فراہمی اور محتاجوں کی مدد شامل ہے۔",
                "قرآن میں اکثر مقامات پر جانی جہاد سے پہلے مالی جہاد کا ذکر آیا ہے۔"
              ],
              "english": [
                "Financial Jihad refers to spending one's lawful wealth for the supremacy of Islam.",
                "It includes providing defensive equipment and supporting the needy in times of conflict.",
                "In the Quran, financial struggle is often mentioned before physical struggle in many verses."
              ]
            }
          },
          {
            "title": {
              "urdu": "جانی جہاد کا مقام",
              "english": "The Status of Physical Jihad"
            },
            "content": {
              "urdu": [
                "جانی جہاد سے مراد اللہ کے دین کے دفاع میں اپنی جان پیش کر دینا ہے۔",
                "یہ قربانی کا بلند ترین درجہ ہے جسے شہادت کا مقام عطا کیا جاتا ہے۔",
                "میدانِ کارزار میں دشمن کے سامنے ڈٹ جانا دین کی حفاظت کی علامت ہے۔"
              ],
              "english": [
                "Physical Jihad involves offering one's life in the defense of Allah's religion.",
                "This is the highest level of sacrifice, often rewarded with the status of martyrdom.",
                "Standing firm against the enemy on the battlefield is a symbol of preserving the faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لسانی جہاد اور دفاعِ اسلام",
        "english": "Verbal Jihad and Defense of Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کے ذریعے دفاع",
              "english": "Defense via the Tongue"
            },
            "content": {
              "urdu": [
                "زبان کے جہاد میں اسلام کے خلاف اٹھنے والے اعتراضات کا جواب دینا شامل ہے۔",
                "اس میں تبلیغ، دعوت، شاعری اور قلم کے ذریعے حق کو واضح کرنا بھی آتا ہے۔",
                "نبی ﷺ نے حضرت حسان بن ثابت کو اپنی شاعری سے مشرکین کا جواب دینے کا حکم دیا۔"
              ],
              "english": [
                "Jihad of the tongue includes refuting misconceptions and attacks against Islam.",
                "It encompasses preaching, dawah, and using literature to clarify the truth.",
                "The Prophet (ﷺ) encouraged Hassan bin Thabit to respond to the polytheists through poetry."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی اور فکری جنگ",
              "english": "Intellectual and Ideological Warfare"
            },
            "content": {
              "urdu": [
                "موجودہ دور میں میڈیا اور انٹرنیٹ کے ذریعے حق کی آواز پہنچانا لسانی جہاد ہے۔",
                "دلیل اور منطق سے دشمن کے نظریاتی حملوں کو ناکام بنانا وقت کی اہم ضرورت ہے۔",
                "زبان کا صحیح استعمال دلوں کو فتح کرنے اور باطل کو مٹانے کا طاقتور ذریعہ ہے۔"
              ],
              "english": [
                "In modern times, using media and the internet to spread the truth is a form of verbal Jihad.",
                "Defeating the enemy's ideological attacks with logic is a crucial need of the hour.",
                "The correct use of speech is a powerful tool to conquer hearts and erase falsehood."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جہاد کے تقاضے اور حکمت",
        "english": "Requirements and Wisdom of Jihad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاص کی شرط",
              "english": "Condition of Sincerity"
            },
            "content": {
              "urdu": [
                "جہاد کی ہر قسم میں نیت کا خالص ہونا اور صرف اللہ کی رضا مطلوب ہے۔",
                "بغیر اخلاص کے کی گئی کوئی بھی کوشش اللہ کے ہاں قبولیت نہیں پاتی۔",
                "مال، جان یا زبان کا استعمال شہرت کے لیے نہیں بلکہ دین کے لیے ہونا چاہیے۔"
              ],
              "english": [
                "Sincerity of intention and seeking only Allah's pleasure is required in every form of Jihad.",
                "Any effort made without sincerity finds no acceptance in the sight of Allah.",
                "The use of wealth, life, or speech should be for religion, not for personal fame."
              ]
            }
          },
          {
            "title": {
              "urdu": "مجموعی جدوجہد",
              "english": "Collective Effort"
            },
            "content": {
              "urdu": [
                "امت کے ہر فرد پر اس کی استطاعت کے مطابق کوئی نہ کوئی ذمہ داری عائد ہوتی ہے۔",
                "جس کے پاس مال ہے وہ مال سے، اور جو علم رکھتا ہے وہ زبان سے خدمت کرے۔",
                "یہ حدیث ایک مربوط سماجی نظام کی عکاسی کرتی ہے جہاں ہر کوئی اپنا کردار ادا کرتا ہے۔"
              ],
              "english": [
                "Every individual in the Ummah has a responsibility according to their capability.",
                "One with wealth should contribute financially, and one with knowledge should use their speech.",
                "This Hadith reflects a cohesive social system where everyone plays their designated part."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انفرادی ذمہ داری",
              "english": "Individual Responsibility"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے وسائل کو اسلام کی پہچان بہتر بنانے کے لیے وقف کرنا چاہیے۔",
                "اپنی گفتگو میں باطل نظریات کی نفی اور حق کی حمایت کو شعار بنانا چاہیے۔",
                "معاشرے میں خیر پھیلانے کے لیے مالی تعاون کو عادت بنانا ضروری ہے۔"
              ],
              "english": [
                "We must dedicate our resources to improving the global perception of Islam.",
                "We should make it our practice to refute false ideologies and support truth in our speech.",
                "Making financial cooperation a habit is essential for spreading goodness in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط اور اطاعت",
              "english": "Discipline and Obedience"
            },
            "content": {
              "urdu": [
                "جہاد کے تمام مراحل اسلامی حکومت اور نظم و ضبط کے تابع ہونے چاہئیں۔",
                "بغیر کسی نظم کے انفرادی کارروائیاں اکثر فتنے کا باعث بنتی ہیں۔",
                "شریعت کے اصولوں کے مطابق جدوجہد کرنا ہی حقیقی کامیابی کا راستہ ہے۔"
              ],
              "english": [
                "All stages of Jihad must be subject to Islamic authority and discipline.",
                "Individual actions without proper organizational structure often lead to chaos.",
                "Struggling according to the principles of Sharia is the only path to true success."
              ]
            }
          }
        ]
      }
    }
  ]
}