{
  "hadithId": 122,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["1:122"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": " صحيح.  رواه مسلم (302) ولفظه: عَنْ أَنَسٍ؛ أَنَّ اَلْيَهُودَ كَانُوا إِذَا حَاضَتْ اَلْمَرْأَةُ فِيهِمْ، لَمْ يُؤَاكِلُوهَا، وَلَمْ يُجَامِعُوهُنَّ فِي اَلْبُيُوتِ، فَسَأَلَ أَصْحَابُ اَلنَّبِيِّ صلى الله عليه وسلم اَلنَّبِيَّ صلى الله عليه وسلم، فَأَنْزَلَ اَللَّهُ تَعَالَى: ﴿وَيَسْأَلُونَكَ عَنِ اَلْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا اَلنِّسَاءَ فِي اَلْمَحِيضِ﴾ إِلَى آخِرِ اَلْآيَةِ، فَقَالَ رَسُولُ اَللَّهِ صلى الله عليه وسلم: \"اِصْنَعُوا كُلَّ شَيْءٍ إِلَّا اَلنِّكَاحَ\" فَبَلَغَ ذَلِكَ اَلْيَهُودَ، فَقَالُوا: مَا يُرِيدُ هَذَا اَلرَّجُلُ أَنْ يَدَعَ مِنْ أَمْرِنَا شَيْئًا إِلَّا خَالَفَنَا فِيهِ.  فَجَاءَ أُسَيْدُ بْنُ حُضَيْرٍ وَعَبَّادُ بْنُ بِشْرٍ فَقَالَا: يَا رَسُولَ اَللَّهِ! إِنَّ اَلْيَهُودَ تَقُولُ: كَذَا وَكَذَا.  فَلَا نُجَامِعُهُنَّ؟ فَتَغَيَّرَ وَجْهُ رَسُولِ اَللَّهِ صلى الله عليه وسلم حَتَّى ظَنَنَّا أَنْ قَدْ وَجَدَ عَلَيْهِمَا، فَخَرَجَا، فَاسْتَقْبَلَهُمَا هَدِيَةٌ مِنْ لَبَنٍ إِلَى اَلنَّبِيِّ صلى الله عليه وسلم، فَأَرْسَلَ فِي آثَارِهِمَا، فَسَقَاهُمَا، فَعَرَفَا أَنْ لَمْ يَجِدْ عَلَيْهِمَا.  وَمَعْنَى \"وَجَدَ\": غَضِبَ. ",
    "urdu": "صحیح (درست) روایت۔ اسے مسلم (302) نے ان الفاظ کے ساتھ روایت کیا ہے: انس رضی اللہ عنہ سے کہ یہودیوں کی عادت تھی کہ جب ان میں سے کوئی عورت حائضہ ہوتی تو وہ اس کے ساتھ کھاتے پیتے نہیں تھے اور نہ ہی گھروں میں ان کے ساتھ رہتے تھے، تو صحابہ نے نبی اکرم ﷺ سے سوال کیا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی: \"اور وہ آپ سے حیض کے بارے میں پوچھتے ہیں، کہہ دیجیے کہ وہ گندگی ہے، لہٰذا حیض کے ایام میں عورتوں سے کنارہ کش رہو\" (البقرۃ: 222)۔ پھر رسول اللہ ﷺ نے فرمایا: \"ہمبستری کے علاوہ ہر چیز کرو۔\" یہ بات یہودیوں کو پہنچی تو انہوں نے کہا: یہ شخص ہماری کوئی چیز نہیں چھوڑنا چاہتا مگر اس میں ہماری مخالفت کرتا ہے۔ اس پر اسید بن حُضیر اور عباد بن بِشر نے آ کر عرض کیا: یا رسول اللہ! یہودی تو یہ یہ کہہ رہے ہیں، تو کیا ہم ان سے بالکل میل جول چھوڑ دیں؟ (شدت اختیار کر لیں؟) تو رسول اللہ ﷺ کا چہرہ متغیر ہو گیا، یہاں تک کہ ہم نے گمان کیا کہ آپ ان پر ناراض ہوئے ہیں۔ وہ دونوں باہر نکلے تو انہیں نبی ﷺ کے لیے دودھ کا تحفہ ملا۔ آپ نے ان کے پیچھے آدمی بھیج کر انہیں دودھ پلایا، تو وہ جان گئے کہ آپ ان سے ناراض نہیں ہوئے۔ اور \"وَجَدَ\" کا معنی ہے: ناراض ہوا۔",
    "english": "Sahih (Authentic). Reported by Muslim (302) with the wording: Narrated Anas: The Jews, when a woman menstruated among them, would neither eat with her nor dwell with her in their houses. The Companions of the Prophet (PBUH) asked the Prophet (PBUH), so Allah revealed the verse: 'They ask you concerning menstruation. Say, 'It is an Adha (a harmful thing, a state of impurity), so keep away from women during menses...' (Al-Baqarah 2:222). The Messenger of Allah (PBUH) then said: 'Do everything except Nikah (sexual intercourse).' When this reached the Jews, they said: 'This man does not want to leave anything of our matter except that he contradicts us in it.' Then Usayd ibn Hudayr and Abbad ibn Bishr came and said: 'O Messenger of Allah! The Jews are saying such and such. Should we then avoid them completely (including non-sexual acts)?' The face of the Messenger of Allah (PBUH) changed until we thought he was angry with them. They left, and then received a gift of milk for the Prophet (PBUH). He sent someone after them and offered them some of the milk, so they knew that he was not angry with them. 'Wajad' (وجد) means: was angry."
  },
  "importantWords": [
    {
      "arabic": "اَلْيَهُودَ",
      "english": "The Jews",
      "urdu": "یہودی"
    },
    {
      "arabic": "حَاضَتْ",
      "english": "She menstruated",
      "urdu": "اسے حیض آیا"
    },
    {
      "arabic": "لَمْ يُؤَاكِلُوهَا",
      "english": "They would not eat with her",
      "urdu": "وہ اس کے ساتھ نہیں کھاتے تھے"
    },
    {
      "arabic": "اَلنِّكَاحَ",
      "english": "Nikah (Sexual intercourse)",
      "urdu": "ہمبستری"
    },
    {
      "arabic": "اِصْنَعُوا كُلَّ شَيْءٍ",
      "english": "Do everything",
      "urdu": "ہر چیز کرو"
    },
    {
      "arabic": "اَلْمَحِيضِ",
      "english": "Menses/Menstruation",
      "urdu": "حیض"
    },
    {
      "arabic": "اِعْتَزِلُوا",
      "english": "Keep away/Separate yourselves",
      "urdu": "کنارہ کش رہو"
    },
    {
      "arabic": "أَذًى",
      "english": "Harm/Impurity",
      "urdu": "گندگی/تکلیف"
    }
  ],
  "summary": {
    "urdu": "یہودیوں کے برعکس جو حیض والی عورتوں سے مکمل لاتعلقی اختیار کر لیتے تھے، نبی اکرم ﷺ نے واضح فرمایا کہ حیض کی حالت میں عورتوں سے صرف جماع (ہمبستری) کرنا حرام ہے، جبکہ ان کے ساتھ کھانا پینا، رہنا سہنا اور دیگر تمام افعال جائز ہیں۔",
    "english": "In contrast to the Jews who completely isolated menstruating women, the Prophet ﷺ clarified that during menses, only sexual intercourse (Nikah) is prohibited, while all other actions such as eating, dwelling together, and general interaction are permissible."
  },
  "references": [
    {
      "arabic": "رواه مسلم (302)",
      "english": "Reported by Muslim (302)"
    }
  ],
  "narrators": [
    {
      "id": 12201,
      "name": {
        "arabic": "أَنَسُ بْنُ مَالِكٍ",
        "english": "Anas ibn Malik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیض میں اسلامی رخصت",
        "english": "Islamic Concession During Menses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یہودیوں کی شدت",
              "english": "Strictness of the Jews"
            },
            "content": {
              "urdu": [
                "یہودیوں کا طریقہ تھا کہ حیض والی عورت کو نجس سمجھتے اور اس سے مکمل معاشرتی بائیکاٹ کرتے تھے۔",
                "وہ عورتوں کے ساتھ ایک برتن میں کھانا نہیں کھاتے تھے اور انہیں گھروں سے دور رکھتے تھے۔",
                "یہودیوں کا یہ عمل اسلام کے اصولِ آسانی کے منافی تھا، اس لیے اسلام نے اس سے منع کیا۔"
              ],
              "english": [
                "The Jewish practice was to consider a menstruating woman impure and enforce complete social isolation from her.",
                "They would neither share food with the women nor allow them to dwell in the same space.",
                "This Jewish practice contradicted the Islamic principle of ease, hence Islam forbade it."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کا حکم اور میانہ روی",
              "english": "Islamic Ruling and Moderation"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے حیض کو 'أذًی' (تکلیف یا گندگی) قرار دیا اور صرف ہمبستری سے منع فرمایا۔",
                "نبی اکرم ﷺ نے فرمایا: \"ہمبستری کے علاوہ ہر چیز کرو۔\" جو اسلام کی میانہ روی کو ظاہر کرتا ہے۔",
                "یہ حکم عورت کے حیض کے باوجود اس کی عزت اور معاشرتی حقوق کو برقرار رکھتا ہے۔"
              ],
              "english": [
                "Allah the Exalted described menses as 'Adha' (harm or impurity) and only prohibited sexual intercourse.",
                "The Prophet ﷺ said: 'Do everything except Nikah,' which demonstrates the moderation of Islam.",
                "This ruling upholds the honor and social rights of the woman despite her being in menses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدود اور استثنا",
        "english": "Boundaries and Exception"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممنوع فعل (جماع)",
              "english": "The Prohibited Act (Intercourse)"
            },
            "content": {
              "urdu": [
                "حیض کی حالت میں بیوی سے جماع کرنا نصِ قرآنی اور حدیث کی رو سے حرام اور گناہ کبیرہ ہے۔",
                "ممنوعیت کی وجہ حیض کے خون کی نجاست اور عورت کے لیے جسمانی تکلیف ہے۔",
                "یہ حکم حکمتِ الٰہی پر مبنی ہے اور اس میں مرد و عورت دونوں کے لیے طبی فوائد ہیں۔"
              ],
              "english": [
                "Sexual intercourse with one's wife during menses is prohibited (Haram) by the Qur'an and Sunnah and is a major sin.",
                "The prohibition is due to the impurity of menstrual blood and potential physical harm to the woman.",
                "This ruling is based on Divine wisdom and holds medical benefits for both husband and wife."
              ]
            }
          },
          {
            "title": {
              "urdu": "جائز افعال",
              "english": "Permissible Acts"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے حکم کے مطابق، مباشرت (جماع) کے علاوہ عورت کے ساتھ ہر طرح کا میل جول جائز ہے۔",
                "میاں بیوی کا ایک ساتھ کھانا پینا، سونا، اور بوس و کنار کرنا جائز افعال میں شامل ہیں۔",
                "فقہاء نے پیٹ اور ناف کے درمیان کے حصے کے علاوہ باقی تمام بدن سے لطف اندوز ہونے کو جائز قرار دیا ہے۔"
              ],
              "english": [
                "According to the Prophet's command, all interactions with the wife, except sexual intercourse, are permissible.",
                "Husband and wife can eat, sleep together, and engage in intimacy (non-penetrative) during this time.",
                "Jurists generally permit enjoying all parts of the body except the area between the navel and the knees."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا غصہ اور حکمت",
        "english": "The Prophet's Anger and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا سوال اور غصہ",
              "english": "Companions' Inquiry and Anger"
            },
            "content": {
              "urdu": [
                "جب صحابہ نے یہودیوں کی مخالفت کے پیش نظر مزید سختی کے بارے میں سوال کیا، تو نبی ﷺ ناراض ہوئے۔",
                "ناراضگی کی وجہ یہ تھی کہ وہ اسلام کی طرف سے دی گئی آسانی کے حکم کو چھوڑ کر دوبارہ شدت اختیار کر رہے تھے۔",
                "رسول اللہ ﷺ کی ناراضگی اس بات کی دلیل ہے کہ جائز رخصت کو قبول کرنا بھی شرعی حکم ہے۔"
              ],
              "english": [
                "When the Companions inquired about adopting further strictness due to the Jews' criticism, the Prophet ﷺ became angry.",
                "The reason for the displeasure was their tendency to reject the ease granted by Islam and revert to unnecessary strictness.",
                "The Prophet's anger proves that accepting a legitimate concession is also a religious commandment."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ رحمت",
              "english": "Wisdom of Mercy"
            },
            "content": {
              "urdu": [
                "بعد میں دودھ پلا کر نبی ﷺ نے واضح کیا کہ وہ ان کے سوال کرنے پر غصے میں نہیں تھے۔",
                "نبی ﷺ کا چہرہ متغیر ہونا اسلام میں شدت اختیار کرنے سے آپ کی شدید ناپسندیدگی کو ظاہر کرتا ہے۔",
                "یہ واقعہ سنت اور بدعت کے درمیان فرق کرنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "By offering them milk later, the Prophet clarified that he was not angry at their inquiry itself.",
                "His face changing color showed his strong dislike for adopting severity in Islam.",
                "This incident teaches us to differentiate between the Sunnah (Prophetic Way) and Bid'ah (innovation/unnecessary strictness)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاندانی اور معاشرتی سبق",
        "english": "Family and Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کی حیثیت",
              "english": "Status of the Woman"
            },
            "content": {
              "urdu": [
                "حیض کی حالت میں عورت کی حیثیت ایک بیمار کی سی ہے نہ کہ ایک نجس وجود کی۔",
                "اسلام نے حیض والی عورت کو معاشرتی طور پر الگ تھلگ کرنے کی ممانعت کر کے اس کی عزت برقرار رکھی۔",
                "یہ حکم میاں بیوی کے درمیان تعلقات کو قائم رکھنے اور پیار و محبت کو مضبوط کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "In the state of menses, the woman's status is like that of a sick person, not an impure entity.",
                "Islam maintained her honor by forbidding her social isolation, unlike other communities.",
                "This ruling serves as a means to sustain the relationship between husband and wife and strengthen love and affection."
              ]
            }
          },
          {
            "title": {
              "urdu": "شریعت کا جامعیت",
              "english": "Comprehensiveness of Sharia"
            },
            "content": {
              "urdu": [
                "اسلام یہودیوں کی طرح مکمل بے اعتنائی اور عیسائیوں کی طرح مکمل بے قیدی سے پاک ہے۔",
                "شریعت نے جنسی تعلق میں رکاوٹ لگا کر حد مقرر کی اور باقی تمام تعلقات کو بحال رکھا۔",
                "یہ اعتدال اور توازن اسلامی تعلیمات کا بنیادی عنصر ہے۔"
              ],
              "english": [
                "Islam avoids the extreme isolation of Judaism and the complete permissiveness of Christianity in this matter.",
                "Sharia set a boundary by prohibiting sexual relations while maintaining all other interactions.",
                "This balance and moderation are fundamental components of Islamic teachings."
              ]
            }
          }
        ]
      }
    }
  ]
}
