{
  "hadithId": 87,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 11"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب الطهارة",
    "babId": 7
  },

  "takhreej": {
    "arabic": " حسن.  رواه أبو داود (30) ، والترمذي (7) ، وابن ماجه (300) ، والنسائي في \"عمل اليوم والليلة\" (79) ، وأحمد (655) ، وابن حبان (1444) ، والحاكم (185) ، من حديث عائشة رضي الله عنها .",
    "urdu": "حسن (درجہ کی) روایت۔ اسے ابو داؤد (30)، ترمذی (7)، ابن ماجہ (300)، نسائی نے \"عمل اليوم والليلة\" (79)، احمد (655)، ابن حبان (1444)، اور حاکم (185) نے حضرت عائشہ رضی اللہ عنہا کی حدیث سے روایت کیا ہے۔",
    "english": "Hasan (Good) narration. Reported by Abu Dawud (30), At-Tirmidhi (7), Ibn Majah (300), An-Nasa'i in 'Amal Al-Yawm wa Al-Laylah' (79), Ahmad (655), Ibn Hibban (1444), and Al-Hakim (185), from the Hadith of 'A'ishah (may Allah be pleased with her)."
  },
  "importantWords": [
    {
      "arabic": "خَرَجَ",
      "english": "He came out",
      "urdu": "باہر آئے"
    },
    {
      "arabic": "الْغَائِطِ",
      "english": "The lavatory/place of relief",
      "urdu": "قضائے حاجت کی جگہ"
    },
    {
      "arabic": "غُفْرَانَكَ",
      "english": "I seek Your forgiveness",
      "urdu": "تیری بخشش"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Reported it",
      "urdu": "روایت کیا"
    },
    {
      "arabic": "الْخَمْسَةُ",
      "english": "The Five (Ahmad, Abu Dawud, Tirmidhi, Nasa'i, Ibn Majah)",
      "urdu": "پانچوں ائمہ"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "Authenticated it",
      "urdu": "صحیح قرار دیا"
    },
    {
      "arabic": "الْحَاكِم",
      "english": "Al-Hakim (The scholar)",
      "urdu": "حاکم (محدث)"
    },
    {
      "arabic": "الْحَمْدُ",
      "english": "All praise",
      "urdu": "سب تعریف"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے بعد بیت الخلاء سے باہر آتے وقت 'غفرانک' پڑھنے کی سنت کو بیان کرتی ہے، جس میں اللہ سے معافی طلب کی جاتی ہے۔",
    "english": "This Hadith describes the Prophet's Sunnah of saying 'Ghufranak' (I seek Your forgiveness) upon exiting the lavatory after relieving oneself, demonstrating humility and thankfulness to Allah."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (30)",
      "english": "Reported by Abu Dawud (30)"
    },
    {
      "arabic": "رواه الترمذي (7)",
      "english": "Reported by At-Tirmidhi (7)"
    },
    {
      "arabic": "رواه ابن ماجه (300)",
      "english": "Reported by Ibn Majah (300)"
    },
    {
      "arabic": "رواه النسائي في عمل اليوم والليلة (79)",
      "english": "Reported by An-Nasa'i in 'Amal Al-Yawm wa Al-Laylah' (79)"
    },
    {
      "arabic": "رواه أحمد (655)",
      "english": "Reported by Ahmad (655)"
    },
    {
      "arabic": "صححه أبو حاتم والحاكم",
      "english": "Authenticated by Abu Hatim and Al-Hakim"
    }
  ],
  "narrators": [
    {
      "id": 8701,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "'A'ishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "حسن",
    "english": "Good (Hasan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کا مفہوم اور حکمت",
        "english": "Meaning and Wisdom of the Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غفرانک کا معنی",
              "english": "The meaning of Ghufranak"
            },
            "content": {
              "urdu": [
                " 'غفرانک' کا مطلب ہے 'میں تیری بخشش طلب کرتا ہوں' یا 'تیری بخشش ہی مطلوب ہے۔'",
                "یہ دعا اس شکر کو ادا کرنے سے قاصر رہنے کی معافی کی درخواست ہے جو اس نعمت پر واجب تھا۔",
                "قضائے حاجت کے بعد فوراً اللہ کو یاد کرنا اس بات کا ثبوت ہے کہ مسلمان ہر حال میں اللہ کی طرف رجوع کرتا ہے۔"
              ],
              "english": [
                "'Ghufranak' means 'I seek Your forgiveness' or 'Your forgiveness is sought'.",
                "It is a request for pardon for being unable to render the proper thanks due for this great blessing.",
                "Remembering Allah immediately after relieving oneself proves that a Muslim turns to Allah in all circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "استغفار کی وجہ",
              "english": "Reason for seeking Forgiveness"
            },
            "content": {
              "urdu": [
                "بیت الخلاء میں داخل ہونے سے لے کر باہر آنے تک ذکر کرنے سے رکنا پڑتا ہے، جس پر استغفار کیا جاتا ہے۔",
                "یہ جسمانی آسانی اور صحت کی نعمت ہے جس پر شاید ہم مکمل شکر ادا نہیں کر پائے۔",
                "انسان کا ہر لمحہ اللہ کے ذکر میں گزرنا چاہیے، اور اس وقفے کی تلافی کے لیے مغفرت مانگی جاتی ہے۔"
              ],
              "english": [
                "One must abstain from remembering Allah from entering until exiting the lavatory, for which forgiveness is sought.",
                "It is a great blessing of physical ease and health for which we may have failed to offer complete gratitude.",
                "Every moment of a person's life should be spent in the remembrance of Allah, and forgiveness is sought to compensate for this brief pause."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور طبی فوائد",
        "english": "Juristic and Medical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فقہی استدلال",
              "english": "Juristic Derivation"
            },
            "content": {
              "urdu": [
                "فقہاء نے اس حدیث کی بنیاد پر قضائے حاجت کے بعد 'غفرانک' کہنا مستحب قرار دیا ہے۔",
                "یہ دعا طہارت کے مکمل ہونے اور نجاست کے دور ہونے کے بعد اللہ کی عظمت کا اعتراف ہے۔",
                "اس سنت پر عمل کرنا، آداب طہارت کی تکمیل اور ثواب کے حصول کا ذریعہ ہے۔"
              ],
              "english": [
                "Based on this Hadith, jurists consider it recommended (Mustahabb) to say 'Ghufranak' after relieving oneself.",
                "This supplication is an acknowledgment of Allah's greatness after completing purification and removing impurity.",
                "Practicing this Sunnah is a means of completing the etiquette of purification and gaining reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت کی قدر",
              "english": "Appreciation of Health"
            },
            "content": {
              "urdu": [
                "قضائے حاجت کا باآسانی مکمل ہونا صحت اور تندرستی کی عظیم نشانی اور اللہ کی نعمت ہے۔",
                "اگر یہ عمل مشکل ہو جائے تو انسان بیماری اور تکلیف میں مبتلا ہو جاتا ہے، لہٰذا اس نعمت پر شکر واجب ہے۔",
                "استغفار کے ذریعے انسان اپنی کمزوری کا اعتراف اور جسمانی صحت کی قدر کرتا ہے۔"
              ],
              "english": [
                "The smooth completion of relieving oneself is a great sign of health and a huge favor from Allah.",
                "If this process becomes difficult, a person is afflicted with illness and suffering, so gratitude for this blessing is obligatory.",
                "Through seeking forgiveness, a person acknowledges their weakness and appreciates the blessing of physical well-being."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیم و تربیت",
        "english": "Education and Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینی تعلیم کا دائرہ",
              "english": "Scope of Religious Education"
            },
            "content": {
              "urdu": [
                "یہ حدیث ظاہر کرتی ہے کہ اسلامی تعلیمات زندگی کے ہر چھوٹے سے چھوٹے پہلو کو محیط ہیں۔",
                "روزمرہ کے معمولات میں بھی اللہ کے ذکر اور دعا کی جگہ موجود ہے، جو ایمان کو مضبوط کرتی ہے۔",
                "مسلمانوں کی تربیت ان آداب پر ہوتی ہے جو ان کی دنیاوی و اخروی زندگی کو بہتر بنائیں۔"
              ],
              "english": [
                "This Hadith illustrates that Islamic teachings encompass every minute aspect of daily life.",
                "Remembrance and supplication to Allah have a place even in daily routines, strengthening one's faith.",
                "Muslims are trained on etiquettes that enhance their life in this world and the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "یاد الٰہی کا تسلسل",
              "english": "Continuity of Divine Remembrance"
            },
            "content": {
              "urdu": [
                "چونکہ بیت الخلا میں اللہ کا نام لینا ممنوع ہے، اس لیے باہر آتے ہی استغفار سے اس کمی کو پورا کیا جاتا ہے۔",
                "یہ سنت ہمیں سکھاتی ہے کہ اگر ذکر چھوٹ جائے تو فوراً تلافی کرنی چاہیے اور استغفار کو عادت بنا لینا چاہیے۔",
                "یہ عمل اللہ کے ساتھ تعلق کو تازہ دم رکھنے اور ہر حالت میں اس سے جوڑے رہنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Since mentioning Allah's name is forbidden inside the lavatory, seeking forgiveness immediately upon exiting compensates for this lapse.",
                "This Sunnah teaches us that if remembrance is missed, one should immediately make up for it and adopt the habit of seeking forgiveness.",
                "This act encourages maintaining a fresh connection with Allah and staying attached to Him in every situation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی اہمیت",
        "english": "Importance of Narration Chain (Isnad)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کا حسن درجہ",
              "english": "Hasan (Good) Grade of Hadith"
            },
            "content": {
              "urdu": [
                "محدثین نے اس روایت کو 'حسن' قرار دیا ہے، یعنی یہ عمل کے قابل اور مضبوط ہے۔",
                "ابو حاتم اور حاکم کی تصحیح اس حدیث کی قبولیت کو مزید مستحکم کرتی ہے۔",
                "علم اسماء الرجال کے اصولوں کے تحت اس کی سند کی جانچ مکمل طور پر کی گئی ہے۔"
              ],
              "english": [
                "Scholars of Hadith graded this narration as 'Hasan' (Good), meaning it is strong enough to be acted upon.",
                "The authentication by Abu Hatim and Al-Hakim further solidifies the acceptance of this Hadith.",
                "Its chain of narration has been thoroughly checked according to the principles of 'Ilm al-Rijal (Science of Narrators)."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی سنت",
              "english": "The Sunnah of the Prophet ﷺ"
            },
            "content": {
              "urdu": [
                "اس دعا کا نبی اکرم ﷺ کا ذاتی عمل ہونا اسے ایک سنت کے طور پر قائم کرتا ہے۔",
                "ہمیں ہر معاملے میں نبی ﷺ کی پیروی کرنے کی تعلیم دی گئی ہے، یہاں تک کہ ذاتی معاملات میں بھی۔",
                "مسلمان اس عمل سے اللہ کی رضا اور اس کے رسول ﷺ کی شفاعت کی امید رکھتے ہیں۔"
              ],
              "english": [
                "The fact that this supplication was the personal practice of the Prophet ﷺ establishes it as a definite Sunnah.",
                "We are taught to follow the Prophet ﷺ in all matters, even those concerning personal routines.",
                "Muslims adhere to this practice hoping for the pleasure of Allah and the intercession of His Messenger ﷺ."
              ]
            }
          }
        ]
      }
    }
  ]
}
