{
  "hadithId": 1294,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["tirmidhi:1995"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب البر والصلة",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "ضعيف. رواه الترمذي (1995)، والبخاري في الأدب المفرد (394). في سنده ليث بن أبي سليم، وهو ضعيف بسبب سوء حفظه واختلاطه.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے امام ترمذی (1995) اور امام بخاری نے الادب المفرد (394) میں روایت کیا ہے۔ اس کی سند میں لیث بن ابی سلیم ہیں جو حافظے کی کمزوری کی وجہ سے ضعیف قرار دیے گئے ہیں۔",
    "english": "Weak. Reported by At-Tirmidhi (1995) and Al-Bukhari in Al-Adab al-Mufrad (394). Its chain contains Layth bin Abi Sulaim, who is considered weak due to his poor memory."
  },
  "importantWords": [
    {
      "arabic": "لَا تُمَارِ",
      "english": "Do not argue",
      "urdu": "جھگڑا نہ کرو"
    },
    {
      "arabic": "لَا تُمَازِحْهُ",
      "english": "Do not joke with him",
      "urdu": "مذاق نہ کرو"
    },
    {
      "arabic": "تَعِدْهُ",
      "english": "Make a promise",
      "urdu": "وعدہ کرو"
    },
    {
      "arabic": "مَوْعِدًا",
      "english": "An appointment / promise",
      "urdu": "وعدہ / وقت"
    },
    {
      "arabic": "تُخْلِفَهُ",
      "english": "You break it",
      "urdu": "اس کی خلاف ورزی کرو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث معاشرتی تعلقات کو خوشگوار بنانے کے لیے تین اہم اصولوں (بحث و تکرار سے بچنا، دل آزار مذاق سے پرہیز اور وعدہ وفائی) کی تعلیم دیتی ہے۔",
    "english": "This Hadith teaches three essential social principles to maintain harmony: avoiding unnecessary arguments, refraining from hurtful jokes, and fulfilling promises."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1995)",
      "english": "Sunan at-Tirmidhi (1995)"
    },
    {
      "arabic": "الأدب المفرد للبخاري (394)",
      "english": "Al-Adab al-Mufrad by Bukhari (394)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=3-qW7eOQY0A",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بحث و مباحثہ کی ممانعت",
        "english": "Prohibition of Arguing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بے مقصد جھگڑے",
              "english": "Pointless Arguments"
            },
            "content": {
              "urdu": [
                "ایسی بحث جس کا مقصد صرف اپنی بڑائی ثابت کرنا ہو، منع ہے۔",
                "بلا ضرورت کی تکرار دلوں میں کدورت اور نفرت پیدا کرتی ہے۔",
                "حق پر ہونے کے باوجود بحث چھوڑنے والے کے لیے جنت کی خوشخبری ہے۔"
              ],
              "english": [
                "Arguments aimed solely at proving oneself superior are forbidden.",
                "Unnecessary disputation creates malice and hatred in hearts.",
                "There is a glad tiding of Paradise for one who leaves arguing even if right."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخوت پر اثر",
              "english": "Impact on Brotherhood"
            },
            "content": {
              "urdu": [
                "بحث و مباحثہ بھائی چارے کی بنیادوں کو کھوکھلا کر دیتا ہے۔",
                "اسلامی معاشرت میں ایک دوسرے کی رائے کا احترام ضروری ہے۔",
                "مومن وہ ہے جو تلخ کلامی کے بجائے نرم گفتگو کو ترجیح دے۔"
              ],
              "english": [
                "Argumentation hollows out the foundations of Islamic brotherhood.",
                "Respecting the opinions of others is vital in Islamic social life.",
                "A believer is one who prefers gentle speech over harsh words."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مذاق کے حدود",
        "english": "Boundaries of Joking"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکلیف دہ مذاق",
              "english": "Hurtful Jokes"
            },
            "content": {
              "urdu": [
                "ایسا مذاق جس سے دوسرے کی عزت نفس مجروح ہو، جائز نہیں ہے۔",
                "مذاق میں جھوٹ بولنا اور کسی کی تذلیل کرنا گناہ ہے۔",
                "نبی ﷺ بھی مذاق فرماتے تھے مگر اس میں صرف سچ ہوتا تھا۔"
              ],
              "english": [
                "Joking that hurts another person's self-esteem is not permissible.",
                "Lying and humiliating others for the sake of a joke is a sin.",
                "The Prophet (ﷺ) would joke, but he always spoke the truth."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال کی اہمیت",
              "english": "Importance of Moderation"
            },
            "content": {
              "urdu": [
                "کثرتِ مذاق سے انسان کا وقار ختم ہو جاتا ہے اور دل مردہ ہوتا ہے۔",
                "ہنسی مذاق میں حد سے گزرنا دشمنی کا سبب بن سکتا ہے۔",
                "سنجیدگی اور وقار ایک مسلمان کی شخصیت کا لازمی حصہ ہے۔"
              ],
              "english": [
                "Excessive joking diminishes a person's dignity and kills the heart.",
                "Exceeding limits in humor can lead to long-lasting enmity.",
                "Seriousness and dignity are essential parts of a Muslim's personality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وعدہ خلافی کی مذمت",
        "english": "Condemnation of Breaking Promises"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کی علامت",
              "english": "A Sign of Faith"
            },
            "content": {
              "urdu": [
                "وعدہ پورا کرنا مومن کی پہچان اور اسلامی اخلاق کا ستون ہے۔",
                "وعدہ خلافی کرنا منافق کی نشانیوں میں سے ایک علامت ہے۔",
                "اللہ تعالیٰ وعدہ وفائی کرنے والوں کو بہت پسند فرماتا ہے۔"
              ],
              "english": [
                "Fulfilling promises is the mark of a believer and a pillar of ethics.",
                "Breaking promises is listed among the specific signs of a hypocrite.",
                "Allah loves those who are faithful to their covenants and words."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اعتماد",
              "english": "Social Trust"
            },
            "content": {
              "urdu": [
                "وعدہ خلافی سے معاشرے میں باہمی اعتماد اور ساکھ ختم ہوتی ہے۔",
                "ایسا وعدہ ہی نہ کریں جسے پورا کرنے کی نیت یا استطاعت نہ ہو۔",
                "معاملات کی درستگی کے لیے زبان کا پکا ہونا نہایت ضروری ہے۔"
              ],
              "english": [
                "Breaking promises erodes mutual trust and reputation in society.",
                "One should not make a promise they lack the intent or ability to keep.",
                "Being true to one's word is essential for healthy social dealings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور سبق",
        "english": "Practical Training and Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "یہ تینوں برائیاں زبان کے غلط استعمال سے جنم لیتی ہیں۔",
                "زبان پر قابو پانا ہی فتنوں سے بچنے کا واحد راستہ ہے۔",
                "مستقل مزاجی سے اپنی گفتگو کا محاسبہ کرنا ضروری ہے۔"
              ],
              "english": [
                "All three of these evils stem from the misuse of the tongue.",
                "Controlling the tongue is the only way to avoid many tribulations.",
                "It is necessary to consistently audit one's own speech."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ معاشرت",
              "english": "Excellent Social Conduct"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے بتائے ہوئے اصولوں پر عمل سے معاشرہ جنت بن سکتا ہے۔",
                "ایک دوسرے کی دل آزاری سے بچنا سب سے بڑی نیکی ہے۔",
                "اعلیٰ اخلاق ہی قیامت کے دن میزان میں سب سے وزنی عمل ہوگا۔"
              ],
              "english": [
                "Following these Prophetic principles makes society harmonious.",
                "Refraining from hurting others' feelings is a great act of virtue.",
                "High morals will be the heaviest deed on the scale on Judgment Day."
              ]
            }
          }
        ]
      }
    }
  ]
}