{
  "hadithId": 594,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/16"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحج",
    "babId": 39
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1814)، والنسائي (5/162)، والترمذي (829)، وابن ماجه (2922)، وأحمد (4/55)، وابن حبان (3791). قال الترمذي: 'حسن صحيح'.",
    "urdu": "صحیح۔ اسے ابوداؤد، نسائی، ترمذی، ابن ماجہ اور احمد نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے اور یہ تلبیہ بلند آواز سے پکارنے کی بنیادی دلیل ہے۔",
    "english": "Sahih. Reported by Abu Dawud (1814), an-Nasa'i (5/162), at-Tirmidhi (829), Ibn Majah (2922), and Ahmad (4/55). At-Tirmidhi graded it as 'Hasan Sahih'."
  },
  "importantWords": [
    {
      "arabic": "أَتَانِي",
      "english": "Came to me",
      "urdu": "میرے پاس آئے"
    },
    {
      "arabic": "جِبْرِيلُ",
      "english": "Angel Jibreel",
      "urdu": "جبرائیل علیہ السلام"
    },
    {
      "arabic": "يَرْفَعُوا",
      "english": "They raise",
      "urdu": "وہ بلند کریں"
    },
    {
      "arabic": "أَصْوَاتَهُمْ",
      "english": "Their voices",
      "urdu": "اپنی آوازیں"
    },
    {
      "arabic": "الْإِهْلَالِ",
      "english": "Talbiyah / Raising voice",
      "urdu": "لبیک پکارنا / آواز بلند کرنا"
    }
  ],
  "summary": {
    "urdu": "حج اور عمرہ کے دوران مردوں کے لیے بلند آواز سے تلبیہ (لبیک) پکارنا سنتِ مؤکدہ اور شعائرِ حج میں سے ہے، جس کا حکم اللہ نے جبرائیل علیہ السلام کے ذریعے دیا۔",
    "english": "Raising the voice while reciting the Talbiyah (Labbayk) is a recommended Sunnah and a distinct rite of Hajj for men, commanded by Allah through Angel Jibreel."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1814)",
      "english": "Reported by Abu Dawud (1814)"
    },
    {
      "arabic": "رواه الترمذي (829)",
      "english": "Reported by At-Tirmidhi (829)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "السائب بن خلاد",
        "english": "As-Sa'ib bin Khallad"
      },
      "slug": "as-saib-bin-khallad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0hY53_wN73U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تلبیہ کی اہمیت اور شرعی حیثیت",
        "english": "Importance and Legal Status of Talbiyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شعائرِ حج کا اظہار",
              "english": "Manifestation of Hajj Rites"
            },
            "content": {
              "urdu": [
                "تلبیہ پکارنا حج اور عمرہ کے سب سے اہم شعائر اور پہچان میں سے ہے۔",
                "یہ بندے کی طرف سے اللہ کی پکار پر لبیک کہنے کا علی الاعلان اقرار ہے۔",
                "جبرائیل علیہ السلام کا اس کے لیے آنا اس عمل کی عظمت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Reciting the Talbiyah is among the most important symbols and identifiers of Hajj.",
                "It is a public declaration of the servant responding to Allah's call for pilgrimage.",
                "The involvement of Angel Jibreel highlights the greatness and sanctity of this act."
              ]
            }
          },
          {
            "title": {
              "urdu": "آواز بلند کرنے کی سنت",
              "english": "The Sunnah of Raising the Voice"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے مسنون ہے کہ وہ تلبیہ اتنی آواز سے پکاریں کہ سنا جائے۔",
                "صحابہ کرام تلبیہ پکارتے پکارتے تھک جاتے تھے اور ان کی آوازیں بیٹھ جاتی تھیں۔",
                "یہ عمل بندگی کے جوش اور جذبے کی عکاسی کرتا ہے۔"
              ],
              "english": [
                "It is Sunnah for men to recite the Talbiyah loudly enough to be clearly heard.",
                "The companions used to shout it until their voices became hoarse from exertion.",
                "This practice reflects the intense enthusiasm and passion of a servant's devotion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کے لیے تلبیہ کا حکم",
        "english": "Ruling for Women Regarding Talbiyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پردہ اور آواز کا لحاظ",
              "english": "Observing Modesty and Voice"
            },
            "content": {
              "urdu": [
                "خواتین کے لیے حکم یہ ہے کہ وہ تلبیہ پست آواز (دھیرے سے) پکاریں۔",
                "عورت کو اتنی آواز سے پکارنا چاہیے کہ صرف وہ خود یا اس کی ساتھی سن سکیں۔",
                "اسلامی احکامات میں خواتین کی حیا اور پردے کا خاص خیال رکھا گیا ہے۔"
              ],
              "english": [
                "The instruction for women is to recite the Talbiyah in a low and quiet voice.",
                "A woman should only speak loudly enough for herself or her companions to hear.",
                "Islamic rulings consistently prioritize modesty and the protection of women's privacy."
              ]
            }
          },
          {
            "title": {
              "urdu": "مردوں اور عورتوں میں فرق",
              "english": "Difference Between Men and Women"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے آواز بلند کرنا فضیلت ہے، جبکہ عورتوں کے لیے خاموشی میں عافیت ہے۔",
                "یہ تفریق عبادات کے مختلف پہلوؤں میں نظم و ضبط برقرار رکھنے کے لیے ہے۔",
                "عورت کا بلند آواز سے پکارنا غیر محرموں کے سامنے ناپسندیدہ قرار دیا گیا ہے۔"
              ],
              "english": [
                "For men, raising the voice is a virtue; for women, maintaining quietude is safety.",
                "This distinction exists to maintain order and etiquette in various aspects of worship.",
                "It is discouraged for a woman to shout in the presence of unrelated (non-mahram) men."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وحی اور جبرائیل علیہ السلام کا پیغام",
        "english": "Revelation and Jibreel's Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "براہِ راست الٰہی حکم",
              "english": "Direct Divine Command"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کو صحابہ کو حکم دینے کی تاکید اللہ کی طرف سے کی گئی۔",
                "یہ ثابت کرتا ہے کہ حج کے طریقے منجانب اللہ مقرر کردہ ہیں۔",
                "جبرائیل علیہ السلام کا بار بار آنا احکامات کی اہمیت کی نشاندہی کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was emphasized by Allah to command his companions in this manner.",
                "This proves that the rituals and methods of Hajj are divinely ordained by Allah.",
                "The frequent visits of Angel Jibreel indicate the high importance of these rulings."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کی اطاعت",
              "english": "Obedience of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے اس حکم پر ایسی شدت سے عمل کیا کہ ان کے گلے بیٹھ جاتے۔",
                "اتباعِ رسول ﷺ میں صحابہ کا جذبہ پوری امت کے لیے مشعلِ راہ ہے۔",
                "نبی ﷺ کے ہر چھوٹے بڑے حکم کی فوری تعمیل ہی صحابہ کا شیوہ تھا۔"
              ],
              "english": [
                "The companions followed this command so rigorously that their throats would become sore.",
                "Their zeal in following the Messenger (ﷺ) is a guiding light for the entire Ummah.",
                "Immediate compliance with every Prophetic command was the trademark of the companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکرِ الٰہی میں مستغرق ہونا",
              "english": "Being Engrossed in Dhikr"
            },
            "content": {
              "urdu": [
                "تلبیہ پکارنا انسان کو دنیا سے کاٹ کر اللہ کی طرف متوجہ کر دیتا ہے۔",
                "حاجی کو چاہیے کہ وہ سفر کے دوران فضول گفتگو کے بجائے ذکر میں رہے۔",
                "بلند آواز سے ذکر کرنا دوسروں کے لیے بھی ترغیب اور یاد دہانی بنتا ہے۔"
              ],
              "english": [
                "Reciting Talbiyah disconnects a person from the world and focuses them on Allah.",
                "The pilgrim should remain in Dhikr during travel instead of engaging in idle talk.",
                "Loud Dhikr serves as an inspiration and a reminder for others on the journey."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحاد اور یگانگت",
              "english": "Unity and Solidarity"
            },
            "content": {
              "urdu": [
                "جب ہزاروں لوگ ایک ہی کلمہ بلند آواز سے کہتے ہیں تو اتحاد کی فضا بنتی ہے۔",
                "یہ عمل امتِ مسلمہ کی طاقت اور توحید کے اقرار کا مظہر ہے۔",
                "حج کے ایام میں تمام تفریقیں مٹ کر بندگی کا ایک ہی رنگ نظر آتا ہے۔"
              ],
              "english": [
                "When thousands recite the same words aloud, it creates an atmosphere of unity.",
                "This act manifests the strength of the Muslim Ummah and its declaration of Tawhid.",
                "During Hajj, all distinctions fade away, leaving only the uniform color of servitude."
              ]
            }
          }
        ]
      }
    }
  ]
}