{
  "hadithId": 732,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/7/100"
    ],
    "kitabId": 7,
    "inKitabBab": 6,
    "arabicBook": "كتاب البيوع",
    "babId": 47
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (4404)، والترمذي (1584)، والنسائي (4630)، وابن ماجه (2541)، وأحمد (4/310)، وصححه ابن حبان والحاكم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد، ترمذی، نسائی، ابن ماجہ اور احمد نے روایت کیا ہے۔ امام ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔ یہ روایت فقہ میں بلوغت کی علامات کے تعین کے لیے ایک اہم بنیاد ہے۔",
    "english": "Sahih. Reported by Abu Dawud (4404), at-Tirmidhi (1584), an-Nasa'i (4630), Ibn Majah (2541), and Ahmad (4/310). It was graded Sahih by Ibn Hibban and al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "عُرِضْنَا",
      "english": "We were presented",
      "urdu": "ہمیں پیش کیا گیا"
    },
    {
      "arabic": "أَنْبَتَ",
      "english": "Grown (pubic hair)",
      "urdu": "بال اگ آئے (بالغ ہو گیا)"
    },
    {
      "arabic": "خُلِّيَ سَبِيلُهُ",
      "english": "He was let go",
      "urdu": "اس کا راستہ چھوڑ دیا گیا / رہا کر دیا گیا"
    },
    {
      "arabic": "قُرَيْظَةَ",
      "english": "Banu Qurayzah",
      "urdu": "بنو قریظہ (مدینہ کا ایک یہودی قبیلہ)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ شرعی احکامات اور سزاؤں کے نفاذ کے لیے 'بلوغت' ایک بنیادی شرط ہے، اور زیرِ ناف بالوں کا اگنا بلوغت کی ایک معتبر طبعی علامت ہے۔",
    "english": "This Hadith establishes that 'puberty' is a fundamental condition for legal accountability and the application of Sharia penalties, and the growth of pubic hair is recognized as a physical sign of maturity."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الحدود",
      "english": "Sunan Abi Dawud, Book of Prescribed Punishments"
    },
    {
      "arabic": "جامع الترمذي، كتاب السير",
      "english": "Jami' at-Tirmidhi, Book of Military Expeditions"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عطية القرظي",
        "english": "Atiyah al-Qurazi"
      },
      "slug": "atiyah-al-qurazi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p7U_pG_2Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بلوغت اور قانونی ذمہ داری",
        "english": "Puberty and Legal Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچوں کے لیے رعایت",
              "english": "Exemption for Children"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں بچے (نابالغ) اپنی غلطیوں پر اس طرح جوابدہ نہیں ہوتے جیسے بڑے ہوتے ہیں۔",
                "بنو قریظہ کے جنگی مجرموں کے خلاف فیصلے کے وقت بھی بچوں کو الگ کر دیا گیا۔",
                "یہ نبی ﷺ کی رحمت اور عدل کی علامت ہے کہ جنگی حالات میں بھی معصوموں کا خون نہیں بہایا گیا۔"
              ],
              "english": [
                "In Islamic law, minors are not held accountable for their actions in the same manner as adults.",
                "Even during the judgment against Banu Qurayzah, children were separated and spared.",
                "This reflects the Prophet's (ﷺ) mercy and justice, ensuring innocent lives were protected even in war."
              ]
            }
          },
          {
            "title": {
              "urdu": "بلوغت کی علامت کے طور پر بالوں کا اگنا",
              "english": "Hair Growth as a Sign of Maturity"
            },
            "content": {
              "urdu": [
                "زیرِ ناف بال (عانہ) کا اگنا بلوغت کی ایک قطعی جسمانی علامت تسلیم کی گئی ہے۔",
                "اگر کسی کی عمر کا صحیح علم نہ ہو تو ان طبعی علامات سے فیصلہ کیا جاتا ہے۔",
                "امام احمد اور اسحاق بن راہویہ کے نزدیک یہ علامت بلوغت کا شرعی ثبوت ہے۔"
              ],
              "english": [
                "The growth of pubic hair is recognized as a definitive physical sign of puberty.",
                "If a person's exact age is unknown, these physical signs are used to determine legal status.",
                "According to Imam Ahmad and Ishaq bin Rahwayh, this sign is sufficient Sharia proof of maturity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بنو قریظہ کے فیصلے کا پس منظر",
        "english": "Background of the Banu Qurayzah Judgment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میثاقِ مدینہ کی خلاف ورزی",
              "english": "Breach of the Treaty of Medina"
            },
            "content": {
              "urdu": [
                "بنو قریظہ نے غزوہ خندق کے دوران مسلمانوں سے غداری کی اور دشمنوں کا ساتھ دیا۔",
                "انہوں نے اپنی مرضی سے سیدنا سعد بن معاذ کو اپنا منصف (جج) چنا تھا۔",
                "سعد بن معاذ نے ان کی اپنی مذہبی کتاب (تورات) کے مطابق غداری کی سزا سنائی۔"
              ],
              "english": [
                "Banu Qurayzah betrayed the Muslims during the Battle of the Trench by siding with the enemies.",
                "They voluntarily chose Sa'd bin Mu'adh (RA) to be the arbitrator for their case.",
                "Sa'd bin Mu'adh passed the judgment according to the laws of their own scripture (Torah) regarding treason."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور انسانی حقوق",
        "english": "Juristic Wisdom and Human Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انفرادی ذمہ داری",
              "english": "Individual Accountability"
            },
            "content": {
              "urdu": [
                "اسلام میں 'جرمِ ضعیفی' یا اجتماعی سزا کا تصور نہیں، ہر شخص اپنے فعل کا ذمہ دار ہے۔",
                "جو لوگ شعور کی حد تک نہیں پہنچے تھے، انہیں قبیلے کے جرم کی سزا نہیں دی گئی۔",
                "یہ حدیث اسلامی نظامِ عدل میں بچوں کے حقوق کے تحفظ کی بہترین مثال ہے۔"
              ],
              "english": [
                "Islam does not support collective punishment; every individual is responsible for their own actions.",
                "Those who had not reached the age of discernment were not punished for the tribe's crime.",
                "This Hadith serves as an excellent example of protecting children's rights in the Islamic judicial system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حالات کی تحقیق",
              "english": "Verification of Facts"
            },
            "content": {
              "urdu": [
                "کسی پر بھی حکم لگانے سے پہلے اس کی اہلیت اور حقیقت کی جانچ کرنا ضروری ہے۔",
                "انصاف کے تقاضوں کو پورا کرنے کے لیے ہر پہلو پر باریک بینی سے غور کرنا چاہیے۔",
                "مسلمان کو چاہیے کہ وہ ہر معاملے میں عدل و انصاف کا دامن تھامے رکھے۔"
              ],
              "english": [
                "It is essential to verify a person's eligibility and the facts before passing a judgment.",
                "To fulfill the requirements of justice, every aspect must be scrutinized carefully.",
                "A Muslim should uphold justice and equity in every situation."
              ]
            }
          }
        ]
      }
    }
  ]
}