{
  "hadithId": 645,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:1809"],
    "kitabId": 6,
    "inKitabBab": 6,
    "arabicBook": "كتاب الحج",
    "babId": 41
  },
  
  "takhreej": {
    "arabic": "صحيح البخاري (1809)، كتاب العمرة، باب ما استيسر من الهدي",
    "urdu": "صحیح بخاری (1809)، کتاب العمرہ، باب: جو قربانی میسر آئے اس کا بیان۔",
    "english": "Sahih al-Bukhari (1809), Book of 'Umrah, Chapter: What is easy of the sacrificial animals."
  },
  "importantWords": [
    {
      "arabic": "أُحْصِرَ",
      "english": "Prevented/Restricted",
      "urdu": "روک دیا گیا"
    },
    {
      "arabic": "فَحَلَقَ",
      "english": "He shaved",
      "urdu": "پس سر منڈوایا"
    },
    {
      "arabic": "نَحَرَ",
      "english": "He sacrificed",
      "urdu": "قربانی کی"
    },
    {
      "arabic": "هَدْيَهُ",
      "english": "His sacrificial animal",
      "urdu": "اپنا ہدی (قربانی کا جانور)"
    },
    {
      "arabic": "عَامًا قَابِلًا",
      "english": "Following year",
      "urdu": "آنے والا سال"
    },
    {
      "arabic": "جَامَعَ",
      "english": "Had relations",
      "urdu": "جماع / تعلق قائم کیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس شخص کے لیے شرعی حکم بیان کرتی ہے جو احرام باندھنے کے بعد دشمن یا کسی رکاوٹ کی وجہ سے عمرہ یا حج مکمل نہ کر سکے۔",
    "english": "This Hadith explains the legal ruling for a person in Ihram who is prevented from completing Hajj or Umrah due to an external constraint."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1809)",
      "english": "Reported by Al-Bukhari (1809)"
    },
    {
      "arabic": "فتح الباري شرح صحيح البخاري",
      "english": "Fath al-Bari Sharh Sahih al-Bukhari"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FmYjIAnYyXo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احصار کا مفہوم",
        "english": "Concept of Ihsar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راستے میں رکاوٹ کا حکم",
              "english": "Ruling on being hindered"
            },
            "content": {
              "urdu": [
                "اگر کوئی حاجی یا معتمر راستے میں کسی دشمن یا مجبوری کی وجہ سے رک جائے تو اسے 'محصر' کہتے ہیں۔",
                "نبی کریم صلی اللہ علیہ وسلم کو حدیبیہ کے مقام پر مشرکین نے مکہ جانے سے روک دیا تھا۔",
                "ایسی صورت میں احرام کھولنا اور قربانی کرنا شریعت کا حکم ہے۔"
              ],
              "english": [
                "If a pilgrim is stopped by an enemy or necessity, they are termed 'Muhsar'.",
                "The Prophet (PBUH) was stopped at Al-Hudaybiyyah by the Mushrikeen.",
                "In such a case, exiting Ihram and offering a sacrifice is the prescribed law."
              ]
            }
          },
          {
            "title": {
              "urdu": "حلال ہونے کا طریقہ",
              "english": "Method of exiting Ihram"
            },
            "content": {
              "urdu": [
                "محصر شخص اسی جگہ قربانی ذبح کرے گا جہاں اسے روکا گیا ہے۔",
                "قربانی کے بعد سر منڈوانا یا بال کٹوانا ضروری ہے تاکہ احرام سے باہر آ سکے۔",
                "اس کے بعد وہ تمام کام حلال ہو جاتے ہیں جو احرام میں حرام تھے۔"
              ],
              "english": [
                "The restricted person should sacrifice the animal at the spot where they were stopped.",
                "Shaving or cutting the hair is necessary after the sacrifice to exit Ihram.",
                "Following this, all actions prohibited during Ihram become permissible again."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ازواج سے تعلق اور قضأ",
        "english": "Relations and Replacement"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احرام سے مکمل آزادی",
              "english": "Full freedom from Ihram"
            },
            "content": {
              "urdu": [
                "حدیث میں 'جامع نساءہ' سے مراد یہ ہے کہ آپ مکمل طور پر احرام کی پابندیوں سے نکل گئے تھے۔",
                "قربانی اور حلق کے بعد نکاح اور زوجیت کے تعلقات دوبارہ جائز ہو جاتے ہیں۔",
                "یہ اس بات کی دلیل ہے کہ احصار کی وجہ سے احرام مکمل طور پر ختم ہو جاتا ہے۔"
              ],
              "english": [
                "The phrase 'had relations' signifies total exit from the restrictions of Ihram.",
                "After sacrifice and shaving, marital relations become lawful again.",
                "This proves that Ihsar (restriction) allows for a complete termination of Ihram state."
              ]
            }
          },
          {
            "title": {
              "urdu": "قضا عمرہ کی ضرورت",
              "english": "Necessity of a replacement Umrah"
            },
            "content": {
              "urdu": [
                "نبی کریم صلی اللہ علیہ وسلم نے اگلے سال اس عمرہ کی قضا کی جسے 'عمرۃ القضاء' کہا جاتا ہے۔",
                "اکثر فقہاء کے نزدیک جو عمرہ یا حج فوت ہو جائے اس کی قضا لازم ہے۔",
                "یہ اللہ کے گھر کی حرمت اور عبادت کی تکمیل کی اہمیت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) performed the Umrah the following year, known as 'Umrat al-Qada'.",
                "Most jurists agree that a missed Hajj or Umrah due to restriction must be made up.",
                "This highlights the sanctity of Allah's house and the importance of completing worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل و استدلال",
        "english": "Juristic Issues and Reasoning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قربانی کا مقام",
              "english": "Place of Sacrifice"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک قربانی وہیں ہوگی جہاں انسان کو روکا گیا ہو۔",
                "امام ابوحنیفہ کے نزدیک قربانی کا جانور حدودِ حرم میں بھیجنا ضروری ہے۔",
                "یہ حدیث امام شافعی کے موقف کی تائید کرتی ہے کیونکہ حدیبیہ حرم سے باہر ہے۔"
              ],
              "english": [
                "According to Ash-Shafi'i and Ahmad, the sacrifice is done where the person is stopped.",
                "Imam Abu Hanifa views that the sacrifice must be sent to the boundaries of the Haram.",
                "This Hadith supports Shafi'i's view as Hudaybiyyah is outside the Haram limits."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی اور سہولت",
              "english": "Ease and Facility"
            },
            "content": {
              "urdu": [
                "اسلامی شریعت میں مشقت کے وقت آسانی کا اصول کارفرما ہے۔",
                "عبادت کی تکمیل میں رکاوٹ پر اللہ نے بندوں پر بوجھ نہیں ڈالا۔",
                "قربانی کا فدیہ دے کر عبادت سے باعزت نکلنے کا راستہ دیا گیا ہے۔"
              ],
              "english": [
                "Islamic Sharia operates on the principle of ease during hardship.",
                "Allah does not burden servants when they are prevented from completing worship.",
                "A respectful exit from worship is provided through the ransom of sacrifice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تاریخی پس منظر",
        "english": "Historical Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صلح حدیبیہ کا واقعہ",
              "english": "The Treaty of Hudaybiyyah"
                },
            "content": {
              "urdu": [
                "یہ واقعہ سن 6 ہجری میں پیش آیا جب چودہ سو صحابہ ساتھ تھے۔",
                "صحابہ کرام اس وقت شدید غمزدہ تھے کہ وہ بیت اللہ کی زیارت نہ کر سکے۔",
                "نبی کریم صلی اللہ علیہ وسلم کے عمل نے صحابہ کو صبر اور اطاعت کا درس دیا۔"
              ],
              "english": [
                "This occurred in 6 AH with fourteen hundred companions present.",
                "The companions were deeply saddened at being unable to visit the Ka'bah.",
                "The Prophet's (PBUH) actions taught the companions patience and obedience."
              ]
            }
          },
          {
            "title": {
              "urdu": "اطاعتِ رسول کی اہمیت",
              "english": "Importance of Obeying the Messenger"
            },
            "content": {
              "urdu": [
                "جب صحابہ تذبذب میں تھے تو آپ صلی اللہ علیہ وسلم نے خود پہلے قربانی کی۔",
                "آپ کے عمل کو دیکھ کر تمام صحابہ نے بھی اپنے سر منڈوائے اور قربانی کی۔",
                "یہ ثابت کرتا ہے کہ قول سے زیادہ عمل اثر انگیز ہوتا ہے۔"
              ],
              "english": [
                "When the companions hesitated, the Prophet (PBUH) performed the sacrifice first.",
                "Seeing his action, all companions shaved their heads and offered sacrifice.",
                "This proves that practical actions are more influential than mere words."
              ]
            }
          }
        ]
      }
    }
  ]
}