{
  "hadithId": 898,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/88"],
    "kitabId": 8,
    "inKitabBab": 5,
    "arabicBook": "كتاب النكاح",
    "babId": 68
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5085)، ومسلم (1365). الأنطاع: جمع نطع وهو بساط من الجلد. والأقط: لبن يابس يطبخ به.",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (5085) اور امام مسلم (1365) نے روایت کیا ہے۔ یہ حدیث سفر میں ولیمہ کرنے اور کھانے کی سادگی پر دلالت کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5085) and Muslim (1365). It highlights the permissibility of hosting a Walima during a journey and using simple, available food."
  },
  "importantWords": [
    {
      "arabic": "يُبْنَى عَلَيْهِ",
      "english": "Consummated the marriage",
      "urdu": "رخصتی / خلوت ہوئی"
    },
    {
      "arabic": "وَلِيمَتِهِ",
      "english": "His wedding feast",
      "urdu": "ان کا ولیمہ"
    },
    {
      "arabic": "الْأَنْطَاعِ",
      "english": "Leather cloths / Mats",
      "urdu": "چمڑے کے دسترخوان"
    },
    {
      "arabic": "الْأَقِطُ",
      "english": "Dried yogurt / Cheese",
      "urdu": "پنیر / خشک دہی"
    },
    {
      "arabic": "السَّمْنُ",
      "english": "Clarified butter (Ghee)",
      "urdu": "مکھن / گھی"
    }
  ],
  "summary": {
    "urdu": "سیدہ صفیہ کے نکاح کے موقع پر نبی ﷺ کا ولیمہ انتہائی سادہ تھا، جس میں گوشت یا روٹی کے بجائے صرف دستیاب کھجوریں اور پنیر پیش کیا گیا، جو اس بات کی دلیل ہے کہ ولیمہ بوجھ نہیں ہونا چاہیے۔",
    "english": "On the occasion of his marriage to Safiyyah, the Prophet (ﷺ) hosted an extremely simple Walima without meat or bread, using only available dates and cheese, proving that a wedding feast should not be a burden."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب النكاح، رقم الحديث ٥٠٨٥",
      "english": "Sahih Bukhari, Book of Marriage, Hadith No. 5085"
    },
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٣٦٥",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1365"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ولیمہ میں سادگی اور قناعت",
        "english": "Simplicity and Contentment in Walima"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موجودہ وسائل کا استعمال",
              "english": "Utilizing Available Resources"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ثابت فرمایا کہ ولیمہ کے لیے قرض لینا یا تکلف کرنا ضروری نہیں ہے۔",
                "سفر کے دوران جو کچھ میسر تھا (کھجور، مکھن، پنیر) اسی کو برکت والا کھانا بنا دیا گیا۔",
                "اسلام دکھاوے اور اسراف کے سخت خلاف ہے، خاص طور پر خوشی کے موقع پر۔"
              ],
              "english": [
                "The Prophet (ﷺ) demonstrated that borrowing or engaging in elaborate formalities for Walima is unnecessary.",
                "Whatever was available during the journey (dates, butter, cheese) was served as the blessed feast.",
                "Islam is strictly against ostentation and extravagance, especially during celebrations."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھانے کی نوعیت",
              "english": "Nature of the Food"
            },
            "content": {
              "urdu": [
                "ولیمہ میں گوشت اور روٹی کا ہونا لازمی نہیں ہے، سادہ اشیاء سے بھی سنت پوری ہو جاتی ہے۔",
                "حیس (Hais) نامی یہ میٹھا عربوں میں بہت پسند کیا جاتا تھا جو ان اشیاء کے ملاپ سے بنتا ہے۔",
                "اصل چیز لوگوں کو شریک کرنا اور خوشی کا اعلان کرنا ہے، نہ کہ شاہانہ دسترخوان۔"
              ],
              "english": [
                "It is not mandatory to serve meat or bread at a Walima; simple items fulfill the Sunnah.",
                "The mixture of these items (Hais) was a popular sweet dish among Arabs.",
                "The core objective is to involve people and announce the joy, not provide a royal banquet."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رخصتی اور قیام کے آداب",
        "english": "Etiquettes of Consummation and Stay"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سفر میں شادی",
              "english": "Marriage During Travel"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے خیبر سے واپسی پر راستے میں قیام کیا اور رخصتی کا عمل مکمل فرمایا۔",
                "یہ اس بات کی دلیل ہے کہ نکاح اور رخصتی سفر یا حضر (گھر) دونوں میں ہو سکتی ہے۔",
                "اسلام نے انسانی فطرت کے تقاضوں کو ہر حال میں سہل بنایا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) stayed on the way back from Khaibar to complete the marriage process.",
                "This proves that Nikah and consummation can take place during travel or at home.",
                "Islam facilitates natural human needs in every circumstance."
              ]
            }
          },
          {
            "title": {
              "urdu": "تین راتوں کا قیام",
              "english": "The Three-Night Stay"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے نئی شادی کے موقع پر صفیہ رضی اللہ عنہا کے ساتھ تین راتیں گزاریں۔",
                "فقہاء کے مطابق غیر کنواری (بیوہ یا مطلقہ) بیوی کے لیے تین راتیں مخصوص کرنا سنت ہے۔",
                "یہ وقت میاں بیوی کے درمیان باہمی تعلق اور انسیت بڑھانے کے لیے ضروری ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) spent three nights with Safiyyah (RA) following their marriage.",
                "Jurists state that spending three nights is the Sunnah for a previously married woman (widow/divorcee).",
                "This period is essential for building mutual understanding and intimacy between spouses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدہ صفیہ رضی اللہ عنہا کا مقام",
        "english": "The Status of Safiyyah (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دشمن کی بیٹی سے ام المؤمنین تک",
              "english": "From Captive to Mother of the Believers"
            },
            "content": {
              "urdu": [
                "سیدہ صفیہ خیبر کے سردار کی بیٹی تھیں جو جنگ کے بعد قیدی بنی تھیں۔",
                "نبی ﷺ نے انہیں آزاد کیا اور نکاح کی پیشکش کر کے انہیں عظیم رتبہ عطا کیا۔",
                "ان کا مہر ان کی آزادی تھی، جو اسلام کی انسانیت نوازی کی بہترین مثال ہے۔"
              ],
              "english": [
                "Safiyyah was the daughter of a chief of Khaibar and became a captive after the battle.",
                "The Prophet (ﷺ) freed her and offered marriage, granting her an exalted status.",
                "Her manumission served as her Mahr, showcasing Islam's humanitarian approach."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا احترام",
              "english": "Respect of the Companions"
            },
            "content": {
              "urdu": [
                "جب نبی ﷺ نے ولیمہ کیا تو صحابہ سمجھ گئے کہ اب وہ ام المؤمنین کے درجے پر فائز ہو چکی ہیں۔",
                "ولیمہ دراصل نکاح کے باقاعدہ اعلان کا ایک ذریعہ تھا تاکہ کوئی شک باقی نہ رہے۔",
                "صحابہ کرام نے اس دعوت میں بھرپور شرکت کی اور خوشی کا اظہار کیا۔"
              ],
              "english": [
                "When the Prophet (ﷺ) hosted the Walima, the Companions realized she had attained the status of Mother of the Believers.",
                "The Walima served as a formal announcement of the marriage to leave no room for doubt.",
                "The Companions participated enthusiastically in the feast and shared the joy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمود و نمائش سے پرہیز",
              "english": "Avoiding Show-off"
            },
            "content": {
              "urdu": [
                "آج کے دور میں ولیموں پر ہونے والے کروڑوں کے اخراجات سنت کے خلاف ہیں۔",
                "سادگی اختیار کرنے سے معاشرے کے غریب طبقے کے لیے بھی شادیاں آسان ہوتی ہیں۔",
                "برکت مال کی کثرت میں نہیں بلکہ سنت کی پیروی میں ہے۔"
              ],
              "english": [
                "Millions spent on modern Walimas are contrary to the simplicity of the Sunnah.",
                "Choosing simplicity makes marriage easier for the poorer sections of society.",
                "Barakah (blessing) is not in the abundance of wealth but in following the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشی کی شراکت",
              "english": "Sharing Joy"
            },
            "content": {
              "urdu": [
                "ولیمہ کا مقصد دوسروں کو اپنی خوشی میں شامل کرنا اور اللہ کا شکر ادا کرنا ہے۔",
                "کھانا چاہے کتنا ہی سادہ ہو، اگر نیت نیک ہو تو اللہ اس میں برکت ڈال دیتا ہے۔",
                "مومن وہی ہے جو اپنی ہر خوشی کو سنتِ نبوی کے سانچے میں ڈھالے۔"
              ],
              "english": [
                "The purpose of Walima is to include others in one's joy and thank Allah.",
                "No matter how simple the food is, if the intention is pure, Allah grants it blessing.",
                "A true believer is one who molds every joy according to the Prophetic example."
              ]
            }
          }
        ]
      }
    }
  ]
}