{
  "hadithId": 837,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/14"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5136)، ومسلم (1419).",
    "urdu": "صحیح۔ اسے امام بخاری (5136) اور امام مسلم (1419) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5136) and Muslim (1419)."
  },
  "importantWords": [
    {
      "arabic": "الْأَيِّمُ",
      "english": "Matron (Widow/Divorcee)",
      "urdu": "بیوہ یا طلاق یافتہ"
    },
    {
      "arabic": "تُسْتَأْمَرَ",
      "english": "Be consulted",
      "urdu": "مشورہ لیا جائے"
    },
    {
      "arabic": "الْبِكْرُ",
      "english": "Virgin",
      "urdu": "کنواری"
    },
    {
      "arabic": "تُسْـتَأْذَنَ",
      "english": "Permission be sought",
      "urdu": "اجازت لی جائے"
    },
    {
      "arabic": "تَسْكُتَ",
      "english": "Remains silent",
      "urdu": "خاموش رہے"
    }
  ],
  "summary": {
    "urdu": "نکاح کے لیے عورت کی رضامندی شرط ہے؛ بیوہ کا صریح حکم اور کنواری کی خاموشی اس کی اجازت شمار ہوگی۔",
    "english": "Consent is mandatory for marriage; a matron must give verbal consent, while a virgin's silence is considered permission."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5136)",
      "english": "Sahih al-Bukhari (5136)"
    },
    {
      "arabic": "صحيح مسلم (1419)",
      "english": "Sahih Muslim (1419)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R6u_D7uLz_E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عورت کی رضامندی کی اہمیت",
        "english": "Importance of Female Consent"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جبر کی ممانعت",
              "english": "Prohibition of Coercion"
            },
            "content": {
              "urdu": [
                "اسلام کسی بھی عورت کو اس کی مرضی کے خلاف نکاح پر مجبور کرنے کی اجازت نہیں دیتا۔",
                "نبی کریم ﷺ نے واضح فرمایا کہ ولی کو عورت کی پسند و ناپسند کا احترام کرنا چاہیے۔",
                "زبردستی کیا گیا نکاح شرعی طور پر فسخ کیا جا سکتا ہے۔"
              ],
              "english": [
                "Islam does not allow forcing any woman into marriage against her will.",
                "The Prophet (ﷺ) explicitly stated that guardians must respect a woman's preferences.",
                "A forced marriage can be legally annulled under Islamic Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کے حقوق کا تحفظ",
              "english": "Protection of Women's Rights"
            },
            "content": {
              "urdu": [
                "یہ حدیث جاہلیت کی ان رسموں کو ختم کرتی ہے جہاں عورت کی کوئی رائے نہیں لی جاتی تھی۔",
                "نکاح ایک عمر بھر کا بندھن ہے، اس لیے فریقین کی خوشی بنیادی اہمیت رکھتی ہے۔",
                "اسلام نے عورت کو اپنی زندگی کے اہم فیصلے میں خود مختاری عطا کی ہے۔"
              ],
              "english": [
                "This Hadity abolishes pre-Islamic traditions where women's opinions were ignored.",
                "Marriage is a lifelong bond, making the happiness of both parties fundamental.",
                "Islam grants women autonomy in making significant life decisions like marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجازت کے طریقے",
        "english": "Methods of Consent"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیوہ اور طلاق یافتہ کا حکم",
              "english": "Ruling for Matrons"
            },
            "content": {
              "urdu": [
                "بیوہ یا طلاق یافتہ عورت چونکہ پہلے تجربہ کار ہوتی ہے، اس لیے اس کا واضح اظہار ضروری ہے۔",
                "اس سے صریح الفاظ میں مشورہ اور حکم (اجازت) لیا جانا واجب ہے۔",
                "اس معاملے میں صرف خاموشی کو کافی نہیں سمجھا جاتا۔"
              ],
              "english": [
                "Since a matron has prior experience, her explicit verbal consent is necessary.",
                "It is obligatory to seek her clear advice and command regarding the proposal.",
                "In her case, mere silence is generally not considered sufficient permission."
              ]
            }
          },
          {
            "title": {
              "urdu": "کنواری لڑکی کی خاموشی",
              "english": "Silence of a Virgin"
            },
            "content": {
              "urdu": [
                "کنواری لڑکی عموماً شرم و حیا کی وجہ سے زبان سے ہاں کہنے میں جھجھکتی ہے۔",
                "شریعت نے اس کی فطری حیا کا خیال رکھتے ہوئے خاموشی کو رضامندی قرار دیا ہے۔",
                "اگر وہ خاموش رہے تو اسے مثبت جواب تصور کیا جائے گا بشرطیکہ وہ انکار نہ کرے۔"
              ],
              "english": [
                "A virgin girl often feels shy to verbally express her consent due to modesty.",
                "Sharia considers her natural bashfulness and treats silence as agreement.",
                "If she remains silent, it is taken as a positive response, provided she doesn't refuse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی و معاشرتی حکمت",
        "english": "Sharia and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظم و ضبط",
              "english": "Family Discipline"
            },
            "content": {
              "urdu": [
                "ولی کو چاہیے کہ وہ بیٹی یا بہن کو اعتماد میں لے کر رشتہ طے کرے۔",
                "اعتماد کی فضا سے مستقبل میں ازدواجی مسائل کم سے کم ہوتے ہیں۔",
                "مشاورت سے کیا گیا فیصلہ خاندان میں برکت اور محبت کا باعث بنتا ہے۔"
              ],
              "english": [
                "A guardian should finalize the proposal by taking the daughter or sister into confidence.",
                "An atmosphere of trust minimizes marital issues in the future.",
                "Decisions made through consultation bring blessings and love within the family."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا کا تحفظ",
              "english": "Preservation of Modesty"
            },
            "content": {
              "urdu": [
                "اسلام نے حیا کو ایمان کا حصہ قرار دیا ہے اور اسے نکاح کے مراحل میں بھی برقرار رکھا ہے۔",
                "کنواری لڑکی کے لیے 'خاموشی' کی رعایت اس کے وقار کو بلند کرتی ہے۔",
                "یہ طریقہ کار اس بات کی دلیل ہے کہ اسلام انسانی نفسیات کو بخوبی سمجھتا ہے۔"
              ],
              "english": [
                "Islam considers modesty part of faith and maintains it even during marriage procedures.",
                "The concession of 'silence' for a virgin girl upholds her dignity.",
                "This procedure proves that Islam perfectly understands human psychology."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت",
        "english": "Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولی کی ذمہ داری",
              "english": "Responsibility of the Wali"
            },
            "content": {
              "urdu": [
                "سرپرست کو چاہیے کہ وہ رشتہ پیش کرتے وقت تمام پہلو واضح کرے۔",
                "لڑکی کو مکمل آزادی ہونی چاہیے کہ وہ اپنی رائے کا اظہار کر سکے۔",
                "اگر لڑکی صراحتاً انکار کر دے تو ولی کو نکاح کا حق نہیں رہتا۔"
              ],
              "english": [
                "The guardian should clarify all aspects of the proposal when presenting it.",
                "The girl must have complete freedom to express her opinion.",
                "If the girl explicitly refuses, the guardian has no right to proceed with the marriage."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اصلاح",
              "english": "Social Reform"
            },
            "content": {
              "urdu": [
                "ہمیں معاشرے سے زبردستی شادی کے رجحان کو ختم کرنا چاہیے جو کہ غیر اسلامی ہے۔",
                "سنت نبوی ﷺ پر عمل کرنا ہی گھریلو زندگی کی کامیابی کی ضمانت ہے۔",
                "لوگوں کو آگاہ کرنا ضروری ہے کہ رضامندی نکاح کا بنیادی رکن ہے۔"
              ],
              "english": [
                "We must eliminate the trend of forced marriages from society as it is un-Islamic.",
                "Following the Prophetic Sunnah is the guarantee for a successful domestic life.",
                "It is essential to educate people that consent is a fundamental pillar of marriage."
              ]
            }
          }
        ]
      }
    }
  ]
}