{
  "hadithId": 690,
  "hadithNo": 43,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/43"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "رواه البزار (1267)، والطبراني في الأوسط (6661). في إسناده ضعف بسبب صالح بن حيان، لكن معناه صحيح وثابت في أحاديث أخرى تنهى عن الغرر.",
    "urdu": "اسے بزار (1267) اور طبرانی نے اوسط میں روایت کیا ہے۔ اس کی سند میں صالح بن حیان کی وجہ سے ضعف ہے، البتہ اس کا مفہوم دیگر صحیح احادیث (جیسے حبل الحبلہ کی ممانعت) سے ثابت ہے۔",
    "english": "Reported by Al-Bazzar (1267) and At-Tabarani in Al-Awsat (6661). Its chain is weak due to Salih bin Hayyan, but the core meaning is supported by other authentic narrations forbidding uncertain transactions (Gharar)."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "الْمَضَامِينِ",
      "english": "Male animal's semen",
      "urdu": "نر کی پیٹھ کا پانی"
    },
    {
      "arabic": "الْمَلَاقِيحِ",
      "english": "Unborn offspring",
      "urdu": "پیٹ کا بچہ"
    },
    {
      "arabic": "بَيْعِ",
      "english": "Sale / Trade",
      "urdu": "خرید و فروخت"
    },
    {
      "arabic": "ضَعْفٌ",
      "english": "Weakness",
      "urdu": "ضعف یا کمزوری"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں غیر یقینی اور معدوم اشیاء (جیسے جانوروں کا ہونے والا بچہ یا مادہ منویہ) کی تجارت سے منع کیا گیا ہے کیونکہ اس میں دھوکے کا پہلو پایا جاتا ہے۔",
    "english": "This Hadith prohibits transacting in non-existent or uncertain items, such as unborn animal offspring or semen, to prevent financial risk and deception."
  },
  "references": [
    {
      "arabic": "مسند البزار",
      "english": "Musnad al-Bazzar"
    },
    {
      "arabic": "المعجم الأوسط للطبراني",
      "english": "Al-Mu'jam al-Awsat by At-Tabarani"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p7U_pG_2Q",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ممنوعہ تجارت کی وضاحت",
        "english": "Explanation of Prohibited Trade"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مضامین اور ملاقیح کا مطلب",
              "english": "Meaning of Madhamin and Malaqih"
            },
            "content": {
              "urdu": [
                "مضامین سے مراد نر جانور کی پشت میں موجود مادہ منویہ کی بیع ہے۔",
                "ملاقیح سے مراد مادہ کے پیٹ میں موجود وہ بچہ ہے جو ابھی پیدا نہیں ہوا۔",
                "ان دونوں صورتوں میں مبیع (بیچی جانے والی چیز) غیر یقینی اور غیر موجود ہے۔"
              ],
              "english": [
                "Madhamin refers to selling the semen within the male animal's loins.",
                "Malaqih refers to the unborn offspring currently in the mother's womb.",
                "In both cases, the subject matter of the sale is non-existent or uncertain."
              ]
            }
          },
          {
            "title": {
              "urdu": "غرر اور دھوکہ دہی",
              "english": "Gharar and Deception"
            },
            "content": {
              "urdu": [
                "ایسی بیع کو 'بیعِ غرر' کہا جاتا ہے جس میں سودے کا انجام معلوم نہ ہو۔",
                "ممکن ہے کہ بچہ مردہ پیدا ہو یا پیدا ہی نہ ہو، جس سے خریدار کا نقصان ہوگا۔",
                "اسلام ہر اس معاملے سے روکتا ہے جو فریقین کے درمیان جھگڑے کا باعث بنے۔"
              ],
              "english": [
                "This is called 'Bay' al-Gharar,' where the outcome of the deal is unknown.",
                "The fetus might be born dead or not at all, causing a loss to the buyer.",
                "Islam prohibits any transaction that leads to disputes between parties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور اصول",
        "english": "Juristic Wisdom and Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معدوم کی بیع کا حکم",
              "english": "Ruling on Non-Existent Items"
            },
            "content": {
              "urdu": [
                "اصول یہ ہے کہ جو چیز وجود میں نہ ہو اس کی بیع باطل ہے۔",
                "تجارت کے لیے ضروری ہے کہ مال بیچنے والے کے قبضے اور قدرت میں ہو۔",
                "اسلامی معیشت ٹھوس اور یقینی حقائق پر مبنی لین دین کو پسند کرتی ہے۔"
              ],
              "english": [
                "The rule is that selling something non-existent renders the contract void.",
                "It is essential for the goods to be in the seller's possession and control.",
                "The Islamic economy favors transactions based on solid and certain facts."
              ]
            }
          },
          {
            "title": {
              "urdu": "جانوروں کی نسل کشی کا معاوضہ",
              "english": "Fees for Animal Breeding"
            },
            "content": {
              "urdu": [
                "نر جانور کو جفتی کے لیے کرائے پر دینا بھی اسی حکم کے تحت ممنوع ہے۔",
                "اس میں نفع (بچہ) اللہ کے ہاتھ میں ہے، انسان اس کی ضمانت نہیں دے سکتا۔",
                "مسلمانوں کو چاہیے کہ وہ اس معاملے میں ایک دوسرے کے ساتھ تعاون کریں۔"
              ],
              "english": [
                "Hiring out male animals for mating is also prohibited under this ruling.",
                "The result (offspring) is in Allah's hands; humans cannot guarantee it.",
                "Muslims are encouraged to cooperate with each other in this regard."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی شفافیت اور عدل",
        "english": "Economic Transparency and Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خریدار کا تحفظ",
              "english": "Protection of the Buyer"
            },
            "content": {
              "urdu": [
                "شریعت نے خریدار کو ایسے سودوں سے بچایا ہے جہاں وہ جوے کا شکار ہو۔",
                "واضح اور موجود اشیاء کی بیع سے مارکیٹ میں استحکام پیدا ہوتا ہے۔",
                "کسی کا مال باطل طریقے سے کھانا بڑے گناہوں میں سے ایک ہے۔"
              ],
              "english": [
                "Sharia protects the buyer from deals that resemble gambling risks.",
                "Selling clear and present items generates market stability.",
                "Consuming someone's wealth through false means is a major sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "نزاع کا خاتمہ",
              "english": "Eliminating Conflict"
            },
            "content": {
              "urdu": [
                "نامعلوم نتائج والے سودے ہمیشہ دشمنی اور عدالتی کیسز کا سبب بنتے ہیں۔",
                "اسلامی معاشرت میں بھائی چارے کے تحفظ کے لیے ان سودوں کو روکا گیا۔",
                "عدل و انصاف کا تقاضا ہے کہ سودے کی ہر شرط واضح اور یقینی ہو۔"
              ],
              "english": [
                "Deals with unknown results always cause enmity and legal battles.",
                "These sales were stopped to preserve brotherhood in Islamic society.",
                "Justice requires every condition of a deal to be clear and certain."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروبار میں سچائی",
              "english": "Honesty in Business"
            },
            "content": {
              "urdu": [
                "صرف اس چیز کی قیمت وصول کریں جو آپ گاہک کو فراہم کر سکتے ہوں۔",
                "خوابوں یا امیدوں پر مبنی سودے بازی سے پرہیز کرنا ضروری ہے۔",
                "رزقِ حلال کی فکر انسان کے ایمان کو مضبوط اور پاکیزہ بناتی ہے۔"
              ],
              "english": [
                "Only charge for what you can actually deliver to the customer.",
                "It is necessary to avoid bargaining based on dreams or mere hopes.",
                "Concern for Halal provision strengthens and purifies a person's faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید مالیاتی معاملات",
              "english": "Modern Financial Affairs"
            },
            "content": {
              "urdu": [
                "اس حدیث کے اصولوں کو جدید انشورنس اور سٹے بازی پر بھی لاگو کیا جاتا ہے۔",
                "ہر وہ معاشی سرگرمی جو غیر یقینی ہو، اس سے دور رہنا تقویٰ ہے۔",
                "مسلمانوں کو اپنے مال کی حفاظت کے لیے شرعی حدود کو پہچاننا چاہیے۔"
              ],
              "english": [
                "Principles of this Hadith apply to modern insurance and speculation.",
                "Staying away from uncertain economic activities is a sign of piety.",
                "Muslims must recognize Sharia limits to safeguard their wealth."
              ]
            }
          }
        ]
      }
    }
  ]
}