{
  "hadithId": 25,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["1:25"],
    "kitabId": 1,
    "inKitabBab": 3,
    "arabicBook": "كتاب الطهارة",
    "babId": 3
  },

  "takhreej": {
    "arabic": "صحيح.  رواه البخاري (229) ، ومسلم (289)  من طريق سليمان بن يسار، عن عائشة، به .  واللفظ المذكور لمسلم.  صحيح.  رواه مسلم (288) .  مسلم (290)  من طريق عبد الله بن شهاب الخولاني، قال: كنت نازلا على عائشة.  فاحتملت في ثوبي، فغمستهما في الماء، فرأتني جارية لعائشة، فأخبرتها، فبعثت إلي عائشة فقالت: ما حملك على ما صنعت بثوبيك؟ قال: قلت: رأيت ما يرى النائم في منامه.  قالت: هل رأيت فيهما شيئا؟ قلت: لا.  قالت: فلو رأيت شيئا غسلته.  لقد رأيتني، وإني لأحكه من ثوب رسول الله صلى الله عليه وسلم يابسا بظفري.",
    "urdu": "صحیح (درست) حدیث۔ اسے بخاری (229) اور مسلم (289، 288، 290) نے سلیمان بن یسار کے طریق سے سیدہ عائشہ رضی اللہ عنہا سے روایت کیا ہے۔ یہ حدیث متفق علیہ ہے اور مسلم کی روایت میں منی کے خشک اور تر ہونے کی دونوں حالتوں کی وضاحت موجود ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (229) and Muslim (288, 289, 290) via the chain of Sulayman ibn Yasar from Aishah (RA). The Hadith is agreed upon and Muslim's narrations clarify both the wet and dry states of semen."
  },
  "importantWords": [
    {
      "arabic": "اَلْمَنِي",
      "english": "Semen",
      "urdu": "منی"
    },
    {
      "arabic": "يَغْسِلُ",
      "english": "He washes",
      "urdu": "آپ دھوتے تھے"
    },
    {
      "arabic": "أَفْرُكُهُ",
      "english": "I rub it off/scrape it",
      "urdu": "میں اسے رگڑتی تھی/کھرچتی تھی"
    },
    {
      "arabic": "يُصَلِّي فِيهِ",
      "english": "He prays in it",
      "urdu": "آپ اس میں نماز پڑھتے"
    },
    {
      "arabic": "يَابِسًا",
      "english": "When dry",
      "urdu": "جب خشک ہو"
    },
    {
      "arabic": "بِظُفُرِي",
      "english": "With my nail",
      "urdu": "اپنے ناخن سے"
    },
    {
      "arabic": "أَثَرِ اَلْغُسْلِ",
      "english": "Trace of washing",
      "urdu": "دھونے کا نشان"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم ﷺ کی طہارت کے اصول کو واضح کرتی ہے کہ منی کپڑے پر لگ جائے تو اسے دھو کر تر حالت میں یا کھرچ کر خشک حالت میں صاف کیا جا سکتا ہے، اور صاف کرنے کے بعد اسی کپڑے میں نماز جائز ہے۔",
    "english": "This Hadith clarifies the ruling on purity regarding semen: it can be removed from a garment by washing when wet or by scraping when dry, and praying in that garment after cleaning is permissible."
  },
  "references": [
    {
      "arabic": "رواه البخاري (229)",
      "english": "Reported by Al-Bukhari (229)"
    },
    {
      "arabic": "رواه مسلم (288)",
      "english": "Reported by Muslim (288)"
    }
  ],
  "narrators": [
    {
      "id": 2501,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "منی کی طہارت کا شرعی حکم",
        "english": "Legal Ruling on the Purity of Semen"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منی کا حکم",
              "english": "The Ruling on Semen (Mani)"
            },
            "content": {
              "urdu": [
                "اس حدیث سے منی کی نجاست یا پاکیزگی کے بارے میں فقہاء میں اختلاف پایا جاتا ہے۔",
                "نبی ﷺ کے دھونے کا عمل یہ ظاہر کرتا ہے کہ یہ نجاست ہے جس کو نماز سے پہلے دھونا چاہیے۔",
                "دوسری روایت میں صرف کھرچ دینے کا جواز منی کی نجاست کو ہلکی قسم کی نجاست کے طور پر ظاہر کرتا ہے۔"
              ],
              "english": [
                "There is a difference of opinion among jurists regarding the impurity or purity of semen based on this Hadith.",
                "The Prophet's act of washing suggests it is an impurity that must be washed off before prayer.",
                "The permission to merely scrape it off indicates that semen is a minor impurity (Najasah Khafifah) or ritually pure but disliked (Tahir Ghair Matlub al-Istikhdam)."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت کا طریقہ",
              "english": "Method of Purification"
            },
            "content": {
              "urdu": [
                "منی جب تر ہو تو اسے پانی سے دھو کر ہٹانا افضل اور زیادہ احتیاط ہے۔",
                "جب منی خشک ہو جائے تو ناخن یا کسی چیز سے کھرچ دینا بھی پاکیزگی کے لیے کافی ہے۔",
                "دھونے کے بعد پانی کا نشان باقی رہنا نماز کی صحت کے لیے نقصان دہ نہیں۔"
              ],
              "english": [
                "When semen is wet, washing it off with water is the preferred and more cautious method.",
                "When semen is dry, scraping it off with a nail or other object is sufficient for purity.",
                "The remaining trace of water after washing does not harm the validity of the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اثرات",
        "english": "Juristic and Practical Implications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منی کی نجاست کا حکم",
              "english": "Ruling on Semen's Impurity"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک منی پاک ہے مگر اسے ہٹا دینا مستحب ہے، جب کہ امام ابوحنیفہ و احمد کے نزدیک یہ نجس ہے۔",
                "جو اسے نجس کہتے ہیں، ان کے ہاں تر منی کو دھونا اور خشک منی کو کھرچ دینا کافی سمجھا جاتا ہے۔",
                "احتیاط کا تقاضا ہے کہ اسے ہر صورت میں نماز سے پہلے صاف کر لیا جائے۔"
              ],
              "english": [
                "Imam Shafi'i considered semen pure but recommended removing it, while Imams Abu Hanifah and Ahmad considered it impure.",
                "Those who deem it impure accept that washing wet semen and scraping dry semen is sufficient.",
                "Caution dictates that it should be removed from the garment before prayer in any case."
              ]
            }
          },
          {
            "title": {
              "urdu": "لباس کی طہارت",
              "english": "Purity of Garments"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر سکھاتی ہے کہ نماز کے لیے کپڑے نجاست سے پاک ہونے چاہییں۔",
                "اس کے ساتھ یہ بھی معلوم ہوتا ہے کہ اگر نجاست کو ہٹا دیا جائے، تو باقی داغ یا اثر کی موجودگی نماز پر اثر انداز نہیں ہوتی۔",
                "مسلمانوں کو اپنے لباس کی طہارت کے بارے میں بہت احتیاط کرنی چاہیے۔"
              ],
              "english": [
                "This Hadith clearly teaches that garments for prayer must be free from impurity.",
                "It also implies that if the impurity is removed, the remaining stain or trace does not affect the validity of the prayer.",
                "Muslims should be very cautious about the cleanliness of their attire."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کی تعلیمات",
        "english": "The Prophet's Teachings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی جامعیت",
              "english": "Comprehensiveness of the Sunnah"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کی سنت نے زندگی کے ہر پہلو میں، بشمول ذاتی صفائی، مکمل رہنمائی فراہم کی ہے۔",
                "سیدہ عائشہ رضی اللہ عنہا کی روایتیں نبی ﷺ کے گھریلو حالات اور طہارت کے مسائل کی وضاحت کرتی ہیں۔",
                "نبی ﷺ کے ہر چھوٹے سے چھوٹے عمل کی حفاظت علم دین کا اہم حصہ ہے۔"
              ],
              "english": [
                "The Sunnah of the Prophet (ﷺ) provides comprehensive guidance in every aspect of life, including personal hygiene.",
                "Aishah's narrations clarify the Prophet's domestic life and rulings regarding purification.",
                "Preserving even the smallest actions of the Prophet (ﷺ) is a vital part of religious knowledge."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "خشک منی کو کھرچنے کی اجازت آسانی اور رخصت کی دلیل ہے، تاکہ ہر بار کپڑا دھونے کی مشقت نہ ہو۔",
                "اگرچہ پانی سے دھونا صفائی کے لیے بہترین ہے، مگر کھرچ دینا کافی سمجھا گیا۔",
                "یہ حکم اس بات کی تاکید ہے کہ اللہ تعالیٰ نے دین میں مشقت نہیں ڈالی ہے۔"
              ],
              "english": [
                "The permission to scrape off dry semen is evidence of ease and concession, avoiding the hardship of washing the garment every time.",
                "Although washing with water is best for cleanliness, scraping was considered sufficient.",
                "This ruling emphasizes that Allah has not placed difficulty in the religion."
              ]
            }
          }
        ]
      }
    }
  ]
}
