{
  "hadithId": 1279,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bukhari:2447", "muslim:2579"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2447)، ومسلم (2579)، وأحمد (4663).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (2447) اور امام مسلم (2579) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2447) and Muslim (2579). It is an 'Agreed Upon' narration."
  },
  "importantWords": [
    {
      "arabic": "الظُّلْمُ",
      "english": "Injustice / Oppression",
      "urdu": "ظلم"
    },
    {
      "arabic": "ظُلُمَاتٌ",
      "english": "Darkness / Layers of gloom",
      "urdu": "تاریکیاں / اندھیرے"
    },
    {
      "arabic": "يَوْمَ",
      "english": "Day",
      "urdu": "دن"
    },
    {
      "arabic": "الْقِيَامَةِ",
      "english": "Resurrection",
      "urdu": "قیامت"
    },
    {
      "arabic": "مُتَّفَقٌ",
      "english": "Agreed upon",
      "urdu": "جس پر اتفاق ہو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ظلم کی سنگینی بیان کرتی ہے کہ دنیا میں دوسروں پر کیا گیا ظلم قیامت کے دن انسان کے لیے شدید اندھیرے اور عذاب کا باعث بنے گا۔",
    "english": "This Hadith warns about the gravity of injustice, stating that oppression practiced in this world will manifest as intense darkness and suffering on the Day of Judgment."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2447)",
      "english": "Sahih al-Bukhari (2447)"
    },
    {
      "arabic": "صحيح مسلم (2579)",
      "english": "Sahih Muslim (2579)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ظلم کی تعریف اور اقسام",
        "english": "Definition and Types of Injustice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق تلفی کرنا",
              "english": "Violating Rights"
            },
            "content": {
              "urdu": [
                "ظلم کا لغوی معنی کسی چیز کو اس کے غیر محل میں رکھنا ہے۔",
                "اس میں اللہ کے حقوق اور بندوں کے حقوق دونوں شامل ہیں۔",
                "دوسروں کی جان، مال یا عزت پر حملہ کرنا بڑا ظلم ہے۔"
              ],
              "english": [
                "Injustice literally means putting something in the wrong place.",
                "It encompasses violating both the rights of Allah and humans.",
                "Attacking someone's life, property, or honor is a major oppression."
              ]
            }
          },
          {
            "title": {
              "urdu": "مختلف شکلیں",
              "english": "Various Forms"
            },
            "content": {
              "urdu": [
                "سب سے بڑا ظلم شرک ہے جو کہ خالق کا حق مارنا ہے۔",
                "پھر وہ ظلم جو انسان اپنے نفس پر گناہ کر کے کرتا ہے۔",
                "تیسرا وہ ظلم جو انسان دوسرے لوگوں کے ساتھ روا رکھتا ہے۔"
              ],
              "english": [
                "The greatest injustice is Shirk, which denies the Creator's rights.",
                "Then is the injustice a person does to their soul through sin.",
                "The third is the injustice committed against other fellow human beings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کی تاریکی",
        "english": "The Darkness of Resurrection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقیقی اندھیرا",
              "english": "Literal Darkness"
            },
            "content": {
              "urdu": [
                "قیامت کے دن ظالم کو راستہ ڈھونڈنے کے لیے روشنی نہیں ملے گی۔",
                "ظلم اس دن اس کے گرد گہرے اندھیرے کی طرح چھا جائے گا۔",
                "نیک اعمال نور بنیں گے جبکہ ظلم تاریکی میں بدل جائے گا۔"
              ],
              "english": [
                "On Judgment Day, the oppressor will find no light to see the path.",
                "Oppression will surround him like thick, impenetrable clouds of gloom.",
                "Good deeds will become light, whereas injustice will turn into darkness."
              ]
            }
          },
          {
            "title": {
              "urdu": "شدتِ عذاب",
              "english": "Severity of Punishment"
            },
            "content": {
              "urdu": [
                "تاریکی سے مراد وہ سخت پریشانیاں ہیں جو ظالم کو گھیر لیں گی۔",
                "مظلوم کی بددعا ظالم کے لیے دنیا و آخرت کی رسوائی بنتی ہے۔",
                "اللہ ظالم کو مہلت دیتا ہے مگر جب پکڑتا ہے تو سخت پکڑتا ہے۔"
              ],
              "english": [
                "Darkness refers to the severe hardships that will engulf the oppressor.",
                "The prayer of the oppressed leads to disgrace for the oppressor.",
                "Allah grants the oppressor time, but His seizure is extremely firm."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Societal Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل و انصاف کی ضرورت",
              "english": "Necessity of Justice"
            },
            "content": {
              "urdu": [
                "معاشرے کی بقا اور امن صرف عدل و انصاف پر مبنی ہے۔",
                "جہاں ظلم عام ہو جائے وہاں سے اللہ کی برکت اٹھ جاتی ہے۔",
                "اسلام ہر حال میں کمزوروں کی حمایت اور ظالم کی مخالفت کرتا ہے۔"
              ],
              "english": [
                "The survival and peace of society depend solely on justice.",
                "Where injustice becomes common, Allah's blessings are withdrawn.",
                "Islam supports the weak and opposes the oppressor in every case."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم کی روک تھام",
              "english": "Prevention of Oppression"
            },
            "content": {
              "urdu": [
                "ظلم کو دیکھ کر خاموش رہنا بھی ظالم کی مدد کے مترادف ہے۔",
                "مسلمان پر فرض ہے کہ وہ ہاتھ یا زبان سے ظلم کو روکے۔",
                "مظلوم کی مدد کرنا ایمانی اور اخلاقی فریضہ ہے۔"
              ],
              "english": [
                "Remaining silent while witnessing injustice is helping the oppressor.",
                "It is a Muslim's duty to stop oppression by hand or tongue.",
                "Helping the oppressed is a religious and moral obligation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توبہ اور تلافی",
        "english": "Repentance and Restitution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق العباد کی معافی",
              "english": "Forgiveness of Human Rights"
            },
            "content": {
              "urdu": [
                "بندوں کا ظلم تب تک معاف نہیں ہوتا جب تک وہ خود معاف نہ کریں۔",
                "دنیا میں ہی مظلوم سے معافی مانگ لینا اور حق لوٹانا ضروری ہے۔",
                "آخرت میں معافی کے بدلے نیکیاں دینی پڑیں گی جو بڑی مفلسی ہے۔"
              ],
              "english": [
                "Injustice to humans is not forgiven until they forgive themselves.",
                "Seeking forgiveness and returning rights in this world is essential.",
                "In the hereafter, one must pay with good deeds, leading to bankruptcy."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ سے پناہ",
              "english": "Seeking Refuge in Allah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ ہمیشہ ظلم کرنے اور ظلم سہنے سے پناہ مانگتے تھے۔",
                "ہمیں ہر وقت اپنے اعمال کا محاسبہ کرنا چاہیے۔",
                "سچی توبہ اور آئندہ ظلم نہ کرنے کا عہد ہی نجات کا راستہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) always sought refuge from oppressing or being oppressed.",
                "We must constantly audit our actions and behaviors toward others.",
                "Sincere repentance and a vow to never oppress again is the path to salvation."
              ]
            }
          }
        ]
      }
    }
  ]
}