{
  "hadithId": 1023,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/32"],
    "kitabId": 9,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام",
    "babId": 82
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1848). وفي رواية له زيادة توضح خطورة العصبية والقتال تحت راية مجهولة، وأن من فعل ذلك فليس من أمة النبي صلى الله عليه وسلم.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح میں روایت کیا ہے۔ اس کے دیگر الفاظ میں واضح کیا گیا ہے کہ عصبیت کی بنیاد پر لڑنا یا مسلمانوں کے خلاف تلوار اٹھانا سخت ممنوع ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (1848). In another version of this Hadith, the Prophet (ﷺ) clarified that fighting for tribalism or attacking the community excludes one from his followers."
  },
  "importantWords": [
    {
      "arabic": "خَرَجَ",
      "english": "Defected / Rebelled",
      "urdu": "باہر نکل گیا / خروج کیا"
    },
    {
      "arabic": "الطَّاعَةِ",
      "english": "Obedience",
      "urdu": "فرمانبرداری"
    },
    {
      "arabic": "فَارَقَ",
      "english": "Separated / Left",
      "urdu": "جدا ہو گیا"
    },
    {
      "arabic": "الْجَمَاعَةَ",
      "english": "Community / Group",
      "urdu": "مسلمانوں کی جماعت"
    },
    {
      "arabic": "مِيتَةٌ",
      "english": "Death / Manner of death",
      "urdu": "موت"
    },
    {
      "arabic": "جَاهِلِيَّةٌ",
      "english": "Ignorance / Pre-Islamic",
      "urdu": "دورِ جاہلیت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مسلمانوں کے نظمِ اجتماعی اور حکمران کی اطاعت کی اہمیت بیان کی گئی ہے، اور جماعت سے علیحدگی کو جاہلیت کا راستہ قرار دیا گیا ہے۔",
    "english": "This Hadith emphasizes the importance of social order and obedience to authority in Islam, warning that abandoning the community leads to a state of ignorance."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1848)",
      "english": "Reported by Muslim (1848)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0hXWp3uF4Xo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نظمِ اجتماعی کی اہمیت",
        "english": "The Importance of Social Order"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمران کی اطاعت",
              "english": "Obedience to the Ruler"
            },
            "content": {
              "urdu": [
                "اسلام میں انتشار سے بچنے کے لیے حکمران کی اطاعت کو لازمی قرار دیا گیا ہے۔",
                "جب تک حکمران کفرِ بواح یا گناہ کا حکم نہ دے، اس کا ساتھ دینا واجب ہے۔",
                "نظمِ حکومت کی خلاف ورزی سے معاشرے میں فتنہ و فساد پیدا ہوتا ہے۔"
              ],
              "english": [
                "Islam mandates obedience to the ruler to prevent chaos and anarchy.",
                "It is obligatory to support authority unless they command open disbelief or sin.",
                "Violating the government's order leads to strife and corruption in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "جماعت کے ساتھ وابستگی",
              "english": "Commitment to the Community"
            },
            "content": {
              "urdu": [
                "مسلمانوں کی بڑی جماعت سے جڑے رہنا سلامتی اور اتحاد کی ضمانت ہے۔",
                "اپنے انفرادی مفادات کے لیے اجتماعی نظم کو توڑنا جاہلیت کی روش ہے۔",
                "اتحاد و اتفاق ہی امتِ مسلمہ کی اصل طاقت اور پہچان ہے۔"
              ],
              "english": [
                "Remaining connected to the main body of Muslims ensures safety and unity.",
                "Breaking collective order for individual interests is a practice of ignorance.",
                "Unity and agreement are the true strength and identity of the Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جاہلیت کی موت کا مفہوم",
        "english": "Meaning of Death of Jahiliyyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جاہلیت سے مشابہت",
              "english": "Resemblance to Ignorance"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ وہ شخص جاہلیت کے لوگوں کی طرح مرا جو کسی امام کے پابند نہیں تھے۔",
                "یہ کفر کی موت نہیں بلکہ گمراہی اور بغاوت والی موت کی طرف اشارہ ہے۔",
                "جاہلیت میں لوگ قبائلی عصبیت پر جیتے تھے اور کسی قانون کو نہیں مانتے تھے۔"
              ],
              "english": [
                "It means dying like the people of pre-Islamic times who had no leadership.",
                "This does not imply a state of disbelief, but death in misguidance and rebellion.",
                "In Jahiliyyah, people lived by tribalism and refused to follow any central law."
              ]
            }
          },
          {
            "title": {
              "urdu": "عصبیت کی مذمت",
              "english": "Condemnation of Tribalism"
            },
            "content": {
              "urdu": [
                "اندھی عصبیت اور بلاوجہ کی طرفداری میں مرنا جاہلیت کا شیوہ ہے۔",
                "حق کے بجائے صرف اپنی قوم یا قبیلے کے لیے لڑنا اسلام میں حرام ہے۔",
                "ایسا شخص قیامت کے دن سخت جوابدہی اور پکڑ کا سامنا کرے گا۔"
              ],
              "english": [
                "Dying for blind tribalism or irrational bias is the way of ignorance.",
                "Fighting for one's clan instead of the truth is strictly forbidden in Islam.",
                "Such a person will face severe accountability and punishment on Judgment Day."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات اور فتنہ",
        "english": "Social Impact and Discord"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغاو ت اور فساد",
              "english": "Rebellion and Corruption"
            },
            "content": {
              "urdu": [
                "جماعت سے خروج کرنے والا عام طور پر خونی تصادم کا راستہ اختیار کرتا ہے۔",
                "اس سے بے گناہ مسلمانوں کی جان و مال کو خطرہ لاحق ہو جاتا ہے۔",
                "اسلام نے فتنہ و فساد کو قتل سے بھی زیادہ سنگین جرم قرار دیا ہے۔"
              ],
              "english": [
                "One who defects from the community usually takes the path of bloody conflict.",
                "This poses a serious threat to the lives and property of innocent Muslims.",
                "Islam considers spreading fitnah (discord) more severe than actual killing."
              ]
            }
          },
          {
            "title": {
              "urdu": "امن و امان کا قیام",
              "english": "Maintaining Peace and Security"
            },
            "content": {
              "urdu": [
                "ایک مستحکم ریاست کے لیے اطاعت اور نظم و ضبط ریڑھ کی ہڈی ہیں۔",
                "قانون کی پاسداری ہی سے کمزوروں کے حقوق کا تحفظ ممکن ہے۔",
                "جماعت کا ساتھ دینے والے ہی حقیقی معنوں میں معاشرے کے معمار ہیں۔"
              ],
              "english": [
                "Obedience and discipline are the backbone of a stable state.",
                "Adhering to the law is the only way to protect the rights of the weak.",
                "Those who uphold the community's order are the true builders of society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و تربیتی اسباق",
        "english": "Practical and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتحاد کی اہمیت",
              "english": "Importance of Unity"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو چاہیے کہ وہ امت کے اتحاد کے لیے اپنا کردار ادا کرے۔",
                "فرقہ واریت اور گروہ بندی سے بچنا ایمان کا تقاضا ہے۔",
                "اللہ کی رسی کو مل کر تھامنا ہی فلاح کا واحد راستہ ہے۔"
              ],
              "english": [
                "Every Muslim should play their part in ensuring the unity of the Ummah.",
                "Avoiding sectarianism and group divisions is a requirement of faith.",
                "Holding fast to the rope of Allah together is the only path to success."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کی اصلاح",
              "english": "Self-Reform"
            },
            "content": {
              "urdu": [
                "بغاوت کا جذبہ اکثر تکبر اور نفسانی خواہشات سے پیدا ہوتا ہے۔",
                "اپنی رائے کے مقابلے میں اجتماعی فیصلے کو تسلیم کرنا تواضع ہے۔",
                "اسلامی تعلیمات ہمیں خود غرضی سے نکال کر امت کا خادم بناتی ہیں۔"
              ],
              "english": [
                "The urge to rebel often stems from arrogance and personal desires.",
                "Accepting a collective decision over one's own opinion is true humility.",
                "Islamic teachings pull us out of selfishness to make us servants of the Ummah."
              ]
            }
          }
        ]
      }
    }
  ]
}