{
  "hadithId": 697,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2177"],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2177)، ومسلم (1584). والورق بكسر الراء هي الفضة المسكوكة.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (2177) و مسلم (1584) کی متفقہ روایت ہے۔ 'تشفوا' کا مطلب کمی بیشی یا زیادتی کرنا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2177) and Muslim (1584). 'Al-Wariq' refers to silver coins or minted silver."
  },
  "importantWords": [
    {
      "arabic": "الذَّهَبَ",
      "english": "Gold",
      "urdu": "سونا"
    },
    {
      "arabic": "الْوَرِقَ",
      "english": "Silver",
      "urdu": "چاندی"
    },
    {
      "arabic": "مِثْلًا بِمِثْلٍ",
      "english": "Like for like / Equal",
      "urdu": "برابر برابر"
    },
    {
      "arabic": "لَا تُشِفُّوا",
      "english": "Do not increase",
      "urdu": "زیادتی نہ کرو"
    },
    {
      "arabic": "غَائِباً",
      "english": "Absent / Credit",
      "urdu": "غیر موجود / ادھار"
    },
    {
      "arabic": "نَاجِزٍ",
      "english": "Present / Cash",
      "urdu": "موجود / نقد"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ربا الفضل اور ربا النسیئہ سے بچنے کے لیے سونے چاندی کے تبادلے کے دو بنیادی اصول بیان ہوئے ہیں: برابری اور ہاتھوں ہاتھ لین دین۔",
    "english": "This Hadith establishes two core principles for exchanging gold and silver to avoid Riba: equality in weight and immediate hand-to-hand delivery."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2177)",
      "english": "Sahih al-Bukhari (2177)"
    },
    {
      "arabic": "صحيح مسلم (1584)",
      "english": "Sahih Muslim (1584)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-sa-id-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ربا الفضل کی ممانعت",
        "english": "Prohibition of Riba al-Fadl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وزن میں برابری کی شرط",
              "english": "Requirement of Equal Weight"
            },
            "content": {
              "urdu": [
                "جب ایک ہی جنس (سونا سونے سے یا چاندی چاندی سے) کا تبادلہ ہو تو وزن برابر ہونا فرض ہے۔",
                "پرانا سونا دے کر نیا سونا لیتے وقت بھی وزن میں کمی بیشی سود (ربا الفضل) کہلاتی ہے۔",
                "نبی ﷺ نے 'مثلاً بمثل' کہہ کر ہر قسم کی زیادتی کے دروازے بند کر دیے ہیں۔"
              ],
              "english": [
                "When exchanging items of the same genus (gold for gold), equal weight is mandatory.",
                "Exchanging old gold for new gold with a difference in weight is considered Riba al-Fadl.",
                "The Prophet (PBUH) closed all doors to excess by specifying 'like for like'."
              ]
            }
          },
          {
            "title": {
              "urdu": "زیادتی کا گناہ",
              "english": "Sin of Excess"
            },
            "content": {
              "urdu": [
                "حدیث میں 'لا تشفوا' کے الفاظ واضح کرتے ہیں کہ ذرہ برابر زیادتی بھی ناجائز ہے۔",
                "قیمت یا کوالٹی کے فرق کی وجہ سے وزن میں فرق کرنا شرعاً سود ہے۔",
                "اگر کوالٹی مختلف ہو تو پہلے سونا بیچ کر رقم لی جائے پھر اس سے دوسرا سونا خریدا جائے۔"
              ],
              "english": [
                "The words 'do not increase' clarify that even a tiny excess is impermissible.",
                "Differing weight due to quality or price differences is legally classified as usury.",
                "If quality differs, one should sell the gold for cash and then purchase the other set."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ربا النسیئہ اور نقد لین دین",
        "english": "Riba al-Nasi'ah and Spot Trade"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہاتھوں ہاتھ تبادلہ",
              "english": "Hand-to-Hand Exchange"
            },
            "content": {
              "urdu": [
                "سونے چاندی کے تبادلے میں قبضہ اسی مجلس میں ہونا ضروری ہے۔",
                "ایک طرف سے نقد اور دوسری طرف سے ادھار (غائب) کا معاملہ ربا النسیئہ کہلاتا ہے۔",
                "بیع صرف (کرنسی کا تبادلہ) میں تاخیر کرنا شرعی طور پر ممنوع ہے۔"
              ],
              "english": [
                "Possession must occur in the same session during gold and silver exchanges.",
                "Trading cash for credit (deferred delivery) in these metals is termed Riba al-Nasi'ah.",
                "Delaying the physical exchange in currency trading (Bay' al-Sarf) is legally forbidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "ادھار کی ممانعت کی حکمت",
              "english": "Wisdom of Prohibiting Credit"
            },
            "content": {
              "urdu": [
                "سونے چاندی میں ادھار سٹہ بازی اور معاشی عدم استحکام کا باعث بنتا ہے۔",
                "مارکیٹ ریٹ بدلنے سے فریقین کے درمیان جھگڑے کا اندیشہ رہتا ہے۔",
                "فوری تبادلہ معیشت میں شفافیت اور برکت پیدا کرتا ہے۔"
              ],
              "english": [
                "Credit in gold and silver leads to speculation and economic instability.",
                "Fluctuating market rates can cause serious disputes between the trading parties.",
                "Immediate exchange fosters transparency and divine blessing in the economy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ضوابط",
        "english": "Juristic Guidelines"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنس بدلنے کا حکم",
              "english": "Ruling on Differing Genus"
            },
            "content": {
              "urdu": [
                "اگر سونا چاندی کے بدلے بیچا جائے تو وزن میں برابری ضروری نہیں ہے۔",
                "مگر اس صورت میں بھی ہاتھوں ہاتھ (نقد) لین دین کی شرط باقی رہتی ہے۔",
                "جنس بدلنے سے کمی بیشی جائز ہو جاتی ہے مگر ادھار پھر بھی منع ہے۔"
              ],
              "english": [
                "If gold is sold for silver, equality in weight is no longer a requirement.",
                "However, even in this case, the condition of immediate hand-to-hand trade remains.",
                "Changing the genus allows for excess but still prohibits any deferment or credit."
              ]
            }
          },
          {
            "title": {
              "urdu": "کاغذی کرنسی کا حکم",
              "english": "Ruling on Paper Currency"
            },
            "content": {
              "urdu": [
                "جدید فقہاء کے نزدیک کاغذی نوٹ بھی ثمن (کرنسی) کے حکم میں آتے ہیں۔",
                "ایک ہی ملک کی کرنسی کا تبادلہ برابری اور نقد کی بنیاد پر ہوگا۔",
                "مختلف ممالک کی کرنسیوں میں کمی بیشی جائز ہے مگر نقد ہونا ضروری ہے۔"
              ],
              "english": [
                "Modern jurists view paper currency as having the legal status of 'Thaman' (money).",
                "Exchanging the same currency must be equal in value and spot-based.",
                "Exchanging different currencies allows for rate differences but requires immediate delivery."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جیولرز کے ساتھ معاملات",
              "english": "Dealings with Jewelers"
            },
            "content": {
              "urdu": [
                "پرانا سونا دے کر نیا سونا لیتے وقت وزن برابر رکھیں اور مزدوری الگ سے دیں۔",
                "یا اپنا سونا بیچ کر رقم لیں اور پھر نئے سرے سے نیا سونا خریدیں۔",
                "یہ طریقہ کار انسان کو دانستہ یا نادانستہ سود میں ملوث ہونے سے بچاتا ہے۔"
              ],
              "english": [
                "Keep weights equal when swapping old gold for new, paying making charges separately.",
                "Alternatively, sell your gold for cash first, then buy the new piece as a fresh deal.",
                "This procedure saves a person from falling into usury knowingly or unknowingly."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور احتیاط",
              "english": "Piety and Precaution"
            },
            "content": {
              "urdu": [
                "مالی معاملات میں ذرا سی غفلت انسان کی عبادات کو برباد کر سکتی ہے۔",
                "سود کے قریب جانے سے بھی بچنا ایک سچے مومن کا شیوہ ہے۔",
                "رزقِ حلال کی طلب میں شرعی باریکیوں کو سمجھنا ہر مسلمان پر فرض ہے۔"
              ],
              "english": [
                "Slight negligence in financial matters can ruin one's spiritual worship.",
                "Avoiding even the proximity of usury is the hallmark of a true believer.",
                "Understanding Sharia nuances in seeking Halal income is a duty upon every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}