{
  "hadithId": 196,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواية أبي هريرة عند البخاري (437) بلفظ 'قاتل الله'، ومسلم (530) بلفظ 'لعن الله'. ورواية عائشة في قصة بناء المساجد على القبور متفق عليها عند البخاري (427) ومسلم (528).",
    "urdu": "صحیح متفق علیہ۔ حضرت ابوہریرہ کی روایت بخاری (437) میں 'قاتل الله' کے لفظ کے ساتھ اور مسلم (530) میں 'لعن الله' کے لفظ کے ساتھ ہے۔ اور قبروں پر مساجد بنانے کی کہانی سیدہ عائشہ کی روایت سے بخاری (427) اور مسلم (528) میں متفق علیہ ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). The narration of Abu Hurayrah is in Al-Bukhari (437) with the wording 'May Allah destroy,' and in Muslim (530) with the wording 'May Allah curse.' The narration of 'Aishah concerning building mosques over graves is agreed upon in Al-Bukhari (427) and Muslim (528)."
  },
  "importantWords": [
    {
      "arabic": "قاتل الله",
      "english": "May Allah destroy/curse",
      "urdu": "اللہ غارت کرے/لعنت کرے"
    },
    {
      "arabic": "قبور",
      "english": "Graves",
      "urdu": "قبریں"
    },
    {
      "arabic": "أنبيائهم",
      "english": "Their prophets",
      "urdu": "ان کے انبیاء"
    },
    {
      "arabic": "اتخذوا",
      "english": "They took/adopted",
      "urdu": "انہوں نے بنا لیا"
    },
    {
      "arabic": "مسجداً",
      "english": "Place of worship/mosque",
      "urdu": "سجدہ گاہ/مسجد"
    },
    {
      "arabic": "شرار الخلق",
      "english": "Worst of creation",
      "urdu": "بدترین مخلوق"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث یہودیوں اور عیسائیوں کے اُس عمل پر سخت وعید اور لعنت بیان کرتی ہے جس میں انہوں نے اپنے انبیاء اور صالحین کی قبروں کو عبادت گاہیں بنا لیا تھا۔ اسلام میں توحید کی حفاظت کے لیے قبروں پر مسجدیں بنانا اور قبروں کو قبلہ بنانا حرام قرار دیا گیا ہے، اور ایسا کرنے والوں کو بدترین مخلوق کہا گیا ہے۔",
    "english": "This Hadith conveys a severe warning and curse upon the Jews and Christians for the practice of converting the graves of their prophets and righteous people into places of worship. In Islam, building mosques over graves and taking them as a Qiblah is forbidden to protect Monotheism (Tawheed), and those who commit this act are deemed the worst of creation."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب هل تنبش قبور مشركي الجاهلية ويتخذ مكانها مساجد (427)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: Should the graves of the Mushrikin of the Pre-Islamic Period of Ignorance be dug up and turned into Mosques (427)"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساجد ومواضع الصلاة، باب النهي عن بناء المساجد على القبور (528)",
      "english": "Sahih Muslim, Book of Masajid and Places of Prayer, Chapter: Prohibition of building mosques over graves (528)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurayrah"
      },
      "slug": "abu-hurayrah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XzWj8-G_h8M",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبروں پر مساجد بنانے کی ممانعت",
        "english": "Prohibition of Building Mosques over Graves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یہود و نصاریٰ کا انحراف",
              "english": "Deviation of Jews and Christians"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے یہودیوں اور عیسائیوں پر لعنت بھیجی کہ انہوں نے قبور کو عبادت گاہ بنا لیا۔",
                "یہ انحراف شرک کا دروازہ کھولتا ہے، جہاں لوگ قبروں کو پوجنے لگتے ہیں یا ان سے مدد مانگتے ہیں۔",
                "مسلم کی روایت میں نصاریٰ کا اضافہ یہ بتاتا ہے کہ یہ فتنہ دونوں امتوں میں عام تھا۔"
              ],
              "english": [
                "The Prophet (PBUH) cursed the Jews and Christians for taking graves as places of worship.",
                "This deviation opens the door to Shirk (polytheism), where people start worshipping graves or seeking help from them.",
                "The addition of 'Christians' in the Muslim narration indicates that this temptation was prevalent in both communities."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام میں توحید کا تحفظ",
              "english": "Protection of Monotheism (Tawheed) in Islam"
            },
            "content": {
              "urdu": [
                "اسلام میں قبروں پر مسجدیں بنانے کی ممانعت کا بنیادی مقصد عقیدہ توحید کی حفاظت ہے۔",
                "قبروں کی تعظیم کرتے کرتے لوگ انہیں شرک کا ذریعہ بنا لیتے ہیں، جس سے اسلام سختی سے روکتا ہے۔",
                "اسی وجہ سے نبی صلی اللہ علیہ وسلم کو اپنے آخری وقت میں بھی اس فتنے کا خوف تھا۔"
              ],
              "english": [
                "The primary purpose of prohibiting the building of mosques over graves is to safeguard the doctrine of Tawheed.",
                "Excessive veneration of graves often leads people to make them a means of Shirk, which Islam strongly forbids.",
                "For this reason, the Prophet (PBUH) feared this temptation even in his final moments."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بدترین مخلوق ہونے کی وجہ",
        "english": "Reason for Being the Worst of Creation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں شرک کا شائبہ",
              "english": "Hint of Shirk in Worship"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کی روایت میں نیک لوگوں کی قبروں کو مسجد بنانے والے کو بدترین مخلوق کہا گیا۔",
                "یہ حکم اس لیے ہے کہ یہ عمل اللہ کے حق کو دوسروں کے ساتھ شریک کرنے کا سبب بنتا ہے۔",
                "اگرچہ نیت خالص عبادت کی ہو، لیکن یہ فعل بالآخر شرک کی طرف لے جاتا ہے۔"
              ],
              "english": [
                "In 'Aishah's narration, those who build mosques over the graves of the righteous are called the worst of creation.",
                "This ruling is given because this act leads to associating others with Allah's right in worship.",
                "Even if the intention is pure worship, this act eventually leads to Shirk (polytheism)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کی سخت گیری",
              "english": "Strictness of Islam"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کی یہ سخت تنبیہ بتاتی ہے کہ اس معاملے میں نرمی کی کوئی گنجائش نہیں ہے۔",
                "توحید کے تحفظ کے لیے، اسلام شرک کے ہر چھوٹے بڑے دروازے کو بند کر دیتا ہے۔",
                "مومن کو چاہیے کہ وہ صالحین سے محبت رکھے لیکن ان کے حقوق کو اللہ کے حقوق سے نہ ملائے۔"
              ],
              "english": [
                "This severe admonition from the Prophet (PBUH) indicates that there is no scope for leniency in this matter.",
                "To safeguard Tawheed, Islam closes every small and large door that leads to Shirk.",
                "A believer should love the righteous but must not mix their rights with the rights of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اطلاق",
        "english": "Juristic and Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کا حکم",
              "english": "Ruling on the Prayer"
            },
            "content": {
              "urdu": [
                "ایسی مسجد میں نماز پڑھنا مکروہ تحریمی ہے جس کے احاطے میں قبر موجود ہو اور وہ قبلہ کی طرف ہو۔",
                "تمام فقہاء اور علماء اس بات پر متفق ہیں کہ قبروں کی طرف رخ کر کے نماز نہیں پڑھنی چاہیے۔",
                "اگر قبریں مسجد سے باہر ہوں تو مسجد میں نماز پڑھنا بالاتفاق جائز ہے۔"
              ],
              "english": [
                "It is Makruh Tahrimi (severely disliked) to pray in a mosque that has a grave within its premises, especially towards the Qiblah.",
                "All jurists and scholars agree that one should not face graves during prayer.",
                "If the graves are outside the mosque, then praying inside the mosque is permissible by consensus."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجدِ نبوی کا استثنیٰ",
              "english": "Exemption of the Prophet's Mosque"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم کی قبر مسجد نبوی میں نہیں بلکہ آپ کے حجرہ مبارک میں ہے۔",
                "یہ قبر حجرے کی چار دیواروں میں گھری ہے اور خانہ کعبہ کی طرف رخ کر کے نماز پڑھی جاتی ہے۔",
                "حجرہ مبارک کو شامل کرنے کے بعد بھی نماز قبر کی طرف نہیں ہوتی بلکہ قبلہ کی طرف ہوتی ہے۔"
              ],
              "english": [
                "The grave of the Prophet (PBUH) is not in the Mosque but within his room ('Hujrah Mubarak').",
                "The grave is enclosed by walls, and the prayer is offered facing the Ka'bah.",
                "Even after the room was incorporated, the prayer is not directed towards the grave but towards the Qiblah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تاریخی سبق",
        "english": "Ethical and Historical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تقلیدِ باطل سے اجتناب",
              "english": "Avoiding False Imitation"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسلمانوں کو پہلی قوموں کی غلطیوں کی تقلید سے باز رہنے کی تعلیم دیتی ہے۔",
                "ہمیں ہر عبادت کو صرف اور صرف اللہ کی خوشنودی اور سنت کے مطابق ادا کرنا چاہیے۔",
                "صالحین کی تعظیم میں غلو اور افراط و تفریط دونوں سے بچنا لازم ہے۔"
              ],
              "english": [
                "This Hadith teaches Muslims to refrain from imitating the errors of previous nations.",
                "We must perform every act of worship solely for Allah's pleasure and according to the Sunnah.",
                "It is mandatory to avoid both exaggeration and negligence in honoring the righteous people."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبروں کی اصلاح",
              "english": "Reforming Graves"
            },
            "content": {
              "urdu": [
                "مساجد کے اندر یا اس سے ملحق قبور کی تعمیر و تزئین کو ختم کر دینا شرعی فریضہ ہے۔",
                "ایسی تمام عمارتیں جو قبروں پر بنی ہوں، انہیں ختم کر کے زمین کے برابر کر دینا چاہیے۔",
                "یہ عمل دین کی حفاظت اور خالص توحید کو زندہ رکھنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "Demolishing any construction or beautification over or near graves within mosques is a religious duty.",
                "All structures built over graves should be destroyed and leveled with the ground.",
                "This action is necessary for the preservation of religion and the revival of pure Monotheism."
              ]
            }
          }
        ]
      }
    }
  ]
}
