{
  "hadithId": 466,
  "hadithNo": 42,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/42", "abudawud/3213", "ahmad/2/27"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (2/27) ، وأبو داود (3213) ، والنسائي في عمل اليوم والليلة (1067) ، وابن حبان (3110). وقد أعل بالوقف ولكن المرفوع صحيح ثابت وله شواهد.",
    "urdu": "صحیح۔ اسے امام احمد (2/27)، ابوداؤد (3213) اور ابن حبان (3110) نے روایت کیا ہے۔ نسائی نے اسے 'عمل الیوم واللیلہ' میں درج کیا ہے۔ دارقطنی نے اسے موقوف کہا ہے مگر مرفوع روایت ہی صحیح اور ثابت ہے۔",
    "english": "Sahih. Reported by Ahmad (2/27), Abu Dawud (3213), and Ibn Hibban (3110). An-Nasa'i recorded it in 'Amal al-Yawm wal-Laylah' (1067). While some labeled it as Mauquf, the Marfu' version is authentic with supporting evidences."
  },
  "importantWords": [
    {
      "arabic": "وَضَعْتُمْ",
      "english": "You place",
      "urdu": "تم رکھو / اتارو"
    },
    {
      "arabic": "مَوْتَاكُمْ",
      "english": "Your dead",
      "urdu": "تمہارے مردے"
    },
    {
      "arabic": "مِلَّةِ",
      "english": "Religion / Way",
      "urdu": "ملت / طریقہ / دین"
    },
    {
      "arabic": "الْقُبُورِ",
      "english": "The graves",
      "urdu": "قبریں"
    },
    {
      "arabic": "أَعْلَّهُ",
      "english": "Declared it defective",
      "urdu": "اسے معلول (کمزور) قرار دیا"
    }
  ],
  "summary": {
    "urdu": "میت کو قبر میں اتارتے وقت بسم اللہ پڑھنا اور اسے رسول اللہ ﷺ کی ملت اور دین پر اللہ کے سپرد کرنا مسنون دعا ہے۔",
    "english": "It is Sunnah to recite 'In the name of Allah and upon the religion of Allah's Messenger' while lowering the deceased into the grave."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الجنائز، رقم 3213",
      "english": "Sunan Abi Dawud, Book of Funerals, Hadith 3213"
    },
    {
      "arabic": "مسند أحمد، ج 2، ص 27",
      "english": "Musnad Ahmad, Vol 2, p. 27"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fq4m8D0p4yU",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تدفین کی مسنون دعا",
        "english": "Sunnah Supplication for Burial"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کے الفاظ کی فضیلت",
              "english": "Virtue of the Words of Supplication"
            },
            "content": {
              "urdu": [
                "قبر میں اتارتے وقت بسم اللہ پڑھنا میت کے لیے اللہ کی حفاظت اور برکت کا طلبگار ہونا ہے۔",
                "’علی ملۃ رسول اللہ‘ کا مطلب یہ ہے کہ ہم اس شخص کو اسلام اور سنتِ نبوی پر اللہ کے سپرد کر رہے ہیں۔",
                "یہ الفاظ میت کے ایمانی سفر کے آخری لمحات میں اس کے دینِ حق پر ہونے کی گواہی ہیں۔"
              ],
              "english": [
                "Reciting Bismillah while lowering the body seeks Allah's protection and blessing for the deceased.",
                "Saying 'Upon the religion of Allah's Messenger' means entrusting the soul to Allah as a follower of Islam.",
                "These words serve as a testimony that the deceased passed away following the true path of the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تواتر اور عملِ صحابہ",
              "english": "Consistency and Practice of the Sahaba"
            },
            "content": {
              "urdu": [
                "سیدنا ابن عمر رضی اللہ عنہما سے یہ عمل بکثرت مروی ہے اور صحابہ اس پر متفق تھے۔",
                "روایات میں ’علی سنتِ رسول اللہ‘ کے الفاظ بھی آئے ہیں جو ایک ہی مفہوم کو واضح کرتے ہیں۔",
                "یہ دعا قبر کی تنہائی میں میت کے لیے استقامت اور سکون کا باعث بنتی ہے۔"
              ],
              "english": [
                "This act is widely narrated from Ibn 'Umar (RA) and the Companions were unanimous upon it.",
                "Some narrations use the phrase 'Upon the Sunnah of Allah's Messenger,' which conveys the same meaning.",
                "This supplication provides a spiritual shield and tranquility for the deceased in the grave's loneliness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تدفین کے آداب",
        "english": "Burial Etiquettes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میت کو اتارنے کا طریقہ",
              "english": "Method of Lowering the Body"
            },
            "content": {
              "urdu": [
                "میت کو قبر میں پاؤں کی جانب سے یا جس طرح آسانی ہو، نہایت احترام سے اتارنا چاہیے۔",
                "اتارنے والے کا باوضو ہونا اور اللہ کا ذکر کرنا مستحب عمل شمار ہوتا ہے۔",
                "قبر کے اندر میت کو دائیں کروٹ پر قبلہ رخ لٹانا سنتِ مؤکدہ ہے۔"
              ],
              "english": [
                "The body should be lowered into the grave with great respect, starting from the feet or as convenient.",
                "It is recommended for those lowering the body to be in a state of Wudu and remembering Allah.",
                "Placing the deceased on their right side facing the Qibla inside the grave is an established Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نرمی اور شفقت کا معاملہ",
              "english": "Gentleness and Compassion"
            },
            "content": {
              "urdu": [
                "میت کی ہڈی توڑنا زندہ کی ہڈی توڑنے کی طرح ہے، اس لیے قبر میں اسے بہت نرمی سے رکھیں۔",
                "یہ دعا پڑھتے ہوئے میت کے ساتھ ہمدردی اور دلی تعلق کا اظہار کرنا چاہیے۔",
                "اسلام نے مرنے کے بعد بھی انسانی جسم کی حرمت اور احترام کو برقرار رکھا ہے۔"
              ],
              "english": [
                "Breaking the bone of a dead person is like breaking it while alive, so handle them gently in the grave.",
                "While reciting this prayer, one should feel compassion and a deep spiritual connection with the deceased.",
                "Islam maintains the sanctity and honor of the human body even after the soul has departed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقیدہ اور ملت کا ثبات",
        "english": "Firmness of Creed and Nationhood"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملتِ اسلامیہ پر فخر",
              "english": "Pride in the Islamic Nation"
            },
            "content": {
              "urdu": [
                "یہ دعا یاد دلاتی ہے کہ ہماری زندگی اور موت کا مرکز رسول اللہ ﷺ کی لائی ہوئی شریعت ہے۔",
                "انسان دنیا سے سب کچھ چھوڑ جاتا ہے، صرف اللہ کا نام اور اس کا دین ساتھ جاتا ہے۔",
                "قبر کے سوالات میں بھی دین اور نبی ﷺ کے بارے میں پوچھا جائے گا، یہ دعا اس کی یاد دہانی ہے۔"
              ],
              "english": [
                "This prayer reminds us that our life and death center around the Sharia brought by the Prophet (ﷺ).",
                "A person leaves everything behind in this world, carrying only Allah's name and His religion.",
                "The questions in the grave will also concern one's religion and the Prophet, which this prayer echoes."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعائے مغفرت کی اہمیت",
              "english": "Importance of Praying for Forgiveness"
            },
            "content": {
              "urdu": [
                "تدفین کے بعد میت کے لیے ثباتِ قدمی اور مغفرت کی دعا کرنا سنتِ نبوی ہے۔",
                "صحابہ کرام تدفین کے بعد قبر پر رک کر میت کے لیے استغفار کیا کرتے تھے۔",
                "مسلمانوں کا یہ اجتماعی عمل میت کے بوجھ کو ہلکا کرنے کا ذریعہ بنتا ہے۔"
              ],
              "english": [
                "It is the Prophet's Sunnah to pray for the steadfastness and forgiveness of the dead after burial.",
                "The Companions used to stay at the grave after burial to seek forgiveness for the deceased.",
                "This collective action of Muslims serves as a means to alleviate the burden of the departed soul."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنون اذکار کی پابندی",
              "english": "Adherence to Sunnah Adhkar"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے جنازوں میں بناوٹی کلمات کے بجائے مسنون اور ثابت شدہ دعاؤں کو اپنانا چاہیے۔",
                "ہر مسلمان کو یہ مختصر مگر جامع دعا یاد ہونی چاہیے تاکہ وہ سنت پر عمل کر سکے۔",
                "سنت کی پیروی ہی عمل کی قبولیت اور میت کے لیے نفع کا باعث ہے۔"
              ],
              "english": [
                "We should adopt Sunnah and established prayers in our funerals instead of made-up phrases.",
                "Every Muslim should memorize this short yet comprehensive prayer to act upon the Sunnah.",
                "Following the Sunnah is the key to the acceptance of deeds and benefit for the deceased."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کی تیاری",
              "english": "Preparing for Death"
            },
            "content": {
              "urdu": [
                "دوسروں کو قبر میں اتارتے وقت انسان کو اپنی قبر اور آخری ٹھکانے کا خیال کرنا چاہیے۔",
                "یہ لمحات توبہ کی تجدید اور نیکیوں میں اضافے کے لیے بہترین محرک ہیں۔",
                "ملتِ رسول ﷺ پر مرنے کے لیے اس ملت پر جینا پہلی شرط ہے۔"
              ],
              "english": [
                "While lowering others into the grave, one must reflect on their own grave and final destination.",
                "These moments are a powerful incentive for renewing repentance and increasing good deeds.",
                "To die upon the religion of the Prophet (ﷺ), living according to it is the first condition."
              ]
            }
          }
        ]
      }
    }
  ]
}