{
  "hadithId": 97,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 97"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": "صحيح. رواه مسلم (311) . وهو بتمامه: عن أنس بن مالك؛ أن أم سليم سألت نبي الله صلى الله عليه وسلم: عن المرأة ترى في منامها ما يرى الرجل؟ فقال رسول الله صلى الله عليه وسلم: \"إذا رأت ذلك المرأة فلتغتسل\" فقالت أم سليم: واستحييت من ذلك. قالت: وهل يكون هذا؟ فقال نبي الله صلى الله عليه وسلم: \"نعم. فمن أين يكون الشبه. إن ماء الرجل غليظ أبيض. وماء المرأة رقيق أصفر. فمن أيهما علا أو سبق يكون منه الشبه\".",
    "urdu": "صحیح (درست) روایت۔ اسے مسلم (311) نے روایت کیا ہے۔ مکمل روایت میں ہے: انس بن مالک سے کہ ام سلیم نے نبی اللہ صلی اللہ علیہ وسلم سے اس عورت کے بارے میں پوچھا جو خواب میں وہ دیکھتی ہے جو مرد دیکھتا ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"جب عورت ایسا دیکھے تو اسے غسل کرنا چاہیے\"۔ ام سلیم نے کہا اور میں اس سے حیا کرتی تھی۔ انہوں نے کہا: کیا ایسا ہوتا ہے؟ تو نبی اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ہاں۔ پھر مشابہت کہاں سے ہوتی؟ بے شک مرد کا پانی گاڑھا سفید ہوتا ہے اور عورت کا پانی پتلا زرد۔ پھر ان میں سے جو غالب آ جائے یا سبقت لے جائے، اسی سے مشابہت ہوتی ہے۔\"",
    "english": "Sahih (Authentic). Reported by Muslim (311). The complete narration states: Anas ibn Malik narrated that Umm Sulaim asked the Prophet ﷺ about a woman who sees in her dream what a man sees. The Messenger of Allah ﷺ said: \"When the woman sees that, then let her perform Ghusl.\" Umm Sulaim said: I felt shy about that. She said: Does this happen? The Prophet ﷺ said: \"Yes, then from where does the resemblance come? Indeed, the man's fluid is thick and white, and the woman's fluid is thin and yellow. Whichever of them prevails or precedes, the resemblance is from it.\""
  },
  "importantWords": [
    {
      "arabic": "اَلْمَرْأَةِ",
      "english": "The woman",
      "urdu": "عورت"
    },
    {
      "arabic": "مَنَامِهَا",
      "english": "Her sleep/dream",
      "urdu": "اس کا خواب"
    },
    {
      "arabic": "يَرَى اَلرَّجُلُ",
      "english": "A man sees (wet dream)",
      "urdu": "مرد دیکھتا ہے"
    },
    {
      "arabic": "تَغْتَسِلُ",
      "english": "She must perform Ghusl",
      "urdu": "وہ غسل کرے"
    },
    {
      "arabic": "اَلشَّبَهُ",
      "english": "The resemblance",
      "urdu": "مشابہت"
    },
    {
      "arabic": "مَاءُ اَلْمَرْأَةِ",
      "english": "The woman's fluid",
      "urdu": "عورت کا پانی/منی"
    },
    {
      "arabic": "رَقِيق",
      "english": "Thin/watery",
      "urdu": "پتلا"
    },
    {
      "arabic": "يَكُونُ اَلشَّبَهُ",
      "english": "Resemblance occurs",
      "urdu": "مشابہت ہوتی ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث عورت کے احتلام کے معاملے کو مرد کے برابر قرار دیتی ہے، اور غسل کے وجوب کو سیال (منی) کے اخراج سے مشروط کرتی ہے، نیز اولاد میں مشابہت کی بنیادی وجہ مرد اور عورت دونوں کی منی کی شراکت کو بتاتی ہے۔",
    "english": "This Hadith equates a woman's wet dream to a man's, making Ghusl mandatory upon the emission of fluid (semen), and further explains that the child's resemblance is fundamentally due to the contribution of both the male and female fluids."
  },
  "references": [
    {
      "arabic": "رواه مسلم (311)",
      "english": "Reported by Muslim (311)"
    },
    {
      "arabic": "متفق عليه (بالمعنى)",
      "english": "Agreed upon (in meaning)"
    }
  ],
  "narrators": [
    {
      "id": 9701,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Malik"
      },
      "slug": "anas-ibn-malik"
    },
    {
      "id": 9702,
      "name": {
        "arabic": "أم سليم",
        "english": "Umm Sulaim (The inquirer)"
      },
      "slug": "umm-sulaim"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غسل کا وجوب اور مساوات",
        "english": "Obligation of Ghusl and Equality"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احتلام کی صورت میں غسل",
              "english": "Ghusl in Case of Wet Dream"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے واضح فرما دیا کہ احتلام کی صورت میں غسل کا حکم مرد اور عورت دونوں کے لیے یکساں ہے۔",
                "وجوب غسل خواب کی وجہ سے نہیں، بلکہ اس کے نتیجے میں سیال (منی) کے اخراج کی صورت میں ہے۔",
                "یہ حکم اس بات کو یقینی بناتا ہے کہ ناپاکی (جنابت) کی حالت میں کوئی بھی شخص عبادت کے لیے کھڑا نہ ہو۔"
              ],
              "english": [
                "The Prophet ﷺ clearly established that the ruling for Ghusl in the case of a wet dream is the same for both men and women.",
                "The obligation of Ghusl is not due to the dream itself, but rather to the resulting emission of fluid (semen).",
                "This ruling ensures that no person stands for worship while they are in the state of major ritual impurity (Janabah)."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کی منی کی حقیقت",
              "english": "The Reality of Woman's Fluid (Mani)"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے عورت میں بھی منی کے وجود کو تسلیم کیا، جو زرد اور پتلی ہوتی ہے (بمقابلہ مرد کی منی کے جو سفید اور گاڑھی ہوتی ہے)۔",
                "عورت کے اس سیال کا اخراج انزال کا حکم رکھتا ہے اور غسل کو واجب کرتا ہے، جو اس کی روحانی طہارت کے لیے ضروری ہے۔",
                "یہ وضاحت اس وقت کی معاشرتی حیاء اور غلط فہمیوں کو دور کرنے کے لیے کی گئی تھی کہ عورت کو احتلام نہیں ہوتا۔"
              ],
              "english": [
                "The Messenger of Allah ﷺ affirmed the existence of seminal fluid in women, which is described as yellowish and thin (compared to man's white and thick fluid).",
                "The discharge of this fluid in a woman is considered ejaculation (inzal) and necessitates Ghusl for her spiritual purity.",
                "This clarification was given to dispel social modesty and misconceptions of that time that women do not experience wet dreams."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اولاد کی مشابہت کا راز",
        "english": "The Secret of Children's Resemblance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشابہت میں دونوں کا حصہ",
              "english": "Contribution of Both Parents to Resemblance"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اولاد کی مشابہت کے سوال کو اٹھا کر اس حقیقت کو واضح کیا کہ بچے کی مشابہت ماں کے مادے پر بھی منحصر ہے۔",
                "مسلم کی روایت میں واضح ہے کہ جس کا پانی (مادہ) غالب آ جائے یا سبقت لے جائے، مشابہت اسی کی ہوتی ہے۔",
                "یہ بیان نبوی ﷺ کی سچائی اور جدید جینیاتی علم کی بنیادی سچائیوں کی تصدیق کرتا ہے۔"
              ],
              "english": [
                "By referencing the child's resemblance, the Prophet ﷺ revealed the truth that the child's likeness depends on the mother's fluid as well.",
                "Muslim's narration explicitly states that resemblance occurs from whichever fluid (of the man or woman) is dominant or precedes the other.",
                "This statement affirms the truthfulness of the Prophetic teachings and the basic principles confirmed by modern genetics."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی سوال کی قدر",
              "english": "Value of Academic Inquiry"
            },
            "content": {
              "urdu": [
                "ام سلیم رضی اللہ عنہا کا سؤال شریعت کے علم کو مکمل کرنے میں خواتین کے اہم کردار کو ظاہر کرتا ہے۔",
                "نبی ﷺ نے ان کے سوال کو سراہا اور بغیر کسی جھجک کے علمی اور طبی حقائق کو بیان فرمایا۔",
                "یہ واقعہ ہمیں سکھاتا ہے کہ خالص علمی نقطہ نظر سے دینی حقائق پر سوال کرنا ایک محمود عمل ہے۔"
              ],
              "english": [
                "Umm Sulaim's question shows the vital role of women in completing the body of Shari'ah knowledge.",
                "The Prophet ﷺ commended her question and revealed academic and biological truths without any hesitation.",
                "This incident teaches us that asking questions about religious facts from a purely academic standpoint is a commendable act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حیا اور تبلیغ کا توازن",
        "english": "Balance of Modesty and Propagation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیا اور شرعی ضرورت",
              "english": "Modesty vs. Legal Necessity"
            },
            "content": {
              "urdu": [
                "ام سلیم کا سوال کہ \"اللہ حق بیان کرنے سے حیا نہیں کرتا\" دراصل ایک شرعی ضرورت کے تحت تھا۔",
                "اسلام میں حیا ایمان کا حصہ ہے، لیکن ضروری شرعی احکام کو بیان کرنے میں حیا رکاوٹ نہیں بننی چاہیے۔",
                "جب بات طہارت، نماز اور دیگر فرائض کی ہو، تو حق کو پوچھنا اور بتانا فرض بن جاتا ہے۔"
              ],
              "english": [
                "Umm Sulaim's assertion, 'Allah is not ashamed of the truth,' was based on a legal necessity.",
                "Modesty is part of faith in Islam, but it should not become a barrier to stating necessary legal rulings.",
                "When discussing matters of purity, prayer, and other obligations, asking and stating the truth becomes mandatory."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا حکمتِ عملی",
              "english": "The Prophet's Prudent Method"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے ام سلیم کو اس موضوع پر بات کرنے کی حوصلہ افزائی کی اور سائلہ کی عزت کو مجروح نہیں کیا۔",
                "آپ نے جواب میں اولاد کی مشابہت کا مسئلہ چھیڑ کر فطری حکمت کا سہارا لیا، تاکہ کسی کو حیاء نہ آئے۔",
                "یہ طریقہ کار ہمیں سکھاتا ہے کہ حساس مسائل کو بھی حکمت اور علمی دلیل کے ساتھ بیان کیا جا سکتا ہے۔"
              ],
              "english": [
                "The Prophet ﷺ encouraged Umm Sulaim to discuss this topic and did not undermine the inquirer's dignity.",
                "He used the natural wisdom of child resemblance in his answer, allowing the sensitive matter to be discussed openly.",
                "This methodology teaches us that sensitive issues can be discussed with wisdom and academic reasoning."
              ]
            }
          }
        ]
      }
    }
  ]
}
