{
  "hadithId": 408,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/408"],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "كتاب الصلاة",
    "babId": 26
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1014)‏، ومسلم (897).‏",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (1014) اور امام مسلم (897) نے اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (1014) and Muslim (897)."
  },
  "importantWords": [
    {
      "arabic": "هَلَكَتِ",
      "english": "Perished / Destroyed",
      "urdu": "ہلاک ہو گئے"
    },
    {
      "arabic": "اَلْأَمْوَالُ",
      "english": "Livestock / Wealth",
      "urdu": "مویشی / مال"
    },
    {
      "arabic": "اَلسُّبُلُ",
      "english": "Roads / Ways",
      "urdu": "راستے"
    },
    {
      "arabic": "أَغِثْنَا",
      "english": "Relieve us with rain",
      "urdu": "ہماری فریاد رسی فرما (بارش سے)"
    },
    {
      "arabic": "يُغِيثُنَا",
      "english": "Grant us rain",
      "urdu": "ہمیں بارش عطا فرمائے"
    },
    {
      "arabic": "إِمْسَاكِهَا",
      "english": "Stopping it (the rain)",
      "urdu": "اسے روکنا / بند کرنا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ثابت کرتی ہے کہ دوران خطبہ امام سے دعا کی درخواست کرنا جائز ہے اور ضرورت کے وقت دعا کے لیے ہاتھ اٹھانا سنت ہے۔",
    "english": "This Hadith proves it is permissible to request the Imam for supplication during the sermon and to raise hands for prayer when needed."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1014)",
      "english": "Sahih al-Bukhari (1014)"
    },
    {
      "arabic": "صحيح مسلم (897)",
      "english": "Sahih Muslim (897)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik Al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F07_xXJ3x4c",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دوران خطبہ گفتگو",
        "english": "Speaking During the Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام سے کلام کرنا",
              "english": "Speaking to the Imam"
            },
            "content": {
              "urdu": [
                "دوران خطبہ ضرورت کے تحت امام سے بات کرنا جائز ہے۔",
                "یہ کلام لغو نہیں ہے بلکہ اجتماعی حاجت کے لیے ہے۔",
                "نبی ﷺ نے اس شخص کو ٹوکا نہیں بلکہ اس کی درخواست قبول فرمائی۔"
              ],
              "english": [
                "It is permissible to speak to the Imam during the Khutbah for a necessity.",
                "This talk is not considered idle chatter but is for a collective need.",
                "The Prophet (PBUH) did not rebuke the man but accepted his request."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی مسائل کا حل",
              "english": "Solving Collective Issues"
            },
            "content": {
              "urdu": [
                "مساجد کو اجتماعی مسائل اور آفات کے حل کے لیے استعمال کیا جا سکتا ہے۔",
                "خطبہ جمعہ میں اہم معاملات پر توجہ دلانا صحابہ کا شیوہ تھا۔",
                "مظلوم یا حاجت مند کی فریاد دورانِ عبادت بھی سنی جا سکتی ہے۔"
              ],
              "english": [
                "Mosques can be utilized to address collective problems and calamities.",
                "Highlighting urgent matters during the Friday sermon was a practice of the Sahaba.",
                "The plea of a needy person can be heard even during formal worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کا مسنون طریقہ",
        "english": "The Sunnah of Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہاتھ اٹھانا",
              "english": "Raising the Hands"
            },
            "content": {
              "urdu": [
                "دعا استسقاء میں ہاتھ اس قدر اٹھانا کہ بغلوں کی سفیدی نظر آئے، سنت ہے۔",
                "یہ عمل اللہ کے سامنے انتہائی محتاجی اور عاجزی کی علامت ہے۔",
                "نبی ﷺ نے دعا کے وقت تکرار فرمائی جو قبولیت کا ایک اہم ادب ہے۔"
              ],
              "english": [
                "Raising hands so high that the whiteness of armpits shows is Sunnah in Istisqa.",
                "This act signifies extreme poverty and humility before Allah.",
                "The Prophet (PBUH) repeated the prayer, which is an important etiquette for acceptance."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی قبولیت",
              "english": "Acceptance of Prayer"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی دعا کے فوراً بعد بادلوں کا آنا آپ کا معجزہ تھا۔",
                "اس سے ثابت ہوتا ہے کہ اللہ اپنے پیارے بندوں کی پکار جلد سنتا ہے۔",
                "بارش کا مسلسل برسنا اور پھر آپ کی دعا سے رکنا اللہ کی قدرت کا مظہر ہے۔"
              ],
              "english": [
                "The immediate appearance of clouds after the Prophet's dua was a miracle.",
                "This proves that Allah quickly answers the call of His beloved servants.",
                "The continuous rain followed by its stopping through his dua shows Allah's power."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اعتدال کی اہمیت",
        "english": "Importance of Moderation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بارش رکنے کی دعا",
              "english": "Prayer to Stop Rain"
            },
            "content": {
              "urdu": [
                "جب بارش حد سے بڑھ جائے تو اس کے نقصان سے بچنے کی دعا مانگنی چاہیے۔",
                "آپ ﷺ نے 'حوالينا ولا علينا' کہہ کر اعتدال کی تعلیم دی۔",
                "بارش کو بالکل ختم کرنے کی بجائے اسے کارآمد جگہوں پر منتقل کرنے کی دعا مانگی۔"
              ],
              "english": [
                "When rain exceeds limits, one should pray to avoid its harmful effects.",
                "The Prophet (PBUH) taught moderation by saying 'around us, not on us'.",
                "Instead of asking for it to cease, he prayed to move it to useful areas."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقصان سے تحفظ",
              "english": "Protection from Harm"
            },
            "content": {
              "urdu": [
                "راستوں کا بند ہونا اور مال کا ہلاک ہونا انسانی زندگی کو مشکل بناتا ہے۔",
                "دین اسلام جان و مال کی حفاظت کو اولین ترجیح دیتا ہے۔",
                "مومن کو ہر تنگی میں اللہ ہی کی طرف رجوع کرنا چاہیے۔"
              ],
              "english": [
                "The blockage of roads and loss of wealth makes human life difficult.",
                "Islam gives top priority to the protection of life and property.",
                "A believer must turn to Allah in every state of hardship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی فوائد",
        "english": "Educational and Moral Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا توکل",
              "english": "Trust of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام کا یہ پختہ ایمان تھا کہ تمام خیر اللہ کے ہاتھ میں ہے۔",
                "وہ اپنی ہر چھوٹی بڑی ضرورت کے لیے نبی ﷺ کے وسیلے سے دعا کرتے تھے۔",
                "مشکلات میں گھبرانے کی بجائے اللہ سے تعلق مضبوط کرنا چاہیے ہو نا چاہیے۔"
              ],
              "english": [
                "The Sahaba had firm faith that all goodness lies in the hand of Allah.",
                "They would seek supplications through the Prophet (PBUH) for every need.",
                "Instead of panicking during crises, one should strengthen the bond with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی شفقت",
              "english": "Compassion of the Prophet"
            },
            "content": {
              "urdu": [
                "نبی ﷺ اپنی امت کی تکالیف کو دیکھ کر بے چین ہو جاتے تھے۔",
                "آپ ﷺ نے دوران خطبہ بھی سائل کی ضرورت کو اہمیت دی۔",
                "ایک لیڈر کو اپنی عوام کی ضروریات کا ہر وقت خیال رکھنا چاہیے۔"
              ],
              "english": [
                "The Prophet (PBUH) would become restless witnessing the suffering of his Ummah.",
                "He gave importance to the questioner's need even during the sermon.",
                "A leader should always be mindful of the needs of his people."
              ]
            }
          }
        ]
      }
    }
  ]
}
