{
  "hadithId": 765,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/765"],
    "kitabId": 7,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 55
  },
 
  "takhreej": {
    "arabic": "ضعيف.‏ رواه ابن ماجه (2289). في إسناده نصر بن القاسم، وهو مجهول، وزيد بن أسلم مدلس ولم يصرح بالسماع، لذا ضعف الحافظ إسناده.",
    "urdu": "ضعیف۔ اسے ابن ماجہ (2289) نے روایت کیا ہے۔ اس کی سند میں نصر بن قاسم مجہول راوی ہے اور زید بن اسلم مدلس ہیں، جس کی وجہ سے حافظ ابن حجر نے اسے ضعیف قرار دیا۔",
    "english": "Weak. Reported by Ibn Majah (2289). The chain contains Nasr bin al-Qasim, who is unknown (Majhul), and Zaid bin Aslam, who is a Mudallis, making the narration technically weak."
  },
  "importantWords": [
    {
      "arabic": "اَلْبَرَكَةُ",
      "english": "Blessing",
      "urdu": "برکت"
    },
    {
      "arabic": "إِلَى أَجَلٍ",
      "english": "For a fixed period",
      "urdu": "ایک مدت تک"
    },
    {
      "arabic": "اَلْمُقَارَضَةُ",
      "english": "Profit sharing partnership",
      "urdu": "مضاربت / سرمایہ کاری"
    },
    {
      "arabic": "اَلْبُرِّ",
      "english": "Wheat",
      "urdu": "گندم"
    },
    {
      "arabic": "لِلْبَيْتِ",
      "english": "For the house/home use",
      "urdu": "گھر کے لیے"
    },
    {
      "arabic": "لَا لِلْبَيْعِ",
      "english": "Not for sale",
      "urdu": "فروخت کے لیے نہیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تین ایسے معاشی اور گھریلو اعمال کا ذکر ہے جو برکت کا باعث بنتے ہیں: ادھار لین دین، نفع میں شراکت داری، اور گھریلو کفایت شعاری۔",
    "english": "This Hadith highlights three economic and domestic practices that bring barakah: deferred payment sales, profit-sharing partnerships, and economical home management."
  },
  "references": [
    {
      "arabic": "رواه ابن ماجه (2289)",
      "english": "Reported by Ibn Majah (2289)"
    },
    {
      "arabic": "التلخيص الحبير (3/58)",
      "english": "At-Talkhis al-Habir (3/58)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "صهيب بن سنان الرومي",
        "english": "Suhaib bin Sinan ar-Rumi"
      },
      "slug": "suhaib-ar-rumi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تجارت اور لین دین میں برکت",
        "english": "Blessing in Trade and Transactions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادھار بیع (البیع الی اجل)",
              "english": "Deferred Payment Sales"
            },
            "content": {
              "urdu": [
                "ایسی بیع جس میں قیمت کی ادائیگی کے لیے وقت مقرر کیا جائے، اس میں برکت رکھی گئی ہے۔",
                "یہ طریقہ خریدار کے لیے آسانی پیدا کرتا ہے جس سے کاروبار میں وسعت آتی ہے۔",
                "شرط یہ ہے کہ وقت متعین ہو اور فریقین کے درمیان کوئی ابہام نہ رہے۔"
              ],
              "english": [
                "Sales where the price is paid at a later fixed time are said to contain blessing.",
                "This method provides ease for the buyer, which ultimately expands business activity.",
                "The condition is that the duration must be fixed to avoid ambiguity and disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "مضاربت اور شراکت داری",
              "english": "Mudarabah and Partnership"
            },
            "content": {
              "urdu": [
                "المقارضہ (مضاربت) سے مراد ایک کا سرمایہ اور دوسرے کی محنت پر مبنی کاروبار ہے۔",
                "اس سے مال گردش میں رہتا ہے اور معاشرے کے مختلف طبقات مستفید ہوتے ہیں۔",
                "اسلامی معیشت میں برکت کا ایک بڑا ذریعہ محنت اور سرمائے کا منصفانہ جوڑ ہے۔"
              ],
              "english": [
                "Muqaradah (Mudarabah) refers to a partnership where one provides capital and the other labor.",
                "This keeps wealth in circulation and benefits various segments of society.",
                "In Islamic economics, a major source of blessing is the fair union of labor and capital."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گھریلو کفایت شعاری اور دیانتداری",
        "english": "Domestic Economy and Integrity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گندم اور جو کا ملاپ",
              "english": "Mixing Wheat and Barley"
            },
            "content": {
              "urdu": [
                "گھر کے استعمال کے لیے قیمتی گندم میں سستا جو ملانا کفایت شعاری کی علامت ہے۔",
                "یہ عمل برکت کا باعث ہے کیونکہ اس سے رزق میں وسعت اور شکر گزاری پیدا ہوتی ہے۔",
                "جو کی آمیزش صحت کے لیے بھی مفید ہے اور سنتِ نبوی کے قریب ہے۔"
              ],
              "english": [
                "Mixing expensive wheat with cheaper barley for home consumption is a sign of thriftiness.",
                "This practice brings blessing as it encourages gratitude and stretches resources.",
                "Adding barley is also health-promoting and aligns with the lifestyle of the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تجارتی ملاوٹ کی ممانعت",
              "english": "Prohibition of Adulteration for Sale"
            },
            "content": {
              "urdu": [
                "حدیث میں واضح کیا گیا کہ اشیاء کو ملا کر بیچنا جائز نہیں کیونکہ یہ دھوکہ دہی ہے۔",
                "گھر کے لیے ملاوٹ جائز ہے مگر گاہک کو بتائے بغیر ملا ہوا مال بیچنا حرام ہے۔",
                "دیانتداری برکت کی بنیاد ہے، جبکہ دھوکہ دہی برکت کو ختم کر دیتی ہے۔"
              ],
              "english": [
                "The Hadith clarifies that mixing goods for sale is prohibited as it constitutes fraud.",
                "Mixing is allowed for personal use, but selling mixed goods as pure is haram.",
                "Integrity is the foundation of barakah, while deception erases it completely."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی فقہی و اسنادی حیثیت",
        "english": "Juristic and Chain Analysis"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعف کے باوجود مفہوم کی درستی",
              "english": "Authentic Meaning Despite Weak Chain"
            },
            "content": {
              "urdu": [
                "اگرچہ اس روایت کی سند ضعیف ہے، مگر اس کے اجزاء دیگر صحیح دلائل سے ثابت ہیں۔",
                "ادھار بیع اور مضاربت کے جواز پر تمام فقہاء کا اتفاق ہے۔",
                "دھوکہ دہی کی ممانعت اسلام کے بنیادی اصولوں میں شامل ہے۔"
              ],
              "english": [
                "Although the chain is weak, its individual components are supported by other Sahih proofs.",
                "All jurists agree on the permissibility of deferred sales and profit-sharing partnerships.",
                "The prohibition of deception is among the core fundamental principles of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "برکت کا حصول",
              "english": "Attaining Barakah"
            },
            "content": {
              "urdu": [
                "برکت کا مطلب مال کا زیادہ ہونا نہیں بلکہ اس کے نفع بخش ہونے میں ہے۔",
                "شرعی حدود میں رہتے ہوئے کی جانے والی تجارت اللہ کی رحمت کا باعث بنتی ہے۔",
                "سادگی اور قناعت گھریلو زندگی میں برکت کے بنیادی ستون ہیں۔"
              ],
              "english": [
                "Barakah does not mean quantity of wealth, but rather its benefit and sufficiency.",
                "Trade conducted within Shariah boundaries invites the mercy of Allah.",
                "Simplicity and contentment are the pillars of blessing in domestic life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروبار میں شراکت داری",
              "english": "Encouraging Partnerships"
            },
            "content": {
              "urdu": [
                "صرف اپنے سرمائے پر بھروسہ کرنے کے بجائے دوسروں کے ہنر کو ساتھ ملائیں۔",
                "شراکت داری سے رزق کے دروازے کھلتے ہیں اور سماجی تعلقات مضبوط ہوتے ہیں۔",
                "معاملات کو لکھت پڑھت کے ذریعے واضح رکھیں تاکہ برکت برقرار رہے۔"
              ],
              "english": [
                "Instead of relying solely on your capital, involve the skills of others.",
                "Partnerships open doors to provision and strengthen social bonds.",
                "Keep dealings clear through documentation to ensure blessing remains."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفایت شعاری اپنائیں",
              "english": "Adopting Frugality"
            },
            "content": {
              "urdu": [
                "گھریلو اخراجات میں میانہ روی اختیار کرنا سنتِ صحابہ ہے۔",
                "غیر ضروری اسراف سے بچ کر مال میں برکت پیدا کی جا سکتی ہے۔",
                "رزق کی قدر کریں اور اسے ضائع ہونے سے بچائیں۔"
              ],
              "english": [
                "Moderation in household spending is a tradition of the Companions.",
                "Blessing in wealth is created by avoiding unnecessary extravagance.",
                "Value your provision (rizq) and prevent it from being wasted."
              ]
            }
          }
        ]
      }
    }
  ]
}