{
  "hadithId": 759,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/7/67"
    ],
    "kitabId": 7,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام",
    "babId": 53
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري ( 67 )‏، ومسلم ( 1679 )‏، وهو جزء من خطبة الوداع الشهيرة التي أرسى فيها قواعد حقوق الإنسان.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (67) اور امام مسلم (1679) نے روایت کیا ہے۔ یہ خطبہ حجۃ الوداع کا حصہ ہے جس میں انسانی حقوق کی بنیادیں رکھی گئیں۔",
    "english": "Sahih. Reported by Al-Bukhari (67) and Muslim (1679). It is part of the famous Farewell Sermon (Khutbah Hajjat-ul-Wida) where the Prophet (ﷺ) established universal human rights."
  },
  "importantWords": [
    {
      "arabic": "دِمَاءَكُمْ",
      "english": "Your blood / Lives",
      "urdu": "تمہارے خون / جانیں"
    },
    {
      "arabic": "أَمْوَالَكُمْ",
      "english": "Your wealth / property",
      "urdu": "تمہارے اموال"
    },
    {
      "arabic": "أَعْرَاضَكُمْ",
      "english": "Your honor / dignity",
      "urdu": "تمہاری آبروئیں / عزتیں"
    },
    {
      "arabic": "حَرَامٌ",
      "english": "Sacred / Forbidden to violate",
      "urdu": "حرام / قابلِ احترام"
    },
    {
      "arabic": "يَوْمِ اَلنَّحْرِ",
      "english": "The Day of Sacrifice",
      "urdu": "قربانی کا دن (10 ذوالحجہ)"
    },
    {
      "arabic": "بِمِنًى",
      "english": "At Mina",
      "urdu": "مقامِ منیٰ میں"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے مسلمانوں کی جان، مال اور عزت کو مکہ، ذوالحجہ اور یومِ نحر کی طرح مقدس اور ناقابلِ احترام قرار دیا ہے۔",
    "english": "The Prophet (ﷺ) declared the life, property, and honor of every Muslim as sacred as the sanctity of Makkah, the month of Dhul-Hijjah, and the Day of Sacrifice."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (67)",
      "english": "Sahih al-Bukhari (67)"
    },
    {
      "arabic": "صحيح مسلم (1679)",
      "english": "Sahih Muslim (1679)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكرة الثقفي",
        "english": "Abu Bakra Ath-Thaqafi"
      },
      "slug": "abu-bakra"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9j_vM94nks",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انسانی حقوق کا عالمی چارٹر",
        "english": "Universal Charter of Human Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جان کی حرمت",
              "english": "Sanctity of Life"
            },
            "content": {
              "urdu": [
                "کسی بھی مسلمان کا ناحق خون بہانا کعبہ کی حرمت پامال کرنے سے بڑا گناہ ہے۔",
                "اسلام انسانی جان کو سب سے زیادہ اہمیت دیتا ہے اور ناحق قتل سے روکتا ہے۔",
                "جان کا تحفظ معاشرے کے استحکام اور امن کے لیے ناگزیر ہے۔"
              ],
              "english": [
                "Unjustly shedding the blood of a Muslim is a greater sin than violating the Ka'bah.",
                "Islam prioritizes human life above all and strictly prohibits unlawful killing.",
                "The protection of life is indispensable for social stability and peace."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالی تحفظ کا حق",
              "english": "Right to Property Protection"
            },
            "content": {
              "urdu": [
                "کسی کا مال اس کی اجازت کے بغیر لینا یا قبضہ کرنا قطعاً حرام ہے۔",
                "اسلامی معاشرے میں نجی ملکیت کو قانونی اور اخلاقی تحفظ حاصل ہے۔",
                "چوری، ڈاکہ اور غصب جیسے جرائم انسانی حقوق کی سنگین خلاف ورزی ہیں۔"
              ],
              "english": [
                "Taking or seizing someone's property without their consent is strictly forbidden.",
                "Private ownership enjoys legal and moral protection in an Islamic society.",
                "Crimes like theft, robbery, and usurpation are grave violations of human rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عزت اور آبرو کا تحفظ",
        "english": "Protection of Honor and Dignity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کردار کشی کی ممانعت",
              "english": "Prohibition of Character Assassination"
            },
            "content": {
              "urdu": [
                "کسی کی عزت اچھالنا، غیبت کرنا یا بہتان لگانا شرعی طور پر جرم ہے۔",
                "مومن کی آبرو بھی اتنی ہی مقدس ہے جتنا کہ اس کا مال اور جان۔",
                "معاشرتی اخلاقیات کا تقاضا ہے کہ ہر فرد کی عزتِ نفس کا خیال رکھا جائے۔"
              ],
              "english": [
                "Defaming someone, backbiting, or slandering is a legal and moral crime.",
                "A believer's honor is as sacred as their wealth and life.",
                "Social ethics demand that the self-respect of every individual be maintained."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیبت اور بدگوئی کا علاج",
              "english": "Remedy for Backbiting"
            },
            "content": {
              "urdu": [
                "زبان کی لغزشیں معاشرتی فساد اور نفرت کا سب سے بڑا ذریعہ ہیں۔",
                "نبی کریم ﷺ نے عزتوں کی حرمت کا ذکر کر کے زبان کی حفاظت کی تاکید کی۔",
                "ایک دوسرے کا وقار بلند کرنا اسلامی اخوت کا بنیادی تقاضا ہے۔"
              ],
              "english": [
                "Slips of the tongue are the greatest source of social discord and hatred.",
                "The Prophet (ﷺ) emphasized guarding the tongue by mentioning the sanctity of honor.",
                "Upholding each other's dignity is a fundamental requirement of Islamic brotherhood."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زمان و مکان کی حرمت سے موازنہ",
        "english": "Comparison with Sanctity of Time and Space"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذوالحجہ اور مکہ کی عظمت",
              "english": "Greatness of Dhul-Hijjah and Makkah"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے حرمت والے مہینے اور شہر کی مثال دے کر بات کو واضح کیا۔",
                "اہلِ عرب زمانہ جاہلیت میں بھی ان چیزوں کی حرمت کے قائل تھے۔",
                "یہ اسلوبِ بیان مخاطب کے دل میں انسانی حقوق کی اہمیت بٹھانے کے لیے تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified the matter by giving examples of the sacred month and city.",
                "Even in pre-Islamic times, Arabs acknowledged the sanctity of these entities.",
                "This style of speech was meant to instill the importance of human rights in the listeners' hearts."
              ]
            }
          },
          {
            "title": {
              "urdu": "حجۃ الوداع کا پیغام",
              "english": "The Message of the Farewell Pilgrimage"
            },
            "content": {
              "urdu": [
                "یہ پیغام قیامت تک آنے والے تمام انسانوں کے لیے ایک پائیدار منشور ہے۔",
                "اس خطبے نے طبقہ واریت اور ظلم کے خاتمے کا اعلان کیا۔",
                "اسلام نے ان حقوق کو مذہبی عبادات کی طرح مقدس بنا دیا ہے۔"
              ],
              "english": [
                "This message is a lasting manifesto for all of humanity until the Day of Judgment.",
                "This sermon declared an end to class discrimination and oppression.",
                "Islam has made these rights as sacred as religious acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "ہر مسلمان دوسرے مسلمان کی جان و مال کا محافظ ہے۔",
                "ظلم کے خلاف آواز اٹھانا اور مظلوم کی مدد کرنا ہر مومن کا فرض ہے۔",
                "قانون کی بالادستی اور عدل کا قیام اسلامی ریاست کی بنیاد ہے۔"
              ],
              "english": [
                "Every Muslim is a guardian of another Muslim's life and property.",
                "Speaking out against injustice and helping the oppressed is a duty for every believer.",
                "The supremacy of law and the establishment of justice is the foundation of an Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوفِ خدا اور احتساب",
              "english": "Fear of Allah and Accountability"
            },
            "content": {
              "urdu": [
                "حقوق العباد کی پامالی آخرت میں ناکامی کا سب سے بڑا سبب ہے۔",
                "انسان کو ہر وقت یاد رکھنا چاہیے کہ وہ اپنے اعمال کا جوابدہ ہے۔",
                "اسلامی تعلیمات پر عمل ہی انسانیت کی حقیقی نجات کا راستہ ہے۔"
              ],
              "english": [
                "Violating the rights of others is the greatest cause of failure in the hereafter.",
                "A person must always remember that they are accountable for their actions.",
                "Following Islamic teachings is the only path to the true salvation of humanity."
              ]
            }
          }
        ]
      }
    }
  ]
}