{
  "hadithId": 1271,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/ibnmajah:4102"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزهد",
    "babId": 104
  },
 
  "takhreej": {
    "arabic": "رواه ابن ماجه (4102)، والحاكم (4/313)، والطبراني في الكبير (6/193). والحديث بمجموع طرقه وشواهده حسن كما قال النووي في الأربعين والعراقي وغيرهم.",
    "urdu": "اسے ابن ماجہ نے روایت کیا ہے۔ اگرچہ انفرادی طور پر اس کی سند میں کلام ہے، لیکن اپنے متعدد شواہد اور متابعات کی بنا پر یہ حدیث 'حسن' کے درجے پر فائز ہے، جیسا کہ امام نووی اور علامہ البانی رحمہ اللہ نے تصدیق کی ہے۔",
    "english": "Reported by Ibn Majah (4102) and Al-Hakim. While individual chains may have weaknesses, the Hadith is graded 'Hasan' due to its multiple corroborating routes, as confirmed by Imam An-Nawawi and Al-Albani."
  },
  "importantWords": [
    {
      "arabic": "اِزْهَدْ",
      "english": "Be detached / Practice Zuhd",
      "urdu": "بے رغبت ہو جا / زہد اختیار کر"
    },
    {
      "arabic": "دُلَّنِي",
      "english": "Guide me / Direct me",
      "urdu": "میری رہنمائی کریں"
    },
    {
      "arabic": "أَحَبَّنِي",
      "english": "Loves me",
      "urdu": "مجھ سے محبت کرے"
    },
    {
      "arabic": "عِنْدَ اَلنَّاسِ",
      "english": "In the possession of people",
      "urdu": "جو لوگوں کے پاس ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اللہ اور مخلوق کی محبت پانے کا جامع نسخہ بیان کیا گیا ہے: اللہ کی محبت دنیا سے بے رغبتی (زہد) میں ہے، اور لوگوں کی محبت ان کے مال و دولت کی تمنا نہ کرنے میں ہے۔",
    "english": "This Hadith provides a comprehensive formula for attaining the love of Allah and people: detachment from the world leads to Allah's love, and lack of greed for people's possessions leads to their love."
  },
  "references": [
    {
      "arabic": "ابن ماجه (4102)",
      "english": "Ibn Majah (4102)"
    },
    {
      "arabic": "الأربعون النووية (31)",
      "english": "An-Nawawi's 40 Hadith (31)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سهل بن سعد الساعدي",
        "english": "Sahl bin Sa'd al-Sa'idi"
      },
      "slug": "sahl-bin-sad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زہد کی حقیقت اور اللہ کی محبت",
        "english": "The Reality of Zuhd and Allah's Love"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زہد کا صحیح مفہوم",
              "english": "The Correct Meaning of Zuhd"
            },
            "content": {
              "urdu": [
                "زہد کا مطلب دنیا کو ترک کرنا نہیں بلکہ دنیا کی محبت کو دل سے نکالنا ہے۔",
                "حضرت علیؓ کے مطابق زہد یہ ہے کہ جو چیز تمہارے ہاتھ میں ہے اس سے زیادہ اس پر بھروسہ ہو جو اللہ کے پاس ہے۔",
                "جب بندہ دنیا کو آخرت کے مقابلے میں ہیچ سمجھتا ہے تو اللہ اسے اپنا محبوب بنا لیتا ہے۔"
              ],
              "english": [
                "Zuhd does not mean abandoning the world, but removing the love of the world from the heart.",
                "According to Ali (RA), Zuhd is to trust more in what is with Allah than what is in your own hand.",
                "When a servant views the world as insignificant compared to the Hereafter, Allah loves them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لوگوں کی محبت کا راز",
        "english": "The Secret to People's Love"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استغنا اور بے نیازی",
              "english": "Self-Sufficiency and Independence"
            },
            "content": {
              "urdu": [
                "لوگ اس شخص کو ناپسند کرتے ہیں جو ان کے مال پر نظر رکھتا ہے یا ان سے مانگتا ہے۔",
                "جب آپ لوگوں کے مال و جاہ سے بے نیاز ہو جاتے ہیں، تو آپ ان کی نظر میں معزز بن جاتے ہیں۔",
                "حرص اور لالچ سے پاک انسان ہی سماجی طور پر ہر دلعزیز ہوتا ہے۔"
              ],
              "english": [
                "People dislike those who eye their wealth or constantly ask from them.",
                "When you become independent of people's possessions, you gain respect in their eyes.",
                "A person free from greed and avarice naturally becomes beloved to society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور سماجی حکمت",
        "english": "Spiritual and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قناعت کی برکت",
              "english": "The Blessing of Contentment"
            },
            "content": {
              "urdu": [
                "زہد اور استغنا سے انسان کو حقیقی قلبی سکون حاصل ہوتا ہے۔",
                "یہ طرزِ عمل حسد جیسے گناہ سے بچنے میں مددگار ثابت ہوتا ہے۔",
                "اللہ کی رضا پر راضی رہنا ہی دونوں جہانوں کی کامیابی کی کنجی ہے۔"
              ],
              "english": [
                "Zuhd and self-sufficiency provide true tranquility of the heart.",
                "This attitude helps in avoiding sins like envy (Hasad).",
                "Being pleased with Allah's decree is the key to success in both worlds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عملی اقدامات",
              "english": "Actionable Steps"
            },
            "content": {
              "urdu": [
                "اپنی ضروریات کے لیے صرف اللہ کی طرف رجوع کریں، بندوں سے امیدیں نہ وابستہ کریں۔",
                "دنیاوی آسائشوں کو مقصد کے بجائے صرف ضرورت کی حد تک استعمال کریں۔",
                "اپنے اخلاق کو بہتر بنائیں تاکہ اللہ اور اس کی مخلوق آپ سے راضی ہو۔"
              ],
              "english": [
                "Turn only to Allah for your needs; do not attach hopes to created beings.",
                "Use worldly comforts as a means, not as the end goal of life.",
                "Improve your character so that Allah and His creation are pleased with you."
              ]
            }
          }
        ]
      }
    }
  ]
}