{
  "hadithId": 1177,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/13/7"],
    "kitabId": 13,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 96
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6663) موقوفاً، ورواه أبو داود (3254) مرفوعاً وصححه الدارقطني.",
    "urdu": "یہ حدیث صحیح ہے۔ امام بخاری نے اسے سیدہ عائشہ کے قول (موقوف) کے طور پر روایت کیا ہے، جبکہ ابوداؤد نے اسے نبی ﷺ کے فرمان (مرفوع) کے طور پر روایت کیا ہے۔ دارقطنی نے بھی اس کی تصحیح کی ہے۔",
    "english": "Sahih. Reported by al-Bukhari (6663) as a Mauquf narration (from Aisha), and by Abu Dawud (3254) as Marfu' (from the Prophet ﷺ). Ad-Daraqutni also graded it Sahih."
  },
  "importantWords": [
    {
      "arabic": "اللَّغْوِ",
      "english": "Unintentional / Vain",
      "urdu": "لغو / بے مقصد"
    },
    {
      "arabic": "أَيْمَانِكُمْ",
      "english": "Your oaths",
      "urdu": "تمہاری قسمیں"
    },
    {
      "arabic": "لَا يُؤَاخِذُكُمُ",
      "english": "He will not punish you",
      "urdu": "وہ تم سے مواخذہ نہیں کرے گا"
    },
    {
      "arabic": "بَلَى",
      "english": "Yes / Indeed",
      "urdu": "ہاں / کیوں نہیں"
    },
    {
      "arabic": "مَرْفُوعاً",
      "english": "Attributed to the Prophet",
      "urdu": "نبی ﷺ کا فرمان"
    }
  ],
  "summary": {
    "urdu": "بات چیت کے دوران عادتاً کھائی جانے والی وہ قسمیں جن میں دل کا ارادہ شامل نہ ہو، لغو کہلاتی ہیں اور ان پر کوئی کفارہ یا گناہ نہیں ہے۔",
    "english": "Oaths taken habitually during conversation without a sincere heart's intent are considered 'vain' (Laghw) and do not require expiation or punishment."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6663)",
      "english": "Sahih al-Bukhari (6663)"
    },
    {
      "arabic": "سنن أبي داود (3254)",
      "english": "Sunan Abi Dawud (3254)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=fXWf_M-qC4o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لغو قسم کی تعریف",
        "english": "Definition of Laghw Oath"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عادتاً کھائی گئی قسم",
              "english": "Habitual Swearing"
            },
            "content": {
              "urdu": [
                "لغو قسم سے مراد وہ الفاظ ہیں جو انسان کی زبان پر بغیر ارادے کے چڑھے ہوتے ہیں۔",
                "مثلاً گفتگو میں بات کو مؤکد کرنے کے لیے بار بار 'اللہ کی قسم' کہنا۔",
                "ایسی قسم میں دل کی نیت اور ارادہ شامل نہیں ہوتا، بلکہ یہ محض تکیہ کلام ہوتا ہے۔"
              ],
              "english": [
                "Laghw refers to oaths that slip from the tongue habitually without real intent.",
                "An example is saying 'By Allah' repeatedly to emphasize points in daily talk.",
                "In such oaths, the heart does not intend a binding contract, it's just a mannerism."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدمِ مواخذہ کی وجہ",
              "english": "Reason for No Accountability"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ دلوں کے ارادوں پر پکڑ فرماتا ہے، محض زبان کی لغزشوں پر نہیں۔",
                "چونکہ اس میں اللہ کی عظمت کو جان بوجھ کر کم نہیں کیا گیا، اس لیے گناہ نہیں۔",
                "دینِ اسلام انسانی کمزوریوں کو مدنظر رکھتے ہوئے آسانی اور وسعت فراہم کرتا ہے۔"
              ],
              "english": [
                "Allah holds one accountable for heart's intentions, not mere slips of the tongue.",
                "Since there's no deliberate intent to misuse Allah's name, there is no sin.",
                "Islam provides ease and scope by taking human frailties into account."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قسموں کی دیگر اقسام",
        "english": "Other Types of Oaths"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یمینِ منعقدہ کا حکم",
              "english": "Binding Oaths (Yamin Mun'aqidah)"
            },
            "content": {
              "urdu": [
                "جس قسم میں دل کا ارادہ شامل ہو، اسے یمینِ منعقدہ کہتے ہیں۔",
                "ایسی قسم کو توڑنے کی صورت میں شرعی کفارہ ادا کرنا واجب ہوتا ہے۔",
                "یہ لغو قسم سے بالکل مختلف ہے کیونکہ اس میں انسان شعوری وعدہ کرتا ہے۔"
              ],
              "english": [
                "An oath taken with a deliberate intention is called 'Mun'aqidah' (binding).",
                "If such an oath is broken, it is mandatory to pay the legal expiation.",
                "This differs from Laghw because it involves a conscious pledge by the person."
              ]
            }
          },
          {
            "title": {
              "urdu": "یمینِ غموس کی سنگینی",
              "english": "The Gravity of False Oaths"
            },
            "content": {
              "urdu": [
                "جان بوجھ کر کسی کا حق مارنے کے لیے جھوٹی قسم کھانا یمینِ غموس ہے۔",
                "یہ گناہِ کبیرہ ہے جس کا کوئی کفارہ نہیں، بلکہ توبہ اور تلافی ضروری ہے۔",
                "لغو قسم اور غموس کے درمیان نیت اور سچائی کا واضح فرق موجود ہے۔"
              ],
              "english": [
                "Intentionally taking a false oath to usurp rights is called 'Yamin al-Ghamus'.",
                "This is a major sin with no expiation; only repentance and redress suffice.",
                "There is a clear distinction between Laghw and Ghamus regarding intent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی رہنمائی",
        "english": "Juristic and Ethical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی پاکیزگی",
              "english": "Purity of Speech"
            },
            "content": {
              "urdu": [
                "اگرچہ لغو قسم پر گناہ نہیں، مگر زبان کو اس کا عادی بنانا ناپسندیدہ ہے۔",
                "اللہ کے نام کی تعظیم کا تقاضا ہے کہ اسے کثرت سے لغو باتوں میں نہ لایا جائے۔",
                "مومن کی گفتگو وقار اور سنجیدگی پر مبنی ہونی چاہیے تاکہ جھوٹ کا شائبہ نہ ہو۔"
              ],
              "english": [
                "Though Laghw carries no sin, making the tongue habitual to it is disliked.",
                "Veneration of Allah's name requires not using it excessively in idle talk.",
                "A believer's speech should be dignified and serious to avoid the hint of lies."
              ]
            }
          },
          {
            "title": {
              "urdu": "معافی اور درگزر",
              "english": "Forgiveness and Forbearance"
            },
            "content": {
              "urdu": [
                "آیتِ قرآنی کی یہ تفسیر اللہ کی صفتِ غفور و رحیم ہونے کی دلیل ہے۔",
                "اللہ اپنے بندوں پر بوجھ نہیں ڈالتا اور نادانستہ خطاؤں کو معاف فرماتا ہے۔",
                "ہمیں بھی اللہ کے احکام کو سمجھ کر اپنی زندگی میں اعتدال لانا چاہیے۔"
              ],
              "english": [
                "This interpretation of the Verse proves Allah's attribute as Most Forgiving.",
                "Allah does not burden His servants and forgives unintentional mistakes.",
                "We should understand Allah's commands to bring moderation into our lives."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکرِ الہی کا صحیح استعمال",
              "english": "Correct Use of Allah's Mention"
            },
            "content": {
              "urdu": [
                "اللہ کا نام تسبیح، دعا اور ضروری قسم کے لیے محفوظ رکھنا چاہیے۔",
                "لغو قسموں سے بچنے کے لیے کلمہ طیبہ یا استغفار کا عادی بننا بہتر ہے۔",
                "زبان کا صحیح استعمال انسان کے اخلاق اور ایمان کی بلندی کا ضامن ہے۔"
              ],
              "english": [
                "Allah's name should be reserved for Tasbih, Dua, and necessary oaths.",
                "To avoid Laghw oaths, it is better to habituate Kalima or Istighfar instead.",
                "Correct use of the tongue ensures the height of one's ethics and faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآنی تعلیمات کی فہم",
              "english": "Understanding Quranic Teachings"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کی یہ تفسیر ہمیں قرآن کے عملی پہلوؤں کو سمجھنے میں مدد دیتی ہے۔",
                "صحابہ کرام کے آثار سے قرآنی احکام کی باریکیاں واضح ہوتی ہیں۔",
                "دین کے ہر معاملے میں مستند تفاسیر اور احادیث کی طرف رجوع کرنا لازم ہے۔"
              ],
              "english": [
                "Aisha's (RA) tafsir helps us understand the practical aspects of the Quran.",
                "The narrations of the Companions clarify the nuances of Quranic rulings.",
                "It is mandatory to refer to authentic tafsir and hadith in religious matters."
              ]
            }
          }
        ]
      }
    }
  ]
}