{
  "hadithId": 931,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1071"],
    "kitabId": 8,
    "inKitabBab": 10,
    "arabicBook": "كتاب الإيلاء والظهار واللعان",
    "babId": 73
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5291). والإيلاء هو الحلف على ترك جماع الزوجة، وقد حدد الله له مدة أربعة أشهر في سورة البقرة.",
    "urdu": "صحیح۔ اسے امام بخاری (5291) نے روایت کیا ہے۔ ایلاء کا مطلب یہ ہے کہ کوئی شخص اپنی بیوی سے قربت نہ کرنے کی قسم کھا لے۔ سورہ بقرہ میں اللہ تعالیٰ نے اس کے لیے چار ماہ کی حد مقرر فرمائی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5291). Ila' refers to a husband vowing not to have sexual relations with his wife. Allah established a four-month limit for this in Surah Al-Baqarah."
  },
  "importantWords": [
    {
      "arabic": "أَرْبَعَةُ أَشْهُرٍ",
      "english": "Four months",
      "urdu": "چار ماہ"
    },
    {
      "arabic": "اَلْمُؤْلِي",
      "english": "The one making Ila'",
      "urdu": "ایلاء کرنے والا"
    },
    {
      "arabic": "وَقَفَ",
      "english": "Detained / Stopped",
      "urdu": "روکا جائے / پیش کیا جائے"
    },
    {
      "arabic": "يُطَلِّقَ",
      "english": "He divorces",
      "urdu": "وہ طلاق دے"
    },
    {
      "arabic": "لَا يَقَعُ",
      "english": "Does not occur",
      "urdu": "واقع نہیں ہوگی"
    }
  ],
  "summary": {
    "urdu": "ایلاء (بیوی سے الگ رہنے کی قسم) کی چار ماہ کی مدت پوری ہونے پر شوہر کو مجبور کیا جائے گا کہ وہ یا تو رجوع کرے یا طلاق دے؛ طلاق خود بخود واقع نہیں ہوتی۔",
    "english": "After the four-month period of Ila' expires, the husband is compelled to either reconcile or divorce; divorce is not automatic upon the lapse of time."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5291)",
      "english": "Sahih al-Bukhari (5291)"
    },
    {
      "arabic": "فتح الباري شرح صحيح البخاري",
      "english": "Fath al-Bari (Exegesis of Sahih Bukhari)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar bin al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایلاء کی تعریف اور مدت",
        "english": "Definition and Duration of Ila'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایلاء کا مفہوم",
              "english": "Meaning of Ila'"
            },
            "content": {
              "urdu": [
                "ایلاء سے مراد شوہر کا قسم کھانا ہے کہ وہ اپنی بیوی سے چار ماہ یا اس سے زیادہ قریب نہیں جائے گا۔",
                "زمانہ جاہلیت میں لوگ عورتوں کو لٹکائے رکھنے کے لیے طویل مدت تک ایلاء کرتے تھے۔",
                "اسلام نے اس عمل کی اصلاح کی اور عورت کے حق کے تحفظ کے لیے چار ماہ کی حد مقرر فرمائی۔"
              ],
              "english": [
                "Ila' refers to a husband's oath not to have sexual relations with his wife for four months or more.",
                "In the pre-Islamic era, men used Ila' indefinitely to leave women in a state of limbo.",
                "Islam reformed this and set a four-month limit to protect the rights of the wife."
              ]
            }
          },
          {
            "title": {
              "urdu": "چار ماہ کی شرعی اہمیت",
              "english": "Shariah Significance of Four Months"
            },
            "content": {
              "urdu": [
                "قرآن حکیم کے مطابق ایلاء کرنے والوں کے لیے چار ماہ انتظار کی مہلت ہے۔",
                "یہ مدت عورت کے صبر اور نفسیاتی ضرورت کے پیشِ نظر مقرر کی گئی ہے۔",
                "اس عرصے کے دوران شوہر کو اپنے فیصلے پر غور کرنے کا موقع دیا جاتا ہے۔"
              ],
              "english": [
                "According to the Quran, those who take such an oath have a waiting period of four months.",
                "This duration is set considering a woman's patience and psychological needs.",
                "During this time, the husband is given a chance to reflect on his decision."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مدت گزرنے کے بعد کا شرعی حکم",
        "english": "Legal Ruling After the Period Expires"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالت کی مداخلت",
              "english": "Judicial Intervention"
            },
            "content": {
              "urdu": [
                "اگر چار ماہ گزر جائیں اور شوہر رجوع نہ کرے تو اسے حاکم کے سامنے پیش کیا جائے گا۔",
                "حاکم اسے مجبور کرے گا کہ وہ یا تو بیوی سے رجوع کرے یا اسے طلاق دے کر آزاد کرے۔",
                "یہ حکم عورت کو 'لٹکی ہوئی' حالت سے نکالنے کے لیے نافذ کیا جاتا ہے۔"
              ],
              "english": [
                "If four months pass without reconciliation, the husband is summoned before a judge.",
                "The judge compels him to either return to the wife or grant her a formal divorce.",
                "This ruling is enforced to prevent the wife from remaining in a state of uncertainty."
              ]
            }
          },
          {
            "title": {
              "urdu": "طلاق واقع ہونے کی صورت",
              "english": "Occurrence of Divorce"
            },
            "content": {
              "urdu": [
                "ابن عمر کے مطابق محض چار ماہ گزرنے سے طلاق خود بخود واقع نہیں ہوتی۔",
                "شوہر کا زبان سے طلاق دینا یا عدالتی فیصلہ ہونا ضروری ہے۔",
                "احناف کے نزدیک مدت گزرتے ہی طلاقِ بائن واقع ہو جاتی ہے، مگر شافعیہ و مالکیہ ابن عمر کے موقف پر ہیں۔"
              ],
              "english": [
                "According to Ibn 'Umar, divorce does not occur automatically just because four months passed.",
                "The husband must verbally pronounce it or a court decree must be issued.",
                "While Hanafis believe an irrevocable divorce occurs instantly, Shafi'is and Malikis follow Ibn 'Umar's view."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عورت کے حقوق کا تحفظ",
        "english": "Protection of Women's Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظلم کا خاتمہ",
              "english": "End of Oppression"
            },
            "content": {
              "urdu": [
                "اسلام نے مرد کو یہ حق نہیں دیا کہ وہ نکاح برقرار رکھتے ہوئے بیوی کو ازدواجی حقوق سے محروم رکھے۔",
                "ایلاء کے احکام دراصل گھریلو تشدد اور نفسیاتی اذیت کے خلاف ایک قانونی رکاوٹ ہیں۔",
                "اگر مرد تعلق نہیں رکھنا چاہتا تو اسے شرافت کے ساتھ علیحدگی اختیار کرنی چاہیے۔"
              ],
              "english": [
                "Islam does not give the man the right to withhold marital rights while keeping the marriage intact.",
                "The rulings of Ila' are a legal barrier against domestic abuse and psychological torture.",
                "If a man does not wish to continue the relationship, he must part ways with kindness."
              ]
            }
          },
          {
            "title": {
              "urdu": "رجوع کی ترغیب",
              "english": "Encouragement of Reconciliation"
            },
            "content": {
              "urdu": [
                "اگر شوہر چار ماہ کے اندر رجوع کر لے تو اللہ تعالیٰ معاف کرنے والا مہربان ہے۔",
                "رجوع کرنے کی صورت میں شوہر کو اپنی قسم توڑنے کا کفارہ ادا کرنا ہوگا۔",
                "اسلامی شریعت کا مقصد گھروں کو اجاڑنا نہیں بلکہ آباد رکھنا ہے۔"
              ],
              "english": [
                "If the husband reconciles within four months, Allah is Oft-Forgiving, Most Merciful.",
                "Upon reconciliation, the husband must pay the expiation for breaking his oath.",
                "The objective of Islamic Shariah is to sustain households, not to destroy them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی اسباق",
        "english": "Social and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی اہمیت",
              "english": "Importance of Discipline"
            },
            "content": {
              "urdu": [
                "ازدواجی زندگی میں غصے اور جذبات کو قانون کے تابع ہونا چاہیے۔",
                "قسموں کے ذریعے کسی کے حقوق غصب کرنا تقویٰ کے خلاف ہے۔",
                "معاشرے میں انصاف کا قیام اسی وقت ممکن ہے جب ہر شخص اپنی حدود پہچانے۔"
              ],
              "english": [
                "In marital life, anger and emotions must be subordinate to the law.",
                "Usurping someone's rights through oaths is contrary to piety (Taqwa).",
                "Establishing justice in society is only possible when everyone knows their limits."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدالتی ذمہ داری",
              "english": "Judicial Responsibility"
            },
            "content": {
              "urdu": [
                "اسلامی نظامِ عدل کو مظلوم بیوی کے حق کے لیے حرکت میں آنا چاہیے۔",
                "حاکم کا کام یہ ہے کہ وہ فریقین کے درمیان تصفیہ کروائے یا علیحدگی کروائے۔",
                "خاندانی مسائل کو لٹکائے رکھنا پورے معاشرے کے بگاڑ کا سبب بنتا ہے۔"
              ],
              "english": [
                "The Islamic judicial system must act in favor of the oppressed wife's rights.",
                "The judge's duty is to either facilitate a settlement or enforce a separation.",
                "Dragging out family issues leads to the corruption of the entire society."
              ]
            }
          }
        ]
      }
    }
  ]
}