{
  "hadithId": 674,
  "hadithNo": 27,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2158", "https://sunnah.com/muslim:1521"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2158)، ومسلم (1521). واللفظ للبخاري.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (2158) اور امام مسلم (1521) نے اسے اپنی صحیح میں روایت کیا ہے۔ یہ الفاظ امام بخاری کے ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (2158) and Muslim (1521). The wording is that of Al-Bukhari."
  },
  "importantWords": [
    {
      "arabic": "تَلَقَّوْا",
      "english": "Meet / Encounter",
      "urdu": "آگے بڑھ کر ملنا"
    },
    {
      "arabic": "الرُّكْبَانَ",
      "english": "Riders / Caravans",
      "urdu": "سوار / تجارتی قافلے"
    },
    {
      "arabic": "حَاضِرٌ",
      "english": "Town-dweller",
      "urdu": "شہری / شہر کا رہنے والا"
    },
    {
      "arabic": "بَادٍ",
      "english": "Desert-dweller",
      "urdu": "دیہاتی / بدو"
    },
    {
      "arabic": "سِمْسَارًا",
      "english": "Broker / Middleman",
      "urdu": "دلال / ایجنٹ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بازار کے فطری نظام کو برقرار رکھنے کے لیے دو باتوں سے روکا گیا ہے: ایک قافلوں کا منڈی سے باہر استقبال کر کے سستا مال خریدنا، اور دوسرا کسی شہری کا دیہاتی کا ایجنٹ بن کر قیمتوں کو مصنوعی طور پر بڑھانا۔",
    "english": "This Hadith forbids meeting caravans outside the market to buy goods cheaply and prohibits town-dwellers from acting as brokers for desert-dwellers to prevent artificial price hikes."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2158)",
      "english": "Sahih al-Bukhari (2158)"
    },
    {
      "arabic": "صحيح مسلم (1521)",
      "english": "Sahih Muslim (1521)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تلقي الرکبان کی ممانعت",
        "english": "Prohibition of Meeting Caravans"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دھوکہ دہی کا سدِ باب",
              "english": "Preventing Deception"
            },
            "content": {
              "urdu": [
                "باہر سے آنے والے تاجر منڈی کے ریٹ سے ناواقف ہوتے ہیں۔",
                "شہری تاجر کا ان سے راستے میں ملنا ان کی بے خبری کا فائدہ اٹھانے کی کوشش ہے۔",
                "اسلام نے اسے 'غرر' (دھوکہ) قرار دیا ہے کیونکہ اس سے بیچنے والے کا نقصان ہوتا ہے۔"
              ],
              "english": [
                "Traders coming from outside are often unaware of the current market prices.",
                "Meeting them on the road is an attempt by city dwellers to exploit their ignorance.",
                "Islam labels this as 'Gharar' (deception) because it causes financial harm to the seller."
              ]
            }
          },
          {
            "title": {
              "urdu": "منڈی کا نظم و ضبط",
              "english": "Market Discipline"
            },
            "content": {
              "urdu": [
                "مال کو براہِ راست منڈی پہنچنے دینا چاہیے تاکہ سب کو مساوی موقع ملے۔",
                "اگر چند لوگ باہر ہی سارا مال خرید لیں تو منڈی میں قلت پیدا ہو سکتی ہے۔",
                "یہ حکم عوام کے وسیع تر معاشی مفاد اور شفافیت کے لیے دیا گیا ہے۔"
              ],
              "english": [
                "Goods should reach the market directly so that everyone has an equal opportunity.",
                "If a few people buy all the supplies outside, it creates a shortage in the city.",
                "This ruling is for the broader economic benefit of the public and ensures transparency."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شہری کا دیہاتی کے لیے سودا کرنا",
        "english": "Town-dweller Selling for Desert-dweller"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مصنوعی مہنگائی سے بچاؤ",
              "english": "Avoiding Artificial Inflation"
            },
            "content": {
              "urdu": [
                "دیہاتی چاہتا ہے کہ اپنا مال جلدی بیچ کر واپس جائے، اس لیے وہ سستا بیچتا ہے۔",
                "اگر کوئی شہری اس کا دلال بن جائے تو وہ زیادہ نفع کے لیے مال روک لیتا ہے۔",
                "اس طرح منڈی میں قیمتیں مصنوعی طور پر بڑھ جاتی ہیں جو عام گاہک کے لیے نقصان دہ ہے۔"
              ],
              "english": [
                "A desert dweller usually wants to sell quickly and return, thus offering lower prices.",
                "If a city dweller acts as his broker, he holds the stock to drive up the price.",
                "This leads to artificial inflation, which harms the general consumers in the city."
              ]
            }
          },
          {
            "title": {
              "urdu": "دلال اور سمسار کا کردار",
              "english": "The Role of a Broker"
            },
            "content": {
              "urdu": [
                "ابن عباس نے واضح کیا کہ 'لا یبیع حاضر لباد' کا مطلب دلال نہ بننا ہے۔",
                "ایسی دلالی جو صرف قیمتیں بڑھانے کا سبب بنے، شریعت میں پسندیدہ نہیں ہے۔",
                "اسلام چاہتا ہے کہ اشیاء کی قیمتیں رسد اور طلب کے فطری اصول پر طے ہوں۔"
              ],
              "english": [
                "Ibn Abbas clarified that the phrase means not acting as a commission agent.",
                "Brokerage that exists solely to inflate prices is discouraged in Sharia.",
                "Islam wants prices to be determined by the natural laws of supply and demand."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور قانونی ابعاد",
        "english": "Juristic and Legal Dimensions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سودے کی شرعی حیثیت",
              "english": "Legal Status of the Transaction"
            },
            "content": {
              "urdu": [
                "اگر کوئی قافلے سے باہر سودا کر لے تو وہ گناہ گار ہوگا مگر سودا منعقد ہو جائے گا۔",
                "تاہم، بیچنے والے کو منڈی پہنچ کر ریٹ معلوم ہونے پر سودا منسوخ کرنے کا حق ہے۔",
                "اسے فقہ کی اصطلاح میں 'خیارِ غبن' (دھوکے کی بنا پر اختیار) کہا جاتا ہے۔"
              ],
              "english": [
                "If someone buys from a caravan outside, they sin but the deal is legally valid.",
                "However, the seller has the right to rescind the deal after learning the market rates.",
                "In jurisprudence, this is known as 'Khiyar al-Ghabn' (the option due to being cheated)."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی شرائط",
              "english": "Conditions of Prohibition"
            },
            "content": {
              "urdu": [
                "یہ ممانعت اس وقت ہے جب شہر والوں کو مال کی ضرورت ہو اور قیمتیں بڑھنے کا ڈر ہو۔",
                "اگر دیہاتی خود منڈی میں مال لائے تو اس پر کوئی پابندی نہیں ہے۔",
                "بنیادی مقصد 'ضرر' (نقصان) کو ختم کرنا ہے، چاہے وہ کسی بھی فریق کا ہو۔"
              ],
              "english": [
                "This prohibition applies when city folk need the goods and price hikes are feared.",
                "There is no restriction if the desert-dweller brings and sells the goods himself.",
                "The core objective is to eliminate 'Dharar' (harm) to any of the involved parties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی اور سماجی حکمت",
        "english": "Economic and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجارہ داری کا خاتمہ",
              "english": "End of Monopolies"
            },
            "content": {
              "urdu": [
                "اسلام مڈل مین کے ایسے کردار کو ناپسند کرتا ہے جو صرف نفع خوری کے لیے ہو۔",
                "براہِ راست پروڈیوسر اور صارف کے تعلق کو مضبوط بنانا معیشت کے لیے بہتر ہے۔",
                "اس سے مال کی قیمتیں عام آدمی کی پہنچ میں رہتی ہیں اور خیر و برکت ہوتی ہے۔"
              ],
              "english": [
                "Islam discourages the role of middlemen that exists only for excessive profiteering.",
                "Strengthening the direct link between producer and consumer is better for the economy.",
                "This ensures that prices remain affordable for the common man, bringing blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی انصاف",
              "english": "Social Justice"
            },
            "content": {
              "urdu": [
                "شہریوں کو چاہیے کہ وہ دیہاتیوں کے ساتھ خیر خواہی اور سچائی کا معاملہ کریں۔",
                "اپنے فائدے کے لیے دوسروں کی مجبوری یا لاعلمی سے فائدہ اٹھانا اخلاق کے خلاف ہے۔",
                "تجارت کو صرف مال کمانے کا ذریعہ نہیں بلکہ خدمت کا ذریعہ بھی بننا چاہیے۔"
              ],
              "english": [
                "Town-dwellers should deal with desert-dwellers with sincerity and goodwill.",
                "Exploiting others' helplessness or ignorance for personal gain is unethical.",
                "Trade should be viewed not just as a way to earn but as a form of social service."
              ]
            }
          }
        ]
      }
    }
  ]
}