{
  "hadithId": 570,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/64"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "كتاب الصيام",
    "babId": 35
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2026)، ومسلم (1172). وفيه دليل على مشروعية الاعتكاف في المسجد.",
    "urdu": "صحیح۔ اسے امام بخاری (2026) اور امام مسلم (1172) نے روایت کیا ہے۔ یہ حدیث اعتکاف کی مداومت اور خواتین کے اعتکاف پر دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2026) and Muslim (1172). This proves the established Sunnah of Itikaf for both men and women."
  },
  "importantWords": [
    {
      "arabic": "يَعْتَكِفُ",
      "english": "In seclusion / Itikaf",
      "urdu": "اعتکاف کرتے"
    },
    {
      "arabic": "اَلْعَشْرَ اَلْأَوَاخِرَ",
      "english": "The last ten nights",
      "urdu": "آخری دس دن / عشرہ"
    },
    {
      "arabic": "تَوَفَّاهُ اَللَّهُ",
      "english": "Allah took his soul",
      "urdu": "اللہ نے انہیں وفات دی"
    },
    {
      "arabic": "أَزْوَاجُهُ",
      "english": "His wives",
      "urdu": "ان کی بیویاں"
    },
    {
      "arabic": "بَعْدِهِ",
      "english": "After him",
      "urdu": "ان کے بعد"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ کا مستقل معمول رمضان کے آخری دس دن اعتکاف کرنا تھا، اور آپ ﷺ کی ازواج نے بھی اس سنت کو جاری رکھا۔",
    "english": "The Prophet (ﷺ) consistently performed Itikaf during the last ten days of Ramadan, a practice continued by his wives after his passing."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2026)",
      "english": "Reported by Al-Bukhari (2026)"
    },
    {
      "arabic": "رواه مسلم (1172)",
      "english": "Reported by Muslim (1172)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-y5kMv738",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اعتکاف کی مشروعیت اور اہمیت",
        "english": "Legality and Importance of Itikaf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتکاف ایک مستقل سنت",
              "english": "Itikaf as a Constant Sunnah"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے مدینہ منورہ تشریف لانے کے بعد اعتکاف کبھی نہیں چھوڑا۔",
                "یہ عبادت دنیا سے کٹ کر اللہ سے لو لگانے کا بہترین ذریعہ ہے۔",
                "آخری عشرے میں اعتکاف کرنا سنتِ مؤکدہ کفایہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) never abandoned Itikaf after migrating to Madinah.",
                "This worship is the best way to disconnect from the world and connect with Allah.",
                "Performing Itikaf in the last ten days is a Sunnah Mu'akkadah Kifayah."
              ]
            }
          },
          {
            "title": {
              "urdu": "لیلۃ القدر کی تلاش",
              "english": "Seeking Laylat al-Qadr"
            },
            "content": {
              "urdu": [
                "اعتکاف کا بنیادی مقصد شبِ قدر کو حاصل کرنا اور اس میں عبادت کرنا ہے۔",
                "آخری عشرے کی طاق راتوں میں اس مبارک رات کے پائے جانے کے قوی امکانات ہیں۔",
                "مسجد میں قیام کرنے سے انسان ہر وقت حالتِ عبادت میں رہتا ہے۔"
              ],
              "english": [
                "The primary goal of Itikaf is to find and worship during Laylat al-Qadr.",
                "There is a strong possibility of finding this blessed night in the last ten odd nights.",
                "Staying in the mosque keeps a person in a continuous state of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کا اعتکاف",
        "english": "Itikaf for Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ازواجِ مطہرات کا عمل",
              "english": "Practice of the Prophet's Wives"
            },
            "content": {
              "urdu": [
                "حدیث سے واضح ہے کہ خواتین بھی اعتکاف کر سکتی ہیں۔",
                "نبی ﷺ کی ازواج نے آپ ﷺ کی زندگی میں اور بعد میں بھی اعتکاف کیا۔",
                "یہ خواتین کے لیے اللہ کی بندگی کا ایک خاص تربیتی موقع ہے۔"
              ],
              "english": [
                "The Hadith clearly shows that women are also permitted to perform Itikaf.",
                "The Prophet's (ﷺ) wives performed Itikaf during his life and after his death.",
                "This serves as a special spiritual training opportunity for women."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرائط و آداب",
              "english": "Conditions and Etiquettes"
            },
            "content": {
              "urdu": [
                "خواتین کے لیے شوہر کی اجازت اور مکمل پردے کا اہتمام ضروری ہے۔",
                "ان کا اعتکاف مسجد میں مخصوص پردہ دار جگہ پر ہونا چاہیے۔",
                "فتنے کا اندیشہ ہو تو خواتین کو اپنے گھر کی مسجد (جائے نماز) پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "Permission from the husband and proper veiling are necessary for women.",
                "Their Itikaf should be in a designated screened area within the mosque.",
                "If fitnah is feared, some scholars suggest women prioritize their home prayer space."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتکاف کی جگہ",
              "english": "Place of Itikaf"
            },
            "content": {
              "urdu": [
                "اعتکاف صرف اس مسجد میں درست ہے جہاں باجماعت نماز ہوتی ہو۔",
                "مسجد سے بلا ضرورت نکلنے سے اعتکاف ٹوٹ جاتا ہے۔",
                "صرف انسانی ضرورت (رفع حاجت) یا کھانے کے لیے نکلنا جائز ہے اگر انتظام نہ ہو۔"
              ],
              "english": [
                "Itikaf is only valid in a mosque where congregational prayers are held.",
                "Leaving the mosque without a valid necessity invalidates the Itikaf.",
                "Leaving for human needs or food is permissible only if no arrangements exist inside."
              ]
            }
          },
          {
            "title": {
              "urdu": "روزہ اور اعتکاف",
              "english": "Fasting and Itikaf"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک اعتکاف کے لیے روزہ رکھنا شرط ہے۔",
                "رمضان کا اعتکاف روزے کے ساتھ ہی ہوتا ہے جو اس کی روح ہے۔",
                "اعتکاف کے دوران جنسی تعلقات سے مکمل پرہیز واجب ہے۔"
              ],
              "english": [
                "According to the majority, fasting is a condition for a valid Itikaf.",
                "Itikaf in Ramadan naturally aligns with fasting, which is its core spirit.",
                "Complete avoidance of marital relations is obligatory during the seclusion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دنیا سے بیزاری",
              "english": "Detachment from the World"
            },
            "content": {
              "urdu": [
                "اعتکاف انسان کو موبائل، سوشل میڈیا اور فضول گفتگو سے دور کرتا ہے۔",
                "یہ اپنی ذات کا محاسبہ کرنے اور توبہ کا بہترین وقت ہے۔",
                "نفس کو مشقت میں ڈال کر اللہ کی فرمانبرداری سکھائی جاتی ہے۔"
              ],
              "english": [
                "Itikaf distances a person from phones, social media, and idle talk.",
                "It is the best time for self-accountability and sincere repentance.",
                "The soul is disciplined through hardship to learn obedience to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی ترغیب",
              "english": "Family Encouragement"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے گھرانے کا عمل بتاتا ہے کہ نیکی میں پورے خاندان کو شامل ہونا چاہیے۔",
                "گھر کے بڑوں کو چاہیے کہ وہ بچوں اور خواتین کو عبادت کی ترغیب دیں۔",
                "نیکی کا ماحول گھرانے کی دینی بقا کے لیے ضروری ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) household shows that the whole family should join in goodness.",
                "Elders should encourage children and women toward acts of worship.",
                "A spiritual environment is vital for the religious survival of a family."
              ]
            }
          }
        ]
      }
    }
  ]
}