{
  "hadithId": 806,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/806"],
    "kitabId": 7,
    "inKitabBab": 20,
    "arabicBook": "بلوغ المرام",
    "babId": 61
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6764) ومسلم (1614)، وفي رواية البخاري (4283) بلفظ 'المؤمن' بدل 'المسلم'.",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (6764) اور امام مسلم (1614) نے روایت کیا ہے۔",
    "english": "Sahih. Agreed upon. Reported by Al-Bukhari (6764) and Muslim (1614). Another narration in Bukhari uses 'the believer' instead of 'the Muslim'."
  },
  "importantWords": [
    {
      "arabic": "لَا يَرِثُ",
      "english": "Does not inherit",
      "urdu": "وارث نہیں ہوگا"
    },
    {
      "arabic": "الْمُسْلِمُ",
      "english": "The Muslim",
      "urdu": "مسلمان"
    },
    {
      "arabic": "الْكَافِرَ",
      "english": "The non-believer",
      "urdu": "کافر"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "الْمُؤْمِنُ",
      "english": "The believer",
      "urdu": "مومن"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث وراثت کی ایک اہم شرط بیان کرتی ہے کہ وارث اور مورث (مرنے والے) کا دین ایک ہونا ضروری ہے؛ اختلافِ دین وراثت سے محرومی کا سبب ہے۔",
    "english": "This Hadith establishes that a difference in religion is a barrier to inheritance; a Muslim and a non-believer cannot inherit from each other."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6764)",
      "english": "Sahih al-Bukhari (6764)"
    },
    {
      "arabic": "صحيح مسلم (1614)",
      "english": "Sahih Muslim (1614)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أسامة بن زيد",
        "english": "Usama bin Zaid"
      },
      "slug": "usama-bin-zaid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اختلافِ دین اور وراثت",
        "english": "Religious Difference and Inheritance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وراثت کی بنیادی شرط",
              "english": "Basic Condition of Inheritance"
            },
            "content": {
              "urdu": [
                "وراثت کے جاری ہونے کے لیے وارث اور میت کا ایک ہی دین پر ہونا لازمی ہے۔",
                "اگر میت مسلمان ہو اور وارث کافر، تو وہ شرعی طور پر حصہ نہیں پا سکے گا۔",
                "اسی طرح مسلمان بھی اپنے کسی غیر مسلم رشتہ دار کی وراثت کا حقدار نہیں ہوتا۔"
              ],
              "english": [
                "For inheritance to occur, the heir and the deceased must share the same religion.",
                "If the deceased is Muslim and the heir is a non-believer, the heir gets no share.",
                "Similarly, a Muslim does not inherit from their non-Muslim relatives."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمت اور وجہ",
              "english": "Wisdom and Reason"
            },
            "content": {
              "urdu": [
                "وراثت درحقیقت ایک دینی اور خاندانی نصرت و حمایت کا نام ہے۔",
                "دین کا فرق اس بنیادی تعلق اور نصرت کو ختم کر دیتا ہے جو وراثت کی بنیاد ہے۔",
                "یہ حکم مسلمانوں کی دینی شناخت اور ان کے اموال کی حفاظت کو یقینی بناتا ہے۔"
              ],
              "english": [
                "Inheritance is a form of religious and familial support and alliance.",
                "A difference in faith severs the essential bond that forms the basis of inheritance.",
                "This ruling preserves the religious identity and wealth of the Muslim community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی استثناءات اور حدود",
        "english": "Juristic Exceptions and Boundaries"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وصیت کا حکم",
              "english": "Ruling on Wills (Wasiyah)"
            },
            "content": {
              "urdu": [
                "وراثت نہ ہونے کا مطلب یہ نہیں کہ غیر مسلم رشتہ دار کو کچھ نہیں دیا جا سکتا۔",
                "ایک مسلمان اپنے غیر مسلم رشتہ دار کے لیے ایک تہائی مال تک کی وصیت کر سکتا ہے۔",
                "وصیت کے ذریعے ان کی مالی مدد کرنا جائز اور حسنِ سلوک کا حصہ ہے۔"
              ],
              "english": [
                "Lack of inheritance doesn't mean a non-Muslim relative can't receive anything.",
                "A Muslim can make a will (wasiyah) for a non-Muslim relative up to one-third of the estate.",
                "Helping them through a will is permissible and part of good conduct."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Stance of the Majority of Jurists"
            },
            "content": {
              "urdu": [
                "چاروں ائمہ اس بات پر متفق ہیں کہ کافر مسلمان کا وارث نہیں ہو سکتا۔",
                "یہ حکم عام ہے، خواہ غیر مسلم رشتہ دار اہل کتاب ہو یا کوئی اور۔",
                "اسلامی قانون میں یہ ایک طے شدہ ضابطہ ہے جس میں کوئی ابہام نہیں ہے۔"
              ],
              "english": [
                "The four Imams agree that a non-believer cannot inherit from a Muslim.",
                "This rule is general, regardless of whether the non-Muslim is of the People of the Book.",
                "In Islamic law, this is an established principle with no ambiguity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اور اخلاقی پہلو",
        "english": "Social and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مسلموں سے حسنِ سلوک",
              "english": "Kindness to Non-Muslims"
            },
            "content": {
              "urdu": [
                "وراثت سے محرومی کا مطلب غیر مسلموں کے ساتھ بدسلوکی کرنا نہیں ہے۔",
                "اسلام زندگی میں ان کے ساتھ صلہ رحمی اور احسان کرنے کا حکم دیتا ہے۔",
                "مالی امداد کے دیگر ذرائع جیسے تحفہ اور وصیت ان کے لیے کھلے ہیں۔"
              ],
              "english": [
                "Being barred from inheritance does not mean mistreating non-Muslims.",
                "Islam commands maintaining ties and being kind to them during life.",
                "Other means of financial support like gifts and wills remain open to them."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی غیرت اور وفاداری",
              "english": "Religious Honor and Loyalty"
            },
            "content": {
              "urdu": [
                "یہ قانون مومن کے دل میں اپنے دین کی فوقیت اور اہمیت اجاگر کرتا ہے۔",
                "مسلمانوں کا مال ان کے اپنے دینی بھائیوں اور اہل خانہ کے لیے محفوظ رہتا ہے۔",
                "یہ حکم دین اسلام کی مرکزیت کو خاندانی معاملات میں بھی واضح کرتا ہے۔"
              ],
              "english": [
                "This law highlights the priority and importance of faith in a believer's heart.",
                "A Muslim's wealth remains secured for their fellow believers and family.",
                "The ruling clarifies the centrality of Islam even in familial affairs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نو مسلموں کے لیے رہنمائی",
              "english": "Guidance for New Muslims"
            },
            "content": {
              "urdu": [
                "اسلام قبول کرنے والوں کو وراثت کے ان احکام سے آگاہ ہونا چاہیے۔",
                "وہ اپنے غیر مسلم والدین کی وراثت سے قانونی طور پر محروم ہو سکتے ہیں۔",
                "ایسی صورت میں وہ والدین کی زندگی میں ان سے تحفہ یا ہبہ لے سکتے ہیں۔"
              ],
              "english": [
                "Those who embrace Islam should be aware of these inheritance laws.",
                "They may be legally barred from inheriting from their non-Muslim parents.",
                "In such cases, they may accept gifts or grants from parents during their lifetime."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی حدود کی پابندی",
              "english": "Adherence to Shariah Limits"
            },
            "content": {
              "urdu": [
                "وراثت کی تقسیم میں اپنی پسند کے بجائے اللہ کے حکم کو مقدم رکھیں۔",
                "جذباتی فیصلوں کے بجائے شرعی ضابطوں پر عمل کرنا ہی تقویٰ ہے۔",
                "اللہ کے مقرر کردہ حدود کو توڑنا اپنی عاقبت خراب کرنے کے مترادف ہے۔"
              ],
              "english": [
                "Prioritize Allah's command over personal preferences in inheritance.",
                "True piety lies in following Shariah rules rather than emotional decisions.",
                "Transgressing the limits set by Allah is akin to ruining one's hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}