{
  "hadithId": 817,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/817"],
    "kitabId": 7,
    "inKitabBab": 20,
    "arabicBook": "بلوغ المرام",
    "babId": 61
  },

  "takhreej": {
    "arabic": "ضعيف مرفوعاً وصحيح موصولاً إلى الصحابة. أخرجه أحمد (3/184)، والترمذي (3910)، والنسائي في الكبرى (8231)، وابن ماجه (154).",
    "urdu": "یہ روایت رسول اللہ ﷺ سے منسوب ہونے کے لحاظ سے ضعیف ہے کیونکہ ابوقلابہ کا سیدنا انس سے سماع میں کلام ہے، لیکن زید بن ثابت کی فضیلت دیگر آثار سے ثابت ہے۔",
    "english": "Weak as a Marfu' (Prophetic) tradition due to irsal, but authentic as a statement regarding the Sahaba's merit. Reported by Ahmad, At-Tirmidhi, and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "أَفْرَضُكُمْ",
      "english": "Most knowledgeable in inheritance",
      "urdu": "تم میں سب سے بڑا فرائض داں"
    },
    {
      "arabic": "زَيْدُ بْنُ ثَابِتٍ",
      "english": "Zaid bin Thabit",
      "urdu": "زید بن ثابت"
    },
    {
      "arabic": "أَعِلَّ",
      "english": "Declared defective",
      "urdu": "معلول قرار دیا گیا"
    },
    {
      "arabic": "بِالْإِرْسَالِ",
      "english": "Due to being Mursal",
      "urdu": "مرسل ہونے کی بنا پر"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Narrated it",
      "urdu": "اسے روایت کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سیدنا زید بن ثابت رضی اللہ عنہ کی علمی جلالت اور وراثت کے پیچیدہ مسائل میں ان کی مہارت کا اعتراف کیا گیا ہے۔",
    "english": "This Hadith acknowledges the scholarly status of Zaid bin Thabit (RA) and his exceptional expertise in the complex laws of inheritance."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (3910)",
      "english": "Sunan At-Tirmidhi (3910)"
    },
    {
      "arabic": "سنن ابن ماجه (154)",
      "english": "Sunan Ibn Majah (154)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "زید بن ثابت",
        "english": "Zaid bin Thabit"
      },
      "slug": "zaid-bin-thabit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "علمِ فرائض کی اہمیت",
        "english": "Importance of Inheritance Laws"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وراثت ایک بنیادی علم",
              "english": "Inheritance as a Fundamental Science"
            },
            "content": {
              "urdu": [
                "اسلام میں وراثت کے علم کو نصف علم قرار دیا گیا ہے کیونکہ اس کا تعلق ہر فرد سے ہے۔",
                "یہ علم حقوق العباد کی صحیح ادائیگی اور مالی تنازعات کے حل کا ذریعہ ہے۔",
                "قرآن کریم نے وراثت کے حصوں کو خود تفصیل سے بیان کر کے اس کی اہمیت واضح کی ہے۔"
              ],
              "english": [
                "The science of inheritance is considered half of knowledge in Islam as it affects everyone.",
                "It is a means for fulfilling people's rights and resolving financial disputes.",
                "The Quran itself details inheritance shares, highlighting the critical nature of this science."
              ]
            }
          },
          {
            "title": {
              "urdu": "ماہرینِ فن کی ضرورت",
              "english": "Need for Specialists"
            },
            "content": {
              "urdu": [
                "وراثت کے مسائل پچیدہ ہوتے ہیں جن کے لیے گہرے فہم اور ریاضی کی ضرورت ہوتی ہے۔",
                "نبی کریم ﷺ نے صحابہ میں مختلف علوم کے ماہرین تیار کیے تاکہ امت کی رہنمائی ہو۔",
                "زید بن ثابت رضی اللہ عنہ کو اس علم میں خصوصی ملکہ حاصل تھا جس کا تذکرہ یہاں ہوا ہے۔"
              ],
              "english": [
                "Inheritance laws are complex, requiring deep understanding and mathematical skills.",
                "The Prophet (ﷺ) encouraged specialists among Sahaba to guide the Ummah in specific fields.",
                "Zaid bin Thabit (RA) possessed a unique talent in this field, as acknowledged here."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زید بن ثابت کی علمی خدمات",
        "english": "Scholarly Services of Zaid bin Thabit"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فرائض میں ان کا مقام",
              "english": "Status in Fara'id"
            },
            "content": {
              "urdu": [
                "اکثر صحابہ کرام وراثت کے مشکل مسائل میں سیدنا زید بن ثابت سے رجوع کرتے تھے۔",
                "انہوں نے وراثت کے اصولوں کو مدون کرنے اور سکھانے میں کلیدی کردار ادا کیا۔",
                "ان کے مرتب کردہ قواعد آج بھی فقہِ اسلامی میں ایک معتبر حوالہ مانے جاتے ہیں۔"
              ],
              "english": [
                "Most Sahaba consulted Zaid bin Thabit regarding difficult inheritance cases.",
                "He played a pivotal role in codifying and teaching the principles of inheritance.",
                "The rules he established remain a primary reference in Islamic jurisprudence today."
              ]
            }
          },
          {
            "title": {
              "urdu": "کاتبِ وحی اور جامعِ قرآن",
              "english": "Scribe of Revelation and Quran Compiler"
            },
            "content": {
              "urdu": [
                "وراثت کے علاوہ وہ کاتبِ وحی تھے اور قرآن کی جمع و تدوین میں پیش پیش رہے۔",
                "ان کی ذہانت اور دیانت داری پر خلفائے راشدین کو مکمل اعتماد تھا۔",
                "وہ مدینہ کے قاضی اور مفتی کے طور پر بھی خدمات سرانجام دیتے رہے۔"
              ],
              "english": [
                "Besides inheritance, he was a scribe of revelation and leader in Quranic compilation.",
                "The Rightly Guided Caliphs had complete trust in his intelligence and integrity.",
                "He also served as a judge (Qadi) and a Mufti in Madinah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وراثت کی تقسیم میں احتیاط",
        "english": "Caution in Distributing Wealth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی حصوں کی پاسداری",
              "english": "Observing Shariah Shares"
            },
            "content": {
              "urdu": [
                "وراثت کی تقسیم اپنی پسند کے بجائے مقررہ شرعی حصوں کے مطابق ہونی چاہیے۔",
                "کسی وارث کو محروم کرنا یا کسی کا حق مارنا اللہ کی حدود کو توڑنا ہے۔",
                "علمِ فرائض کے ماہرین سے مشورہ کرنا غلطیوں سے بچنے کا بہترین طریقہ ہے۔"
              ],
              "english": [
                "Inheritance distribution must follow fixed Shariah shares, not personal whims.",
                "Depriving an heir or usurping a right is a violation of Allah's limits.",
                "Consulting inheritance specialists is the best way to avoid distribution errors."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی انصاف کا قیام",
              "english": "Establishing Social Justice"
            },
            "content": {
              "urdu": [
                "صحیح نظامِ وراثت خاندانوں میں لڑائی جھگڑوں اور ناانصافی کو ختم کرتا ہے۔",
                "دولت کا ارتکاز روکنے کے لیے اسلام نے وراثت کا جامع نظام دیا ہے۔",
                "زید بن ثابت جیسے علماء کی پیروی معاشرے میں عدل لانے کا باعث بنتی ہے۔"
              ],
              "english": [
                "A correct inheritance system ends family disputes and social injustice.",
                "Islam provides a comprehensive system to prevent the hoarding of wealth.",
                "Following scholars like Zaid bin Thabit helps bring justice to society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماہرینِ دین کی قدر",
              "english": "Valuing Religious Experts"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے معاشرے میں موجود مستند علماء اور ماہرینِ فن کی قدر کرنی چاہیے۔",
                "دینی پچیدگیوں میں صرف ان لوگوں سے رائے لیں جو متعلقہ علم میں مہارت رکھتے ہوں۔",
                "علم کا احترام درحقیقت دین کا احترام ہے۔"
              ],
              "english": [
                "We must value authentic scholars and specialists within our society.",
                "In religious complexities, seek opinions only from those with specific expertise.",
                "Respecting knowledge is, in reality, respecting the religion itself."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم سیکھنے کی ترغیب",
              "english": "Motivation to Learn"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو وراثت کے بنیادی مسائل کا علم حاصل کرنا چاہیے۔",
                "علم کی طلب میں محنت اور لگن سیدنا زید بن ثابت کا خاصہ تھی۔",
                "اپنے بچوں کو بھی دینی علوم میں مہارت حاصل کرنے کی ترغیب دیں۔"
              ],
              "english": [
                "Every Muslim should acquire basic knowledge of inheritance laws.",
                "Diligence and dedication in seeking knowledge were traits of Zaid bin Thabit (RA).",
                "Encourage your children to achieve mastery in various religious sciences."
              ]
            }
          }
        ]
      }
    }
  ]
}