{
  "hadithId": 776,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/776"],
    "kitabId": 7,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 57
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2335). وأخرجه أبو داود (3073)، والترمذي (1378)، والنسائي في الكبرى (5748)، وأحمد (24281).",
    "urdu": "صحیح۔ اسے امام بخاری (2335) نے روایت کیا ہے۔ اس کے علاوہ اسے ابوداؤد، ترمذی اور نسائی نے بھی روایت کیا ہے۔ یہ حدیث زمین کی آبادکاری کے قانون 'احیاء الموات' کی اصل بنیاد ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2335). Also reported by Abu Dawud (3073), At-Tirmidhi (1378), and An-Nasa'i. This Hadith is the legal basis for 'Ihya al-Mawat' (reviving dead land)."
  },
  "importantWords": [
    {
      "arabic": "عَمَّرَ",
      "english": "Cultivated / Revived",
      "urdu": "آباد کیا"
    },
    {
      "arabic": "أَرْضاً",
      "english": "Land",
      "urdu": "زمین"
    },
    {
      "arabic": "لَيْسَتْ لِأَحَدٍ",
      "english": "Belongs to no one",
      "urdu": "کسی کی ملکیت نہ ہو"
    },
    {
      "arabic": "أَحَقُّ",
      "english": "More Rightful / Entitled",
      "urdu": "زیادہ حقدار"
    },
    {
      "arabic": "خِلَافَتِهِ",
      "english": "His Caliphate",
      "urdu": "ان کی خلافت"
    },
    {
      "arabic": "قَضَى",
      "english": "Judged / Decreed",
      "urdu": "فیصلہ فرمایا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اسلامی قانون 'احیاء الموات' کو واضح کرتی ہے، جس کے تحت بنجر اور لاوارث زمین کو محنت کر کے آباد کرنے والا شخص اس کا مالک بن جاتا ہے۔",
    "english": "This Hadith clarifies the Islamic law of 'Ihya al-Mawat,' stating that a person who revives and cultivates barren, unclaimed land becomes its rightful owner."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2335)",
      "english": "Reported by Al-Bukhari (2335)"
    },
    {
      "arabic": "سنن الترمذي (1378)",
      "english": "Sunan at-Tirmidhi (1378)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عروة بن الزبير",
        "english": "Urwah bin az-Zubayr"
      },
      "slug": "urwah-bin-az-zubayr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احیاء الموات کی تعریف اور شرائط",
        "english": "Definition and Conditions of Ihya al-Mawat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موات زمین کا مطلب",
              "english": "Meaning of Dead Land"
            },
            "content": {
              "urdu": [
                "بنجر زمین جو کسی کی انفرادی ملکیت نہ ہو اور نہ ہی عام استعمال میں ہو اسے 'موات' کہتے ہیں۔",
                "ایسی زمین پر عمارت بنانا، درخت لگانا یا ہل چلا کر کاشتکاری کرنا اسے 'آباد کرنا' کہلاتا ہے۔",
                "اسلام محنت کشوں کو ایسی زمین کا مالک بنا کر معاشی ترقی کی حوصلہ افزائی کرتا ہے۔"
              ],
              "english": [
                "Barren land that is neither privately owned nor in public use is called 'Mawat' (dead land).",
                "Building on such land, planting trees, or plowing it for farming is considered 'reviving' it.",
                "Islam encourages economic growth by granting ownership to those who put effort into such land."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکومت کی اجازت کی ضرورت",
              "english": "Requirement of State Permission"
            },
            "content": {
              "urdu": [
                "امام ابو حنیفہ کے نزدیک بنجر زمین آباد کرنے کے لیے حکومت (امام) کی اجازت شرط ہے۔",
                "جبکہ امام شافعی اور مالک کے نزدیک حدیث کے الفاظ کی بنا پر اجازت کے بغیر بھی ملکیت ثابت ہو جاتی ہے۔",
                "جدید دور میں نظم و ضبط برقرار رکھنے کے لیے حکومتی قوانین کی پاسداری ضروری سمجھی جاتی ہے۔"
              ],
              "english": [
                "According to Imam Abu Hanifa, state permission is required before reviving barren land.",
                "Imams Shafi'i and Malik believe ownership is established even without permission based on the Hadith's wording.",
                "In modern times, following state laws is considered essential to maintain public order."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلفائے راشدین کا عمل",
        "english": "Practice of the Rightly Guided Caliphs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عمر کا فیصلہ",
              "english": "Decree of 'Umar (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عمر رضی اللہ عنہ نے اپنی خلافت میں اسی نبوی قانون کو نافذ فرمایا۔",
                "انہوں نے زمینوں کو بنجر چھوڑنے والوں کے خلاف سختی کی اور آباد کرنے والوں کو ترجیح دی۔",
                "عروہ بن زبیر کا یہ بیان اس بات کی تاریخی گواہی ہے کہ یہ قانون عملی طور پر رائج تھا۔"
              ],
              "english": [
                "Umar (RA) enforced this Prophetic law strictly during his Caliphate.",
                "He discouraged leaving land barren and prioritized those who cultivated it.",
                "Urwah bin az-Zubayr's statement provides historical evidence that this law was actively practiced."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشی اصلاحات",
              "english": "Economic Reforms"
            },
            "content": {
              "urdu": [
                "اس قانون کا مقصد زمین کی پیداوار میں اضافہ کرنا اور غربت کا خاتمہ کرنا تھا۔",
                "اسلامی ریاست زمین کو معطل رکھنے کے بجائے اسے پیداواری عمل کا حصہ بنانا چاہتی ہے۔",
                "یہ قانون آج کے دور میں بھی زرعی اصلاحات کے لیے ایک مشعلِ راہ ہے۔"
              ],
              "english": [
                "The purpose of this law was to increase agricultural output and eliminate poverty.",
                "The Islamic state aims to make land part of the production process rather than keeping it idle.",
                "This legal framework remains a guiding principle for agricultural reforms today."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور حقوق",
        "english": "Juristic Details and Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کون سی زمین آباد کی جا سکتی ہے؟",
              "english": "What Land Can Be Revived?"
            },
            "content": {
              "urdu": [
                "وہ زمین جو کسی بستی کی مشترکہ چراگاہ یا راستے کے طور پر استعمال نہ ہو رہی ہو۔",
                "وہ زمین جو کسی قدیم آثارِ قدیمہ یا وقف کا حصہ نہ ہو۔",
                "وہ زمین جہاں پانی اور دیگر حقوق کی فراہمی سے کسی اور کی ملکیت کو نقصان نہ پہنچے۔"
              ],
              "english": [
                "Land that is not used as a communal pasture or a pathway for a settlement.",
                "Land that is not part of an ancient heritage site or an endowment (Waqf).",
                "Land where the provision of water or other rights does not harm another's property."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملکیت کے ثبوت کا دورانیہ",
              "english": "Duration for Proving Ownership"
            },
            "content": {
              "urdu": [
                "اگر کوئی زمین پر نشان دہی کر دے مگر تین سال تک آباد نہ کرے تو اس کا حق ختم ہو جاتا ہے۔",
                "صرف باڑ لگانا یا پتھر رکھنا کافی نہیں بلکہ اس سے نفع حاصل کرنا ضروری ہے۔",
                "یہ سختی اس لیے ہے تاکہ لوگ صرف زمینیں گھیر کر بیٹھ نہ جائیں۔"
              ],
              "english": [
                "If someone marks land but fails to cultivate it within three years, their right expires.",
                "Simply fencing or placing stones is not enough; one must derive benefit from it.",
                "This strictness ensures that people do not simply hoard land without using it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور عملی سبق",
        "english": "Social and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محنت کی عظمت",
              "english": "Dignity of Labor"
            },
            "content": {
              "urdu": [
                "اسلام محنت کشوں کو عزت دیتا ہے اور ان کی جدوجہد کا صلہ ملکیت کی صورت میں دیتا ہے۔",
                "خالی زمینوں کو آباد کرنا زمین کے حقوق ادا کرنے کے مترادف ہے۔",
                "ایک مسلمان کو کاہلی چھوڑ کر پیداواری کاموں میں حصہ لینا چاہیے۔"
              ],
              "english": [
                "Islam honors laborers and rewards their struggle with ownership rights.",
                "Reviving empty lands is equivalent to fulfilling the rights of the earth.",
                "A Muslim should abandon laziness and participate in productive activities."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملکی قوانین کا احترام",
              "english": "Respect for National Laws"
            },
            "content": {
              "urdu": [
                "اگرچہ حدیث میں حق ثابت ہے، مگر فساد سے بچنے کے لیے حکومتی ریکارڈ ضروری ہے۔",
                "زمین کی پیمائش اور رجسٹریشن کے جدید تقاضوں کو پورا کرنا شرعی نظم کا حصہ ہے۔",
                "کسی دوسرے کی ملکیت یا سرکاری زمین پر ناجائز قبضہ کرنا گناہ ہے۔"
              ],
              "english": [
                "While the Hadith grants the right, government recording is necessary to avoid disputes.",
                "Meeting modern requirements for land survey and registration is part of Islamic order.",
                "Unlawfully occupying someone else's property or state land is a sin."
              ]
            }
          }
        ]
      }
    }
  ]
}