{
  "hadithId": 649,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/2"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2236)، ومسلم (1581). ومعنى جملوه: أذابوه.",
    "urdu": "یہ حدیث صحیح ہے، اسے بخاری (2236) اور مسلم (1581) نے روایت کیا ہے۔ 'جملوہ' کا مطلب اسے پگھلا لینا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2236) and Muslim (1581). 'Jamaluhu' means they melted it down."
  },
  "importantWords": [
    {
      "arabic": "الْخَمْرِ",
      "english": "Wine / Intoxicants",
      "urdu": "شراب"
    },
    {
      "arabic": "الْمَيْتَةِ",
      "english": "Dead animals",
      "urdu": "مردار"
    },
    {
      "arabic": "الأَصْنَامِ",
      "english": "Idols",
      "urdu": "بت"
    },
    {
      "arabic": "شُحُومَ",
      "english": "Fats",
      "urdu": "چربی"
    },
    {
      "arabic": "تُطْلَى",
      "english": "Coated / Caulked",
      "urdu": "پینٹ یا طلاء کرنا"
    },
    {
      "arabic": "يَسْتَصْبِحُ",
      "english": "Use for lamps",
      "urdu": "چراغ جلانا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں شراب، مردار، خنزیر اور بتوں کی تجارت کی ممانعت بیان کی گئی ہے اور یہ واضح کیا گیا ہے کہ حرام چیز کی قیمت کھانا بھی حرام ہے۔",
    "english": "This Hadith prohibits the sale of intoxicants, carrion, swine, and idols, establishing that when something is forbidden, its sale and profit are also forbidden."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساقاة",
      "english": "Sahih Muslim, Book of Musaqah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p7U_pG_2Q",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرام اشیاء کی تجارت",
        "english": "Trade of Forbidden Items"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار بنیادی ممنوعات",
              "english": "Four Basic Prohibitions"
            },
            "content": {
              "urdu": [
                "حدیث میں شراب، مردار، خنزیر اور بتوں کی تجارت کو قطعی حرام قرار دیا گیا ہے۔",
                "شراب عقل کو ڈھانپتی ہے، مردار اور خنزیر ناپاک ہیں، اور بت شرک کا ذریعہ ہیں۔",
                "اسلامی معاشرے میں ان چیزوں کی خرید و فروخت اخلاقی اور شرعی طور پر جرم ہے۔"
              ],
              "english": [
                "The Hadith strictly prohibits the sale of wine, carrion, swine, and idols.",
                "Wine clouds the mind, carrion and swine are impure, and idols promote Shirk.",
                "Trading these items is a moral and legal offense in an Islamic society."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرام چیز کا نفع",
              "english": "Profit from Haram Items"
            },
            "content": {
              "urdu": [
                "جس چیز کا کھانا یا استعمال حرام ہے، اس کی قیمت وصول کرنا بھی حرام ہے۔",
                "مردار کی چربی کے فوائد کے باوجود آپ ﷺ نے اس کی فروخت سے منع فرمایا۔",
                "مسلمان کو اپنی آمدنی کے ذرائع کو ہر قسم کی ناپاکی سے پاک رکھنا چاہیے۔"
              ],
              "english": [
                "When a thing is forbidden to consume, taking its price is also forbidden.",
                "Despite the utility of carrion fat, the Prophet (ﷺ) forbade its sale.",
                "A Muslim must keep their sources of income free from all impurities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "یہود کا طرز عمل اور حیلہ سازی",
        "english": "Jewish Conduct and Legal Evasion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیلہ سازی کی مذمت",
              "english": "Condemnation of Evasion"
            },
            "content": {
              "urdu": [
                "یہود نے چربی حرام ہونے پر اسے پگھلا کر بیچنا شروع کر دیا تاکہ حکم سے بچ سکیں۔",
                "اللہ کے احکامات میں حیلے اور بہانے تلاش کرنا اللہ کے غضب کا باعث بنتا ہے۔",
                "یہ عمل نیت کے فتور اور اللہ کے قانون سے بغاوت کی علامت ہے۔"
              ],
              "english": [
                "Jews melted prohibited fat to sell it, attempting to bypass the divine law.",
                "Seeking loopholes and excuses in Allah's commands invites His wrath.",
                "This conduct signifies corrupt intentions and rebellion against divine law."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرام کو حلال کرنے کا انجام",
              "english": "Consequences of Legalizing Haram"
            },
            "content": {
              "urdu": [
                "کسی حرام چیز کی ظاہری شکل بدلنے سے اس کی شرعی حیثیت تبدیل نہیں ہوتی۔",
                "یہود کو ان کی حیلہ سازیوں کی وجہ سے سخت وعید سنائی گئی ہے۔",
                "مسلمانوں کو ان کے نقش قدم پر چلنے سے سختی سے بچنا چاہیے۔"
              ],
              "english": [
                "Changing the appearance of a haram item does not change its legal status.",
                "The Jews were severely warned due to their deceptive practices.",
                "Muslims must strictly avoid following in their footsteps in this regard."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اصول",
        "english": "Juristic Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاعدہ کلیہ",
              "english": "General Principle"
            },
            "content": {
              "urdu": [
                "اصول یہ ہے کہ جب اللہ کسی چیز کو حرام کرتا ہے تو اس کی قیمت بھی حرام ہے۔",
                "یہ اصول تجارت کے تمام شعبوں میں حلال و حرام کا معیار طے کرتا ہے۔",
                "کوئی بھی ایسی شے جو معاشرے کے لیے مضر ہو، اس کی تجارت ممنوع ہے۔"
              ],
              "english": [
                "The rule is: when Allah forbids something, He forbids its price as well.",
                "This principle sets the standard for Halal and Haram in all trade sectors.",
                "Any item that is harmful to society is prohibited from being traded."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناپاک اشیاء سے فائدہ",
              "english": "Benefit from Impure Items"
            },
            "content": {
              "urdu": [
                "مردار کی چربی کا استعمال (غیر خوردنی) صحابہ کے نزدیک عام تھا مگر تجارت ممنوع تھی۔",
                "خرید و فروخت کے بغیر ذاتی ضرورت میں استعمال پر اہل علم کی مختلف آراء ہیں۔",
                "تاہم، تجارت کی ممانعت پر تمام ائمہ کا اتفاق موجود ہے۔"
              ],
              "english": [
                "Using carrion fat (non-edible) was known to Sahaba, but trading it was banned.",
                "Scholars differ on its personal use without buying or selling.",
                "However, all Imams agree on the absolute prohibition of its trade."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رزق حلال کی اہمیت",
              "english": "Importance of Halal Provision"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی روزی کمانے میں تقویٰ اور امانتداری اختیار کرنی چاہیے۔",
                "حرام مال انسان کی دعاؤں کی قبولیت میں سب سے بڑی رکاوٹ ہے۔",
                "تھوڑا حلال مال بہت زیادہ حرام مال سے بہتر اور بابرکت ہے۔"
              ],
              "english": [
                "A Muslim must adopt piety and integrity in earning their livelihood.",
                "Haram wealth is a major obstacle in the acceptance of one's prayers.",
                "A small amount of Halal is better and more blessed than abundant Haram."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرک کے ذرائع کا خاتمہ",
              "english": "Eliminating Means of Shirk"
            },
            "content": {
              "urdu": [
                "بتوں کی تجارت سے منع کرنا عقیدہ توحید کے تحفظ کے لیے ضروری ہے۔",
                "ہر وہ شے جو کفر یا شرک کو فروغ دے، اس سے دور رہنا واجب ہے۔",
                "اسلام باطل معبودوں کی تشہیر اور ان کے کاروبار کی اجازت نہیں دیتا۔"
              ],
              "english": [
                "Prohibiting the sale of idols is vital for protecting the belief in Tawheed.",
                "One must distance themselves from anything that promotes Kufr or Shirk.",
                "Islam does not allow the promotion or business of false deities."
              ]
            }
          }
        ]
      }
    }
  ]
}