{
  "hadithId": 1114,
  "hadithNo": 35,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/35"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (3154)، وأبو داود (2701)، وابن حبان (4805). ولفظ ابن حبان: 'فلم يخمسه النبي صلى الله عليه وسلم'.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری (3154)، ابوداؤد (2701) اور ابن حبان (4805) نے روایت کیا ہے۔ ابن حبان کے الفاظ ہیں کہ نبی ﷺ نے اس پر خمس لاگو نہیں فرمایا۔",
    "english": "Sahih. Reported by Al-Bukhari (3154), Abu Dawud (2701), and Ibn Hibban (4805). Ibn Hibban's wording states that the Prophet (ﷺ) did not apply the Khums to these items."
  },
  "importantWords": [
    {
      "arabic": "نُصِيبُ",
      "english": "We obtained/got",
      "urdu": "ہم پاتے تھے"
    },
    {
      "arabic": "مَغَازِينَا",
      "english": "Our expeditions",
      "urdu": "ہمارے غزوات"
    },
    {
      "arabic": "الْعَسَلَ",
      "english": "Honey",
      "urdu": "شہد"
    },
    {
      "arabic": "الْعِنَبَ",
      "english": "Grapes",
      "urdu": "انگور"
    },
    {
      "arabic": "لَا نَرْفَعُهُ",
      "english": "We did not carry it away",
      "urdu": "ہم اسے اٹھا کر نہیں لے جاتے تھے"
    },
    {
      "arabic": "الْخُمُسُ",
      "english": "One-fifth share",
      "urdu": "پانچواں حصہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ میدانِ جنگ میں غنیمت کی تقسیم سے پہلے مجاہدین کے لیے ضرورت کی اشیاء خورد و نوش کا استعمال جائز ہے اور ان پر خمس واجب نہیں ہوتا۔",
    "english": "This Hadith establishes that it is permissible for soldiers to consume food items found in the battlefield before formal distribution, and such items are not subject to the Khums tax."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (3154)",
      "english": "Sahih al-Bukhari (3154)"
    },
    {
      "arabic": "سنن أبي داود (2701)",
      "english": "Sunan Abi Dawud (2701)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غنیمت میں کھانے پینے کا حکم",
        "english": "Ruling on Food in Spoils"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت کے وقت استعمال",
              "english": "Usage During Necessity"
            },
            "content": {
              "urdu": [
                "میدانِ جنگ میں اگر غنیمت کے طور پر کھانا ملے تو اسے تقسیم سے پہلے کھایا جا سکتا ہے۔",
                "اسلام نے مجاہدین کی فوری ضرورت اور بھوک کے پیشِ نظر اسے جائز قرار دیا ہے۔",
                "اس صورت میں مجاہدین کو تقسیم یا باقاعدہ اجازت کا انتظار کرنا ضروری نہیں ہوتا۔"
              ],
              "english": [
                "Food items found as spoils on the battlefield can be consumed before formal distribution.",
                "Islam permits this to address the immediate needs and hunger of the soldiers.",
                "In such cases, soldiers are not required to wait for a formal split or permission."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذخیرہ اندوزی کی ممانعت",
              "english": "Prohibition of Hoarding"
            },
            "content": {
              "urdu": [
                "حدیث میں 'لا نرفعہ' سے مراد یہ ہے کہ وہ مال گھر لے جانے کے لیے جمع نہیں کرتے تھے۔",
                "موقع پر کھانا جائز ہے لیکن مالِ غنیمت کو چھپا کر اپنے پاس رکھنا 'غلول' (خیانت) ہے۔",
                "شرعی اجازت صرف فوری ضرورت اور استعمال کی حد تک محدود ہے۔"
              ],
              "english": [
                "The phrase 'we did not carry it away' means they didn't hoard it for personal travel.",
                "Eating on the spot is Halal, but hiding spoils for oneself is 'Ghulul' (embezzlement).",
                "The Shariah permission is strictly limited to immediate consumption and necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خمس سے استثناء",
        "english": "Exemption from Khums"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خمس کا اطلاق",
              "english": "Application of Khums"
            },
            "content": {
              "urdu": [
                "عام مالِ غنیمت کا پانچواں حصہ (خمس) بیت المال میں جمع کرانا واجب ہوتا ہے۔",
                "لیکن ایسی اشیاء جو موقع پر استعمال ہو جائیں، ان سے خمس وصول نہیں کیا جاتا۔",
                "نبی ﷺ نے ان معمولی اشیاء میں سختی کرنے کے بجائے مجاہدین کو سہولت فراہم کی۔"
              ],
              "english": [
                "Normally, one-fifth (Khums) of all spoils must be surrendered to the public treasury.",
                "However, perishable food items consumed on-site are exempt from this requirement.",
                "The Prophet (ﷺ) provided ease for soldiers instead of being rigid about minor items."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مصلحت",
              "english": "Juristic Expediency"
            },
            "content": {
              "urdu": [
                "کھانے پینے کی اشیاء کا حساب رکھنا اور خمس نکالنا جنگی حالات میں مشکل عمل ہے۔",
                "اس استثناء کی بنیاد سہولت اور عسر و حرج سے بچاؤ پر رکھی گئی ہے۔",
                "فقہاء کے نزدیک یہ اصول ہر اس چیز پر لاگو ہوتا ہے جس کی فوری ضرورت ہو۔"
              ],
              "english": [
                "Accounting for and extracting Khums from food items is difficult during active warfare.",
                "This exemption is based on the principles of ease and avoiding hardship.",
                "Jurists apply this principle to all items that are of immediate and essential need."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی جنگی ضوابط",
        "english": "Islamic Military Regulations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانت داری کی تربیت",
              "english": "Training in Integrity"
            },
            "content": {
              "urdu": [
                "صحابہ کرام کا یہ عمل ان کی دیانت داری اور تقویٰ کا منہ بولتا ثبوت ہے۔",
                "وہ جانتے تھے کہ کتنا مال ان کے لیے جائز ہے اور کتنا بیت المال کا حق ہے۔",
                "اسلامی فوج کے لیے اخلاقی تربیت جنگی مہارت سے زیادہ اہمیت رکھتی ہے۔"
              ],
              "english": [
                "The practice of the Sahaba is a living testament to their honesty and piety.",
                "They knew exactly what was permissible for them and what belonged to the state.",
                "Moral training is considered more important than combat skill for an Islamic army."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط اور عدل",
              "english": "Discipline and Justice"
            },
            "content": {
              "urdu": [
                "غنیمت کا مال اللہ کی طرف سے انعام ہے لیکن اس کے استعمال کے ضابطے ہیں۔",
                "بے جا اصراف اور لوٹ مار کی اسلام میں کوئی گنجائش موجود نہیں ہے۔",
                "نبی ﷺ نے ہر موقع پر مجاہدین کو عدل اور نظم و ضبط کی وصیت فرمائی۔"
              ],
              "english": [
                "War booty is a gift from Allah, but there are strict regulations for its use.",
                "There is no room in Islam for unnecessary waste or indiscriminate looting.",
                "The Prophet (ﷺ) advised soldiers toward justice and discipline at every turn."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور حکمت",
        "english": "Practical Lesson and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ اسلام ایک فطری اور آسان دین ہے جو حالات کو سمجھتا ہے۔",
                "سخت حالات میں اللہ تعالیٰ نے بندوں کے لیے احکامات میں نرمی پیدا فرمائی ہے۔",
                "ہمیں بھی دوسروں کے لیے معاملات میں آسانی پیدا کرنے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "This Hadith proves that Islam is a natural and easy religion that understands contexts.",
                "Allah has provided flexibility in rulings for His servants during difficult situations.",
                "We should also strive to create ease for others in our daily transactions and affairs."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق اللہ اور حقوق العباد",
              "english": "Rights of Allah and Servants"
            },
            "content": {
              "urdu": [
                "مالِ غنیمت کے حقوق کی وضاحت سے معاشرتی تنازعات کا حل نکلتا ہے۔",
                "بیت المال کا حق ادا کرنا دینی اور ملی فریضہ ہے جس میں کوتاہی گناہ ہے۔",
                "صحابہ کا اسوہ ہمیں سکھاتا ہے کہ ہر حال میں شریعت کی حدود میں رہنا چاہیے۔"
              ],
              "english": [
                "Clarifying rights over spoils prevents social conflicts and internal disputes.",
                "Paying the state's share is a religious duty; neglecting it is a serious sin.",
                "The example of the Sahaba teaches us to stay within Shariah limits at all times."
              ]
            }
          }
        ]
      }
    }
  ]
}