{
  "hadithId": 999,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/7"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2413)‏، ومسلم (1672).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری اور امام مسلم دونوں نے روایت کیا ہے۔ اس میں قصاص کے نفاذ کا عملی طریقہ بیان ہوا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2413) and Muslim (1672). It describes the practical implementation of Qisas (retaliation)."
  },
  "importantWords": [
    {
      "arabic": "جَارِيَةً",
      "english": "Young girl",
      "urdu": "بچی / لونڈی"
    },
    {
      "arabic": "رُضَّ",
      "english": "Crushed",
      "urdu": "کچل دیا گیا"
    },
    {
      "arabic": "حَجَرَيْنِ",
      "english": "Two stones",
      "urdu": "دو پتھر"
    },
    {
      "arabic": "فَأَوْمَأَتْ",
      "english": "She gestured / nodded",
      "urdu": "اس نے اشارہ کیا"
    },
    {
      "arabic": "فَأَقَرَّ",
      "english": "He confessed",
      "urdu": "اس نے اقرار کیا"
    },
    {
      "arabic": "قِصَاص",
      "english": "Retaliation",
      "urdu": "برابری کا بدلہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ قصاص میں قاتل کو اسی طریقے سے قتل کیا جا سکتا ہے جس طریقے سے اس نے مقتول کو قتل کیا ہو۔",
    "english": "This Hadith proves that in Qisas, the murderer can be executed in the same manner they used to kill the victim."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2413)",
      "english": "Reported by Al-Bukhari (2413)"
    },
    {
      "arabic": "رواه مسلم (1672)",
      "english": "Reported by Muslim (1672)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6o9l6Kts",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قصاص کا طریقہ کار",
        "english": "Method of Qisas"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برابری کا اصول",
              "english": "Principle of Equality"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک قاتل کو اسی طرح مارا جائے گا جیسے اس نے مقتول کو مارا۔",
                "یہ عدل کا تقاضا ہے کہ جرم اور سزا میں مطابقت ہو۔",
                "اسلامی قانون میں جان کے بدلے جان کا بدلہ برابری پر مبنی ہے۔"
              ],
              "english": [
                "Most jurists agree the killer should be executed as they killed the victim.",
                "Justice demands that the punishment matches the severity and nature of crime.",
                "In Islamic law, life for a life is based on the principle of exactness."
              ]
            }
          },
          {
            "title": {
              "urdu": "اقرارِ جرم کی اہمیت",
              "english": "Importance of Confession"
            },
            "content": {
              "urdu": [
                "صرف اشارے پر سزا نہیں دی گئی بلکہ یہودی کے اعتراف کے بعد حکم ہوا۔",
                "اسلامی عدالت میں ثبوت اور اعتراف سزا کے لیے لازمی شرائط ہیں۔",
                "یہودی کا اقرار اس کے جرم کو قطعی ثابت کرنے کا ذریعہ بنا۔"
              ],
              "english": [
                "Punishment wasn't based solely on the nod but after the Jew's confession.",
                "Proof and confession are mandatory conditions for punishment in Islamic courts.",
                "The Jew's confession served as definitive proof of his heinous crime."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین اور بچوں کا تحفظ",
        "english": "Protection of Women and Children"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچی کے خون کا بدلہ",
              "english": "Retaliation for the Girl's Blood"
            },
            "content": {
              "urdu": [
                "اس سے ثابت ہوا کہ عورت یا بچی کے قتل پر مرد کو قتل کیا جائے گا۔",
                "اسلام میں جان کی قیمت صنف یا عمر کی بنیاد پر مختلف نہیں ہے۔",
                "ایک کمزور بچی کو بھی ریاست کی طرف سے مکمل انصاف فراہم کیا گیا۔"
              ],
              "english": [
                "It proves that a man will be executed for killing a woman or a child.",
                "The value of life in Islam does not differ based on gender or age.",
                "Even a vulnerable young girl was provided full justice by the state."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمی کے لیے قانون",
              "english": "Law Regarding Non-Muslim Citizens"
            },
            "content": {
              "urdu": [
                "یہودی مدینہ کا شہری تھا، اس پر بھی اسلامی تعزیرات لاگو ہوئیں۔",
                "اسلامی ریاست میں غیر مسلموں کی جان کا تحفظ مسلمانوں کی جان جیسا ہے۔",
                "قانون کی نظر میں مجرم صرف مجرم ہوتا ہے، خواہ اس کا مذہب کچھ بھی ہو۔"
              ],
              "english": [
                "The Jew was a citizen of Madinah, and Islamic penalties applied to him.",
                "Non-Muslim lives are protected in an Islamic state just like Muslim lives.",
                "In the eyes of the law, a criminal is a criminal regardless of their faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شہادت اور گواہی",
        "english": "Evidence and Testimony"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقتول کا اشارہ",
              "english": "The Victim's Gesture"
            },
            "content": {
              "urdu": [
                "نزع کی حالت میں مقتول کا اشارہ تفتیش کے لیے اہم بنیاد بن سکتا ہے۔",
                "صحابہ کرام نے بچی کے اشارے کو سنجیدگی سے لیا اور مجرم تک پہنچے۔",
                "یہ نبوی دور میں تفتیشی نظام کی باریکی اور عدل کی مثال ہے۔"
              ],
              "english": [
                "A victim's gesture during their final moments can be a basis for investigation.",
                "The Companions took the girl's nod seriously and reached the culprit.",
                "This exemplifies the precision of the investigative system in the Prophetic era."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم کا خاتمہ",
              "english": "Eradication of Oppression"
            },
            "content": {
              "urdu": [
                "ایسی عبرتناک سزا معاشرے میں درندگی کو روکنے کے لیے ضروری ہے۔",
                "ظالم کو اسی تکلیف کا احساس دلانا عدلِ کامل کا حصہ ہے۔",
                "اسلامی سزائیں معاشرے میں امن و امان کی ضامن ہیں۔"
              ],
              "english": [
                "Such exemplary punishment is necessary to curb brutality in society.",
                "Making the oppressor feel the same pain is part of perfect justice.",
                "Islamic punishments serve as a guarantee for social peace and security."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخت دلی کی ممانعت",
              "english": "Prohibition of Hard-Heartedness"
            },
            "content": {
              "urdu": [
                "معصوم بچی کا سر کچلنا بدترین سنگدلی اور درندگی ہے۔",
                "اسلام ہر قسم کے ظلم اور ناحق خون بہانے کی مذمت کرتا ہے۔",
                "مجرم کو معاف نہ کرنا مظلوم کے خاندان کی داد رسی ہے۔"
              ],
              "english": [
                "Crushing an innocent girl's head is the worst form of cruelty.",
                "Islam condemns all forms of oppression and unlawful bloodshed.",
                "Not pardoning the criminal provides solace to the victim's family."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل کی بالادستی",
              "english": "Supremacy of Justice"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے بغیر کسی رعایت کے اللہ کا قانون نافذ فرمایا۔",
                "معاشرے کی بقا صرف عدل و انصاف کی بالادستی میں ہے۔",
                "ہر شخص کو اپنے کیے کا حساب اسی دنیا اور آخرت میں دینا ہوگا۔"
              ],
              "english": [
                "Allah's Messenger (ﷺ) implemented the law without any concessions.",
                "The survival of society lies only in the supremacy of justice.",
                "Every individual must account for their deeds in this world and the next."
              ]
            }
          }
        ]
      }
    }
  ]
}