{
  "hadithId": 239,
  "hadithNo": 30,
  "hadithReferences": {
    "sunnah.com": ["Sunan Abi Dawud 850", "Jami` at-Tirmidhi 284"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه أبو داود (850)‏ ، والترمذي (284)‏ ، وابن ماجه (898)‏ ، والحاكم (1 / 262/ 271)‏. وقد وردت رواية أخرى بزيادة 'واجبرني' (اور میرے عیوب کی اصلاح فرما) عند بعضهم.",
    "urdu": "صحیح روایت۔ اسے ابو داؤد (850)، ترمذی (284)، ابن ماجہ (898)، اور حاکم (262/1) نے روایت کیا ہے۔ یہ دعا جامع ہے، اور بعض روایات میں 'واجبرنی' (اور میرے عیوب کی اصلاح فرما) کا اضافہ بھی ملتا ہے۔",
    "english": "Authentic (Sahih). Reported by Abu Dawud (850), At-Tirmidhi (284), Ibn Majah (898), and Al-Hakim (1/262). This comprehensive supplication is sometimes reported with the addition of 'Wajburni' (and mend my shortcomings/deficiencies) in some chains."
  },
  "importantWords": [
    {
      "arabic": "بَيْنَ اَلسَّجْدَتَيْنِ",
      "english": "Between the two prostrations",
      "urdu": "دونوں سجدوں کے درمیان"
    },
    {
      "arabic": "اِغْفِرْ لِي",
      "english": "Forgive me",
      "urdu": "مجھے بخش دے"
    },
    {
      "arabic": "وَارْحَمْنِي",
      "english": "And have mercy on me",
      "urdu": "اور مجھ پر رحم فرما"
    },
    {
      "arabic": "وَاهْدِنِي",
      "english": "And guide me",
      "urdu": "اور مجھے ہدایت دے"
    },
    {
      "arabic": "وَعَافِنِي",
      "english": "And grant me well-being",
      "urdu": "اور مجھے عافیت دے"
    },
    {
      "arabic": "وَارْزُقْنِي",
      "english": "And provide for me",
      "urdu": "اور مجھے رزق دے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں دونوں سجدوں کے درمیان کی مسنون دعا کو بیان کرتی ہے، جو دنیا و آخرت کی تمام بنیادی ضروریات (بخشش، رحمت، ہدایت، عافیت، اور رزق) کی طلب پر مشتمل ہے۔ یہ مختصر دعا اپنے مطالب کے لحاظ سے بہت جامع اور پر تاثیر ہے۔",
    "english": "This Hadith clarifies the established supplication recited between the two prostrations, encompassing all basic necessities for this life and the Hereafter: forgiveness, mercy, guidance, well-being, and provision. This brief prayer is highly comprehensive and impactful in its requests."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (850)",
      "english": "Reported by Abu Dawud (850)"
    },
    {
      "arabic": "رواه الترمذي (284)",
      "english": "Reported by At-Tirmidhi (284)"
    },
    {
      "arabic": "صححه الحاكم (1/262)",
      "english": "Authenticated by Al-Hakim (1/262)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7n0PZ3xXg",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جامع دعا کی حیثیت",
        "english": "Status of the Comprehensive Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دنیا و آخرت کی طلب",
              "english": "Requests for World and Hereafter"
            },
            "content": {
              "urdu": [
                "یہ دعا دنیا اور آخرت کی پانچ بنیادی ضروریات کو مختصر الفاظ میں اللہ سے طلب کرتی ہے۔",
                "’اغفر لي‘ (بخشش) کا تعلق گناہوں کی معافی سے ہے، جو آخرت کی کامیابی کا ذریعہ ہے۔",
                "’وارزقني‘ (رزق) اور ’وعافني‘ (عافیت) کا تعلق دنیاوی زندگی کی بقا اور آسانی سے ہے۔"
              ],
              "english": [
                "This supplication asks Allah for five fundamental needs of this world and the Hereafter in concise words.",
                "‘Ighfirli’ (forgiveness) relates to pardoning sins, which is the key to success in the Hereafter.",
                "‘Warzuqni’ (provision) and ‘wa 'aafini’ (well-being) relate to the sustenance and ease of worldly life."
              ]
            }
          },
          {
            "title": {
              "urdu": "عافیت اور ہدایت",
              "english": "Well-being and Guidance"
            },
            "content": {
              "urdu": [
                "’عافنی‘ میں دینی اور دنیوی ہر طرح کی جسمانی اور روحانی سلامتی شامل ہے۔",
                "’واہدنی‘ میں اللہ سے نیک اعمال پر ثابت قدمی اور صراطِ مستقیم پر چلنے کی طلب ہے۔",
                "یہ دعا ان دو سجدوں کے درمیان ہے جو عاجزی کی انتہا ہیں، اس لیے یہاں دعا کرنا مستحب ہے۔"
              ],
              "english": [
                "‘Wa 'aafini’ includes all forms of religious and worldly, physical and spiritual, safety and soundness.",
                "‘Wahdini’ is a request for steadfastness in righteous deeds and being maintained on the straight path.",
                "This prayer is recited between two prostrations, the peak of humility, making this spot ideal for supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی حکم",
        "english": "Juristic and Practical Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکُن یا واجب",
              "english": "Pillar or Obligation"
            },
            "content": {
              "urdu": [
                "یہ دعا سنت ہے، لیکن دو سجدوں کے درمیان بیٹھنا (جلسہ) خود ایک رکن یا واجب ہے۔",
                "مالکی اور شافعی فقہاء کے نزدیک یہ دعا پڑھنا سنت ہے، اس کا چھوٹ جانا نماز کو باطل نہیں کرتا۔",
                "لیکن اس وقت میں کم از کم ایک بار سبحان اللہ کہنے جتنی دیر ٹھہرنا (اطمینان) واجب ہے۔"
              ],
              "english": [
                "This supplication is a Sunnah, but the sitting (Jalsah) between the two prostrations is itself a pillar or an obligation.",
                "According to Maliki and Shafi'i jurists, reciting this specific Du'a is Sunnah, and its omission does not invalidate the prayer.",
                "However, remaining still (Tuma'ninah) in this sitting, for the duration of saying 'SubhanAllah' once, is obligatory."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی مختصر شکل",
              "english": "Shorter Form of Supplication"
            },
            "content": {
              "urdu": [
                "اگر نمازی مختصر وقت میں نماز ادا کر رہا ہو تو صرف 'رب اغفر لي' کہنا بھی ثابت ہے۔",
                "لمبی نفل نمازوں میں اس جامع دعا کو زیادہ مرتبہ پڑھا جا سکتا ہے، جس سے اجر میں اضافہ ہوتا ہے۔",
                "یہ دعا فرض اور نفل دونوں نمازوں میں پڑھنا سنت ہے، کیونکہ حدیث میں عمومیت پائی جاتی ہے۔"
              ],
              "english": [
                "If the worshipper is praying quickly, reciting only 'Rabbigh-fir li' (My Lord, forgive me) is also established.",
                "In longer voluntary prayers, this comprehensive Du'a can be repeated multiple times, increasing the reward.",
                "Reciting this Du'a is Sunnah in both obligatory and voluntary prayers, as the Hadith uses a general term."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی سبق",
        "english": "Spiritual and Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاجزی میں دعا",
              "english": "Supplication in Humility"
            },
            "content": {
              "urdu": [
                "دونوں سجدوں کے درمیان بیٹھنا بندے کو اللہ کی درگاہ میں دعا کا بہترین موقع فراہم کرتا ہے۔",
                "سجدے کی انتہا کے بعد اٹھ کر بیٹھنا، اللہ سے امید اور رحمت کی طلب کو دو چند کرتا ہے۔",
                "یہ مسنون عمل ہمیں سکھاتا ہے کہ ہر رکن میں صرف ذکر نہیں، بلکہ دعا بھی شامل ہونی چاہیے۔"
              ],
              "english": [
                "Sitting between the two prostrations provides the servant with an excellent opportunity to supplicate before Allah.",
                "Rising from the extreme humility of prostration intensifies the hope and seeking of mercy from Allah.",
                "This Sunnah teaches us that every prayer pillar should include not just Dhikr (remembrance), but also Du'a (supplication)."
              ]
            }
          },
          {
            "title": {
              "urdu": "جامعیت کی فضیلت",
              "english": "The Virtue of Comprehensiveness"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کی یہ دعا آپ کی دعاؤں کی جامعیت اور کمال کو ظاہر کرتی ہے۔",
                "ایک مختصر جملے میں دین اور دنیا کی تمام ضروریات کو جمع کرنا آپ ﷺ کی خاص فضیلت ہے۔",
                "یہ دعا نمازی کو دنیا کی فکروں کو اللہ کے سپرد کرنے اور صرف اس پر توکل کا درس دیتی ہے۔"
              ],
              "english": [
                "This supplication of the Prophet (ﷺ) demonstrates the comprehensiveness and perfection of his prayers.",
                "Gathering all the essential needs of faith and world in a short phrase is a unique virtue of the Prophet (ﷺ).",
                "This Du'a teaches the worshipper to surrender worldly worries to Allah and rely solely upon Him."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تطبیق (سنتوں کو جمع کرنا)",
        "english": "Application (Combining Sunnahs)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دوسری دعاؤں کا حکم",
              "english": "Ruling on Other Supplications"
            },
            "content": {
              "urdu": [
                "بعض دیگر روایات میں اس مقام پر 'رب اغفر لي' دو مرتبہ کہنے کا بھی ذکر ہے۔",
                "نمازی کو چاہیے کہ وہ کبھی یہ جامع دعا پڑھے اور کبھی 'رب اغفر لي' کہنے پر اکتفا کرے۔",
                "نماز میں تنوع رکھنا اور مختلف سنتوں پر عمل کرنا اجر اور خشوع کو بڑھاتا ہے۔"
              ],
              "english": [
                "In some other narrations, reciting 'Rabbigh-fir li' twice is also mentioned for this position.",
                "The worshipper should sometimes recite this comprehensive Du'a and sometimes suffice with saying 'Rabbigh-fir li'.",
                "Varying the remembrance and acting upon different Sunnahs in prayer increases reward and devotion."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی ترتیب",
              "english": "Order of the Supplication"
            },
            "content": {
              "urdu": [
                "اس دعا میں پہلے اخروی (بخشش، رحمت) اور پھر دنیاوی (عافیت، رزق) ضروریات کا ذکر ہے۔",
                "یہ ترتیب مومن کی ترجیحات کو واضح کرتی ہے کہ آخرت کی کامیابی مقدم ہے۔",
                "نمازی کو ہمیشہ دینی اور روحانی معاملات کو دنیاوی معاملات پر فوقیت دینی چاہیے۔"
              ],
              "english": [
                "The supplication orders requests for the Hereafter first (forgiveness, mercy) and then worldly needs (well-being, provision).",
                "This order clarifies the believer's priorities: that success in the Hereafter takes precedence.",
                "The worshipper should always prioritize spiritual and religious matters over worldly concerns."
              ]
            }
          }
        ]
      }
    }
  ]
}
