{
  "hadithId": 30,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 2 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب الوضوء",
    "babId": 4
  },

  "takhreej": {
    "arabic": " صحيح.  رواه البخاري (159) ، ومسلم (226)  من طريق عطاء بن يزيد الليثي، عن حمران به. ",
    "urdu": "صحیح (درجہ)۔ اسے بخاری (159) اور مسلم (226) نے عطا بن یزید اللیثی کی سند سے، حمران کے ذریعے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Al-Bukhari (159) and Muslim (226) through the chain of Atā' ibn Yazīd al-Laythī, from Humran, from Uthman (RA)."
  },
  "importantWords": [
    {
      "arabic": "وَضُوءٍ",
      "english": "Water for Wudu",
      "urdu": "وضو کا پانی"
    },
    {
      "arabic": "كَفَّيْهِ",
      "english": "Both hands/palms",
      "urdu": "ہتھیلیاں"
    },
    {
      "arabic": "مَضْمَضَ",
      "english": "Rinsed his mouth",
      "urdu": "کلی کی"
    },
    {
      "arabic": "اِسْتَنْشَقَ",
      "english": "Put water in his nose",
      "urdu": "ناک میں پانی چڑھایا"
    },
    {
      "arabic": "اَلْمِرْفَقِ",
      "english": "Elbow",
      "urdu": "کہنی"
    },
    {
      "arabic": "مَسَحَ بِرَأْسِهِ",
      "english": "Wiped his head",
      "urdu": "سر کا مسح کیا"
    },
    {
      "arabic": "اَلْكَعْبَيْنِ",
      "english": "Ankles",
      "urdu": "ٹخنے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث وضو کا مکمل اور مستند طریقہ بیان کرتی ہے، جس میں سیدنا عثمان رضی اللہ عنہ نے عملی مظاہرہ کر کے دکھایا کہ رسول اللہ صلی اللہ علیہ وسلم کس طرح وضو کیا کرتے تھے، جس میں اعضاء کو تین تین بار دھونا اور ایک بار سر کا مسح کرنا شامل ہے۔",
    "english": "This Hadith demonstrates the complete and authentic method of Wudu (Ablution) as practiced by the Prophet (ﷺ), where Uthman (RA) performed the ritual, showing the washing of limbs three times and wiping the head once."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الوضوء، رقم 159",
      "english": "Sahih Al-Bukhari, The Book of Ablution, Hadith 159"
    },
    {
      "arabic": "صحيح مسلم، كتاب الطهارة، رقم 226",
      "english": "Sahih Muslim, The Book of Purification, Hadith 226"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "حُمْرَانَ مَوْلَى عُثْمَانَ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Humran, the freed slave of Uthman (May Allah be pleased with him)"
      },
      "slug": "humran-mawla-uthman"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Uthman ibn Affan (May Allah be pleased with him)"
      },
      "slug": "uthman-ibn-affan"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-8-wudu-method",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Agreed Upon (by Bukhari and Muslim)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وضو کا عملی مظاہرہ",
        "english": "Practical Demonstration of Wudu"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعضاء کو تین بار دھونا سنت",
              "english": "Washing Limbs Thrice is Sunnah"
            },
            "content": {
              "urdu": [
                "اس حدیث میں سیدنا عثمان رضی اللہ عنہ نے رسول اللہ ﷺ کے وضو کا عملی مظاہرہ کر کے دکھایا، جو وضو کی مکمل سنت کو بیان کرتا ہے۔",
                "وضو کے چار فرض اعضاء (چہرہ، ہاتھ کہنیوں تک، سر کا مسح، پاؤں ٹخنوں تک) میں سے تین کو تین تین بار دھونا **سنت** ہے، نہ کہ فرض۔",
                "تین بار دھونے کا مقصد صفائی میں مبالغہ اور سنت کی تکمیل کرنا ہے تاکہ طہارت مکمل اور اجر زیادہ ہو۔"
              ],
              "english": [
                "In this Hadith, Uthman (RA) practically demonstrated the Prophet's Wudu, illustrating the complete Sunnah method of ablution.",
                "Washing the Wudu limbs (face, hands to elbows, feet to ankles) three times is a **Sunnah**, not an obligation (Fard), for three of the four required actions.",
                "Washing thrice is intended to ensure thorough cleansing and maximize the reward, making the purity complete and the reward substantial."
              ]
            }
          },
          {
            "title": {
              "urdu": "سر کا مسح صرف ایک بار",
              "english": "Wiping the Head Only Once"
            },
            "content": {
              "urdu": [
                "وضو کے دوران ایک اہم فرق یہ ہے کہ سر کا **مسح صرف ایک بار** کیا گیا، جو اس بات کی واضح دلیل ہے کہ سر کا مسح ایک ہی بار سنت ہے۔",
                "تمام فقہاء کا اس بات پر اتفاق ہے کہ وضو میں سر کا مسح صرف ایک بار ہی مشروع ہے اور اسے تین بار کرنا سنت کے خلاف ہے۔",
                "اس سے یہ بھی معلوم ہوتا ہے کہ دھونے اور مسح کرنے کے احکام میں فرق ہے اور ہر عمل کو اس کی مشروعیت کے مطابق انجام دینا چاہیے۔"
              ],
              "english": [
                "A significant detail is that the head was **wiped only once**, which is clear evidence that the Sunnah method for wiping the head is to do it a single time.",
                "All schools of Islamic jurisprudence agree that wiping the head during Wudu is legislated only once, and wiping it three times is contrary to the Sunnah.",
                "This also teaches that there is a difference between the rulings for washing and for wiping, and each act must be performed according to its legislated manner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وضو کے لازمی ارکان",
        "english": "Obligatory Pillars of Wudu (Fara'id)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترتیب اور فرائض کا تعین",
              "english": "Order and Determination of Obligations"
            },
            "content": {
              "urdu": [
                "حضرت عثمان رضی اللہ عنہ کا اس ترتیب سے وضو کرنا (کلی، ناک میں پانی، چہرہ، ہاتھ، سر، پاؤں) اس بات کی دلیل ہے کہ وضو میں **ترتیب** فرض ہے۔",
                "وضو کے چار بنیادی فرائض: چہرہ دھونا، کہنیوں تک ہاتھ دھونا، سر کا مسح کرنا، اور ٹخنوں تک پاؤں دھونا، اسی حدیث سے ثابت ہوتے ہیں۔",
                "یہ حدیث واضح طور پر سنت اور فرض کے درمیان فرق کو واضح کرتی ہے، جہاں فرائض صرف ایک بار بھی ادا ہو سکتے ہیں لیکن سنت تین بار ہے۔"
              ],
              "english": [
                "Uthman's performance of Wudu in this specific order (mouth, nose, face, hands, head, feet) is evidence that maintaining the **sequence (Tartīb)** in Wudu is obligatory (Fard).",
                "The four primary obligatory acts of Wudu (washing the face, hands to elbows, wiping the head, and washing the feet to ankles) are confirmed by this Hadith.",
                "This narration clearly shows the difference between the obligatory acts (which can be done once) and the Sunnah acts (which are optimally done thrice)."
              ]
            }
          },
          {
            "title": {
              "urdu": "کلی اور ناک کی اہمیت",
              "english": "Importance of Rinsing Mouth and Nose"
            },
            "content": {
              "urdu": [
                "حدیث میں کلی کرنا (مضمضہ) اور ناک میں پانی ڈالنا (استنشاق) کو ہاتھوں کے دھونے کے فوراً بعد ذکر کیا گیا ہے اور اسے ایک ساتھ کیا گیا ہے۔",
                "شافعی مسلک کے علاوہ دیگر فقہی مسالک (حنفی، مالکی، حنبلی) میں ناک اور منہ کی صفائی کو وضو کی سنت یا واجبات میں شامل کیا گیا ہے۔",
                "یہ دونوں عمل منہ اور ناک کی مکمل طہارت کے لیے ضروری ہیں تاکہ نماز کے لیے کھڑے ہونے سے پہلے جسم کا ہر حصہ صاف ہو جائے۔"
              ],
              "english": [
                "The Hadith mentions rinsing the mouth (Maḍmaḍah) and drawing water into the nose (Istinshāq) immediately after washing the hands, and they are performed together.",
                "In most schools of Fiqh (Hanafi, Maliki, Hanbali), these two actions are considered either Sunnah or obligatory parts of Wudu, unlike the Shafi'i school.",
                "Both acts are essential for the complete purification of the mouth and nasal passages, ensuring every part of the body is clean before standing for prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دلیل اور راوی کا مقام",
        "english": "Evidence and Status of the Narrators"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "متفق علیہ حدیث کی قوت",
              "english": "The Strength of an 'Agreed Upon' Hadith"
            },
            "content": {
              "urdu": [
                "یہ حدیث 'متفق علیہ' ہے، جو اسے وضو کے طریقہ کار کے تعین کے لیے **قوی ترین دلیل** بناتی ہے اور تمام امت کے لیے قابل قبول ہے۔",
                "نبی ﷺ کے وضو کے عملی طریقے کو ایک جلیل القدر صحابی (عثمانؓ) نے اپنے خادم (حمران) کے سامنے کیا، جو تعلیم دینے کا بہترین ذریعہ تھا۔",
                "وضو کا یہ طریقہ اس بات کو یقینی بناتا ہے کہ مسلمانوں کو طہارت کے بارے میں کوئی شک و شبہ نہ رہے اور وہ درست سنت پر عمل کریں۔"
              ],
              "english": [
                "This Hadith is classified as 'Agreed Upon' (Muttafaqun ʿAlayh), making it the **strongest evidence** for determining the procedure of Wudu and universally accepted by the Ummah.",
                "The practical demonstration of the Prophet's Wudu by a noble Companion (Uthman RA) to his servant (Humran) served as the ideal method of instruction.",
                "This method ensures that Muslims have no doubt regarding the process of purification and can follow the precise Sunnah practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا طریقہ تعلیم",
              "english": "The Companions' Method of Teaching"
            },
            "content": {
              "urdu": [
                "سیدنا عثمان رضی اللہ عنہ نے صرف زبانی تعلیم نہیں دی، بلکہ خود وضو کر کے یہ ثابت کیا کہ وضو کو سنت کے مطابق کیسے انجام دینا چاہیے۔",
                "یہ طریقہ (عملی مظاہرہ) آج بھی تعلیم و تعلم کا مؤثر ترین طریقہ سمجھا جاتا ہے، جسے صحابہ کرام نے اختیار کیا۔",
                "ان کا یہ کہنا کہ 'میں نے رسول اللہ ﷺ کو اسی طرح وضو کرتے دیکھا ہے' اس بات کو یقینی بناتا ہے کہ یہ طریقہ بالکل نبی ﷺ کی سنت کے مطابق ہے۔"
              ],
              "english": [
                "Uthman (RA) did not just teach verbally; he performed the Wudu himself, establishing how the ritual should be executed according to the Sunnah.",
                "This method (practical demonstration) is still considered the most effective way of teaching, a methodology adopted by the early Companions.",
                "His concluding statement, 'I saw the Messenger of Allah (ﷺ) performing Wudu like this,' assures the community that this specific method aligns perfectly with the Prophet's Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وضو کے اضافی فوائد",
        "english": "Additional Benefits of Wudu"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہوں کی معافی کا وعدہ",
              "english": "The Promise of Sin Forgiveness"
            },
            "content": {
              "urdu": [
                "اسی حدیث کے دیگر طرق میں ذکر ہے کہ جب حضرت عثمانؓ نے وضو کیا تو فرمایا کہ جو اس طرح وضو کرے گا اس کے گناہ معاف کر دیے جائیں گے۔",
                "وضو کا ہر قطرہ جس عضو سے گرتا ہے، وہ اس عضو سے ہونے والے چھوٹے گناہوں کو دھو ڈالتا ہے، جیسا کہ صحیح مسلم میں صراحت ہے۔",
                "اس سے وضو کی ظاہری اور باطنی طہارت، یعنی جسمانی صفائی اور روحانی گناہوں کی معافی، دونوں کا مقصد واضح ہوتا ہے۔"
              ],
              "english": [
                "Other versions of this Hadith mention that when Uthman (RA) finished Wudu, he stated that whoever performs Wudu in this manner will have their sins forgiven.",
                "Every drop of water that falls from a washed limb carries away the minor sins committed by that specific limb, as explicitly mentioned in Sahih Muslim.",
                "This highlights the dual purpose of Wudu: outward purification (physical cleanliness) and inward purification (forgiveness of spiritual sins)."
              ]
            }
          },
          {
            "title": {
              "urdu": "ٹخنوں اور کہنیوں کو دھونا",
              "english": "Washing the Elbows and Ankles"
            },
            "content": {
              "urdu": [
                "حدیث میں ہاتھوں کو **کہنیوں تک** اور پاؤں کو **ٹخنوں تک** دھونے کا واضح حکم دیا گیا ہے، جس میں یہ دونوں حصے شامل ہیں۔",
                "فقہاء کا اتفاق ہے کہ آیت وضو میں مذکور 'الی' (تک) کا مطلب ہے کہ ان حدود کو دھونا بھی واجب ہے اور یہ سنتِ نبوی سے ثابت ہے۔",
                "یہاں تک کہنی اور ٹخنے دونوں اعضاء کو اچھی طرح دھونا طہارت کو مکمل کرنے کے لیے ضروری ہے اور ہر فقہی مسلک میں یہ لازم ہے۔"
              ],
              "english": [
                "The Hadith clearly commands washing the hands **up to the elbows** and the feet **up to the ankles**, including both the elbow and the ankle joints.",
                "Jurists agree that the word 'ilā' (up to) in the Qur'anic verse implies that these boundary points must also be washed, which is confirmed by the Prophetic Sunnah.",
                "Ensuring both the elbow and ankle joints are thoroughly washed is essential for completing the purification and is required in all schools of Fiqh."
              ]
            }
          }
        ]
      }
    }
  ]
}
