{
  "hadithId": 782,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/782"],
    "kitabId": 7,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 57
  },
 
  "takhreej": {
    "arabic": "صحيح .‏ رواه أبو داود ( 3058 ) ، والترمذي ( 1381 ) ، وصححه ابن حبان ( 5198 ) ، وأخرجه أحمد ( 4/316 ) . وقال الترمذي: حسن صحيح. ",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (3058)، ترمذی (1381) اور ابن حبان نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3058), At-Tirmidhi (1381), and graded Sahih by Ibn Hibban (5198). Also reported by Ahmad in his Musnad."
  },
  "importantWords": [
    {
      "arabic": "أَقْطَعَهُ",
      "english": "Allotted / Granted as an estate",
      "urdu": "جاگیر عطا فرمائی"
    },
    {
      "arabic": "أَرْضًا",
      "english": "Land",
      "urdu": "زمین"
    },
    {
      "arabic": "حَضْرَمَوْتَ",
      "english": "Hadramaut (Region in Yemen)",
      "urdu": "حضرموت"
    },
    {
      "arabic": "إِقْطَاع",
      "english": "Land Grant / Fief",
      "urdu": "اقطاع (زمین کا ٹکڑا دینا)"
    },
    {
      "arabic": "سَمَّى",
      "english": "Designated",
      "urdu": "نامزد کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ اسلامی ریاست کے سربراہ (امام) کو یہ حق حاصل ہے کہ وہ عوامی مفاد یا کسی کی تالیفِ قلب کے لیے بنجر یا سرکاری زمین کسی فرد کو بطور جاگیر عطا کرے۔",
    "english": "This Hadith establishes that the head of the Islamic state has the authority to grant land (Iqta') to individuals for the sake of public welfare or to win over hearts."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3058)",
      "english": "Reported by Abu Dawud (3058)"
    },
    {
      "arabic": "رواه الترمذي (1381)",
      "english": "Reported by At-Tirmidhi (1381)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "وائل بن حجر",
        "english": "Wail bin Hujr"
      },
      "slug": "wail-bin-hujr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "علقمة بن وائل",
        "english": "Alqamah bin Wail"
      },
      "slug": "alqamah-bin-wail"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T-XQYqBvI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اقطاع (زمین کی الاٹمنٹ) کا تصور",
        "english": "The Concept of Iqta' (Land Granting)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ریاستی اختیار",
              "english": "State Authority"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست کا سربراہ بنجر یا ایسی زمین جو کسی کی ملکیت نہ ہو، کسی کو دے سکتا ہے۔",
                "یہ الاٹمنٹ اس لیے کی جاتی ہے تاکہ زمین کو آباد کیا جائے اور معاشی فائدہ ہو۔",
                "نبی ﷺ کا وائل بن حجر کو زمین دینا اس قانون کے جواز کی سب سے بڑی دلیل ہے۔"
              ],
              "english": [
                "The head of the Islamic state can grant barren or unclaimed land to individuals.",
                "Such allotments are made to encourage cultivation and promote economic activity.",
                "The Prophet's (ﷺ) grant to Wail bin Hujr is primary evidence for this legal provision."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقصد اور حکمت",
              "english": "Purpose and Wisdom"
            },
            "content": {
              "urdu": [
                "جاگیر عطا کرنے کا مقصد زمین کی پیداواری صلاحیت کو بروئے کار لانا ہوتا ہے۔",
                "اس کے ذریعے مخلص لوگوں کی حوصلہ افزائی اور نو مسلموں کی تالیفِ قلب کی جاتی ہے۔",
                "اسلامی نظام میں زمین کو معطل رکھنے کے بجائے اسے تقسیم کرنا ترجیح ہے۔"
              ],
              "english": [
                "The goal of land grants is to utilize the productive potential of the earth.",
                "It serves to encourage loyal citizens and win over the hearts of new converts.",
                "The Islamic system prioritizes distributing land for use rather than keeping it idle."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اقطاع کی اقسام اور حدود",
        "english": "Types and Limits of Land Grants"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کون سی زمین دی جا سکتی ہے؟",
              "english": "What Land can be Granted?"
            },
            "content": {
              "urdu": [
                "صرف وہ زمین جو کسی کی پہلے سے نجی ملکیت نہ ہو، وہ اقطاع کی جا سکتی ہے۔",
                "عوامی سہولیات جیسے راستے، کنویں اور چراگاہیں کسی کو الاٹ نہیں کی جا سکتیں۔",
                "ایسی جگہ جہاں معدنیات (نمک، تیل وغیرہ) نکل رہی ہوں، وہ بھی اقطاع نہیں ہو سکتی۔"
              ],
              "english": [
                "Only land that is not already under private ownership can be granted as an estate.",
                "Public utilities like roads, communal wells, and pastures cannot be allotted to individuals.",
                "Lands containing public mineral resources (salt, oil, etc.) are also excluded from private grants."
              ]
            }
          },
          {
            "title": {
              "urdu": "آبادی کی شرط",
              "english": "Condition of Cultivation"
            },
            "content": {
              "urdu": [
                "جس شخص کو زمین دی جائے اس پر لازم ہے کہ وہ ایک مقررہ مدت میں اسے آباد کرے۔",
                "اگر وہ زمین کو بنجر چھوڑ دے، تو ریاست وہ زمین واپس لے کر کسی اور کو دے سکتی ہے۔",
                "سیدنا عمر رضی اللہ عنہ نے فرمایا تھا کہ تین سال تک آباد نہ کرنے والے کا حق ختم ہے۔"
              ],
              "english": [
                "The recipient of a land grant is obligated to develop or cultivate it within a specific time.",
                "If the land remains barren, the state can reclaim it and reassign it to someone else.",
                "Umar (RA) decreed that anyone who leaves land idle for three years loses their right to it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور انتظامی پہلو",
        "english": "Juristic and Administrative Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوقِ ملکیت",
              "english": "Ownership Rights"
            },
            "content": {
              "urdu": [
                "ایک بار جب اقطاع مکمل ہو جائے، تو وہ شخص اس زمین کا شرعی مالک بن جاتا ہے۔",
                "وہ اسے فروخت کر سکتا ہے، ہبہ کر سکتا ہے یا اپنی اولاد کے لیے وراثت میں چھوڑ سکتا ہے۔",
                "ریاست بلاوجہ کسی کی الاٹ شدہ زمین واپس نہیں لے سکتی جب تک کوئی قانونی وجہ نہ ہو۔"
              ],
              "english": [
                "Once the land grant process is complete, the individual becomes the legal Shariah owner.",
                "The owner may sell, gift, or pass the land down to heirs as part of an inheritance.",
                "The state cannot arbitrarily seize allotted land without a valid legal justification."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کی ضرورت",
              "english": "Necessity of Justice"
            },
            "content": {
              "urdu": [
                "حاکم کو چاہیے کہ وہ صرف منظورِ نظر افراد کو نہیں بلکہ حقداروں کو زمین دے۔",
                "اقطاع میں اقرباء پروری (Nepotism) کی شرعاً ممانعت ہے۔",
                "فیصلہ ہمیشہ عوامی مفاد اور سماجی توازن کو مدِ نظر رکھ کر کرنا چاہیے۔"
              ],
              "english": [
                "The ruler should grant land to the deserving and not just to favored associates.",
                "Nepotism in land allotment is religiously prohibited in Islamic law.",
                "Decisions must always consider public interest and social equilibrium."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بنجر زمینوں کی آبادی",
              "english": "Developing Barren Lands"
            },
            "content": {
              "urdu": [
                "زمین کو خالی چھوڑنا معاشی بوجھ ہے، اسے پیداواری بنانا سنت ہے۔",
                "نئے علاقوں میں ہجرت اور وہاں زراعت کو فروغ دینا قومی ترقی کا راز ہے۔",
                "ایک مسلمان کو چاہیے کہ وہ قدرتی وسائل کو آباد کرنے میں اپنا حصہ ڈالے۔"
              ],
              "english": [
                "Leaving land idle is an economic burden; making it productive is a Sunnah.",
                "Migrating to new areas and promoting agriculture there is a secret to national success.",
                "A Muslim should contribute toward the development and revival of natural resources."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاست اور عوام کا تعاون",
              "english": "State and Citizen Cooperation"
            },
            "content": {
              "urdu": [
                "ریاست کی دی ہوئی زمین کو امانت سمجھ کر اس پر محنت کرنی چاہیے۔",
                "سرکاری الاٹمنٹ کے قوانین کی پاسداری کرنا شرعی طور پر لازم ہے۔",
                "کسی کی نجی زمین یا عوامی چراگاہ پر جاگیر کا دعویٰ کرنا ظلم ہے۔"
              ],
              "english": [
                "Land granted by the state should be treated as a trust and developed with hard work.",
                "Adhering to government allotment regulations is a Shariah obligation.",
                "Claiming a private property or public pasture as one's personal estate is oppression."
              ]
            }
          }
        ]
      }
    }
  ]
}