{
  "hadithId": 461,
  "hadithNo": 37,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1325",
      "https://sunnah.com/muslim:945"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1325)، ومسلم (945). واللفظ المتفق عليه يؤكد عظم الأجر في اتباع الجنائز، والقيراط هنا ليس كقيراط المال بل هو مقدار عظيم من الأجر عند الله تعالى.",
    "urdu": "یہ حدیث صحیح ہے اور اسے بخاری (1325) اور مسلم (945) نے روایت کیا ہے۔ اس میں جنازے کے ساتھ جانے کی فضیلت بیان ہوئی ہے۔ قیراط سے مراد یہاں کرنسی نہیں بلکہ اللہ کے ہاں اجر کا ایک بہت بڑا پیمانہ ہے۔",
    "english": "Authentic. Reported by Al-Bukhari (1325) and Muslim (945). The Hadith emphasizes the immense reward for following a funeral. The 'Qirat' mentioned here is not a unit of currency but represents a vast measure of reward from Allah."
  },
  "importantWords": [
    {
      "arabic": "شَهِدَ",
      "english": "Attended",
      "urdu": "حاضر ہوا"
    },
    {
      "arabic": "قِيرَاطٌ",
      "english": "Qirat (Large unit of reward)",
      "urdu": "قیراط (اجر کی بڑی مقدار)"
    },
    {
      "arabic": "تُدْفَنَ",
      "english": "Buried",
      "urdu": "دفن کیا جائے"
    },
    {
      "arabic": "إِيمَانًا",
      "english": "Out of faith",
      "urdu": "ایمان کی حالت میں"
    },
    {
      "arabic": "وَاحْتِسَابًا",
      "english": "Seeking reward",
      "urdu": "ثواب کی نیت سے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں جنازہ کی نماز اور تدفین میں شرکت کے عظیم ثواب کو 'قیراط' (احد پہاڑ کے برابر اجر) سے تشبیہ دے کر بیان کیا گیا ہے۔",
    "english": "This Hadith describes the immense reward of attending funeral prayers and burials by comparing each stage's reward to a 'Qirat' (as large as Mount Uhud)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (47)",
      "english": "Sahih al-Bukhari (47)"
    },
    {
      "arabic": "صحيح مسلم (945)",
      "english": "Sahih Muslim (945)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جنازہ کی فضیلت اور اجر",
        "english": "The Virtue and Reward of Funerals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قیراط کی حقیقت",
              "english": "The Reality of a Qirat"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے قیراط کو احد پہاڑ جتنا عظیم اجر قرار دیا ہے۔",
                "یہ اس بات کی دلیل ہے کہ نیکی چھوٹی ہو یا بڑی، اللہ اسے بڑھاتا ہے۔",
                "صرف نمازِ جنازہ پڑھنے پر بھی احد پہاڑ جتنا ثواب ملتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) defined a Qirat as a reward as massive as Mount Uhud.",
                "This proves that Allah multiplies rewards for good deeds, regardless of their perceived size.",
                "Even just performing the funeral prayer earns a reward equivalent to Mount Uhud."
              ]
            }
          },
          {
            "title": {
              "urdu": "تدفین تک قیام کا ثواب",
              "english": "Reward for Staying Until Burial"
            },
            "content": {
              "urdu": [
                "تدفین تک رکنے والے کو دو قیراط یعنی دو پہاڑوں جتنا اجر ملتا ہے۔",
                "یہ عمل میت کے ساتھ ہمدردی اور آخری رسومات میں مکمل شرکت کا صلہ ہے۔",
                "اسلام مسلمانوں کے درمیان آخری وقت تک کے تعلق کو اہمیت دیتا ہے۔"
              ],
              "english": [
                "One who stays until the burial earns two Qirats, equivalent to two huge mountains.",
                "This reward is for showing compassion and full participation in the final rites.",
                "Islam emphasizes the bond between Muslims until the very last moment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرائطِ قبولیت",
        "english": "Conditions for Acceptance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان اور احتساب",
              "english": "Faith and Seeking Reward"
            },
            "content": {
              "urdu": [
                "اجر کے حصول کے لیے ایمان اور خالص ثواب کی نیت شرط ہے۔",
                "رسم و رواج یا دکھاوے کے لیے شرکت اجر کو ضائع کر سکتی ہے۔",
                "نیت کی درستی ہی عمل کو احد پہاڑ جتنا وزنی بناتی ہے۔"
              ],
              "english": [
                "Faith and a sincere intention for reward are prerequisites for this merit.",
                "Participation out of custom or for show can nullify the spiritual reward.",
                "The correctness of intention makes the deed as heavy as Mount Uhud."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلمان کی ہمدردی",
              "english": "Compassion for a Muslim"
            },
            "content": {
              "urdu": [
                "یہ فضیلت ایک مسلمان بھائی کے جنازے میں شرکت سے متعلق ہے۔",
                "اس سے مسلمانوں کے باہمی حقوق اور اخوت کا اظہار ہوتا ہے۔",
                "جنازے میں شرکت کرنا حقوق العباد کا ایک اہم حصہ ہے۔"
              ],
              "english": [
                "This virtue is specifically related to attending the funeral of a fellow Muslim.",
                "It expresses the mutual rights and brotherhood shared among Muslims.",
                "Attending a funeral is a significant part of fulfilling the rights of others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی سرمایہ کاری",
              "english": "Investment of Time"
            },
            "content": {
              "urdu": [
                "جنازے کے لیے نکالا گیا تھوڑا سا وقت ابدی اجر کا باعث ہے۔",
                "دنیاوی کاموں کے مقابلے میں آخرت کے سودے کو ترجیح دینی چاہیے۔",
                "یہ حدیث ہمیں وقت کی قدر اور نیکی کے مواقع تلاش کرنے کا درس دیتی ہے۔"
              ],
              "english": [
                "A small amount of time taken for a funeral yields eternal rewards.",
                "One should prioritize the transactions of the Hereafter over worldly tasks.",
                "This Hadith teaches us to value time and seek opportunities for goodness."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کی یاد",
              "english": "Remembrance of Death"
            },
            "content": {
              "urdu": [
                "جنازے میں شرکت انسان کو اپنی موت کی یاد دلاتی ہے۔",
                "قبرستان جانے سے دل میں نرمی اور دنیا سے بے رغبتی پیدا ہوتی ہے۔",
                "اجر کے ساتھ ساتھ یہ عمل روحانی اصلاح کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Participating in a funeral reminds a person of their own eventual death.",
                "Visiting the graveyard softens the heart and reduces attachment to the world.",
                "Alongside the reward, this act is a prime means of spiritual reform."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی و تعلیمی پہلو",
        "english": "Educational and Training Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا طرزِ عمل",
              "english": "The Way of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام ان احادیث کو سن کر نیکیوں میں سبقت لے جاتے تھے۔",
                "عبداللہ بن عمر رضی اللہ عنہ نے یہ سن کر افسوس کیا کہ کتنے قیراط ضائع کیے۔",
                "ہمیں بھی سنتِ نبوی پر عمل کرنے کا ویسا ہی شوق پیدا کرنا چاہیے۔"
              ],
              "english": [
                "Upon hearing these Hadiths, the Companions used to race toward good deeds.",
                "Ibn Umar (RA) expressed regret over how many Qirats he might have missed.",
                "We should develop a similar eagerness to act upon the Prophetic Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی وسیع رحمت",
              "english": "The Vast Mercy of Allah"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ تھوڑے عمل پر بہت زیادہ اجر عطا فرماتا ہے۔",
                "یہ حدیث اللہ کے فضل اور بندوں پر اس کی شفقت کی علامت ہے۔",
                "مسلمان کو کبھی بھی کسی چھوٹی نیکی کو حقیر نہیں سمجھنا چاہیے۔"
              ],
              "english": [
                "Allah Almighty bestows immense rewards for even small actions.",
                "This Hadith signifies Allah's grace and His compassion for His servants.",
                "A Muslim should never belittle any small act of kindness or piety."
              ]
            }
          }
        ]
      }
    }
  ]
}