{
  "hadithId": 1269,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/34"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "الجامع - باب الزهد والورع",
    "babId": 104
  },
  
  "takhreej": {
    "arabic": "حسن صحيح. رواه أبو داود (4031)، وأحمد (2/50)، وابن حبان (رقم 4754 - موارد)، وصححه الألباني في صحيح الجامع (6149).",
    "urdu": "حسن صحیح۔ اسے ابوداؤد (4031)، امام احمد (2/50) نے روایت کیا ہے اور علامہ البانی نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan Sahih. Reported by Abu Dawud (4031), Ahmad (2/50), and Ibn Hibban. Graded Sahih by Al-Albani in Sahih al-Jami' (6149)."
  },
  "importantWords": [
    {
      "arabic": "تَشَبَّهَ",
      "english": "Imitates / Copies",
      "urdu": "مشابہت اختیار کرنا / نقل اتارنا"
    },
    {
      "arabic": "بِقَوْمٍ",
      "english": "A people / nation",
      "urdu": "کسی قوم سے"
    },
    {
      "arabic": "فَهُوَ مِنْهُمْ",
      "english": "He is from them",
      "urdu": "پس وہ انہی میں سے ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مسلمانوں کو اپنی منفرد ایمانی اور اخلاقی شناخت برقرار رکھنے اور غیر مسلموں کے مذہبی و خصوصی شعار کی نقالی کرنے سے روکا گیا ہے۔",
    "english": "This Hadith warns Muslims against losing their religious identity and prohibits imitating the specific religious or cultural symbols of non-Muslims."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب اللباس، باب في لبس الشهرة، رقم 4031",
      "english": "Sunan Abi Dawud, Book of Clothing, No. 4031"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مشابہت کا شرعی مفہوم",
        "english": "The Sharia Concept of Imitation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشابہت کی تعریف",
              "english": "Definition of Tashabbuh"
            },
            "content": {
              "urdu": [
                "مشابہت سے مراد کسی دوسری قوم کے ان مخصوص طریقوں کو اپنانا ہے جو ان کی مذہبی یا ثقافتی پہچان ہوں۔",
                "ایسی چیزیں جو مسلمانوں کے وقار کے خلاف ہوں یا غیر اسلامی عقائد کی عکاسی کریں، ان کی ممانعت ہے۔",
                "نبی کریم ﷺ نے مسلمانوں کو اپنی ایک الگ اور ممتاز پہچان رکھنے کا حکم دیا ہے۔"
              ],
              "english": [
                "Tashabbuh means adopting the specific practices of another nation that represent their religious or cultural identity.",
                "Practices that contradict Muslim dignity or reflect un-Islamic beliefs are prohibited.",
                "The Prophet (ﷺ) commanded Muslims to maintain a distinct and distinguished identity."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممنوعہ مشابہت کے درجات",
              "english": "Levels of Prohibited Imitation"
            },
            "content": {
              "urdu": [
                "کفر اور شرک کے مذہبی شعائر (جیسے صلیب پہننا یا بتوں کی پوجا) کی مشابہت کفر تک لے جا سکتی ہے۔",
                "گناہگاروں اور بدکردار لوگوں کے مخصوص لباس اور فیشن کی نقالی حرام یا مکروہ ہے۔",
                "ایسی مشابہت جو صرف انتظامی یا سائنسی نوعیت کی ہو (جیسے ٹیکنالوجی کا استعمال) وہ جائز ہے۔"
              ],
              "english": [
                "Imitating religious symbols of Kufr (like wearing a cross) can lead to disbelief.",
                "Copying the specific attire or fashions of immoral people is forbidden or disliked.",
                "Imitation in administrative or scientific matters (like using technology) is permissible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شناخت اور نفسیاتی اثرات",
        "english": "Identity and Psychological Effects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظاہر اور باطن کا تعلق",
              "english": "The Link Between Outward and Inward"
            },
            "content": {
              "urdu": [
                "انسان کا ظاہری حلیہ اس کے باطنی میلان اور محبت کی عکاسی کرتا ہے۔",
                "جب کوئی کسی قوم کی نقالی کرتا ہے، تو رفتہ رفتہ اس کے دل میں ان کے لیے ہمدردی اور محبت پیدا ہوتی ہے۔",
                "اسلام چاہتا ہے کہ مسلمان کی وفاداری اور محبت صرف اللہ اور اس کے رسول ﷺ کے لیے ہو۔"
              ],
              "english": [
                "A person's outward appearance reflects their inner inclinations and affections.",
                "Imitating a people gradually fosters sympathy and love for them in the heart.",
                "Islam desires that a Muslim's loyalty and love remain exclusively for Allah and His Messenger (ﷺ)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی دور کی مثالیں",
        "english": "Examples from the Prophetic Era"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مخالفتِ اہل کتاب",
              "english": "Opposing the People of the Book"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے عاشورہ کے روزے کے ساتھ ایک اور روزہ ملانے کا حکم دیا تاکہ یہودیوں سے مشابہت نہ ہو۔",
                "نماز کے لیے اذان کا طریقہ اپنایا گیا تاکہ ناقوس یا آگ روشن کرنے کے طریقوں سے بچا جا سکے۔",
                "آپ ﷺ نے مسلمانوں کو اپنی داڑھیاں بڑھانے اور مونچھیں تراشنے کا حکم دیا تاکہ مشرکین سے فرق واضح ہو۔"
              ],
              "english": [
                "The Prophet (ﷺ) ordered an extra day of fasting for Ashura to differ from the Jews.",
                "The Adhan was chosen for the call to prayer to avoid using bells or fires.",
                "He (ﷺ) commanded Muslims to grow beards and trim mustaches to distinguish them from polytheists."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "موجودہ دور میں اطلاق",
        "english": "Application in the Modern Era"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ثقافتی یلغار سے بچاؤ",
              "english": "Avoiding Cultural Invasion"
            },
            "content": {
              "urdu": [
                "غیر مسلموں کے تہوار (جیسے ویلنٹائن ڈے، ہیلووین) منانا اسی ممنوعہ مشابہت میں آتا ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی تہذیب و تمدن پر فخر کریں اور اسے نہ چھوڑیں۔",
                "شناخت کا کھو جانا درحقیقت قوموں کے زوال کی پہلی سیڑھی ہوتی ہے۔"
              ],
              "english": [
                "Celebrating non-Muslim festivals (like Valentine's Day, Halloween) falls under prohibited imitation.",
                "Muslims should take pride in their own civilization and values and not abandon them.",
                "Losing one's identity is the first step toward the decline of a nation."
              ]
            }
          }
        ]
      }
    }
  ]
}