{
  "hadithId": 149,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["1:3:6"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  
  "takhreej": {
    "arabic": " صحيح.‏ رواه مسلم (887)‏. ورواه البخاري (960)‏، ومسلم (886)‏ عن ابن عباس وجابر بن عبد الله رضي الله عنهما بمعنى نفي الأذان والإقامة للعيدين.‏",
    "urdu": "صحیح۔ اسے مسلم (887) نے روایت کیا ہے۔ اور بخاری (960) اور مسلم (886) نے ابن عباس اور جابر بن عبداللہ رضی اللہ عنہم سے بھی اذان اور اقامت کی نماز عیدین کے لیے نفی کے معنی میں روایت کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (887). And reported by Al-Bukhārī (960) and Muslim (886) from Ibn 'Abbās and Jābir ibn 'Abdillāh (RA) concerning the negation of the Adhān and Iqāmah for the two 'Eid prayers.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "اَلْعِيدَيْنِ",
      "english": "The two 'Eid prayers",
      "urdu": "دو عیدوں کی نمازیں"
    },
    {
      "arabic": "غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ",
      "english": "Not just once or twice (many times)",
      "urdu": "ایک یا دو مرتبہ نہیں (بلکہ کئی بار)"
    },
    {
      "arabic": "بِغَيْرِ أَذَانٍ",
      "english": "Without Adhān",
      "urdu": "اذان کے بغیر"
    },
    {
      "arabic": "وَلَا إِقَامَةٍ",
      "english": "Nor Iqāmah",
      "urdu": "اور نہ اقامت کے بغیر"
    },
    {
      "arabic": "صَلَّيْتُ",
      "english": "I prayed",
      "urdu": "میں نے نماز پڑھی"
    },
    {
      "arabic": "مُتَّفَقِ",
      "english": "Agreed upon (Bukhari and Muslim)",
      "urdu": "بخاری و مسلم میں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ نماز عید الفطر اور عید الاضحی (عیدین) کی ادائیگی کے لیے اذان یا اقامت کہنے کا کوئی شرعی حکم نہیں ہے، بلکہ نبی اکرم صلی اللہ علیہ وسلم کا عمل بھی اس کے خلاف تھا۔ یہ حکم عیدین کی نماز کے مخصوص شرعی طریقہ کا حصہ ہے۔",
    "english": "This Hadith clarifies that there is no legal requirement for the Adhān or Iqāmah for the two 'Eid prayers ('Īd al-Fiṭr and 'Īd al-Aḍḥā). The Prophet's (ﷺ) repeated practice was to perform these prayers without them, establishing a specific legal method for 'Eid prayers."
  },
  "references": [
    {
      "arabic": "رواه مسلم (887)",
      "english": "Reported by Muslim (887)"
    },
    {
      "arabic": "رواه البخاري (960) عن ابن عباس",
      "english": "Reported by Al-Bukhārī (960) from Ibn 'Abbās"
    },
    {
      "arabic": "رواه مسلم (886) عن ابن عباس",
      "english": "Reported by Muslim (886) from Ibn 'Abbās"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن سمرة",
        "english": "Jābir ibn Samurah"
      },
      "slug": "jabir-ibn-samurah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn 'Abbās"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kR9U_vH0xYk",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز عیدین کا حکم",
        "english": "The Ruling on 'Eid Prayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان و اقامت کی نفی",
              "english": "Negation of Adhān and Iqāmah"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح نص ہے کہ نماز عیدین کے لیے اذان اور اقامت کہنے کا کوئی شرعی جواز نہیں ہے۔",
                "صحابہ کرامؓ نے نبی اکرم ﷺ کے ساتھ متعدد مرتبہ یہ نمازیں پڑھیں اور اذان و اقامت کی نفی کی۔",
                "اذان و اقامت صرف پانچ فرض نمازوں کے لیے مشروع ہیں، عیدین یا دیگر نوافل کے لیے نہیں۔"
              ],
              "english": [
                "This Hadith is a clear text that there is no legal basis for calling the Adhān or Iqāmah for the 'Eid prayers.",
                "The Companions (RA) performed these prayers numerous times with the Prophet (ﷺ) and negated the presence of Adhān and Iqāmah.",
                "Adhān and Iqāmah are only legislated for the five obligatory prayers, not for 'Eid or other voluntary prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماع اور اتفاق",
              "english": "Consensus and Agreement"
            },
            "content": {
              "urdu": [
                "اہل علم کا اس بات پر اجماع ہے کہ نماز عیدین کے لیے اذان و اقامت نہیں کہی جاتی ہے۔",
                "نبی ﷺ کے عمل سے صرف عیدین کے لیے اعلان کی جگہ 'الصلاة جامعة' (نماز جامع ہے) کہنے کی کوئی دلیل نہیں۔",
                "اس نماز کی اطلاع عمومی اعلان کے ذریعے دی جاتی تھی یا عید گاہ میں لوگوں کے جمع ہونے سے ہوتی تھی۔"
              ],
              "english": [
                "There is consensus among the scholars that no Adhān or Iqāmah is called for the 'Eid prayers.",
                "The Prophet's (ﷺ) practice does not include substituting the Adhān with 'Aṣ-ṣalātu jāmi'ah' (Prayer is assembling) for 'Eid prayers, unlike solar/lunar eclipses.",
                "Notice for this prayer was given either through general announcement or by the gathering of people at the Musallā ('Eid ground)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور طریقہ کار",
        "english": "Juristic Wisdom and Procedure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیگر نمازوں کا حکم",
              "english": "Rulings for Other Prayers"
            },
            "content": {
              "urdu": [
                "استسقاء (بارش طلب کرنے کی نماز) اور کسوف و خسوف (سورج/چاند گرہن) کی نمازوں کے لیے بھی اذان و اقامت نہیں ہے۔",
                "ان نمازوں کے لیے 'الصلاة جامعة' کا اعلان کرنا صحیح سنت سے ثابت ہے، جو عیدین کے لیے نہیں۔",
                "اس سے نماز عیدین کی انفرادیت اور دیگر اجتماعی نمازوں سے فرق واضح ہوتا ہے۔"
              ],
              "english": [
                "Neither Adhān nor Iqāmah is legislated for Ṣalāt al-Istisqā' (rain prayer) or Ṣalāt al-Kusūf/Khusūf (eclipse prayers).",
                "Announcing 'Aṣ-ṣalātu jāmi'ah' is proven by authentic Sunnah for the eclipse prayers, but not for 'Eid.",
                "This distinction clarifies the uniqueness of 'Eid prayers compared to other communal prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطبہ اور نماز",
              "english": "Sermon and Prayer"
            },
            "content": {
              "urdu": [
                "نماز عیدین اذان کے بغیر ہی ادا کی جاتی ہے، اور اس کے بعد خطبہ ہوتا ہے، جو اس کی ایک خاص پہچان ہے۔",
                "امام نماز سے پہلے خطبہ کے ذریعے اذان کی ضرورت کو پورا نہیں کرتا، کیونکہ نماز خود ہی ایک اطلاع ہے۔",
                "عید کا خطبہ نماز سے مؤخر کیا جاتا ہے، جبکہ جمعہ کا خطبہ نماز سے مقدم ہوتا ہے۔"
              ],
              "english": [
                "The 'Eid prayers are performed without Adhān, followed by the sermon (Khutbah), which is a key characteristic.",
                "The Imām does not replace the need for Adhān with the pre-prayer Khutbah, as the prayer itself is announced differently.",
                "The 'Eid sermon is delivered after the prayer, unlike the Jumu'ah sermon which precedes the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتماعیت کا سبق",
        "english": "Lesson of Collectiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کثیر بار عمل",
              "english": "Repeated Practice"
            },
            "content": {
              "urdu": [
                "جابر بن سمرہؓ کا یہ کہنا کہ 'ایک، دو مرتبہ نہیں، متعدد مرتبہ' یہ ظاہر کرتا ہے کہ یہ مستقل سنت ہے۔",
                "سنتِ نبوی ﷺ میں تسلسل عبادات کے طریقہ کار کو متعین کرنے کی ایک قوی دلیل ہے۔",
                "مسلمانوں کو عیدین کی نماز کا طریقہ کار نبی ﷺ کی سنت کے مطابق ہی ادا کرنا چاہیے۔"
              ],
              "english": [
                "Jābir ibn Samurah's phrase 'not just once or twice, but many times' indicates that this was a continuous Sunnah.",
                "The consistency in the Prophetic Sunnah is a strong proof for establishing the procedure of worship.",
                "Muslims must perform the 'Eid prayers according to the procedure established by the Prophet's (ﷺ) Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی اطلاع",
              "english": "Notification of Time"
            },
            "content": {
              "urdu": [
                "عید کی نماز کے لیے کوئی مخصوص اعلان نہ ہونے کی وجہ یہ ہے کہ یہ نماز دن کے وقت اور ایک مقررہ مقام پر ہوتی ہے۔",
                "نماز کے لیے لوگ خود ہی جمع ہو جاتے ہیں، اس لیے اذان کی ضرورت کم ہو جاتی ہے۔",
                "یہ حکم مسلمانوں میں وقت کے شعور اور اجتماعیت کے جذبے کو فروغ دیتا ہے۔"
              ],
              "english": [
                "The absence of a specific call for 'Eid prayer is due to it being performed during the day and at a fixed location.",
                "People naturally gather for the prayer, minimizing the need for an Adhān.",
                "This ruling promotes time awareness and a spirit of collectiveness among Muslims."
              ]
            }
          }
        ]
      }
    }
  ]
}
