{
  "hadithId": 69,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 8 (Chapter 6)"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب ما ينقض الوضوء من غير المخرجين",
    "babId": 6
  },

  "takhreej": {
    "arabic": "ضعيف.  رواه ابن ماجه (1221)  ",
    "urdu": "ضعیف (درجہ)۔ اسے ابن ماجہ (1221) نے روایت کیا ہے۔",
    "english": "Da'īf (Weak). Narrated by Ibn Mājah (1221)."
  },
  "importantWords": [
    {
      "arabic": "قَيْءٌ",
      "english": "Vomiting",
      "urdu": "قے"
    },
    {
      "arabic": "رُعَافٌ",
      "english": "Nosebleed",
      "urdu": "نکسیر پھوٹ پڑے"
    },
    {
      "arabic": "قَلَسٌ",
      "english": "Regurgitation/Belch",
      "urdu": "پیٹ کی چیز منہ سے باہر آ جائے"
    },
    {
      "arabic": "فَلْيَتَوَضَّأْ",
      "english": "Must perform Wudu",
      "urdu": "وضو کرنا چاہیئے"
    },
    {
      "arabic": "لِيَبْنِ عَلَى صَلَاتِهِ",
      "english": "May continue his prayer",
      "urdu": "نماز پر بنا کر لے"
    },
    {
      "arabic": "لَا يَتَكَلَّمُ",
      "english": "Does not speak",
      "urdu": "گفتگو نہ کی ہو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ان اخراجاتِ بدن (جیسے قے اور نکسیر) کا حکم بیان کرتی ہے جو شرمگاہ کے علاوہ دیگر راستوں سے خارج ہوتے ہیں، اور یہ بتاتی ہے کہ یہ نماز کو توڑ دیتے ہیں اور ان کے بعد وضو واجب ہے، ساتھ ہی 'بنا کرنے' (نماز وہیں سے جاری رکھنے) کی اجازت دیتی ہے، لیکن یہ روایت سند کے لحاظ سے کمزور ہے۔",
    "english": "This Hadith rules that bodily discharges from sources other than the usual exit routes (like vomiting and nosebleed) break Wudu and prayer, necessitating a new Wudu. It permits the continuation of the interrupted prayer (Binā'), provided no speech occurs, but this narration is deemed **weak** by Hadith scholars."
  },
  "references": [
    {
      "arabic": "سنن ابن ماجه، كتاب إقامة الصلاة، رقم 1221",
      "english": "Sunan Ibn Mājah, The Book of Establishing the Prayer, Hadith 1221"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَائِشَةُ بِنْتُ أَبِي بَكْرٍ رَضِيَ اَللَّهُ عَنْهَا",
        "english": "Aisha bint Abi Bakr (May Allah be pleased with her)"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-47-wudu-non-traditional-discharges",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'īf (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نواقض وضو میں اختلاف اور ضعفِ سند",
        "english": "Disagreement on Wudu Nullifiers and Weakness of Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرمگاہ کے علاوہ اخراجات",
              "english": "Discharges from Non-Traditional Exits"
            },
            "content": {
              "urdu": [
                "یہ حدیث چار چیزوں (قے، نکسیر، قلس، مذی) کو ناقضِ وضو قرار دیتی ہے، جن میں سے تین (قے، نکسیر، قلس) کا اخراج شرمگاہ کے علاوہ دیگر راستوں سے ہوتا ہے۔",
                "امام ابوحنیفہ ان چیزوں کو ناقضِ وضو قرار دیتے ہیں اگر یہ **کثرت** سے ہوں، جبکہ امام شافعی، مالک اور احمد ان کو ناقضِ وضو نہیں سمجھتے۔",
                "اس کی وجہ یہ ہے کہ یہ حدیث جو ان اخراجات کو ناقضِ وضو قرار دیتی ہے، محدثین کے نزدیک **ضعیف** ہے اور امام احمد نے خود اسے ضعیف کہا ہے۔"
              ],
              "english": [
                "This Hadith lists four nullifiers, three of which (vomiting, nosebleed, regurgitation) are discharges from openings other than the usual exit routes.",
                "The Ḥanafī school accepts these as Wudu nullifiers if they occur in a substantial amount, but the other three schools (Mālikī, Shāfiʿī, Ḥanbalī) generally reject this.",
                "The main reason for rejection by the majority is that this specific Hadith, which establishes these things as nullifiers, is considered **weak (Da'īf)** by leading scholars like Imam Ahmad."
              ]
            }
          },
          {
            "title": {
              "urdu": "مذی کا مسئلہ",
              "english": "The Issue of Madhī"
            },
            "content": {
              "urdu": [
                "مذی کا اخراج بلاشبہ ناقضِ وضو ہے، جیسا کہ صحیح اور قوی احادیث (حضرت علیؓ والی) سے ثابت ہے، اور یہ یہاں دیگر ضعیف احکام کے ساتھ بیان ہوئی ہے۔",
                "اس حدیث کا ضعف اس بات کو ظاہر کرتا ہے کہ وہ اعمال جن سے وضو ٹوٹتا ہے، وہ صرف وہی ہیں جو **صحیح اور قوی** احادیث سے ثابت ہیں۔",
                "لہٰذا، صحیح حکم یہ ہے کہ شرمگاہ کے علاوہ دیگر راستوں سے خارج ہونے والی چیزیں (جیسے قے) ناقضِ وضو نہیں ہیں (سوائے ریح اور حدث کے معروف اخراجات کے)۔"
              ],
              "english": [
                "The discharge of **Madhī** (pre-seminal fluid) is unquestionably a nullifier of Wudu, as proven by strong Ahadith (like the one from Ali, RA).",
                "The Hadith's weakness confirms that Wudu nullifiers must only be based on evidence established through **strong and authentic** narrations.",
                "Therefore, the most authentic ruling is that discharges from non-traditional routes (like blood or vomit) do not nullify Wudu (apart from the established exits of *Ḥadath*)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز پر بنا کرنے کا حکم (بناء)",
        "english": "The Ruling of Continuation (Binā')"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بناء کی اجازت",
              "english": "Permissibility of Binā'"
            },
            "content": {
              "urdu": [
                "حدیث کا یہ حصہ **\"ثُمَّ لِيَبْنِ عَلَى صَلَاتِهِ\"** (پھر اپنی نماز پر بنا کر لے) اس بات کی دلیل ہے کہ نماز کے دوران وضو ٹوٹنے پر وضو کر کے نماز وہیں سے جاری رکھی جا سکتی ہے۔",
                "یہ حکم اس وقت کی نمازوں کے لیے ایک **آسانی** تھی، لیکن اس حکم کو بھی محدثین نے ضعیف قرار دیا ہے اور جمہور فقہاء نے اسے متروک سمجھا ہے۔",
                "جمہور کے نزدیک، نماز کے دوران وضو ٹوٹ جائے تو پوری نماز کو **نئے سرے سے** (از سر نو) شروع کرنا فرض ہے۔"
              ],
              "english": [
                "The phrase **\"then he may continue his prayer\"** suggests that one could interrupt prayer to renew Wudu and then resume from where they stopped (*Binā'*).",
                "This ruling was initially an **ease (Rukhsah)** for prayers at the time, but major Hadith scholars weakened this narration, and most jurists abandoned the *Binā’* practice.",
                "The consensus of the majority is that if Wudu is broken during prayer, the entire prayer must be **re-commenced** (restarted from the beginning) after performing a new Wudu."
              ]
            }
          },
          {
            "title": {
              "urdu": "گفتگو نہ کرنے کی شرط",
              "english": "The Condition of Not Speaking"
            },
            "content": {
              "urdu": [
                "بنا کی اجازت کی شرط یہ تھی کہ وضو کے لیے جانے اور واپس آنے کے دوران کوئی **گفتگو نہ کی** جائے، جو نماز کے تقدس کو ظاہر کرتا ہے۔",
                "اگرچہ بنا کا حکم ضعیف ہے، لیکن یہ شرط اس بات کی دلیل ہے کہ وضو کو توڑ کر نماز کی حالت میں رہنا بہت حساس معاملہ ہے۔",
                "اگر یہ حکم صحیح ہوتا بھی تو گفتگو نماز کو باطل کرنے کا سبب بنتی، جس سے بنا کا فائدہ ختم ہو جاتا۔"
              ],
              "english": [
                "The condition that one **'does not speak'** during the time of performing Wudu highlights the sacredness and continuous nature of the state of prayer.",
                "Although the *Binā’* ruling is weak, this condition indicates the extreme sensitivity of temporarily leaving the prayer state due to ritual impurity.",
                "If this ruling were to be acted upon, speaking would still invalidate the prayer, thereby completely negating the permission for *Binā’*."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ضعیف احادیث پر موقف",
        "english": "Stance on Weak Ahadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام احمد کا ضعف",
              "english": "Imam Ahmad's Weakening"
            },
            "content": {
              "urdu": [
                "امام احمد بن حنبل اور دیگر محدثین کا اس حدیث کو **ضعیف** قرار دینا اس بات کی دلیل ہے کہ اس پر کسی شرعی حکم کی بنیاد نہیں رکھی جا سکتی۔",
                "ایک مسلمان کو چاہیے کہ وہ اپنی عبادات کو ہمیشہ ان احادیث کی روشنی میں ادا کرے جن کی صحت پر محدثین کا اتفاق ہو (جیسے بخاری و مسلم کی احادیث)۔",
                "عبادات کے ارکان اور ناقض وضو کے احکام کے لیے ضعیف روایت پر عمل کرنا درست نہیں ہے اور اس سے عبادت کے باطل ہونے کا خطرہ ہے۔"
              ],
              "english": [
                "The declaration of this Hadith as **'Weak (Da'īf)'** by leading scholars like Imam Ahmad proves that it cannot form the basis for establishing a Sharia ruling.",
                "A Muslim should always conduct their obligatory acts of worship based on Ahadith whose authenticity is confirmed and agreed upon by major scholars (like those in Bukhari and Muslim).",
                "It is incorrect to rely on a weak narration for the fundamental tenets and nullifiers of Wudu and prayer, as this poses a risk to the validity of the worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف کی حکمت",
              "english": "Wisdom of Fiqh Disagreement"
            },
            "content": {
              "urdu": [
                "اس حدیث پر فقہی اختلاف کی وجہ اس کی سند کی کمزوری ہے، جس سے ہر فقیہ نے اپنی ترجیحات کے مطابق حکم لیا۔",
                "حنیفہ کے نزدیک یہ حدیث ان کے اصول (غیر مخرجین سے نجاست کا خروج ناقض ہے) کی تائید کرتی ہے، جبکہ جمہور اس کے خلاف ہیں۔",
                "صحیح علم یہ ہے کہ وضو کے ناقض صرف وہی ہیں جو قوی احادیث (جیسے ریح، مذی، نیند) سے ثابت ہیں۔"
              ],
              "english": [
                "The jurisprudential disagreement regarding this Hadith is primarily a result of the weakness in its chain of narration (Isnād).",
                "The Ḥanafī school uses this Hadith to support its principle that major discharges from any part of the body nullify Wudu, while the majority rejects this derivation.",
                "The established and safer principle is that Wudu is only nullified by discharges or actions confirmed by strong, authentic Ahadith (like urine, feces, wind, or deep sleep)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور احتیاط کا پہلو",
        "english": "Narrator and Aspect of Precaution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدہ عائشہؓ کی روایت",
              "english": "The Narration of Aisha (RA)"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ رضی اللہ عنہا کا یہ روایت کرنا اس بات کو ظاہر کرتا ہے کہ یہ مسائل گھر کے اندر کے احوال سے متعلق ہیں اور ان کی اہمیت بہت زیادہ ہے۔",
                "تاہم، حدیث کے الفاظ کا نبی ﷺ سے یقینی طور پر ثابت نہ ہونا (ضعفِ سند) اس پر عمل کو لازم نہیں کرتا۔",
                "مسلمان کو چاہیے کہ وہ ہمیشہ ایسے معاملات میں احتیاط کرے اور وضو ٹوٹنے کے شک کی صورت میں بھی نیا وضو کر لے، تاکہ نماز صحیح ہو۔"
              ],
              "english": [
                "Aisha's (RA) narration suggests that these issues relate to private household matters and thus hold great significance for the community.",
                "However, the fact that the words of the Hadith are not definitively proven from the Prophet (ﷺ) (weakness of chain) does not necessitate acting upon it.",
                "A Muslim should always exercise caution in such matters and perform a new Wudu even in cases of doubt about its nullification, to ensure the prayer is sound."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی نتیجہ",
              "english": "Practical Conclusion"
            },
            "content": {
              "urdu": [
                "اگر نماز کے دوران وضو ٹوٹ جائے تو فوراً نماز کو توڑ کر باہر جانا اور نیا وضو کرنا ہی **صحیح اور محفوظ** عمل ہے۔",
                "نماز کو نئے سرے سے شروع کرنا ہی وضو ٹوٹنے کے بعد اصل حکم ہے، جو شکوک و شبہات سے پاک ہے۔",
                "اس سے مسلمان کی عبادت میں یکسوئی اور طہارت کی اہمیت برقرار رہتی ہے۔"
              ],
              "english": [
                "If Wudu is nullified during prayer, the **correct and safest** practical action is to immediately break the prayer, leave, and perform Wudu anew.",
                "Starting the prayer from the beginning after renewing Wudu is the established and clear ruling that is free from any scholarly ambiguity.",
                "This practice ensures the Muslim maintains concentration in their worship and upholds the fundamental importance of ritual purity in their worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
