{
  "hadithId": 957,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1098"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "حسن.‏ رواه أبو داود (2158)‏، والترمذي (1131)‏، وابن حبان (4830)‏. والحديث له شواهد تقويه، وقد صححه غير واحد من الحفاظ، والمراد بالماء هنا المني وبالزرع الحمل.",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابوداؤد (2158)، ترمذی (1131) اور ابن حبان (4830) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن کہا ہے۔ حدیث میں 'پانی' سے مراد نطفہ اور 'کھیتی' سے مراد حاملہ عورت کا رحم ہے۔",
    "english": "Hasan. Reported by Abu Dawud (2158), At-Tirmidhi (1131), and Ibn Hibban (4830). At-Tirmidhi graded it Hasan. In this context, 'water' refers to semen and 'crop' refers to the womb/pregnancy of a woman."
  },
  "importantWords": [
    {
      "arabic": "لَا يَحِلُّ",
      "english": "Not lawful",
      "urdu": "حلال نہیں"
    },
    {
      "arabic": "يَسْقِيَ",
      "english": "To irrigate / water",
      "urdu": "سیراب کرے"
    },
    {
      "arabic": "مَاءَهُ",
      "english": "His water",
      "urdu": "اپنا پانی (نطفہ)"
    },
    {
      "arabic": "زَرْعَ",
      "english": "Crop / Plantation",
      "urdu": "کھیتی (حمل)"
    },
    {
      "arabic": "غَيْرِهِ",
      "english": "Other than him",
      "urdu": "کسی دوسرے کی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں کسی دوسرے شخص کی حاملہ عورت (خواہ وہ لونڈی ہو یا طلاق یافتہ) سے عدت کے دوران جماع کرنے کی سختی سے ممانعت کی گئی ہے تاکہ نسب میں اختلاط نہ ہو۔",
    "english": "This Hadith strictly prohibits having intercourse with a woman who is pregnant from another man (whether a captive or in Iddah) to prevent the confusion of lineage."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2158)",
      "english": "Sunan Abu Dawud (2158)"
    },
    {
      "arabic": "جامع الترمذي (1131)",
      "english": "Jami' at-Tirmidhi (1131)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رويفع بن ثابت الأنصاري",
        "english": "Ruwaifi' bin Thabit al-Ansari"
      },
      "slug": "ruwaifi-bin-thabit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نسب کی حفاظت",
        "english": "Protection of Lineage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اختلاطِ نسب کی ممانعت",
              "english": "Prohibition of Mixed Lineage"
            },
            "content": {
              "urdu": [
                "اسلام میں نسب کی حفاظت بنیادی مقاصد میں سے ایک ہے۔",
                "کسی حاملہ سے جماع کرنا دوسرے کے بچے کو اپنے نطفے سے غذا دینے کے مترادف ہے۔",
                "اس عمل سے بچے کے نسب میں شک پیدا ہوتا ہے جو کہ شرعی جرم ہے۔"
              ],
              "english": [
                "Preserving lineage is one of the fundamental objectives of Islam.",
                "Intercourse with a pregnant woman is like feeding another's child with one's semen.",
                "This act creates doubt in the child's lineage, which is a Shariah violation."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان کی علامت",
              "english": "A Sign of Faith"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس حکم کو اللہ اور آخرت پر ایمان سے جوڑا ہے۔",
                "یہ ظاہر کرتا ہے کہ نسب کا تحفظ محض قانونی نہیں بلکہ ایمانی مسئلہ ہے۔",
                "ایک مومن کبھی دوسروں کے حقوق اور پاکیزگی میں مداخلت نہیں کرتا۔"
              ],
              "english": [
                "The Prophet (ﷺ) linked this ruling to belief in Allah and the Last Day.",
                "This shows that protecting lineage is a matter of faith, not just law.",
                "A believer never interferes with the rights and purity of others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استبراءِ رحم کی اہمیت",
        "english": "Importance of Istibra (Clearing the Womb)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدت اور استبراء",
              "english": "Iddah and Istibra"
            },
            "content": {
              "urdu": [
                "جب کوئی عورت کسی نئے نکاح میں آئے تو رحم کا خالی ہونا ضروری ہے۔",
                "حاملہ عورت کے لیے وضع حمل تک نکاح اور قربت کی ممانعت اسی لیے ہے۔",
                "یہ قاعدہ جنگی قیدی خواتین (لونڈیوں) کے معاملے میں بھی لاگو ہوتا ہے۔"
              ],
              "english": [
                "When a woman enters a new marriage, it is essential that her womb is clear.",
                "The prohibition of marriage and intimacy with a pregnant woman lasts until delivery.",
                "This rule also strictly applies to female captives (concubines) taken in war."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھیتی اور پانی کی تمثیل",
              "english": "Metaphor of Crop and Water"
            },
            "content": {
              "urdu": [
                "حدیث میں 'پانی' نطفہ اور 'کھیتی' حاملہ عورت کے رحم کے لیے استعارہ ہے۔",
                "جس طرح غیر کی کھیتی میں پانی دینا بیج ضائع کرنا ہے، ویسے ہی یہ عمل ہے۔",
                "یہ خوبصورت تمثیل انسانی عقل کو اس گناہ کی سنگینی سمجھانے کے لیے دی گئی۔"
              ],
              "english": [
                "In the Hadith, 'water' is a metaphor for semen and 'crop' for the womb.",
                "Just as watering another's crop is wasting resources, so is this act.",
                "This beautiful metaphor is given to help human reason grasp the sin's gravity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاملہ سے نکاح کا حکم",
              "english": "Ruling on Marrying a Pregnant Woman"
            },
            "content": {
              "urdu": [
                "اگر حمل کسی دوسرے شوہر سے ہو تو وضع حمل تک نکاح جائز نہیں۔",
                "ایسی صورت میں نکاح منعقد ہی نہیں ہوتا اور جماع سخت حرام ہے۔",
                "تمام ائمہ فقہ اس حدیث کی بنیاد پر اس مسئلے پر متفق ہیں۔"
              ],
              "english": [
                "If the pregnancy is from another husband, marriage is invalid until delivery.",
                "In such a case, the marriage contract does not even hold, and intimacy is forbidden.",
                "All Imams of jurisprudence agree on this issue based on this Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "لونڈیوں کے احکام",
              "english": "Rulings on Slave Women"
            },
            "content": {
              "urdu": [
                "اوطاس کے قیدیوں کے بارے میں بھی آپ ﷺ نے یہی اصول بیان فرمایا تھا۔",
                "حاملہ لونڈی سے وضع حمل سے پہلے اور غیر حاملہ سے ایک حیض تک رکنا لازم ہے۔",
                "یہ حکم اس لیے ہے تاکہ معلوم ہو سکے کہ رحم میں پہلے سے بچہ تو نہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) stated this same principle regarding the captives of Autas.",
                "One must wait until delivery for a pregnant captive and one menses for others.",
                "This is to ascertain whether the womb already contains a child."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و معاشرتی حکمت",
        "english": "Ethical and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے کے حقوق کا تحفظ",
              "english": "Protecting the Child's Rights"
            },
            "content": {
              "urdu": [
                "بچے کا حق ہے کہ اس کا نسب واضح ہو اور اسے اپنے اصل باپ کی پہچان ہو۔",
                "اختلاطِ نسب سے وراثت اور نکاح کے شرعی مسائل پیدا ہو سکتے ہیں۔",
                "اسلام ہر بچے کو ایک معتبر سماجی شناخت فراہم کرنے کی ضمانت دیتا ہے۔"
              ],
              "english": [
                "A child has the right to a clear lineage and knowledge of their biological father.",
                "Confusion of lineage can lead to complex issues in inheritance and marriage laws.",
                "Islam guarantees every child a dignified and verified social identity."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی پابندی",
              "english": "Adherence to Discipline"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسلمانوں کو اپنی خواہشات پر شرعی پابندی لگانا سکھاتی ہے۔",
                "معاشرتی پاکیزگی کے لیے ان حدود کا احترام ہر مسلمان پر لازم ہے۔",
                "سنتِ نبوی کی پیروی ہی خاندانی سکون اور معاشرتی استحکام کی بنیاد ہے۔"
              ],
              "english": [
                "This Hadith teaches Muslims to place Shariah limits on their desires.",
                "Respecting these boundaries is mandatory for maintaining social purity.",
                "Following the Prophetic Sunnah is the basis for family peace and social stability."
              ]
            }
          }
        ]
      }
    }
  ]
}