{
  "hadithId": 1204,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/17"],
    "kitabId": 14,
    "inKitabBab": 2,
    "arabicBook": "كتاب القضاء",
    "babId": 98
  },
  
  "takhreej": {
    "arabic": " صحيح. رواه أبو داود (3602)، وابن ماجه (2367)، والحاكم (4/95) وصححه.",
    "urdu": "صحیح۔ اسے ابوداؤد (3602) اور ابن ماجہ (2367) نے روایت کیا ہے، اور امام حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3602) and Ibn Majah (2367). Al-Hakim also graded it authentic."
  },
  "importantWords": [
    {
      "arabic": "لَا تَجُوزُ",
      "english": "Not permissible",
      "urdu": "جائز نہیں / قابل قبول نہیں"
    },
    {
      "arabic": "شَهَادَةُ",
      "english": "Testimony",
      "urdu": "گواہی"
    },
    {
      "arabic": "بَدَوِيٍّ",
      "english": "Bedouin / Nomad",
      "urdu": "بدو / دیہاتی"
    },
    {
      "arabic": "صَاحِبِ قَرْيَةٍ",
      "english": "Town dweller",
      "urdu": "شہری / بستی والا"
    },
    {
      "arabic": "تُقْبَلُ",
      "english": "Accepted",
      "urdu": "قبول کی جاتی ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بدو کی شہری کے خلاف گواہی کی ممانعت بیان کی گئی ہے، جس کی وجہ بدوی زندگی میں حقائق سے دوری اور شہری معاملات سے ناواقفیت ہو سکتی ہے۔",
    "english": "This Hadith mentions the restriction on a bedouin's testimony against a town dweller, likely due to differences in lifestyle and unfamiliarity with urban social complexities."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الأقضية، رقم 3602",
      "english": "Sunan Abi Dawud, Book of Judicial Decisions, No. 3602"
    },
    {
      "arabic": "سنن ابن ماجه، كتاب الأحكام، رقم 2367",
      "english": "Sunan Ibn Majah, Book of Judgments, No. 2367"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی قانونی حکمت",
        "english": "Legal Wisdom of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاملات سے ناواقفیت",
              "english": "Unfamiliarity with Urban Affairs"
            },
            "content": {
              "urdu": [
                "بدو لوگ عام طور پر شہری زندگی کے پیچیدہ معاملات اور باریکیوں سے ناواقف ہوتے ہیں۔",
                "ناواقفیت کی بنا پر ان کی گواہی میں غلطی کا امکان زیادہ ہوتا ہے۔",
                "اسلامی قانون میں گواہی کے لیے معاملے کی مکمل سمجھ بوجھ لازمی قرار دی گئی ہے۔"
              ],
              "english": [
                "Bedouins are generally unfamiliar with the complex affairs and nuances of urban life.",
                "Due to this lack of knowledge, there is a higher chance of error in their testimony.",
                "Islamic law requires a complete understanding of the matter for testimony to be valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کی حفاظت",
              "english": "Safeguarding Justice"
            },
            "content": {
              "urdu": [
                "اس ممانعت کا مقصد کسی کی توہین نہیں بلکہ انصاف کے معیار کو برقرار رکھنا ہے۔",
                "گواہی میں معمولی شک بھی فیصلے کو متاثر کر سکتا ہے، اس لیے احتیاط برتی گئی۔",
                "شہری معاملات میں شہری کی گواہی کو زیادہ معتبر سمجھا گیا ہے کیونکہ وہ حالات سے باخبر ہوتا ہے۔"
              ],
              "english": [
                "The purpose of this restriction is not to insult anyone but to maintain the standard of justice.",
                "Even a slight doubt in testimony can affect a verdict, hence the precaution.",
                "A city dweller's testimony is more credible in urban matters due to their situational awareness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Views of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Position of the Majority of Jurists"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک اگر بدو عادل اور سچا ہو تو اس کی گواہی قبول کی جائے گی۔",
                "اس حدیث کو ان حالات پر محمول کیا گیا ہے جہاں بدو معاملے کو صحیح سمجھ نہ سکا ہو۔",
                "اگر بدو کی عدالت (کردار) ثابت ہو، تو وہ گواہی دے سکتا ہے۔"
              ],
              "english": [
                "Most jurists believe if a bedouin is upright and truthful, his testimony should be accepted.",
                "This Hadith is applied to situations where the bedouin fails to grasp the matter correctly.",
                "If the bedouin's integrity ('Adalah) is proven, he is eligible to testify."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرائطِ شہادت",
              "english": "Conditions of Testimony"
            },
            "content": {
              "urdu": [
                "اسلام میں گواہ کے لیے مسلمان، عاقل، بالغ اور عادل ہونا شرط ہے۔",
                "بدوؤں میں جاہلیت کے اثرات یا عصبیت کا خطرہ ہو سکتا ہے، اس لیے جانچ ضروری ہے۔",
                "قاضی کو چاہیے کہ وہ گواہ کے پس منظر اور بصیرت کو مدنظر رکھ کر فیصلہ کرے۔"
              ],
              "english": [
                "In Islam, a witness must be Muslim, sane, adult, and of upright character.",
                "There might be risks of residual ignorance or tribalism among bedouins, requiring vetting.",
                "The judge must decide by considering the witness's background and insight."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی و ثقافتی پس منظر",
        "english": "Socio-Cultural Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدو اور شہری تفاوت",
              "english": "Bedouin and Urban Disparity"
            },
            "content": {
              "urdu": [
                "قدیم دور میں بدوؤں کی زندگی سادہ اور بسا اوقات قانون سے دور ہوتی تھی۔",
                "شہریوں کے لین دین کے طریقے بدوؤں کے لیے اجنبی ہو سکتے تھے۔",
                "یہ تفاوت غلط فہمی پیدا کرنے کا باعث بن سکتا تھا، جس سے حدیث نے روکا۔"
              ],
              "english": [
                "In ancient times, bedouin life was simple and sometimes far from formal legal structures.",
                "Urban transactional methods could be alien to nomads.",
                "This disparity could lead to misunderstandings, which the Hadith seeks to prevent."
              ]
            }
          },
          {
            "title": {
              "urdu": "عصبیت کا اندیشہ",
              "english": "Concern of Partisanship"
            },
            "content": {
              "urdu": [
                "بدو قبائلی عصبیت میں شدت پسند ہو سکتے تھے، جو گواہی پر اثر انداز ہو سکتی ہے۔",
                "شہری معاشرت میں انفرادی ذمہ داری کا تصور زیادہ واضح ہوتا ہے۔",
                "عدل کے لیے ضروری ہے کہ گواہ ہر قسم کے تعصب سے پاک ہو۔"
              ],
              "english": [
                "Bedouins could be extreme in tribal partisanship, affecting their testimony.",
                "In urban society, the concept of individual responsibility is more distinct.",
                "For justice, it is essential that the witness remains free from all types of prejudice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عصری تطبیق",
        "english": "Contemporary Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماہرانہ گواہی کا اصول",
              "english": "Principle of Expert Testimony"
            },
            "content": {
              "urdu": [
                "جدید دور میں اس سے یہ اصول ملتا ہے کہ تکنیکی معاملات میں غیر متعلقہ شخص کی گواہی وزن نہیں رکھتی۔",
                "جسے معاملے کی فنی معلومات نہ ہوں، اس کی گواہی مشکوک ہو سکتی ہے۔",
                "انصاف کا تقاضا ہے کہ گواہ وہی ہو جو وقوعہ کو اس کی اصل روح کے ساتھ سمجھتا ہو۔"
              ],
              "english": [
                "In the modern era, this implies that an irrelevant person's testimony lacks weight in technical matters.",
                "The testimony of someone lacking technical knowledge of an affair can be suspicious.",
                "Justice demands that the witness be someone who understands the incident in its true spirit."
              ]
            }
          },
          {
            "title": {
              "urdu": "انصاف میں بصیرت",
              "english": "Insight in Justice"
            },
            "content": {
              "urdu": [
                "محض الفاظ کی گواہی کافی نہیں بلکہ گواہ کی ذہنی سطح کو دیکھنا بھی ضروری ہے۔",
                "حاکم کو چاہیے کہ وہ گواہی قبول کرنے سے پہلے گواہ کے حالات کی تحقیق کرے۔",
                "یہ حدیث عدالتی نظام میں باریک بینی اور چھان بین کی تعلیم دیتی ہے۔"
              ],
              "english": [
                "Mere verbal testimony is not enough; assessing the witness's mental level is also necessary.",
                "The authority must investigate the witness's circumstances before accepting the testimony.",
                "This Hadith teaches meticulousness and scrutiny within the judicial system."
              ]
            }
          }
        ]
      }
    }
  ]
}