{
  "hadithId": 969,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1114"],
    "kitabId": 8,
    "inKitabBab": 13,
    "arabicBook": "كتاب الرضاع",
    "babId": 76
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2645)، ومسلم (1446). وأصل القصة أن علياً أو غيره عرض على النبي ﷺ ابنة حمزة، فبين النبي ﷺ الحرمة بسبب الرضاع من ثويبة مولاة أبي لهب.",
    "urdu": "صحیح۔ اسے امام بخاری (2645) اور امام مسلم (1446) نے روایت کیا ہے۔ اس واقعے کا پس منظر یہ ہے کہ صحابہ نے آپ ﷺ کو حضرت حمزہ کی بیٹی سے نکاح کا مشورہ دیا، جس پر آپ ﷺ نے بتایا کہ حضرت حمزہ اور آپ ﷺ دونوں نے ثویبہ کا دودھ پیا تھا، اس لیے وہ آپ کے رضاعی بھائی ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (2645) and Muslim (1446). The context is that the Companions suggested the Prophet (ﷺ) marry Hamza's daughter, but he clarified that Hamza was his foster brother because both were suckled by Thuwaybah."
  },
  "importantWords": [
    {
      "arabic": "أُرِيدُ عَلَى",
      "english": "Was offered / Proposed to",
      "urdu": "پیشکش کی گئی / ارادہ کیا گیا"
    },
    {
      "arabic": "لَا تَحِلُّ",
      "english": "Not lawful",
      "urdu": "حلال نہیں"
    },
    {
      "arabic": "اِبْنَةُ أَخِي",
      "english": "Niece (Brother's daughter)",
      "urdu": "بھتیجی"
    },
    {
      "arabic": "اَلرَّضَاعَةِ",
      "english": "Fosterage / Breastfeeding",
      "urdu": "دودھ پینا / رضاعت"
    },
    {
      "arabic": "اَلنَّسَبِ",
      "english": "Lineage / Blood relation",
      "urdu": "خونی رشتہ / نسب"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث رضاعی حرمت کا ایک بڑا قاعدہ بیان کرتی ہے کہ جو رشتے خون کے تعلق سے حرام ہیں (جیسے بہن، بھتیجی، پھوپھی وغیرہ) وہی رشتے دودھ کے تعلق (رضاعت) سے بھی ہمیشہ کے لیے حرام ہو جاتے ہیں۔",
    "english": "This Hadith establishes a major rule in Islamic law: all relationships prohibited by blood (such as sisters, nieces, aunts) are also prohibited through fosterage (breastfeeding)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2645)",
      "english": "Sahih al-Bukhari (2645)"
    },
    {
      "arabic": "صحيح مسلم (1446)",
      "english": "Sahih Muslim (1446)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_vW0BTo",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رضاعی حرمت کا سنہری قاعدہ",
        "english": "The Golden Rule of Fosterage Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاعدہ کلیہ",
              "english": "The General Principle"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا یہ جملہ 'رضاعت سے وہی حرام ہوتا ہے جو نسب سے حرام ہوتا ہے' ایک اصولی ضابطہ ہے۔",
                "اس کا مطلب ہے کہ اگر ایک بچہ کسی عورت کا دودھ پی لے، تو وہ عورت اس کی حقیقی ماں کے حکم میں آجاتی ہے۔",
                "اب اس عورت کے تمام رشتہ دار اس بچے کے لیے ویسے ہی محرم بن جائیں گے جیسے اس کے اپنے خاندان کے ہوتے ہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) statement is a comprehensive legal maxim in Islamic jurisprudence.",
                "It implies that when a woman breastfeeds a child, she takes the legal status of a biological mother.",
                "Consequently, her relatives become Mahrams to the child just as blood relatives are."
              ]
            }
          },
          {
            "title": {
              "urdu": "حضرت حمزہ سے رضاعی تعلق",
              "english": "Foster Relation with Hamza (RA)"
            },
            "content": {
              "urdu": [
                "حضرت حمزہ رضی اللہ عنہ نبی ﷺ کے سگے چچا تھے، لیکن ان کے ساتھ آپ ﷺ کا رضاعی بھائی کا رشتہ بھی تھا۔",
                "نبی ﷺ اور حضرت حمزہ دونوں کو ابولہب کی لونڈی ثویبہ نے دودھ پلایا تھا۔",
                "چونکہ حضرت حمزہ رضاعی بھائی تھے، اس لیے ان کی بیٹی نبی ﷺ کی رضاعی بھتیجی قرار پائی۔"
              ],
              "english": [
                "Hamza (RA) was the Prophet's (ﷺ) biological uncle, but they were also foster brothers.",
                "Both the Prophet (ﷺ) and Hamza were suckled by Thuwaybah, the freed slave of Abu Lahab.",
                "Because Hamza was a foster brother, his daughter was the Prophet's foster niece, making marriage forbidden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حرام رشتوں کی تفصیل",
        "english": "Detail of Prohibited Relations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نسبی اور رضاعی مشابہت",
              "english": "Lineal and Foster Similarity"
            },
            "content": {
              "urdu": [
                "قرآن مجید (سورہ نساء) میں سات نسبی رشتوں کو حرام قرار دیا گیا ہے، رضاعت ان سب پر لاگو ہوتی ہے۔",
                "رضاعی ماں، رضاعی بہن، رضاعی بھتیجی، رضاعی بھانجی، رضاعی خالہ اور رضاعی پھوپھی سب سے نکاح حرام ہے۔",
                "یہ احکامات خاندانی پاکیزگی اور معاشرتی ڈھانچے کو مضبوط بنانے کے لیے ہیں۔"
              ],
              "english": [
                "The Quran (Surah An-Nisa) lists seven prohibited blood relations; fosterage applies to all of them.",
                "Marriage is forbidden with a foster mother, sister, niece, maternal aunt, and paternal aunt.",
                "These rulings are designed to preserve family purity and strengthen social structures."
              ]
            }
          },
          {
            "title": {
              "urdu": "سسرالی رشتوں پر اطلاق",
              "english": "Application to In-laws"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک رضاعت کا اثر سسرالی رشتوں (مصاہرت) پر بھی پڑتا ہے۔",
                "مثلاً رضاعی ماں کی ماں (رضاعی نانی) یا رضاعی بیٹی سے نکاح ویسے ہی حرام ہے جیسے نسبی طور پر۔",
                "اس وسعت کا مقصد رضاعی رشتے کو حقیقی رشتے جیسا احترام فراہم کرنا ہے۔"
              ],
              "english": [
                "Most scholars agree that fosterage also affects marital prohibitions (Musaharah).",
                "For example, a foster mother's mother or a foster daughter is forbidden just like blood relations.",
                "The goal is to provide the foster bond with the same level of sanctity as biological ones."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سماجی حکمت",
        "english": "Juristic and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دودھ کا اثر",
              "english": "Effect of Milk"
            },
            "content": {
              "urdu": [
                "اسلام اس بات کو تسلیم کرتا ہے کہ دودھ پینے سے بچے کے جسم میں اس عورت کے اثرات منتقل ہوتے ہیں۔",
                "بچہ اس عورت کے خون اور گوشت کا حصہ بن جاتا ہے، اس لیے اسے 'رضاعی اولاد' مانا گیا ہے۔",
                "یہ سائنسی اور حیاتیاتی طور پر بھی ایک گہرا تعلق ظاہر کرتا ہے۔"
              ],
              "english": [
                "Islam recognizes that suckling transfers biological characteristics of the woman to the child.",
                "The child becomes part of the woman's flesh and blood, hence labeled as 'foster offspring'.",
                "This indicates a deep biological connection recognized by Shariah."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی ہم آہنگی",
              "english": "Social Harmony"
            },
            "content": {
              "urdu": [
                "رضاعت کے قوانین مختلف خاندانوں کو ایک دوسرے کے قریب لاتے ہیں اور ان میں محرمیت پیدا کرتے ہیں۔",
                "اس سے معاشرے میں ایک دوسرے کے لیے ہمدردی اور تحفظ کا احساس پیدا ہوتا ہے۔",
                "لوگوں کو چاہیے کہ وہ اپنے بچوں کے رضاعی رشتوں کا ریکارڈ رکھیں تاکہ حرمت پامال نہ ہو۔"
              ],
              "english": [
                "Fosterage laws bring different families closer and create Mahram status between them.",
                "This fosters compassion and a sense of security within the community.",
                "It is crucial for people to keep records of foster relations to avoid violating sacred boundaries."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احتیاط کی ضرورت",
              "english": "Need for Caution"
            },
            "content": {
              "urdu": [
                "نکاح سے پہلے ہمیشہ اس بات کی تحقیق کرنی چاہیے کہ کہیں فریقین کے درمیان رضاعی رشتہ تو نہیں۔",
                "نادانی میں کیا گیا ایسا نکاح باطل ہوتا ہے اور اسے ختم کرنا لازمی ہو جاتا ہے۔",
                "مساجد اور سماجی حلقوں میں ان احکام کی آگاہی عام ہونی چاہیے۔"
              ],
              "english": [
                "Before marriage, it is essential to verify if any foster relation exists between the parties.",
                "A marriage contracted in ignorance of such a bond is void and must be annulled.",
                "Awareness of these rulings should be spread within mosques and social circles."
              ]
            }
          },
          {
            "title": {
              "urdu": "اطاعتِ رسول ﷺ",
              "english": "Obedience to the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ایک خوبصورت پیشکش (اپنے چچا کی بیٹی) کو صرف شرعی حکم کی بنیاد پر ٹھکرا دیا۔",
                "ایک مومن کے لیے اپنی خواہشات سے بڑھ کر اللہ کی حدود کی اہمیت ہونی چاہیے۔",
                "حقوق اور فرائض کے معاملے میں سنتِ نبوی ہی ہمارا آخری معیار ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) declined an excellent proposal based solely on Shariah limits.",
                "For a believer, Allah's boundaries must take precedence over personal desires.",
                "The Prophetic Sunnah is the ultimate standard for rights and obligations."
              ]
            }
          }
        ]
      }
    }
  ]
}