{
  "hadithId": 977,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/977"],
    "kitabId": 8,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 77
  },
 
  "takhreej": {
    "arabic": "حسن.‏ رواه مسلم (1662)‏ ورجاله كلهم ثقات إلا العجلان مولى فاطمة فإنه حسن الحديث.‏ وزاد ابن حبان: \"فإن كلفتموهم فأعينوهم\".",
    "urdu": "یہ روایت صحیح و حسن ہے۔ امام مسلم (1662) نے اسے روایت کیا ہے۔ اس کے تمام راوی ثقہ ہیں سوائے عجلان کے جو حسن الحدیث ہیں۔ ابن حبان کی روایت میں یہ اضافہ بھی ہے کہ اگر تم ان پر بوجھ ڈالو تو ان کی مدد کرو۔",
    "english": "Hasan (Good). Reported by Muslim (1662). All its narrators are reliable except for 'Ajlan, who is Hasan in Hadith. Ibn Hibban added: 'If you burden them (with work), then assist them.'"
  },
  "importantWords": [
    {
      "arabic": "لِلْمَمْلُوكِ",
      "english": "For the slave / servant",
      "urdu": "غلام کے لیے"
    },
    {
      "arabic": "طَعَامُهُ",
      "english": "His food",
      "urdu": "اس کا کھانا"
    },
    {
      "arabic": "كِسْوَتُهُ",
      "english": "His clothing",
      "urdu": "اس کا لباس"
    },
    {
      "arabic": "يُكَلَّفُ",
      "english": "Be burdened / tasked",
      "urdu": "تکلیف دی جائے / مکلف کیا جائے"
    },
    {
      "arabic": "يُطِيقُ",
      "english": "He can bear / sustain",
      "urdu": "وہ طاقت رکھتا ہو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ماتحتوں اور غلاموں کے حقوق بیان کیے گئے ہیں کہ مالک پر ان کی خوراک اور لباس کی فراہمی واجب ہے اور ان پر طاقت سے زیادہ بوجھ ڈالنا منع ہے۔",
    "english": "This Hadith outlines the rights of subordinates and slaves, making food and clothing a duty upon the master and forbidding excessive workloads."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1662)",
      "english": "Reported by Muslim (1662)"
    },
    {
      "arabic": "صحيح ابن حبان (4312)",
      "english": "Sahih Ibn Hibban (4312)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3XG_vT_9Yw",
  "grade": {
    "arabic": "صحيح / حسن",
    "english": "Sahih / Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ماتحتوں کے بنیادی حقوق",
        "english": "Basic Rights of Subordinates"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوراک اور لباس کی فراہمی",
              "english": "Provision of Food and Clothing"
            },
            "content": {
              "urdu": [
                "مالک پر لازم ہے کہ وہ اپنے غلام یا خادم کی بنیادی ضروریات کا خیال رکھے۔",
                "کھانا اور کپڑا فراہم کرنا احسان نہیں بلکہ شرعی طور پر واجب حق ہے۔",
                "اس میں معیار وہی ہونا چاہیے جو عرف عام میں مناسب سمجھا جاتا ہو۔"
              ],
              "english": [
                "The employer or master must ensure the basic needs of their servant or slave.",
                "Providing food and clothing is a Sharia-mandated right, not a mere favor.",
                "The standard should be what is considered reasonable and customary in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانیت کا احترام",
              "english": "Respect for Humanity"
            },
            "content": {
              "urdu": [
                "اسلام غلامی کے دور میں بھی انسان کے وقار کو برقرار رکھنے کی تعلیم دیتا ہے۔",
                "خادموں کو محض مشین نہیں بلکہ گوشت پوست کا انسان سمجھا جانا چاہیے۔",
                "ان کی ضروریات کی تکمیل معاشرتی عدل و انصاف کا حصہ ہے۔"
              ],
              "english": [
                "Islam teaches the preservation of human dignity even in the context of slavery.",
                "Servants should be treated as human beings, not merely as tools or machines.",
                "Fulfilling their needs is an essential component of social justice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کام کی حد اور طاقت",
        "english": "Workload and Capability"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طاقت سے زیادہ بوجھ کی ممانعت",
              "english": "Prohibition of Excessive Work"
            },
            "content": {
              "urdu": [
                "ماتحتوں پر اتنا ہی کام ڈالنا چاہیے جتنا وہ آسانی سے برداشت کر سکیں۔",
                "مسلسل کام لینا یا آرام کا موقع نہ دینا غیر اسلامی رویہ ہے۔",
                "طاقت سے زیادہ کام لینا ظلم کے زمرے میں آتا ہے جس کا حساب دینا ہوگا۔"
              ],
              "english": [
                "Only as much work as can be reasonably borne should be assigned to subordinates.",
                "Assigning continuous labor without rest is an un-Islamic practice.",
                "Tasking someone beyond their capacity is an act of oppression that carries accountability."
              ]
            }
          },
          {
            "title": {
              "urdu": "مدد اور تعاون کا حکم",
              "english": "Command for Assistance"
            },
            "content": {
              "urdu": [
                "اگر کام زیادہ ہو تو مالک کو چاہیے کہ وہ خود خادم کی مدد کرے۔",
                "تعاون کی یہ روح معاشرے میں محبت اور ہمدردی پیدا کرتی ہے۔",
                "یہ حکم ماتحتوں کے ساتھ نرمی اور حسنِ سلوک کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "If the workload is heavy, the employer should personally assist the servant.",
                "This spirit of cooperation fosters love and empathy within the community.",
                "This instruction encourages kindness and good treatment toward subordinates."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور میں اطلاق",
        "english": "Application in the Modern Era"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملازمین کے حقوق",
              "english": "Rights of Employees"
            },
            "content": {
              "urdu": [
                "آج کے دور میں یہ حدیث گھریلو ملازمین اور فیکٹری ورکرز پر لاگو ہوتی ہے۔",
                "ملازم کی تنخواہ ایسی ہونی چاہیے کہ وہ اپنی خوراک اور لباس پوری کر سکے۔",
                "کام کے اوقات کار (Working Hours) کا تعین اسی شرعی اصول پر ہونا چاہیے۔"
              ],
              "english": [
                "In modern times, this Hadith applies to domestic workers and factory laborers.",
                "An employee's wage should be sufficient to cover their food and clothing.",
                "The determination of working hours should follow this Sharia principle."
              ]
            }
          },
          {
            "title": {
              "urdu": "استحصال کا خاتمہ",
              "english": "Elimination of Exploitation"
            },
            "content": {
              "urdu": [
                "اسلام ہر قسم کے معاشی اور جسمانی استحصال کی نفی کرتا ہے۔",
                "مزدوروں کے حقوق کی پاسداری کرنا دینداری کا لازمی تقاضا ہے۔",
                "یہ حدیث ایک مثالی لیبر قانون (Labor Law) کی بنیاد فراہم کرتی ہے۔"
              ],
              "english": [
                "Islam rejects every form of economic and physical exploitation.",
                "Upholding the rights of workers is an essential requirement of faith.",
                "This Hadith provides the foundation for an ideal system of labor laws."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برابری اور اخوت",
              "english": "Equality and Brotherhood"
            },
            "content": {
              "urdu": [
                "ماتحت بھی ہمارے بھائی ہیں، اللہ نے ہمیں ان پر فوقیت دی ہے۔",
                "ان کے ساتھ وہی رویہ رکھیں جو آپ اپنے لیے پسند کرتے ہیں۔",
                "خادموں کے ساتھ نرمی برتنا اللہ کی رضا کا باعث بنتا ہے۔"
              ],
              "english": [
                "Subordinates are our brothers; Allah has merely given us authority over them.",
                "Treat them in the same manner that you would like to be treated yourself.",
                "Showing leniency toward servants leads to the pleasure of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جوابدہی کا احساس",
              "english": "Sense of Accountability"
            },
            "content": {
              "urdu": [
                "قیامت کے دن ہر صاحبِ اختیار سے اس کے ماتحتوں کے بارے میں پوچھا جائے گا۔",
                "ظلم اور زیادتی نیکیوں کو برباد کر دینے والے اعمال ہیں۔",
                "عدل و انصاف کا دامن ہاتھ سے چھوڑنا دنیا و آخرت میں خسارے کا سبب ہے۔"
              ],
              "english": [
                "On the Day of Judgment, every person in authority will be questioned about their subordinates.",
                "Oppression and transgression are deeds that destroy one's good virtues.",
                "Abandoning justice and equity leads to loss in this world and the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}