{
  "hadithId": 597,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/597"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 39
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1539)، ومسلم (1189). وفي رواية أخرى لمسلم: 'بأطيب ما أجد'.",
    "urdu": "صحیح۔ اسے بخاری (1539) اور مسلم (1189) نے روایت کیا ہے۔ اس میں احرام کی ابتدا اور انتہا پر خوشبو کے استعمال کا ذکر ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1539) and Muslim (1189). Another narration in Muslim specifies she used the 'best perfume' she could find."
  },
  "importantWords": [
    {
      "arabic": "أُطَيِّبُ",
      "english": "Apply perfume",
      "urdu": "خوشبو لگانا"
    },
    {
      "arabic": "لِإِحْرَامِهِ",
      "english": "For his Ihram",
      "urdu": "احرام کے لیے"
    },
    {
      "arabic": "لِحِلِّهِ",
      "english": "For his exiting Ihram",
      "urdu": "حلال ہونے پر / احرام کھولنے پر"
    },
    {
      "arabic": "يَطُوفَ",
      "english": "To perform Tawaf",
      "urdu": "طواف کرنا"
    },
    {
      "arabic": "بِالْبَيْتِ",
      "english": "The House (Ka'bah)",
      "urdu": "بیت اللہ / کعبہ"
    }
  ],
  "summary": {
    "urdu": "احرام باندھنے کی نیت سے پہلے بدن پر خوشبو لگانا اور احرام کی پابندیاں ختم ہونے (پہلے حلال) کے بعد طوافِ افاضہ سے پہلے خوشبو لگانا سنت ہے۔",
    "english": "It is Sunnah to apply perfume to the body before entering the state of Ihram and again after the first partial exit (Tahallul) from Ihram but before Tawaf al-Ifadah."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1539)",
      "english": "Reported by Al-Bukhari (1539)"
    },
    {
      "arabic": "رواه مسلم (1189)",
      "english": "Reported by Muslim (1189)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احرام سے پہلے خوشبو کا حکم",
        "english": "Applying Perfume Before Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ نبوی اور طریقہ کار",
              "english": "Prophetic Sunnah and Method"
            },
            "content": {
              "urdu": [
                "احرام کی نیت کرنے اور لبیک پکارنے سے پہلے بدن پر خوشبو لگانا سنت ہے۔",
                "سیدہ عائشہ نے بیان کیا کہ وہ آپ ﷺ کو عود اور مشک جیسی بہترین خوشبوئیں لگاتی تھیں۔",
                "خوشبو بدن پر ہونی چاہیے، کپڑوں پر نہیں ہونی چاہیے اگرچہ بدن سے کپڑوں کو لگ جائے تو حرج نہیں۔"
              ],
              "english": [
                "Applying perfume to the body before entering Ihram is a confirmed Sunnah of the Prophet (ﷺ).",
                "Aisha (RA) used to apply the best available scents like musk and oud to him.",
                "Perfume should be applied to the skin, not the Ihram sheets themselves, according to the preferred view."
              ]
            }
          },
          {
            "title": {
              "urdu": "احرام میں خوشبو کا اثر",
              "english": "The Lingering Scent in Ihram"
            },
            "content": {
              "urdu": [
                "اگر احرام باندھنے کے بعد بھی خوشبو کی مہک باقی رہے تو اس میں کوئی گناہ نہیں۔",
                "سیدہ عائشہ فرماتی تھیں کہ میں آپ ﷺ کی مانگ میں مشک کی چمک دیکھتی تھی جب آپ احرام میں ہوتے۔",
                "ممنوع عمل احرام کی حالت میں نئی خوشبو لگانا ہے، پرانی مہک کا باقی رہنا معاف ہے۔"
              ],
              "english": [
                "If the scent of the perfume remains after entering Ihram, it is permissible and carries no penalty.",
                "Aisha (RA) noted seeing the glisten of musk in the Prophet's (ﷺ) hair part while he was in Ihram.",
                "The prohibition lies in applying fresh perfume while in Ihram, not the remnants of what was applied before."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "احرام سے نکلنے کے بعد خوشبو",
        "english": "Perfume After Exiting Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحللِ اول کا مفہوم",
              "english": "Meaning of the First Partial Exit"
            },
            "content": {
              "urdu": [
                "10 ذوالحجہ کو جب حاجی رمی کر لیتا ہے اور بال کٹوا لیتا ہے تو وہ احرام سے جزوی طور پر آزاد ہو جاتا ہے۔",
                "اس حالت کو تحللِ اول کہتے ہیں جس میں جماع کے علاوہ سب کچھ جائز ہو جاتا ہے۔",
                "اسی موقع پر طوافِ زیارت سے پہلے خوشبو لگانا مسنون ہے جیسا کہ آپ ﷺ نے کیا۔"
              ],
              "english": [
                "On the 10th of Dhul-Hijjah, after stoning and shaving, the pilgrim enters a state of partial exit from Ihram.",
                "This is called Tahallul al-Awwal, where everything except marital relations becomes permissible.",
                "At this stage, it is Sunnah to apply perfume before performing the obligatory Tawaf al-Ifadah."
              ]
            }
          },
          {
            "title": {
              "urdu": "طوافِ بیت اللہ کی تیاری",
              "english": "Preparing for Tawaf al-Ka'bah"
            },
            "content": {
              "urdu": [
                "بیت اللہ کا طواف ایک عظیم عبادت ہے جس کے لیے خوشبو اور صفائی کا اہتمام مستحب ہے۔",
                "نبی ﷺ نے کعبہ کی حاضری سے پہلے خود کو معطر کیا تاکہ اللہ کے گھر کا ادب ملحوظ رہے۔",
                "یہ عمل اس بات کی دلیل ہے کہ خوشبو مومن کی زینت ہے جو عبادات میں نشاط پیدا کرتی ہے۔"
              ],
              "english": [
                "Tawaf is a major act of worship, making hygiene and fragrance highly recommended for it.",
                "The Prophet (ﷺ) scented himself before visiting the Ka'bah to maintain the sanctity of the Holy House.",
                "This practice proves that fragrance is an adornment for the believer that enhances spiritual energy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ازواجی تعاون اور محبت",
        "english": "Marital Cooperation and Affection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدہ عائشہ کی خدمت",
              "english": "Service of Lady Aisha (RA)"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کا آپ ﷺ کو خوشبو لگانا ان کی گہری محبت اور خدمت گزاری کو ظاہر کرتا ہے۔",
                "ازواجِ مطہرات نبی ﷺ کے ہر چھوٹے بڑے کام میں ان کا ہاتھ بٹاتی تھیں۔",
                "یہ اسوہ ہمیں سکھاتا ہے کہ میاں بیوی کو عبادات کی تیاری میں ایک دوسرے کا سہارا بننا چاہیے۔"
              ],
              "english": [
                "Aisha's (RA) act of applying perfume to the Prophet (ﷺ) reflects her deep love and dedication to service.",
                "The Mothers of the Believers used to assist the Prophet (ﷺ) in all his personal and ritual preparations.",
                "This example teaches spouses to support each other in the preparations for acts of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی حیا اور سادگی",
              "english": "Prophetic Modesty and Simplicity"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنے گھر والوں کی طرف سے کی گئی خدمت کو بخوشی قبول فرمایا۔",
                "آپ ﷺ نے خوشبو کو دنیا کی پسندیدہ ترین چیزوں میں شمار کیا جو روح کو بالیدگی بخشتی ہے۔",
                "گھریلو زندگی میں باہمی اپنائیت اور سنتوں پر عمل ہی اصل خوش بختی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) graciously accepted the services rendered by his family members.",
                "He categorized fragrance as one of the things he loved most in this world as it uplifts the soul.",
                "Mutual intimacy and following the Sunnah in domestic life are the keys to true happiness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احکامِ حج کی ترتیب",
              "english": "Order of Hajj Rituals"
            },
            "content": {
              "urdu": [
                "حج کے دوران مختلف اوقات میں حلال و حرام کے حدود بدلتے ہیں جن کا علم ضروری ہے۔",
                "احرام سے پہلے کی خوشبو جائز ہے، دورانِ احرام حرام ہے، اور تحلل کے بعد دوبارہ سنت ہے۔",
                "مسلمان کو چاہیے کہ وہ علمِ فقہ کے ذریعے اپنی عبادات کو سنت کے سانچے میں ڈھالے۔"
              ],
              "english": [
                "The boundaries of permissibility change during Hajj, necessitating proper knowledge of the stages.",
                "Perfume is allowed before Ihram, forbidden during it, and Sunnah again after partial Tahallul.",
                "A Muslim should use the knowledge of Fiqh to mold their worship according to the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظافت اور پاکیزگی",
              "english": "Cleanliness and Purity"
            },
            "content": {
              "urdu": [
                "اسلام صرف باطنی پاکیزگی نہیں بلکہ ظاہری صفائی اور خوشبو کا بھی دین ہے۔",
                "عظیم اجتماعات میں خوشبو کا استعمال دوسروں کو اذیت سے بچاتا ہے اور ماحول کو خوشگوار بناتا ہے۔",
                "ہر حاجی کو چاہیے کہ وہ اپنی ذات سے دوسروں کو راحت پہنچانے کی کوشش کرے۔"
              ],
              "english": [
                "Islam is a religion of both inner purity and outward cleanliness and fragrance.",
                "In large gatherings, using scent prevents causing offense to others and brightens the atmosphere.",
                "Every pilgrim should strive to be a source of comfort and pleasantness to those around them."
              ]
            }
          }
        ]
      }
    }
  ]
}