{
  "hadithId": 1155,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/32"],
    "kitabId": 12,
    "inKitabBab": 2,
    "arabicBook": "كتاب الصيد والذبائح",
    "babId": 93
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5503)، ومسلم (1968). وهذا الحديث أصل في شروط الذبح وآلاته.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم دونوں میں موجود ہے۔ یہ ذبح کے طریقوں اور آلات کے بارے میں ایک بنیادی ضابطہ فراہم کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5503) and Muslim (1968). This Hadith is a primary source for the conditions and tools of slaughtering."
  },
  "importantWords": [
    {
      "arabic": "أُنْهِرَ",
      "english": "Flowed out",
      "urdu": "بہا دیا گیا"
    },
    {
      "arabic": "اَلدَّمُ",
      "english": "Blood",
      "urdu": "خون"
    },
    {
      "arabic": "اَلسِّنَّ",
      "english": "Tooth",
      "urdu": "دانت"
    },
    {
      "arabic": "اَلظُّفْرَ",
      "english": "Nail",
      "urdu": "ناخن"
    },
    {
      "arabic": "عَظْمٌ",
      "english": "Bone",
      "urdu": "ہڈی"
    },
    {
      "arabic": "مُدَى",
      "english": "Knives",
      "urdu": "چھری / آلہ"
    }
  ],
  "summary": {
    "urdu": "ذبح کے لیے خون کا بہنا اور بسم اللہ پڑھنا ضروری ہے، تاہم ہڈی، دانت اور ناخن سے ذبح کرنا منع ہے۔",
    "english": "Slaughtering requires causing blood to flow and mentioning Allah's name, but using teeth, bones, or nails as tools is prohibited."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5503)",
      "english": "Sahih al-Bukhari (5503)"
    },
    {
      "arabic": "صحيح مسلم (1968)",
      "english": "Sahih Muslim (1968)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رافع بن خديج",
        "english": "Rafi' bin Khadij"
      },
      "slug": "rafi-bin-khadij"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F3XpA-Tj1O0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ذبح کی بنیادی شرائط",
        "english": "Basic Conditions of Slaughter"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون کا بہنا",
              "english": "Flowing of Blood"
            },
            "content": {
              "urdu": [
                "شرعی ذبح کے لیے ایسی چیز کا استعمال لازمی ہے جو رگیں کاٹ کر خون بہا دے۔",
                "خون بہنے سے گوشت میں موجود فاسد مادے خارج ہو جاتے ہیں۔",
                "ایسا جانور جس کا خون نہ بہے وہ شرعاً مردار کے حکم میں آتا ہے۔"
              ],
              "english": [
                "Legal slaughtering requires an instrument that cuts veins and causes blood flow.",
                "Flowing of blood removes harmful substances and toxins from the meat.",
                "An animal whose blood does not flow is considered 'Maitah' (dead meat)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تسمیہ (اللہ کا نام)",
              "english": "Mentioning Allah's Name"
            },
            "content": {
              "urdu": [
                "ذبح کرتے وقت جان بوجھ کر اللہ کا نام چھوڑنا ذبیحہ کو حرام کر دیتا ہے۔",
                "یہ عمل اس بات کا اقرار ہے کہ جان لینا صرف اللہ کے حکم سے جائز ہے۔",
                "اسلامی ذبح کی پہچان ہی بسم اللہ سے شروع کرنا ہے۔"
              ],
              "english": [
                "Intentionally omitting Allah's name during slaughter makes the meat unlawful.",
                "This act acknowledges that taking life is only permissible by Allah's command.",
                "The hallmark of Islamic slaughter is starting with the name of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ممنوعہ آلاتِ ذبح",
        "english": "Prohibited Slaughtering Tools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دانت اور ہڈی کا حکم",
              "english": "Ruling on Teeth and Bone"
            },
            "content": {
              "urdu": [
                "دانت ہڈی کی ایک قسم ہے اور ہڈی سے ذبح کرنا منع ہے۔",
                "ہڈی جنات کی خوراک ہے، اس لیے اسے خون سے آلودہ کرنا ناپسندیدہ ہے۔",
                "اس ممانعت میں طبی حکمتیں بھی پوشیدہ ہیں تاکہ صفائی برقرار رہے۔"
              ],
              "english": [
                "Teeth are a type of bone, and slaughtering with bone is strictly forbidden.",
                "Bones are the food of Jinn, so contaminating them with blood is disliked.",
                "There are medical wisdoms behind this to ensure hygiene and purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناخن سے ذبح کرنا",
              "english": "Slaughtering with Nails"
            },
            "content": {
              "urdu": [
                "ناخن سے ذبح کرنا حبشیوں کا طریقہ تھا جو کہ غیر اسلامی شعار ہے۔",
                "مسلمانوں کو مشرکین اور غیر مسلموں کے مخصوص طریقوں سے بچنا چاہیے۔",
                "ناخن سے جانور کو تکلیف زیادہ ہوتی ہے جو کہ بے رحمی ہے۔"
              ],
              "english": [
                "Using nails for slaughter was a practice of Abyssinians, an un-Islamic custom.",
                "Muslims are encouraged to avoid the specific rituals of non-believers.",
                "Using nails causes excessive pain to the animal, which is cruel."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و طبی حکمت",
        "english": "Juristic and Medical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیز دھار آلے کی اہمیت",
              "english": "Importance of Sharp Tools"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے ذبح کے لیے تیز چھری استعمال کرنے کا حکم دیا ہے۔",
                "تیز آلہ جانور کی تکلیف کو کم کرتا ہے اور جلد موت لاتا ہے۔",
                "کند آلے سے ذبح کرنا جانور پر ظلم اور شرعاً مکروہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) ordered the use of sharp knives for slaughtering.",
                "A sharp tool minimizes the animal's pain and leads to a quick death.",
                "Using a blunt tool is oppressive to the animal and disliked in Shariah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جراثیم سے پاک گوشت",
              "english": "Germ-Free Meat"
            },
            "content": {
              "urdu": [
                "خون کا مکمل اخراج گوشت کو جراثیم سے محفوظ رکھتا ہے۔",
                "اگر خون اندر رہ جائے تو گوشت جلد خراب ہو جاتا ہے۔",
                "اسلامی طریقہ ذبح جدید طبی اصولوں کے عین مطابق ہے۔"
              ],
              "english": [
                "The complete drainage of blood keeps the meat safe from bacteria.",
                "If blood remains trapped inside, the meat spoils much faster.",
                "The Islamic method of slaughtering aligns perfectly with medical science."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و عملی اسباق",
        "english": "Ethical and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مخلوق پر رحم",
              "english": "Mercy to Creation"
            },
            "content": {
              "urdu": [
                "جانور کو ذبح کرتے وقت بھی اس کے آرام کا خیال رکھنا چاہیے۔",
                "اسلامی شریعت رحمت اور شفقت کے اصولوں پر مبنی ہے۔",
                "بلاوجہ اذیت دینا اسلامی تعلیمات کے یکسر خلاف ہے۔"
              ],
              "english": [
                "Even while slaughtering an animal, its comfort must be considered.",
                "Islamic Shariah is built upon the principles of mercy and compassion.",
                "Inflicting unnecessary pain is completely against Islamic teachings."
              ]
            }
          },
          {
            "title": {
              "urdu": "اپنی شناخت کا تحفظ",
              "english": "Protecting Identity"
            },
            "content": {
              "urdu": [
                "حبشیوں کے طریقے سے منع کرنا مسلمانوں کی الگ شناخت برقرار رکھنا ہے۔",
                "ہمیں ہر معاملے میں کفار کی مشابہت سے بچنا چاہیے۔",
                "سنتِ نبوی کی پیروی ہی دنیا و آخرت میں کامیابی کی ضمانت ہے۔"
              ],
              "english": [
                "Prohibiting the Abyssinian way preserves the distinct identity of Muslims.",
                "We should avoid mimicking non-believers in their specific cultural traits.",
                "Following the Sunnah is the only guarantee of success in both worlds."
              ]
            }
          }
        ]
      }
    }
  ]
}