{
  "hadithId": 694,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/62"],
    "kitabId": 7,
    "inKitabBab": 2,
    "arabicBook": "كتاب البيوع",
    "babId": 43
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2117)، ومسلم (1533). والرجل المذكور هو حبان بن منقذ الأنصاري رضي الله عنه.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2117) اور امام مسلم (1531) نے روایت کیا ہے۔ یہ شخص جس کا ذکر ہے وہ حبان بن منقذ انصاری رضی اللہ عنہ تھے۔",
    "english": "Sahih. Reported by Al-Bukhari (2117) and Muslim (1533). The man referred to in the Hadith is Habban bin Munqidh al-Ansari (RA)."
  },
  "importantWords": [
    {
      "arabic": "يُخْدَعُ",
      "english": "Deceived / Cheated",
      "urdu": "دھوکہ دیا جاتا ہے"
    },
    {
      "arabic": "بَايَعْتَ",
      "english": "Transacted / Traded",
      "urdu": "تم سودا کرو"
    },
    {
      "arabic": "خَلَابَةَ",
      "english": "Deception / Fraud",
      "urdu": "دھوکہ یا فریب"
    },
    {
      "arabic": "ذَكَرَ",
      "english": "Mentioned",
      "urdu": "ذکر کیا"
    },
    {
      "arabic": "بُيُوعِ",
      "english": "Transactions",
      "urdu": "خرید و فروخت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'خیارِ شرط' کی ایک خاص صورت بیان کی گئی ہے کہ اگر کوئی شخص بھول چوک یا سادگی کی وجہ سے دھوکہ کھا جاتا ہو، تو وہ سودے کے وقت یہ شرط لگا سکتا ہے کہ دھوکہ ثابت ہونے پر اسے واپسی کا حق ہوگا۔",
    "english": "This Hadith establishes the right to annul a contract if deception occurs, specifically for those who are easily misled, by stipulating 'no deception' during the deal."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب البيوع",
      "english": "Sahih Muslim, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دھوکہ دہی سے تحفظ",
        "english": "Protection from Deception"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیارِ غبن کی بنیاد",
              "english": "Basis for Option of Fraud"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس صحابی کو ایک ایسا جملہ سکھایا جو ان کے لیے ڈھال بن گیا۔",
                "'لا خلابہ' کہنے کا مطلب یہ ہے کہ میں یہ سودا اس شرط پر کر رہا ہوں کہ اس میں فریب نہ ہو۔",
                "اگر بعد میں دھوکہ ثابت ہو جائے تو خریدار کو شرعی طور پر واپسی کا حق مل جاتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) taught the companion a phrase to act as a legal shield.",
                "Saying 'La Khilabah' means the deal is conditioned on the absence of fraud.",
                "If deception is later proven, the buyer legally gains the right to return the item."
              ]
            }
          },
          {
            "title": {
              "urdu": "سادہ لوح افراد کی رعایت",
              "english": "Concession for Simple-minded People"
            },
            "content": {
              "urdu": [
                "مذکورہ صحابی کے سر پر چوٹ لگی تھی جس کی وجہ سے ان کی عقل میں کچھ کمزوری تھی۔",
                "اسلام معاشرے کے کمزور اور سادہ لوگوں کو چالاک تاجروں سے تحفظ فراہم کرتا ہے۔",
                "دین میں ایسے احکامات موجود ہیں جو کسی کا مال ناحق ہڑپ کرنے سے روکتے ہیں۔"
              ],
              "english": [
                "The companion mentioned had a head injury that slightly affected his judgment.",
                "Islam protects simple-minded individuals from being exploited by cunning traders.",
                "Religion provides regulations to prevent anyone from unjustly seizing others' wealth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور قانونی حکمت",
        "english": "Juristic and Legal Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشروط بیع کا جواز",
              "english": "Permissibility of Conditional Sales"
            },
            "content": {
              "urdu": [
                "یہ الفاظ ادا کرنا 'خیارِ شرط' (سودا ختم کرنے کی شرط) کے زمرے میں آتا ہے۔",
                "اکثر فقہاء کے نزدیک اس جملے کے بعد تین دن تک واپسی کا حق حاصل رہتا ہے۔",
                "یہ اصول آج کے دور میں 'منی بیک گارنٹی' کی ایک بنیادی شرعی شکل ہے۔"
              ],
              "english": [
                "Uttering these words falls under 'Khiyar al-Shart' (the option of condition).",
                "Most jurists agree that this phrase grants a three-day right of return.",
                "This principle is a Sharia-based precursor to modern 'money-back guarantees'."
              ]
            }
          },
          {
            "title": {
              "urdu": "سودے میں شفافیت",
              "english": "Transparency in Deals"
            },
            "content": {
              "urdu": [
                "بیچنے والے پر واجب ہے کہ وہ چیز کی حقیقت اور قیمت میں سچائی سے کام لے۔",
                "اگر کسی کی مجبوری یا لاعلمی سے فائدہ اٹھایا جائے تو وہ برکت کو ختم کر دیتا ہے۔",
                "اسلامی معیشت کا حسن باہمی رضامندی اور دیانتداری میں پوشیدہ ہے۔"
              ],
              "english": [
                "The seller is obligated to be truthful about the item's condition and price.",
                "Exploiting someone's necessity or ignorance removes blessings from wealth.",
                "The beauty of the Islamic economy lies in mutual consent and integrity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی غمخواری",
              "english": "The Prophet's Compassion"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے صحابی کو صرف تسلی نہیں دی بلکہ ایک عملی قانونی حل بھی بتایا۔",
                "ایک رہنما کو اپنے ماتحتوں اور عوام کی مشکلات کا حل نکالنا چاہیے۔",
                "رسول اللہ ﷺ کی تعلیمات زندگی کے ہر شعبے میں مکمل رہنمائی فراہم کرتی ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not just console the man but provided a legal solution.",
                "A leader should actively seek solutions for the difficulties faced by the public.",
                "The Prophet's (ﷺ) teachings offer comprehensive guidance for all walks of life."
              ]
            }
          },
          {
            "title": {
              "urdu": "سچائی کی اہمیت",
              "english": "The Importance of Truth"
            },
            "content": {
              "urdu": [
                "جھوٹ بول کر مال بیچنا عارضی فائدہ تو دے سکتا ہے مگر انجام برا ہوتا ہے۔",
                "دھوکہ دہی کرنے والا نبی کریم ﷺ کی جماعت سے خارج قرار پاتا ہے۔",
                "تجارت میں سچائی اختیار کرنے والے کا حشر انبیاء کے ساتھ ہوگا۔"
              ],
              "english": [
                "Selling goods through lies may bring temporary profit but leads to a bad end.",
                "One who deceives others is excluded from the community of the Prophet (ﷺ).",
                "The truthful merchant will be resurrected alongside the Prophets."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے ہدایات",
        "english": "Guidelines for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہدوں میں احتیاط",
              "english": "Caution in Contracts"
            },
            "content": {
              "urdu": [
                "اگر آپ کو مارکیٹ کا علم نہیں تو سودے کے وقت واپسی کی شرط ضرور رکھیں۔",
                "اپنے حقوق کے تحفظ کے لیے شرعی رخصت سے فائدہ اٹھانا عقلمندی ہے۔",
                "مالی معاملات میں تحریر یا گواہ رکھنا تنازعات سے بچنے کا بہترین طریقہ ہے۔"
              ],
              "english": [
                "If you lack market knowledge, always stipulate a right-of-return condition.",
                "Utilizing Sharia-permitted concessions to protect rights is a sign of wisdom.",
                "Using written records or witnesses in financial affairs prevents future disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "متاثرہ افراد کی مدد",
              "english": "Helping the Affected"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے اردگرد موجود سادہ لوگوں کو معاشی دھوکہ دہی سے بچانا چاہیے۔",
                "کسی مظلوم کی مالی مدد یا صحیح مشورہ دینا صدقہ جاریہ ہے۔",
                "معاشرے میں خیر خواہی کا جذبہ پیدا کرنا ہی اسلام کا اصل مقصد ہے۔"
              ],
              "english": [
                "We should protect the simple people around us from economic fraud.",
                "Providing financial help or sound advice to a victim is ongoing charity.",
                "Fostering a spirit of goodwill in society is the core objective of Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}