{
  "hadithId": 658,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/11"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح موقوفا.‏ رواه مالك في الموطأ (2/776)، والبيهقي في الكبرى (10/342). وهو الأصح أن هذا من اجتهاد عمر رضي الله عنه الذي وافقه عليه الصحابة.",
    "urdu": "یہ روایت موقوفاً صحیح ہے (یعنی سیدنا عمر کا قول ہے)۔ اسے امام مالک نے موطا (2/776) اور بیہقی نے سنن کبریٰ (10/342) میں روایت کیا ہے۔ اسے مرفوع کہنا وہم ہے۔",
    "english": "Sahih as a Mauquf narration (statement of the companion). Reported by Malik in Al-Muwatta (2/776) and Al-Bayhaqi in Al-Kubra (10/342). Attributing it to the Prophet (ﷺ) directly is considered a mistake by narrators."
  },
  "importantWords": [
    {
      "arabic": "أُمَّهَاتِ اَلْأَوْلَادِ",
      "english": "Mothers of children",
      "urdu": "ام ولد (وہ لونڈی جس سے اولاد ہو)"
    },
    {
      "arabic": "لَا تُبَاعُ",
      "english": "Not to be sold",
      "urdu": "فروخت نہ کی جائے"
    },
    {
      "arabic": "لَا تُوهَبُ",
      "english": "Not to be gifted",
      "urdu": "ہبہ نہ کی جائے"
    },
    {
      "arabic": "لَا تُورَثُ",
      "english": "Not to be inherited",
      "urdu": "وراثت نہ بنائی جائے"
    },
    {
      "arabic": "حُرَّةٌ",
      "english": "Free woman",
      "urdu": "آزاد عورت"
    },
    {
      "arabic": "فَوَهِمَ",
      "english": "He erred / was mistaken",
      "urdu": "وہ وہم میں پڑ گیا"
    }
  ],
  "summary": {
    "urdu": "اس اثر میں سیدنا عمر فاروق رضی اللہ عنہ کا وہ فیصلہ بیان ہوا ہے جس کے مطابق ام ولد کی خرید و فروخت ممنوع ہے اور وہ مالک کی وفات پر خود بخود آزاد ہو جاتی ہے۔",
    "english": "This report details the legal decree of 'Umar (RA) that an Umm al-Walad cannot be traded or inherited, and she gains automatic freedom upon her master's death."
  },
  "references": [
    {
      "arabic": "رواه مالك في الموطأ",
      "english": "Reported by Malik in Al-Muwatta"
    },
    {
      "arabic": "رواه البيهقي في السنن الكبرى",
      "english": "Reported by Al-Bayhaqi in As-Sunan al-Kubra"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar ibn al-Khattab"
      },
      "slug": "umar-ibn-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R0_qV9N_x9o",
  "grade": {
    "arabic": "صحيح موقوف",
    "english": "Sahih Mauquf (Authentic statement of Companion)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ام ولد کا شرعی مقام",
        "english": "Legal Status of Umm al-Walad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ام ولد کی تعریف",
              "english": "Definition of Umm al-Walad"
            },
            "content": {
              "urdu": [
                "ام ولد اس لونڈی کو کہتے ہیں جس سے اس کے مالک کا بچہ پیدا ہوا ہو۔",
                "اسلام میں اولاد کی نسبت باپ سے ہونے کی وجہ سے ماں کو خاص درجہ دیا گیا۔",
                "اس درجہ کی وجہ سے اس لونڈی کے حقوق عام غلاموں سے مختلف ہو جاتے ہیں۔"
              ],
              "english": [
                "Umm al-Walad refers to a slave woman who has borne a child for her master.",
                "In Islam, the child is attributed to the father, giving the mother special status.",
                "Due to this status, her rights differ significantly from those of regular slaves."
              ]
            }
          },
          {
            "title": {
              "urdu": "خرید و فروخت کی ممانعت",
              "english": "Prohibition of Sale and Gift"
            },
            "content": {
              "urdu": [
                "سیدنا عمر رضی اللہ عنہ نے ام ولد کی تجارت کو سختی سے روک دیا۔",
                "اسے نہ تو کسی کو تحفے میں دیا جا سکتا ہے اور نہ ہی بیچا جا سکتا ہے۔",
                "یہ پابندی لونڈی کے انسانی وقار اور اس کے بچے کے تحفظ کے لیے ہے۔"
              ],
              "english": [
                "Umar (RA) strictly prohibited the commercial trade of Umm al-Walad.",
                "She cannot be given away as a gift nor can she be sold in the market.",
                "This restriction protects her human dignity and the well-being of her child."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آزادی اور وراثت کے احکام",
        "english": "Rulings on Freedom and Inheritance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وفات پر خودکار آزادی",
              "english": "Automatic Freedom upon Death"
            },
            "content": {
              "urdu": [
                "مالک کی وفات کے فوراً بعد ام ولد خود بخود آزاد ہو جاتی ہے۔",
                "اسے آزادی کے لیے کسی تحریری معاہدے یا مزید کارروائی کی ضرورت نہیں۔",
                "یہ حکم اس کے اور اس کی اولاد کے مستقبل کو مستحکم بناتا ہے۔"
              ],
              "english": [
                "The Umm al-Walad becomes automatically free immediately upon the master's death.",
                "She does not require a written contract or further legal steps for her freedom.",
                "This ruling stabilizes the future for both her and her children."
              ]
            }
          },
          {
            "title": {
              "urdu": "وراثت میں تقسیم نہ ہونا",
              "english": "Exclusion from Inheritance"
            },
            "content": {
              "urdu": [
                "ام ولد کو ترکہ کا حصہ بنا کر ورثاء میں تقسیم نہیں کیا جا سکتا۔",
                "وہ دیگر مال و اسباب کی طرح کسی کی ملکیت میں منتقل نہیں ہوتی۔",
                "اس کا مقصد اسے مستقل طور پر غلامی کی زنجیروں سے نکالنا ہے۔"
              ],
              "english": [
                "An Umm al-Walad cannot be treated as part of the estate for heirs.",
                "She is not transferred into the ownership of others like regular property.",
                "The objective is to permanently release her from the bonds of slavery."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا عمر کا اجتہاد",
        "english": "The Ijtihad of Umar (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا اتفاق",
              "english": "Consensus of the Companions"
            },
            "content": {
              "urdu": [
                "سیدنا عمر کا یہ فیصلہ ان کے دورِ خلافت کے اہم اجتہادات میں سے ہے۔",
                "اکثر صحابہ کرام نے اس فیصلے کو قبول کیا اور اس پر عمل کیا۔",
                "یہ فیصلہ اسلامی قانون سازی میں 'خلفائے راشدین کی سنت' کی اہمیت ظاہر کرتا ہے۔"
              ],
              "english": [
                "This decision is among the major legal Ijtihads of Umar (RA) during his Caliphate.",
                "The majority of the Sahaba accepted and implemented this legal decree.",
                "It demonstrates the weight of the 'Sunnah of Rashidun Caliphs' in Islamic law."
              ]
            }
          },
          {
            "title": {
              "urdu": "مرفوع اور موقوف کا فرق",
              "english": "Difference between Marfu and Mauquf"
            },
            "content": {
              "urdu": [
                "بعض راویوں نے اسے نبی ﷺ کا قول سمجھا جو کہ علمی غلطی ہے۔",
                "محدثین نے واضح کیا کہ یہ اصلاً سیدنا عمر رضی اللہ عنہ کا اپنا قول ہے۔",
                "حدیث کی جانچ پڑتال میں راویوں کے وہم کو پہچاننا فنِ حدیث کا کمال ہے۔"
              ],
              "english": [
                "Some narrators mistook this for a Prophetic quote, which is a technical error.",
                "Hadith scholars clarified that it is originally the statement of Umar (RA).",
                "Identifying errors of narrators is a hallmark of the sophisticated science of Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انسانی حقوق اور اسلام",
        "english": "Human Rights and Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلامی کے خاتمے کی طرف قدم",
              "english": "Steps toward Abolishing Slavery"
            },
            "content": {
              "urdu": [
                "اسلام نے بتدریج ایسے قوانین بنائے جس سے غلامی کا خاتمہ ممکن ہوا۔",
                "ام ولد کو تحفظ دینا اسی اصلاحی سلسلے کی ایک کڑی ہے۔",
                "یہ قانون ماں اور بچے کے درمیان رشتے کے تقدس کو بحال کرتا ہے۔"
              ],
              "english": [
                "Islam introduced gradual laws that led to the eventual abolition of slavery.",
                "Protecting the Umm al-Walad is a link in this chain of social reform.",
                "This law restores the sanctity of the bond between mother and child."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندان کی وحدت",
              "english": "Unity of the Family"
            },
            "content": {
              "urdu": [
                "ام ولد کو نہ بیچنے کا حکم خاندان کو بکھرنے سے بچاتا ہے۔",
                "بچے کی پرورش اپنی ماں کے سائے میں ہونا اس کا بنیادی حق ہے۔",
                "اسلامی معاشرت میں خاندانی اقدار کو ہمیشہ فوقیت دی گئی ہے۔"
              ],
              "english": [
                "The order not to sell the Umm al-Walad prevents families from being split.",
                "A child's right to be raised under their mother's care is fundamental.",
                "Islamic social teachings consistently prioritize family values over property."
              ]
            }
          }
        ]
      }
    }
  ]
}