{
  "hadithId": 1151,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/28"],
    "kitabId": 12,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأطعمة",
    "babId": 93
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5507). وهذا الحديث كان في أقوام حديثي عهد بالإسلام، فبين النبي صلى الله عليه وسلم أن الأصل في ذبائح المسلمين الحل.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (5507) نے اسے روایت کیا ہے۔ اس سے ثابت ہوتا ہے کہ مسلمانوں کے ذبیحہ کے بارے میں حسن ظن رکھنا چاہیے کہ انہوں نے اللہ کا نام لیا ہوگا۔",
    "english": "Sahih. Reported by Al-Bukhari (5507). This incident concerned people who had recently embraced Islam, clarifying that meat slaughtered by Muslims is assumed to be Halal."
  },
  "importantWords": [
    {
      "arabic": "يَأْتُونَنَا",
      "english": "They bring us",
      "urdu": "وہ ہمارے پاس لاتے ہیں"
    },
    {
      "arabic": "لَا نَدْرِي",
      "english": "We do not know",
      "urdu": "ہم نہیں جانتے"
    },
    {
      "arabic": "أَذُكِرَ",
      "english": "Was mentioned",
      "urdu": "کیا ذکر کیا گیا"
    },
    {
      "arabic": "اسْمُ اَللَّهِ",
      "english": "Name of Allah",
      "urdu": "اللہ کا نام"
    },
    {
      "arabic": "سَمُّوا",
      "english": "Mention (the name)",
      "urdu": "تم نام لو"
    },
    {
      "arabic": "كُلُوهُ",
      "english": "Eat it",
      "urdu": "اسے کھاؤ"
    }
  ],
  "summary": {
    "urdu": "اگر گوشت لانے والا مسلمان ہو تو اس بات کی تحقیق کرنا ضروری نہیں کہ اس نے ذبح کے وقت بسم اللہ پڑھی تھی یا نہیں، بس خود بسم اللہ پڑھ کر کھا لینا جائز ہے۔",
    "english": "If meat is provided by Muslims, it is not mandatory to investigate if Allah's name was mentioned during slaughter; simply saying Bismillah before eating is sufficient."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5507)",
      "english": "Sahih al-Bukhari (5507)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F3XpA-Tj1O0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسلمانوں کے ذبیحہ کا حکم",
        "english": "Ruling on Muslim Slaughter"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بنیادی اصول",
              "english": "Fundamental Principle"
            },
            "content": {
              "urdu": [
                "مسلمان جب کوئی جانور ذبح کرتا ہے تو اصل یہی ہے کہ اس نے شرعی طریقہ اپنایا ہوگا۔",
                "بلاوجہ شک کرنا اور کریدنا شریعت میں پسندیدہ عمل نہیں ہے۔",
                "یہ حدیث مسلمانوں کے درمیان اعتماد اور آسانی پیدا کرنے کے لیے ہے۔"
              ],
              "english": [
                "When a Muslim slaughters an animal, the assumption is that they followed the Shariah.",
                "Unnecessary suspicion and investigation are not encouraged in Islamic law.",
                "This Hadith promotes trust and ease in social interactions between Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید نومسلموں کا معاملہ",
              "english": "Case of New Muslims"
            },
            "content": {
              "urdu": [
                "سائلین کو ان لوگوں کے بارے میں شک تھا جو حال ہی میں اسلام لائے تھے۔",
                "نبی ﷺ نے ان کے شک کو ختم کرتے ہوئے گوشت کھانے کی اجازت عطا فرمائی۔",
                "اس سے معلوم ہوا کہ نومسلموں کے ذبیحہ کو بھی مستند مانا جائے گا۔"
              ],
              "english": [
                "The questioners doubted people who had recently converted to Islam.",
                "The Prophet (ﷺ) removed their doubt by granting permission to eat the meat.",
                "This indicates that meat from new Muslims is considered valid and authentic."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بسم اللہ پڑھنے کی اہمیت",
        "english": "Importance of Saying Bismillah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے سے پہلے تسمیہ",
              "english": "Tasmiah Before Eating"
            },
            "content": {
              "urdu": [
                "کھانے سے پہلے بسم اللہ پڑھنا ہر مسلمان کے لیے مسنون عمل ہے۔",
                "یہ عمل کھانے میں برکت لاتا ہے اور شیطان کے اثر کو ختم کرتا ہے۔",
                "آپ ﷺ نے شک کے علاج کے طور پر خود بسم اللہ پڑھنے کا حکم دیا۔"
              ],
              "english": [
                "Saying Bismillah before eating is a Sunnah for every Muslim.",
                "This act brings blessings to the food and removes the influence of Shaitan.",
                "The Prophet (ﷺ) ordered them to say Bismillah themselves to resolve their doubt."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذبح اور کھانے کی بسم اللہ",
              "english": "Slaughter vs. Eating Bismillah"
            },
            "content": {
              "urdu": [
                "ذبح کے وقت بسم اللہ پڑھنا ایک الگ شرعی تقاضا اور واجب عمل ہے۔",
                "کھانے کے وقت بسم اللہ پڑھنا شک کا بدل نہیں بلکہ ایک مستقل سنت ہے۔",
                "اگر ذبح کی بسم اللہ یقینی طور پر چھوڑی گئی ہو تو حکم مختلف ہوگا۔"
              ],
              "english": [
                "Saying Bismillah during slaughter is a separate legal requirement and obligatory.",
                "Saying Bismillah at mealtime is an independent Sunnah, not a substitute for slaughter.",
                "If it is certain that Bismillah was omitted during slaughter, the ruling changes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی وسعت اور آسانی",
        "english": "Juristic Scope and Ease"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی حد",
              "english": "Limits of Investigation"
            },
            "content": {
              "urdu": [
                "شریعت نے ہمیں ہر چھوٹی بات کی بال کی کھال نکالنے کا پابند نہیں کیا۔",
                "ظاہری حالت اگر درست ہو تو باطنی کرید کی ضرورت نہیں رہتی۔",
                "یہ اصول معاشرتی تعلقات میں تنگی اور وحشت کو ختم کرتا ہے۔"
              ],
              "english": [
                "Shariah does not bind us to investigate every minor detail of an action.",
                "If the outward condition appears correct, internal probing is unnecessary.",
                "This principle eliminates hardship and social tension in community relations."
              ]
            }
          },
          {
            "title": {
              "urdu": "تساہل سے بچاؤ",
              "english": "Avoiding Laxity"
            },
            "content": {
              "urdu": [
                "یہ حکم وہاں ہے جہاں ذبح کرنے والا مسلمان یا اہلِ کتاب ہو۔",
                "کافر یا مشرک کے ذبیحہ کے معاملے میں یہ رخصت حاصل نہیں ہے۔",
                "حلال و حرام کے معاملے میں بنیادی احتیاط ہمیشہ برقرار رہنی چاہیے۔"
              ],
              "english": [
                "This ruling applies when the slaughterer is a Muslim or from the People of the Book.",
                "This concession does not apply to meat slaughtered by pagans or polytheists.",
                "Basic caution regarding Halal and Haram must always be maintained."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و عملی سبق",
        "english": "Ethical and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وسوسوں کا علاج",
              "english": "Dealing with Whispers"
            },
            "content": {
              "urdu": [
                "بلاوجہ کے وسوسے انسان کی ذہنی اور روحانی سکون کو برباد کرتے ہیں۔",
                "سنتِ نبوی پر عمل کرنے سے دل کو اطمینان اور شرحِ صدر حاصل ہوتا ہے۔",
                "دین میں غلو اور شدت پسندی سے ہمیشہ بچنا چاہیے کیونکہ یہ ہلاکت ہے۔"
              ],
              "english": [
                "Baseless whispers destroy a person's mental and spiritual peace.",
                "Following the Sunnah provides tranquility and contentment to the heart.",
                "Exaggeration and extremism in religion should be avoided as they lead to ruin."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلمانوں کے بارے میں حسنِ ظن",
              "english": "Good Expectations of Muslims"
            },
            "content": {
              "urdu": [
                "دوسرے مسلمان بھائی کے بارے میں اچھا گمان رکھنا ایمان کی علامت ہے۔",
                "شک کی بنیاد پر دوسروں کے عمل کو رد نہیں کرنا چاہیے۔",
                "اسلامی معاشرت میں ایک دوسرے پر اعتماد ہی اتحاد کی بنیاد ہے۔"
              ],
              "english": [
                "Having good expectations of a fellow Muslim is a sign of faith.",
                "One should not reject the actions of others based on mere suspicion.",
                "Trusting one another is the foundation of unity in an Islamic society."
              ]
            }
          }
        ]
      }
    }
  ]
}