{
  "hadithId": 568,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/62"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "كتاب الصيام",
    "babId": 35
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2009)، ومسلم (759). والمراد بقيام رمضان صلاة التراويح.",
    "urdu": "صحیح۔ اسے امام بخاری (2009) اور امام مسلم (759) نے روایت کیا ہے۔ یہاں رمضان کے قیام سے مراد نمازِ تراویح اور تہجد ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2009) and Muslim (759). The term 'Qiyam Ramadan' refers specifically to Tarawih and Tahajjud prayers."
  },
  "importantWords": [
    {
      "arabic": "قَامَ",
      "english": "Stood (in prayer)",
      "urdu": "قیام کیا"
    },
    {
      "arabic": "إِيمَانًا",
      "english": "With faith",
      "urdu": "ایمان کے ساتھ"
    },
    {
      "arabic": "احْتِسَابًا",
      "english": "Seeking reward",
      "urdu": "ثواب کی نیت سے"
    },
    {
      "arabic": "غُفِرَ لَهُ",
      "english": "Was forgiven for him",
      "urdu": "اس کے لیے معاف کر دیے گئے"
    },
    {
      "arabic": "مَا تَقَدَّمَ",
      "english": "What preceded",
      "urdu": "جو پہلے گزر چکا"
    },
    {
      "arabic": "ذَنْبِهِ",
      "english": "His sins",
      "urdu": "اس کے گناہ"
    }
  ],
  "summary": {
    "urdu": "رمضان کی راتوں میں خلوصِ نیت اور ایمان کے ساتھ نمازِ تراویح پڑھنا پچھلے تمام گناہوں کی معافی کا سبب بنتا ہے۔",
    "english": "Observing the night prayers in Ramadan with sincere faith and the hope for reward leads to the absolute forgiveness of past sins."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2009)",
      "english": "Reported by Al-Bukhari (2009)"
    },
    {
      "arabic": "رواه مسلم (759)",
      "english": "Reported by Muslim (759)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S8pBOnM5h1A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قیامِ رمضان کی اہمیت",
        "english": "Importance of Qiyam in Ramadan"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تراویح اور اجر و ثواب",
              "english": "Tarawih and Its Rewards"
            },
            "content": {
              "urdu": [
                "قیامِ رمضان سے مراد وہ نوافل ہیں جو رات کو پڑھے جاتے ہیں۔",
                "نمازِ تراویح اس فضیلت کو حاصل کرنے کا سب سے بڑا ذریعہ ہے۔",
                "یہ سنتِ مؤکدہ ہے جسے نبی ﷺ نے بہت اہمیت دی ہے۔"
              ],
              "english": [
                "Qiyam al-Ramadan refers to the voluntary prayers performed at night.",
                "The Tarawih prayer is the primary means to attain this great virtue.",
                "It is a stressed Sunnah to which the Prophet (ﷺ) gave great importance."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہوں کی معافی",
              "english": "Forgiveness of Sins"
            },
            "content": {
              "urdu": [
                "اس عمل سے پچھلے تمام صغیرہ گناہ معاف کر دیے جاتے ہیں۔",
                "کبیرہ گناہوں کے لیے سچی توبہ اور حقوق العباد کی ادائیگی لازم ہے۔",
                "رمضان کا پورا مہینہ اللہ کی طرف سے بخشش کا عظیم موقع ہے۔"
              ],
              "english": [
                "All previous minor sins are wiped away through this blessed act.",
                "Major sins require sincere repentance and fulfilling the rights of others.",
                "The entire month of Ramadan is a grand opportunity for Divine pardon."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمان اور احتساب کی شرط",
        "english": "Conditions of Faith and Seeking Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کا مفہوم",
              "english": "Meaning of Faith"
            },
            "content": {
              "urdu": [
                "اس سے مراد اللہ کے وعدوں اور اس کی فرضیت پر مکمل یقین ہے۔",
                "عبادت دکھاوے کے لیے نہیں بلکہ صرف اللہ کے لیے ہونی چاہیے۔",
                "سچا مومن ہی اس عظیم اجر کا حقدار ٹھہرتا ہے۔"
              ],
              "english": [
                "It refers to complete conviction in Allah's promises and obligations.",
                "Worship must be for Allah alone, free from any ostentation or showing off.",
                "Only a true believer is entitled to this magnificent spiritual reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتساب کی حقیقت",
              "english": "The Reality of Ihtisab"
            },
            "content": {
              "urdu": [
                "احتساب کا مطلب ہے کہ صرف اللہ سے اجر کی امید رکھی جائے۔",
                "عبادت کو بوجھ سمجھنے کے بجائے خوشی سے ادا کرنا ضروری ہے۔",
                "نفس کا جائزہ لینا اور خالص نیت رکھنا کامیابی کی بنیاد ہے۔"
              ],
              "english": [
                "Ihtisab means expecting the reward from Allah the Almighty alone.",
                "One must perform worship with joy rather than considering it a burden.",
                "Self-evaluation and keeping a pure intention are the foundations of success."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماعت اور انفرادی قیام",
              "english": "Congregational vs Individual Prayer"
            },
            "content": {
              "urdu": [
                "تراویح باجماعت پڑھنا سنتِ صحابہ اور مستحب عمل ہے۔",
                "اگر کوئی گھر میں اکیلا پڑھے تو بھی اجر حاصل کر سکتا ہے۔",
                "تاہم مسجد میں قیام کرنا اتحادِ امت کی بہترین مثال ہے۔"
              ],
              "english": [
                "Praying Tarawih in congregation is a Sunnah and highly recommended.",
                "An individual praying alone at home can still attain the reward.",
                "However, standing in the mosque is a prime example of Ummah unity."
              ]
            }
          },
          {
            "title": {
              "urdu": "استقامت کی تربیت",
              "english": "Training in Steadfastness"
            },
            "content": {
              "urdu": [
                "پورے مہینے کا قیام انسان میں صبر اور نظم و ضبط پیدا کرتا ہے۔",
                "یہ نفس کو اللہ کی بندگی میں تھکانے کی ایک بہترین مشق ہے۔",
                "رمضان کے بعد بھی نمازوں کی پابندی کا جذبہ پیدا ہوتا ہے۔"
              ],
              "english": [
                "The month-long standing instills patience and discipline in a person.",
                "It is an excellent exercise in exhausting the soul for Allah's service.",
                "It fosters the spirit to remain steadfast in prayer even after Ramadan."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رات کی برکتیں",
              "english": "Blessings of the Night"
            },
            "content": {
              "urdu": [
                "رات کا وقت اللہ سے سرگوشی اور مناجات کا بہترین وقت ہے۔",
                "رمضان کی راتوں میں آسمانِ دنیا پر اللہ کی خاص رحمت ہوتی ہے۔",
                "غفلت کی نیند سے بیدار ہو کر بندگی کرنا ہی اصل کامیابی ہے۔"
              ],
              "english": [
                "The night time is the best period for intimate prayer with Allah.",
                "In Ramadan nights, Allah's special mercy descends to the lowest heaven.",
                "True success lies in waking from negligent sleep for Divine service."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاص کا تقاضا",
              "english": "Requirement of Sincerity"
            },
            "content": {
              "urdu": [
                "بغیر خلوص کے لمبی نمازیں بھی بے سود ثابت ہو سکتی ہیں۔",
                "اپنے دل کی حالت کو درست کرنا ظاہری عمل سے زیادہ اہم ہے۔",
                "اللہ صرف وہی عمل قبول کرتا ہے جو خالص اس کے لیے ہو۔"
              ],
              "english": [
                "Long prayers can prove futile without the presence of sincerity.",
                "Correcting the state of the heart is more vital than the outward act.",
                "Allah only accepts the deeds that are performed exclusively for Him."
              ]
            }
          }
        ]
      }
    }
  ]
}