{
  "hadithId": 346,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/206"],
    "kitabId": 2,
    "inKitabBab": 11,
    "arabicBook": "كتاب الصلاة - باب صلاة المسافر والمريض",
    "babId": 21
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1080) في رواية الـ19 يوماً. أما رواية تبوك فرواها أبو داود (1235) وصححها النووي في الخلاصة.",
    "urdu": "صحیح۔ انیس دن والی روایت بخاری (1080) میں ہے۔ بیس دن والی روایت ابوداؤد (1235) میں ہے جسے امام نووی نے 'الخلاصہ' میں صحیح قرار دیا ہے۔",
    "english": "Sahih. The 19-day stay is in Bukhari (1080). The 20-day stay at Tabuk is in Abu Dawud (1235) and was graded Sahih by an-Nawawi in al-Khulasah."
  },
  "importantWords": [
    {
      "arabic": "أَقَامَ",
      "english": "Stayed / Resided",
      "urdu": "قیام فرمایا / ٹھہرے"
    },
    {
      "arabic": "يَقْصُرُ",
      "english": "Shortens (prayer)",
      "urdu": "قصر کرتے تھے"
    },
    {
      "arabic": "بِتَبُوكَ",
      "english": "In Tabuk",
      "urdu": "تبوک میں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سفر کے دوران قیام کی اس مدت کا ذکر ہے جس میں قصر کی جا سکتی ہے۔ مختلف واقعات (فتح مکہ اور غزوہ تبوک) میں آپ ﷺ کے قیام کی مدت مختلف رہی، جس سے فقہاء نے قصر کی زیادہ سے زیادہ مدت کے بارے میں استدلال کیا ہے۔",
    "english": "This Hadith discusses the duration for which a traveler can perform Qasr while staying at a destination. The Prophet's (ﷺ) varying lengths of stay at Makkah and Tabuk have led to different scholarly opinions on the maximum duration of Qasr."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب تقصير الصلاة، رقم 1080",
      "english": "Sahih al-Bukhari, Book of Shortening the Prayer, No. 1080"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دورانِ سفر قیام اور قصر کی مدت",
        "english": "Duration of Stay and Qasr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف روایات کی حکمت",
              "english": "Wisdom Behind Different Narrations"
            },
            "content": {
              "urdu": [
                "فتح مکہ کے موقع پر انیس (19) دن قیام میں قصر کرنا اس لیے تھا کیونکہ آپ ﷺ کا مستقل قیام کا ارادہ نہیں تھا بلکہ حالات کے مطابق رکنا پڑا۔",
                "تبوک میں بیس (20) دن قیام کے دوران قصر کی وجہ بھی یہی تھی کہ روانگی کا وقت متعین نہ تھا، دشمن کے انتظار میں قیام طویل ہوا۔",
                "تعداد میں فرق (15، 17، 18، 19) راویوں کے دن گننے کے طریقے (آمد اور روانگی کے دن شامل کرنے یا نہ کرنے) کی وجہ سے ہو سکتا ہے۔"
              ],
              "english": [
                "The 19-day stay in Makkah involved Qasr because the Prophet (ﷺ) did not have a fixed intention to settle there indefinitely but stayed according to the situation.",
                "The 20-day stay in Tabuk also involved Qasr as the departure time was not fixed while waiting for the enemy.",
                "Differences in numbers (15, 17, 18, 19) may be due to the narrators' methods of counting days (including or excluding arrival and departure days)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب اور مدتِ قیام",
        "english": "Legal Opinions on Duration of Stay"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستقل رہائش کا ارادہ",
              "english": "Intention of Residence"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک اگر 15 دن سے کم قیام کا ارادہ ہو تو قصر کی جائے گی، ورنہ پوری نماز پڑھی جائے گی۔",
                "شوافع اور مالکیہ کے نزدیک یہ مدت 4 دن (بشمول 20 نمازیں) ہے، جبکہ ابن عباس اس حدیث کی بنا پر 19 دن کی رعایت دیتے تھے۔",
                "اگر کوئی شخص کسی کام کے لیے رکا ہو اور اسے یہ معلوم نہ ہو کہ کام کب ختم ہوگا (روزانہ واپسی کی امید ہو)، تو وہ جب تک چاہے قصر کر سکتا ہے۔"
              ],
              "english": [
                "According to Hanafis, if the intention is to stay for less than 15 days, one performs Qasr; otherwise, the full prayer is prayed.",
                "Shafi'is and Malikis set this duration at 4 days, while Ibn Abbas allowed 19 days based on this Hadith.",
                "If someone is staying for a task and doesn't know when it will finish (expecting to leave every day), they can continue Qasr indefinitely."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ کلام",
        "english": "Conclusion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سہولت اور رخصت",
              "english": "Ease and Concession"
            },
            "content": {
              "urdu": [
                "یہ احادیث ظاہر کرتی ہیں کہ سفر ایک مشقت ہے اور اللہ نے اس میں بندے کے لیے بڑی آسانی رکھی ہے۔",
                "مدت کے بارے میں اختلاف کے باوجود اصل بنیاد 'سفر کی کیفیت' اور 'واپسی کا ارادہ' ہے۔"
              ],
              "english": [
                "These Hadiths show that travel is a hardship and Allah has placed great ease for His servants during it.",
                "Despite differences in duration, the primary factors are the state of being a traveler and the intention of return."
              ]
            }
          }
        ]
      }
    }
  ]
}