{
  "hadithId": 1085,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/6"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2825)، ومسلم (1353)، وزادا: \"وإذا استنفرتم فانفروا\".",
    "urdu": "صحیح۔ اسے امام بخاری (2825) اور امام مسلم (1353) نے روایت کیا ہے۔ حدیث میں یہ اضافہ بھی ہے کہ جب تم سے جہاد کے لیے نکلنے کو کہا جائے تو نکل پڑو۔",
    "english": "Sahih. Reported by Al-Bukhari (2825) and Muslim (1353). Both added: 'And when you are called to set out (for Jihad), then set out.'"
  },
  "importantWords": [
    {
      "arabic": "الْفَتْحِ",
      "english": "The Conquest",
      "urdu": "فتح (مکہ)"
    },
    {
      "arabic": "لَا هِجْرَةَ",
      "english": "No Migration",
      "urdu": "ہجرت نہیں"
    },
    {
      "arabic": "جِهَادٌ",
      "english": "Striving / Struggle",
      "urdu": "جہاد / کوشش"
    },
    {
      "arabic": "نِيَّةٌ",
      "english": "Intention",
      "urdu": "نیت"
    },
    {
      "arabic": "اسْتُنْفِرْتُمْ",
      "english": "Called to fight",
      "urdu": "بلایا جائے"
    }
  ],
  "summary": {
    "urdu": "فتحِ مکہ کے بعد مکہ سے مدینہ کی طرف واجب ہجرت ختم ہو گئی کیونکہ مکہ دارالاسلام بن گیا، اب صرف جہاد اور نیت کا ثواب باقی ہے۔",
    "english": "After the Conquest of Makkah, the mandatory migration from Makkah to Madinah ended as Makkah became Islamic; now, only the rewards for Jihad and sincere intentions remain."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2825)",
      "english": "Narrated by Al-Bukhari (2825)"
    },
    {
      "arabic": "رواه مسلم (1353)",
      "english": "Narrated by Muslim (1353)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYmX7G6f48A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہجرت کے حکم کی وضاحت",
        "english": "Clarification of the Ruling on Hijrah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتح مکہ اور ہجرت کا اختتام",
              "english": "Conquest of Makkah and End of Hijrah"
            },
            "content": {
              "urdu": [
                "فتح مکہ سے پہلے مکہ سے مدینہ ہجرت کرنا ہر مسلمان پر فرض تھا۔",
                "فتح کے بعد مکہ اسلامی شہر بن گیا، اس لیے وہاں سے ہجرت کی ضرورت نہ رہی۔",
                "یہ ہجرت اس خاص فضیلت کے خاتمے کا اعلان ہے جو مہاجرینِ اول کو ملی۔"
              ],
              "english": [
                "Before the Conquest of Makkah, migrating to Madinah was mandatory for every Muslim.",
                "After the victory, Makkah became an Islamic city, making migration unnecessary.",
                "This marks the end of the specific status granted to the early emigrants (Muhajirun)."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہجرت کا عمومی مفہوم",
              "english": "General Meaning of Migration"
            },
            "content": {
              "urdu": [
                "اگرچہ مکہ سے ہجرت ختم ہو گئی، مگر دارالکفر سے ہجرت کا حکم اب بھی باقی ہے۔",
                "مسلمانوں کے لیے گناہوں کو چھوڑ دینا بھی ایک قسم کی ہجرت ہے۔",
                "شریعت میں ہجرت کا اصل مقصد دین کی حفاظت اور آزادیٔ عبادت ہے۔"
              ],
              "english": [
                "Though migration from Makkah ended, the ruling for leaving lands of disbelief remains.",
                "For Muslims, abandoning sins is also considered a spiritual form of Hijrah.",
                "The core purpose of migration in Sharia is to protect one's faith and freedom of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جہاد اور نیت کا تسلسل",
        "english": "Continuity of Jihad and Intention"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جہاد کی دائمی حیثیت",
              "english": "Perpetual Status of Jihad"
            },
            "content": {
              "urdu": [
                "قیامت تک اللہ کی راہ میں کوشش اور دفاع کا عمل جاری رہے گا۔",
                "ہجرت کا ثواب اب جہاد اور نیک اعمال کے ذریعے حاصل کیا جا سکتا ہے۔",
                "دین کی سربلندی کے لیے ہر دور میں جدوجہد کرنا مسلمانوں کی ذمہ داری ہے۔"
              ],
              "english": [
                "The act of striving and defense for Allah's sake will continue until the Last Day.",
                "The reward of Hijrah can now be attained through Jihad and righteous deeds.",
                "Striving for the supremacy of the faith remains a duty for Muslims in every era."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت کی طاقت",
              "english": "The Power of Intention"
            },
            "content": {
              "urdu": [
                "اعمال کا دارومدار نیتوں پر ہے، نیت صادق ہو تو گھر بیٹھے اجر ملتا ہے۔",
                "اگر کوئی ہجرت نہ کر سکے مگر نیت رکھے تو وہ ثواب میں شریک ہے۔",
                "نیت کا تعلق دل سے ہے جو انسان کے عمل کو اللہ کے ہاں وزن عطا کرتی ہے۔"
              ],
              "english": [
                "Actions are judged by intentions; a sincere heart gains reward even at home.",
                "If one cannot migrate but intends to, they share in the spiritual reward.",
                "Intention resides in the heart and gives weight to a person's deeds before Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ریاستی پکار اور اطاعت",
        "english": "State Call and Obedience"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفیرِ عام کا حکم",
              "english": "Ruling on General Mobilization"
            },
            "content": {
              "urdu": [
                "جب حاکمِ وقت جہاد کے لیے پکارے تو نکلنا سب پر فرض ہو جاتا ہے۔",
                "ایسی صورت میں سستی کرنا یا پیچھے رہ جانا گناہِ عظیم ہے۔",
                "اجتماعی دفاع کے لیے نظم و ضبط اور اطاعتِ امیر ضروری ہے۔"
              ],
              "english": [
                "When the ruler calls for Jihad, it becomes an individual obligation to set out.",
                "In such circumstances, showing laziness or staying behind is a major sin.",
                "Discipline and obedience to the leader are essential for collective defense."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی دفاع کی حکمت",
              "english": "Wisdom of Islamic Defense"
            },
            "content": {
              "urdu": [
                "جہاد کا مقصد فتنہ ختم کرنا اور امن و امان قائم کرنا ہے۔",
                "اسلام دشمن قوتوں کے خلاف ہمہ وقت چوکنا رہنے کا درس دیتا ہے۔",
                "قومی اور دینی سلامتی کے لیے تیاری ایمان کا حصہ ہے۔"
              ],
              "english": [
                "The goal of Jihad is to end oppression and establish peace and order.",
                "Islam teaches remaining alert at all times against hostile forces.",
                "Preparation for national and religious security is a component of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت اور حالات کی پابندی",
              "english": "Observance of Time and Context"
            },
            "content": {
              "urdu": [
                "شرعی احکام حالات اور مصلحت کے تابع ہو سکتے ہیں۔",
                "مسلمانوں کو بدلتے ہوئے حالات میں شرعی رہنمائی لینی چاہیے۔",
                "فتحِ مکہ کے بعد مکہ کی حرمت اور امن کا نیا دور شروع ہوا۔"
              ],
              "english": [
                "Sharia rulings can be subject to changing circumstances and public interest.",
                "Muslims must seek juristic guidance in light of evolving situations.",
                "After the Conquest, a new era of sanctity and peace began for Makkah."
              ]
            }
          },
          {
            "title": {
              "urdu": "ثواب کمانے کے مواقع",
              "english": "Opportunities for Gaining Reward"
            },
            "content": {
              "urdu": [
                "اللہ کی راہ میں محنت کے دروازے کبھی بند نہیں ہوتے۔",
                "نیک نیتی انسان کو بڑے سے بڑے درجے پر پہنچا دیتی ہے۔",
                "اپنے عمل کو اللہ کے لیے خالص کرنا ہی اصل کامیابی ہے۔"
              ],
              "english": [
                "The doors to striving in Allah's way are never closed to the believers.",
                "Sincere intentions can elevate a person to the highest spiritual ranks.",
                "Purifying one's actions solely for Allah is the essence of true success."
              ]
            }
          }
        ]
      }
    }
  ]
}