{
  "hadithId": 569,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/569"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 35
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2024)، ومسلم (1174). وفي رواية لمسلم زيادة: 'وَجَدَّ' أي اجتهد في العبادة زيادة على عادته.",
    "urdu": "صحیح۔ اسے بخاری (2024) اور مسلم (1174) نے روایت کیا ہے۔ امام مسلم کی ایک روایت میں 'وَجَدَّ' کا لفظ بھی ہے، جس کا مطلب ہے کہ آپ ﷺ عبادت میں غیر معمولی محنت فرماتے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2024) and Muslim (1174). A narration in Muslim adds 'and exerted himself,' meaning he increased his efforts in worship beyond his usual routine."
  },
  "importantWords": [
    {
      "arabic": "اَلْعَشْرُ",
      "english": "Ten days",
      "urdu": "دس دن / عشرہ"
    },
    {
      "arabic": "شَدَّ مِئْزَرَهُ",
      "english": "Tightened his waist belt",
      "urdu": "کمر کس لی / تندہی سے جٹ جانا"
    },
    {
      "arabic": "أَحْيَا لَيْلَهُ",
      "english": "Prayed all night",
      "urdu": "رات کو زندہ کیا / عبادت میں گزاری"
    },
    {
      "arabic": "أَيْقَظَ",
      "english": "Awakened",
      "urdu": "جگایا / بیدار کیا"
    },
    {
      "arabic": "أَهْلَهُ",
      "english": "His family",
      "urdu": "اپنے گھر والے"
    }
  ],
  "summary": {
    "urdu": "رمضان کے آخری دس دنوں میں نبی کریم ﷺ عبادت میں غیر معمولی اضافہ فرماتے، نیند کم کرتے اور اپنے گھر والوں کو بھی اس خیر میں شریک کرنے کے لیے بیدار فرماتے۔",
    "english": "In the last ten days of Ramadan, the Prophet (ﷺ) would increase his worship intensely, remain awake at night, and encourage his family to participate in these blessed hours."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2024)",
      "english": "Reported by Al-Bukhari (2024)"
    },
    {
      "arabic": "رواه مسلم (1174)",
      "english": "Reported by Muslim (1174)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9_mK02-v6w",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عبادت میں غیر معمولی محنت",
        "english": "Extraordinary Effort in Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کمر کس لینے کا مفہوم",
              "english": "Meaning of Tightening the Belt"
            },
            "content": {
              "urdu": [
                "اس سے مراد عبادت کے لیے مکمل طور پر فارغ ہو جانا اور تندہی سے جٹ جانا ہے۔",
                "کنایہ ہے کہ آپ ﷺ ان ایام میں ازدواجی تعلقات سے کنارہ کشی اختیار فرماتے تھے۔",
                "یہ عمل لیلۃ القدر کی تلاش اور اس کی برکات سمیٹنے کے لیے تھا۔"
              ],
              "english": [
                "It refers to fully dedicating oneself to worship with great zeal and focus.",
                "It is a metaphor indicating that the Prophet (ﷺ) abstained from marital relations during these days.",
                "This effort was specifically to seek Laylat al-Qadr and its immense blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "راتوں کو زندہ کرنا",
              "english": "Reviving the Nights"
            },
            "content": {
              "urdu": [
                "نبی ﷺ آخری عشرے کی تمام راتیں نماز، تلاوت اور ذکر میں گزارتے تھے۔",
                "آپ ﷺ کا معمول عام دنوں میں رات کے ایک حصے میں سونے کا تھا، مگر یہاں استثنا تھا۔",
                "یہ شب بیداری اللہ کے قرب اور بخشش کے حصول کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) spent the entire nights of the last ten days in prayer, recitation, and dhikr.",
                "His usual routine included sleeping for part of the night, but these nights were an exception.",
                "Remaining awake for worship is an excellent means to achieve closeness to Allah and forgiveness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گھریلو تربیت اور ذمہ داری",
        "english": "Family Training and Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ خانہ کو جگانا",
              "english": "Awakening the Family"
            },
            "content": {
              "urdu": [
                "نبی ﷺ صرف اکیلے عبادت نہیں کرتے تھے بلکہ اپنے گھر والوں کو بھی بیدار فرماتے۔",
                "یہ ایک سربراہِ خانہ کی ذمہ داری ہے کہ وہ اپنے خاندان کو نیکی کی ترغیب دے۔",
                "اس سے گھر میں خیر و برکت اور دینی ماحول پروان چڑھتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not worship alone; he actively encouraged his family to wake up for prayer.",
                "It is the responsibility of the head of the household to urge their family toward righteous deeds.",
                "This fosters a religious environment and brings blessings (Barakah) into the home."
              ]
            }
          },
          {
            "title": {
              "urdu": "موقع کی اہمیت کا احساس",
              "english": "Awareness of the Opportunity"
            },
            "content": {
              "urdu": [
                "سال میں یہ دس راتیں سب سے زیادہ فضیلت والی ہیں، لہذا ان میں سستی نہیں کرنی چاہیے۔",
                "آپ ﷺ کا گھر والوں کو جگانا ظاہر کرتا ہے کہ یہ وقت سونے کا نہیں بلکہ پانے کا ہے۔",
                "مسلمانوں کو چاہیے کہ وہ ان راتوں میں فضول کاموں اور نیند کو کم کریں۔"
              ],
              "english": [
                "These ten nights are the most virtuous of the year, so one must not be lax during them.",
                "Awakening the family shows that these hours are meant for gaining rewards, not sleeping.",
                "Muslims should reduce unnecessary activities and sleep during these precious nights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لیلۃ القدر کی تلاش",
        "english": "Seeking Laylat al-Qadr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخری عشرے کی خصوصیت",
              "english": "Specialty of the Last Ten Days"
            },
            "content": {
              "urdu": [
                "لیلۃ القدر اسی عشرے کی طاق راتوں میں پوشیدہ ہے جو ہزار مہینوں سے بہتر ہے۔",
                "آپ ﷺ کا یہ مجاہدہ دراصل اسی عظیم رات کو پانے کی تڑپ تھی۔",
                "جو ان راتوں میں جاگا اور عبادت کی، اس نے بڑی خیر پا لی۔"
              ],
              "english": [
                "Laylat al-Qadr, which is better than a thousand months, is hidden in the odd nights of this decade.",
                "The Prophet's intense struggle was fueled by the desire to attain the blessings of this great night.",
                "Whoever remains awake and worships during these nights has attained great goodness."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتکاف اور خلوت",
              "english": "Itikaf and Seclusion"
            },
            "content": {
              "urdu": [
                "آپ ﷺ انہی وجوہات کی بنا پر آخری عشرے کا اعتکاف بھی فرمایا کرتے تھے۔",
                "دنیا سے کٹ کر اللہ سے لو لگانا اس عشرے کا اصل مقصود ہے۔",
                "اعتکاف کے ذریعے انسان یکسوئی کے ساتھ اللہ کی بندگی کر سکتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used to observe Itikaf (seclusion) during these last ten days for these reasons.",
                "The core goal is to cut off from worldly distractions and turn entirely to Allah.",
                "Through Itikaf, a person can worship Allah with undivided attention and sincerity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی قدر",
              "english": "Valuing Time"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ اہم مواقع پر آرام کو قربان کرنا سنتِ نبوی ہے۔",
                "نیکی کے سیزن میں غفلت برتنا ایک مومن کے شایانِ شان نہیں ہے۔",
                "ہمیں بھی رمضان کے آخری دنوں میں اپنی عبادات کا گراف بلند کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith teaches us that sacrificing comfort during important times is a Prophetic Sunnah.",
                "Being heedless during a 'season of righteousness' does not befit a believer.",
                "We should also raise the level of our worship during the closing days of Ramadan."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی عبادت",
              "english": "Collective Worship"
            },
            "content": {
              "urdu": [
                "گھر کے افراد کو نیکی میں ایک دوسرے کا سہارا بننا چاہیے۔",
                "اگر ایک تھک جائے تو دوسرا اسے یاد دلائے اور جگائے۔",
                "ایسی محنت سے ہی معاشرے میں دینداری اور تقویٰ عام ہو سکتا ہے۔"
              ],
              "english": [
                "Family members should support one another in performing good deeds.",
                "If one grows tired, the other should remind and awaken them for worship.",
                "Only through such collective effort can piety and godliness prevail in society."
              ]
            }
          }
        ]
      }
    }
  ]
}