{
  "hadithId": 795,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/795"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - کتاب البيوع",
    "babId": 59
  },
 
  "takhreej": {
    "arabic": "حسن .‏ رواه البخاري في \" الأدب المفرد \" ( 594 )‏ وأبو يعلى في \" المسند \" ( 6148 )، والبيهقي (6/169). وصححه الألباني في إرواء الغليل (1601).",
    "urdu": "حسن۔ اسے امام بخاری نے 'الادب المفرد' (594) اور ابویعلیٰ نے اپنی 'مسند' (6148) میں روایت کیا ہے۔ علامہ البانی نے 'ارواء الغلیل' میں اسے حسن قرار دیا ہے۔",
    "english": "Hasan. Reported by Al-Bukhari in 'Al-Adab al-Mufrad' (594), Abu Ya'la (6148), and Al-Bayhaqi. Authenticated as Hasan by Al-Albani in 'Irwa' al-Ghalil' (1601)."
  },
  "importantWords": [
    {
      "arabic": "تَهَادُوْا",
      "english": "Give gifts to each other",
      "urdu": "آپس میں تحفہ دو"
    },
    {
      "arabic": "تَحَابُّوا",
      "english": "You will love each other",
      "urdu": "تمہارے درمیان محبت پیدا ہوگی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سماجی تعلقات کو مضبوط بنانے کا ایک بہترین نبوی نسخہ پیش کرتی ہے کہ تحائف کا تبادلہ دلوں سے کینہ نکالتا ہے اور محبت میں اضافے کا باعث بنتا ہے۔",
    "english": "This Hadith provides a prophetic remedy for strengthening social ties, stating that exchanging gifts removes malice from hearts and fosters mutual love."
  },
  "references": [
    {
      "arabic": "الأدب المفرد للبخاري (594)",
      "english": "Al-Adab Al-Mufrad by Al-Bukhari (594)"
    },
    {
      "arabic": "مسند أبي يعلى (6148)",
      "english": "Musnad Abu Ya'la (6148)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah ad-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہدیہ اور معاشرتی محبت",
        "english": "Gifts and Social Harmony"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحفہ دلوں کا میل نکالتا ہے",
              "english": "Gifts Remove Ill-will"
            },
            "content": {
              "urdu": [
                "انسان فطرتی طور پر اس کی طرف مائل ہوتا ہے جو اس کے ساتھ حسنِ سلوک کرے۔",
                "تحفہ دینے سے دوسرے کے دل میں موجود رنجشیں، کینہ اور حسد ختم ہو جاتا ہے۔",
                "یہ صرف ایک مادی چیز نہیں بلکہ احترام اور توجہ کا اظہار ہے۔"
              ],
              "english": [
                "Human nature naturally inclines towards those who treat them with kindness.",
                "Giving a gift eliminates resentment, malice, and jealousy from the recipient's heart.",
                "It is not just a material object but an expression of respect and care."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبت کی کلید",
              "english": "The Key to Love"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے محبت پیدا کرنے کے لیے تحفے کو ایک مؤثر ذریعہ بتایا ہے۔",
                "مسلمانوں کے درمیان باہمی الفت ایمان کی تکمیل کا حصہ ہے۔",
                "چھوٹی سے چھوٹی چیز کا ہدیہ بھی بڑے سے بڑے فاصلے مٹا سکتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) identified gifting as an effective means to generate love.",
                "Mutual affection among Muslims is part of the perfection of faith.",
                "Even a small gift can bridge significant emotional distances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہدیہ دینے کے آداب",
        "english": "Etiquettes of Gifting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاص اور بے نیازی",
              "english": "Sincerity and Selflessness"
            },
            "content": {
              "urdu": [
                "تحفہ صرف اللہ کی رضا اور محبت بڑھانے کی نیت سے ہونا چاہیے، کسی دنیاوی غرض کے لیے نہیں۔",
                "بدلے کی توقع رکھے بغیر ہدیہ دینا زیادہ فضیلت والا عمل ہے۔",
                "ہدیہ دے کر احسان جتلانا نیکی کو ضائع کر دیتا ہے۔"
              ],
              "english": [
                "A gift should be purely for Allah's sake and to increase love, not for worldly gain.",
                "Giving without expecting anything in return is a more virtuous act.",
                "Reminding someone of a gift as a favor nullifies the reward of the deed."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحفے کی قدر و قیمت",
              "english": "Value of the Gift"
            },
            "content": {
              "urdu": [
                "تحفہ دینے میں اپنی استطاعت کے مطابق بہترین چیز کا انتخاب کریں۔",
                "لینے والے کو چاہیے کہ وہ تحفے کی قیمت نہیں بلکہ دینے والے کے جذبے کو دیکھے۔",
                "نبی ﷺ نے معمولی سی چیز (جیسے بکری کا پایا) تحفے میں دینے یا لینے کو بھی حقیر سمجھنے سے منع فرمایا۔"
              ],
              "english": [
                "Choose the best possible item according to your financial capacity.",
                "The recipient should focus on the giver's sentiment rather than the price tag.",
                "The Prophet (ﷺ) forbade belittling any gift, even if it is something as small as a sheep's trotter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہدیہ اور دیگر انسانی جذبات",
        "english": "Gifts and Other Human Emotions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کینہ اور حسد کا علاج",
              "english": "Cure for Grudges and Envy"
            },
            "content": {
              "urdu": [
                "اگر دو لوگوں میں ناراضگی ہو، تو تحفہ صلح کا بہترین پیغام ثابت ہوتا ہے۔",
                "حسد کے خاتمے کے لیے اس شخص کو تحفہ دینا مستحب ہے جس سے حسد محسوس ہو رہا ہو۔",
                "ہدیہ دلوں کو نرم کرتا ہے اور گفتگو کے بند دروازے کھول دیتا ہے۔"
              ],
              "english": [
                "If there is a disagreement between two people, a gift serves as an excellent peace offering.",
                "To eliminate envy, it is recommended to give a gift to the person one feels envious of.",
                "Gifting softens hearts and reopens doors for communication."
              ]
            }
          },
          {
            "title": {
              "urdu": "رشتہ داروں اور پڑوسیوں کا حق",
              "english": "Rights of Relatives and Neighbors"
            },
            "content": {
              "urdu": [
                "سب سے پہلے قریبی رشتہ داروں اور پڑوسیوں کو ہدیہ دینے کی ترغیب دی گئی ہے۔",
                "یہ صلہ رحمی اور حقوق العباد کی ادائیگی کا ایک حسین انداز ہے۔",
                "پڑوسی کے گھر تھوڑا سا سالن یا کوئی کھانے کی چیز بھیجنا بھی سنت ہے۔"
              ],
              "english": [
                "Gifting relatives and neighbors first is highly encouraged.",
                "It is a beautiful way to maintain family ties and fulfill the rights of others.",
                "Sending a small portion of food or curry to a neighbor is also a Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحائف کی عادت ڈالیں",
              "english": "Develop the Habit of Gifting"
            },
            "content": {
              "urdu": [
                "خوشی کے موقع پر یا بلا وجہ بھی دوسروں کو تحائف دے کر سنتِ نبوی زندہ کریں۔",
                "اپنے بچوں کو بھی تحفہ دینے کی عادت ڈالیں تاکہ ان میں سخاوت پیدا ہو۔",
                "تحفہ لینے کے بعد 'جزاک اللہ خیراً' کہنا اور بدلے میں کچھ دینا بہترین اخلاق ہے۔"
              ],
              "english": [
                "Revive the Sunnah by giving gifts on happy occasions or even without reason.",
                "Train children to give gifts to instill generosity in them early on.",
                "Saying 'Jazak Allahu Khairan' and trying to reciprocate a gift is part of excellent character."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اتحاد",
              "english": "Social Unity"
            },
            "content": {
              "urdu": [
                "ہدیہ کا تبادلہ مسلم معاشرے کو ایک لڑی میں پرو دیتا ہے۔",
                "اس سے طبقاتی فرق کم ہوتا ہے اور ایک دوسرے کے لیے ہمدردی پیدا ہوتی ہے۔",
                "ایک دوسرے کے لیے دل صاف رکھنا ہی اسلامی معاشرت کی روح ہے۔"
              ],
              "english": [
                "Exchanging gifts binds the Muslim community together.",
                "It reduces class disparity and creates empathy for one another.",
                "Keeping clean hearts towards each other is the soul of Islamic social life."
              ]
            }
          }
        ]
      }
    }
  ]
}