{
  "hadithId": 1078,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/10/28"],
    "kitabId": 10,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحدود",
    "babId": 88
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (4772)، والترمذي (1421)، والنسائي (4095)، وابن ماجه (2580)، وأحمد (1657).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ ترمذی نے اسے 'حسن صحیح' کہا ہے۔ دیگر روایات میں دین، جان اور اہل و عیال کی حفاظت کا بھی ذکر ہے۔",
    "english": "Sahih. Reported by Abu Dawud (4772), At-Tirmidhi (1421), An-Nasa'i (4095), and Ibn Majah (2580). At-Tirmidhi classified it as 'Hasan Sahih'."
  },
  "importantWords": [
    {
      "arabic": "قُتِلَ",
      "english": "Killed",
      "urdu": "قتل کیا گیا"
    },
    {
      "arabic": "دُونَ مَالِهِ",
      "english": "Defending his property",
      "urdu": "اپنے مال کی حفاظت میں"
    },
    {
      "arabic": "شَهِيدٌ",
      "english": "Martyr",
      "urdu": "شہید"
    },
    {
      "arabic": "دِينِهِ",
      "english": "His Religion",
      "urdu": "اس کا دین"
    },
    {
      "arabic": "أَهْلِهِ",
      "english": "His Family",
      "urdu": "اس کے اہل خانہ"
    },
    {
      "arabic": "دَمِهِ",
      "english": "His Life/Blood",
      "urdu": "اس کی جان"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اپنے جائز مال، جان اور اہل و عیال کی حفاظت کے دوران مارے جانے والے کو شہادت کا رتبہ ملنے کی خوشخبری دی گئی ہے۔",
    "english": "This Hadith gives glad tidings of martyrdom to a person who is killed while defending their rightful property, life, or family members."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1421)",
      "english": "Sunan at-Tirmidhi (1421)"
    },
    {
      "arabic": "سنن أبي داود (4772)",
      "english": "Sunan Abi Dawud (4772)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعيد بن زيد",
        "english": "Sa'id bin Zaid"
      },
      "slug": "said-bin-zaid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دفاع کا حق",
        "english": "The Right to Self-Defense"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی حفاظت کا حکم",
              "english": "Protecting Wealth"
            },
            "content": {
              "urdu": [
                "اسلام ہر انسان کو اس کے جائز مال اور املاک کے تحفظ کا مکمل حق دیتا ہے۔",
                "اگر کوئی ڈاکو یا چور مال چھیننا چاہے تو اس کا مقابلہ کرنا شرعی طور پر درست ہے۔",
                "اپنے حق کے لیے آواز اٹھانا اور دفاع کرنا بزدلی کے بجائے بہادری اور ایمان ہے۔"
              ],
              "english": [
                "Islam grants every individual the full right to protect their lawful property.",
                "It is legally permissible to resist if a robber or thief tries to seize wealth.",
                "Standing up and defending one's rights is considered bravery, not cowardice."
              ]
            }
          },
          {
            "title": {
              "urdu": "شہادت کا درجہ",
              "english": "Rank of Martyrdom"
            },
            "content": {
              "urdu": [
                "میدانِ جنگ کے علاوہ بھی کچھ صورتوں میں شہادت کا رتبہ عطا کیا جاتا ہے۔",
                "مظلومیت کی حالت میں اپنے حق کے لیے جان دینے والا اللہ کے ہاں شہید ہے۔",
                "یہ رتبہ اس لیے ہے تاکہ معاشرے میں ظلم کے خلاف مزاحمت کا جذبہ رہے۔"
              ],
              "english": [
                "Martyrdom is granted in certain cases outside the actual battlefield.",
                "One who dies while defending their rights as the oppressed is a martyr.",
                "This status encourages the spirit of resisting injustice within society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حفاظت کے دیگر پہلو",
        "english": "Other Aspects of Protection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جان اور اہل و عیال",
              "english": "Life and Family"
            },
            "content": {
              "urdu": [
                "دیگر روایات میں جان اور اہل و عیال کی حفاظت کو بھی شہادت قرار دیا گیا ہے۔",
                "اپنی عزت اور خاندان کی حرمت پر سمجھوتہ نہ کرنا اسلامی غیرت کا تقاضا ہے۔",
                "اپنے بچوں اور گھر والوں کی جان بچاتے ہوئے مرنا عظیم قربانی ہے۔"
              ],
              "english": [
                "Other narrations classify defending life and family as martyrdom as well.",
                "Protecting one's honor and family is a requirement of Islamic integrity.",
                "Dying while saving the lives of family members is a great sacrifice."
              ]
            }
          },
          {
            "title": {
              "urdu": "دفاعِ دین",
              "english": "Defense of Religion"
            },
            "content": {
              "urdu": [
                "دین کی حفاظت کے لیے جان قربان کرنا شہادت کا سب سے اونچا درجہ ہے۔",
                "حق کے کلمے کو بلند کرنا اور باطل کے سامنے نہ جھکنا مومن کا شیوہ ہے۔",
                "اللہ کی رضا کے لیے دی گئی ہر قربانی رائیگاں نہیں جاتی۔"
              ],
              "english": [
                "Sacrificing life for the protection of religion is the highest form of martyrdom.",
                "Raising the word of truth and not bowing to falsehood is the trait of a believer.",
                "Every sacrifice made for the sake of Allah's pleasure is never wasted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حدود و قیود",
        "english": "Jurisprudential Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جارحیت سے بچنا",
              "english": "Avoiding Aggression"
            },
            "content": {
              "urdu": [
                "دفاع کا حق اس وقت ہے جب کوئی آپ پر ظلم یا زیادتی کی پہل کرے۔",
                "مقصد صرف اپنے مال یا جان کو بچانا ہونا چاہیے، نہ کہ انتقام یا زیادتی۔",
                "اسلام نے دفاع کے دوران بھی حد سے بڑھنے سے منع فرمایا ہے۔"
              ],
              "english": [
                "The right to defense exists when someone initiates oppression or aggression.",
                "The intent should strictly be to save property or life, not for revenge.",
                "Islam prohibits exceeding limits even during acts of self-defense."
              ]
            }
          },
          {
            "title": {
              "urdu": "احکامِ میت",
              "english": "Rulings on Deceased"
            },
            "content": {
              "urdu": [
                "اس قسم کے شہید کو 'شہیدِ آخرت' کہا جاتا ہے جسے ثواب شہادت کا ملے گا۔",
                "دنیاوی احکام میں اسے غسل دیا جائے گا اور نمازِ جنازہ بھی پڑھی جائے گی۔",
                "یہ اس شہید (فی سبیل اللہ) سے مختلف ہے جو میدانِ جنگ میں کام آئے۔"
              ],
              "english": [
                "Such a person is a 'Martyr of the Hereafter' receiving the reward of martyrdom.",
                "Regarding worldly rulings, they are washed and a funeral prayer is offered.",
                "This differs from a martyr killed on the battlefield in terms of burial rites."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی سبق",
        "english": "Social Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظلم کے خلاف رکاوٹ",
              "english": "Deterrence Against Injustice"
            },
            "content": {
              "urdu": [
                "جب لوگوں میں دفاع کا جذبہ ہوگا تو ظالم کو ظلم کرنے میں دشواری ہوگی۔",
                "یہ حدیث ایک بہادر اور خودار معاشرے کی تشکیل میں مدد دیتی ہے۔",
                "حقوقِ شہریت کی پامالی کے خلاف یہ ایک مضبوط شرعی دلیل ہے۔"
              ],
              "english": [
                "When people have the spirit of defense, oppressors find it hard to act.",
                "This Hadith helps in forming a brave and self-respecting society.",
                "It serves as a strong Shariah argument against the violation of civil rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "توکل اور جرات",
              "english": "Trust and Courage"
            },
            "content": {
              "urdu": [
                "مومن کو موت سے ڈرنے کے بجائے اللہ کے وعدوں پر یقین رکھنا چاہیے۔",
                "اللہ کی راہ میں دی گئی جان کبھی ضائع نہیں ہوتی بلکہ اسے ابدی زندگی ملتی ہے۔",
                "دفاع کے وقت بزدلی دکھانے کے بجائے حکمت اور جرات سے کام لینا چاہیے۔"
              ],
              "english": [
                "A believer should rely on Allah's promises instead of fearing death.",
                "A life given in Allah's way is never lost; rather, it gains eternal life.",
                "One should act with wisdom and courage rather than showing cowardice."
              ]
            }
          }
        ]
      }
    }
  ]
}