{
  "hadithId": 736,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/104"],
    "kitabId": 7,
    "inKitabBab": 7,
    "arabicBook": "كتاب البيوع",
    "babId": 48
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2463)، ومسلم (1609). والحديث أصل في حقوق الجوار.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2463) اور امام مسلم (1609) نے روایت کیا ہے۔ یہ حدیث پڑوسیوں کے حقوق اور باہمی تعاون کے باب میں بنیادی اہمیت رکھتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2463) and Muslim (1609). This Hadith is a primary text regarding the rights of neighbors and mutual cooperation."
  },
  "importantWords": [
    {
      "arabic": "يَمْنَعُ",
      "english": "Prevent / Forbid",
      "urdu": "روکے یا منع کرے"
    },
    {
      "arabic": "يَغْرِزَ",
      "english": "To fix / To insert",
      "urdu": "گاڑنا یا پیوست کرنا"
    },
    {
      "arabic": "خَشَبَةً",
      "english": "Wooden beam / Plank",
      "urdu": "لکڑی کا شہتیر یا ستون"
    },
    {
      "arabic": "مُعْرِضِينَ",
      "english": "Turning away",
      "urdu": "اعراض کرنے والے / پیٹھ پھیرنے والے"
    },
    {
      "arabic": "أَكْتَافِكُمْ",
      "english": "Your shoulders",
      "urdu": "تمہارے کندھے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں پڑوسیوں کے درمیان حسنِ سلوک اور ایثار کی تعلیم دی گئی ہے کہ اگر ایک پڑوسی کو دوسرے کی دیوار کا تھوڑا سا سہارا درکار ہو جس سے نقصان نہ ہوتا ہو، تو اسے منع نہیں کرنا چاہیے۔",
    "english": "This Hadith teaches kindness and altruism between neighbors, emphasizing that a person should allow his neighbor to use his wall for support (like fixing a beam) provided it causes no significant harm."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب المظالم",
      "english": "Sahih al-Bukhari, Book of Oppressions"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساقاة",
      "english": "Sahih Muslim, Book of Musaqah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p7U_pG_2Q",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پڑوسی کے حقوق اور اخلاقیات",
        "english": "Rights of Neighbors and Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایثار اور ہمدردی",
              "english": "Altruism and Sympathy"
            },
            "content": {
              "urdu": [
                "اسلام پڑوسی کے ساتھ صرف لڑائی نہ کرنے کا نام نہیں بلکہ اسے فائدہ پہنچانے کا نام ہے۔",
                "اگر ایک پڑوسی اپنی چھت ڈالنے کے لیے دوسرے کی دیوار پر شہتیر رکھنا چاہے تو یہ ایک معمولی ضرورت ہے۔",
                "ایسی چھوٹی باتوں پر پڑوسی کو منع کرنا تنگ نظری اور اسلامی اخلاق کے خلاف ہے۔"
              ],
              "english": [
                "Islam doesn't just mean not fighting with a neighbor, but actively benefiting them.",
                "Using a neighbor's wall to support a roof beam is a minor necessity that should be facilitated.",
                "Refusing such small requests is a sign of narrow-mindedness and contradicts Islamic ethics."
              ]
            }
          },
          {
            "title": {
              "urdu": "پڑوسی کا مقام",
              "english": "The Status of the Neighbor"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے پڑوسی کے حقوق پر اس قدر زور دیا کہ صحابہ کو لگا شاید اسے وراثت میں حصہ دے دیا جائے گا۔",
                "دیوار کا استعمال کرنے دینا اس وسیع تر سماجی تعاون کا ایک حصہ ہے۔",
                "پڑوسی کے آرام و سکون کا خیال رکھنا ایمان کا حصہ قرار دیا گیا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) emphasized neighbors' rights so much that Sahaba thought they might be given inheritance rights.",
                "Allowing the use of a wall is part of this broader social cooperation.",
                "Taking care of a neighbor's comfort is considered a component of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور شرائط",
        "english": "Juristic Aspects and Conditions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان نہ پہنچانے کی شرط",
              "english": "Condition of No Harm"
            },
            "content": {
              "urdu": [
                "یہ اجازت اس وقت ہے جب دیوار اتنی مضبوط ہو کہ لکڑی کا بوجھ سہار سکے۔",
                "اگر لکڑی گاڑنے سے دیوار گرنے یا کمزور ہونے کا خطرہ ہو، تو مالک منع کر سکتا ہے۔",
                "اسلامی قاعدہ ہے: 'لا ضرر ولا ضرار' (نہ خود نقصان اٹھاؤ، نہ دوسرے کو دو)۔"
              ],
              "english": [
                "This permission applies when the wall is strong enough to bear the weight of the beam.",
                "If fixing the beam risks collapsing or weakening the wall, the owner has the right to refuse.",
                "The Islamic maxim is: 'There should be neither harming nor reciprocating harm'."
              ]
            }
          },
          {
            "title": {
              "urdu": "کیا یہ حکم واجب ہے؟",
              "english": "Is this Command Mandatory?"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک اگر نقصان نہ ہو رہا ہو تو پڑوسی کو یہ حق دینا واجب ہے۔",
                "دیگر فقہاء اسے ایک اخلاقی سفارش اور مستحب عمل قرار دیتے ہیں۔",
                "سیدنا ابوہریرہ کا غصہ اور 'کندھوں پر مارنے' کی بات اس حکم کی تاکید کو ظاہر کرتی ہے۔"
              ],
              "english": [
                "Imams Shafi'i and Ahmad consider it obligatory to allow this if no harm is caused.",
                "Other jurists view it as a highly recommended moral act (Mustahabb).",
                "Abu Hurairah's anger and firm language indicate the high importance of this command."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ کا جذبہ",
        "english": "The Zeal of Abu Hurairah (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت پر عمل کی تڑپ",
              "english": "Longing for Applying the Sunnah"
            },
            "content": {
              "urdu": [
                "ابوہریرہ رضی اللہ عنہ لوگوں کو سنت سے دور ہوتے دیکھ کر سخت پریشان ہوتے تھے۔",
                "'کندھوں پر مارنے' سے مراد یہ ہے کہ اگر تم لکڑی دیوار پر نہیں رکھنے دیتے تو میں اسے تمہاری پیٹھ پر لاد دوں گا۔",
                "صحابہ کرام دین کی چھوٹی چھوٹی باتوں کو بھی عملی زندگی میں دیکھنا چاہتے تھے۔"
              ],
              "english": [
                "Abu Hurairah (RA) was deeply distressed when he saw people ignoring the Sunnah.",
                "The metaphor 'between your shoulders' suggests he would force them to bear the responsibility if they refused their neighbor.",
                "The Companions wanted to see every minor detail of the religion implemented in daily life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی رواداری",
              "english": "Mutual Tolerance"
            },
            "content": {
              "urdu": [
                "چھوٹے چھوٹے مالی یا مادی مفادات کے لیے پڑوسیوں سے تعلقات خراب نہیں کرنے چاہئیں۔",
                "خوشگوار ہمسائیگی معاشرتی سکون کی ضمانت ہے۔",
                "دوسروں کی ضرورت میں کام آنا ہی بہترین انسان کی پہچان ہے۔"
              ],
              "english": [
                "Relationships with neighbors should not be ruined over minor material interests.",
                "Pleasant neighborhood relations are a guarantee of social peace.",
                "Being useful in others' times of need is the mark of a superior person."
              ]
            }
          }
        ]
      }
    }
  ]
}