{
  "hadithId": 178,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["1:4:19"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (حمل الأطفال في الصلاة)",
    "babId": 13
  },
  
  "takhreej": {
    "arabic": " صحيح .‏ رواه البخاري (516)‏ ، ومسلم (543)‏ .‏",
    "urdu": "صحیح۔ اسے بخاری (516) اور مسلم (543) نے روایت کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (516) and Muslim (543).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "حَامِلٌ",
      "english": "Carrying",
      "urdu": "گود میں لیے ہوئے"
    },
    {
      "arabic": "أُمَامَةَ بِنْتِ زَيْنَبَ",
      "english": "Umāmah bint Zaynab (the Prophet's granddaughter)",
      "urdu": "امامہ بنت زینب"
    },
    {
      "arabic": "فَإِذَا سَجَدَ وَضَعَهَا",
      "english": "When he prostrated, he put her down",
      "urdu": "جب سجدہ کیا تو اسے نیچے اتار دیا"
    },
    {
      "arabic": "وَإِذَا قَامَ حَمَلَهَا",
      "english": "And when he stood up, he carried her",
      "urdu": "اور جب کھڑے ہوتے تو اٹھا لیا"
    },
    {
      "arabic": "يَؤُمُّ اَلنَّاسَ",
      "english": "He was leading the people",
      "urdu": "وہ لوگوں کی امامت کر رہے تھے"
    },
    {
      "arabic": "اَلْمَسْجِدِ",
      "english": "The mosque",
      "urdu": "مسجد"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ نبی اکرم صلی اللہ علیہ وسلم اپنی نواسی امامہ بنت زینب کو نماز میں اٹھا کر بھی نماز ادا فرماتے تھے۔ آپ ﷺ قیام اور اٹھنے کی حالت میں انہیں اٹھائے رکھتے، اور رکوع و سجدہ میں جانے کے وقت نیچے بٹھا دیتے تھے۔ یہ عمل اس بات کا واضح ثبوت ہے کہ ایسے افعال جو ضرورت کے تحت ہوں اور نماز کے خشوع کو متاثر نہ کریں، نماز کو باطل نہیں کرتے، یہاں تک کہ امامت کی حالت میں بھی۔",
    "english": "This Hadith narrates that the Prophet (ﷺ) would perform prayer while carrying his granddaughter, Umāmah bint Zaynab. He carried her during standing and rising, and put her down when going into Rukū' (bowing) or Sujūd (prostration). This action clearly proves that minor movements done out of necessity, which do not compromise the reverence (Khushu') of the prayer, do not nullify it, even when leading the congregation."
  },
  "references": [
    {
      "arabic": "رواه البخاري (516)",
      "english": "Reported by Al-Bukhārī (516)"
    },
    {
      "arabic": "رواه مسلم (543)",
      "english": "Reported by Muslim (543)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abū Qatādah Al-Anṣārī"
      },
      "slug": "abu-qatadah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں عملِ کثیر کا حکم",
        "english": "The Ruling of Excessive Movement ('Amal Kathīr) in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمل قلیل اور عمل کثیر",
              "english": "Minor and Excessive Movement"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا نواسی کو اٹھانا اور اتارنا ایسا عمل ہے جو نماز میں عملِ کثیر نہیں ہے اور یہ ضرورت کے تحت تھا۔",
                "فقہاء کے نزدیک وہ عمل جو دیکھنے میں بہت زیادہ نہ ہو اور لگاتار نہ ہو، نماز کو باطل نہیں کرتا۔",
                "یہ اس بات کی دلیل ہے کہ نماز میں ضرورت کے تحت چھوٹے موٹے افعال (جیسے دروازہ کھولنا یا جوتے اتارنا) جائز ہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of lifting and placing his granddaughter down is considered minor movement ('Amal Qalīl) done out of necessity.",
                "According to jurists, movement that is not excessive visually and not continuous does not invalidate the prayer.",
                "This proves that minor actions necessary for the prayer (like opening a door or taking off shoes) are permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "شفقت اور سنت",
              "english": "Compassion and Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا اپنی نواسی کو نماز میں اٹھانا، بچوں سے آپ کی غیر معمولی شفقت اور نرمی کو ظاہر کرتا ہے۔",
                "اس عمل سے یہ بھی معلوم ہوتا ہے کہ اگر بچے کا لباس پاک ہو تو اسے اٹھانا نماز کو فاسد نہیں کرتا۔",
                "یہ عمل اس امر پر بھی دلالت کرتا ہے کہ بچوں کا مسجد میں آنا اور نماز میں شامل ہونا جائز ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of carrying his granddaughter during prayer shows his extraordinary compassion and gentleness towards children.",
                "This also teaches that if a child's clothing is pure, carrying them does not invalidate the prayer.",
                "This action further indicates the permissibility of children entering the mosque and being present during prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "امامت اور مقتدیوں پر حکم",
        "english": "Ruling on the Imām and the Followers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام کی نماز کی صحت",
              "english": "Validity of the Imām's Prayer"
            },
            "content": {
              "urdu": [
                "مسلم کی روایت میں اضافہ ہے کہ آپ ﷺ مسجد میں لوگوں کی امامت کر رہے تھے، جو اس حکم کی وسعت کو ظاہر کرتا ہے۔",
                "اگر امام کا عمل صحیح ہو تو اس کے عمل سے مقتدیوں کی نماز باطل نہیں ہوتی۔",
                "یہ اس بات کی دلیل ہے کہ فرض نماز میں بھی ایسا عمل کرنا جائز ہے، بشرطیکہ وہ سنت کے مطابق ہو اور ضرورت کے تحت ہو۔"
              ],
              "english": [
                "Muslim's addition states that the Prophet (ﷺ) was leading the people in the mosque, showing the breadth of this ruling.",
                "If the Imām's action is valid, the prayer of the followers is not invalidated by his actions.",
                "This proves that such an action is permissible even in obligatory prayer, provided it aligns with the Sunnah and is done out of necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "خشوع اور سنت",
              "english": "Reverence (Khushu') and Sunnah"
            },
            "content": {
              "urdu": [
                "امام کو چاہیے کہ وہ ایسا عمل نہ کرے جو مقتدیوں کے خشوع کو مجروح کرے، لیکن یہ عمل چونکہ سنت سے ثابت ہے لہٰذا جائز ہے۔",
                "نماز کی خشوع کا تعلق دل کی حالت سے ہے، ظاہری عمل سے نہیں، جب تک کہ وہ عمل ممنوع نہ ہو۔",
                "مقتدیوں کے لیے ضروری ہے کہ وہ امام کی پیروی کریں اور اس کے عمل پر شک نہ کریں۔"
              ],
              "english": [
                "The Imām should avoid actions that harm the followers' reverence, but this action is permissible as it is confirmed by the Sunnah.",
                "Khushu' in prayer relates to the state of the heart, not outward actions, as long as the action is not prohibited.",
                "It is necessary for the followers to obey the Imām and not doubt his action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت کے پہلو",
        "english": "Aspects of Purification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچوں کا لعاب اور لباس",
              "english": "Children's Saliva and Clothing"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا نواسی کو اٹھانا اس بات کی دلیل ہے کہ چھوٹے بچوں کا جسم اور ان کا لباس پاک ہوتا ہے، جب تک نجاست ظاہر نہ ہو۔",
                "اگر بچے کا جسم یا لباس ناپاک ہو تو اسے اٹھا کر نماز پڑھنا جائز نہیں ہوگا۔",
                "بچوں کو پیار کرنا اور انہیں نماز میں شامل کرنا اس بات کی دلیل ہے کہ اسلام زندگی کے ہر شعبے میں فطرت کے قریب ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of carrying his granddaughter proves that the body and clothes of young children are pure unless impurity is visible.",
                "If the child's body or clothes were impure (Najas), carrying them would not be permissible in prayer.",
                "Showing affection to children and including them in prayer demonstrates that Islam is close to human nature in all aspects of life."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی سنت",
              "english": "The Prophet's (ﷺ) Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر نبی ﷺ کی سنت ہے اور اس میں کسی بھی قسم کے شک کی گنجائش نہیں ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی نماز کو خشوع و خضوع کے ساتھ ادا کریں، لیکن سنت پر عمل کے لیے تخفیف کا فائدہ اٹھائیں۔",
                "اس حدیث پر عمل کرنا سنتِ نبوی ﷺ سے محبت اور اس کی اتباع کی دلیل ہے۔"
              ],
              "english": [
                "This Hadith is clearly the Sunnah of the Prophet (ﷺ) and leaves no room for doubt.",
                "Muslims should perform their prayers with reverence but take advantage of concessions to practice the Sunnah.",
                "Acting upon this Hadith is proof of love for the Prophetic Sunnah and its adherence."
              ]
            }
          }
        ]
      }
    }
  ]
}
