{
  "hadithId": 752,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/11/2"
    ],
    "kitabId": 7,
    "inKitabBab": 11,
    "arabicBook": "بلوغ المرام",
    "babId": 52
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَدِّ اَلْأَمَانَةَ إِلَى مَنْ اِئْتَمَنَكَ, وَلَا تَخُنْ مَنْ خَانَكَ } رَوَاهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَصَحَّحَهُ اَلْحَاكِمُ, وَاسْتَنْكَرَهُ أَبُو حَاتِمٍ اَلرَّازِيُّ",
    "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس کسی نے تمہارے پاس امانت رکھی ہو تو اسے امانت واپس کر دو اور جس نے تیرے ساتھ خیانت کی تو اس کے ساتھ خیانت نہ کر۔“ اسے ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے اور حاکم نے اسے صحیح کہا ہے اور ابوحاتم رازی نے اسے منکر سمجھا ہے۔",
    "english": "Narrated Abu Hurairah (RA): Allah's Messenger (ﷺ) said: 'Return the trust to him who entrusted it to you, and do not betray him who betrays you.' [Reported by Abu Dawud and at-Tirmidhi, who graded it Hasan, and al-Hakim graded it Sahih, but Abu Hatim ar-Razi graded it Munkar]."
  },
  "takhreej": {
    "arabic": "صحيح بشواهده.‏ رواه أبو داود (3535)، والترمذي (1264)، والحاكم (2/46).‏ للحديث شواهد كثيرة تقويه عن أنس وأبي أمامة وأبي بن كعب.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے ابوداؤد (3535) اور ترمذی (1264) نے روایت کیا ہے۔ اس کے کئی شواہد انس اور ابی بن کعب رضی اللہ عنہم سے بھی مروی ہیں۔",
    "english": "Sahih due to supporting evidences. Reported by Abu Dawud (3535), at-Tirmidhi (1264), and al-Hakim. Supporting narrations exist from Anas and Ubayy bin Ka'b (RA)."
  },
  "importantWords": [
    {
      "arabic": "أَدِّ",
      "english": "Return / Fulfill",
      "urdu": "ادا کرو / واپس کرو"
    },
    {
      "arabic": "اَلْأَمَانَةَ",
      "english": "The Trust",
      "urdu": "امانت"
    },
    {
      "arabic": "اِئْتَمَنَكَ",
      "english": "Entrusted you",
      "urdu": "تمہیں امین بنایا"
    },
    {
      "arabic": "لَا تَخُنْ",
      "english": "Do not betray",
      "urdu": "خیانت نہ کرو"
    },
    {
      "arabic": "خَانَكَ",
      "english": "Betrayed you",
      "urdu": "تجھ سے خیانت کی"
    },
    {
      "arabic": "اسْتَنْكَرَهُ",
      "english": "Considered it Munkar",
      "urdu": "اسے منکر قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اخلاقیات کا سنہرا اصول بیان کرتی ہے کہ امانت کی واپسی واجب ہے اور کسی کی خیانت کے جواب میں خیانت کرنا جائز نہیں بلکہ اعلیٰ اخلاق کا مظاہرہ کرنا چاہیے۔",
    "english": "This Hadith establishes a golden moral principle: returning trusts is obligatory, and responding to betrayal with betrayal is prohibited, emphasizing high character instead."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3535)",
      "english": "Sunan Abu Dawud (3535)"
    },
    {
      "arabic": "سنن الترمذي (1264)",
      "english": "Sunan at-Tirmidhi (1264)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FmS3m6qS0YQ",
  "grade": {
    "arabic": "صحيح بشواهده",
    "english": "Sahih (Authentic with supporting chains)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "امانت کی اہمیت و وجوب",
        "english": "Importance and Obligation of Trusts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانت کی واپسی کا حکم",
              "english": "Order to Return Trusts"
            },
            "content": {
              "urdu": [
                "امانت ادا کرنا ایمان کی علامت اور ایک عظیم شرعی فریضہ ہے۔",
                "اللہ تعالیٰ نے قرآن میں بھی امانتیں اہل کے سپرد کرنے کا حکم دیا ہے۔",
                "جو شخص امانت میں خیانت کرتا ہے اس کے ایمان میں نقص پایا جاتا ہے۔"
              ],
              "english": [
                "Returning a trust is a sign of faith and a great religious obligation.",
                "Allah has commanded in the Qur'an to deliver trusts to their owners.",
                "A person who betrays a trust has a deficiency in their faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی اعتماد کا فروغ",
              "english": "Promoting Mutual Trust"
            },
            "content": {
              "urdu": [
                "امانتوں کی بروقت ادائیگی سے معاشرے میں ایک دوسرے پر اعتماد بڑھتا ہے۔",
                "امین ہونا اللہ کے نزدیک اور لوگوں کے درمیان پسندیدہ صفت ہے۔",
                "اسلامی معاشرہ امانت اور دیانت کی بنیاد پر ہی مستحکم ہو سکتا ہے۔"
              ],
              "english": [
                "Timely return of trusts increases mutual confidence in society.",
                "Being trustworthy is a beloved trait with Allah and among people.",
                "An Islamic society can only be stable through trust and integrity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خیانت کا جواب خیانت سے نہیں",
        "english": "No Betrayal in Response to Betrayal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برائی کا بدلہ برائی سے نہیں",
              "english": "Not Repaying Evil with Evil"
            },
            "content": {
              "urdu": [
                "اگر کوئی آپ سے خیانت کرے تو بدلے میں خیانت کرنا جائز نہیں ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی دیانت پر قائم رہے چاہے سامنے والا کیسا ہی ہو۔",
                "خیانت کرنا منافق کی علامت ہے، اس لیے مومن اس سے دور رہتا ہے۔"
              ],
              "english": [
                "If someone betrays you, it is not permissible to betray them in return.",
                "A Muslim must remain honest regardless of the other party's conduct.",
                "Betrayal is a sign of a hypocrite; therefore, a believer avoids it."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی برتری",
              "english": "Moral Superiority"
            },
            "content": {
              "urdu": [
                "خیانت نہ کرنا انسان کی اخلاقی برتری اور مضبوطی کو ظاہر کرتا ہے۔",
                "اسلام دشمنی میں بھی عدل اور دیانتداری کا دامن چھوڑنے سے روکتا ہے۔",
                "برائی کو اچھائی سے دور کرنا ہی نبوی طریقہ کار ہے۔"
              ],
              "english": [
                "Refraining from betrayal demonstrates moral superiority and strength.",
                "Islam prohibits abandoning justice and integrity even in enmity.",
                "Repelling evil with good is the Prophetic methodology."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی پہلو",
        "english": "Juristic and Legal Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسئلہ ظفر کا بیان",
              "english": "The Issue of Self-Help (Zafar)"
            },
            "content": {
              "urdu": [
                "فقہاء نے اس حدیث سے ثابت کیا کہ حق چھیننے والے کا مال خیانت سے نہ لیا جائے۔",
                "اگرچہ اپنا حق لینے کی گنجائش ہے مگر اسے خیانت کا نام نہیں دیا جا سکتا۔",
                "واضح رہے کہ عدالتی طریقہ کار کے ذریعے حق لینا ہی سب سے بہتر ہے۔"
              ],
              "english": [
                "Jurists used this Hadith to argue against taking back rights through betrayal.",
                "While reclaiming rights is allowed, it must not be categorized as betrayal.",
                "It is always better to seek one's rights through formal legal channels."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت کی اقسام",
              "english": "Types of Trusts"
            },
            "content": {
              "urdu": [
                "امانت صرف مال تک محدود نہیں بلکہ راز، مشورہ اور عہد بھی امانت ہے۔",
                "حکومت کے عہدے اور عوامی ذمہ داریاں بھی بڑی امانتیں شمار ہوتی ہیں۔",
                "ہر وہ حق جو کسی دوسرے کا آپ کے پاس ہو، وہ امانت کے زمرے میں ہے۔"
              ],
              "english": [
                "Trust is not limited to wealth; secrets, advice, and oaths are also trusts.",
                "Government positions and public responsibilities are considered major trusts.",
                "Any right belonging to another that is in your possession is a trust."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد و اسباق",
        "english": "Social Benefits and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امن اور سلامتی",
              "english": "Peace and Security"
            },
            "content": {
              "urdu": [
                "دیانتداری معاشرے میں امن اور معاشی سلامتی کی ضامن ہے۔",
                "خیانت کے خاتمے سے باہمی نفرت اور دشمنی کا خاتمہ ہوتا ہے۔",
                "اسلامی تعلیمات انسان کو نفس کی پستی سے نکال کر بلندی کی طرف لے جاتی ہیں۔"
              ],
              "english": [
                "Integrity ensures peace and economic security in a society.",
                "Eliminating betrayal results in the removal of hatred and enmity.",
                "Islamic teachings elevate a person from baseness to higher character."
              ]
            }
          },
          {
            "title": {
              "urdu": "مثالی کردار",
              "english": "Exemplary Character"
            },
            "content": {
              "urdu": [
                "ایک مومن کا کردار لوگوں کے لیے ہدایت کا ذریعہ ہونا چاہیے۔",
                "سچائی اور امانت کی وجہ سے ہی رسول اللہ ﷺ 'امین' کہلاتے تھے۔",
                "اپنے عمل سے اسلام کی سچی تصویر پیش کرنا ہر مسلمان کا فرض ہے۔"
              ],
              "english": [
                "A believer's character should be a source of guidance for others.",
                "The Prophet (ﷺ) was called 'Al-Amin' due to his truthfulness and trust.",
                "Every Muslim must present a true picture of Islam through their actions."
              ]
            }
          }
        ]
      }
    }
  ]
}