{
  "hadithId": 844,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/21"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النکاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5109)، ومسلم (1408)، وأخرجه أبو داود (2066)، والترمذي (1126)، والنسائي (3287)، وابن ماجه (1929).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (5109) اور امام مسلم (1408) نے روایت کیا ہے۔ یہ حکم قرآنی ممانعت (دو بہنوں کو جمع کرنا) کی تشریح و اضافہ ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5109) and Muslim (1408). Also recorded by Abu Dawud, At-Tirmidhi, An-Nasa'i, and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "لَا يُجْمَعُ",
      "english": "Should not be combined",
      "urdu": "جمع نہ کیا جائے"
    },
    {
      "arabic": "عَمَّتِهَا",
      "english": "Her paternal aunt",
      "urdu": "اس کی پھوپھی"
    },
    {
      "arabic": "خَالَتِهَا",
      "english": "Her maternal aunt",
      "urdu": "اس کی خالہ"
    },
    {
      "arabic": "الْمَرْأَةِ",
      "english": "The woman",
      "urdu": "عورت"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    }
  ],
  "summary": {
    "urdu": "اسلام میں کسی شخص کے لیے یہ جائز نہیں کہ وہ بیک وقت ایک عورت اور اس کی پھوپھی یا اس کی خالہ کو اپنے نکاح میں رکھے۔ یہ قریبی رشتوں کی حرمت برقرار رکھنے کے لیے ہے۔",
    "english": "Islam prohibits a man from being simultaneously married to a woman and her paternal or maternal aunt to preserve the sanctity of close kinship ties."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب النكاح، رقم الحديث ٥١٠٩",
      "english": "Sahih Bukhari, Book of Marriage, Hadith No. 5109"
    },
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤٠٨",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1408"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرمتِ جمع کی حکمت",
        "english": "Wisdom Behind Prohibited Combinations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رشتوں میں دراڑ سے بچاؤ",
              "english": "Preventing Rifts in Kinship"
            },
            "content": {
              "urdu": [
                "سوکنوں کے درمیان فطری طور پر رقابت اور حسد پیدا ہونے کا امکان ہوتا ہے۔",
                "اگر پھوپھی اور بھتیجی سوکنیں بن جائیں تو ان کے قریبی تعلقات میں دراڑ آ سکتی ہے۔",
                "اسلام صلہ رحمی اور رشتوں کو جوڑنے پر زور دیتا ہے، توڑنے پر نہیں۔"
              ],
              "english": [
                "Rivalry and jealousy naturally occur between co-wives in a polygamous marriage.",
                "If an aunt and niece become co-wives, it could destroy their close biological bond.",
                "Islam emphasizes maintaining family ties (Silah al-Rahim) rather than causing friction."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآنی حکم کی توسیع",
              "english": "Extension of Quranic Prohibition"
            },
            "content": {
              "urdu": [
                "قرآن کریم نے دو بہنوں کو ایک ساتھ نکاح میں جمع کرنے سے منع فرمایا ہے۔",
                "سنتِ نبوی نے اس حکم کو پھوپھی، بھتیجی اور خالہ، بھانجی تک وسعت دی ہے۔",
                "یہ حدیث ثابت کرتی ہے کہ سنت، قرآن کے احکام کی تشریح اور تکمیل کرتی ہے۔"
              ],
              "english": [
                "The Holy Quran explicitly prohibits marrying two sisters at the same time.",
                "Prophetic Sunnah extended this to paternal/maternal aunts and their nieces.",
                "This Hadith proves that Sunnah explains and completes the rulings of the Quran."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی ضابطہ اور اصول",
        "english": "Shariah Rules and Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیک وقت جمع کرنے کی ممانعت",
              "english": "Prohibition of Simultaneous Union"
            },
            "content": {
              "urdu": [
                "ممانعت صرف ایک ساتھ نکاح میں رکھنے کی ہے، الگ الگ وقت میں نہیں۔",
                "اگر ایک خاتون فوت ہو جائے یا اسے طلاق ہو جائے تو اس کی خالہ یا پھوپھی سے نکاح ممکن ہے۔",
                "یہ ممانعت رشتوں کی حرمت کے احترام میں عارضی طور پر لاگو ہوتی ہے۔"
              ],
              "english": [
                "The prohibition only applies to being married to both at the same time.",
                "If one dies or is divorced, marrying the aunt or niece becomes permissible.",
                "This is a temporary prohibition based on the current marital status of the relative."
              ]
            }
          },
          {
            "title": {
              "urdu": "رضاعی رشتوں پر اطلاق",
              "english": "Application to Foster Relations"
            },
            "content": {
              "urdu": [
                "جو حرمت نسبی رشتوں سے ثابت ہے وہی رضاعی (دودھ شریک) رشتوں سے بھی ہے۔",
                "رضاعی پھوپھی اور بھتیجی کو بھی ایک ساتھ نکاح میں جمع کرنا حرام ہے۔",
                "یہ اصول فقہ اسلامی کا ایک متفقہ قاعدہ ہے جو رشتوں کے تقدس کو پھیلاتا ہے۔"
              ],
              "english": [
                "Prohibitions regarding blood relatives also apply to foster (milk) relatives.",
                "It is forbidden to combine a foster aunt and her foster niece in marriage.",
                "This is an agreed-upon rule in Islamic jurisprudence preserving the sanctity of milk-relations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کی صحت کا حکم",
              "english": "Validity of the Marriage Contract"
            },
            "content": {
              "urdu": [
                "اگر دونوں کا نکاح ایک ہی وقت میں کیا جائے تو دونوں نکاح باطل ہوں گے۔",
                "اگر ایک کے بعد دوسری سے نکاح کیا جائے تو پہلا صحیح اور دوسرا باطل ہوگا۔",
                "دوسرا نکاح ختم کرنا واجب ہے تاکہ شرعی حکم کی خلاف ورزی نہ ہو۔"
              ],
              "english": [
                "If both are married simultaneously in one contract, both marriages are void.",
                "If married sequentially, the first is valid and the second is considered void.",
                "The second marriage must be terminated to avoid violating Shariah law."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاف ورزی کا وبال",
              "english": "Consequences of Violation"
            },
            "content": {
              "urdu": [
                "اس شرعی حکم کی دانستہ خلاف ورزی کرنا بہت بڑا گناہ اور حرام کام ہے۔",
                "ایسا کرنے والے پر توبہ اور فوری علیحدگی اختیار کرنا لازم ہے۔",
                "معاشرتی سطح پر ایسے نکاح کو تسلیم نہیں کیا جائے گا کیونکہ یہ خلافِ سنت ہے۔"
              ],
              "english": [
                "Deliberately violating this Shariah ruling is a major sin and strictly Haram.",
                "The individual must repent and immediately separate from the second wife.",
                "Society must not recognize such a union as it directly contradicts the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاندانی وقار کا تحفظ",
        "english": "Preserving Family Honor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعلقات کی نزاکت",
              "english": "Sensitivity of Relationships"
            },
            "content": {
              "urdu": [
                "خالہ ماں کی جگہ اور پھوپھی باپ کے برابر احترام کی مستحق ہوتی ہے۔",
                "ان کو ایک ہی شوہر کی سوکن بنانا ان کے مقام و مرتبے کے خلاف ہے۔",
                "اسلام نے گھریلو امن کو قائم رکھنے کے لیے یہ حدود مقرر فرمائی ہیں۔"
              ],
              "english": [
                "A maternal aunt is like a mother, and a paternal aunt holds high status like a father.",
                "Making them co-wives under one husband contradicts their respected status.",
                "Islam established these boundaries to ensure domestic peace and respect."
              ]
            }
          },
          {
            "title": {
              "urdu": "رحم کے رشتے کی اہمیت",
              "english": "The Sacredness of the Womb"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے رحم کے رشتوں کو کاٹنے والوں پر لعنت فرمائی ہے۔",
                "شادی جیسے مقدس بندھن کو رشتوں کی تباہی کا ذریعہ نہیں بننا چاہیے۔",
                "یہ حدیث ایک پاکیزہ اور مثالی اسلامی خاندانی ڈھانچے کی بنیاد فراہم کرتی ہے۔"
              ],
              "english": [
                "Allah has cursed those who sever the ties of the womb (kinship).",
                "The sacred bond of marriage should not become a tool for destroying families.",
                "This Hadith provides the foundation for a pure and exemplary Islamic family structure."
              ]
            }
          }
        ]
      }
    }
  ]
}