{
  "hadithId": 935,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1075"],
    "kitabId": 8,
    "inKitabBab": 10,
    "arabicBook": "كتاب الإيلاء والظهار واللعان",
    "babId": 73
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (4/37)، وأبو داود (2213)، والترمذي (1198)، وابن ماجه (2062). وصححه ابن خزيمة وابن الجارود. والحديث حسن بشواهده وقواه الحافظ ابن حجر في فتح الباري.",
    "urdu": "صحیح۔ اسے امام احمد (4/37)، ابوداؤد (2213)، ترمذی (1198) اور ابن ماجہ (2062) نے روایت کیا ہے۔ ابن خزیمہ اور ابن جارود نے اسے صحیح قرار دیا ہے۔ حافظ ابن حجر نے فتح الباری میں اس کی سند کو حسن کہا ہے۔",
    "english": "Sahih. Reported by Ahmad (4/37), Abu Dawud (2213), At-Tirmidhi (1198), and Ibn Majah (2062). Graded Sahih by Ibn Khuzaimah and Ibn al-Jarud. Al-Hafiz Ibn Hajar strengthened its status in Fath al-Bari."
  },
  "importantWords": [
    {
      "arabic": "ظَاهَرْتُ",
      "english": "Pronounced Zihar",
      "urdu": "ظہار کیا"
    },
    {
      "arabic": "حَرِّرْ",
      "english": "Emancipate / Free",
      "urdu": "آزاد کرو"
    },
    {
      "arabic": "مُتَتَابِعَيْنِ",
      "english": "Consecutive",
      "urdu": "پے در پے / مسلسل"
    },
    {
      "arabic": "عِرْقًا",
      "english": "Large basket",
      "urdu": "کھجوروں کا ٹوکرا"
    },
    {
      "arabic": "مِسْكِينًا",
      "english": "Poor person",
      "urdu": "غریب / مسکین"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ظہار (بیوی کو ماں کے مشابہ قرار دینا) کا کفارہ بیان کیا گیا ہے، جو ترتیب وار غلام آزاد کرنا، دو ماہ کے روزے رکھنا، یا ساٹھ مسکینوں کو کھانا کھلانا ہے۔",
    "english": "This Hadith details the expiation (Kaffarah) for Zihar, which follows a sequence: freeing a slave, fasting for two consecutive months, or feeding sixty poor people."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2213)",
      "english": "Sunan Abu Dawud (2213)"
    },
    {
      "arabic": "جامع الترمذي (1198)",
      "english": "Jami' at-Tirmidhi (1198)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سلمة بن صخر البياضي",
        "english": "Salama bin Sakhr al-Bayadi"
      },
      "slug": "salama-bin-sakhr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ظہار کی حقیقت اور حکم",
        "english": "Reality and Ruling of Zihar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظہار کا مفہوم",
              "english": "Meaning of Zihar"
            },
            "content": {
              "urdu": [
                "ظہار کا مطلب یہ ہے کہ شوہر اپنی بیوی کو کہے کہ تو مجھ پر میری ماں کی پشت کی طرح ہے۔",
                "زمانہ جاہلیت میں اسے طلاق تصور کیا جاتا تھا مگر اسلام نے اسے گناہ اور قابلِ کفارہ عمل قرار دیا۔",
                "یہ الفاظ بولنے کے بعد بیوی شوہر پر اس وقت تک حرام رہتی ہے جب تک کفارہ ادا نہ کیا جائے۔"
              ],
              "english": [
                "Zihar is when a husband tells his wife she is like his mother's back to him.",
                "In Jahiliyyah, it was considered a divorce, but Islam made it a sin requiring expiation.",
                "The wife remains forbidden to the husband until the prescribed Kaffarah is fulfilled."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظہار کی ممانعت",
              "english": "Prohibition of Zihar"
            },
            "content": {
              "urdu": [
                "قرآن مجید نے ظہار کو 'منکر' (ناپسندیدہ) اور 'زور' (جھوٹی بات) قرار دیا ہے۔",
                "بیوی کبھی ماں نہیں بن سکتی، لہذا ایسے الفاظ بولنا اللہ کی حدود کی پامالی ہے۔",
                "ایک مسلمان کو اپنی زبان کی حفاظت کرنی چاہیے اور جاہلانہ کلمات سے بچنا چاہیے۔"
              ],
              "english": [
                "The Quran labels Zihar as an 'evil' and 'false' statement.",
                "A wife can never become a mother; thus, such words violate Allah's boundaries.",
                "A Muslim must guard his tongue and avoid uttering words of ignorance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کفارہ ظہار کی ترتیب",
        "english": "Sequence of Kaffarah for Zihar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین درجات",
              "english": "Three Levels"
            },
            "content": {
              "urdu": [
                "کفارہ میں سب سے پہلے ایک مسلمان غلام کو آزاد کرنا فرض ہے اگر استطاعت ہو۔",
                "اگر غلام میسر نہ ہو تو پے در پے (بغیر وقفے کے) دو ماہ کے روزے رکھنا لازم ہیں۔",
                "اگر جسمانی کمزوری کی وجہ سے روزے ناممکن ہوں تو ساٹھ مسکینوں کو کھانا کھلایا جائے گا۔"
              ],
              "english": [
                "The first priority is freeing a Muslim slave if one has the means.",
                "If unavailable, one must fast for two consecutive months without interruption.",
                "If fasting is impossible due to weakness, feeding sixty poor people is required."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفارہ کی سختی کی حکمت",
              "english": "Wisdom Behind the Severity"
            },
            "content": {
              "urdu": [
                "اتنا بڑا کفارہ اس لیے مقرر کیا گیا تاکہ لوگ نکاح کے مقدس رشتے کو مذاق نہ بنائیں۔",
                "سخت سزا انسان کو اپنی زبان قابو میں رکھنے اور غصے پر ضبط کرنے کی تربیت دیتی ہے۔",
                "یہ عمل معاشرے میں خاندانی اقدار کے تحفظ اور بے جا طلاقوں کے سدِ باب کا ذریعہ ہے۔"
              ],
              "english": [
                "Such a heavy expiation ensures people do not mock the sacred bond of marriage.",
                "The severity trains individuals to control their tongues and restrain their anger.",
                "It serves to protect family values and prevent unnecessary marital breakdowns."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی شفقت اور تدریس",
        "english": "Prophetic Compassion and Teaching"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلطی کا اعتراف",
              "english": "Confession of Mistake"
            },
            "content": {
              "urdu": [
                "سلمہ بن صخر نے اپنی غلطی کا برملا اعتراف کیا اور نبی ﷺ سے حل طلب کیا۔",
                "سچا مومن وہی ہے جو گناہ کے بعد شرمندگی محسوس کرے اور اصلاح کی طرف بڑھے۔",
                "آپ ﷺ نے ان کی مجبوریوں کو سنا اور بتدریج آسان حل کی طرف رہنمائی فرمائی۔"
              ],
              "english": [
                "Salama bin Sakhr openly admitted his mistake and sought a solution from the Prophet (ﷺ).",
                "A true believer feels remorse after a sin and moves toward rectification.",
                "The Prophet (ﷺ) listened to his constraints and guided him toward feasible solutions."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے سلمہ کی غربت اور کمزوری دیکھ کر کفارہ میں آسانی فرمائی۔",
                "اسلام ایک ایسا دین ہے جو انسان کی طاقت اور حالات کو ملحوظ خاطر رکھتا ہے۔",
                "کفارہ کا مقصد تذلیل نہیں بلکہ گناہ کی تلافی اور اللہ سے تعلق کی بحالی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) provided ease in expiation after seeing Salama's poverty and weakness.",
                "Islam is a religion that takes human capacity and circumstances into account.",
                "Expiation is not for humiliation but for atonement and restoring the bond with Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کا درست استعمال",
              "english": "Correct Use of Tongue"
            },
            "content": {
              "urdu": [
                "میاں بیوی کو تلخ کلامی کے دوران بھی ہوش و حواس قائم رکھنے چاہئیں۔",
                "جاہلانہ رسم و رواج کی پیروی انسان کو بڑی شرعی مشکل میں ڈال سکتی ہے۔",
                "الفاظ بولنے سے پہلے ان کے قانونی اور شرعی نتائج پر غور کرنا دانشمندی ہے۔"
              ],
              "english": [
                "Spouses must maintain self-control even during heated arguments.",
                "Following ignorant customs can land a person in major legal and religious trouble.",
                "Wisdom lies in considering the legal and Shariah consequences before speaking."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء سے رجوع",
              "english": "Consulting Scholars"
            },
            "content": {
              "urdu": [
                "پیچیدہ مسائل میں اپنی مرضی کرنے کے بجائے مستند علماء سے فتویٰ لینا چاہیے۔",
                "سلمہ بن صخر کا نبی ﷺ کے پاس آنا ہمیں رہنمائی حاصل کرنے کا طریقہ سکھاتا ہے۔",
                "شریعت کے احکام پر عمل پیرا ہو کر ہی ہم اپنی دنیا اور آخرت سنوار سکتے ہیں۔"
              ],
              "english": [
                "In complex matters, one should seek fatwa from authentic scholars instead of personal whims.",
                "Salama's approach to the Prophet (ﷺ) teaches us the method of seeking guidance.",
                "Only by adhering to Shariah rulings can we improve our life here and in the hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}