{
  "hadithId": 380,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/3/43"],
    "kitabId": 2,
    "inKitabBab": 13,
    "arabicBook": "كتاب الصلاة",
    "babId": 23
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (942)‏، ومسلم (839)‏، وهو من أصح الأحاديث في صفة صلاة الخوف.",
    "urdu": "یہ روایت صحیح ہے، اسے امام بخاری (942) اور امام مسلم (839) نے روایت کیا ہے۔ یہ صلاۃ الخوف (خوف کی نماز) کے طریقے کے بارے میں مستند ترین روایات میں سے ایک ہے۔",
    "english": "Sahih. Recorded by Al-Bukhari (942) and Muslim (839). It is one of the most authentic narrations regarding the method of Salat al-Khawf (the Prayer of Fear)."
  },
  "importantWords": [
    {
      "arabic": "غَزَوْتُ",
      "english": "I went to battle",
      "urdu": "میں نے غزوہ کیا"
    },
    {
      "arabic": "فَوَازَيْنَا",
      "english": "We faced (the enemy)",
      "urdu": "ہم دشمن کے آمنے سامنے ہوئے"
    },
    {
      "arabic": "فَصَافَفْنَاهُمْ",
      "english": "We formed ranks against them",
      "urdu": "ہم نے ان کے خلاف صف بندی کی"
    },
    {
      "arabic": "طَائِفَةٌ",
      "english": "A group / party",
      "urdu": "ایک گروہ یا جماعت"
    },
    {
      "arabic": "انْصَرَفُوا",
      "english": "They departed",
      "urdu": "وہ ہٹ گئے یا مڑ گئے"
    },
    {
      "arabic": "لِنَفْسِهِ",
      "english": "For himself",
      "urdu": "اپنے لیے (تنہا)"
    },
    {
      "arabic": "صَلَّى",
      "english": "Prayed",
      "urdu": "نماز پڑھی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں صلاۃ الخوف (جنگ کے دوران نماز) کا ایک طریقہ بیان کیا گیا ہے جس میں لشکر دو حصوں میں تقسیم ہو کر باری باری نبی کریم ﷺ کی اقتدا میں نماز ادا کرتا ہے۔",
    "english": "This Hadith describes one method of Salat al-Khawf (the Prayer of Fear) where the army divides into two groups to pray behind the Prophet (ﷺ) in shifts while maintaining defense."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (942)",
      "english": "Sahih al-Bukhari (942)"
    },
    {
      "arabic": "صحيح مسلم (839)",
      "english": "Sahih Muslim (839)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=AUnV5zU7nC4",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Muttafaqun Alayhi (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صلاۃ الخوف کی حقیقت",
        "english": "Reality of Salat al-Khawf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی اہمیت جنگ میں",
              "english": "Importance of Prayer in War"
            },
            "content": {
              "urdu": [
                "اسلام میں نماز کی اہمیت اتنی ہے کہ اسے جنگ میں بھی ترک نہیں کیا جا سکتا۔",
                "دشمن کے سامنے ہونے کے باوجود باجماعت نماز کا اہتمام دین کی ترجیح ظاہر کرتا ہے۔",
                "یہ طریقہ کار مسلمانوں کے نظم و ضبط اور اللہ پر بھروسے کی عکاسی کرتا ہے۔"
              ],
              "english": [
                "Prayer is so vital in Islam that it cannot be abandoned even during war.",
                "Holding congregational prayer while facing the enemy shows religious priority.",
                "This procedure reflects the discipline and trust in Allah by Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "دفاع اور عبادت کا امتزاج",
              "english": "Combining Defense and Worship"
            },
            "content": {
              "urdu": [
                "صلاۃ الخوف میں ایک گروہ نماز پڑھتا ہے جبکہ دوسرا دشمن کی نگرانی کرتا ہے۔",
                "اس طریقے سے فوج کی دفاعی صلاحیت متاثر نہیں ہوتی اور فریضہ بھی ادا ہو جاتا ہے۔",
                "اسلامی جنگی حکمت عملی میں روحانیت اور عسکری پہلو ساتھ ساتھ چلتے ہیں۔"
              ],
              "english": [
                "In Salat al-Khawf, one group prays while the other monitors the enemy.",
                "This ensures that military readiness remains intact while fulfilling the duty.",
                "Spirituality and military strategy go hand-in-hand in Islamic warfare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کا طریقہ کار",
        "english": "Procedure of the Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باری باری شرکت",
              "english": "Participation in Shifts"
            },
            "content": {
              "urdu": [
                "امام پہلی رکعت ایک گروہ کو پڑھاتا ہے اور دوسری رکعت دوسرے گروہ کو۔",
                "پہلا گروہ اپنی ایک رکعت مکمل کر کے پہرے پر چلا جاتا ہے۔",
                "اس عمل سے تمام سپاہیوں کو امام کے پیچھے نماز پڑھنے کی سعادت ملتی ہے۔"
              ],
              "english": [
                "The Imam leads the first group in one Rak'ah and the second in another.",
                "The first group completes one Rak'ah and then returns to guard duty.",
                "This allow all soldiers the honor of praying behind the Imam."
              ]
            }
          },
          {
            "title": {
              "urdu": "رکعتوں کی تکمیل",
              "english": "Completion of Rak'ahs"
            },
            "content": {
              "urdu": [
                "امام کے سلام پھیرنے کے بعد دونوں گروہ اپنی باقی ماندہ نماز خود پوری کرتے ہیں۔",
                "یہ اس وقت ہوتا ہے جب نماز قصر (دو رکعت) ہو رہی ہو۔",
                "حدیث میں واضح ہے کہ ہر سپاہی نے اپنی دوسری رکعت انفرادی طور پر پڑھی۔"
              ],
              "english": [
                "After the Imam says Taslim, both groups complete their remaining prayer.",
                "This applies specifically when the prayer is shortened (Qasr).",
                "The Hadith clarifies that each soldier performed their second Rak'ah individually."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Jurisprudential Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صلاۃ الخوف کی مختلف صورتیں",
              "english": "Variants of Salat al-Khawf"
            },
            "content": {
              "urdu": [
                "قرآن و حدیث میں صلاۃ الخوف کے چھ سے زائد طریقے مروی ہیں۔",
                "ابن عمر رضی اللہ عنہ کی یہ روایت سب سے زیادہ مستعمل طریقوں میں سے ہے۔",
                "طریقے کا انتخاب دشمن کی سمت اور خطرے کی نوعیت پر منحصر ہوتا ہے۔"
              ],
              "english": [
                "There are over six methods of Salat al-Khawf mentioned in texts.",
                "This narration from Ibn 'Umar is among the most frequently cited methods.",
                "The choice of method depends on the enemy's direction and the threat level."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرکتِ کثیرہ کی رعایت",
              "english": "Allowance for Excessive Movement"
            },
            "content": {
              "urdu": [
                "نماز کے دوران ایک جگہ سے دوسری جگہ جانا عام حالات میں نماز توڑ دیتا ہے۔",
                "مگر خوف کی حالت میں اللہ نے اس حرکت کو معاف فرما دیا ہے۔",
                "یہ حکم ثابت کرتا ہے کہ ضرورت کے تحت شرعی احکام میں لچک موجود ہے۔"
              ],
              "english": [
                "Moving between places during prayer normally invalidates it.",
                "However, in a state of fear, Allah has excused such movements.",
                "This ruling proves that Shariah offers flexibility under necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیت اور نظم و ضبط",
        "english": "Training and Discipline"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اطاعتِ امیر کا سبق",
              "english": "Lesson in Obedience to the Leader"
            },
            "content": {
              "urdu": [
                "جنگ کے دوران اتنی پیچیدہ ترتیب پر عمل کرنا اعلیٰ نظم و ضبط کا ثبوت ہے۔",
                "یہ عمل سپاہیوں میں اطاعت اور صبر کے جذبے کو پروان چڑھاتا ہے۔",
                "مسلمانوں کی کامیابی کا راز ان کی منظم عبادات میں چھپا ہوا ہے۔"
              ],
              "english": [
                "Executing such a complex order during war shows high discipline.",
                "This practice cultivates a spirit of obedience and patience in soldiers.",
                "The secret of Muslim success lies in their organized worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفسیاتی مضبوطی",
              "english": "Psychological Strength"
            },
            "content": {
              "urdu": [
                "میدانِ جنگ میں اللہ کے سامنے سر بسجود ہونا دلوں کو اطمینان دیتا ہے۔",
                "یہ عمل دشمن پر رعب ڈالتا ہے کہ مسلمان موت کے سائے میں بھی رب کو نہیں بھولتے۔",
                "روحانی تعلق ہی وہ طاقت ہے جو عددی برتری پر غالب آتی ہے۔"
              ],
              "english": [
                "Prostrating before Allah on the battlefield brings peace to the heart.",
                "It intimidates the enemy, showing Muslims don't forget their Lord even in danger.",
                "Spiritual connection is the power that overcomes numerical superiority."
              ]
            }
          }
        ]
      }
    }
  ]
}
