{
  "hadithId": 61,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 9 (Chapter 5)"],
    "kitabId": 1,
    "inKitabBab": 5,
    "arabicBook": "كتاب ما جاء في توقيت المسح",
    "babId": 5
  },

  "takhreej": {
    "arabic": "ضعيف.  رواه أبو داود (158) . ",
    "urdu": "ضعیف (درجہ)۔ اسے ابوداؤد (158) نے روایت کیا ہے۔",
    "english": "Da'īf (Weak). Narrated by Abu Dawud (158)."
  },
  "importantWords": [
    {
      "arabic": "أَمْسَحُ عَلَى اَلْخُفَّيْنِ",
      "english": "May I wipe over the Khuffayn",
      "urdu": "کیا میں موزوں پر مسح کر سکتا ہوں"
    },
    {
      "arabic": "نَعَمْ",
      "english": "Yes",
      "urdu": "ہاں"
    },
    {
      "arabic": "يَوْمًا",
      "english": "A day",
      "urdu": "ایک دن"
    },
    {
      "arabic": "ثَلَاثَةً",
      "english": "Three (days)",
      "urdu": "تین دن"
    },
    {
      "arabic": "وَمَا شِئْتَ",
      "english": "And as long as you wish",
      "urdu": "اور جب تک تیری مرضی ہو"
    },
    {
      "arabic": "لَيْسَ بِالْقَوِيِّ",
      "english": "It is not strong",
      "urdu": "یہ قوی نہیں ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث موزوں پر مسح کی مدت کو **غیر محدود** قرار دیتی ہے، مگر اس کی سند کمزور ہے اور یہ ان **صحیح** احادیث کے خلاف ہے جو مسافر اور مقیم کے لیے ایک متعین مدت (تین دن رات اور ایک دن رات) مقرر کرتی ہیں۔",
    "english": "This Hadith suggests an **unlimited duration** for wiping over the Khuffayn, but its chain is weak and contradicts the numerous authentic Ahadith that set specific time limits (three days/nights for the traveler and one day/night for the resident)."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 158",
      "english": "Sunan Abī Dāwūd, The Book of Purification, Hadith 158"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أُبَيِّ بْنِ عِمَارَةَ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Ubayy ibn ʿUmārah (May Allah be pleased with him)"
      },
      "slug": "ubayy-ibn-umarah"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-39-unlimited-wiping",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'īf (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسح کی مدت میں تضاد اور اصول",
        "english": "Contradiction in Wiping Duration and Legal Principle"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعف اور تعارض",
              "english": "Weakness and Contradiction"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسح کی مدت کو 'جب تک تیری مرضی ہو' کہہ کر **غیر محدود** کرتی ہے، جو **صفوان بن عسالؓ اور علی بن ابی طالبؓ** کی قوی اور متفق علیہ احادیث کے خلاف ہے۔",
                "امام ابوداؤد نے خود اس حدیث کو روایت کرنے کے بعد اس کی سند کو **'لیس بالقوی' (قوی نہیں)** کہہ کر اس کی کمزوری واضح کر دی۔",
                "فقہاء کے نزدیک، جب کوئی ضعیف روایت قوی اور صحیح روایات سے ٹکرائے، تو قوی روایت کو ترجیح دی جاتی ہے، اور اس کمزور روایت کو چھوڑ دیا جاتا ہے۔"
              ],
              "english": [
                "This Hadith makes the wiping period **unlimited** with the phrase 'as long as you wish,' which contradicts the strong and agreed-upon Ahadith of Ṣafwān ibn ʿAssāl (RA) and Ali ibn Abī Ṭālib (RA).",
                "Imām Abū Dāwūd himself noted the weakness of the chain after narrating it, saying **'it is not strong (laysa bil-qawiyy)'**.",
                "According to Islamic legal principles, when a weak narration conflicts with strong, authentic ones, the authentic narration is given preference, and the weak one is abandoned."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحیح حکم کی تحدید",
              "english": "The Specific Authentic Ruling"
            },
            "content": {
              "urdu": [
                "صحیح حکم وہی ہے جو مدت کا تعین کرتا ہے: **مسافر کے لیے تین دن راتیں اور مقیم کے لیے ایک دن رات**۔ تمام فقہی مسالک اسی پر متفق ہیں۔",
                "یہ تحدید اس بات کی دلیل ہے کہ اسلام میں طہارت کا اصل حکم پاؤں کو دھونا ہے، اور مسح کی رخصت صرف ایک محدود مدت کے لیے دی گئی ہے۔",
                "نبی ﷺ کا مقصد دین کو آسان بنانا تھا، لیکن رخصت کی حدود متعین کرنا بھی ضروری تھا تاکہ اسے مستقل سنت نہ بنا لیا جائے۔"
              ],
              "english": [
                "The authentic ruling is the one that sets the time limit: **three days and nights for the traveler and one day and night for the resident**. All schools of Fiqh agree on this.",
                "This time limit proves that the original command in Islam is to wash the feet, and the concession of wiping is granted only for a limited period.",
                "The Prophet's (ﷺ) goal was to make the religion easy, but setting limits on the concession was essential so that it would not be adopted as the permanent Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محدود مدت کی حکمت",
        "english": "The Wisdom of the Limited Duration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح کا عارضی حکم",
              "english": "The Temporary Nature of Wiping"
            },
            "content": {
              "urdu": [
                "مسح کی مدت کا تعین اس بات کی دلیل ہے کہ موزوں پر مسح پاؤں دھونے کے **فریضہ کا مستقل نعم البدل نہیں**، بلکہ ایک عارضی رخصت ہے۔",
                "اگر مدت غیر محدود ہوتی، تو لوگ کبھی بھی موزے نہ اتارتے اور پاؤں دھونے کا فریضہ مستقل طور پر چھوٹ جاتا۔",
                "یہ مدت اس بات کو یقینی بناتی ہے کہ ہر مسلمان کو کم از کم تین یا ایک دن بعد ایک بار پاؤں کو مکمل طور پر دھونا پڑے۔"
              ],
              "english": [
                "The setting of a time limit proves that wiping over the socks is not a **permanent substitute for the obligation** of washing the feet, but a temporary concession.",
                "If the duration were unlimited, people might never remove their socks, and the obligation to wash the feet would be permanently abandoned.",
                "This limited time ensures that every Muslim must wash their feet completely at least once after a maximum of one or three days."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصولِ شریعت",
              "english": "Principle of Sharia"
            },
            "content": {
              "urdu": [
                "شریعت میں جو حکم آسانی کے لیے دیا جاتا ہے، وہ ہمیشہ ایک **حدود** کا پابند ہوتا ہے تاکہ لوگ اس میں غلو نہ کریں اور اصل حکم کو نہ چھوڑیں۔",
                "مسح کی مدت کا تعین کرنا اللہ کی طرف سے حکمت ہے، جس میں آسانی اور اصل حکم کو برقرار رکھنا دونوں شامل ہیں۔",
                "جو شخص اس رخصت پر عمل کرنا چاہے، اسے چاہیے کہ وہ صحیح احادیث میں بیان کردہ مدت کی مکمل پابندی کرے۔"
              ],
              "english": [
                "Any ruling granted for ease in the Sharia is always subject to **limits** to prevent people from falling into extremism and abandoning the original command.",
                "Setting a time limit for Mas'h is divine wisdom, encompassing both facilitation and the preservation of the original ruling.",
                "Whoever wishes to utilize this concession must strictly adhere to the time limit stated in the authentic Ahadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور سند پر کلام",
        "english": "Discussion on Narrator and Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابی بن عمارۃؓ کی روایت",
              "english": "The Narration of Ubayy ibn ʿUmārah (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا ابی بن عمارۃ رضی اللہ عنہ سے یہ روایت منقول ہے، لیکن ان کی روایت کردہ اس جملہ ('وَمَا شِئْتَ') کو محدثین نے ضعیف قرار دیا۔",
                "ایک ہی حدیث میں جب اضافہ صحیح اصولوں کے خلاف ہو، تو اس اضافے کو **شاذ** یا **منکر** سمجھا جاتا ہے اور صرف اصل صحیح حکم پر عمل کیا جاتا ہے۔",
                "محدثین کا اس حدیث پر کلام کرنا علم حدیث کی نزاکت اور صحت کی حفاظت میں ان کی سختی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "This narration is attributed to Sayyiduna Ubayy ibn ʿUmārah (RA), but the phrase he narrated ('and as long as you wish') is deemed weak by Hadith scholars.",
                "When an addition to a Hadith contradicts authentic principles, that addition is considered **Shādh (odd)** or **Munkar (rejected)**, and only the original authentic ruling is followed.",
                "The scholars' critique of this Hadith demonstrates the rigor of Ḥadīth science and their strictness in preserving authenticity."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابوداؤد کا تبصرہ",
              "english": "Abu Dawud's Commentary"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد کا یہ کہنا کہ **'لَيْسَ بِالْقَوِيِّ'** اس حدیث کے ضعف کی واضح دلیل ہے اور فقہاء کو اس پر عمل نہ کرنے کی ترغیب دیتا ہے۔",
                "یہ اصول سکھاتا ہے کہ عبادات میں ہمیشہ وہ عمل اختیار کیا جائے جس کی صحت پر قوی ترین محدثین (جیسے بخاری و مسلم) کا اتفاق ہو، نہ کہ ضعیف روایت۔",
                "اس کے برخلاف صحیح احادیث میں مدت کا تعین ہونا، اس کمزور روایت کی نفی کرتا ہے۔"
              ],
              "english": [
                "Imām Abū Dāwūd's statement **'it is not strong'** is a clear indicator of the Hadith's weakness, discouraging jurists from acting upon it.",
                "This principle teaches that in acts of worship, one should always choose the practice authenticated by the strongest authorities (like Bukhari and Muslim), not a weak narration.",
                "The confirmed time limit in authentic Ahadith negates the unlimited duration suggested by this weak report."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں نتیجہ",
        "english": "Conclusion for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لازمی عمل",
              "english": "The Necessary Practice"
            },
            "content": {
              "urdu": [
                "مسلمان کو موزوں پر مسح کے معاملے میں **تین دن رات (مسافر)** اور **ایک دن رات (مقیم)** کی مدت کی پابندی کرنی چاہیے۔",
                "اس مدت کے دوران موزوں پر مسح کرنا درست ہے، اور اس کے بعد موزے اتار کر پاؤں دھو کر نیا وضو کرنا ضروری ہے۔",
                "یہ عمل دین میں آسانی کے ساتھ ساتھ وضو کی کامل طہارت کو یقینی بناتا ہے، جو نماز کی بنیاد ہے۔"
              ],
              "english": [
                "A Muslim must adhere to the time limit for wiping over the socks: **three days and nights (traveler)** and **one day and night (resident)**.",
                "Wiping over the socks is valid during this period, and afterwards, removing the socks, washing the feet, and performing a new Wudu is mandatory.",
                "This practice ensures both ease in the religion and the complete ritual purity of Wudu, which is the foundation of prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجر کی زیادتی",
              "english": "Maximizing Reward"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ رخصت ہے، لیکن اس پر عمل کرنا بھی نبی ﷺ کی سنت کی پیروی ہے اور اس کا اجر بھی ملتا ہے۔",
                "ایک مومن کو چاہیے کہ وہ ہمیشہ ایسے عمل کو ترجیح دے جو قوی اور مستند سنت سے ثابت ہو، تاکہ اس کی عبادت بے عیب ہو۔",
                "صحیح حکم پر عمل کرنا دنیا و آخرت کی کامیابی کی ضمانت ہے۔"
              ],
              "english": [
                "Although this is a concession, acting upon it is also following the Prophet's Sunnah and merits reward.",
                "A believer should always prioritize actions confirmed by the strongest and most authentic Sunnah to ensure their worship is flawless.",
                "Adhering to the correct ruling is a guarantee of success in this world and the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}
