{
  "hadithId": 447,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:458",
      "https://sunnah.com/muslim:956"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (458) في كتاب الصلاة، ومسلم (956) في كتاب الجنائز. والحديث دليل على فضل خدمة المسجد ومشروعية الصلاة على القبر لمن فاتته صلاة الجنازة.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (458) و مسلم (956) میں مروی ہے۔ یہ حدیث مسجد کی خدمت کرنے والوں کی فضیلت اور اگر کسی کی نمازِ جنازہ رہ جائے تو قبر پر نماز پڑھنے کے جواز کی دلیل ہے۔",
    "english": "Authentic. Reported by Bukhari (458) and Muslim (956). This Hadith serves as evidence for the virtue of serving the mosque and the permissibility of offering funeral prayers at the grave for those who missed the initial one."
  },
  "importantWords": [
    {
      "arabic": "تَقُمُّ",
      "english": "Sweeping / Cleaning",
      "urdu": "جھاڑو دینا / صفائی کرنا"
    },
    {
      "arabic": "آذَنْتُمُونِي",
      "english": "Informed me",
      "urdu": "مجھے اطلاع دی"
    },
    {
      "arabic": "صَغَّرُوا",
      "english": "Considered insignificant",
      "urdu": "معمولی خیال کیا"
    },
    {
      "arabic": "دُلُّونِي",
      "english": "Show me / Guide me",
      "urdu": "مجھے راستہ بتاؤ"
    },
    {
      "arabic": "مَمْلُوءَةٌ",
      "english": "Filled up",
      "urdu": "بھری ہوئی"
    },
    {
      "arabic": "ظُلْمَةً",
      "english": "Darkness",
      "urdu": "اندھیرا"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے مسجد کی صفائی کرنے والی ایک سادہ سی عورت کی وفات پر خود قبر پر جا کر جنازہ پڑھا تاکہ اس کی اہمیت واضح ہو اور اس کی قبر روشن ہو جائے۔",
    "english": "The Prophet (ﷺ) personally offered the funeral prayer at the grave of a woman who cleaned the mosque, emphasizing her value and illuminating her grave through his prayer."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (458)",
      "english": "Sahih al-Bukhari (458)"
    },
    {
      "arabic": "صحيح مسلم (956)",
      "english": "Sahih Muslim (956)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسجد کی خدمت کی فضیلت",
        "english": "Virtue of Serving the Mosque"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادنیٰ کام کی اعلیٰ قدر",
              "english": "High Value of Simple Tasks"
            },
            "content": {
              "urdu": [
                "مسجد کی صفائی کرنا اللہ کے نزدیک بہت بڑا اور پسندیدہ عمل ہے۔",
                "نبی ﷺ نے ایک معمولی خادمہ کی اتنی قدر فرمائی کہ خود اس کی قبر پر گئے۔",
                "اسلام میں ظاہری رتبے کے بجائے خلوصِ نیت اور خدمتِ دین کو اہمیت دی جاتی ہے۔"
              ],
              "english": [
                "Cleaning the mosque is a great and beloved act in the sight of Allah.",
                "The Prophet (ﷺ) valued a humble servant so much that he personally visited her grave.",
                "In Islam, sincerity and service to religion are prioritized over social status."
              ]
            }
          },
          {
            "title": {
              "urdu": "غریب طبقے کی دلجوئی",
              "english": "Consoling the Needy"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے صحابہ کو متوجہ کیا کہ کسی مومن کو حقیر نہ سمجھیں۔",
                "مسجد میں جھاڑو دینے والی عورت کا درجہ آپ ﷺ کی نظر میں بہت بلند تھا۔",
                "نبی کریم ﷺ کی یہ سنت معاشرے کے پسے ہوئے طبقے کی عزت افزائی سکھاتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) reminded the companions not to belittle any believer.",
                "The status of the woman who swept the mosque was very high in his eyes.",
                "This Sunnah teaches us to honor and respect the marginalized sections of society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبر پر نمازِ جنازہ",
        "english": "Funeral Prayer at the Grave"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی رخصت",
              "english": "Legal Concession"
            },
            "content": {
              "urdu": [
                "اگر کسی کی نمازِ جنازہ رہ جائے تو تدفین کے بعد قبر پر جنازہ پڑھنا جائز ہے۔",
                "یہ عمل میت کے حق میں دعا اور شفاعت کا ایک طریقہ ہے۔",
                "نبی ﷺ کا یہ فعل امت کے لیے ایک اہم فقہی اصول کی بنیاد ہے۔"
              ],
              "english": [
                "If the initial funeral prayer is missed, it is permissible to pray at the grave.",
                "This act serves as a form of supplication and intercession for the deceased.",
                "The Prophet's (ﷺ) action establishes an important juristic principle for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی اہمیت",
              "english": "Importance of Supplication"
            },
            "content": {
              "urdu": [
                "میت کو وفات کے بعد سب سے زیادہ دعاؤں کی ضرورت ہوتی ہے۔",
                "قبر پر کھڑے ہو کر دعا کرنا اہل قبور کے لیے راحت کا باعث ہے۔",
                "صحابہ کا اسے معمولی سمجھنا ان کی لاعلمی تھی جسے آپ ﷺ نے دور کیا۔"
              ],
              "english": [
                "After death, the deceased is in greatest need of supplications.",
                "Standing and praying at the grave brings immense relief to the occupants.",
                "The companions' initial oversight was corrected by the Prophet's (ﷺ) teaching."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبر کی زندگی اور برکت",
        "english": "Life in the Grave and Blessings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبر کا اندھیرا",
              "english": "Darkness of the Grave"
            },
            "content": {
              "urdu": [
                "قبر کی زندگی ابتدائی طور پر وحشت اور اندھیرے کا مقام ہے۔",
                "نبی ﷺ کی نماز اور دعا سے اللہ ان قبروں کو منور فرما دیتا ہے۔",
                "یہ حدیث برزخی زندگی کی حقیقت اور وہاں کی سختیوں کی طرف اشارہ ہے۔"
              ],
              "english": [
                "The life in the grave is initially a place of isolation and darkness.",
                "Allah illuminates the graves through the Prophet's (ﷺ) prayer and blessing.",
                "The Hadith alludes to the reality of Barzakh and the trials therein."
              ]
            }
          },
          {
            "title": {
              "urdu": "شفاعتِ محمدی ﷺ",
              "english": "Prophetic Intercession"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کی دعا مومنوں کے لیے اللہ کی طرف سے رحمت اور سکون ہے۔",
                "قبر کی تنگی اور اندھیرا نیک اعمال اور دعاؤں سے دور ہوتا ہے۔",
                "نبی ﷺ اپنی امت کے گناہگاروں اور نیکوکاروں دونوں کے لیے خیر خواہ تھے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) prayer is a source of mercy and peace from Allah.",
                "The constriction and darkness of the grave are removed by good deeds and prayers.",
                "The Prophet (ﷺ) was a well-wisher for both the sinners and the righteous of his Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "افراد کی قدر شناسی",
              "english": "Appreciating Individuals"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے ماتحتوں اور خدمت گاروں کی زندگی اور موت کا خیال رکھنا چاہیے۔",
                "کسی کی غیر موجودگی پر اس کے بارے میں دریافت کرنا سنتِ نبوی ہے۔",
                "تعلقات میں خلوص اور وفاداری اسلامی معاشرے کا خاصہ ہے۔"
              ],
              "english": [
                "We must care for the lives and deaths of our subordinates and helpers.",
                "Inquiring about someone in their absence is a noble Prophetic Sunnah.",
                "Sincerity and loyalty in relationships are hallmarks of an Islamic society."
              ]
            }
          },
          {
            "title": {
              "urdu": "مساجد کا احترام",
              "english": "Respect for Mosques"
            },
            "content": {
              "urdu": [
                "مساجد کو صاف رکھنا ہر مسلمان کی ذمہ داری ہونی چاہیے۔",
                "جو لوگ مساجد کی دیکھ بھال کرتے ہیں، وہ اللہ کے خاص بندے ہیں۔",
                "مسجد کی خدمت دنیاوی عہدوں سے کہیں زیادہ افضل اور بابرکت ہے۔"
              ],
              "english": [
                "Keeping mosques clean should be the responsibility of every Muslim.",
                "Those who look after the mosques are special servants of Allah.",
                "Serving the mosque is far superior and more blessed than worldly positions."
              ]
            }
          }
        ]
      }
    }
  ]
}