{
  "hadithId": 1123,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/53"],
    "kitabId": 11,
    "inKitabBab": 2,
    "arabicBook": "كتاب الجهاد",
    "babId": 90
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (3157)، ومالك في الموطأ (1/278). أصل الحديث في البخاري صحيح، والزيادة المذكورة في الموطأ فيها انقطاع بين جعفر بن محمد وعمر بن الخطاب.",
    "urdu": "صحیح۔ اسے امام بخاری (3157) نے روایت کیا ہے۔ امام مالک نے موطا (1/278) میں جعفر بن محمد عن ابیہ کے واسطے سے نقل کیا ہے جو مرسل (منقطع) ہے، مگر اصل واقعہ ثابت ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (3157). The version in Al-Muwatta is interrupted (Munqati') because the sub-narrator did not meet 'Umar bin al-Khattab, but the core fact is authentic."
  },
  "importantWords": [
    {
      "arabic": "الْجِزْيَةُ",
      "english": "Jizyah (Protection Tax)",
      "urdu": "جزیہ (وہ مال جو غیر مسلم شہری ریاست کو دیتے ہیں)"
    },
    {
      "arabic": "مَجُوسِ",
      "english": "Magians / Zoroastrians",
      "urdu": "مجوسی (آتش پرست)"
    },
    {
      "arabic": "هَجَرَ",
      "english": "Hajar (Region in Bahrain)",
      "urdu": "حجر (بحرین کا ایک علاقہ)"
    },
    {
      "arabic": "أَخَذَهَا",
      "english": "He took it",
      "urdu": "آپ ﷺ نے اسے وصول کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ جزیہ صرف اہلِ کتاب (یہود و نصاریٰ) تک محدود نہیں بلکہ مجوسیوں اور دیگر غیر مسلموں سے بھی وصول کیا جا سکتا ہے۔",
    "english": "This Hadith proves that Jizyah is not limited to the People of the Book (Jews and Christians) but can also be collected from Zoroastrians and other non-Muslims."
  },
  "references": [
    {
      "arabic": "رواه البخاري (3157)",
      "english": "Narrated by Al-Bukhari (3157)"
    },
    {
      "arabic": "رواه مالك (42)",
      "english": "Narrated by Malik (42)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الرحمن بن عوف",
        "english": "Abdur-Rahman bin 'Auf"
      },
      "slug": "abdur-rahman-bin-auf"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYmX7G6f48A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جزیہ کا شرعی تصور",
        "english": "The Sharia Concept of Jizyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جزیہ کی تعریف اور مقصد",
              "english": "Definition and Purpose of Jizyah"
            },
            "content": {
              "urdu": [
                "جزیہ وہ رقم ہے جو غیر مسلم شہری اسلامی ریاست کی حفاظت اور خدمات کے بدلے ادا کرتے ہیں۔",
                "یہ صرف ان مردوں پر واجب ہے جو لڑنے کی طاقت رکھتے ہوں، عورتوں اور بچوں پر نہیں۔",
                "اس کے بدلے اسلامی ریاست ان کی جان، مال اور مذہبی آزادی کی ضمانت دیتی ہے۔"
              ],
              "english": [
                "Jizyah is a nominal tax paid by non-Muslim citizens in exchange for protection and state services.",
                "It is only mandatory for adult males capable of fighting, excluding women and children.",
                "In return, the Islamic state guarantees their life, property, and religious freedom."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلِ کتاب اور دیگر غیر مسلم",
              "english": "People of the Book and Others"
            },
            "content": {
              "urdu": [
                "قرآن میں جزیہ کا ذکر یہود و نصاریٰ (اہلِ کتاب) کے حوالے سے آیا ہے۔",
                "اس حدیث سے واضح ہوا کہ مجوسیوں (آتش پرستوں) کا حکم بھی جزیہ کے معاملے میں اہلِ کتاب جیسا ہے۔",
                "سیدنا عمر رضی اللہ عنہ پہلے اس معاملے میں تذبذب کا شکار تھے یہاں تک کہ عبدالرحمٰن بن عوف نے یہ حدیث سنائی۔"
              ],
              "english": [
                "The Quran mentions Jizyah specifically regarding Jews and Christians (People of the Book).",
                "This Hadith clarifies that Zoroastrians follow the same ruling as the People of the Book regarding Jizyah.",
                "Umar (RA) was initially hesitant until Abdur-Rahman bin Auf provided this Prophetic evidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا عبدالرحمٰن بن عوف کی گواہی",
        "english": "The Testimony of Abdur-Rahman bin Auf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ نبوی ﷺ سے استدلال",
              "english": "Argument from Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "جب سیدنا عمر نے صحابہ سے مشورہ کیا، تو عبدالرحمٰن بن عوف نے نبی ﷺ کے عمل کی گواہی دی۔",
                "آپ ﷺ نے خود ہجر کے مجوسیوں سے جزیہ وصول فرما کر ایک ضابطہ طے فرما دیا تھا۔",
                "اس سے معلوم ہوتا ہے کہ سنتِ نبوی قرآن کے احکامات کی تشریح اور وسعت بیان کرتی ہے۔"
              ],
              "english": [
                "When Umar (RA) consulted the Sahaba, Abdur-Rahman bin Auf testified to the Prophet's (ﷺ) practice.",
                "By collecting Jizyah from the Magians of Hajar, the Prophet (ﷺ) established a legal precedent.",
                "This demonstrates how the Sunnah explains and expands upon Quranic injunctions."
              ]
            }
          },
          {
            "title": {
              "urdu": "مجوسیوں کا مقام",
              "english": "Status of the Magians"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا: 'ان کے ساتھ اہلِ کتاب والا معاملہ کرو'۔",
                "اس کا مطلب یہ تھا کہ ان سے جزیہ لیا جائے اور ان کا ذبیحہ اور نکاح ممنوع ہی رہے۔",
                "اسلام نے مختلف مذاہب کے لیے الگ الگ سماجی اور قانونی ضابطے متعین کیے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) said: 'Treat them as you treat the People of the Book'.",
                "This meant accepting Jizyah from them while their slaughtered meat and marriages remained prohibited for Muslims.",
                "Islam defined distinct social and legal regulations for various faiths."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سیاسی پہلو",
        "english": "Juristic and Political Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مسلموں کی شہریت",
              "english": "Citizenship of Non-Muslims"
            },
            "content": {
              "urdu": [
                "جزیہ کی ادائیگی غیر مسلموں کو اسلامی ریاست کا 'ذمی' (محفوظ شہری) بنا دیتی ہے۔",
                "اگر مسلمان اپنی حفاظت کی ذمہ داری پوری نہ کر سکیں، تو جزیہ واپس کرنا لازم ہے۔",
                "تاریخ میں ایسے واقعات موجود ہیں جہاں مسلمانوں نے حفاظت نہ کر پانے پر جزیہ لوٹا دیا۔"
              ],
              "english": [
                "Paying Jizyah grants non-Muslims the status of 'Dhimmi' (protected citizens).",
                "If Muslims fail to provide protection, returning the Jizyah becomes mandatory.",
                "History records instances where Muslim commanders returned Jizyah because they couldn't ensure safety."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدلِ عمرانی",
              "english": "Social Justice"
            },
            "content": {
              "urdu": [
                "جزیہ کوئی جرمانہ نہیں بلکہ ایک انتظامی ٹیکس ہے جو مسلمانوں کی زکوٰۃ کے بدلے ہے۔",
                "مسلمانوں پر فوجی خدمت فرض ہے جبکہ ذمیوں کو اس سے استثناء دیا گیا ہے۔",
                "یہ نظام ایک کثیر مذہبی معاشرے میں توازن برقرار رکھنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Jizyah is not a fine but an administrative tax corresponding to the Zakat paid by Muslims.",
                "Military service is mandatory for Muslims, while Dhimmis are exempted from it.",
                "This system is a tool for maintaining balance in a multi-religious society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشاورت کی اہمیت",
              "english": "Importance of Consultation"
            },
            "content": {
              "urdu": [
                "سیدنا عمر کا صحابہ سے پوچھنا ظاہر کرتا ہے کہ حکمران کو اہل علم سے مشورہ کرنا چاہیے۔",
                "کوئی کتنا ہی بڑا عالم کیوں نہ ہو، اسے دوسروں کی رائے اور علم کی ضرورت رہتی ہے۔",
                "مشورہ کرنے سے فیصلے میں برکت اور درستی پیدا ہوتی ہے۔"
              ],
              "english": [
                "Umar's (RA) consultation with the Sahaba shows that a ruler must seek advice from the learned.",
                "No matter how great a scholar one is, they still need the insights and knowledge of others.",
                "Consultation brings blessing and accuracy to decision-making."
              ]
            }
          },
          {
            "title": {
              "urdu": "دلیل کی پیروی",
              "english": "Following the Evidence"
            },
            "content": {
              "urdu": [
                "جب صحیح دلیل سامنے آجائے، تو انسان کو اپنی سابقہ رائے چھوڑ کر اسے قبول کر لینا چاہیے۔",
                "حق کی تلاش اور اس پر ثابت قدمی ہی مومن کا حقیقی وصف ہے۔",
                "سنتِ رسول ﷺ ہر تنازعے میں حتمی فیصلہ کن حیثیت رکھتی ہے۔"
              ],
              "english": [
                "Once clear evidence appears, one should abandon their previous opinion and accept the truth.",
                "The search for truth and steadfastness upon it is the true quality of a believer.",
                "The Sunnah of the Prophet (ﷺ) holds the final decisive authority in all disputes."
              ]
            }
          }
        ]
      }
    }
  ]
}