{
  "hadithId": 651,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/4"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2237)، ومسلم (1567). والحديث يدل على تحريم هذه المكاسب الثلاثة لخبثها وفساد أصلها.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (2237) اور مسلم (1567) میں موجود ہے۔ یہ ان تینوں ذرائع آمدن کی حرمت پر دلالت کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2237) and Muslim (1567). This Hadith indicates the prohibition of these three earnings due to their impurity."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade / Prohibited",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "ثَمَنِ",
      "english": "Price / Value",
      "urdu": "قیمت"
    },
    {
      "arabic": "الْكَلْبِ",
      "english": "Dog",
      "urdu": "کتا"
    },
    {
      "arabic": "مَهْرِ",
      "english": "Dowry / Earnings",
      "urdu": "اجرت یا کمائی"
    },
    {
      "arabic": "الْبَغِيِّ",
      "english": "Prostitute",
      "urdu": "بدکار عورت"
    },
    {
      "arabic": "حُلْوَانِ",
      "english": "Gift / Sweetener",
      "urdu": "نذرانہ یا مٹھائی"
    },
    {
      "arabic": "الْكاهِنِ",
      "english": "Soothsayer / Fortune teller",
      "urdu": "کاہن یا نجومی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تین قسم کی کمائیوں کو حرام قرار دیا گیا ہے: کتے کی فروخت سے حاصل شدہ رقم، زنا کی اجرت، اور غیب کی خبریں بتانے والے کاہن کا نذرانہ۔",
    "english": "This Hadith prohibits three types of earnings: the sale price of a dog, the wages of prostitution, and the money paid to fortune-tellers."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساقاة",
      "english": "Sahih Muslim, Book of Musaqah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو مسعود الأنصاري",
        "english": "Abu Mas'ud al-Ansari"
      },
      "slug": "abu-masud-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0S1_WvX-oI",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ممنوعہ کمائیوں کی تفصیل",
        "english": "Details of Prohibited Earnings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کتے کی قیمت کی ممانعت",
              "english": "Prohibition of Dog's Price"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک کتے کی خرید و فروخت اور اس کی قیمت حرام ہے۔",
                "اگرچہ شکاری یا حفاظتی کتا رکھنے کی اجازت ہے، مگر اس کی تجارت منع ہے۔",
                "یہ حکم معاشرے کو ناپاک جانوروں کے کاروبار سے دور رکھنے کے لیے ہے۔"
              ],
              "english": [
                "The majority of scholars consider the sale and price of dogs to be haram.",
                "Though keeping dogs for hunting or guarding is allowed, trading them is forbidden.",
                "This ruling keeps the society away from commercializing impure animals."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدکاری کی کمائی",
              "english": "Earnings of Prostitution"
            },
            "content": {
              "urdu": [
                "زنا ایک کبیرہ گناہ ہے اور اس پر لی گئی اجرت بدترین حرام کمائی ہے۔",
                "اسلام پاکیزہ خاندانی نظام اور حلال نکاح کی ترغیب دیتا ہے۔",
                "ایسی کمائی معاشرتی بگاڑ اور اخلاقی پستی کا باعث بنتی ہے۔"
              ],
              "english": [
                "Adultery is a major sin, and wages taken for it are the worst form of haram.",
                "Islam encourages a pure family system and lawful marriage.",
                "Such earnings lead to social corruption and moral degradation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کاہن اور نجومی کا نذرانہ",
        "english": "Offerings to Soothsayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرام نذرانے کی وجہ",
              "english": "Reason for Prohibition"
            },
            "content": {
              "urdu": [
                "کاہن وہ ہے جو غیب کی خبریں بتانے کا جھوٹا دعویٰ کرتا ہے۔",
                "اس کو دی جانے والی رقم باطل کام پر معاوضہ ہے جو کہ حرام ہے۔",
                "یہ عقیدہ توحید کے منافی ہے کیونکہ غیب کا علم صرف اللہ کے پاس ہے۔"
              ],
              "english": [
                "A soothsayer is one who falsely claims to have knowledge of the unseen.",
                "Money given to them is a payment for falsehood, which is strictly haram.",
                "This contradicts Monotheism as only Allah possesses knowledge of the unseen."
              ]
            }
          },
          {
            "title": {
              "urdu": "نجومیت اور جادو کا حکم",
              "english": "Ruling on Astrology and Magic"
            },
            "content": {
              "urdu": [
                "کاہن کے زمرے میں نجومی، جادوگر اور فال نکالنے والے بھی آتے ہیں۔",
                "ان تمام فنون کے ذریعے مال کمانا شرعاً ممنوع اور گناہ ہے۔",
                "مسلمانوں کو ان باطل سہارے ڈھونڈنے کے بجائے اللہ پر توکل کرنا چاہیے۔"
              ],
              "english": [
                "Astrologers, magicians, and fortune-tellers fall under the category of soothsayers.",
                "Earning money through these arts is legally prohibited and sinful in Islam.",
                "Muslims should trust in Allah instead of seeking these false supports."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی اسباق",
        "english": "Juristic and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خبیث اور طیب کا فرق",
              "english": "Difference Between Pure and Impure"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ صرف طیب (پاکیزہ) چیزوں کو ہی قبول فرماتا ہے۔",
                "خبیث ذرائع سے حاصل شدہ مال میں کوئی برکت اور خیر نہیں ہوتی۔",
                "رزق کی تلاش میں حلال و حرام کی تمیز ایمان کا تقاضا ہے۔"
              ],
              "english": [
                "Allah Almighty accepts only that which is pure and wholesome.",
                "Wealth obtained through impure means lacks blessing and goodness.",
                "Distinguishing between Halal and Haram in earnings is a requirement of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اصلاح",
              "english": "Social Reformation"
            },
            "content": {
              "urdu": [
                "یہ حدیث معاشرے سے فحاشی اور توہم پرستی کے خاتمے کا درس دیتی ہے۔",
                "حرام ذرائع آمدن کو روک کر ایک صالح معاشرہ تشکیل دیا جا سکتا ہے۔",
                "دینِ اسلام انسانی وقار کی حفاظت اور پاکیزہ زندگی کا ضامن ہے۔"
              ],
              "english": [
                "This Hadith teaches the eradication of obscenity and superstition from society.",
                "A righteous society can be formed by blocking haram sources of income.",
                "Islam guarantees the protection of human dignity and a pure life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے ہدایات",
        "english": "Guidelines for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تجارت میں احتیاط",
              "english": "Caution in Trade"
            },
            "content": {
              "urdu": [
                "کسی بھی کاروبار کو شروع کرنے سے پہلے اس کے شرعی حکم کا علم حاصل کریں۔",
                "ظاہری فائدے کے پیچھے بھاگنے کے بجائے عاقبت کی فکر کرنی چاہیے۔",
                "حرام مال کا وبال دنیا اور آخرت دونوں میں بھگتنا پڑتا ہے۔"
              ],
              "english": [
                "Learn the Sharia ruling before starting any business or trade.",
                "One should care about the Hereafter rather than chasing apparent worldly gains.",
                "The burden of haram wealth must be faced in both this world and the next."
              ]
            }
          },
          {
            "title": {
              "urdu": "توہم پرستی سے بچاؤ",
              "english": "Avoiding Superstition"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو نجومیوں اور ہاتھ دیکھنے والوں کے پاس جانے سے پرہیز کرنا چاہیے۔",
                "ان کے پاس جانا اور انہیں پیسے دینا گناہ میں تعاون کے مترادف ہے۔",
                "اپنے مسائل کا حل نماز، دعا اور محنت میں تلاش کریں۔"
              ],
              "english": [
                "Muslims should avoid visiting astrologers and palmists.",
                "Going to them and paying them is equivalent to cooperating in sin.",
                "Seek solutions to your problems through prayer, supplication, and hard work."
              ]
            }
          }
        ]
      }
    }
  ]
}