{
  "hadithId": 450,
  "hadithNo": 26,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/26", "muslim/948"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (948)، وأبو داود (3170)، وابن ماجه (1489)، وأحمد (1/277).",
    "urdu": "صحیح۔ اسے امام مسلم (948) نے اپنی صحیح میں روایت کیا ہے۔ اس کے علاوہ ابو داؤد، ابن ماجہ اور احمد نے بھی اسے نقل کیا ہے۔",
    "english": "Sahih. Reported by Muslim (948), Abu Dawud (3170), Ibn Majah (1489), and Ahmad (1/277)."
  },
  "importantWords": [
    {
      "arabic": "مُسْلِمٍ",
      "english": "Muslim",
      "urdu": "مسلمان"
    },
    {
      "arabic": "أَرْبَعُونَ",
      "english": "Forty",
      "urdu": "چالیس"
    },
    {
      "arabic": "لَا يُشْرِكُونَ",
      "english": "Do not associate partners",
      "urdu": "شرک نہیں کرتے"
    },
    {
      "arabic": "شَفَّعَهُمْ",
      "english": "Accept their intercession",
      "urdu": "ان کی شفاعت قبول فرماتا ہے"
    },
    {
      "arabic": "جَنَازَتِهِ",
      "english": "His funeral",
      "urdu": "اس کا جنازہ"
    }
  ],
  "summary": {
    "urdu": "اگر چالیس موحد (شرک نہ کرنے والے) مسلمان کسی مسلمان کے جنازے میں شریک ہوں، تو اللہ ان کی دعا کو اس میت کے حق میں قبول فرما لیتا ہے۔",
    "english": "When forty monotheist Muslims perform the funeral prayer for a deceased Muslim, Allah accepts their supplication as intercession for the deceased."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الجنائز، رقم 948",
      "english": "Sahih Muslim, The Book of Funerals, Hadith 948"
    },
    {
      "arabic": "سنن أبي داود، كتاب الجنائز، رقم 3170",
      "english": "Sunan Abi Dawud, Book of Funerals, Hadith 3170"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0h5HjIeKofA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "توحید کی اہمیت",
        "english": "The Significance of Monotheism"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرک سے پاک نمازی",
              "english": "Participants Free from Shirk"
            },
            "content": {
              "urdu": [
                "حدیث میں چالیس آدمیوں کی شرط کے ساتھ 'لا یشرکون باللہ شیئاً' کے الفاظ نہایت اہم ہیں۔",
                "یہ ظاہر کرتا ہے کہ دعا کی قبولیت کے لیے نمازیوں کا عقیدہ توحید پر مبنی ہونا لازمی ہے۔",
                "موحدین کی دعا اللہ کے ہاں خاص وزن رکھتی ہے اور میت کے لیے نجات کا ذریعہ بنتی ہے۔"
              ],
              "english": [
                "The phrase 'who do not associate anything with Allah' is a crucial condition in this Hadith.",
                "It indicates that for supplication to be accepted, the participants' creed must be based on pure Monotheism.",
                "The prayers of monotheists hold special weight with Allah and serve as a means of salvation for the dead."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاص اور عقیدہ",
              "english": "Sincerity and Creed"
            },
            "content": {
              "urdu": [
                "جنازے میں محض تعداد زیادہ ہونا کافی نہیں بلکہ نمازیوں کا صاحبِ ایمان ہونا ضروری ہے۔",
                "شرک تمام نیک اعمال کو برباد کر دیتا ہے، اسی لیے موحدین کی شفاعت کی بشارت دی گئی ہے۔",
                "یہ حدیث ہمیں اپنے عقائد کی اصلاح اور خالص توحید اپنانے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "Having a large number of people is not enough; the participants must be sincere believers.",
                "Shirk nullifies good deeds, which is why the glad tidings are specific to monotheists.",
                "This Hadith encourages us to rectify our beliefs and adopt pure Monotheism."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنازہ بطورِ شفاعت",
        "english": "Funeral Prayer as Intercession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمازِ جنازہ کا اصل مقصد",
              "english": "Primary Purpose of Funeral Prayer"
            },
            "content": {
              "urdu": [
                "نمازِ جنازہ میت کے حق میں اللہ کے حضور ایک اجتماعی سفارش اور دعا ہے۔",
                "اللہ تعالیٰ اپنے نیک بندوں کی سفارش کو اپنے گناہگار بندوں کے حق میں قبول فرماتا ہے۔",
                "یہ عمل مسلمانوں کے باہمی اتحاد اور ایک دوسرے کی خیر خواہی کا مظہر ہے۔"
              ],
              "english": [
                "The funeral prayer is a collective recommendation and supplication for the deceased before Allah.",
                "Allah accepts the intercession of His righteous servants on behalf of His sinful servants.",
                "This act reflects the unity and mutual goodwill among the Muslim community."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی دعا کی برکت",
              "english": "Blessings of Collective Prayer"
            },
            "content": {
              "urdu": [
                "چالیس کی تعداد ایک بڑی جماعت کی علامت ہے جس کی دعا رد نہیں کی جاتی۔",
                "جتنے زیادہ نیک لوگ جنازے میں شریک ہوں گے، میت کے لیے مغفرت کے امکانات اتنے ہی بڑھ جاتے ہیں۔",
                "اسلام سماجی طور پر ایک دوسرے کے جنازوں میں شرکت کی بھرپور حوصلہ افزائی کرتا ہے۔"
              ],
              "english": [
                "The number forty signifies a significant congregation whose supplication is rarely rejected.",
                "The more righteous people attend a funeral, the greater the chances of forgiveness for the deceased.",
                "Islam strongly encourages attending the funerals of others as a communal duty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسلمانوں کی ذمہ داری",
        "english": "Responsibility of Muslims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیک لوگوں کی صحبت",
              "english": "Company of the Righteous"
            },
            "content": {
              "urdu": [
                "انسان کو زندگی میں نیک اور موحد لوگوں سے تعلقات استوار کرنے چاہئیں۔",
                "تاکہ وفات کے وقت ایسے ہی اللہ والے اس کے جنازے میں شریک ہو کر دعا کریں۔",
                "یہ حدیث میت کے لواحقین کو بھی اچھے لوگوں کو جنازے میں بلانے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "A person should establish relationships with righteous and monotheist people during their life.",
                "So that at the time of death, such people of Allah attend their funeral and pray.",
                "This Hadith encourages the family of the deceased to invite righteous people to the funeral."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنازے میں شرکت کی فضیلت",
              "english": "Virtue of Participating in Funerals"
            },
            "content": {
              "urdu": [
                "جنازے میں شرکت کرنا ایک مسلمان کا دوسرے مسلمان پر اہم شرعی حق ہے۔",
                "اس سے نہ صرف میت کو فائدہ ہوتا ہے بلکہ شریک ہونے والوں کو بھی ثواب ملتا ہے۔",
                "یہ عمل انسان کو اپنی موت کی یاد دلاتا ہے اور آخرت کی تیاری کی فکر پیدا کرتا ہے۔"
              ],
              "english": [
                "Attending a funeral is an important religious right of one Muslim over another.",
                "It not only benefits the deceased but also rewards those who participate.",
                "This act reminds a person of their own death and creates concern for the Hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خالص دعا مانگنا",
              "english": "Sincere Supplication"
            },
            "content": {
              "urdu": [
                "جنازے میں شرکت کے وقت میت کے لیے پوری توجہ اور اخلاص سے دعا کرنی چاہیے۔",
                "میت کی خطاؤں کی معافی اور درجات کی بلندی کے لیے اللہ کے حضور گڑگڑانا سنت ہے۔",
                "ہمارا اخلاص ہی میت کے لیے اللہ کی رحمت کے دروازے کھولنے کا سبب بن سکتا ہے۔"
              ],
              "english": [
                "When participating in a funeral, one should pray for the deceased with full focus and sincerity.",
                "It is Sunnah to beseech Allah for the forgiveness of the deceased's mistakes.",
                "Our sincerity can be the reason for opening the doors of Allah's mercy for the dead."
              ]
            }
          },
          {
            "title": {
              "urdu": "عقیدہِ توحید کی تبلیغ",
              "english": "Preaching Monotheism"
            },
            "content": {
              "urdu": [
                "معاشرے میں توحید کو عام کرنا چاہیے تاکہ ہر مسلمان اس فضیلت کا مستحق بن سکے۔",
                "شرک کی تمام اقسام سے بچنا ہی دنیا اور آخرت میں کامیابی کی ضمانت ہے۔",
                "علماء کو چاہیے کہ وہ عوام کو موحدین کی جماعت کی اہمیت سے آگاہ کریں۔"
              ],
              "english": [
                "Monotheism should be spread in society so every Muslim can be worthy of this virtue.",
                "Avoiding all forms of Shirk is the guarantee of success in this world and the Hereafter.",
                "Scholars should educate the public about the importance of a congregation of monotheists."
              ]
            }
          }
        ]
      }
    }
  ]
}