{
  "hadithId": 133,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["1:2:5"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  
  "takhreej": {
    "arabic": " صحيح.‏ رواه البخاري (536)‏، ومسلم (615)‏.‏ و \"الإبراد\": تأخير صلاة الظهر إلى أن يبرد الوقت.‏ وهو من الأحاديث التي يجمع عليها.‏",
    "urdu": "صحیح۔ اسے بخاری (536) اور مسلم (615) نے روایت کیا ہے۔ \"الإبراد\" (ٹھنڈا کرنا) کا مطلب ہے نماز ظہر کو اس وقت تک مؤخر کرنا جب وقت ٹھنڈا ہو جائے۔ یہ ان احادیث میں سے ہے جن پر اتفاق ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (536) and Muslim (615). 'Al-Ibrād' (cooling down) means delaying the Zuhr prayer until the time cools down. This is one of the narrations agreed upon by the two Sheikhs."
  },
  "importantWords": [
    {
      "arabic": "اِشْتَدَّ",
      "english": "Becomes intense",
      "urdu": "شدید ہو جائے"
    },
    {
      "arabic": "اَلْحَرُّ",
      "english": "The heat",
      "urdu": "گرمی"
    },
    {
      "arabic": "فَأَبْرِدُوا",
      "english": "Then cool down (delay)",
      "urdu": "تو ٹھنڈا کر کے پڑھو"
    },
    {
      "arabic": "بِالصَّلَاةِ",
      "english": "With the prayer (Zuhr)",
      "urdu": "نماز (ظہر) کو"
    },
    {
      "arabic": "شِدَّةَ اَلْحَرِّ",
      "english": "Intensity of the heat",
      "urdu": "گرمی کی شدت"
    },
    {
      "arabic": "فَيْحِ",
      "english": "Expanse/exhalation",
      "urdu": "پھیلاؤ / سانس"
    },
    {
      "arabic": "جَهَنَّمَ",
      "english": "Hellfire",
      "urdu": "جہنم"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث موسم گرما میں ظہر کی نماز کو اس کے اول وقت سے تھوڑا مؤخر کر کے ٹھنڈے وقت میں ادا کرنے کی ترغیب دیتی ہے، تاکہ نمازی خشوع کے ساتھ عبادت کر سکیں۔ اس تاخیر کی وجہ یہ بیان کی گئی کہ شدید گرمی جہنم کی شدت سے ہے۔",
    "english": "This Hadith encourages delaying the Zuhr prayer during intense summer heat until the weather cools down, allowing the worshipper to perform the prayer with proper concentration (Khushu'). The reason given for the intense heat is that it originates from the exhalation of Hellfire."
  },
  "references": [
    {
      "arabic": "رواه البخاري (536)",
      "english": "Reported by Al-Bukhari (536)"
    },
    {
      "arabic": "رواه مسلم (615)",
      "english": "Reported by Muslim (615)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ ‏- رضى الله عنه",
        "english": "Abu Hurayrah (May Allah be pleased with him)"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjK5WzT7mFk",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز ظہر میں 'ابراد' کا حکم",
        "english": "The Command of 'Ibrād' (Cooling) for Zuhr Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں ٹھنڈا کرنے کا مفہوم",
              "english": "Meaning of Cooling Down the Prayer"
            },
            "content": {
              "urdu": [
                "ابراد کا مطلب ہے ظہر کی نماز کو اس کے اول وقت سے مؤخر کرنا جب تک گرمی کی شدت کم ہو جائے۔",
                "یہ حکم خاص طور پر گرم علاقوں اور سخت گرمی کے موسموں کے لیے دیا گیا ہے۔",
                "ٹھنڈا کر کے پڑھنے سے نمازی آرام سے اور یکسوئی کے ساتھ اپنی عبادت مکمل کر سکتا ہے۔"
              ],
              "english": [
                "Ibrād means delaying the Zuhr prayer from its earliest time until the intensity of the heat subsides.",
                "This ruling is given specifically for hot regions and seasons of severe heat.",
                "Praying when it is cool allows the worshipper to complete their devotion comfortably and with concentration."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشقت میں آسانی",
              "english": "Easing Hardship"
            },
            "content": {
              "urdu": [
                "یہ حکم اسلام کے اس اصول پر مبنی ہے کہ عبادت میں مشقت کو کم کیا جائے تاکہ خشوع برقرار رہے۔",
                "شدید گرمی میں باہر نکلنا اور خشوع برقرار رکھنا مشکل ہوتا ہے۔",
                "تاخیر کا یہ وقت عام طور پر زوال کے بعد اور عصر کے وقت سے پہلے کا ہوتا ہے۔"
              ],
              "english": [
                "This command is based on the Islamic principle of reducing hardship in worship to maintain reverence (Khushu').",
                "It is difficult to go out and maintain focus during intense heat.",
                "This delay usually occurs after the zenith (Zawāl) but before the time for 'Asr begins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گرمی کا ماخذ اور حکمت",
        "english": "Source and Wisdom of the Heat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جہنم کا سانس",
              "english": "The Exhalation of Hellfire"
            },
            "content": {
              "urdu": [
                "حدیث میں بتایا گیا ہے کہ گرمی کی شدت دراصل جہنم کے سانس (فیح) کی وجہ سے ہے۔",
                "یہ اللہ کی قدرت اور جہنم کی ہولناکی کی یاد دہانی ہے کہ دنیا کی گرمی بھی اس کے مقابلے میں کچھ نہیں۔",
                "یہ مومن کو آخرت کی فکر اور عذاب سے بچنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The Hadith explains that the intensity of the heat is due to the exhalation (fayh) of Hellfire.",
                "This is a reminder of Allah's power and the terror of Hell, as even the world's heat is negligible compared to it.",
                "It encourages the believer to think about the Hereafter and strive to avoid punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبعی اور شرعی حکمت",
              "english": "Natural and Juristic Wisdom"
            },
            "content": {
              "urdu": [
                "گرمی کی شدت میں تاخیر سے جہاں جسمانی مشقت کم ہوتی ہے، وہیں یہ اللہ کی طرف سے رحمت بھی ہے۔",
                "شرعی حکم کا مقصد یہ ہے کہ نمازی مسجد تک جاتے ہوئے یا نماز ادا کرتے ہوئے بے آرام نہ ہو۔",
                "اس سے معلوم ہوتا ہے کہ اسلام فطرت کے مطابق آسانی کا دین ہے۔"
              ],
              "english": [
                "Delaying the prayer in intense heat reduces physical hardship and is an act of mercy from Allah.",
                "The legal purpose is to prevent the worshipper from being uncomfortable while going to the mosque or performing the prayer.",
                "This shows that Islam is a religion of ease that aligns with human nature."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور اطلاق",
        "english": "Juristic Difference and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فقہاء کا اتفاق اور اختلاف",
              "english": "Scholarly Consensus and Difference"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء اس بات پر متفق ہیں کہ شدید گرمی میں ظہر کی نماز کو مؤخر کرنا مستحب ہے۔",
                "اختلاف یہ ہے کہ یہ حکم صرف جماعت کے لیے ہے یا اکیلے نماز پڑھنے والے کے لیے بھی۔",
                "صحیح قول یہ ہے کہ یہ حکم ہر اس شخص کے لیے ہے جسے گرمی کی وجہ سے مشقت ہو۔"
              ],
              "english": [
                "The majority of jurists agree that delaying the Zuhr prayer during intense heat is recommended (Mustahabb).",
                "The difference lies in whether this ruling applies only to congregational prayer or also to an individual praying alone.",
                "The correct view is that this command applies to anyone who experiences hardship due to the heat."
              ]
            }
          },
          {
            "title": {
              "urdu": "گرمی کا معیار",
              "english": "The Standard for Heat"
            },
            "content": {
              "urdu": [
                "گرمی کی شدت کا معیار ہر علاقے اور موسم کے لحاظ سے مختلف ہو سکتا ہے، جس کا فیصلہ وہاں کے لوگ کرتے ہیں۔",
                "ابراد کا وقت وہ ہے جب سایہ پھیل جائے اور دیواروں کا سایہ نمایاں ہونے لگے۔",
                "اس حکم پر عمل کرنے کا مقصد دل کی حضوری اور عبادت میں سکون کو یقینی بنانا ہے۔"
              ],
              "english": [
                "The standard for intense heat can vary by region and season, determined by the local people's experience.",
                "The time for Ibrād is when the shade extends and the shadow of the walls becomes noticeable.",
                "The purpose of following this rule is to ensure presence of heart and peace in worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی سبق",
        "english": "Spiritual and Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خشوع اور یکسوئی",
              "english": "Reverence (Khushu') and Focus"
            },
            "content": {
              "urdu": [
                "یہ حدیث سکھاتی ہے کہ دین میں اصل اہمیت نماز کے ظاہری عمل سے زیادہ اس میں خشوع کی ہے۔",
                "اگر مشقت کی وجہ سے خشوع کم ہو تو اللہ نے آسانی کا راستہ اختیار کرنے کا حکم دیا۔",
                "مسلمان کو اپنی عبادت کو بہترین طریقے سے ادا کرنے کے لیے حالات سازگار بنانے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "This Hadith teaches that the real importance in religion lies in the reverence (Khushu') during prayer, more than the outward act.",
                "If Khushu' is reduced due to hardship, Allah has commanded us to adopt the easier path.",
                "A Muslim should strive to make conditions conducive to performing their worship in the best possible manner."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت میں ربط",
              "english": "Connection in Worship"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں دنیاوی مشقتوں کو اخروی حقیقتوں (جہنم) سے جوڑ کر سوچنے کی تعلیم دیتی ہے۔",
                "گرمی کی یاد دہانی آخرت کی تیاری کی طرف متوجہ کرتی ہے۔",
                "عبادت کے احکام میں حکمتیں اور ربانی تدابیر موجود ہوتی ہیں۔"
              ],
              "english": [
                "This Hadith teaches us to connect worldly hardships to the realities of the Hereafter (Hellfire).",
                "The reminder of the heat directs our attention towards preparing for the Afterlife.",
                "There are wisdoms and divine provisions present within the commands of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
