{
  "hadithId": 966,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/966",
      "muslim/1453"
    ],
    "kitabId": 8,
    "inKitabBab": 13,
    "arabicBook": "كتاب الرضاع",
    "babId": 76
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (1453) في كتاب الرضاع، باب رضاعة الكبير. وأخرجه النسائي (3321) وابن ماجه (1943) وأحمد (6/212).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام مسلم (1453) نے کتاب الرضاع میں روایت کیا ہے۔ یہ واقعہ 'رضاعتِ کبیر' (بڑے کو دودھ پلانا) کے حوالے سے کتبِ حدیث میں مشہور ہے۔",
    "english": "Sahih. Reported by Muslim (1453) in the Book of Suckling. Also reported by An-Nasa'i, Ibn Majah, and Ahmad. This incident is famously known as the case of 'Suckling an Adult'."
  },
  "importantWords": [
    {
      "arabic": "مَوْلَى",
      "english": "Freed slave",
      "urdu": "آزاد کردہ غلام"
    },
    {
      "arabic": "بَلَغَ",
      "english": "Reached (puberty)",
      "urdu": "پہنچ گیا / بالغ ہو گیا"
    },
    {
      "arabic": "أَرْضِعِيهِ",
      "english": "Suckle him",
      "urdu": "اسے دودھ پلا دو"
    },
    {
      "arabic": "تَحْرُمِي",
      "english": "You become forbidden",
      "urdu": "تم حرام ہو جاؤ گی (نکاح کے لیے)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ایک خاص واقعے کا ذکر ہے جہاں نبی ﷺ نے ایک بالغ شخص کے لیے رضاعت کے ذریعے محرمیت ثابت کرنے کی اجازت دی تاکہ وہ جس گھر میں پلا بڑھا ہے وہاں بے تکلف رہ سکے۔",
    "english": "This Hadith mentions a specific case where the Prophet (ﷺ) allowed establishing Mahram status for an adult through suckling, so he could continue living with his foster family."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1453)",
      "english": "Reported by Muslim (1453)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "واقعہ سالم اور رضاعتِ کبیر",
        "english": "Case of Salim and Adult Suckling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سالم مولیٰ ابی حذیفہ کا پس منظر",
              "english": "Background of Salim"
            },
            "content": {
              "urdu": [
                "سالم کو ابوحذیفہؓ نے بیٹا بنا رکھا تھا اور وہ ان کے گھر میں ایک فرد کی طرح رہتے تھے۔",
                "جب متبنیٰ (لے پالک بیٹے) کا قانون ختم ہوا تو پردے کے مسائل پیدا ہوئے۔",
                "سیدہ سھلہؓ (ابوحذیفہ کی بیوی) پریشان تھیں کیونکہ سالم کو الگ کرنا مشکل تھا۔"
              ],
              "english": [
                "Salim was adopted by Abu Hudhaifah (RA) and lived like a family member.",
                "When the law of legal adoption was abolished, issues of Hijab arose.",
                "Sahlah (RA), the wife of Abu Hudhaifah, was concerned as Salim could not easily be separated from the home."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا حل",
              "english": "The Prophet's (ﷺ) Solution"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس پیچیدہ صورتحال کا حل یہ بتایا کہ سالم کو دودھ پلا دیا جائے۔",
                "اس سے سالم اور سھلہؓ کے درمیان رضاعی ماں بیٹے کا رشتہ قائم ہو گیا۔",
                "یہ اجازت سالم کے لیے ایک خاص رعایت تھی تاکہ وہ اسی گھر میں رہ سکیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) solved this complex situation by instructing her to suckle Salim.",
                "This established a foster mother-son relationship between Sahlah and Salim.",
                "This permission was a specific concession for Salim to continue residing in that household."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی بحث: کیا یہ عام حکم ہے؟",
        "english": "Juristic Debate: Is it a General Rule?"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور کا موقف",
              "english": "The Majority View"
            },
            "content": {
              "urdu": [
                "جمہور علماء اور ازواج مطہرات (سوائے سیدہ عائشہ) کے نزدیک یہ سالم کے ساتھ خاص تھا۔",
                "رضاعت کی حرمت صرف اسی صورت میں ثابت ہوتی ہے جب وہ ڈھائی سال سے کم عمر میں ہو۔",
                "عام حالات میں بڑے آدمی کو دودھ پلانے سے محرمیت ثابت نہیں ہوتی۔"
              ],
              "english": [
                "Majority of scholars and the Mothers of the Believers (except Aishah) believe this was specific to Salim.",
                "Foster prohibition is only established if suckling occurs under the age of two or two and a half years.",
                "In normal circumstances, suckling an adult does not create a Mahram relationship."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدہ عائشہؓ کا اجتہاد",
              "english": "Aishah's (RA) Interpretation"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہؓ اس حدیث کو عام سمجھتی تھیں اور ضرورت کے وقت اس پر عمل کی قائل تھیں۔",
                "تاہم دیگر ازواجِ مطہرات نے ان کے اس موقف سے اتفاق نہیں فرمایا۔",
                "فقہِ اسلامی میں جمہور کی رائے کو ہی ترجیح دی جاتی ہے کہ رضاعت بچپن کے لیے ہے۔"
              ],
              "english": [
                "Aishah (RA) viewed this Hadith as a general rule and applied it in cases of necessity.",
                "However, the other wives of the Prophet (ﷺ) did not agree with her interpretation.",
                "In Islamic Jurisprudence, the majority view prevails: that suckling is only valid during infancy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور معاشرتی اثرات",
        "english": "Wisdom and Social Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی ضرورت کا لحاظ",
              "english": "Consideration of Human Needs"
            },
            "content": {
              "urdu": [
                "یہ واقعہ ظاہر کرتا ہے کہ اسلام انسانی جذباتی اور سماجی ضرورتوں کو اہمیت دیتا ہے۔",
                "سالم جس گھر میں پلا بڑھا تھا، وہاں سے اسے نکالنا ایک بڑا صدمہ ہوتا۔",
                "شریعت نے ایک غیر روایتی راستے سے ان کی خاندانی وحدت کو بچایا۔"
              ],
              "english": [
                "This incident shows that Islam values human emotional and social needs.",
                "Expelling Salim from the house where he grew up would have been traumatic.",
                "Shariah preserved their family unity through an unconventional legal path."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعلیٰ اخلاق اور حیا",
              "english": "High Morals and Modesty"
            },
            "content": {
              "urdu": [
                "سیدہ سھلہؓ کا پریشان ہونا ان کی اعلیٰ درجے کی حیا اور تقویٰ کی دلیل ہے۔",
                "صحابہ کرام ہر چھوٹے بڑے معاملے میں اللہ کے رسول کی طرف رجوع کرتے تھے۔",
                "نبوی رہنمائی ہر قسم کی معاشرتی الجھنوں کا شافی علاج فراہم کرتی ہے۔"
              ],
              "english": [
                "Sahlah's (RA) concern is proof of her high level of modesty and piety.",
                "The Companions turned to the Messenger of Allah for every matter, big or small.",
                "Prophetic guidance provides effective solutions for all social complications."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتویٰ اور حالات کی رعایت",
              "english": "Fatwa and Circumstances"
            },
            "content": {
              "urdu": [
                "کبھی کبھی خاص حالات میں مفتی خاص رخصت دے سکتا ہے جو عام قانون نہیں بنتی۔",
                "دین میں سختی کے بجائے آسانی پیدا کرنا اللہ کو پسند ہے۔",
                "علماء کے درمیان علمی اختلاف دین کی وسعت اور رحمت کی علامت ہے۔"
              ],
              "english": [
                "Sometimes, in specific circumstances, a Mufti can grant a specific concession that doesn't become a general law.",
                "Allah loves making things easy in religion rather than difficult.",
                "Scholarly disagreements are a sign of the vastness and mercy of the faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحقیق کی ضرورت",
              "english": "Necessity of Research"
            },
            "content": {
              "urdu": [
                "ایسی روایات کو بغیر سیاق و سباق کے بیان کرنا گمراہی کا باعث بن سکتا ہے۔",
                "ہمیشہ مستند شارحینِ حدیث کی تشریحات کو سامنے رکھنا چاہیے۔",
                "سنتِ رسول کی گہرائی تک پہنچنے کے لیے علم اور فہمِ سلف ضروری ہے۔"
              ],
              "english": [
                "Citing such narrations without context can lead to misunderstanding.",
                "Explanations from authentic Hadith commentators should always be consulted.",
                "To reach the depth of the Prophet's Sunnah, knowledge and the understanding of the Salaf are essential."
              ]
            }
          }
        ]
      }
    }
  ]
}