{
  "hadithId": 1025,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/34"],
    "kitabId": 9,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام",
    "babId": 82
  },
 
  "takhreej": {
    "arabic": "ضعيف جداً مرفوعاً وصح موقوفاً. رواه البزار (1849) والحاكم (255) وصححه فوهم، فإن فيه كوثر بن حكيم وهو متروك. وصح عن علي رضي الله عنه موقوفاً عند ابن أبي شيبة (15/347) والحاكم (2/155).",
    "urdu": "یہ روایت مرفوعاً (نبی ﷺ کے قول کے طور پر) سخت ضعیف ہے کیونکہ اس میں کوثر بن حکیم متروک راوی ہے۔ البتہ سیدنا علی رضی اللہ عنہ سے موقوفاً (ان کے اپنے قول کے طور پر) یہ احکام صحیح سند کے ساتھ ثابت ہیں، جو جنگِ جمل اور صفین کے موقع پر نافذ کیے گئے۔",
    "english": "Extremely weak as a Marfu' tradition due to Kawthar bin Hakim (rejected). However, it is authentically established as a Mawquf report from 'Ali (RA) via Ibn Abi Shaybah and Al-Hakim, reflecting the practical ethics of dealing with internal rebellion."
  },
  "importantWords": [
    {
      "arabic": "بَغَى",
      "english": "Rebelled / Transgressed",
      "urdu": "بغاوت کی"
    },
    {
      "arabic": "لَا يُجْهَزُ",
      "english": "Shall not be finished off",
      "urdu": "ختم نہیں کیا جائے گا"
    },
    {
      "arabic": "أَسِيرُ",
      "english": "Captive / Prisoner",
      "urdu": "قیدی"
    },
    {
      "arabic": "هَارِبُ",
      "english": "Fugitive / Fleeing person",
      "urdu": "بھاگنے والا"
    },
    {
      "arabic": "فَيْؤُهَا",
      "english": "Spoils / Property",
      "urdu": "ان کا مال / غنیمت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث (اور آثارِ صحابہ) میں مسلمانوں کے باغی گروہ کے ساتھ جنگ کے اخلاقی ضوابط بیان کیے گئے ہیں کہ انہیں کفار کی طرح ڈیل نہیں کیا جائے گا بلکہ ان کی جان و مال کا احترام برقرار رہے گا۔",
    "english": "This Hadith outlines the ethical code for dealing with Muslim rebels: unlike disbelieving enemies, their wounded are spared, captives aren't killed, and their property isn't seized as war booty."
  },
  "references": [
    {
      "arabic": "رواه الحاكم (2/155)",
      "english": "Reported by Al-Hakim (2/155)"
    },
    {
      "arabic": "أخرجه ابن أبي شيبة (15/347)",
      "english": "Reported by Ibn Abi Shaybah (15/347)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6o9l6Kts",
  "grade": {
    "arabic": "ضعيف جدا مرفوعا، صحيح موقوفا",
    "english": "Very Weak Marfu', Sahih Mawquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "باغی گروہ کے حقوق",
        "english": "Rights of the Rebel Group"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زخمیوں اور قیدیوں کی رعایت",
              "english": "Mercy for Wounded and Captives"
            },
            "content": {
              "urdu": [
                "مسلمان باغی کے زخمی ہونے کی صورت میں اسے قتل کرنا جائز نہیں ہے۔",
                "قیدیوں کو بھی قتل نہیں کیا جائے گا کیونکہ وہ اصلا مسلمان ہی ہیں۔",
                "جنگ کا مقصد صرف فتنے کو دبانا ہے نہ کہ مسلمانوں کا قتلِ عام۔"
              ],
              "english": [
                "It is forbidden to kill a wounded Muslim rebel on the battlefield.",
                "Captives are not to be executed as they remain part of the Ummah.",
                "The goal of conflict is to suppress fitnah, not to annihilate Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "بھاگنے والوں کا تعاقب",
              "english": "Pursuit of the Fleeing"
            },
            "content": {
              "urdu": [
                "اگر باغی میدان چھوڑ کر بھاگ جائے تو اس کا پیچھا نہیں کیا جائے گا۔",
                "جب وہ لڑائی سے دستبردار ہو جائیں تو ان پر تلوار اٹھانا حرام ہے۔",
                "اسلام انفرادی جانوں کے تحفظ کو ہر حال میں فوقیت دیتا ہے۔"
              ],
              "english": [
                "If a rebel flees the battlefield, they should not be pursued or hunted.",
                "Once they withdraw from fighting, drawing a sword against them is haram.",
                "Islam prioritizes the protection of individual lives in all circumstances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مال و متاع کی شرعی حیثیت",
        "english": "Legal Status of Property"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالِ غنیمت کی ممانعت",
              "english": "Prohibition of War Booty"
            },
            "content": {
              "urdu": [
                "باغی مسلمانوں کا مال 'مالِ غنیمت' کے طور پر تقسیم نہیں کیا جا سکتا۔",
                "ان کا مال ان کے ورثاء کا حق ہے اور اسے چھیننا ناجائز ہے۔",
                "سیدنا علی نے اپنی جنگوں میں باغیوں کے اموال تقسیم کرنے سے روکا۔"
              ],
              "english": [
                "The property of Muslim rebels cannot be distributed as war booty.",
                "Their wealth belongs to their heirs and seizing it is unlawful.",
                "Ali (RA) strictly forbade the distribution of rebels' assets during conflicts."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین اور بچوں کا تحفظ",
              "english": "Protection of Women and Children"
            },
            "content": {
              "urdu": [
                "باغیوں کی خواتین اور بچوں کو قیدی یا لونڈی غلام نہیں بنایا جائے گا۔",
                "ان کے ساتھ وہی سلوک ہوگا جو عام مسلمان شہریوں کے ساتھ ہوتا ہے۔",
                "یہ اسلامی جنگی اخلاقیات کا ایک منفرد اور عظیم باب ہے۔"
              ],
              "english": [
                "Family members of rebels shall not be enslaved or taken as captives.",
                "They retain the status and rights of ordinary Muslim citizens.",
                "This represents a unique and noble chapter in Islamic war ethics."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فتنے کے وقت مسلمانوں کا رویہ",
        "english": "Conduct During Internal Strife"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اصلاح اور صلح کی کوشش",
              "english": "Efforts for Reform and Peace"
            },
            "content": {
              "urdu": [
                "لڑائی سے پہلے باغیوں کے شکوک و شبہات دور کرنا ضروری ہے۔",
                "قرآن کا حکم ہے کہ مسلمانوں کے دو گروہوں میں صلح کرائی جائے۔",
                "طاقت کا استعمال آخری حربے کے طور پر ہونا چاہیے۔"
              ],
              "english": [
                "It is necessary to address the doubts of rebels before initiating force.",
                "The Quran commands making peace between two conflicting Muslim groups.",
                "The use of force must only be a final resort to restore order."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکفیر سے بچنا",
              "english": "Avoiding Excommunication (Takfir)"
            },
            "content": {
              "urdu": [
                "محض بغاوت یا سیاسی اختلاف کی بنا پر کسی کو کافر نہیں کہا جا سکتا۔",
                "باغی گروہ کو بھی 'مومن' ہی مخاطب کیا گیا ہے جیسا کہ قرآن میں ہے۔",
                "امت کے اتحاد کو بچانا ہر مصلح کی اولین ترجیح ہونی چاہیے۔"
              ],
              "english": [
                "One cannot declare a Muslim a disbeliever due to political rebellion.",
                "Rebel groups are still addressed as 'believers' in the Holy Quran.",
                "Preserving the unity of the Ummah must be the priority of every reformer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیاسی اور قانونی اسباق",
        "english": "Political and Legal Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمران کی ذمہ داری",
              "english": "Responsibility of the Ruler"
            },
            "content": {
              "urdu": [
                "حکمران کو چاہیے کہ وہ باغیوں کے ساتھ بھی عدل و انصاف سے کام لے۔",
                "انتقامی کارروائیوں کے بجائے اصلاحی رویہ اپنایا جائے۔",
                "قانون کی عملداری کے لیے جذبات پر قابو رکھنا لازمی ہے۔"
              ],
              "english": [
                "The ruler must act with justice even toward those who rebel.",
                "A reformative approach should be adopted instead of pure retaliation.",
                "Maintaining self-control is essential for the rule of law."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنگی جرائم کی ممانعت",
              "english": "Prohibition of War Crimes"
            },
            "content": {
              "urdu": [
                "اسلام نے چودہ سو سال پہلے جنگی جرائم کی حدود متعین کر دی تھیں۔",
                "غیر مسلح اور بے بس دشمن پر وار کرنا اسلامی غیرت کے خلاف ہے۔",
                "انسانیت کا احترام ہر حال میں ملحوظ رکھنا ایمان کا حصہ ہے۔"
              ],
              "english": [
                "Islam defined the boundaries of war crimes 1400 years ago.",
                "Attacking an unarmed or helpless enemy contradicts Islamic honor.",
                "Respect for humanity must be maintained at all times as part of faith."
              ]
            }
          }
        ]
      }
    }
  ]
}