{
  "hadithId": 503,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["bulugh/4/21"],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
  
  "takhreej": {
    "arabic": "حسن. رواه الشافعي (1/248) وأحمد (2/186) والنسائي في السنن الكبرى (5835). وقد عزاه المصنف لابن ماجه وهو وهم، إنما هو عند غيره بإسناد حسن.",
    "urdu": "حسن۔ اسے امام شافعی، احمد اور نسائی (السنن الکبریٰ) نے روایت کیا ہے۔ حافظ ابن حجر رحمہ اللہ نے اسے ابن ماجہ کی طرف منسوب کیا ہے جو کہ سہو ہے، یہ روایت دیگر کتب میں حسن سند کے ساتھ موجود ہے۔",
    "english": "Hasan. Reported by Ash-Shafi'i (1/248), Ahmad (2/186), and An-Nasa'i in As-Sunan al-Kubra (5835). The author (Ibn Hajar) attributed it to Ibn Majah by mistake; it is found in other collections with a Hasan chain."
  },
  "importantWords": [
    {
      "arabic": "كَنْزٍ",
      "english": "Treasure",
      "urdu": "خزانہ"
    },
    {
      "arabic": "خَرِبَةٍ",
      "english": "Ruin / Waste place",
      "urdu": "ویرانہ / کھنڈر"
    },
    {
      "arabic": "عَرِّفْهُ",
      "english": "Announce it",
      "urdu": "اس کی تشہیر کرو / اعلان کرو"
    },
    {
      "arabic": "مَسْكُونَةٍ",
      "english": "Inhabited",
      "urdu": "آباد"
    },
    {
      "arabic": "الْخُمُسُ",
      "english": "One-fifth (20%)",
      "urdu": "پانچواں حصہ (بیس فیصد)"
    }
  ],
  "summary": {
    "urdu": "آباد جگہ سے ملنے والا مال 'لقطہ' (گری پڑی چیز) ہے جس کا اعلان ضروری ہے، جبکہ غیر آباد جگہ سے ملنے والا قدیم خزانہ 'رکاز' ہے جس پر 20 فیصد زکوٰۃ واجب ہے۔",
    "english": "Wealth found in inhabited areas is 'Luqatah' (lost property) requiring public announcement, while treasure from uninhabited ruins is 'Rikaz', subject to a 20% due."
  },
  "references": [
    {
      "arabic": "مسند أحمد، رقم 6701",
      "english": "Musnad Ahmad, Hadith 6701"
    },
    {
      "arabic": "سنن النسائي الكبرى، رقم 5835",
      "english": "Sunan an-Nasa'i al-Kubra, Hadith 5835"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آباد اور غیر آباد جگہ کے خزانوں میں فرق",
        "english": "Treasure in Inhabited vs. Uninhabited Places"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آباد بستی (لقطہ کا حکم)",
              "english": "Inhabited Area (Rule of Lost Property)"
            },
            "content": {
              "urdu": [
                "اگر کوئی قیمتی چیز یا خزانہ ایسی بستی سے ملے جہاں لوگ رہتے ہوں، تو اسے 'لقطہ' سمجھا جائے گا۔",
                "اس صورت میں پانے والے پر واجب ہے کہ وہ ایک سال تک اس کا اعلان کرے تاکہ اصل مالک مل سکے۔",
                "اگر مالک مل جائے تو مال اسے دینا ہوگا، ورنہ سال گزرنے کے بعد پانے والا اسے استعمال کر سکتا ہے۔"
              ],
              "english": [
                "If wealth is found in a currently populated area, it is treated as 'Luqatah' (lost property).",
                "The finder is obligated to announce it publicly for one year to find the rightful owner.",
                "If the owner appears, it must be returned; otherwise, the finder may use it after a year."
              ]
            }
          },
          {
            "title": {
              "urdu": "ویرانہ اور کھنڈر (رکاز کا حکم)",
              "english": "Ruins and Deserts (Rule of Rikaz)"
            },
            "content": {
              "urdu": [
                "ایسا خزانہ جو قدیم کھنڈرات یا غیر آباد زمین سے ملے، اسے 'رکاز' کہا جاتا ہے۔",
                "ایسے مال پر اعلان کرنے کی ضرورت نہیں ہوتی کیونکہ اس کا مالک اب موجود نہیں ہوتا۔",
                "رکاز پر فوری طور پر خمس (20%) ادا کرنا لازم ہے اور بقیہ 80% پانے والے کا حق ہے۔"
              ],
              "english": [
                "Treasure found in ancient ruins or uninhabited land is categorized as 'Rikaz'.",
                "There is no requirement to announce such finds as the original owners are long gone.",
                "Khums (20%) must be paid immediately, and the remaining 80% belongs to the finder."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خمس (20%) کی شرح اور مصرف",
        "english": "Rate and Distribution of Khums"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زیادہ شرح کی وجہ",
              "english": "Reason for Higher Rate"
            },
            "content": {
              "urdu": [
                "عام زکوٰۃ 2.5% ہے جبکہ رکاز پر 20% ہے کیونکہ یہ مال بغیر کسی محنت اور سرمایہ کاری کے ملتا ہے۔",
                "اسلامی معیشت میں 'بغیر محنت کے نفع' پر معاشرے کا حق زیادہ رکھا گیا ہے۔",
                "یہ حکم اللہ کے فضل کو غریبوں اور اجتماعی فلاح و بہبود میں تقسیم کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Standard Zakat is 2.5%, but Rikaz is 20% because it is acquired without labor or capital investment.",
                "In Islamic economics, a higher social share is taken from 'effortless gain'.",
                "This ruling serves to distribute Allah's bounty among the poor and for public welfare."
              ]
            }
          },
          {
            "title": {
              "urdu": "خمس کا مصرف",
              "english": "Utilization of Khums"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک یہ خمس زکوٰۃ کے آٹھ مصارف (فقراء، مساکین وغیرہ) پر خرچ ہوگا۔",
                "بعض فقہاء کے نزدیک اسے 'فئی' کی طرح مسلمانوں کے عام مفادات (سڑکیں، پل، مساجد) میں بھی استعمال کیا جا سکتا ہے۔",
                "اسلامی ریاست اس رقم کی وصولی اور تقسیم کی ذمہ دار ہوتی ہے۔"
              ],
              "english": [
                "According to the majority, this Khums is spent on the eight categories of Zakat (poor, needy, etc.).",
                "Some jurists allow it to be used for general public interests (infrastructure, etc.) like 'Fai'.",
                "The Islamic state is responsible for the collection and distribution of this amount."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ملکیت کے شرعی آداب",
        "english": "Islamic Etiquettes of Ownership"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانتداری کی اہمیت",
              "english": "Importance of Integrity"
            },
            "content": {
              "urdu": [
                "آباد جگہ سے ملنے والے مال کو چھپانا خیانت ہے، اس کا اعلان دیانتداری سے کرنا چاہیے۔",
                "اگر پانے والے کو معلوم ہو کہ یہ مال کسی خاص مسلمان یا ذمی کا ہے، تو اعلان لازم ہے۔",
                "اسلام دوسروں کے مال کے احترام اور اس کی حفاظت کی سخت تاکید کرتا ہے۔"
              ],
              "english": [
                "Hiding wealth found in inhabited areas is a breach of trust; it must be announced honestly.",
                "If the finder knows the wealth belongs to a specific Muslim or citizen, returning it is mandatory.",
                "Islam emphasizes respect for others' property and its protection."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزقِ حلال کی طلب",
              "english": "Seeking Halal Provision"
            },
            "content": {
              "urdu": [
                "رکاز کا بقیہ حصہ پانے والے کے لیے تب ہی حلال ہوتا ہے جب وہ اللہ کا مقرر کردہ حق (خمس) نکال دے۔",
                "اپنے مال کو پاک کرنا برکت کا باعث بنتا ہے اور گناہوں کا کفارہ ہوتا ہے۔",
                "غیر متوقع مال ملنے پر شکر گزاری کا بہترین طریقہ اس میں سے صدقہ کرنا ہے۔"
              ],
              "english": [
                "The remainder of Rikaz is only halal for the finder after paying Allah's designated right (Khums).",
                "Purifying one's wealth leads to blessings and acts as an expiation for sins.",
                "The best way to show gratitude for windfall gains is through charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قانون کی پابندی",
              "english": "Legal Compliance"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ غیر متوقع دولت ملنے کی صورت میں شرعی اور ملکی قوانین کی پیروی کریں۔",
                "لالچ میں آ کر دوسروں کا حق مارنا دنیا اور آخرت کی بربادی کا سبب بنتا ہے۔",
                "اسلامی احکامات ہر قسم کی معاشی صورتحال میں عدل و انصاف فراہم کرتے ہیں۔"
              ],
              "english": [
                "This Hadith teaches us to follow Sharia and legal frameworks when encountering unexpected wealth.",
                "Greedily usurping the rights of others leads to ruin in both worlds.",
                "Islamic rulings provide justice and balance across all economic scenarios."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی جامعیت",
              "english": "Comprehensiveness of the Sunnah"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے زندگی کے ہر باریک پہلو، یہاں تک کہ کھنڈرات سے ملنے والے مال کی بھی رہنمائی فرمائی۔",
                "دینِ اسلام صرف مسجد تک محدود نہیں بلکہ یہ بازاروں اور ویرانوں کے لیے بھی ضابطہ حیات پیش کرتا ہے۔",
                "صحابہ کرام نے ان احکامات کو محفوظ کر کے قیامت تک آنے والے انسانوں پر احسان فرمایا۔"
              ],
              "english": [
                "The Prophet (ﷺ) provided guidance for every intricate detail, even wealth found in ruins.",
                "Islam is not confined to the mosque; it offers a code of life for markets and wilderness alike.",
                "The Companions preserved these rulings, doing a great favor to humanity for all time."
              ]
            }
          }
        ]
      }
    }
  ]
}