{
  "hadithId": 192,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["2", "5"],
    "kitabId": 2,
    "inKitabBab": 5,
    "arabicBook": "كتاب الصلاة",
    "babId": 15
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (374) عن أنس، ورواه البخاري (373) ومسلم (556) عن عائشة في قصة الأنبجانية.",
    "urdu": "صحیح ہے۔ اسے بخاری (374) نے حضرت انس سے روایت کیا ہے۔ اور انبجانیہ کی حدیث بخاری (373) اور مسلم (556) دونوں نے سیدہ عائشہ رضی اللہ عنہا سے روایت کی ہے جو متفق علیہ ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (374) from Anas. And the Hadith about the Anbijaniyyah is Muttafaq 'Alayh, reported by Al-Bukhari (373) and Muslim (556) from 'Aishah."
  },
  "importantWords": [
    {
      "arabic": "قِرَام",
      "english": "Patterned curtain/veil",
      "urdu": "نقش دار پردہ/چادر"
    },
    {
      "arabic": "أمِيطِي",
      "english": "Remove/Take away",
      "urdu": "ہٹا دو/دور کر دو"
    },
    {
      "arabic": "تصاويره",
      "english": "Its pictures/patterns",
      "urdu": "اس کے نقش و نگار/تصویریں"
    },
    {
      "arabic": "تَعْرِضُ لِي",
      "english": "Present themselves to me",
      "urdu": "میرے سامنے آتے ہیں"
    },
    {
      "arabic": "أَلْهَتْنِي",
      "english": "Diverted my attention",
      "urdu": "مجھے غافل کر دیا"
    },
    {
      "arabic": "صَلَاتِي",
      "english": "My prayer",
      "urdu": "میری نماز"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں خشوع کی اہمیت کو بیان کرتی ہے اور ان تمام چیزوں سے بچنے کا حکم دیتی ہے جو نمازی کی توجہ کو اللہ سے ہٹا کر دنیاوی امور میں مشغول کر دیں۔ نبی صلی اللہ علیہ وسلم نے اپنی نماز میں خلل اندازی کی وجہ سے زیبائشی پردہ ہٹانے اور نقش دار کپڑا بدلنے کا حکم دیا۔",
    "english": "This Hadith emphasizes the importance of Khushu' in prayer and commands avoiding anything that distracts the worshipper's attention from Allah to worldly matters. The Prophet (PBUH) ordered the removal of a patterned curtain and exchanged a decorative garment because they diverted his attention during prayer."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب إذا صلى في ثوب له أعلام ونظر إلى علمها (374)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: If one prays in a garment having marks and he looks at them (374)"
    },
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب الصلاة في خميصة لا أعلام لها (373)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: Praying in a Khamisah (velvet garment) without marks (373)"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساجد ومواضع الصلاة، باب كراهة الصلاة في ثوب له أعلام (556)",
      "english": "Sahih Muslim, Book of Masajid and Places of Prayer, Chapter: Dislike of praying in a garment with marks (556)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Malik"
      },
      "slug": "anas-ibn-malik"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGvQk0X9o",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خشوع اور مادی رکاوٹیں",
        "english": "Khushu' and Material Distractions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توجہ ہٹانے والی چیزوں کا ازالہ",
              "english": "Removing Distracting Items"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم کا قِرام کو ہٹانے کا حکم یہ بتاتا ہے کہ نماز میں یکسوئی بنیادی شرط ہے۔",
                "ایسی ہر چیز جو نماز میں نظروں کو اپنی طرف کھینچے، اسے نماز کی جگہ سے دور کر دینا چاہیے۔",
                "یہ صرف پردے تک محدود نہیں بلکہ اس میں نقش دار لباس اور جائینماز بھی شامل ہیں۔"
              ],
              "english": [
                "The Prophet's command to remove the Qiram shows that concentration is a fundamental requirement in prayer.",
                "Everything that visually attracts attention in prayer should be removed from the place of worship.",
                "This applies not only to curtains but also to patterned clothes and prayer rugs."
              ]
            }
          },
          {
            "title": {
              "urdu": "تصاویر کا اثر",
              "english": "Effect of Pictures/Patterns"
            },
            "content": {
              "urdu": [
                "نقش و نگار یا تصاویر نمازی کی نظروں کے سامنے آ کر دل میں خیالات پیدا کرتے ہیں۔",
                "نبی صلی اللہ علیہ وسلم کی کامل خشوع کی حالت میں بھی یہ چیزیں خلل انداز ہوئیں۔",
                "لہذا، کامل عبادات کے لیے ظاہری ماحول کو بھی سکون بخش رکھنا چاہیے۔"
              ],
              "english": [
                "Patterns or pictures appearing before the worshipper's eyes generate distracting thoughts in the heart.",
                "These items disturbed the Prophet's concentration, despite his perfect state of Khushu'.",
                "Therefore, for perfect worship, the external environment must also be kept tranquil."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انبجانیہ کی مثال",
        "english": "The Example of the Anbijaniyyah Garment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لباس میں سادگی کا حکم",
              "english": "Command for Simplicity in Dress"
            },
            "content": {
              "urdu": [
                "ابوجہم کی نقش دار چادر (انبجانیہ) کا قصہ بھی اسی اصول کی تائید کرتا ہے۔",
                "نبی صلی اللہ علیہ وسلم نے فرمایا کہ اس چادر نے مجھے نماز سے غافل کر دیا۔",
                "یہ حکم صرف کپڑوں کی زیبائش میں نہیں بلکہ روحانیت کو مقدم رکھنے میں ہے۔"
              ],
              "english": [
                "The story of Abu Jahm's patterned garment (Anbijaniyyah) confirms the same principle.",
                "The Prophet (PBUH) stated that this garment diverted his attention from his prayer.",
                "This ruling is not merely about outward beauty but prioritizing spirituality."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترکِ دنیا کا درس",
              "english": "Lesson in Avoiding Worldliness"
            },
            "content": {
              "urdu": [
                "نماز کی حالت میں دنیاوی اشیاء کی طرف توجہ دینا ترکِ دنیا کے منافی ہے۔",
                "نبی اکرم صلی اللہ علیہ وسلم نے سادگی اور یکسوئی کو ترجیح دی۔",
                "یہ واقعہ اس بات کی دلیل ہے کہ نیکی کے کام میں ریاکاری کا شائبہ بھی نہیں ہونا چاہیے۔"
              ],
              "english": [
                "Paying attention to worldly objects during prayer is contrary to the principle of abstaining from the world.",
                "The Prophet (PBUH) prioritized simplicity and single-minded focus.",
                "This incident proves that there should be no hint of ostentation (Riya') in good deeds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تعلیمی نکات",
        "english": "Juristic and Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کے مکروہات",
              "english": "Disliked Acts (Makruhat) of Prayer"
            },
            "content": {
              "urdu": [
                "فقہاء نے ایسے کپڑے یا جگہ جہاں زیادہ نقش و نگار ہوں، نماز پڑھنا مکروہ قرار دیا ہے۔",
                "اگر نقش و نگار والے کپڑے یا قالین سے خشوع میں کمی آئے تو اسے ترک کر دینا واجب ہے۔",
                "ایسی چیزوں کا اہتمام کرنا جن کی وجہ سے خشوع جاتا رہے، ایمان کی کمزوری کی علامت ہے۔"
              ],
              "english": [
                "Jurists consider praying in a place or wearing clothes with excessive patterns as Makruh (disliked).",
                "If patterned clothes or carpets diminish Khushu', avoiding them becomes obligatory.",
                "Seeking out things that lead to loss of Khushu' is a sign of weak faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسان کی فطرت",
              "english": "Human Nature"
            },
            "content": {
              "urdu": [
                "یہ حدیث ظاہر کرتی ہے کہ انسان کی فطرت میں زینت اور خوبصورتی کی طرف میلان ہوتا ہے۔",
                "نبی صلی اللہ علیہ وسلم نے اپنی فطری میلان کو بھی نماز میں غالب نہیں ہونے دیا۔",
                "ہمیں چاہیے کہ اپنی کمزوری کو پہچانیں اور نماز میں دھیان بھٹکانے والی چیزوں سے دور رہیں۔"
              ],
              "english": [
                "This Hadith shows that human nature tends towards adornment and beauty.",
                "The Prophet (PBUH) did not allow even his natural inclination to dominate his prayer.",
                "We should recognize our weakness and stay away from things that distract us in prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Lesson for Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد کا ماحول",
              "english": "The Mosque Environment"
            },
            "content": {
              "urdu": [
                "مساجد کو ہر طرح کی غیر ضروری اور پرکشش تصاویر اور نقوش سے پاک رکھنا چاہیے۔",
                "مسجد کی سجاوٹ میں سادگی اور سکون کو ترجیح دینی چاہیے تاکہ نمازیوں کی توجہ قائم رہے۔",
                "غیر ضروری تعمیرات اور رنگین کاری سے گریز کیا جائے جو دنیاوی سوچ کو بیدار کرے۔"
              ],
              "english": [
                "Mosques should be kept free from all unnecessary and captivating images and patterns.",
                "Simplicity and tranquility should be prioritized in mosque decoration to maintain worshippers' focus.",
                "Avoid unnecessary construction and colorful decorations that might evoke worldly thoughts."
              ]
            }
          },
          {
            "title": {
              "urdu": "خشوع کی طلب",
              "english": "Seeking Khushu'"
            },
            "content": {
              "urdu": [
                "نماز میں خشوع کی طلب ایمان کا حصہ ہے اور اس کے لیے جدوجہد ضروری ہے۔",
                "مادی distractions کو دور کرنا خشوع حاصل کرنے کا ایک اہم عملی ذریعہ ہے۔",
                "باطنی یکسوئی کے ساتھ ساتھ ظاہری ماحول کا سکون بھی نماز کی قبولیت میں مدد دیتا ہے۔"
              ],
              "english": [
                "The quest for Khushu' in prayer is part of faith, and striving for it is essential.",
                "Removing material distractions is a crucial practical means of achieving Khushu'.",
                "Alongside inner concentration, the tranquility of the external environment aids in the acceptance of prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
