{
  "hadithId": 937,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1078"],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5350) ومسلم (1493). واللفظ لمسلم، وهو أصل في أن الفرقة بعد اللعان أبدية ولا رجوع للمهر بعد الدخول.",
    "urdu": "صحیح۔ اسے بخاری (5350) اور مسلم (1493) نے روایت کیا ہے۔ یہ حدیث اس بات کی دلیل ہے کہ لعان کے بعد علیحدگی دائمی ہوتی ہے اور دخول کے بعد مہر واپس نہیں ملتا۔",
    "english": "Sahih. Reported by Al-Bukhari (5350) and Muslim (1493). This Hadith establishes that the separation after Li'an is permanent and the dowry (Mahr) cannot be reclaimed after consummation."
  },
  "importantWords": [
    {
      "arabic": "اَلْمُتَلَاعِنَيْنِ",
      "english": "The two who engage in Li'an",
      "urdu": "لعان کرنے والے میاں بیوی"
    },
    {
      "arabic": "حِسَابُكُمَا",
      "english": "Your reckoning",
      "urdu": "تمہارا حساب"
    },
    {
      "arabic": "لَا سَبِيلَ",
      "english": "No way / No right",
      "urdu": "کوئی راستہ نہیں / کوئی حق نہیں"
    },
    {
      "arabic": "اِسْتَحْلَلْتَ",
      "english": "You made lawful",
      "urdu": "تم نے حلال کیا"
    },
    {
      "arabic": "أَبْعَدُ",
      "english": "Further away",
      "urdu": "زیادہ دور"
    }
  ],
  "summary": {
    "urdu": "لعان کے بعد میاں بیوی میں دائمی علیحدگی ہو جاتی ہے، شوہر کو دیا ہوا مہر واپس نہیں ملتا کیونکہ وہ ازدواجی تعلق کا معاوضہ بن چکا ہوتا ہے۔",
    "english": "After Li'an, a permanent separation occurs. The husband cannot reclaim the Mahr (dowry) because it was the consideration for the lawful marital relationship enjoyed."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5350)",
      "english": "Sahih al-Bukhari (5350)"
    },
    {
      "arabic": "صحيح مسلم (1493)",
      "english": "Sahih Muslim (1493)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar bin al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لعان اور اس کا انجام",
        "english": "Li'an and its Consequences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لعان کا مفہوم",
              "english": "Meaning of Li'an"
            },
            "content": {
              "urdu": [
                "لعان اس وقت ہوتا ہے جب شوہر بیوی پر بدکاری کا الزام لگائے اور گواہ نہ ہوں۔",
                "ایسی صورت میں میاں بیوی چار بار قسم کھاتے ہیں اور پانچویں بار اللہ کی لعنت یا غضب پکارتے ہیں۔",
                "اس کے بعد ان کے درمیان ایسی علیحدگی ہوتی ہے کہ وہ دوبارہ کبھی نکاح نہیں کر سکتے۔"
              ],
              "english": [
                "Li'an occurs when a husband accuses his wife of adultery without having four witnesses.",
                "The spouses swear four times, and the fifth oath invokes Allah's curse or wrath upon the liar.",
                "Following this, a permanent separation is enforced, and they can never remarry each other."
              ]
            }
          },
          {
            "title": {
              "urdu": "حساب اللہ کے سپرد",
              "english": "Accountability to Allah"
            },
            "content": {
              "urdu": [
                "دنیا میں ظاہری قسموں کی بنیاد پر فیصلہ کر دیا جاتا ہے مگر اصل حقیقت اللہ جانتا ہے۔",
                "آپ ﷺ نے واضح فرمایا کہ تم میں سے ایک ضرور جھوٹا ہے جو اللہ کے عذاب کا مستحق ہے۔",
                "یہ تنبیہ انسان کو اللہ سے ڈرنے اور جھوٹی قسم سے بچنے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "Earthly judgments are based on oaths, but the absolute truth is known only to Allah.",
                "The Prophet (ﷺ) clarified that one party is definitely lying and deserves Allah's punishment.",
                "This warning encourages fear of Allah and prevents taking false oaths in His name."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مہر کا شرعی حکم",
        "english": "Legal Status of the Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہر کی واپسی کی ممانعت",
              "english": "Prohibition of Reclaiming Mahr"
            },
            "content": {
              "urdu": [
                "اگر میاں بیوی کے درمیان خلوت ہو چکی ہو تو شوہر مہر واپس لینے کا حق کھو دیتا ہے۔",
                "نبی ﷺ نے فرمایا کہ مہر اس تعلق کا بدلہ تھا جو نکاح کے ذریعے حلال ہوا تھا۔",
                "الزام سچا ہو یا جھوٹا، مہر بہرحال عورت کا حق قرار پاتا ہے کیونکہ رشتہ ٹوٹ چکا ہے۔"
              ],
              "english": [
                "If the marriage was consummated, the husband loses the right to reclaim the Mahr.",
                "The Prophet (ﷺ) stated the Mahr was consideration for the intimacy made lawful by marriage.",
                "Whether the accusation is true or false, the Mahr remains the wife's right after separation."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھوٹے الزام کی سزا",
              "english": "Punishment for False Accusation"
            },
            "content": {
              "urdu": [
                "اگر شوہر نے جھوٹا الزام لگایا ہے تو اسے مہر واپس نہ ملنا اس کی ایک مالی سزا ہے۔",
                "اسلام کسی کو اپنی زبان سے دوسرے کی عزت اچھالنے اور پھر مالی فائدہ لینے کی اجازت نہیں دیتا۔",
                "یہ حکم عورت کے وقار اور اس کے مالی حقوق کے تحفظ کی ضمانت دیتا ہے۔"
              ],
              "english": [
                "If the husband lied, not getting the Mahr back serves as a financial penalty for him.",
                "Islam does not permit defaming someone's honor and then seeking financial gain.",
                "This ruling ensures the protection of the woman's dignity and financial rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عزت اور وقار کا تحفظ",
        "english": "Protection of Honor and Dignity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بہتان کی سنگینی",
              "english": "Severity of Slander"
            },
            "content": {
              "urdu": [
                "کسی پاکدامن عورت پر بدکاری کا الزام لگانا کبیرہ گناہ اور نہایت سنگین جرم ہے۔",
                "اسلام نے معاشرے میں عفت اور پاکدامنی کو برقرار رکھنے کے لیے سخت قوانین بنائے ہیں۔",
                "لعان کا عمل اس لیے رکھا گیا تاکہ بے گناہ فریق پر سے الزام کا داغ مٹایا جا سکے۔"
              ],
              "english": [
                "Accusing a chaste woman of adultery is a major sin and a very serious crime.",
                "Islam established strict laws to maintain modesty and chastity within society.",
                "The process of Li'an exists to clear the name of the innocent party from slander."
              ]
            }
          },
          {
            "title": {
              "urdu": "علیحدگی کی ابدیت",
              "english": "Permanence of Separation"
            },
            "content": {
              "urdu": [
                "لعان کے بعد میاں بیوی کے درمیان ایسی نفرت پیدا ہو جاتی ہے کہ ان کا ساتھ رہنا ناممکن ہے۔",
                "شریعت نے ان کے درمیان دائمی جدائی کر دی ہے تاکہ مزید فتنہ اور دشمنی نہ بڑھے۔",
                "یہ علیحدگی طلاق سے زیادہ سخت ہے کیونکہ اس میں رجوع کی کوئی گنجائش نہیں ہوتی۔"
              ],
              "english": [
                "After Li'an, such resentment arises that living together becomes impossible for the couple.",
                "Shariah enforces a permanent separation to prevent further discord and animosity.",
                "This separation is stricter than divorce as it allows no possibility of reconciliation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور عملی سبق",
        "english": "Educational and Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کا محتاط استعمال",
              "english": "Careful Use of the Tongue"
            },
            "content": {
              "urdu": [
                "مومن کو چاہیے کہ کسی پر الزام لگانے سے پہلے ہزار بار سوچے اور ثبوت تلاش کرے۔",
                "غصے اور بدگمانی میں آکر نکاح جیسے مقدس رشتے کو داغدار نہیں کرنا چاہیے۔",
                "اللہ کی قسم کھا کر جھوٹ بولنا انسان کو دنیا اور آخرت میں برباد کر دیتا ہے۔"
              ],
              "english": [
                "A believer must think a thousand times and seek evidence before accusing anyone.",
                "One should not tarnish the sacred bond of marriage due to anger or suspicion.",
                "Lying after taking an oath by Allah ruins a person in this life and the hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی حدود کی پاسداری",
              "english": "Adherence to Shariah Limits"
            },
            "content": {
              "urdu": [
                "گھریلو تنازعات کو حل کرنے کا بہترین طریقہ وہ ہے جو اللہ اور اس کے رسول نے بتایا ہے۔",
                "جب معاملہ عدالت میں پہنچ جائے تو اللہ کے حکم کے سامنے سرِ تسلیم خم کرنا چاہیے۔",
                "اسلامی قوانین کا مقصد معاشرے میں عدل کا قیام اور مظلوم کی داد رسی کرنا ہے۔"
              ],
              "english": [
                "The best way to resolve domestic disputes is the way prescribed by Allah and His Messenger.",
                "When a matter reaches the court, one must submit to the command of Allah.",
                "Islamic laws aim to establish justice in society and provide relief to the oppressed."
              ]
            }
          }
        ]
      }
    }
  ]
}