{
  "hadithId": 405,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 2,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 25
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البيهقي في السنن الكبرى (3/343)، وابن أبي شيبة في المصنف (2/472) بسند صحيح عن ابن عباس. ورواه الشافعي عن علي بن أبي طالب رضي الله عنه.",
    "urdu": "یہ روایت صحیح ہے۔ اسے امام بیہقی نے سنن کبریٰ (3/343) میں اور ابن ابی شیبہ نے اپنے مصنف (2/472) میں صحیح سند کے ساتھ ابن عباس سے نقل کیا ہے۔ امام شافعی نے بھی اسے حضرت علی سے روایت کیا ہے۔",
    "english": "Sahih. Reported by al-Baihaqi in as-Sunan al-Kubra (3/343) and Ibn Abi Shaibah in al-Musannaf (2/472) with a Sahih chain from Ibn 'Abbas. Ash-Shafi'i narrated it from 'Ali bin Abi Talib."
  },
  "importantWords": [
    {
      "arabic": "زَلْزَلَةٍ",
      "english": "Earthquake",
      "urdu": "زلزلہ"
    },
    {
      "arabic": "سِتَّ رَكَعَاتٍ",
      "english": "Six bowings",
      "urdu": "چھ رکوع"
    },
    {
      "arabic": "أَرْبَعَ سَجَدَاتٍ",
      "english": "Four prostrations",
      "urdu": "چار سجدے"
    },
    {
      "arabic": "الْآيَاتِ",
      "english": "Signs (Divine signs)",
      "urdu": "آیات الہی (قدرتی نشانیاں)"
    },
    {
      "arabic": "مِثْلَهُ",
      "english": "Similar to it",
      "urdu": "اس کی مانند"
    }
  ],
  "summary": {
    "urdu": "زلزلہ یا دیگر خوفناک قدرتی آفات کے وقت نماز پڑھنا صحابہ سے ثابت ہے، جسے نماز آیات کہا جاتا ہے اور اس میں ایک رکعت میں ایک سے زیادہ رکوع کیے جا سکتے ہیں۔",
    "english": "Offering prayer during earthquakes or terrifying natural signs is established from the Sahaba; it is called 'Salat al-Ayat' and may involve multiple bowings per rak'ah."
  },
  "references": [
    {
      "arabic": "السنن الكبرى للبيهقي (3/343)",
      "english": "Al-Sunan al-Kubra by al-Baihaqi (3/343)"
    },
    {
      "arabic": "مصنف ابن أبي شيبة (2/472)",
      "english": "Musannaf Ibn Abi Shaibah (2/472)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=salat+al+ayat+earthquake+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازِ آیات کا مفہوم",
        "english": "Concept of the Prayer of Signs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قدرتی آفات اور رجوع الی اللہ",
              "english": "Turning to Allah During Disasters"
            },
            "content": {
              "urdu": [
                "زلزلہ، سخت آندھی یا کسی بھی بڑی قدرتی آفت کے وقت اللہ کی طرف رجوع کرنا چاہیے۔",
                "صحابہ کرام ایسی غیر معمولی نشانیوں کو دیکھ کر نماز میں مشغول ہو جاتے تھے۔",
                "یہ عمل اس بات کا اعتراف ہے کہ کائنات کا ہر ذرہ اللہ کے قبضہ قدرت میں ہے۔"
              ],
              "english": [
                "One should turn to Allah during earthquakes, severe storms, or major natural disasters.",
                "The Companions used to engage in prayer upon witnessing such unusual divine signs.",
                "This act is an acknowledgement that every atom in the universe is under Allah's control."
              ]
            }
          },
          {
            "title": {
              "urdu": "آیات الہی سے مراد",
              "english": "Meaning of Divine Signs"
            },
            "content": {
              "urdu": [
                "آیات سے مراد وہ نشانیاں ہیں جو انسان کے دل میں اللہ کا خوف پیدا کرتی ہیں۔",
                "ان میں سورج گرہن، چاند گرہن اور زلزلے جیسے واقعات سرِ فہرست ہیں۔",
                "حدیث میں اسے 'صلاۃ الآیات' کہہ کر پکارا گیا ہے جو اس کی اہمیت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Signs refer to those phenomena that instill the fear of Allah in human hearts.",
                "These primarily include solar eclipses, lunar eclipses, and seismic events like earthquakes.",
                "Labeling it 'Salat al-Ayat' in the Hadith highlights its specific status in worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کی ہیئت اور طریقہ",
        "english": "Method and Structure of the Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکوع اور سجدوں کی تعداد",
              "english": "Number of Bowings and Prostrations"
            },
            "content": {
              "urdu": [
                "اس اثر کے مطابق ابن عباس رضی اللہ عنہ نے ہر رکعت میں تین رکوع کیے۔",
                "دو رکعتوں میں مجموعی طور پر چھ رکوع اور چار سجدے ادا کیے گئے۔",
                "یہ طریقہ عام نمازوں سے مختلف ہے اور نمازِ کسوف کے طریقے سے مشابہت رکھتا ہے۔"
              ],
              "english": [
                "According to this report, Ibn 'Abbas performed three bowings in each rak'ah.",
                "In total, six bowings and four prostrations were offered across the two rak'ahs.",
                "This structure differs from regular prayers and resembles the eclipse prayer's method."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی وسعت",
              "english": "Juristic Flexibility"
            },
            "content": {
              "urdu": [
                "فقہاء کے درمیان زلزلے کی نماز کے طریقے اور وجوب پر مختلف آراء ہیں۔",
                "کچھ اسے نمازِ کسوف کی طرح پڑھنے کے قائل ہیں جبکہ کچھ اسے عام نفل قرار دیتے ہیں۔",
                "صحابہ کا عمل اس بات کی دلیل ہے کہ آفت کے وقت کسی بھی شکل میں نماز پڑھنا مستحب ہے۔"
              ],
              "english": [
                "Jurists hold differing opinions on the necessity and method of the earthquake prayer.",
                "Some advocate following the eclipse prayer format, while others treat it as general voluntary units.",
                "The practice of the Sahaba proves that praying in any form during a disaster is recommended."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی پہلو",
        "english": "Spiritual and Training Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ خدا کا غلبہ",
              "english": "Dominance of Fear of Allah"
            },
            "content": {
              "urdu": [
                "زلزلہ انسان کو اس کی کمزوری اور اللہ کی طاقت کی یاد دلاتا ہے۔",
                "ایسے وقت میں گھبرانے کے بجائے مصلے پر آنا ایمان کی پختگی کی علامت ہے۔",
                "یہ عمل ہمیں سکھاتا ہے کہ ہر مشکل کا حل اللہ کی عبادت میں تلاش کریں۔"
              ],
              "english": [
                "An earthquake reminds humans of their weakness and the supreme power of Allah.",
                "Coming to the prayer mat instead of panicking is a sign of strong faith.",
                "This practice teaches us to seek the solution to every difficulty through worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور استغفار",
              "english": "Repentance and Seeking Forgiveness"
            },
            "content": {
              "urdu": [
                "آفات بسا اوقات انسانی گناہوں کی وجہ سے تنبیہ کے طور پر آتی ہیں۔",
                "نمازِ آیات کا مقصد گناہوں سے توبہ اور اللہ سے معافی مانگنا ہے۔",
                "مسلمان کو چاہیے کہ وہ ان لمحات میں استغفار کی کثرت کرے۔"
              ],
              "english": [
                "Disasters sometimes come as warnings due to human transgressions.",
                "The purpose of Salat al-Ayat is to repent for sins and seek Allah's mercy.",
                "A Muslim should increase their seeking of forgiveness during such moments."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کی پیروی",
              "english": "Following the Companions"
            },
            "content": {
              "urdu": [
                "ابن عباس اور علی رضی اللہ عنہما جیسے جلیل القدر صحابہ کا عمل ہمارے لیے مشعلِ راہ ہے۔",
                "دین کو سمجھنے کے لیے صحابہ کے فہم اور ان کے تعامل کو دیکھنا ضروری ہے۔",
                "یہ حدیث ثابت کرتی ہے کہ اسلام ہر حالت میں اللہ سے تعلق جوڑنے کا نام ہے۔"
              ],
              "english": [
                "The actions of great Sahaba like Ibn 'Abbas and 'Ali serve as a guiding light for us.",
                "To understand religion, it is essential to look at the understanding and practice of the Sahaba.",
                "This Hadith proves that Islam is about connecting with Allah in every circumstance."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی دعا کی اہمیت",
              "english": "Importance of Collective Supplication"
            },
            "content": {
              "urdu": [
                "مصیبت کے وقت پوری بستی کا اکٹھے ہو کر اللہ کو پکارنا عذاب کو ٹال سکتا ہے۔",
                "نمازِ آیات انفرادی طور پر بھی پڑھی جا سکتی ہے اور باجماعت بھی۔",
                "باہمی اتحاد اور بندگی کا اظہار اللہ کی رحمت کو متوجہ کرتا ہے۔"
              ],
              "english": [
                "The collective supplication of a whole community during distress can avert punishment.",
                "Salat al-Ayat can be offered individually or in a congregation.",
                "The expression of mutual unity and servitude attracts the mercy of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
