{
  "hadithId": 406,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/406"],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "كتاب الصلاة",
    "babId": 26
  },
 
  "takhreej": {
    "arabic": "حسن صحيح. رواه أبو داود (1165)، والنسائي (1506)، والترمذي (558)، وابن ماجه (1266)، وأحمد (1/269)، وابن حبان (2862).",
    "urdu": "یہ روایت حسن صحیح ہے۔ اسے ابوداؤد (1165)، نسائی (1506)، ترمذی (558) اور ابن ماجہ (1266) نے روایت کیا ہے۔ امام ترمذی اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan Sahih. Reported by Abu Dawud (1165), An-Nasa'i (1506), At-Tirmidhi (558), Ibn Majah (1266), and Ahmad (1/269). Graded Sahih by At-Tirmidhi and Ibn Hibban."
  },
  "importantWords": [
    {
      "arabic": "مُتَوَاضِعًا",
      "english": "In humility",
      "urdu": "عاجزی کے ساتھ"
    },
    {
      "arabic": "مُتَبَذِّلًا",
      "english": "In simple clothes",
      "urdu": "سادہ لباس میں"
    },
    {
      "arabic": "مُتَخَشِّعًا",
      "english": "Submissively",
      "urdu": "خشوع کے ساتھ"
    },
    {
      "arabic": "مُتَضَرِّعًا",
      "english": "Supplicating",
      "urdu": "گڑگڑاتے ہوئے"
    },
    {
      "arabic": "مُتَرَسِّلًا",
      "english": "Walking calmly",
      "urdu": "وقار کے ساتھ"
    },
    {
      "arabic": "الْخَمْسَةُ",
      "english": "The Five",
      "urdu": "پانچوں ائمہ"
    }
  ],
  "summary": {
    "urdu": "نمازِ استسقاء کے لیے مسنون طریقہ یہ ہے کہ انسان نہایت عاجزی اور سادگی کے ساتھ میدان میں نکلے اور عید کی طرح دو رکعتیں ادا کرے۔",
    "english": "The Sunnah for the prayer for rain (Istisqa) is to go out with humility and simplicity, and to offer two units of prayer similar to the Eid prayer."
  },
  "references": [
    {
      "arabic": "جامع الترمذي (558)",
      "english": "Jami' at-Tirmidhi (558)"
    },
    {
      "arabic": "سنن أبي داود (1165)",
      "english": "Sunan Abu Dawud (1165)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Aof-r666X30",
  "grade": {
    "arabic": "حسن صحيح",
    "english": "Hasan Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استسقاء کی ظاہری ہیئت",
        "english": "Appearance for Istisqa"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لباس میں سادگی",
              "english": "Simplicity in Dress"
            },
            "content": {
              "urdu": [
                "نمازِ استسقاء کے لیے عید کی طرح نئے یا مہنگے کپڑے پہننا مسنون نہیں ہے۔",
                "اس میں سادہ اور پرانے کپڑوں کا استعمال عاجزی کے اظہار کے لیے بہتر ہے۔",
                "نبی کریم ﷺ کا سادہ لباس میں نکلنا اللہ کے سامنے محتاجی ظاہر کرنے کے لیے تھا۔"
              ],
              "english": [
                "It is not Sunnah to wear new or expensive clothes for the rain prayer.",
                "Using simple and old clothes is preferred to express humility before Allah.",
                "The Prophet's (PBUH) choice of simple clothing showed total dependence on Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خشوع و خضوع",
              "english": "Humility and Submission"
            },
            "content": {
              "urdu": [
                "نماز کے لیے نکلتے وقت دل میں خوفِ خدا اور عاجزی کا ہونا ضروری ہے۔",
                "میدان کی طرف چلتے ہوئے وقار اور سکون کو برقرار رکھنا چاہیے تاکہ خشوع ظاہر ہو۔",
                "نبی ﷺ کی ظاہری کیفیت سے تضرع اور دعا کی تڑپ نمایاں ہوتی تھی۔"
              ],
              "english": [
                "It is essential to have fear of Allah and humility in the heart when going out.",
                "One should walk calmly toward the prayer ground to maintain a submissive state.",
                "The Prophet's (PBUH) outward appearance showed a deep longing for supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کی کیفیت",
        "english": "Nature of the Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دو رکعت نماز",
              "english": "Two Units of Prayer"
            },
            "content": {
              "urdu": [
                "استسقاء کی نماز میں عید کی طرح دو رکعتیں ادا کی جاتی ہیں۔",
                "اس نماز کی رکعتوں میں بھی عید کی طرح زائد تکبیرات کہی جا سکتی ہیں۔",
                "یہ نماز باجماعت میدان (عیدگاہ) میں ادا کرنا مسنون ہے۔"
              ],
              "english": [
                "The rain prayer consists of two units, just like the Eid prayer.",
                "Additional Takbirat can be recited in these units, similar to Eid.",
                "Performing this prayer in congregation in an open field is Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطبہ کی نوعیت",
              "english": "Nature of the Sermon"
            },
            "content": {
              "urdu": [
                "استسقاء کا خطبہ جمعہ اور عید کے عام خطبوں سے مختلف ہوتا ہے۔",
                "اس میں زیادہ توجہ توبہ، استغفار اور گڑگڑا کر دعا کرنے پر ہوتی ہے۔",
                "نبی ﷺ نے اس موقع پر طویل وعظ کے بجائے عاجزی والی گفتگو فرمائی۔"
              ],
              "english": [
                "The Istisqa sermon differs from the regular Friday or Eid sermons.",
                "It focuses more on repentance, seeking forgiveness, and sincere crying in dua.",
                "The Prophet (PBUH) preferred humble speech over long formal orations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استسقاء کی مشروعیت",
              "english": "Legitimacy of Istisqa"
            },
            "content": {
              "urdu": [
                "قحط سالی کے وقت باجماعت نماز ادا کرنا ائمہ اربعہ کے نزدیک جائز ہے۔",
                "اس کا مقصد بارش کی طلب کے لیے اللہ تعالیٰ کے حضور اجتماعی توبہ ہے۔",
                "بچوں، بوڑھوں اور جانوروں کو ساتھ لانا بھی عاجزی کے اظہار کے لیے مستحب ہے۔"
              ],
              "english": [
                "Performing congregational prayer during drought is valid according to the four Imams.",
                "Its purpose is collective repentance before Allah to seek rain.",
                "Bringing children, the elderly, and animals is recommended to show humility."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور استغفار",
              "english": "Repentance and Forgiveness"
            },
            "content": {
              "urdu": [
                "بارش کے رکنے کا ایک بڑا سبب انسانی گناہ اور نافرمانیاں ہوتی ہیں۔",
                "استسقاء سے پہلے روزہ رکھنا اور صدقہ کرنا بھی بہتر قرار دیا گیا ہے۔",
                "حقوق العباد کی ادائیگی توبہ کی قبولیت کے لیے بنیادی شرط ہے۔"
              ],
              "english": [
                "A major reason for the withholding of rain is human sin and disobedience.",
                "Fasting and giving charity before Istisqa are considered highly beneficial.",
                "Fulfilling the rights of others is a basic condition for the acceptance of repentance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکبر سے دوری",
              "english": "Avoiding Arrogance"
            },
            "content": {
              "urdu": [
                "دعا کی قبولیت کے لیے دل سے غرور اور تکبر کا نکالنا ضروری ہے۔",
                "اللہ کو وہی بندہ پسند ہے جو اپنی کمزوری کا اعتراف کرے۔",
                "نمازِ استسقاء ہمیں زندگی کے ہر معاملے میں عاجزی سکھاتی ہے۔"
              ],
              "english": [
                "To have prayers accepted, one must remove pride and arrogance from the heart.",
                "Allah loves the servant who acknowledges his own weakness and frailty.",
                "The Istisqa prayer teaches us humility in every aspect of our lives."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی دعا کی برکت",
              "english": "Blessing of Collective Dua"
            },
            "content": {
              "urdu": [
                "پوری بستی کا ایک ساتھ توبہ کرنا اللہ کی رحمت کو جوش میں لاتا ہے۔",
                "مسلمانوں کو تنگی کے وقت ایک دوسرے کے ساتھ مل کر دعا کرنی چاہیے۔",
                "سنت کے مطابق عمل کرنے سے ہی برکات کا نزول ہوتا ہے۔"
              ],
              "english": [
                "The collective repentance of a whole community stirs Allah's mercy.",
                "Muslims should join together in supplication during times of hardship.",
                "The descent of blessings only occurs through adherence to the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
