{
  "hadithId": 1261,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:2626"],
    "kitabId": 16,
    "inKitabBab": 2,
    "arabicBook": "كتاب البر والصلة",
    "babId": 103
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2626).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح (2626) میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Muslim (2626)."
  },
  "importantWords": [
    {
      "arabic": "لَا تَحْقِرَنَّ",
      "english": "Do not belittle/despise",
      "urdu": "ہرگز حقیر نہ سمجھو"
    },
    {
      "arabic": "الْمَعْرُوفِ",
      "english": "Good deed/Virtue",
      "urdu": "نیکی / بھلائی"
    },
    {
      "arabic": "تَلْقَى",
      "english": "You meet",
      "urdu": "تم ملو"
    },
    {
      "arabic": "وَجْهٍ طَلْقٍ",
      "english": "Cheerful/Smiling face",
      "urdu": "کشادہ چہرہ / ہنستا ہوا چہرہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا نچوڑ یہ ہے کہ نیکی چھوٹی ہو یا بڑی، اللہ کے ہاں اس کی قدر ہے، اور دوسروں کے ساتھ خوش اخلاقی سے پیش آنا بھی ایک صدقہ ہے۔",
    "english": "The essence of this Hadith is that no good deed is insignificant in the sight of Allah, and meeting others with kindness and a smile is a rewarded act of charity."
  },
  "references": [
    {
      "arabic": "رواه مسلم (2626)",
      "english": "Reported by Muslim (2626)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو ذر الغفاري",
        "english": "Abu Dharr al-Ghifari"
      },
      "slug": "abu-dharr-al-ghifari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9K8Z2o3T4Y",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نیکی کی ہمہ گیری",
        "english": "The Universality of Good Deeds"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کوئی نیکی معمولی نہیں",
              "english": "No Deed is Insignificant"
            },
            "content": {
              "urdu": [
                "اسلام میں ہر وہ کام جو خیر پر مبنی ہو، نیکی شمار ہوتا ہے۔",
                "بعض اوقات ایک چھوٹی سی نیکی انسان کی مغفرت کا ذریعہ بن جاتی ہے۔",
                "نیکی کو چھوٹا سمجھ کر چھوڑنا شیطان کا حربہ ہے تاکہ انسان اجر سے محروم رہے۔"
              ],
              "english": [
                "In Islam, every act based on goodness is counted as a virtue.",
                "Sometimes, a seemingly small deed becomes the reason for one's forgiveness.",
                "Belittling a deed is a tactic of Satan to keep a person away from rewards."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کے ہاں اجر کا معیار",
              "english": "Criteria of Reward with Allah"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ عمل کی ظاہری مقدار سے زیادہ نیت کے اخلاص کو دیکھتا ہے۔",
                "خلوصِ دل سے کی گئی چھوٹی نیکی پہاڑ جتنے ثواب میں بدل سکتی ہے۔",
                "نبی ﷺ نے ہمیں ہر لمحہ نیکی کمانے کے مواقع تلاش کرنے کا درس دیا ہے۔"
              ],
              "english": [
                "Allah looks at the sincerity of the intention more than the quantity of the act.",
                "A small deed done with pure sincerity can outweigh mountain-sized rewards.",
                "The Prophet (ﷺ) taught us to seek opportunities for virtue at every moment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خوش اخلاقی کی فضیلت",
        "english": "Excellence of Good Manners"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کشادہ چہرہ اور سماجی تعلقات",
              "english": "Smiling Face and Social Relations"
            },
            "content": {
              "urdu": [
                "دوسروں سے مسکرا کر ملنا باہمی محبت اور اپنائیت پیدا کرتا ہے۔",
                "یہ عمل دوسروں کے دلوں سے بوجھ اور پریشانی دور کرنے میں مدد دیتا ہے۔",
                "اسلام ایک ایسا معاشرہ چاہتا ہے جہاں لوگ ایک دوسرے کے لیے خوشی کا باعث بنیں۔"
              ],
              "english": [
                "Meeting others with a smile fosters mutual love and intimacy.",
                "This act helps in relieving the burdens and worries of others' hearts.",
                "Islam aims for a society where people are sources of joy for one another."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسکراہٹ بطور صدقہ",
              "english": "Smiling as Charity"
            },
            "content": {
              "urdu": [
                "دیگر روایات میں مسکراہٹ کو 'صدقہ' قرار دیا گیا ہے۔",
                "اگر آپ کے پاس خرچ کرنے کو مال نہیں، تو آپ اچھے اخلاق سے صدقہ کر سکتے ہیں۔",
                "یہ نیکی غریب و امیر ہر شخص کی پہنچ میں ہے۔"
              ],
              "english": [
                "In other narrations, a smile is explicitly called 'Sadaqah' (charity).",
                "If you lack wealth to spend, you can give charity through good character.",
                "This form of virtue is accessible to everyone, rich or poor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مثبت رویہ اپنائیں",
              "english": "Adopt a Positive Attitude"
            },
            "content": {
              "urdu": [
                "اپنے مزاج میں نرمی اور رویوں میں لچک پیدا کریں۔",
                "لوگوں کے سامنے تیکھے تیور اور تلخی دکھانے سے گریز کریں۔",
                "آپ کا ایک اچھا جملہ یا مسکراہٹ کسی کی زندگی میں امید بھر سکتی ہے۔"
              ],
              "english": [
                "Develop gentleness in your temperament and flexibility in attitudes.",
                "Avoid showing harshness or bitterness toward people.",
                "One kind sentence or a smile can fill someone's life with hope."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانیت کا احترام",
              "english": "Respect for Humanity"
            },
            "content": {
              "urdu": [
                "ہر انسان سے عزت اور وقار کے ساتھ پیش آنا ایمان کا حصہ ہے۔",
                "مومن کی پہچان اس کا بہترین اخلاق اور نرم کلامی ہے۔",
                "معاشرتی امن کے لیے خوش اخلاقی ریڑھ کی ہڈی کی حیثیت رکھتی ہے۔"
              ],
              "english": [
                "Treating every human with respect and dignity is part of faith.",
                "A believer is recognized by their excellent character and soft speech.",
                "Good manners serve as the backbone of social harmony."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزمرہ کی چھوٹی نیکیاں",
              "english": "Daily Small Virtues"
            },
            "content": {
              "urdu": [
                "راستے سے تکلیف دہ چیز ہٹانا، کسی کو سلام کرنا یا راستہ بتانا بھی نیکی ہے۔",
                "اپنے گھر والوں اور ماتحتوں سے مسکرا کر بات کرنا شروع کریں۔",
                "ہر اس موقع کو غنیمت سمجھیں جو آپ کو نیکی کی طرف لے جائے۔"
              ],
              "english": [
                "Removing a harmful object from a path, greeting someone, or giving directions are all virtues.",
                "Start by speaking with a smile to your family and subordinates.",
                "Seize every opportunity that leads you toward a good deed."
              ]
            }
          }
        ]
      }
    }
  ]
}