{
  "hadithId": 1318,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/88"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "الجامع - باب السيرة والجهاد",
    "babId": 106
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (4799)، والترمذي (2002)، وأحمد (6/442)، وصححه الألباني في صحيح الجامع (5721).",
    "urdu": "صحیح۔ اسے امام ابوداؤد (4799) اور امام ترمذی (2002) نے روایت کیا ہے، اور امام ترمذی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (4799) and At-Tirmidhi (2002), who graded it Sahih. Al-Albani also graded it Sahih in Sahih al-Jami' (5721)."
  },
  "importantWords": [
    {
      "arabic": "اَلْمِيزَانِ",
      "english": "The Scales",
      "urdu": "ترازو / میزان"
    },
    {
      "arabic": "أَثْقَلُ",
      "english": "Heavier",
      "urdu": "زیادہ وزنی"
    },
    {
      "arabic": "حُسْنِ اَلْخُلُقِ",
      "english": "Good character",
      "urdu": "اچھا اخلاق / حسنِ سلوک"
    }
  ],
  "summary": {
    "urdu": "قیامت کے دن جب اعمال تولے جائیں گے، تو حسنِ اخلاق وہ سب سے عظیم عمل ہوگا جو ترازو کے پلڑے کو سب سے زیادہ جھکائے گا۔",
    "english": "On the Day of Judgment when deeds are weighed, good character will be the greatest action that tips the scales the most in a believer's favor."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الأدب، باب في حسن الخلق، رقم 4799",
      "english": "Sunan Abi Dawud, Book of Manners, No. 4799"
    },
    {
      "arabic": "سنن الترمذي، كتاب البر والصلة، باب ما جاء في حسن الخلق، رقم 2002",
      "english": "Sunan at-Tirmidhi, Book of Virtue, No. 2002"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو الدرداء الأنصاري",
        "english": "Abu ad-Darda' al-Ansari"
      },
      "slug": "abu-ad-darda"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حسنِ اخلاق کی فضیلت",
        "english": "The Virtue of Good Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال کا وزن",
              "english": "Weight of Deeds"
            },
            "content": {
              "urdu": [
                "قیامت کے دن اللہ تعالیٰ اعمال کو تولنے کے لیے ایک حقیقی میزان (ترازو) قائم فرمائے گا۔",
                "نبی کریم ﷺ نے واضح فرمایا کہ نفل نمازوں اور روزوں کے مقابلے میں اچھا اخلاق میزان میں سب سے زیادہ بھاری ہوگا۔",
                "یہ اس بات کی دلیل ہے کہ اسلام میں حقوق العباد اور بہتر انسانی رویوں کی کتنی بڑی اہمیت ہے۔"
              ],
              "english": [
                "On the Day of Judgment, Allah will establish a real Scale (Mizan) to weigh the deeds of servants.",
                "The Prophet (ﷺ) clarified that compared to voluntary prayers and fasts, good character will be the heaviest on the Scale.",
                "This serves as evidence of the immense importance Islam places on the rights of others and refined human conduct."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حسنِ اخلاق کا مفہوم",
        "english": "The Meaning of Good Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جامع تعریف",
              "english": "Comprehensive Definition"
            },
            "content": {
              "urdu": [
                "حسنِ اخلاق کا مطلب ہے کشادہ پیشانی سے ملنا، نیکی پھیلانا اور دوسروں کو تکلیف دینے سے رکنا۔",
                "اس میں لوگوں کی خطاؤں کو معاف کرنا اور برائی کے بدلے بھلائی کرنا بھی شامل ہے۔",
                "عبداللہ بن مبارکؒ کے مطابق اس کے تین ارکان ہیں: خندہ پیشانی، سخاوت، اور لوگوں کو اذیت سے بچانا۔"
              ],
              "english": [
                "Good character means meeting others with a cheerful face, spreading goodness, and refraining from causing harm.",
                "It also includes forgiving people's mistakes and responding to evil with good.",
                "According to Abdullah bin al-Mubarak, it has three pillars: a smiling face, generosity, and preventing harm to others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمان اور اخلاق کا تعلق",
        "english": "Link Between Faith and Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کا کمال",
              "english": "Perfection of Faith"
            },
            "content": {
              "urdu": [
                "دوسری احادیث میں آتا ہے کہ 'مومنوں میں ایمان کے لحاظ سے سب سے کامل وہ ہے جس کے اخلاق سب سے اچھے ہوں۔'",
                "اچھا اخلاق صرف ایک معاشرتی ضرورت نہیں بلکہ ایمان کی پختگی کی علامت ہے۔",
                "نبی کریم ﷺ کی بعثت کا ایک بڑا مقصد ہی اخلاق کی تکمیل تھا۔"
              ],
              "english": [
                "Other narrations state that 'the most perfect of believers in faith are those with the best character.'",
                "Good character is not just a social necessity but a sign of firm faith.",
                "One of the primary purposes of the Prophet's (ﷺ) mission was the perfection of moral character."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعلقات میں نفاست",
              "english": "Refinement in Relationships"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی گفتگو اور رویوں میں نرمی اور عاجزی پیدا کریں۔",
                "کثرتِ عبادات کے ساتھ ساتھ اپنے اخلاق کی اصلاح پر بھی توجہ دینا ضروری ہے۔",
                "حسنِ اخلاق وہ صفت ہے جو انسان کو دنیا میں ہردلعزیز اور آخرت میں نبی ﷺ کا قریبی بناتی ہے۔"
              ],
              "english": [
                "We should cultivate gentleness and humility in our speech and attitudes.",
                "Along with performing many acts of worship, focusing on reforming our character is essential.",
                "Good character makes a person beloved in this world and brings them close to the Prophet (ﷺ) in the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}