{
  "hadithId": 770,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/770"],
    "kitabId": 7,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 56
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2103). وأخرجه مسلم (1202) من حديث أنس بن مالك رضي الله عنه بنحوه، وفيه ذكر اسم الحجام وهو أبو طيبة.",
    "urdu": "صحیح۔ اسے امام بخاری (2103) نے روایت کیا ہے۔ امام مسلم نے بھی حضرت انس سے ایسی ہی روایت بیان کی ہے جس میں سینگی لگانے والے کا نام ابو طیبہ ذکر کیا گیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2103). Muslim also reported a similar narration from Anas bin Malik (1202), identifying the cupper as Abu Taibah."
  },
  "importantWords": [
    {
      "arabic": "اِحْتَجَمَ",
      "english": "Had himself cupped",
      "urdu": "حجامہ کروایا / سینگی لگوائی"
    },
    {
      "arabic": "حَجَمَهُ",
      "english": "Performed cupping on him",
      "urdu": "اس نے سینگی لگائی"
    },
    {
      "arabic": "أَجْرَهُ",
      "english": "His wages / payment",
      "urdu": "اس کی اجرت"
    },
    {
      "arabic": "حَرَاماً",
      "english": "Forbidden",
      "urdu": "حرام / ناجائز"
    },
    {
      "arabic": "أَعْطَى",
      "english": "Gave",
      "urdu": "عطا فرمایا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ حجامہ (سینگی لگوانا) ایک مسنون علاج ہے اور اس کی خدمت فراہم کرنے والے کو اجرت دینا مکمل طور پر جائز اور حلال ہے۔",
    "english": "This Hadith establishes that Hijamah (cupping) is a Prophetic medical treatment and that paying for this service is entirely permissible and lawful."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2103)",
      "english": "Reported by Al-Bukhari (2103)"
    },
    {
      "arabic": "رواه مسلم (1202)",
      "english": "Reported by Muslim (1202)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حجامہ کی اجرت کا جواز",
        "english": "Permissibility of Wages for Cupping"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبوی عمل سے دلیل",
              "english": "Evidence from Prophetic Action"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ کا سینگی لگانے والے کو اجرت دینا اس کے حلال ہونے کی قطعی دلیل ہے۔",
                "ابن عباس رضی اللہ عنہما نے فقہی نکتہ واضح کیا کہ آپ ﷺ حرام مال کسی کو نہیں دیتے تھے۔",
                "یہ حدیث ان لوگوں کے لیے جواب ہے جو اس اجرت کو مکروہ یا ناپسندیدہ سمجھتے ہیں۔"
              ],
              "english": [
                "The Messenger of Allah (ﷺ) paying the cupper is a definitive proof of its lawfulness.",
                "Ibn Abbas (RA) clarified a legal point: the Prophet would never distribute haram wealth.",
                "This Hadith serves as a response to those who consider such wages as disliked or undesirable."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجرت کی نوعیت",
              "english": "Nature of the Payment"
            },
            "content": {
              "urdu": [
                "حجامہ ایک محنت طلب کام ہے جس میں وقت اور مہارت صرف ہوتی ہے۔",
                "شریعت کے مطابق کسی کی جائز محنت کا معاوضہ دینا عدل کا تقاضا ہے۔",
                "آپ ﷺ نے اس اجرت کو طیب (پاکیزہ) قرار دے کر اس پیشہ کی حوصلہ افزائی فرمائی۔"
              ],
              "english": [
                "Cupping is a labor-intensive task requiring both time and expertise.",
                "According to Shariah, paying for someone's legitimate labor is a requirement of justice.",
                "The Prophet (ﷺ) encouraged this profession by describing the wages as 'Tayyib' (pure)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دیگر روایات سے مطابقت",
        "english": "Harmony with Other Narrations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کسب الحجام خبیث کی وضاحت",
              "english": "Clarifying 'The Cupper's Earnings are Evil'"
            },
            "content": {
              "urdu": [
                "ایک اور حدیث میں 'حجام کی کمائی کو خبیث' کہا گیا ہے، جس سے مراد حرام نہیں بلکہ 'کمتر' ہے۔",
                "اس کا مقصد لوگوں کو اعلیٰ پیشوں کی طرف راغب کرنا تھا، نہ کہ اسے ناجائز قرار دینا۔",
                "یہاں 'خبیث' کا لفظ گندگی یا معمولی چیز کے معنی میں استعمال ہوا ہے جیسے لہسن کے لیے ہوا۔"
              ],
              "english": [
                "Another Hadith calls the cupper's earnings 'Khabith' (evil/lowly), meaning lowly, not haram.",
                "The aim was to encourage people toward nobler professions, not to render it prohibited.",
                "The term 'Khabith' here is used in the sense of something unappealing, similar to its use for garlic."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی تطبیق",
              "english": "Juristic Reconcilliation"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک حجامہ کی اجرت لینا مباح (جائز) ہے مگر کراہتِ تنزیہی پائی جاتی ہے۔",
                "آزاد شہری کے لیے اس پیشے سے بچنا بہتر ہے، لیکن غلام یا ضرورت مند کے لیے کوئی حرج نہیں۔",
                "آپ ﷺ نے خود اجرت دے کر عملی طور پر حرمت کا احتمال ختم کر دیا۔"
              ],
              "english": [
                "Jurists hold that taking wages for cupping is Mubah (allowed), though slightly disliked for free men.",
                "It is better for a free person to seek nobler work, but for a needy person, there is no harm.",
                "The Prophet (ﷺ) practically eliminated any doubt of total prohibition by paying for the service."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور سماجی اہمیت",
        "english": "Medical and Social Importance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ علاج کی ترویج",
              "english": "Promoting Sunnah Treatment"
            },
            "content": {
              "urdu": [
                "حجامہ بہترین علاجوں میں سے ایک ہے جس کی تائید جدید سائنس بھی کرتی ہے۔",
                "اجرت کا جواز اس بات کو یقینی بناتا ہے کہ یہ علاج معاشرے میں برقرار رہے۔",
                "اگر ماہرین کو اجرت نہ ملے تو وہ اس اہم طبی خدمت کو چھوڑ دیں گے۔"
              ],
              "english": [
                "Cupping is among the best treatments, a fact supported by modern medical science.",
                "The legality of wages ensures that this treatment remains available in society.",
                "If experts were not paid, they would abandon this essential medical service."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوقِ محنت کش",
              "english": "Rights of the Laborer"
            },
            "content": {
              "urdu": [
                "یہ حدیث مزدور کا پسینہ خشک ہونے سے پہلے اجرت دینے کے اصول کی تائید کرتی ہے۔",
                "آپ ﷺ نے موقع پر اجرت دے کر حسنِ معاملہ کی مثال قائم فرمائی۔",
                "مریض کو چاہیے کہ وہ معالج کی خدمت کا اعتراف کرے اور اسے بر وقت معاوضہ دے۔"
              ],
              "english": [
                "This Hadith supports the principle of paying the laborer before his sweat dries.",
                "The Prophet (ﷺ) set an example of excellent conduct by paying immediately on-site.",
                "A patient should acknowledge the healer's service and compensate them promptly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علاج اور دعا کا امتزاج",
              "english": "Combining Healing and Prayer"
            },
            "content": {
              "urdu": [
                "سنتِ نبوی کے مطابق بیماری میں اسباب اختیار کرنا اور معالج کی مدد لینا ضروری ہے۔",
                "حجامہ کروانا توکل کے منافی نہیں بلکہ عین سنت ہے۔",
                "معمولی خدمات کا بھی شکریہ ادا کرنا اور بدلہ دینا اسلامی اخلاق کا حصہ ہے۔"
              ],
              "english": [
                "According to Sunnah, one must adopt means and seek medical help during illness.",
                "Performing cupping is not against tawakkul (trust in Allah); rather, it is the Sunnah itself.",
                "Expressing gratitude and compensating even for minor services is part of Islamic ethics."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزقِ حلال کی پہچان",
              "english": "Recognizing Halal Provision"
            },
            "content": {
              "urdu": [
                "طبی خدمات کے ذریعے کمایا گیا مال طیب اور حلال ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اپنے پیشوں کی شرعی حیثیت کے بارے میں علم حاصل کریں۔",
                "کمائی کے وہی ذرائع اختیار کریں جن پر رسول اللہ ﷺ کی مہرِ تصدیق لگی ہو۔"
              ],
              "english": [
                "Wealth earned through medical services is pure and lawful.",
                "Muslims should seek knowledge regarding the Shariah status of their professions.",
                "One should adopt only those means of earning that bear the Prophet's (ﷺ) approval."
              ]
            }
          }
        ]
      }
    }
  ]
}