{
  "hadithId": 746,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/7/5"],
    "kitabId": 7,
    "inKitabBab": 9,
    "arabicBook": "كتاب الصلاة",
    "babId": 50
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (3642) مطولاً، وانظر رقم (819) في هذا الكتاب.",
    "urdu": "یہ روایت صحیح ہے، اسے امام بخاری نے (3642) پر طویل قصے کے ساتھ روایت کیا ہے۔ اس کا حوالہ بلوغ المرام میں 819 نمبر پر بھی دیکھا جا سکتا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (3642) in a long version. See also reference (819) in this collection."
  },
  "importantWords": [
    {
      "arabic": "بَعَثَ",
      "english": "Sent / Appointed",
      "urdu": "بھیجا / مقرر کیا"
    },
    {
      "arabic": "دِينَارٍ",
      "english": "Gold Coin (Dinar)",
      "urdu": "سونے کا سکہ (دینار)"
    },
    {
      "arabic": "يَشْتَرِي",
      "english": "To Buy",
      "urdu": "وہ خریدے"
    },
    {
      "arabic": "أُضْحِيَّةً",
      "english": "Sacrificial Animal",
      "urdu": "قربانی کا جانور"
    },
    {
      "arabic": "أَثْنَاءِ",
      "english": "During / Within",
      "urdu": "کے دوران"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ کسی دوسرے شخص کو خریداری یا قربانی کا جانور لانے کے لیے اپنا نمائندہ (وکیل) بنانا شرعی طور پر جائز ہے۔",
    "english": "This Hadith establishes the permissibility of appointing an agent (Wakalah) for purchasing goods or buying sacrificial animals."
  },
  "references": [
    {
      "arabic": "رواه البخاري في كتاب المناقب (3642)",
      "english": "Reported by Al-Bukhari in the Book of Virtues (3642)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عروة بن أبي الجعد البارقي",
        "english": "Urwah bin Abi al-Ja'd al-Bariqi"
      },
      "slug": "urwah-al-bariqi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Q05P0H-vQ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وکالت کا ثبوت",
        "english": "Evidence of Agency (Wakalah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمائندہ بنانا",
              "english": "Appointing an Agent"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے سیدنا عروہ کو رقم دے کر خریداری کے لیے بھیجا۔",
                "یہ اس بات کی دلیل ہے کہ انسان اپنے کام میں وکیل بنا سکتا ہے۔",
                "معاملاتِ زندگی میں دوسرے پر بھروسہ کرنا سنت سے ثابت ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) gave money to Urwah to purchase on his behalf.",
                "This serves as evidence that one can appoint an agent for tasks.",
                "Relying on others for transactions is established from the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "قربانی کی تیاری",
              "english": "Preparation for Sacrifice"
            },
            "content": {
              "urdu": [
                "حدیث سے قربانی کے لیے پہلے سے تیاری کرنے کا علم ہوتا ہے۔",
                "جانور کی خریداری میں دوسروں کی مہارت سے فائدہ اٹھایا جا سکتا ہے۔",
                "رسول اللہ ﷺ نے خود اس عمل کی نگرانی اور رہنمائی فرمائی۔"
              ],
              "english": [
                "The Hadith shows the practice of preparing for Udhiyah in advance.",
                "One can utilize the expertise of others in buying livestock.",
                "The Messenger of Allah (ﷺ) supervised and guided this process."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا عروہ کی برکت",
        "english": "Blessing of Urwah (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تجارت میں مہارت",
              "english": "Skill in Trade"
            },
            "content": {
              "urdu": [
                "سیدنا عروہ بارقی رضی اللہ عنہ تجارت میں بہت ماہر تھے۔",
                "انہوں نے ایک دینار سے دو بکریاں خریدیں اور پھر ایک فروخت کی۔",
                "نبی ﷺ نے ان کی اس سمجھداری پر ان کے لیے دعا فرمائی۔"
              ],
              "english": [
                "Urwah al-Bariqi was exceptionally skilled in trade and business.",
                "He bought two sheep with one Dinar and sold one for a Dinar.",
                "The Prophet (ﷺ) supplicated for blessings in his business deals."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی قبولیت",
              "english": "Acceptance of Supplication"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی دعا سے وہ مٹی بھی خریدتے تو سونا بن جاتی۔",
                "صحابی کی دیانتداری اور اللہ کے رسول کی برکت شاملِ حال رہی۔",
                "یہ واقعہ صحابہ کے اخلاص اور رسول اللہ ﷺ کے معجزے کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "With the Prophet's prayer, even trading dust would bring him profit.",
                "The honesty of the companion met the blessing of the Messenger.",
                "This event highlights the sincerity of Sahaba and the Prophet's miracle."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Jurisprudential Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی امانت",
              "english": "Trust of Wealth"
            },
            "content": {
              "urdu": [
                "وکیل کو چاہیے کہ وہ مال کا بہترین استعمال کرے۔",
                "امانت داری خریداری کے معاملات میں بنیادی شرط ہے۔",
                "سیدنا عروہ نے بہترین طریقے سے رقم کا استعمال کر کے دکھایا۔"
              ],
              "english": [
                "An agent must ensure the best possible use of entrusted funds.",
                "Trustworthiness is a fundamental condition in purchasing deals.",
                "Urwah demonstrated the perfect example of utilizing the Dinar."
              ]
            }
          },
          {
            "title": {
              "urdu": "خریداری میں نفع",
              "english": "Profit in Purchasing"
            },
            "content": {
              "urdu": [
                "وکیل اگر خریداری میں نفع کما لے تو وہ مالک کا فائدہ ہے۔",
                "اس حدیث سے 'بیع فضولی' کے متعلق بھی مسائل اخذ کیے جاتے ہیں۔",
                "فقہاء نے اس واقعے سے کئی مالیاتی قوانین وضع کیے ہیں۔"
              ],
              "english": [
                "If an agent gains extra profit, it benefits the original owner.",
                "This Hadith is used to derive rulings on 'unauthorized agency'.",
                "Jurists have formulated several financial laws from this incident."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلیٰ اخلاق",
              "english": "High Morals"
            },
            "content": {
              "urdu": [
                "نبی ﷺ اپنے صحابہ کی صلاحیتوں پر اعتماد فرماتے تھے۔",
                "کام بانٹنے سے معاشرے میں محبت اور تعاون بڑھتا ہے۔",
                "کسی کی ذہانت کی تعریف کرنا اور دعا دینا سنتِ نبوی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) trusted the capabilities of his companions.",
                "Delegating tasks fosters love and cooperation in society.",
                "Praising someone's intelligence and praying for them is Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "برکت کا مفہوم",
              "english": "Concept of Barakah"
            },
            "content": {
              "urdu": [
                "برکت صرف زیادہ مال میں نہیں بلکہ اللہ کی عطا میں ہے۔",
                "قلیل مال بھی اللہ کی دعا سے کثیر ہو سکتا ہے۔",
                "ہمیں اپنے رزق میں برکت کے لیے مسنون دعائیں کرنی چاہئیں۔"
              ],
              "english": [
                "Barakah is not in the quantity of wealth but in Allah's gift.",
                "Small amounts can become plenty through Allah's blessings.",
                "We should seek Prophetic supplications for barakah in sustenance."
              ]
            }
          }
        ]
      }
    }
  ]
}