{
  "hadithId": 33,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 5 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب الوضوء",
    "babId": 4
  },

  "takhreej": {
    "arabic": " صحيح.  رواه أبو داود (135) ، والنسائي (1/88)  من طريق عمرو بن شعيب، عن أبيه، عن جده، وله شواهد أخرى، إلا أن في هذا الحديث عند أبي داود لفظة لا تصح كما في \"الأصل\".  وصحح الحديث ابن خزيمة (174)  ولكن ليس عنده محل الشاهد. ",
    "urdu": "صحیح (درجہ)۔ اسے ابوداؤد (135)، اور نسائی (1/88) نے عمرو بن شعیب عن ابیہ عن جدہ کی سند سے روایت کیا ہے، اور اس کے دیگر شواہد بھی موجود ہیں۔ اگرچہ ابوداؤد کی اس روایت میں ایک ایسا لفظ ہے جو صحیح نہیں ہے۔ اور ابن خزیمہ (174) نے اس حدیث کو صحیح قرار دیا، لیکن ان کے پاس وہ خاص ٹکڑا نہیں ہے جو یہاں شاہد ہے۔",
    "english": "Sahih (Authentic). Narrated by Abu Dawud (135) and An-Nasa'i (1/88) through the chain of Amr bin Shu'aib, from his father, from his grandfather, and it has other corroborating reports. The Hadith was authenticated by Ibn Khuzaymah (174), though the specific part relating to the thumbs is not always present in his narration."
  },
  "importantWords": [
    {
      "arabic": "مَسَحَ بِرَأْسِهِ",
      "english": "Wiped his head",
      "urdu": "سر کا مسح کیا"
    },
    {
      "arabic": "إِصْبَعَيْهِ اَلسَّبَّاحَتَيْنِ",
      "english": "His two index fingers",
      "urdu": "دونوں شہادت والی انگلیاں"
    },
    {
      "arabic": "فِي أُذُنَيْهِ",
      "english": "Into his ears",
      "urdu": "کانوں میں"
    },
    {
      "arabic": "إِبْهَامَيْهِ",
      "english": "His two thumbs",
      "urdu": "انگوٹھوں سے"
    },
    {
      "arabic": "ظَاهِرَ أُذُنَيْهِ",
      "english": "The outside of his ears",
      "urdu": "کانوں کے باہر کا"
    },
    {
      "arabic": "مَسَحَ بِإِبْهَامَيْهِ",
      "english": "Wiped with his thumbs",
      "urdu": "انگوٹھوں سے مسح کیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سر کے مسح کے بعد کانوں کے مسح کا طریقہ کار واضح کرتی ہے، یعنی شہادت کی انگلیوں سے کانوں کے اندرونی حصے اور انگوٹھوں سے کانوں کے بیرونی حصے کا مسح کرنا چاہیے، اور یہ مسح سر کے مسح کے لیے استعمال ہونے والے پانی سے ہی کیا جاتا ہے۔",
    "english": "This Hadith clarifies the method for wiping the ears after the head: the Prophet (ﷺ) used his index fingers for the inside of the ears and his thumbs for the back/outside, all done with the same water used for the head."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 135",
      "english": "Sunan Abi Dawud, The Book of Purification, Hadith 135"
    },
    {
      "arabic": "سنن النسائي، كتاب الطهارة، رقم 88",
      "english": "Sunan An-Nasa'i, The Book of Purification, Hadith 88"
    },
    {
      "arabic": "صحيح ابن خزيمة، رقم 174",
      "english": "Sahih Ibn Khuzaymah, Hadith 174"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَبْدُ اَللَّهِ بْنُ عَمْرِو بْنِ اَلْعَاصِ رَضِيَ اَللَّهُ عَنْهُمَا",
        "english": "Abdullah bin Amr bin Al-Aas (May Allah be pleased with them both)"
      },
      "slug": "abdullah-bin-amr"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-11-wiping-ears",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کانوں کے مسح کا سنت طریقہ",
        "english": "The Sunnah Method for Wiping the Ears"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اندرونی اور بیرونی حصہ",
              "english": "Inner and Outer Parts of the Ear"
            },
            "content": {
              "urdu": [
                "یہ حدیث کانوں کے مسح کا سب سے مستند اور جامع طریقہ بیان کرتی ہے، جس میں کانوں کے اندر اور باہر دونوں حصوں کا مسح شامل ہے۔",
                "نبی اکرم ﷺ نے اندرونی خلاء کا مسح کرنے کے لیے اپنی شہادت والی دونوں انگلیوں کو کانوں کے سوراخوں میں داخل فرمایا۔",
                "اسی طرح، کانوں کے بیرونی حصے اور پشت کا مسح اپنے دونوں انگوٹھوں سے کیا، یہ عمل سر کے مسح کے ساتھ ہی کیا جاتا ہے۔"
              ],
              "english": [
                "This Hadith describes the most authentic and comprehensive method for wiping the ears, which includes both the inner and outer surfaces.",
                "The Prophet (ﷺ) used his two index fingers for the inside of the ears, placing them into the ear canals (or crevices).",
                "Simultaneously, he used his two thumbs to wipe the back/outer part of the ears; this action is performed immediately after wiping the head."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح کا حکم",
              "english": "The Ruling on Wiping the Ears"
            },
            "content": {
              "urdu": [
                "فقہاء کے درمیان اس بات میں اختلاف ہے کہ کانوں کا مسح وضو کا فرض ہے یا سنت، لیکن اس پر اجماع ہے کہ یہ وضو کا ایک اہم جز ہے۔",
                "جمہور (اکثر) علماء کے نزدیک کانوں کا مسح سنت ہے اور سر کے مسح کا تکملہ ہے، جو اس حدیث کی قوت سے بھی ثابت ہے۔",
                "اس کے ترک کرنے سے وضو باطل نہیں ہوتا، لیکن اس سنت کو چھوڑ دینا نبی ﷺ کی مکمل سنت کی پیروی میں نقص کا باعث ہے۔"
              ],
              "english": [
                "There is scholarly disagreement on whether wiping the ears is an obligation (Fard) or a Sunnah, but there is consensus that it is an integral part of the Wudu procedure.",
                "The majority of scholars hold that wiping the ears is a Sunnah and a complementary part of wiping the head, which is supported by the strength of this Hadith.",
                "Omitting it does not invalidate Wudu, but neglecting this Sunnah leads to a deficiency in fully following the Prophet's complete practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایک ہی پانی کا استعمال",
        "english": "The Use of Single Water Source"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سر اور کانوں کا مسح",
              "english": "Wiping the Head and Ears Together"
            },
            "content": {
              "urdu": [
                "صحیح احادیث کی روشنی میں، مسنون طریقہ یہ ہے کہ سر اور کانوں کا مسح **ایک ہی نئے پانی** سے کیا جائے، یعنی الگ سے نیا پانی نہ لیا جائے۔",
                "پہلے ہاتھ سر پر پھیرے جاتے ہیں اور پھر اسی رطوبت والے ہاتھ اور انگلیاں کانوں کے مسح کے لیے استعمال کی جاتی ہیں۔",
                "یہ حکم اس بات کی دلیل ہے کہ کانوں کو وضو میں سر کا ہی حصہ سمجھا جاتا ہے، جس سے اس عمل کی اہمیت مزید اجاگر ہوتی ہے۔"
              ],
              "english": [
                "Based on authentic Ahadith, the recommended practice is to wipe the head and ears with **a single, fresh scoop of water**, without taking new water for the ears.",
                "The hands are first swept over the head, and then the same moisture is used for the fingers and thumbs to wipe the inner and outer parts of the ears.",
                "This ruling supports the view that the ears are considered part of the head (for the purpose of Mas'h), which further emphasizes the importance of this step."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح کی ترتیب",
              "english": "The Order of Wiping"
            },
            "content": {
              "urdu": [
                "اس حدیث میں مسح کا عمل سر سے شروع ہو کر کانوں پر ختم ہوتا ہے، جس سے وضو میں **ترتیب (Tartīb)** کی اہمیت ثابت ہوتی ہے۔",
                "یعنی مسح سر کے ساتھ ہی کیا جاتا ہے، اور یہ پاؤں کو دھونے کے آخری عمل سے پہلے ہوتا ہے، جو اس کی ترتیب کو مضبوط کرتا ہے۔",
                "کانوں کے مسح کو سر کے مسح کے ساتھ اس لیے ملایا جاتا ہے کہ یہ دونوں اعضاء نسبتاً خشک ہوتے ہیں اور پانی کے چھینٹوں سے مکمل طور پر گیلا ہونا مشکل ہوتا ہے۔"
              ],
              "english": [
                "In this Hadith, the wiping sequence starts with the head and concludes with the ears, affirming the significance of **sequence (Tartīb)** in Wudu.",
                "The ear wipe is performed immediately after the head wipe and before the final washing of the feet, solidifying its place in the established order.",
                "The ears are linked with the head because both are relatively dry and difficult to moisten fully with the initial splashing of water, requiring the Mas'h action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور حدیث کا درجہ",
        "english": "Narrator and Hadith Grade"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عبداللہ بن عمرو",
              "english": "Sayyiduna Abdullah bin Amr"
            },
            "content": {
              "urdu": [
                "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہما ایک مشہور صحابی تھے جو علم اور کتابتِ حدیث میں خاص مقام رکھتے تھے۔",
                "آپ کو نبی ﷺ سے احادیث لکھنے کی اجازت تھی، اس لیے آپ کی روایات وضو کی تفصیلات کو محفوظ کرنے کے لیے بہت اہم سمجھی جاتی ہیں۔",
                "ان کی یہ روایت طہارت کے اس اہم رکن کی عملی صورت کو واضح کر کے فقہاء کو تفصیل فراہم کرتی ہے۔"
              ],
              "english": [
                "Sayyiduna Abdullah bin Amr bin Al-Aas (RA) was a famous Companion known for his dedication to knowledge and documenting the Ahadith.",
                "He was specially permitted by the Prophet (ﷺ) to write down narrations, making his accounts highly valuable for preserving the intricate details of Wudu.",
                "His narration clarifies the practical aspect of this essential pillar of purification, providing detailed guidance for jurists."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت کی تصدیق",
              "english": "Confirmation of Authenticity"
            },
            "content": {
              "urdu": [
                "اس حدیث کو امام ابن خزیمہ نے صحیح قرار دیا ہے، اور یہ دیگر شواہد کی موجودگی میں قوی اور قابل استدلال ہے۔",
                "یہ حکم طہارت کے مسائل میں نبی ﷺ کی سنت کو مکمل کرنے کے لیے ایک مضبوط دلیل کا کام کرتا ہے۔",
                "اس کی صحت کی تصدیق کی وجہ سے، کانوں کے مسح کا یہی طریقہ پوری امت میں مستند اور مقبول ہے۔"
              ],
              "english": [
                "The Hadith has been authenticated as Sahih by Imam Ibn Khuzaymah, making it strong and reliable for deriving legal rulings, especially due to its corroborating reports.",
                "This ruling provides a strong proof for completing the Prophet's Sunnah in matters of purification.",
                "Due to its confirmed authenticity, this specific method for wiping the ears is accepted and practiced across the Muslim community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حس اور جمال کا پہلو",
        "english": "Aesthetic and Spiritual Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کانوں کی صفائی کی اہمیت",
              "english": "Importance of Ear Cleanliness"
            },
            "content": {
              "urdu": [
                "وضو میں کانوں کو پاک کرنے کی تاکید اس بات کی دلیل ہے کہ اسلام جسم کی **مکمل صفائی اور جمال** کو اہمیت دیتا ہے۔",
                "نماز کی تیاری میں نہ صرف فرض اعضاء کو دھونا ہے، بلکہ وہ اعضاء بھی صاف ہونے چاہئیں جو ظاہری خوبصورتی کا حصہ ہوں۔",
                "کانوں کا تعلق سماعت سے ہے، اور نماز میں اللہ کی وحی سننے کے لیے اس عضو کو پاک کرنا بھی روحانی تیاری کا حصہ ہے۔"
              ],
              "english": [
                "The emphasis on cleaning the ears in Wudu demonstrates that Islam values **complete physical cleanliness and aesthetics**.",
                "Preparation for prayer involves not only washing the obligatory limbs but also purifying those areas that contribute to one's overall external neatness.",
                "The ears are related to hearing, and purifying this organ is also a part of spiritual preparation for listening to Allah's revelation during prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح کا اثر",
              "english": "The Spiritual Effect of Wiping"
            },
            "content": {
              "urdu": [
                "یہاں مسح کا عمل نہ صرف ظاہری صفائی ہے بلکہ ایک علامتی عمل بھی ہے جو اس عضو سے سرزد ہونے والے گناہوں کی معافی کا سبب بنتا ہے۔",
                "صحیح احادیث میں ذکر ہے کہ وضو کے پانی کے قطروں کے ساتھ ان اعضاء سے سرزد ہونے والے چھوٹے گناہ بھی دھل جاتے ہیں۔",
                "اس لیے ہر مسلمان کو اس مسح کو نہ صرف ایک رسم کے طور پر بلکہ گناہوں کی معافی کے ارادے سے مکمل کرنا چاہیے۔"
              ],
              "english": [
                "The act of wiping here is not just physical cleansing but a symbolic act that leads to the forgiveness of sins committed by this organ.",
                "Authentic Ahadith mention that minor sins committed by these limbs are washed away with the droplets of Wudu water.",
                "Therefore, every Muslim should perform this wiping not merely as a ritual but with the intention of seeking forgiveness for sins through this complete act of purity."
              ]
            }
          }
        ]
      }
    }
  ]
}
