{
  "hadithId": 128,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["1:128"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "ضعيف.  رواه أبو داود (311)، والترمذي (139)، وابن ماجه (648)، وأحمد (6/300)  وقال الترمذي: \"غريب\".  ضعيف.  كسابقه، وهو عند أبي داود (312)، والحاكم (175).  الصحيح في هذا الباب هو أن أكثر مدة النفاس أربعون يوماً، وهذا هو قول أم سلمة رضي الله عنها، وهو الثابت في الفقه. أما عدم قضاء الصلاة فمتفق عليه.",
    "urdu": "ضعیف (کمزور) روایت۔ اسے ابو داؤد (311)، ترمذی (139)، ابن ماجہ (648)، اور احمد (6/300) نے روایت کیا ہے، اور ترمذی نے اسے \"غریب\" (سند میں منفرد) کہا ہے۔ دوسرا جزء (نماز کی قضا نہ کرنے کا) بھی پہلے کی طرح ضعیف ہے۔ اسے ابو داؤد (312) اور حاکم (175) نے روایت کیا ہے۔ صحیح یہ ہے کہ نفاس کی زیادہ سے زیادہ مدت چالیس دن ہے، اور یہ ام سلمہ رضی اللہ عنہا کا قول ہے اور فقہ میں ثابت ہے۔ البتہ نماز کی قضا نہ کرنے کا حکم متفق علیہ ہے۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (311), At-Tirmidhi (139), Ibn Majah (648), and Ahmad (6/300). At-Tirmidhi called it 'Gharib' (solitary). The second part (not making up prayers) is also weak, similar to the first. Reported by Abu Dawud (312) and Al-Hakim (175). The correct ruling in this matter is that the maximum period for Nifas is forty days, which is the statement of Umm Salamah (RA) and established in jurisprudence. However, the ruling that she does not make up the prayers is agreed upon."
  },
  "importantWords": [
    {
      "arabic": "اَلنُّفَسَاءُ",
      "english": "The woman in Nifas (post-natal bleeding)",
      "urdu": "نفاس والی عورت"
    },
    {
      "arabic": "عَهْدِ رَسُولِ اَللَّهِ",
      "english": "The time of the Messenger of Allah",
      "urdu": "عہد رسالت مآب"
    },
    {
      "arabic": "أَرْبَعِينَ يَوْمًا",
      "english": "Forty days",
      "urdu": "چالیس دن"
    },
    {
      "arabic": "لَمْ يَأْمُرْهَا",
      "english": "He did not command her",
      "urdu": "آپ نے حکم نہیں دیا"
    },
    {
      "arabic": "بِقَضَاءِ",
      "english": "To make up/qada",
      "urdu": "قضاء کرنے کا"
    },
    {
      "arabic": "صَلَاةِ اَلنِّفَاسِ",
      "english": "Prayer of Nifas",
      "urdu": "نفاس کی نماز"
    }
  ],
  "summary": {
    "urdu": "اس روایت میں ام سلمہ رضی اللہ عنہا نے بیان کیا کہ نبی ﷺ کے زمانے میں عورتیں نفاس (زچگی کے بعد کا خون) کے لیے چالیس دن کی مدت پر عمل کرتی تھیں۔ روایت کا دوسرا حصہ واضح کرتا ہے کہ نفاس کی حالت میں چھوڑی ہوئی نمازوں کی قضاء کا حکم نہیں دیا گیا تھا۔",
    "english": "Umm Salamah (RA) reported that during the Prophet's time, women observed the maximum duration of Nifas (post-natal bleeding) as forty days. The second part of the narration states that the Prophet ﷺ did not command the woman to make up the prayers missed during Nifas."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (311)",
      "english": "Reported by Abu Dawud (311)"
    },
    {
      "arabic": "رواه الترمذي (139)",
      "english": "Reported by At-Tirmidhi (139)"
    },
    {
      "arabic": "صححه الحاكم (175)",
      "english": "Authenticated by Al-Hakim (175)"
    }
  ],
  "narrators": [
    {
      "id": 12801,
      "name": {
        "arabic": "أُمُّ سَلَمَةَ هِنْد بِنْت أَبِي أُمَيَّة",
        "english": "Umm Salamah Hind bint Abi Umayyah"
      },
      "slug": "umm-salamah-hind-bint-abi-umayyah"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "ضعيف/صحيح الحكم",
    "english": "Weak/Authentic Ruling"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نفاس کی مدت اور حکم",
        "english": "Duration and Ruling of Nifas"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زیادہ سے زیادہ مدت",
              "english": "Maximum Duration"
            },
            "content": {
              "urdu": [
                "اس روایت کے مطابق، نبی ﷺ کے زمانے میں نفاس کی زیادہ سے زیادہ مدت چالیس دن سمجھی جاتی تھی۔",
                "فقہاء کی اکثریت اسی چالیس دن کی مدت کو اختیار کرتی ہے، جو عموماً نفاس کا اختتام ہوتا ہے۔",
                "اگر خون چالیس دن سے پہلے رک جائے تو عورت کو غسل کر کے نماز، روزہ شروع کر دینا چاہیے، وہ پاک سمجھی جائے گی۔"
              ],
              "english": [
                "According to this narration, the maximum duration for Nifas during the Prophet's time was considered forty days.",
                "The majority of jurists adopt this forty-day period as the common endpoint of post-natal bleeding.",
                "If the bleeding stops before forty days, the woman should perform Ghusl and resume prayer/fasting, as she is considered pure."
              ]
            }
          },
          {
            "title": {
              "urdu": "چالیس دن کے بعد کا حکم",
              "english": "Ruling After Forty Days"
            },
            "content": {
              "urdu": [
                "اگر چالیس دن کے بعد بھی خون جاری رہے تو یہ استحاضہ (بیماری کا خون) شمار ہوگا نہ کہ نفاس۔",
                "چالیس دن کے بعد عورت پر غسل واجب ہے، اور وہ نماز شروع کر دے گی، خواہ خون جاری رہے۔",
                "اس کے بعد وہ استحاضہ والی عورت کی طرح ہر نماز کے وقت وضو کرے گی۔"
              ],
              "english": [
                "If bleeding continues after forty days, it is classified as Istihadah (sickness bleeding), not Nifas.",
                "After forty days, Ghusl is obligatory upon the woman, and she must start praying, even if the bleeding continues.",
                "Afterward, she should perform Wudu for every prayer, similar to a woman with Istihadah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کی قضاء کا حکم",
        "english": "Ruling on Making up Prayers (Qada)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قضاء کا نہ ہونا",
              "english": "No Obligation to Make up"
            },
            "content": {
              "urdu": [
                "یہ امر متفق علیہ ہے کہ نفاس کے دوران چھوٹی ہوئی نمازوں کی قضاء عورت پر واجب نہیں ہے۔",
                "یہ حکم حیض کے دوران چھوٹی ہوئی نمازوں کے حکم کی طرح ہی ہے اور اللہ کی طرف سے رحمت ہے۔",
                "نماز چھوڑنے کی وجہ شرعی ممانعت ہے، لہٰذا وہ گناہ گار نہیں ہے اور قضا نہیں کرے گی۔"
              ],
              "english": [
                "It is unanimously agreed upon that a woman is not obligated to make up the prayers missed during Nifas.",
                "This ruling is the same as that for prayers missed during menses and is an act of mercy from Allah.",
                "The reason for skipping prayer is a legal prohibition, so she is not sinful and does not need to make up (Qada)."
              ]
            }
          },
          {
            "title": {
              "urdu": "روزے کی قضاء",
              "english": "Making up Fasts (Qada)"
            },
            "content": {
              "urdu": [
                "نفاس کے دوران چھوڑے گئے روزوں کی قضاء کرنا واجب ہے، جیسا کہ حیض کی حالت میں ہوتا ہے۔",
                "اس کی وجہ یہ ہے کہ روزے پورے سال میں ایک بار آتے ہیں، جبکہ نمازیں بار بار آتی ہیں۔",
                "قضاء کی یہ ادائیگی اللہ کے حکم کی تعمیل اور نقصان کو پورا کرنے کے لیے ہے۔"
              ],
              "english": [
                "Making up the fasts missed during Nifas is obligatory (Wajib), similar to the case of menses.",
                "The reason is that fasts occur once a year (Ramadan), while prayers occur frequently throughout the day.",
                "This Qada is done in compliance with Allah's command and to compensate for the missed worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند اور حکم کی مطابقت",
        "english": "Chain Status and Ruling Consistency"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کی سند",
              "english": "Narration Chain"
            },
            "content": {
              "urdu": [
                "نفاس کی مدت کے حوالے سے یہ روایت اگرچہ سنداً ضعیف ہے، مگر فقہی اصول میں یہ حکم لیا گیا ہے۔",
                "اس روایت کا دوسرا جزء (نماز قضاء نہ کرنے کا) اگرچہ سنداً ضعیف ہے، مگر صحیح احادیث کی تائید سے حکماً صحیح ہے۔",
                "فقہاء نے اس مسئلے میں احتیاط اور دیگر نصوص کو بنیاد بنا کر چالیس دن کی مدت کو اختیار کیا ہے۔"
              ],
              "english": [
                "Although the chain regarding the duration of Nifas is weak, the ruling itself is adopted in jurisprudence.",
                "The second part (not making up prayers), though weak in chain, is sound in ruling due to supporting authentic Hadiths.",
                "Jurists adopted the forty-day period based on precaution and consistency with other legal texts."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت میں آسانی",
              "english": "Ease in the Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا عورتوں کو ان کی طبی حالت کی وجہ سے نمازوں کی قضاء نہ کرنے کا حکم آسانی پر مبنی ہے۔",
                "اس سے ظاہر ہوتا ہے کہ شریعت کا مقصد مشقت ڈالنا نہیں بلکہ آسانیاں فراہم کرنا ہے۔",
                "عورت کے لیے زچگی کے بعد کی حالت میں یہ شرعی حکم ایک بڑی راحت ہے۔"
              ],
              "english": [
                "The Prophet's command not to make up prayers due to the woman's physical state is based on ease.",
                "This shows that the intent of Sharia is not to impose hardship but to provide facilities.",
                "This legal ruling is a great comfort for the woman during the post-natal period."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اور اخلاقی درس",
        "english": "Practical and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفاس میں احتیاط",
              "english": "Precaution in Nifas"
            },
            "content": {
              "urdu": [
                "نفاس والی عورت کو چاہیے کہ وہ چالیس دن کے اختتام کا انتظار نہ کرے بلکہ خون رکتے ہی غسل کرے۔",
                "اگر چالیس دن مکمل ہو جائیں اور خون جاری رہے، تو نماز چھوڑنا گناہ ہے، کیونکہ یہ استحاضہ ہے۔",
                "عورت کو چاہیے کہ وہ اس شرعی حکم پر عمل پیرا ہو اور لاپرواہی نہ کرے۔"
              ],
              "english": [
                "A woman in Nifas should not wait for the full forty days but perform Ghusl as soon as the bleeding stops.",
                "If forty days are completed and bleeding continues, abandoning prayer is sinful, as it becomes Istihadah.",
                "The woman must adhere to this legal ruling and not be negligent."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی رحمت",
              "english": "Allah's Mercy"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے عورتوں کو زچگی کے بعد کی کمزوری میں عبادت سے بوجھل نہیں کیا۔",
                "چھوٹی ہوئی نمازوں کی قضا معاف کرنا، اللہ کی طرف سے اپنے بندوں پر رحمت کی ایک بڑی دلیل ہے۔",
                "یہ حکم اللہ کی حدود کی پابندی اور اس کی طرف سے دی گئی آسانیوں کو قبول کرنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Allah did not burden women with worship during the weakness following childbirth.",
                "Forgiving the Qada of missed prayers is a great proof of Allah's mercy upon His servants.",
                "This ruling encourages adherence to Allah's boundaries and acceptance of the ease granted by Him."
              ]
            }
          }
        ]
      }
    }
  ]
}
