{
  "hadithId": 510,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/510"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
  
  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (1682)، والترمذي (2449). وفي إسناده عطية العوفي وهو ضعيف، لكن للحديث شواهد في فضل إطعام الطعام وسقي الماء تقوي معناه العام.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے ابوداؤد (1682) اور ترمذی (2449) نے روایت کیا ہے۔ اس کی سند میں عطیہ عوفی ہیں جو ضعیف ہیں، تاہم دیگر احادیث سے ان اعمال کی فضیلت ثابت ہے۔",
    "english": "Weak. Reported by Abu Dawud (1682) and At-Tirmidhi (2449). Its chain contains 'Atiyyah al-'Awfi who is weak, though general virtues of these acts are supported by other texts."
  },
  "importantWords": [
    {
      "arabic": "كَسَا",
      "english": "Clothed / Dressed",
      "urdu": "لباس پہنایا"
    },
    {
      "arabic": "عُرْيٍ",
      "english": "Nakedness",
      "urdu": "برہنگی"
    },
    {
      "arabic": "أَطْعَمَ",
      "english": "Fed",
      "urdu": "کھانا کھلایا"
    },
    {
      "arabic": "ظَمَإٍ",
      "english": "Thirst",
      "urdu": "پیاس"
    },
    {
      "arabic": "الرَّحِيقِ اَلْمَخْتُومِ",
      "english": "Sealed Nectar",
      "urdu": "مہر بند نفیس شراب"
    },
    {
      "arabic": "خُضْرِ",
      "english": "Green garments",
      "urdu": "سبز لباس"
    }
  ],
  "summary": {
    "urdu": "حدیث میں بھوکے کو کھانا کھلانے، پیاسے کو پانی پلانے اور ضرورت مند کو لباس مہیا کرنے کی عظیم فضیلت بیان کی گئی ہے کہ اللہ اس کا بدلہ جنت کی نعمتوں سے دے گا۔",
    "english": "The Hadith highlights the immense reward for feeding the hungry, quenching the thirsty, and clothing the needy, promising Paradise's exclusive blessings in return."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1682)",
      "english": "Sunan Abi Dawud (1682)"
    },
    {
      "arabic": "سنن الترمذي (2449)",
      "english": "Sunan At-Tirmidhi (2449)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري رضي الله عنه",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-sa-id-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S1qJ2A4f1O8",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بنیادی انسانی ضروریات کی فراہمی",
        "english": "Providing Basic Human Needs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لباس اور ستر پوشی",
              "english": "Clothing and Modesty"
            },
            "content": {
              "urdu": [
                "کسی مجبور انسان کو لباس مہیا کرنا اس کی عزتِ نفس کی حفاظت ہے۔",
                "اللہ تعالیٰ اس عمل کے بدلے بندے کو جنت کے ریشمی لباس پہنائے گا۔",
                "ستر پوشی میں مدد کرنا اللہ کے ہاں انتہائی پسندیدہ اور اجر والا عمل ہے۔"
              ],
              "english": [
                "Providing clothes to a needy person protects their dignity and self-respect.",
                "In return for this act, Allah will clothe the believer in silk garments of Paradise.",
                "Helping others maintain modesty is highly favored and rewarded by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھانا اور پانی کی اہمیت",
              "english": "Importance of Food and Water"
            },
            "content": {
              "urdu": [
                "بھوکے کو کھانا کھلانا اسلام کے بنیادی اخلاقی تقاضوں میں سے ایک ہے۔",
                "پیاسے کی پیاس بجھانا بہترین صدقہ ہے جو جہنم کی آگ سے بچاتا ہے۔",
                "یہ اعمال براہ راست انسانی جانوں کے تحفظ اور بقا سے وابستہ ہیں۔"
              ],
              "english": [
                "Feeding the hungry is one of the core moral requirements in Islam.",
                "Quenching a person's thirst is a superior charity that protects from Hellfire.",
                "These acts are directly linked to the preservation and survival of human life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جزا کا اصول: جیسی کرنی ویسی بھرنی",
        "english": "Principle of Retribution in Kind"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمل کے مطابق اجر",
              "english": "Reward Commensurate with Deed"
            },
            "content": {
              "urdu": [
                "حدیث سے ثابت ہے کہ جزا ہمیشہ عمل کی نوعیت کے مطابق دی جاتی ہے۔",
                "جس نے دنیا میں کسی کی تنگی دور کی، اللہ آخرت میں اس کی تنگی دور کرے گا۔",
                "دنیا کی فانی اشیاء کے بدلے آخرت کی دائمی نعمتیں ملنا ایک عظیم سودا ہے۔"
              ],
              "english": [
                "The Hadith confirms that rewards are given according to the nature of the deed.",
                "Whoever relieves someone's hardship in this world, Allah relieves theirs hereafter.",
                "Trading temporary worldly items for eternal heavenly blessings is a great deal."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنت کی مخصوص نعمتیں",
              "english": "Specific Blessings of Paradise"
            },
            "content": {
              "urdu": [
                "جنت کے پھل اور رحیق مختوم ان لوگوں کا خاص حق ہے جو سخی تھے۔",
                "سبز لباس (خضر الجنة) اہل جنت کے لیے اعلیٰ ترین اعزاز کی علامت ہے۔",
                "اللہ کی مہر بند شراب ان کے لیے ہے جنہوں نے لوگوں کے حلق تر کیے۔"
              ],
              "english": [
                "Heavenly fruits and sealed nectar are the rights of those who were generous.",
                "Green garments represent a high honor reserved for the residents of Paradise.",
                "Allah's sealed nectar is for those who quenched the thirst of others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی ہمدردی اور اخوت",
        "english": "Social Sympathy and Brotherhood"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلامی بھائی چارے کا ثبوت",
              "english": "Evidence of Islamic Brotherhood"
            },
            "content": {
              "urdu": [
                "ایک مسلمان دوسرے مسلمان کا بھائی ہے اور اس کی ضرورت کا خیال رکھتا ہے۔",
                "مصیبت زدہ لوگوں کی مدد کرنا معاشرے میں محبت کو فروغ دیتا ہے۔",
                "یہ اعمال معاشرے سے غربت اور محرومی کے احساس کو ختم کرتے ہیں۔"
              ],
              "english": [
                "A Muslim is a brother to another Muslim and looks after their needs.",
                "Helping people in distress promotes love and unity within the community.",
                "These acts eliminate the feelings of poverty and deprivation in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "خدمتِ خلق کی ترغیب",
              "english": "Encouragement of Public Service"
            },
            "content": {
              "urdu": [
                "صرف نماز روزہ ہی نہیں، بلکہ مخلوق کی خدمت بھی بڑی عبادت ہے۔",
                "اللہ کے نزدیک بہترین شخص وہ ہے جو دوسروں کے لیے نفع بخش ہو۔",
                "انسانیت کی خدمت کو جنت کے حصول کا آسان راستہ بتایا گیا ہے۔"
              ],
              "english": [
                "Not just fasting and prayer, but serving creatures is also a great worship.",
                "The best person in Allah's sight is the one who benefits others the most.",
                "Serving humanity is presented as an easy path to attaining Paradise."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستحقین کی تلاش",
              "english": "Searching for the Deserving"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے آس پاس ایسے خاموش لوگوں کو ڈھونڈنا چاہیے جو محتاج ہوں۔",
                "پرانے لیکن پہننے کے قابل کپڑے بھی کسی کی ضرورت پوری کر سکتے ہیں۔",
                "اپنے کھانوں میں سے غریب پڑوسیوں کا حصہ نکالنا سنتِ نبوی ہے۔"
              ],
              "english": [
                "We should look for silent, needy people in our surroundings.",
                "Old but wearable clothes can still fulfill someone's urgent need.",
                "Setting aside a portion of our meals for poor neighbors is a Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ کے مواقع ضائع نہ کریں",
              "english": "Do Not Waste Charity Opportunities"
            },
            "content": {
              "urdu": [
                "پانی پلانے جیسا چھوٹا عمل بھی جنت کے بڑے دروازے کھول سکتا ہے۔",
                "نیکی کرتے وقت سند کی کمزوری سے زیادہ عمل کی فضیلت پر نظر رکھیں۔",
                "اخلاص کے ساتھ کیا گیا معمولی خرچ بھی آخرت میں ڈھال بن جائے گا۔"
              ],
              "english": [
                "Small acts like giving water can open vast doors of Paradise.",
                "When doing good, focus more on the virtue than the chain's weakness.",
                "Minor spending with sincerity will become a shield in the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}