{
  "hadithId": 903,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["muslim:2019"],
    "kitabId": 8,
    "inKitabBab": 5,
    "arabicBook": "كتاب الأشربة",
    "babId": 68
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (2019) من طريق الليث ، عن أبي الزبير ، عن جابر ، به . وأبو الزبير عن جابر صحيحة إذا كانت من طريق الليث بن سعد لأنه صرح بالسماع.",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح (2019) میں لیث بن سعد کے واسطے سے ابو الزبیر سے اور انہوں نے جابر رضی اللہ عنہ سے روایت کیا ہے۔ یہ سند مکمل طور پر صحیح ہے۔",
    "english": "Sahih. Recorded by Muslim (2019) through the chain of Al-Layth, from Abu al-Zubair, from Jabir. This chain is authentic as Al-Layth clarified the hearing of Abu al-Zubair from Jabir."
  },
  "importantWords": [
    {
      "arabic": "لَا تَأْكُلُوا",
      "english": "Do not eat",
      "urdu": "تم مت کھاؤ"
    },
    {
      "arabic": "الشِّمَالِ",
      "english": "The left hand",
      "urdu": "بایاں ہاتھ"
    },
    {
      "arabic": "الشَّيْطَانَ",
      "english": "The Satan",
      "urdu": "شیطان"
    },
    {
      "arabic": "فَإِنَّ",
      "english": "For indeed / because",
      "urdu": "پس بے شک / کیونکہ"
    },
    {
      "arabic": "يَأْكُلُ",
      "english": "He eats",
      "urdu": "وہ کھاتا ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بائیں ہاتھ سے کھانے کی ممانعت کی گئی ہے کیونکہ یہ شیطان کا طریقہ ہے، اور مسلمانوں کو اس کی مشابہت سے بچنے کا حکم ہے۔",
    "english": "This Hadith prohibits eating with the left hand because it is the practice of Shaitan, and Muslims are commanded to avoid imitating him."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2019)",
      "english": "Sahih Muslim (2019)"
    },
    {
      "arabic": "سنن ابن ماجه (3268)",
      "english": "Sunan Ibn Majah (3268)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شیطان کی مشابہت سے ممانعت",
        "english": "Prohibition of Imitating Shaitan"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان کا طریقہ",
              "english": "The Way of Shaitan"
            },
            "content": {
              "urdu": [
                "بائیں ہاتھ سے کھانا اور پینا شیطان کی خصوصیت ہے جو تکبر کی علامت ہے۔",
                "نبی کریم ﷺ نے ہمیں ہر اس کام سے روکا ہے جو شیطان کی پہچان ہو۔",
                "اس ممانعت کا مقصد مومن کو شیطانی اثرات اور اس کی پیروی سے بچانا ہے۔"
              ],
              "english": [
                "Eating and drinking with the left hand is a trait of Shaitan, symbolizing arrogance.",
                "The Prophet (ﷺ) forbade us from every action that is a hallmark of Shaitan.",
                "This prohibition aims to protect believers from Satanic influences and imitation."
              ]
            }
          },
          {
            "title": {
              "urdu": "تشبہ کے نقصانات",
              "english": "Dangers of Imitation"
            },
            "content": {
              "urdu": [
                "کسی کے طریقے کو اپنانے سے انسان کے باطن پر اس کے اثرات مرتب ہوتے ہیں۔",
                "شیطان کی مشابہت انسان کو اللہ کی رحمت سے دور اور نافرمانی کے قریب کرتی ہے۔",
                "مسلمان کو اپنی شناخت اور اسلامی آداب پر فخر ہونا چاہیے نہ کہ دوسروں کی نقل۔"
              ],
              "english": [
                "Adopting someone's manners eventually influences a person's inner character.",
                "Imitating Shaitan distances a person from Allah's mercy and leads to disobedience.",
                "A Muslim should take pride in Islamic etiquette rather than imitating others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور حکمت",
        "english": "Juristic Rulings and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بائیں ہاتھ کی ممانعت کا حکم",
              "english": "Ruling on the Left Hand"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک بائیں ہاتھ سے کھانا بغیر عذر کے مکروہِ تحریمی یا حرام ہے۔",
                "اگر کوئی شخص معذوری یا بیماری کی وجہ سے مجبور ہو تو اس کے لیے رخصت ہے۔",
                "دائیں ہاتھ کو کھانے پینے اور بائیں کو صفائی و استنجا کے لیے خاص کیا گیا ہے۔"
              ],
              "english": [
                "Most scholars consider eating with the left hand without a valid excuse as forbidden.",
                "There is a concession for those who are forced due to disability or illness.",
                "The right hand is for eating/drinking, while the left is for hygiene and cleaning."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت اور نظافت",
              "english": "Purity and Cleanliness"
            },
            "content": {
              "urdu": [
                "اسلام نے انسانی فطرت کے عین مطابق دائیں اور بائیں ہاتھ کے کام بانٹ دیے ہیں۔",
                "بایاں ہاتھ ناپاکی دور کرنے کے لیے استعمال ہوتا ہے، اس لیے اسے کھانے سے دور رکھا گیا۔",
                "یہ تقسیم طبی لحاظ سے بھی جراثیم سے بچاؤ اور صفائی کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Islam has divided tasks between hands in total alignment with human nature.",
                "The left hand is used for removing impurities, so it is kept away from food.",
                "This division is medically sound for avoiding germs and maintaining hygiene."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے پینے کے یکساں احکام",
              "english": "Uniform Rules for Food and Drink"
            },
            "content": {
              "urdu": [
                "جس طرح بائیں ہاتھ سے کھانا منع ہے، اسی طرح بائیں سے پینا بھی منع ہے۔",
                "کچھ لوگ کھانا دائیں سے کھاتے ہیں مگر پانی بائیں سے پیتے ہیں، یہ بھی غلط ہے۔",
                "سنتِ نبوی کی مکمل پیروی ہی میں دونوں جہاں کی کامیابی اور برکت ہے۔"
              ],
              "english": [
                "Just as eating with the left is forbidden, drinking with the left is also prohibited.",
                "Some people eat with the right but drink with the left; this is also incorrect.",
                "Success and blessing lie in complete adherence to the Prophetic Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کو سنت کا عادی بنانا",
              "english": "Making Children Habitual"
            },
            "content": {
              "urdu": [
                "بچوں میں اکثر بائیں ہاتھ سے کھانے کا رجحان ہوتا ہے، اسے شروع ہی سے بدلنا چاہیے۔",
                "والدین کو چاہیے کہ پیار سے بچے کا ہاتھ پکڑ کر اسے دائیں ہاتھ کی عادت ڈالیں۔",
                "یہ سنت پر عمل کرنے کا پہلا قدم ہے جو بچے کی شخصیت کا حصہ بن جاتا ہے۔"
              ],
              "english": [
                "Children often tend to use the left hand; this must be corrected from the start.",
                "Parents should gently guide the child's hand to develop the right-hand habit.",
                "This is the first step in following the Sunnah that becomes part of their personality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اثرات",
        "english": "Spiritual Effects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برکت کا حصول",
              "english": "Attaining Blessings"
            },
            "content": {
              "urdu": [
                "سنت کے مطابق دائیں ہاتھ سے کھانے سے رزق میں برکت اور اطمینان نصیب ہوتا ہے۔",
                "شیطان کے طریقے پر چلنے سے برکت اٹھ جاتی ہے اور انسان روحانی پیاس محسوس کرتا ہے۔",
                "چھوٹی چھوٹی سنتوں پر عمل کرنا اللہ کی محبت پانے کا ذریعہ بنتا ہے۔"
              ],
              "english": [
                "Eating with the right hand according to Sunnah brings barakah and peace to provision.",
                "Following Shaitan's way removes blessings and leaves one spiritually unfulfilled.",
                "Practicing even small Sunnahs is a means to attain the love of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کی تربیت",
              "english": "Training of the Soul"
            },
            "content": {
              "urdu": [
                "اپنی مرضی کے بجائے اللہ کے رسول ﷺ کے حکم کو ماننا نفس کی بہترین تربیت ہے۔",
                "یہ عمل انسان کو نظم و ضبط اور اطاعت گزاری کا خوگر بناتا ہے۔",
                "اسلامی آداب کا ہر پہلو انسان کو ایک باوقار اور مہذب مسلمان بناتا ہے۔"
              ],
              "english": [
                "Choosing the Prophet's command over one's own preference is great soul training.",
                "This practice makes a person accustomed to discipline and obedience.",
                "Every aspect of Islamic etiquette molds a person into a dignified Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}