{
  "hadithId": 1217,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/14/28"],
    "kitabId": 14,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأقضية",
    "babId": 99
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه الدارقطني (4/209) والحاكم (4/100). قال الحافظ ابن حجر في التلخيص: إسناده ضعيف. وفي الباب أحاديث أخرى تعارضه أو تفسره.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے دارقطنی (4/209) نے روایت کیا ہے۔ حافظ ابن حجر نے 'التلخیص' میں اسے ضعیف قرار دیا ہے۔ اس موضوع پر دیگر روایات بھی موجود ہیں جو اس کی وضاحت کرتی ہیں۔",
    "english": "Weak. Reported by Ad-Daraqutni (4/209) and Al-Hakim (4/100). Al-Hafiz Ibn Hajar stated in 'Al-Talkhis' that its chain is weak. There are other narrations on this topic that offer further context."
  },
  "importantWords": [
    {
      "arabic": "اِخْتَصَمَا",
      "english": "Disputed/Litigated",
      "urdu": "جھگڑا کیا / مقدمہ لائے"
    },
    {
      "arabic": "نَاقَةٍ",
      "english": "She-camel",
      "urdu": "اونٹنی"
    },
    {
      "arabic": "نُتِجَتْ",
      "english": "Was born/Produced",
      "urdu": "پیدا ہوئی / بچہ جنا"
    },
    {
      "arabic": "بَيِّنَةً",
      "english": "Evidence/Witnesses",
      "urdu": "گواہ / ثبوت"
    },
    {
      "arabic": "فِي يَدِهِ",
      "english": "In his possession",
      "urdu": "اس کے قبضے میں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیان کیا گیا ہے کہ جب ملکیت کے دعوے اور گواہ برابر ہو جائیں تو ظاہری قبضے (Possession) کو بنیاد بنا کر فیصلہ کیا جا سکتا ہے۔",
    "english": "This Hadith suggests that when claims and evidence are equal, the current possession of the item can be used as a deciding factor in judgment."
  },
  "references": [
    {
      "arabic": "رواه الدارقطني (4/209)",
      "english": "Reported by Ad-Daraqutni (4/209)"
    },
    {
      "arabic": "رواه الحاكم (4/100)",
      "english": "Reported by Al-Hakim (4/100)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله الأنصاري",
        "english": "Jabir bin Abdullah Al-Ansari"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9K8Z2o3T4Y",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ملکیت کا فیصلہ اور قبضہ",
        "english": "Ownership and Possession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبضہ بطورِ دلیل",
              "english": "Possession as Evidence"
            },
            "content": {
              "urdu": [
                "جس شخص کے پاس چیز موجود ہو، اسے 'ذوالید' کہا جاتا ہے اور وہ ظاہری مالک سمجھا جاتا ہے۔",
                "اگر دوسرا فریق ٹھوس ثبوت نہ دے سکے تو قبضہ مالک کے حق میں دلیل بنتا ہے۔",
                "یہ اصول عدالتی نظام میں ملکیت کے تنازعات حل کرنے میں کلیدی کردار ادا کرتا ہے۔"
              ],
              "english": [
                "The person in possession of an item is known as 'Dhu al-Yad' and is the apparent owner.",
                "If the opposing party cannot provide superior evidence, possession serves as a proof for the holder.",
                "This principle plays a key role in resolving ownership disputes within the judicial system."
              ]
            }
          },
          {
            "title": {
              "urdu": "گواہوں کا تعارض",
              "english": "Conflict of Witnesses"
            },
            "content": {
              "urdu": [
                "جب دونوں فریقین برابر درجے کے گواہ پیش کر دیں تو معاملہ پیچیدہ ہو جاتا ہے۔",
                "ایسی صورت میں قاضی دیگر قرائن اور ظاہری حالات کو دیکھتا ہے۔",
                "نبی ﷺ نے اس صورت میں قبضے والے کے حق میں فیصلہ دے کر نزاع ختم فرمایا۔"
              ],
              "english": [
                "When both parties present equal witnesses, the case becomes complicated for the judge.",
                "In such instances, the judge examines other circumstantial evidence and apparent facts.",
                "The Prophet (ﷺ) ended the dispute by ruling in favor of the one currently holding the property."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Jurists' Perspectives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف فقہی تشریحات",
              "english": "Diverse Jurisprudential Interpretations"
            },
            "content": {
              "urdu": [
                "امام ابو حنیفہ کے نزدیک اگر دونوں کے گواہ برابر ہوں تو چیز دونوں میں تقسیم ہوگی۔",
                "دیگر ائمہ اس حدیث کی بنیاد پر قابض کے حق میں فیصلے کو درست قرار دیتے ہیں۔",
                "یہ اختلاف اس بات پر مبنی ہے کہ قبضہ گواہوں کے مقابلے میں کتنی قوت رکھتا ہے۔"
              ],
              "english": [
                "According to Imam Abu Hanifa, if witnesses are equal, the property should be shared.",
                "Other Imams validate ruling for the possessor based on the logic of this narration.",
                "This disagreement stems from how much weight possession holds against conflicting testimony."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحقیق اور چھان بین",
              "english": "Investigation and Scrutiny"
            },
            "content": {
              "urdu": [
                "قاضی کو چاہیے کہ وہ گواہوں کے کردار اور بیانات کی گہرائی سے جانچ کرے۔",
                "محض قبضے پر فیصلہ اسی وقت ہوتا ہے جب کوئی اور صورتِ حل باقی نہ رہے۔",
                "اسلامی قانون کا اصل مقصد سچے حق دار تک اس کا حق پہنچانا ہے۔"
              ],
              "english": [
                "A judge must thoroughly investigate the character and statements of the witnesses.",
                "Ruling solely on possession occurs only when no other resolution is possible.",
                "The primary goal of Islamic law is to deliver the right to the true owner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدل و انصاف کی روح",
        "english": "The Spirit of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی استحکام",
              "english": "Social Stability"
            },
            "content": {
              "urdu": [
                "قبضے کو اہمیت دینے سے معاشرے میں روزمرہ کے لین دین میں سہولت رہتی ہے۔",
                "اگر ہر چیز کے لیے بار بار گواہ مانگے جائیں تو نظام زندگی معطل ہو جائے۔",
                "قانون کا کام معاشرے میں سے بے یقینی اور بے جا مقدمہ بازی کو ختم کرنا ہے۔"
              ],
              "english": [
                "Giving importance to possession facilitates daily transactions within society.",
                "If witnesses were required for every item constantly, daily life would be disrupted.",
                "The role of the law is to eliminate uncertainty and excessive litigation in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھوٹے دعووں کی حوصلہ شکنی",
              "english": "Discouraging False Claims"
            },
            "content": {
              "urdu": [
                "دوسرے کی چیز پر ناحق دعویٰ کرنا اخلاقی اور شرعی طور پر جرم ہے۔",
                "ثبوت کی ذمہ داری مدعی (دعویٰ کرنے والے) پر ہوتی ہے۔",
                "یہ اصول لوگوں کو دوسروں کی جائیداد پر نظر رکھنے سے روکتا ہے۔"
              ],
              "english": [
                "Making an unjust claim on another's property is an ethical and religious crime.",
                "The burden of proof lies upon the claimant (the plaintiff).",
                "This principle prevents people from eyeing the property of others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دستاویزی ثبوت کی اہمیت",
              "english": "Importance of Documentary Proof"
            },
            "content": {
              "urdu": [
                "موجودہ دور میں گواہوں کے ساتھ ساتھ تحریری ثبوت رکھنا بھی ضروری ہے۔",
                "خرید و فروخت کے وقت رسید یا معاہدہ نزاع سے بچنے کا بہترین طریقہ ہے۔",
                "اسلام نے قرض اور لین دین کے معاملات کو لکھنے کی تاکید فرمائی ہے۔"
              ],
              "english": [
                "In the modern era, it is essential to keep written proof alongside witnesses.",
                "Having a receipt or contract during trade is the best way to avoid disputes.",
                "Islam emphasizes writing down transactions and debts for clarity."
              ]
            }
          },
          {
            "title": {
              "urdu": "فیصلہ سازی میں حکمت",
              "english": "Wisdom in Decision Making"
            },
            "content": {
              "urdu": [
                "بڑوں اور ذمہ داروں کو جھگڑے ختم کرانے کے لیے ٹھوس اصول اپنانے چاہئیں۔",
                "جانبداری سے بچ کر ظاہری حقائق کی بنیاد پر فیصلہ کرنا عدل ہے۔",
                "سچائی کی تلاش میں ہر ممکنہ پہلو پر غور کرنا ضروری ہے۔"
              ],
              "english": [
                "Elders and authorities should adopt solid principles to end disputes.",
                "Deciding based on apparent facts while avoiding bias is true justice.",
                "It is necessary to consider every possible aspect in search of the truth."
              ]
            }
          }
        ]
      }
    }
  ]
}