{
  "hadithId": 911,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1047"],
    "kitabId": 8,
    "inKitabBab": 6,
    "arabicBook": "كتاب النكاح",
    "babId": 69
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري ( 5217 ) ، ومسلم ( 2443 ) واللفظ للبخاري ، وتمامه عنده : حتى مات عندها . قالت عائشة : فمات في اليوم الذي كان يدور علي فيه في بيتي ، فقبضه الله ، وإن رأسه لبين نحري وسحري ، وخالط ريقه ريقي .",
    "urdu": "صحیح۔ اسے بخاری (5217) اور مسلم (2443) نے روایت کیا ہے۔ بخاری کی مکمل روایت میں ہے کہ آپ ﷺ کی وفات سیدہ عائشہ ہی کے ہاں ہوئی۔ سیدہ عائشہ فرماتی ہیں کہ آپ ﷺ کی روح اس وقت قبض ہوئی جب آپ کا سر مبارک میرے سینے اور گردن کے درمیان تھا اور آپ کا لعاب میرے لعاب سے مل چکا تھا۔",
    "english": "Sahih. Reported by Al-Bukhari (5217) and Muslim (2443). The full narration in Bukhari mentions that the Prophet (ﷺ) passed away in Aisha's house on the very day of her turn. Aisha said, 'Allah took him while his head was between my chest and neck, and his saliva mixed with mine (via the Siwak).'"
  },
  "importantWords": [
    {
      "arabic": "مَرَضِهِ",
      "english": "His illness",
      "urdu": "ان کی بیماری"
    },
    {
      "arabic": "أَيْنَ أَنَا",
      "english": "Where am I?",
      "urdu": "میں کہاں ہوں؟"
    },
    {
      "arabic": "غَدًا",
      "english": "Tomorrow",
      "urdu": "کل / آنے والا کل"
    },
    {
      "arabic": "أَذِنَ",
      "english": "Gave permission",
      "urdu": "اجازت دے دی"
    },
    {
      "arabic": "شَاءَ",
      "english": "He wished",
      "urdu": "اس نے چاہا"
    }
  ],
  "summary": {
    "urdu": "مرض الوفات میں نبی ﷺ نے باریوں کے بجائے سیدہ عائشہ کے ہاں قیام کی خواہش ظاہر کی، جس پر تمام ازواج نے بخوشی اجازت دے دی، جو کہ ضرورت کے وقت حق کی دستبرداری کا ثبوت ہے۔",
    "english": "During his final illness, the Prophet (ﷺ) expressed a desire to stay at Aisha's house. His wives collectively waived their turns, showing that rights can be gifted by mutual consent."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5217)",
      "english": "Sahih al-Bukhari (5217)"
    },
    {
      "arabic": "صحيح مسلم (2443)",
      "english": "Sahih Muslim (2443)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عدل اور بیماری کی حالت",
        "english": "Justice and State of Illness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیماری میں باری کی تقسیم",
              "english": "Turns During Sickness"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ شدید بیماری کی حالت میں بھی عدل کی فکر فرماتے اور ہر بیوی کے ہاں باری پر تشریف لے جاتے۔",
                "یہ عمل امت کو پیغام دیتا ہے کہ حقوق العباد کی ادائیگی میں کوئی عذر حائل نہیں ہونا چاہیے۔",
                "آپ ﷺ کا 'کل میں کہاں ہوں گا' پوچھنا عدل برقرار رکھنے کی غیر معمولی فکر کی علامت تھا۔"
              ],
              "english": [
                "Even in severe illness, the Prophet (ﷺ) cared for justice and visited each wife on her turn.",
                "This action conveys a message to the Ummah that no excuse should hinder the fulfillment of people's rights.",
                "His repeated questioning about his location the next day shows an extraordinary concern for fairness."
              ]
            }
          },
          {
            "title": {
              "urdu": "رضامندی سے حق کی معافی",
              "english": "Waiving Rights by Consent"
            },
            "content": {
              "urdu": [
                "ازواج مطہرات نے جب آپ ﷺ کی خواہش کو بھانپ لیا تو انہوں نے اپنا حق بخوشی معاف کر دیا۔",
                "شرعی طور پر اگر تمام بیویاں کسی ایک بیوی کے حق میں دستبردار ہو جائیں تو شوہر وہاں رہ سکتا ہے۔",
                "یہ واقعہ گھریلو زندگی میں ایثار اور دوسروں کی راحت کو ترجیح دینے کا بہترین نمونہ ہے۔"
              ],
              "english": [
                "When the wives realized the Prophet's desire, they voluntarily and happily waived their turns.",
                "Legally, if all wives withdraw their turns in favor of one, the husband is permitted to stay there.",
                "This event is a prime example of altruism and prioritizing others' comfort in family life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدہ عائشہ کی فضیلت",
        "english": "Excellence of Aisha (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کا قلبی میلان",
              "english": "Prophet's Heartfelt Inclination"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کو سیدہ عائشہ سے شدید محبت تھی اور آخری وقت ان کے پاس گزارنا چاہتے تھے۔",
                "سیدہ عائشہ کا گھر علم اور وحی کا مرکز تھا، جہاں آپ ﷺ کو خصوصی سکون ملتا تھا۔",
                "اللہ تعالیٰ نے بھی اپنے حبیب ﷺ کے لیے سیدہ عائشہ کی گود اور ان کا گھر منتخب فرمایا۔"
              ],
              "english": [
                "The Prophet (ﷺ) had a deep love for Aisha and desired to spend his final moments with her.",
                "Aisha's house was a center of knowledge and revelation, where the Prophet found unique peace.",
                "Allah also chose Aisha's lap and her home for His Beloved (ﷺ) to pass away in."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدہ عائشہ کے لیے اعزاز",
              "english": "An Honor for Aisha (RA)"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کے لیے یہ فخر کی بات ہے کہ آپ ﷺ کی روح ان کے بازوؤں میں قبض ہوئی۔",
                "آپ ﷺ کی وفات سیدہ عائشہ کی باری والے دن ہی ہوئی، جو ان کی صداقت کی دلیل ہے۔",
                "اس سے ثابت ہوتا ہے کہ سیدہ عائشہ رضی اللہ عنہا کا مقام تمام ازواج میں نہایت بلند تھا۔"
              ],
              "english": [
                "It is a matter of pride for Aisha that the Prophet's soul was taken while he was in her arms.",
                "The Prophet's death occurred on her scheduled day, which is a testament to her truthfulness.",
                "This proves that Aisha (RA) held an immensely high status among all the wives."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ازواجِ مطہرات کا ایثار",
        "english": "Sacrifice of the Mothers of Believers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی راحت مقدم",
              "english": "Prophet's Comfort as Priority"
            },
            "content": {
              "urdu": [
                "امہات المومنین نے اپنی باریوں پر نبی ﷺ کی راحت اور دلی خوشی کو ترجیح دی۔",
                "یہ ان کے تقویٰ اور نبی ﷺ کے ساتھ گہری محبت و وفاداری کا منہ بولتا ثبوت ہے۔",
                "انہوں نے ثابت کیا کہ ایک کامیاب خاندان میں ضد کے بجائے قربانی کا جذبہ ہونا چاہیے۔"
              ],
              "english": [
                "The Mothers of the Believers prioritized the Prophet's comfort and happiness over their turns.",
                "This is a clear testament to their piety and deep love and loyalty toward the Prophet (ﷺ).",
                "They proved that a successful family requires a spirit of sacrifice rather than stubbornness."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتفاق و اتحاد کی مثال",
              "english": "Example of Unity"
            },
            "content": {
              "urdu": [
                "تمام ازواج کا متفقہ طور پر اجازت دینا ان کے درمیان مثالی ہم آہنگی کو ظاہر کرتا ہے۔",
                "اس سے ان لوگوں کی تردید ہوتی ہے جو ازواجِ مطہرات کے درمیان صرف اختلاف تلاش کرتے ہیں۔",
                "نبی ﷺ کے گھرانے کا یہ اتحاد قیامت تک آنے والے خاندانوں کے لیے مشعلِ راہ ہے۔"
              ],
              "english": [
                "The unanimous permission from all wives shows exemplary harmony among them.",
                "This refutes those who only look for disputes among the Mothers of the Believers.",
                "This unity in the Prophetic household is a guiding light for families until the Day of Judgment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی اسباق",
        "english": "Educational and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخری وقت کی تیاری",
              "english": "Preparation for the End"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے آخری لمحات میں بھی شریعت کے اصولوں اور عدل کو فراموش نہیں فرمایا۔",
                "یہ واقعہ ہمیں سکھاتا ہے کہ انسان کو ہر حال میں اللہ کے احکامات کا پابند رہنا چاہیے۔",
                "حقوق العباد کی ادائیگی اور دوسروں سے اجازت لینا ایک مومن کا زیور ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not forget Shariah principles or justice even in his final moments.",
                "This event teaches us that one must remain committed to Allah's commands in all states.",
                "Fulfilling rights and seeking permission from others is the ornament of a believer."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبت اور حقوق کا توازن",
              "english": "Balance of Love and Rights"
            },
            "content": {
              "urdu": [
                "محبت قلبی میلان ہے، لیکن حقوق کی ادائیگی ایک قانونی اور اخلاقی فریضہ ہے۔",
                "نبی ﷺ نے محبت کے باوجود حقوق کی ادائیگی کے لیے ازواج سے باقاعدہ اجازت لی۔",
                "یہ رویہ سکھاتا ہے کہ جذبات میں آکر کسی کے حق کو دبانا اسلام میں جائز نہیں ہے۔"
              ],
              "english": [
                "Love is an internal inclination, but fulfilling rights is a legal and moral duty.",
                "Despite his love, the Prophet sought formal permission from his wives to fulfill his rights.",
                "This behavior teaches that suppressing someone's right due to emotions is not permissible in Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}