{
  "hadithId": 800,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/800"],
    "kitabId": 7,
    "inKitabBab": 19,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 60
  },
  
  "takhreej": {
    "arabic": "حديث صحيح. رواه البخاري (91)، ومسلم (1722). وأخرجه أيضاً أبو داود والنسائي والترمذي وأحمد.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (91) اور امام مسلم (1722) نے اسے اپنی صحیحین میں روایت کیا ہے۔ یہ لقطہ (گری پڑی چیز) کے احکام میں بنیادی اصل ہے۔",
    "english": "A Sahih Hadith, reported by Al-Bukhari (91) and Muslim (1722). It is also found in the four Sunan and Musnad Ahmad. It is the primary legal reference for lost property rules."
  },
  "importantWords": [
    {
      "arabic": "عِفَاصَهَا",
      "english": "Its container",
      "urdu": "برتن / تھیلی"
    },
    {
      "arabic": "وِكَاءَهَا",
      "english": "Its string / tie",
      "urdu": "بندھن / تسمہ"
    },
    {
      "arabic": "عَرِّفْهَا",
      "english": "Make an announcement",
      "urdu": "اس کا اعلان کرو"
    },
    {
      "arabic": "ضَالَّةُ",
      "english": "Stray animal",
      "urdu": "گمشدہ جانور"
    },
    {
      "arabic": "سِقَاؤُهَا",
      "english": "Its water-container",
      "urdu": "اس کا مشکیزہ (پیٹ)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں لقطہ (گری پڑی چیز) کی تین اقسام کے الگ الگ احکام بیان کیے گئے ہیں: عام سامان کا سال بھر اعلان، گمشدہ بکری کی حفاظت، اور گمشدہ اونٹ کو اس کے حال پر چھوڑ دینا۔",
    "english": "This Hadith details three categories of lost property: general items (require one-year announcement), lost sheep (can be taken to protect from predators), and lost camels (should be left alone as they are self-sufficient)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (91)",
      "english": "Reported by Al-Bukhari (91)"
    },
    {
      "arabic": "رواه مسلم (1722)",
      "english": "Reported by Muslim (1722)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "زيد بن خالد الجهني",
        "english": "Zaid bin Khalid al-Juhani"
      },
      "slug": "zaid-bin-khalid-al-juhani"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عام لقطہ کے احکام",
        "english": "Rulings on General Lost Property"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شناخت اور حفاظت",
              "english": "Identification and Safeguarding"
            },
            "content": {
              "urdu": [
                "چیز ملنے پر اس کی علامات (برتن، وزن، رنگ وغیرہ) اچھی طرح یاد رکھیں تاکہ دعویدار کا امتحان لیا جا سکے۔",
                "سال بھر اعلان کرنا واجب ہے تاکہ مالک کو تلاش کا موقع ملے۔",
                "اگر ایک سال بعد بھی مالک نہ ملے تو پانے والا اسے اپنی ضرورت میں لا سکتا ہے، مگر مالک آنے پر واپسی کی ذمہ داری باقی رہتی ہے۔"
              ],
              "english": [
                "Note physical signs (container, weight, color) to verify any potential claimant's honesty.",
                "Publicly announcing the item for a full year is mandatory to give the owner a fair chance to find it.",
                "If no owner appears after a year, the finder may use it, but they remain liable to return its value if the owner eventually appears."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعلان کا طریقہ",
              "english": "Method of Announcement"
            },
            "content": {
              "urdu": [
                "اعلان ایسی جگہوں پر کیا جائے جہاں لوگوں کا مجمع ہو (جیسے بازار یا مسجد کا بیرونی دروازہ)۔",
                "موجودہ دور میں سوشل میڈیا اور اشتہارات بھی اس مقصد کے لیے استعمال کیے جا سکتے ہیں۔",
                "اعلان میں تمام تفصیلات نہیں بتانی چاہئیں بلکہ صرف یہ کہنا کافی ہے کہ ایک چیز ملی ہے۔"
              ],
              "english": [
                "Announcements should be made in public gathering places like markets or outside mosques.",
                "Modern methods like social media and advertisements can also be utilized for this purpose.",
                "Do not disclose all specific details in the announcement; just state that an item has been found."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گمشدہ جانوروں کے احکام",
        "english": "Rulings on Stray Animals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چھوٹے جانور (بکری وغیرہ)",
              "english": "Small Animals (Sheep/Goats)"
            },
            "content": {
              "urdu": [
                "ایسے کمزور جانور جو درندوں کا شکار ہو سکتے ہوں، انہیں اٹھا لینا چاہیے تاکہ ضائع نہ ہوں۔",
                "نبی ﷺ نے فرمایا 'وہ تمہاری ہے یا بھیڑیے کی' یعنی اسے اٹھا کر محفوظ کرنا ہی بہتر ہے۔",
                "اسے بھی ایک سال تک سنبھالنا ہوگا، اس دوران اس کا دودھ اور نفع اس کے چارے کے بدلے استعمال کیا جا سکتا ہے۔"
              ],
              "english": [
                "Weak animals susceptible to predators should be picked up to prevent their loss.",
                "The Prophet's (ﷺ) statement 'for you or the wolf' implies it is better to safeguard it.",
                "It must be kept for a year; its milk or utility can offset its maintenance costs."
              ]
            }
          },
          {
            "title": {
              "urdu": "بڑے جانور (اونٹ وغیرہ)",
              "english": "Large Animals (Camels)"
            },
            "content": {
              "urdu": [
                "اونٹ جیسے جانور جو بھوک پیاس برداشت کر سکتے ہیں اور اپنا دفاع کر سکتے ہیں، انہیں نہیں پکڑنا چاہیے۔",
                "آپ ﷺ نے اس پر غصہ فرمایا کیونکہ اونٹ کو پکڑنا اسے قید کرنے کے مترادف ہے جبکہ وہ آزاد رہ کر اپنے مالک کو مل سکتا ہے۔",
                "صرف ان حالات میں پکڑا جا سکتا ہے جب وہ کسی بنجر ریگستان میں ہلاکت کے قریب ہو۔"
              ],
              "english": [
                "Self-sufficient animals like camels that can withstand hunger and defend themselves should not be seized.",
                "The Prophet (ﷺ) showed anger at the suggestion of capturing them as they are capable of surviving until the owner finds them.",
                "Capturing is only permissible if the animal is in imminent danger of death in a barren desert."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "امانت داری اور تقویٰ",
        "english": "Trustworthiness and Piety"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیانت سے بچنا",
              "english": "Avoiding Breach of Trust"
            },
            "content": {
              "urdu": [
                "لقطہ اٹھانے والا امانت دار ہے، اسے چیز کی حفاظت اپنی جان کی طرح کرنی چاہیے۔",
                "اگر نیت شروع ہی سے ہڑپ کرنے کی ہو، تو یہ چوری اور گناہ ہے۔",
                "اسلامی معاشرے کی بنیاد دیانتداری اور ایک دوسرے کے مال کے احترام پر ہے۔"
              ],
              "english": [
                "The finder acts as a trustee and must safeguard the item as if it were their own.",
                "Picking up an item with the intention to keep it secretly is a sin and akin to theft.",
                "Islamic society is built on integrity and respect for the property of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالک کا حق",
              "english": "The Owner's Right"
            },
            "content": {
              "urdu": [
                "مالک جب بھی آئے اور صحیح نشانیاں بتا دے، اسے چیز واپس کرنا لازمی ہے۔",
                "اگر چیز استعمال ہو چکی ہو تو اس کی قیمت ادا کرنا پانے والے کی ذمہ داری ہے۔",
                "معاملات کی صفائی آخرت کی جوابدہی سے بچنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "The item must be returned immediately if the owner appears and provides correct identifying marks.",
                "If the item has been consumed, the finder is responsible for reimbursing its value.",
                "Clarity in dealings is essential to avoid accountability in the Hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دوسروں کے مال کی قدر",
              "english": "Valuing Others' Property"
            },
            "content": {
              "urdu": [
                "کسی کی گری ہوئی چیز دیکھ کر اسے نظر انداز نہ کریں اگر ضائع ہونے کا ڈر ہو، بلکہ اسے اٹھا کر مالک تک پہنچانے کی کوشش کریں۔",
                "کم مالیت کی چیزوں میں بھی دیانتداری کا مظاہرہ ایمان کی علامت ہے۔",
                "دوسروں کی مدد کرنا اللہ کی رحمتوں کا مستحق بناتا ہے۔"
              ],
              "english": [
                "Do not ignore lost items if they might be destroyed; pick them up and try to find the owner.",
                "Demonstrating honesty even in low-value items is a sign of faith.",
                "Helping others invites the mercy of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمت اور صبر",
              "english": "Wisdom and Patience"
            },
            "content": {
              "urdu": [
                "سال بھر کا انتظار ہمیں صبر اور استقامت سکھاتا ہے۔",
                "اسلامی قوانین انسانی نفسیات اور ضرورتوں کے عین مطابق ہیں۔",
                "ہمیشہ حق بات کہنے اور شریعت پر عمل کرنے میں برکت ہے۔"
              ],
              "english": [
                "The one-year waiting period teaches us patience and perseverance.",
                "Islamic laws perfectly align with human psychology and needs.",
                "There is blessing in always speaking the truth and following Shariah."
              ]
            }
          }
        ]
      }
    }
  ]
}