{
  "hadithId": 38,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 10 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب مسح الذراعين والتقليل من الماء",
    "babId": 4
  },

  "takhreej": {
    "arabic": "صحيح.  رواه أحمد (4/39) ، وابن خزيمة (118)  واللفظ لابن خزيمة. ",
    "urdu": "صحیح (درجہ)۔ اسے احمد (4/39) اور ابن خزیمہ (118) نے روایت کیا ہے، اور ابن خزیمہ کے الفاظ ہیں۔",
    "english": "Sahih (Authentic). Narrated by Ahmad (4/39) and Ibn Khuzaymah (118). The wording quoted is from Ibn Khuzaymah."
  },
  "importantWords": [
    {
      "arabic": "ثُلُثَيْ مُدٍّ",
      "english": "Two-thirds of a Mudd",
      "urdu": "دو تہائی مد (پانی)"
    },
    {
      "arabic": "يَدْلُكُ",
      "english": "Started rubbing",
      "urdu": "ملنا شروع کیا"
    },
    {
      "arabic": "ذِرَاعَيْهِ",
      "english": "His two forearms (arms)",
      "urdu": "بازوؤں"
    },
    {
      "arabic": "أَتَى",
      "english": "Was brought",
      "urdu": "پیش کیا گیا"
    },
    {
      "arabic": "وُضُوءِ",
      "english": "Water for Wudu",
      "urdu": "وضو کا پانی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث دو اہم سنتوں کی طرف اشارہ کرتی ہے: ایک یہ کہ نبی اکرم صلی اللہ علیہ وسلم وضو میں بہت کم پانی استعمال کرتے تھے، اور دوسرا یہ کہ آپ صلی اللہ علیہ وسلم پانی کو اعضاء تک پہنچانے کے لیے اپنے بازوؤں کو ملتے (رگڑتے) تھے۔",
    "english": "This Hadith points to two significant Sunnahs: the Prophet's practice of using a minimal amount of water for Wudu, and the action of rubbing the forearms (Dalk) to ensure that the small quantity of water thoroughly covers the skin."
  },
  "references": [
    {
      "arabic": "مسند أحمد، رقم 4/39",
      "english": "Musnad Ahmad, Hadith 4/39"
    },
    {
      "arabic": "صحيح ابن خزيمة، رقم 118",
      "english": "Sahih Ibn Khuzaymah, Hadith 118"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَبْدُ اَللَّهِ بْنُ زَيْدٍ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Abdullah bin Zaid (May Allah be pleased with him)"
      },
      "slug": "abdullah-bin-zaid"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-16-water-rubbing",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پانی کی بچت اور مقدار",
        "english": "Water Conservation and Quantity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قلیل پانی کا استعمال",
              "english": "Using Minimal Water"
            },
            "content": {
              "urdu": [
                "حدیث میں 'دو تہائی مد' (تقریباً 400 سے 500 ملی لیٹر) پانی کا ذکر ہے، جو اس بات کی دلیل ہے کہ نبی اکرم ﷺ وضو میں انتہائی کم پانی استعمال کرتے تھے۔",
                "یہ سنت امت کو پانی کے ضیاع (اسراف) سے بچنے کی تعلیم دیتی ہے، جو ہر جگہ اور ہر زمانے میں ایک قیمتی ذریعہ ہے۔",
                "مسلمانوں کو وضو میں پانی کا استعمال کرتے وقت میانہ روی اختیار کرنی چاہیے، یہاں تک کہ اگر وہ وافر مقدار میں دستیاب ہو۔"
              ],
              "english": [
                "The reference to 'two-thirds of a Mudd' (about 400-500 ml) of water indicates the Prophet's practice of using very little water for Wudu.",
                "This Sunnah instructs the Ummah to avoid wasting water (Isrāf), which is a precious resource in every time and place.",
                "Muslims should adopt moderation in water use for Wudu, even when water is readily available in large quantities."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی تعریف: مد",
              "english": "Legal Definition: The Mudd"
            },
            "content": {
              "urdu": [
                "**مد** ایک قدیم پیمانہ ہے جو حجازی پیمائش کے مطابق تقریباً 600 ملی لیٹر کے برابر سمجھا جاتا ہے، اس طرح دو تہائی مد تقریباً 400 ملی لیٹر ہوا۔",
                "یہ مقدار آج کے دور کے مقابلے میں بہت کم ہے اور یہ نبی ﷺ کی امت پر شفقت اور سادگی کی پسند کو ظاہر کرتی ہے۔",
                "اس سے فقہاء نے یہ اصول اخذ کیا کہ وضو میں پانی کی مقدار اہم نہیں، بلکہ پانی کو تمام واجب اعضاء تک پہنچانا لازم ہے۔"
              ],
              "english": [
                "The **Mudd** is an ancient measurement, generally estimated to be about 600 ml according to Hijazi standards, making two-thirds about 400 ml.",
                "This amount is very small compared to modern water usage and demonstrates the Prophet's compassion and preference for simplicity for his Ummah.",
                "Jurists derive the principle that the quantity of water is less important than ensuring the water reaches all obligatory limbs of Wudu."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بازوؤں کو ملنے کی حکمت",
        "english": "Wisdom of Rubbing the Forearms (Dalk)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دلک (رگڑنا) کی سنت",
              "english": "The Sunnah of Dalk (Rubbing)"
            },
            "content": {
              "urdu": [
                "**یدلک ذراعیہ** (اپنے بازوؤں کو ملنا) کا عمل اس بات کی سنت ہے کہ پانی ڈالنے کے ساتھ ساتھ ہاتھ سے اعضاء کو اچھی طرح رگڑا (ملا) جائے۔",
                "چونکہ نبی ﷺ کم پانی استعمال کرتے تھے، اس لیے رگڑنے کا عمل ضروری تھا تاکہ پانی کی قلیل مقدار سے بھی جلد کی کوئی جگہ خشک نہ رہ جائے۔",
                "فقہاء کے نزدیک رگڑنا (دلک) واجب نہیں بلکہ سنت ہے، لیکن اگر پانی کی مقدار کم ہو یا اعضاء پر کوئی ایسی چیز ہو جو پانی کو روکتی ہو تو رگڑنا ضروری ہو جاتا ہے۔"
              ],
              "english": [
                "The action of **Yadluk Dhirā'ayh** (rubbing his forearms) establishes the Sunnah of gently rubbing the limbs with the hands while water is applied.",
                "Because the Prophet (ﷺ) used minimal water, rubbing was crucial to ensure that no part of the skin was left dry due to the small quantity of water.",
                "Jurists generally hold that rubbing (Dalk) is Sunnah, not obligatory, but it becomes necessary if the water is scarce or if something on the limb prevents water from reaching the skin."
              ]
            }
          },
          {
            "title": {
              "urdu": "تمام اعضاء پر دَلک",
              "english": "Applying Dalk to All Limbs"
            },
            "content": {
              "urdu": [
                "اگرچہ حدیث میں خاص طور پر بازوؤں کا ذکر ہے، لیکن یہ سنت چہرے، ہاتھوں اور پاؤں سمیت وضو کے تمام دھونے والے اعضاء پر لاگو ہوتی ہے۔",
                "دلک کا مقصد ہر عضو کی صفائی کو یقینی بنانا اور گندگی کو دور کرنا ہے، تاکہ پانی جلد کی تہوں تک پہنچ سکے۔",
                "یہ عمل نہ صرف طہارت کو مکمل کرتا ہے بلکہ جلد کی صفائی اور مساج کا بھی فائدہ دیتا ہے، جو سنت کے حسن کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Although the Hadith specifically mentions the forearms, this Sunnah of rubbing applies to all washable limbs of Wudu, including the face, hands, and feet.",
                "The purpose of Dalk is to ensure cleanliness and remove any dirt, allowing the water to fully penetrate the skin's surface.",
                "This action not only perfects the ritual purity but also offers the benefits of skin cleaning and mild massage, showcasing the beauty of the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وضو میں سادگی اور اھتمام",
        "english": "Simplicity and Diligence in Wudu"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کا اعتدال",
              "english": "The Prophet's Moderation"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کی یہ سنت سادگی اور اعتدال کا ایک بہترین نمونہ ہے، کہ عبادت میں بھی اسراف سے بچنا چاہیے۔",
                "نبی ﷺ نے ایک مد پانی (وضو کے لیے) اور ایک صاع پانی (غسل کے لیے) استعمال کرنے کی ترغیب دی، جو کم مقدار تھی۔",
                "صحابہ کرام بھی اسی کم مقدار کے ساتھ وضو کو مکمل کرتے تھے، جو اس بات کی دلیل ہے کہ وضو کو پورا کرنے کے لیے زیادہ پانی ضروری نہیں۔"
              ],
              "english": [
                "This Sunnah of the Prophet (ﷺ) is an excellent model of simplicity and moderation, teaching us to avoid extravagance even in acts of worship.",
                "The Prophet (ﷺ) encouraged using one Mudd for Wudu and one Sā' for Ghusl, both of which are minimal quantities.",
                "The Companions also completed their Wudu with this small amount, proving that large amounts of water are not necessary to achieve full ritual purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کا مقام",
              "english": "The Status of the Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر سنت کی پیروی کی اہمیت کو بیان کرتی ہے، جس پر عمل کرنے سے کم وسائل میں بھی کامل طہارت حاصل ہوتی ہے۔",
                "اگرچہ یہ حدیث بخاری و مسلم میں شامل نہیں، لیکن امام احمد جیسے جلیل القدر محدثین اور ابن خزیمہ کی تصحیح کی وجہ سے یہ شرعی دلیل کے طور پر قابل قبول ہے۔",
                "مسلمانوں کو وضو میں پانی کا استعمال کرتے ہوئے اس سادگی اور کامل صفائی کے اصول کو ہمیشہ پیش نظر رکھنا چاہیے۔"
              ],
              "english": [
                "This Hadith clearly states the importance of following the Sunnah, which allows one to achieve perfect purity even with limited resources.",
                "Although not found in Al-Bukhari and Muslim, its acceptance by great scholars like Imam Ahmad and its authentication by Ibn Khuzaymah make it acceptable as legal evidence.",
                "Muslims should always keep this principle of simplicity and thorough cleanliness in mind when using water for Wudu."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور علم کی ترسیل",
        "english": "Narrator and Transmission of Knowledge"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبداللہ بن زید کا مقام",
              "english": "The Status of Abdullah bin Zaid"
            },
            "content": {
              "urdu": [
                "سیدنا عبداللہ بن زید رضی اللہ عنہ ان چند صحابہ میں سے ہیں جو نبی ﷺ کے وضو اور غسل کے طریقہ کار کے تفصیلی راوی ہیں۔",
                "ان کی روایتیں وضو میں کمی یا زیادتی کرنے والوں کے خلاف ایک اہم دلیل ہیں، کیونکہ یہ نبی ﷺ کے کامل طریقہ کار کو واضح کرتی ہیں۔",
                "یہ روایت صحابہ کرام کے علم کی ترسیل کے معیار کو ظاہر کرتی ہے، جہاں انہوں نے وضو میں استعمال ہونے والی پانی کی مقدار تک کو بیان کیا۔"
              ],
              "english": [
                "Sayyiduna Abdullah bin Zaid (RA) is one of the few Companions who provided detailed accounts of the Prophet's methods for both Wudu and Ghusl.",
                "His narrations serve as important evidence against those who add or subtract from the Wudu, as they clarify the Prophet's perfect method.",
                "This report demonstrates the meticulous standard of knowledge transmission among the Companions, even detailing the amount of water used for the ablution."
              ]
            }
          },
          {
            "title": {
              "urdu": "دلک (رگڑ) کا مفہوم",
              "english": "The Meaning of Dalk (Rubbing)"
            },
            "content": {
              "urdu": [
                "دَلک کا عمل وضو کے پانی کو جلد کے ہر حصے میں جذب کرنے میں مدد کرتا ہے، خاص طور پر بازوؤں میں جہاں بال ہو سکتے ہیں یا جلد خشک ہو۔",
                "بعض فقہاء نے اسے فرض بھی قرار دیا ہے کیونکہ ان کے نزدیک دھونے (غسل) کا مطلب ہی دلک کے ساتھ دھونا ہے، تاکہ یقین ہو کہ پانی پہنچ گیا۔",
                "اس سنت پر عمل کرنے سے انسان نہ صرف نبی ﷺ کی سنت کو ادا کرتا ہے بلکہ طہارت کے ہر شک سے بھی محفوظ رہتا ہے۔"
              ],
              "english": [
                "The act of Dalk helps ensure the water permeates every part of the skin, especially on the forearms where hair may be present or the skin might be dry.",
                "Some jurists have even considered Dalk to be obligatory (Fard) because, in their view, washing (Ghusl) implies rubbing to ensure the water reaches everywhere.",
                "By practicing this Sunnah, one not only follows the Prophet's tradition but also safeguards against any doubt regarding the completeness of their ritual purity."
              ]
            }
          }
        ]
      }
    }
  ]
}
