{
  "hadithId": 337,
  "hadithNo": 24,
  "hadithReferences": {
    "sunnah.com": ["abudawud:592"],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب المساجد ومواضع الصلاة",
    "babId": 20
  },
 
  "takhreej": {
    "arabic": "حسن.‏ رواه أبو داود (592)‏، وابن خزيمة (1676)‏، وأحمد (6/405)، والحاكم (1/203).",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابوداؤد (592) اور ابن خزیمہ (1676) نے روایت کیا ہے۔ بعض محدثین نے اس کی سند پر کلام کیا ہے مگر کثرتِ شواہد کی بنا پر اسے قبول کیا گیا ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (592) and Ibn Khuzaimah (1676). It is also reported by Ahmad and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "أَمَرَهَا",
      "english": "Commanded her",
      "urdu": "انہیں حکم دیا"
    },
    {
      "arabic": "تَؤُمَّ",
      "english": "Lead in prayer",
      "urdu": "امامت کرے"
    },
    {
      "arabic": "أَهْلَ دَارِهَا",
      "english": "People of her household",
      "urdu": "اس کے گھر والے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث خواتین کی امامت کے جواز پر دلالت کرتی ہے کہ ایک عالمہ اور قاریہ خاتون اپنے گھر کے افراد (خصوصاً خواتین) کی امامت کر سکتی ہے۔",
    "english": "This Hadith serves as evidence for the permissibility of a woman leading her household (specifically other women) in prayer if she is knowledgeable and proficient in Quranic recitation."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (592)",
      "english": "Sunan Abu Dawud (592)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم ورقة بنت عبد الله",
        "english": "Umm Waraqah bint Abdullah"
      },
      "slug": "umm-waraqah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواتین کی امامت کا مسئلہ",
        "english": "Issue of Women Leading Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھریلو امامت",
              "english": "Household Leadership"
            },
            "content": {
              "urdu": [
                "سیدہ ام ورقہ رضی اللہ عنہا قرآن کی حافظہ تھیں اور نبی ﷺ ان کا بہت احترام کرتے تھے۔",
                "آپ ﷺ نے انہیں اجازت دی کہ وہ اپنے گھر میں موجود خواتین اور خادموں کی امامت کریں۔",
                "اس سے ثابت ہوتا ہے کہ خواتین مخصوص دائرے میں امامت کے فرائض انجام دے سکتی ہیں۔"
              ],
              "english": [
                "Umm Waraqah (RAA) had memorized the Quran, and the Prophet (ﷺ) held her in high esteem.",
                "He (ﷺ) permitted her to lead the women and servants of her household in prayer.",
                "This proves that women can perform leadership roles in prayer within specific boundaries."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ابحاث",
        "english": "Jurisprudential Discussions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردوں کی امامت",
              "english": "Leading Men"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک عورت مردوں کی امامت نہیں کر سکتی، چاہے وہ گھر میں ہی کیوں نہ ہو۔",
                "ام ورقہ کی اس حدیث سے متعلق بعض علماء کا خیال ہے کہ وہ صرف گھر کی خواتین کی امامت کرتی تھیں۔",
                "تاہم، امام شافعی اور امام احمد کے نزدیک خواتین کی جماعت میں خاتون کا امام بننا مستحب اور جائز ہے۔"
              ],
              "english": [
                "The majority of jurists hold that a woman cannot lead men in prayer, even within a household.",
                "Regarding this Hadith, some scholars believe she only led the women of the house.",
                "However, according to Imams Shafi'i and Ahmad, it is permissible and recommended for a woman to lead a congregation of women."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کا علمی مقام",
        "english": "Scientific/Educational Status of Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن سے لگاؤ",
              "english": "Attachment to the Quran"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس بات کی ترغیب دیتی ہے کہ خواتین کو قرآن کا علم حاصل کرنا چاہیے اور اسے حفظ کرنا چاہیے۔",
                "علم اور تقویٰ کی بنیاد پر خواتین کو معاشرے اور خاندان میں بلند مقام حاصل ہوتا ہے۔",
                "اسلام نے خواتین کی تعلیم و تربیت کو کبھی نظر انداز نہیں کیا بلکہ اس کی حوصلہ افزائی کی ہے۔"
              ],
              "english": [
                "This Hadith encourages women to seek knowledge of the Quran and memorize it.",
                "Based on knowledge and piety, women attain high ranks within society and the family.",
                "Islam has never ignored women's education; rather, it has actively encouraged it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھر میں دینی ماحول",
              "english": "Religious Atmosphere at Home"
            },
            "content": {
              "urdu": [
                "خواتین کو چاہیے کہ وہ اپنے گھروں میں بچوں اور دیگر خواتین کے لیے دینی تعلیم و تربیت کا ذریعہ بنیں۔",
                "اگر گھر میں صرف خواتین ہوں تو وہ باجماعت نماز کا اہتمام کر کے ثواب حاصل کر سکتی ہیں۔",
                "دین سیکھنے اور سکھانے میں شرم محسوس نہیں کرنی چاہیے۔"
              ],
              "english": [
                "Women should act as sources of religious education and upbringing for children and other women in their homes.",
                "If only women are present at home, they can organize congregational prayers to earn rewards.",
                "One should not feel shy in learning or teaching the religion."
              ]
            }
          }
        ]
      }
    }
  ]
}