{
  "hadithId": 1314,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/84"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "الجامع - باب السيرة والجهاد",
    "babId": 106
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6094) في الأدب، باب قول الله تعالى: {يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين}، ومسلم (2607).",
    "urdu": "صحیح۔ اسے امام بخاری (6094) اور امام مسلم (2607) نے اپنی صحیحین میں روایت کیا ہے۔ یہ حدیث اخلاقیات اور انسانی کردار سازی کے لیے ایک بنیادی ضابطہ ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6094) and Muslim (2607). This Hadith is a fundamental principle for ethics and character building."
  },
  "importantWords": [
    {
      "arabic": "اَلصِّدْقِ",
      "english": "Truthfulness",
      "urdu": "سچائی"
    },
    {
      "arabic": "يَهْدِي",
      "english": "Leads / Guides",
      "urdu": "رہنمائی کرتا ہے"
    },
    {
      "arabic": "اَلْبِرِّ",
      "english": "Righteousness / Piety",
      "urdu": "نیکی / بھلائی"
    },
    {
      "arabic": "صِدِّيقًا",
      "english": "Truthful / Veracious",
      "urdu": "انتہائی سچا"
    },
    {
      "arabic": "اَلْفُجُورِ",
      "english": "Wickedness / Sinfulness",
      "urdu": "فسق و فجور / گناہ"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے سچائی کو جنت کا راستہ اور جھوٹ کو جہنم کا راستہ قرار دیا ہے۔ مسلسل ایک روش پر قائم رہنے سے انسان کی پہچان اللہ کے ہاں وہی لکھ دی جاتی ہے۔",
    "english": "The Prophet (ﷺ) declared truthfulness as the path to Paradise and lying as the path to Hellfire. Continuous adherence to either behavior defines one's ultimate record before Allah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأدب، رقم 6094",
      "english": "Sahih al-Bukhari, Book of Manners, No. 6094"
    },
    {
      "arabic": "صحيح مسلم، كتاب البر والصلة، رقم 2607",
      "english": "Sahih Muslim, Book of Virtue, No. 2607"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سچائی: نیکیوں کی بنیاد",
        "english": "Truthfulness: The Foundation of Virtue"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچائی کا مفہوم",
              "english": "Meaning of Truthfulness"
            },
            "content": {
              "urdu": [
                "سچائی صرف زبان سے سچ بولنے کا نام نہیں، بلکہ اس میں عمل اور نیت کی سچائی بھی شامل ہے۔",
                "سچا انسان وہ ہے جس کا ظاہر اور باطن ایک ہو۔",
                "سچائی انسان کے دل کو سکون اور اطمینان عطا کرتی ہے۔"
              ],
              "english": [
                "Truthfulness is not just verbal; it includes sincerity in intentions and actions.",
                "A truthful person is one whose inner self matches their outward appearance.",
                "Truthfulness grants peace and tranquility to the human heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "سچ سے جنت تک کا سفر",
              "english": "Journey from Truth to Paradise"
            },
            "content": {
              "urdu": [
                "سچ بولنے سے انسان کے اندر دیگر نیکیاں پیدا ہونے کا رجحان بڑھتا ہے۔",
                "جب انسان سچائی کا عادی ہو جاتا ہے، تو وہ برائیوں سے خود بخود دور ہونے لگتا ہے۔",
                "صدیق وہ مقام ہے جو انبیاء کے بعد سب سے بلند ہے، اور یہ سچائی کے ذریعے حاصل ہوتا ہے۔"
              ],
              "english": [
                "Telling the truth increases the inclination to perform other good deeds.",
                "When a person becomes accustomed to truth, they naturally distance themselves from evils.",
                "The rank of 'Siddiq' (the truthful) is the highest after Prophethood, achieved through veracity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جھوٹ: برائیوں کی جڑ",
        "english": "Lying: The Root of Evils"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جھوٹ کی سنگینی",
              "english": "The Gravity of Lying"
            },
            "content": {
              "urdu": [
                "جھوٹ تمام اخلاقی برائیوں کی ماں ہے؛ ایک جھوٹ چھپانے کے لیے انسان کو سو جھوٹ بولنے پڑتے ہیں۔",
                "جھوٹ بولنے والا شخص امانت میں خیانت کرتا ہے اور وعدہ خلافی کا مرتکب ہوتا ہے۔",
                "نبی کریم ﷺ نے جھوٹ کو منافق کی نشانیوں میں سے ایک قرار دیا ہے۔"
              ],
              "english": [
                "Lying is the mother of all moral evils; one lie leads to a hundred more to cover it.",
                "A liar commits breaches of trust and fails to keep promises.",
                "The Prophet (ﷺ) identified lying as one of the signs of a hypocrite (Munafiq)."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھوٹ کا انجام",
              "english": "The End Result of Lying"
            },
            "content": {
              "urdu": [
                "جھوٹ انسان کو فسق و فجور کی طرف لے جاتا ہے، جو اسے جہنم کا ایندھن بنا دیتا ہے۔",
                "جو شخص جھوٹ بولنے کو اپنا شیوہ بنا لیتا ہے، اس پر اللہ کی لعنت ہوتی ہے۔",
                "کذاب وہ شخص ہے جس کی بات پر کوئی اعتبار نہیں کرتا، اور یہ دنیا و آخرت کی ذلت ہے۔"
              ],
              "english": [
                "Lying leads to sinfulness, which ultimately makes one fuel for Hellfire.",
                "The curse of Allah falls upon those who make lying their habit.",
                "A 'Kadhdhab' is a person whose words no one trusts, leading to disgrace in both worlds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کردار سازی اور استقامت",
        "english": "Character Building and Steadfastness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچائی کی تلاش",
              "english": "Pursuit of Truth"
            },
            "content": {
              "urdu": [
                "حدیث میں 'یتحری الصدق' کے الفاظ بہت اہم ہیں، جس کا مطلب ہے سچائی کو ڈھونڈنا اور اس پر ثابت قدم رہنا۔",
                "بعض اوقات سچ بولنا مشکل ہوتا ہے، مگر اس کے نتیجے میں اللہ کی مدد اور عافیت ہوتی ہے۔",
                "مسلسل مشق سے سچائی انسان کی فطرت کا حصہ بن جاتی ہے۔"
              ],
              "english": [
                "The phrase 'seeking truth' (yataharra) implies actively choosing and remaining steadfast on veracity.",
                "Telling the truth can be difficult at times, but it results in Allah's help and safety.",
                "With constant practice, truthfulness becomes an integral part of human nature."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاملات میں صفائی",
              "english": "Transparency in Dealings"
            },
            "content": {
              "urdu": [
                "تجارت، ملازمت اور سماجی تعلقات میں سچائی برکت کا باعث ہے۔",
                "ہمیں مذاق میں بھی جھوٹ بولنے سے بچنا چاہیے تاکہ یہ عادت نہ بن جائے۔",
                "سچ بولنا ہی وہ صفت ہے جو معاشرے میں باہمی اعتماد اور امن قائم کرتی ہے۔"
              ],
              "english": [
                "Truthfulness brings blessings to trade, employment, and social relations.",
                "We must avoid lying even in jest to prevent it from becoming a habit.",
                "Telling the truth is the quality that establishes mutual trust and peace in society."
              ]
            }
          }
        ]
      }
    }
  ]
}