{
  "hadithId": 923,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1059"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5266) ، ومسلم (1473) . وأصله في قصة تحريم النبي صلى الله عليه وسلم لمارية أو العسل ، فأنزل الله تعالى : ﴿ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ﴾.",
    "urdu": "صحیح۔ اسے امام بخاری (5266) اور امام مسلم (1473) نے روایت کیا ہے۔ اس کا پس منظر نبی کریم ﷺ کا شہد یا ماریہ قبطیہ کو خود پر حرام کر لینے کا واقعہ ہے، جس پر سورہ تحریم کی آیات نازل ہوئیں کہ اللہ کی حلال کردہ چیز کو حرام نہ کریں۔",
    "english": "Sahih. Reported by Al-Bukhari (5266) and Muslim (1473). Its origin lies in the incident when the Prophet (ﷺ) forbade himself from honey or Maria the Copt, leading to the revelation of Surah At-Tahrim: 'O Prophet, why do you forbid what Allah has made lawful for you?'"
  },
  "importantWords": [
    {
      "arabic": "حَرَّمَ",
      "english": "Forbade / Declared forbidden",
      "urdu": "حرام کر لیا"
    },
    {
      "arabic": "لَيْسَ بِشَيْءٍ",
      "english": "It is nothing (not divorce)",
      "urdu": "وہ کچھ بھی نہیں"
    },
    {
      "arabic": "أُسْوَةٌ حَسَنَةٌ",
      "english": "Excellent example",
      "urdu": "بہترین نمونہ"
    },
    {
      "arabic": "يَمِينٌ",
      "english": "Oath",
      "urdu": "قسم"
    },
    {
      "arabic": "يُكَفِّرُهَا",
      "english": "Expiate it / Atonement",
      "urdu": "اس کا کفارہ ادا کرے"
    }
  ],
  "summary": {
    "urdu": "بیوی کو حرام قرار دینا طلاق نہیں بلکہ ایک قسم ہے؛ ایسا کرنے والے کو چاہیے کہ وہ رجوع کرے اور اپنی قسم توڑنے کا شرعی کفارہ ادا کرے۔",
    "english": "Declaring one's wife forbidden is not a divorce but an oath; the person must return to the relationship and pay the prescribed expiation for breaking the oath."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5266)",
      "english": "Sahih al-Bukhari (5266)"
    },
    {
      "arabic": "صحيح مسلم (1473)",
      "english": "Sahih Muslim (1473)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حلال کو حرام کرنے کی ممانعت",
        "english": "Prohibition of Forbidding the Lawful"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی حاکمیت",
              "english": "Sovereignty of Allah"
            },
            "content": {
              "urdu": [
                "حلال اور حرام کا فیصلہ کرنا صرف اللہ تعالیٰ کا حق ہے، کسی انسان کا نہیں۔",
                "اللہ کی حلال کردہ چیز کو اپنی طرف سے حرام کرنا حدود اللہ سے تجاوز ہے۔",
                "نبی کریم ﷺ کو بھی اس عمل سے روکا گیا تاکہ امت کے لیے قاعدہ واضح ہو جائے۔"
              ],
              "english": [
                "Only Allah has the right to decide what is lawful and unlawful, not humans.",
                "Forbidding what Allah has made lawful is a transgression against His boundaries.",
                "Even the Prophet (ﷺ) was corrected on this to establish a clear rule for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسوہ حسنہ کی پیروی",
              "english": "Following the Best Example"
            },
            "content": {
              "urdu": [
                "ابن عباس نے آیت تلاوت کر کے واضح کیا کہ ہر معاملے میں نبی ﷺ کے طریقے کی پیروی واجب ہے۔",
                "نبی ﷺ نے جب کسی حلال چیز کو حرام کیا تو اللہ نے کفارہ ادا کرنے کا حکم دیا۔",
                "ہمیں بھی جذبات میں آکر ایسی باتیں کرنے کے بجائے سنت نبوی کو دیکھنا چاہیے۔"
              ],
              "english": [
                "Ibn 'Abbas recited the verse to clarify that following the Prophet (ﷺ) is obligatory in all matters.",
                "When the Prophet (ﷺ) forbade a lawful thing, Allah commanded the expiation of the oath.",
                "Instead of acting on emotions, we must look to the Prophetic Sunnah for guidance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور طلاق",
        "english": "Juristic Rulings and Divorce"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الفاظِ تحریم کی حیثیت",
              "english": "Status of Words of Forbidding"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص بیوی کو کہے کہ 'تو مجھ پر حرام ہے' تو یہ طلاق نہیں مانی جائے گی۔",
                "جمہور فقہاء کے نزدیک ایسے الفاظ 'یمین' (قسم) کے حکم میں آتے ہیں۔",
                "تاہم، اگر نیت طلاق کی ہو تو بعض فقہاء کے نزدیک یہ طلاقِ بائن ہو سکتی ہے۔"
              ],
              "english": [
                "If someone tells his wife 'You are forbidden to me', it is not considered a divorce.",
                "The majority of jurists hold that such words fall under the ruling of an 'Oath' (Yamin).",
                "However, if the intention was specifically for divorce, some jurists say it could count as such."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفارہ کا وجوب",
              "english": "Obligation of Expiation"
            },
            "content": {
              "urdu": [
                "بیوی کو حرام قرار دینے والے پر لازم ہے کہ وہ رجوع کرے اور اپنی قسم توڑے۔",
                "قسم توڑنے کا کفارہ 10 مسکینوں کو کھانا کھلانا، کپڑے دینا یا تین روزے رکھنا ہے۔",
                "یہ کفارہ اس لیے ہے تاکہ انسان کو اپنی زبان کی حفاظت کا احساس دلایا جائے۔"
              ],
              "english": [
                "Whoever declares his wife forbidden must return to the relationship and break that oath.",
                "The expiation is feeding 10 poor people, clothing them, or fasting for three days.",
                "This atonement serves as a reminder for the person to guard their tongue and speech."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاندانی زندگی اور جذباتی فیصلے",
        "english": "Family Life and Emotional Decisions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غصے پر قابو پانا",
              "english": "Controlling Anger"
            },
            "content": {
              "urdu": [
                "اکثر لوگ غصے کی حالت میں 'حرام' کے الفاظ بول دیتے ہیں جو بعد میں پریشانی کا باعث بنتے ہیں۔",
                "اسلام غصے میں کسی بھی قسم کے حتمی فیصلے سے بچنے کی تاکید کرتا ہے۔",
                "زبان کا غلط استعمال گھروں کو اجاڑنے اور گناہ میں مبتلا کرنے کا سبب بنتا ہے۔"
              ],
              "english": [
                "Most people utter words of 'Tahrim' in anger, causing later distress and regret.",
                "Islam emphasizes avoiding any final decisions while in a state of intense anger.",
                "Misuse of the tongue leads to the ruin of homes and falling into serious sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیوی کا احترام",
              "english": "Respect for the Wife"
            },
            "content": {
              "urdu": [
                "بیوی اللہ کی طرف سے دی گئی ایک نعمت اور حلال رشتہ ہے، اسے حرام کہنا ناشکری ہے۔",
                "اسلام میں رشتے جوڑنے کی ترغیب ہے، انہیں توڑنے یا حرام کرنے کی نہیں۔",
                "بیوی کے حقوق اور اس کے مرتبے کا لحاظ رکھنا ہر مسلمان شوہر پر لازم ہے۔"
              ],
              "english": [
                "A wife is a blessing and a lawful bond from Allah; calling her forbidden is ungratefulness.",
                "Islam encourages building and sustaining relationships, not severing or forbidding them.",
                "Respecting the rights and status of the wife is mandatory for every Muslim husband."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور نصیحت",
        "english": "Practical Training and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علمِ دین کی ضرورت",
              "english": "Need for Religious Knowledge"
            },
            "content": {
              "urdu": [
                "ازدواجی زندگی میں داخل ہونے سے پہلے طلاق اور نکاح کے بنیادی احکام سیکھنا ضروری ہے۔",
                "جہالت کی وجہ سے لوگ اپنی زندگیوں کو خود ہی مشکل بنا لیتے ہیں۔",
                "کسی بھی الجھن کی صورت میں جذباتی فیصلے کے بجائے علماء سے رجوع کرنا چاہیے۔"
              ],
              "english": [
                "It is essential to learn the basic rulings of marriage and divorce before entering family life.",
                "Out of ignorance, many people make their lives difficult through incorrect statements.",
                "In case of confusion, one should consult scholars instead of making emotional decisions."
              ]
            }
          },
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "ایک مومن کی زبان سے ہمیشہ خیر کے کلمات نکلنے چاہئیں۔",
                "ایسی باتوں سے پرہیز کرنا چاہیے جن سے شرعی پیچیدگیاں پیدا ہوں۔",
                "اللہ تعالیٰ ہمیں اپنی زبانوں کا صحیح استعمال کرنے کی توفیق عطا فرمائے۔"
              ],
              "english": [
                "A believer's tongue should always utter words of goodness and benefit.",
                "One must avoid statements that lead to legal and religious complications.",
                "May Allah grant us the ability to use our tongues correctly and wisely."
              ]
            }
          }
        ]
      }
    }
  ]
}