{
  "hadithId": 481,
  "hadithNo": 57,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/tirmidhi:1053"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "ضعيف. رواه الترمذي (1053) وقال: حسن غريب. ولكن في سنده قابوس بن أبي ظبيان وهو ضعيف، وفيه عنعنة سفيان الثوري. والمعنى ثابت في أحاديث أخرى صحيحة مثل حديث بريدة وعائشة في صحيح مسلم.",
    "urdu": "یہ روایت سنداً ضعیف ہے، اسے امام ترمذی (1053) نے روایت کیا ہے۔ اس کی سند میں قابوس بن ابی ظبیان ضعیف راوی ہے۔ تاہم قبرستان میں سلام کرنے کا اصل مفہوم دیگر صحیح احادیث (مثلاً صحیح مسلم کی روایات) سے ثابت ہے۔",
    "english": "Da'if (Weak). Reported by at-Tirmidhi (1053). The chain contains Qabus bin Abi Zabyan, who is weak. While this specific wording is weak, the general practice of saluting the dead is confirmed in Sahih Muslim via other authentic chains."
  },
  "importantWords": [
    {
      "arabic": "أَهْلَ اَلْقُبُورِ",
      "english": "People of the graves",
      "urdu": "قبروں والے / مردے"
    },
    {
      "arabic": "يَغْفِرُ اَللَّهُ",
      "english": "May Allah forgive",
      "urdu": "اللہ بخش دے"
    },
    {
      "arabic": "سَلَفُنَا",
      "english": "Our predecessors",
      "urdu": "ہمارے پیش رو / پہلے جانے والے"
    },
    {
      "arabic": "بِالْأَثَرِ",
      "english": "Following behind",
      "urdu": "پیچھے آنے والے / نقشِ قدم پر"
    },
    {
      "arabic": "أَقْبَلَ",
      "english": "Turned towards",
      "urdu": "متوجہ ہوئے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں قبرستان سے گزرتے وقت اہل قبور کو سلام کرنے اور ان کے لیے دعائے مغفرت کرنے کا مسنون طریقہ اور موت کی یاد دہانی بیان کی گئی ہے۔",
    "english": "This Hadith teaches the Sunnah of saluting the deceased and praying for their forgiveness when passing by a graveyard, serving as a reminder of our own mortality."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1053)",
      "english": "Sunan at-Tirmidhi (1053)"
    },
    {
      "arabic": "صحيح مسلم (974) - لشواهد المعنى",
      "english": "Sahih Muslim (974) - For supporting meaning"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R2_K-E-K98A",
  "grade": {
    "arabic": "ضعيف (بمعنى صحيح)",
    "english": "Da'if (Weak chain, though meaning is authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبرستان میں سلام کرنے کے آداب",
        "english": "Etiquettes of Greeting the Graveyard"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہل قبور کو سلام کرنا",
              "english": "Saluting the Deceased"
            },
            "content": {
              "urdu": [
                "قبرستان میں داخل ہوتے وقت یا وہاں سے گزرتے وقت سلام کرنا مسنون ہے۔",
                "یہ سلام اہل قبور کے لیے ایک تحفہ اور ان کی تکریم کا اظہار ہے۔",
                "میت کو مخاطب کر کے سلام کرنا ثابت کرتا ہے کہ وہ سلام کو محسوس کرتے ہیں۔"
              ],
              "english": [
                "It is Sunnah to greet the deceased when entering or passing a graveyard.",
                "This greeting serves as a gift and an expression of respect for the dead.",
                "Addressing the deceased shows they perceive the greetings of the living."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعائے مغفرت کی اہمیت",
              "english": "Importance of Praying for Forgiveness"
            },
            "content": {
              "urdu": [
                "سلام کے ساتھ ساتھ مردوں کے لیے اللہ سے معافی طلب کرنی چاہیے۔",
                "زندہ لوگوں کی دعا مردوں کے لیے قبر کی تنگی میں راحت کا سبب بنتی ہے۔",
                "اپنی مغفرت کی دعا بھی ساتھ کرنا عاجزی اور بندگی کا تقاضا ہے۔"
              ],
              "english": [
                "Along with greetings, one should seek Allah's forgiveness for the dead.",
                "Prayers of the living provide relief for the dead in their graves.",
                "Seeking one's own forgiveness alongside shows humility and devotion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "موت کی یاد دہانی اور عبرت",
        "english": "Reminder of Death and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سلف اور خلف کا تصور",
              "english": "Concept of Predecessors and Successors"
            },
            "content": {
              "urdu": [
                "مرنے والے ہم سے پہلے چلے گئے ہیں اور ہمیں بھی جلد ان سے ملنا ہے۔",
                "انسان کو ہر وقت یاد رکھنا چاہیے کہ وہ بھی ایک دن اہل قبور میں شامل ہوگا۔",
                "یہ احساس دنیا کی فانی لذتوں سے دل کو دور کر کے آخرت کی فکر پیدا کرتا ہے۔"
              ],
              "english": [
                "The dead have gone before us, and we are soon to join them.",
                "A person must always remember that they too will occupy a grave one day.",
                "This realization detaches the heart from worldliness and focuses on the hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبرستان جانے کا اصل مقصد",
              "english": "True Purpose of Visiting Graves"
            },
            "content": {
              "urdu": [
                "قبرستان جانے کا مقصد مردوں سے مانگنا نہیں بلکہ ان کے لیے مانگنا ہے۔",
                "یہ جگہ عبرت حاصل کرنے اور اپنی آخری منزل کو یاد کرنے کے لیے ہے۔",
                "اسلامی تعلیمات کے مطابق یہاں غیر شرعی رسومات سے بچنا لازمی ہے۔"
              ],
              "english": [
                "The purpose of visiting is to pray for the dead, not to ask from them.",
                "This location is for taking heed and remembering our final destination.",
                "According to Islamic teachings, one must avoid innovated rituals there."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسنون کلمات اور الفاظ",
        "english": "Sunnah Phrasings and Wording"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف روایات کا مجموعہ",
              "english": "Collection of Various Narrations"
            },
            "content": {
              "urdu": [
                "صحیح مسلم میں اس سے زیادہ مستند دعائیہ کلمات موجود ہیں۔",
                "اہلِ دیار اور مومنین و مسلمین کے الفاظ سنت سے ثابت ہیں۔",
                "انسان جس دعا کو بھی چاہے جو سنت سے ثابت ہو، پڑھ سکتا ہے۔"
              ],
              "english": [
                "More authentic wordings are found in Sahih Muslim for this occasion.",
                "Phrases addressing 'dwellers of these abodes' are proven from Sunnah.",
                "One may recite any of the various supplications proven from the Prophet."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخ موڑ کر متوجہ ہونا",
              "english": "Turning the Face Towards Them"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ان کی طرف رخ کر کے سلام کیا جو خاص توجہ کو ظاہر کرتا ہے۔",
                "یہ عمل میت کے ساتھ ایک روحانی تعلق اور شفقت کا عکاس ہے۔",
                "سلام کرتے وقت سنجیدگی اور وقار برقرار رکھنا سنت کا حصہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) turned his face towards them, showing special attention.",
                "This act reflects a spiritual connection and compassion for the deceased.",
                "Maintaining seriousness and dignity during the greeting is part of Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور فوائد",
        "english": "Practical Lessons and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق العباد کی وسعت",
              "english": "Broadness of Human Rights"
            },
            "content": {
              "urdu": [
                "مسلمانوں کے باہمی تعلقات موت کے بعد بھی ختم نہیں ہوتے۔",
                "مردوں کے لیے دعا کرنا ان کا زندہ مسلمانوں پر ایک اہم حق ہے۔",
                "نبی ﷺ کی یہ سنت ہمیں ایک دوسرے کا خیر خواہ بننا سکھاتی ہے۔"
              ],
              "english": [
                "Mutual relations among Muslims do not terminate upon death.",
                "Praying for the dead is a significant right they have over the living.",
                "This Sunnah of the Prophet (ﷺ) teaches us to be well-wishers for all."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلاحِ نفس",
              "english": "Self-Reformation"
            },
            "content": {
              "urdu": [
                "قبروں کو دیکھ کر تکبر اور انا کا خاتمہ ہونا چاہیے۔",
                "آخرت کی تیاری ہی انسانی زندگی کا اصل حاصل اور مقصد ہے۔",
                "قبرستان کی دعا انسان کے دل میں خوفِ خدا پیدا کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Seeing the graves should lead to the eradication of pride and ego.",
                "Preparing for the hereafter is the true gain and purpose of human life.",
                "The graveyard supplication is a means to instill the fear of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}