{
  "hadithId": 747,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/muslim:983"
    ],
    "kitabId": 7,
    "inKitabBab": 9,
    "arabicBook": "كتاب البيوع",
    "babId": 50
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1468)، ومسلم (983). وفي تمام الحديث ذكر امتناع ابن جميل وخالد والعباس عن الزكاة، وبيان النبي صلى الله عليه وسلم لأعذارهم.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (1468) و مسلم (983) کی متفقہ روایت ہے۔ اس مکمل حدیث میں تذکرہ ہے کہ ابن جمیل، خالد بن ولید اور عباس رضی اللہ عنہم نے جب زکوٰۃ دینے سے انکار کیا (یا اس میں کوئی اشکال ہوا) تو نبی ﷺ نے ان کے بارے میں وضاحت فرمائی۔",
    "english": "Sahih. Reported by Al-Bukhari (1468) and Muslim (983). The full Hadith discusses the collection of Zakat and the Prophet's clarification regarding Ibn Jamil, Khalid bin Al-Walid, and Al-Abbas."
  },
  "importantWords": [
    {
      "arabic": "بَعَثَ",
      "english": "Sent / Appointed",
      "urdu": "بھیجا / مقرر کیا"
    },
    {
      "arabic": "الصَّدَقَةِ",
      "english": "Zakat / Obligatory Charity",
      "urdu": "زکوٰۃ / صدقہ واجبہ"
    },
    {
      "arabic": "صِنْوُ أَبِيهِ",
      "english": "Like one's father",
      "urdu": "باپ کے برابر / باپ کی طرح"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ سرکاری سطح پر زکوٰۃ کی وصولی کے لیے وکیل یا عامل مقرر کرنا سنتِ نبوی ہے اور ریاست کو اس کا نظم و ضبط سنبھالنا چاہیے۔",
    "english": "This Hadith establishes the Prophetic Sunnah of appointing agents or officials for the collection of Zakat and indicates that the state should manage its administration."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1468)",
      "english": "Sahih al-Bukhari (1468)"
    },
    {
      "arabic": "صحيح مسلم (983)",
      "english": "Sahih Muslim (983)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0O5vXJ4Xm4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وکالت اور انتظامی امور",
        "english": "Agency and Administrative Affairs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاملینِ زکوٰۃ کا تقرر",
              "english": "Appointment of Zakat Officials"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے زکوٰۃ کی وصولی کے لیے باقاعدہ وکیل (عاملین) مقرر فرمائے تھے۔",
                "سیدنا عمر رضی اللہ عنہ کو اس کام پر مامور کرنا ان کی دیانت اور انتظامی صلاحیتوں پر اعتماد کی دلیل ہے۔",
                "اسلامی ریاست کی یہ ذمہ داری ہے کہ وہ مالی واجبات کی وصولی کا شفاف نظام قائم کرے۔"
              ],
              "english": [
                "The Prophet (PBUH) formally appointed agents (Amilin) for the collection of Zakat.",
                "Assigning this task to 'Umar (R.A) proves trust in his integrity and administrative skills.",
                "It is the responsibility of the Islamic state to establish a transparent system for collecting financial dues."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحصیلدار کے اختیارات",
              "english": "Authority of the Collector"
            },
            "content": {
              "urdu": [
                "حاکم کی طرف سے مقرر کردہ وکیل کو یہ حق حاصل ہے کہ وہ مالداروں سے ان کا حق وصول کرے۔",
                "عامل کو چاہیے کہ وہ مال کا معائنہ کرے اور شرعی قواعد کے مطابق زکوٰۃ کا تعین کرے۔",
                "لوگوں کو چاہیے کہ وہ سرکاری نمائندوں کے ساتھ مالی معاملات میں تعاون کریں۔"
              ],
              "english": [
                "An agent appointed by the ruler has the right to collect dues from the wealthy.",
                "The collector must inspect the assets and determine Zakat according to Sharia rules.",
                "People should cooperate with state representatives in financial matters."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اعتراضات اور ان کے جوابات",
        "english": "Objections and Their Responses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خالد بن ولید رضی اللہ عنہ کا عذر",
              "english": "Excuse of Khalid bin Al-Walid"
            },
            "content": {
              "urdu": [
                "لوگوں نے سمجھا کہ خالد رضی اللہ عنہ زکوٰۃ نہیں دے رہے، مگر نبی ﷺ نے ان کا دفاع کیا۔",
                "آپ ﷺ نے بتایا کہ انہوں نے اپنا سارا جنگی سامان اللہ کی راہ میں وقف کر رکھا ہے۔",
                "جو چیز وقف (Endowment) کر دی جائے اس پر زکوٰۃ نہیں ہوتی۔"
              ],
              "english": [
                "People thought Khalid (R.A) was withholding Zakat, but the Prophet (PBUH) defended him.",
                "He (PBUH) explained that Khalid had dedicated all his military gear for the sake of Allah.",
                "Endowed (Waqf) properties are not subject to Zakat."
              ]
            }
          },
          {
            "title": {
              "urdu": "حضرت عباس رضی اللہ عنہ کی زکوٰۃ",
              "english": "Zakat of Al-Abbas"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے بتایا کہ عباس رضی اللہ عنہ کی زکوٰۃ کی ذمہ داری خود آپ ﷺ نے لی ہے (یا انہوں نے پیشگی دے دی ہے)۔",
                "اس سے ثابت ہوتا ہے کہ ضرورت کے تحت زکوٰۃ ایک یا دو سال کی پیشگی (Advance) بھی دی جا سکتی ہے۔",
                "اپنے قریبی رشتہ داروں کا دفاع کرنا اور ان کی طرف سے صفائی پیش کرنا سنت ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) stated that he had taken responsibility for Al-Abbas's Zakat (or it was paid in advance).",
                "This proves that Zakat can be paid in advance for one or two years if needed.",
                "Defending close relatives and providing clarifications on their behalf is Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی سبق",
        "english": "Social and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رشتہ داروں کا مقام",
              "english": "Status of Relatives"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ 'آدمی کا چچا اس کے باپ کی طرح ہوتا ہے'۔",
                "یہ جملہ رشتہ داروں کے احترام اور ان کے حقوق کی اہمیت کو اجاگر کرتا ہے۔",
                "اعلیٰ حکام کو چاہیے کہ وہ اپنے ماتحتوں کو بھی رشتہ داروں کے احترام کی تلقین کریں۔"
              ],
              "english": [
                "The Prophet (PBUH) said: 'A man's uncle is like his father.'",
                "This phrase highlights the respect due to relatives and the importance of their rights.",
                "High officials should encourage their subordinates to respect family ties."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ ظن کی ضرورت",
              "english": "The Need for Good Expectations"
            },
            "content": {
              "urdu": [
                "بغیر تحقیق کے کسی پر بخل یا فرائض کی کوتاہی کا الزام نہیں لگانا چاہیے۔",
                "ممکن ہے کسی نے اللہ کی راہ میں اتنا کچھ دے دیا ہو جو دوسروں کی نظر میں نہ ہو۔",
                "اسلامی معاشرہ باہمی اعتماد اور مثبت سوچ پر قائم ہوتا ہے۔"
              ],
              "english": [
                "One should not accuse others of stinginess or neglect of duties without investigation.",
                "It is possible someone has given so much for Allah's sake that others are unaware of.",
                "Islamic society is built on mutual trust and positive thinking."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ کلام",
        "english": "Conclusion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی نظام میں شفافیت",
              "english": "Transparency in Financial Systems"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کی وصولی کا انتظام سنتِ نبوی سے ثابت ہے، جو کہ غربت کے خاتمے کا بہترین ذریعہ ہے۔",
                "عاملین کو ایمانداری اور لوگوں کو فراخدلی کا مظاہرہ کرنا چاہیے۔",
                "رزقِ حلال اور فرائض کی ادائیگی میں ہی دنیا و آخرت کی کامیابی ہے۔"
              ],
              "english": [
                "Managing Zakat collection is a Prophetic Sunnah and the best means to eradicate poverty.",
                "Officials should demonstrate honesty, and the public should show generosity.",
                "Success in both worlds lies in Halal provision and the fulfillment of obligations."
              ]
            }
          }
        ]
      }
    }
  ]
}