{
  "hadithId": 713,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2190"],
    "kitabId": 7,
    "inKitabBab": 4,
    "arabicBook": "كتاب البيوع",
    "babId": 45
  },
 
  "takhreej": {
    "arabic": "صحيح البخاري (2190)، كتاب البيوع، باب بيع العرايا؛ وصحيح مسلم (1541).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (2190) اور امام مسلم (1541) دونوں نے اسے روایت کیا ہے۔ 'عرایا' بیع مزابنہ سے ایک استثنائی صورت ہے۔",
    "english": "Sahih al-Bukhari (2190) and Sahih Muslim (1541). It is a Muttafaqun Alayh (agreed upon) Hadith."
  },
  "importantWords": [
    {
      "arabic": "رَخَّصَ",
      "english": "Gave concession / Permitted",
      "urdu": "رخصت دی / اجازت دی"
    },
    {
      "arabic": "الْعَرَايَا",
      "english": "Al-Araya",
      "urdu": "درخت پر لگی تازہ کھجور"
    },
    {
      "arabic": "بِخَرْصِهَا",
      "english": "By estimation",
      "urdu": "اندازہ کر کے"
    },
    {
      "arabic": "أَوْسُقٍ",
      "english": "Wasaqs (units of volume)",
      "urdu": "وسق (ماپ کا پیمانہ)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیعِ مزابنہ (تخمینے والی بیع) کی عمومی ممانعت سے ایک خاص رعایت 'بیع عرایا' کے لیے دی گئی ہے، تاکہ ضرورت مند لوگ تازہ کھجوریں حاصل کر سکیں۔",
    "english": "This Hadith provides a specific exception (concession) to the general prohibition of Muzabanah for 'Bay' al-Araya', allowing the exchange of dates by estimation to meet specific needs."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2190)",
      "english": "Sahih al-Bukhari (2190)"
    },
    {
      "arabic": "صحيح مسلم (1541)",
      "english": "Sahih Muslim (1541)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیعِ عرایا کی حقیقت",
        "english": "Reality of Bay' al-Araya"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عرایا کا مفہوم",
              "english": "Meaning of Araya"
            },
            "content": {
              "urdu": [
                "عرایا سے مراد وہ تازہ کھجوریں ہیں جو ابھی درخت پر لگی ہوں اور انہیں خشک کھجوروں کے بدلے اندازے سے خریدا جائے۔",
                "عام طور پر ہم جنس اشیاء کا تبادلہ برابر وزن اور نقد ہونا ضروری ہے، مگر یہاں اندازہ کرنے کی اجازت دی گئی۔",
                "یہ رعایت صرف مخصوص حالات اور ضرورت کی بنا پر دی گئی ہے۔"
              ],
              "english": [
                "Araya refers to fresh dates still on trees exchanged for dried dates based on estimation.",
                "Generally, exchanging items of the same genus must be equal and spot-based, but here estimation is allowed.",
                "This concession was granted only for specific circumstances and needs."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصت کی وجہ",
              "english": "Reason for Concession"
            },
            "content": {
              "urdu": [
                "مدینہ میں بعض غریب لوگوں کے پاس نقد رقم نہیں ہوتی تھی مگر گھروں میں خشک کھجوریں موجود ہوتی تھیں۔",
                "وہ چاہتے تھے کہ موسم میں اپنے بچوں کے لیے تازہ کھجوریں لائیں، اس لیے انہیں اس تبادلے کی اجازت ملی۔",
                "اسلامی شریعت میں انسانی ضرورت اور سہولت کا خاص خیال رکھا جاتا ہے۔"
              ],
              "english": [
                "In Madinah, some poor people lacked cash but had dried dates stored at home.",
                "They wished to provide fresh dates for their children during the season, hence this permission.",
                "Islamic Sharia gives special consideration to human necessity and ease."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرائط اور حدود",
        "english": "Conditions and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقدار کی حد",
              "english": "Quantitative Limit"
            },
            "content": {
              "urdu": [
                "یہ رعایت صرف پانچ وسق یا اس سے کم مقدار کے لیے ہے (ایک وسق تقریباً 130 کلوگرام ہوتا ہے)۔",
                "بڑی تجارتی مقداروں میں اندازہ (خرص) جائز نہیں بلکہ وہاں برابری یقینی ہونی چاہیے۔",
                "یہ حد اس بات کو یقینی بناتی ہے کہ اس رعایت کو بڑے پیمانے پر نفع خوری کے لیے استعمال نہ کیا جائے۔"
              ],
              "english": [
                "This concession is limited to five Wasaqs or less (one Wasaq is approx 130kg).",
                "In large commercial quantities, estimation (Khars) is not allowed; equality must be certain.",
                "This limit prevents the concession from being exploited for large-scale profiteering."
              ]
            }
          },
          {
            "title": {
              "urdu": "خرص (اندازہ) کی شرط",
              "english": "Condition of Estimation"
            },
            "content": {
              "urdu": [
                "تبادلہ کرتے وقت ماہر شخص درخت پر لگی کھجوروں کا اندازہ لگائے کہ یہ خشک ہو کر کتنی بنیں گی۔",
                "یہ اندازہ اس لیے ضروری ہے تاکہ جتنا ممکن ہو سکے برابری (مثلاً بمثل) کے قریب رہا جا سکے۔",
                "اگرچہ یہ سو فیصد یقینی نہیں، مگر ضرورت کی بنا پر اسے 'یقین' کے قائم مقام مانا گیا۔"
              ],
              "english": [
                "An expert must estimate the yield of fresh dates on the tree to determine their dried equivalent.",
                "This estimation is required to stay as close as possible to the 'like for like' principle.",
                "Though not 100% certain, it is legally treated as certainty due to the underlying need."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رفعِ حرج (تنگی دور کرنا)",
              "english": "Removing Hardship"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک اہم فقہی اصول 'تنگی آنے پر وسعت پیدا ہوتی ہے' کی عکاسی کرتی ہے۔",
                "جب عام قانون (مزابنہ کی ممانعت) سے لوگوں کو معاشی تنگی ہو، تو شریعت متبادل فراہم کرتی ہے۔",
                "مگر یہ وسعت صرف ضرورت کی حد تک ہی رہتی ہے۔"
              ],
              "english": [
                "This Hadith reflects the legal maxim: 'Hardship brings about ease'.",
                "When a general law (prohibition of Muzabanah) causes economic hardship, Sharia provides an alternative.",
                "However, this ease is restricted to the extent of the necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل اور احسان کا امتزاج",
              "english": "Blending Justice and Kindness"
            },
            "content": {
              "urdu": [
                "اسلام صرف خشک قوانین کا مجموعہ نہیں بلکہ اس میں انسانی جذبات اور ضرورت کی رعایت بھی ہے۔",
                "سود کے دروازے بھی بند کیے گئے اور ضرورت مندوں کے لیے راستہ بھی کھلا رکھا گیا۔",
                "یہ توازن اسلامی معاشی نظام کی خوبصورتی ہے۔"
              ],
              "english": [
                "Islam is not just a collection of dry laws; it considers human emotions and needs.",
                "It closed the doors to usury while keeping a path open for the needy.",
                "This balance is the beauty of the Islamic economic system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مجبور کی مدد",
              "english": "Helping the Distressed"
            },
            "content": {
              "urdu": [
                "تاجروں کو چاہیے کہ وہ صرف نفع نہ دیکھیں بلکہ سماجی خدمت کا جذبہ بھی رکھیں۔",
                "اگر کوئی مجبور ہو تو اسے شرعی دائرے میں رہ کر رعایت دینا سنت ہے۔",
                "اللہ تعالیٰ ان لوگوں کی مدد کرتا ہے جو اس کے بندوں کے لیے آسانیاں پیدا کرتے ہیں۔"
              ],
              "english": [
                "Traders should not look only at profit but also possess a spirit of social service.",
                "It is Sunnah to provide concessions to the distressed within Sharia boundaries.",
                "Allah helps those who create ease for His servants."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی حدود کی پاسداری",
              "english": "Adherence to Sharia Limits"
            },
            "content": {
              "urdu": [
                "رعایت کے باوجود پانچ وسق کی حد بتاتی ہے کہ دین کے احکامات میں ڈسپلن ضروری ہے۔",
                "ہمیں اللہ کی دی ہوئی رخصتوں سے فائدہ اٹھانا چاہیے مگر ان سے تجاوز نہیں کرنا چاہیے۔",
                "معاشی معاملات میں تقویٰ ہی برکت کا ضامن ہے۔"
              ],
              "english": [
                "Despite the concession, the five-Wasaq limit shows that discipline is vital in religious rulings.",
                "We should utilize the permissions granted by Allah but never exceed them.",
                "Piety (Taqwa) in economic dealings is the guarantor of blessing."
              ]
            }
          }
        ]
      }
    }
  ]
}