{
  "hadithId": 976,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/976"],
    "kitabId": 8,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 77
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه النسائي (5 /61)‏، وابن حبان (810)‏، والدارقطني (3 /44 - 4586)‏. وهو حديث ثابت في فضل الصدقة والنفقة على الأقارب.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے نسائی (5/61)، ابن حبان (810) اور دارقطنی (3/44) نے روایت کیا ہے۔ یہ رشتہ داروں پر خرچ کرنے کی فضیلت اور ترتیب کے حوالے سے ایک اہم بنیاد ہے۔",
    "english": "Sahih (Authentic). Reported by An-Nasa'i (5/61), Ibn Hibban (810), and Ad-Daraqutni (3/44). It is a well-established narration regarding the excellence of charity and the priority of family members in maintenance."
  },
  "importantWords": [
    {
      "arabic": "يَدُ اَلْمُعْطِي",
      "english": "Hand of the giver",
      "urdu": "دینے والا ہاتھ"
    },
    {
      "arabic": "اَلْعُلْيَا",
      "english": "The Upper / Higher",
      "urdu": "بلند / اعلیٰ"
    },
    {
      "arabic": "تَعُولُ",
      "english": "You support / Your dependents",
      "urdu": "جس کی تم کفالت کرتے ہو"
    },
    {
      "arabic": "أَدْنَاكَ",
      "english": "Closest to you",
      "urdu": "تمہارے قریب ترین"
    },
    {
      "arabic": "يَخْطُبُ",
      "english": "Delivering a sermon",
      "urdu": "خطبہ دے رہے تھے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں صدقہ اور نفقہ کی فضیلت بیان کی گئی ہے اور یہ واضح کیا گیا ہے کہ انسان کو سب سے پہلے اپنے والدین اور بہن بھائیوں کی ضروریات کا خیال رکھنا چاہیے۔",
    "english": "This Hadith emphasizes the excellence of giving and provides a clear hierarchy for financial support, placing parents and siblings at the forefront of one's responsibility."
  },
  "references": [
    {
      "arabic": "رواه النسائي (2532)",
      "english": "Reported by An-Nasa'i (2532)"
    },
    {
      "arabic": "رواه ابن حبان (3338)",
      "english": "Reported by Ibn Hibban (3338)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "طارق بن شهاب المحاربي",
        "english": "Tariq bin Shihab al-Muharibi"
      },
      "slug": "tariq-bin-shihab-al-muharibi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0O6108_pQEc",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انفاق کی فضیلت اور ترتیب",
        "english": "Excellence and Order of Spending"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینے والے ہاتھ کی برتری",
              "english": "Superiority of the Giving Hand"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے دینے والے ہاتھ کو اوپر والا ہاتھ قرار دے کر سخاوت کی ترغیب دی ہے۔",
                "اس سے مراد یہ ہے کہ دینے والا، لینے والے سے مرتبے میں بلند ہوتا ہے۔",
                "اسلام معاشرے میں خودداری اور دوسروں کی مدد کرنے کا مزاج پیدا کرنا چاہتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) encouraged generosity by describing the giving hand as the 'upper' hand.",
                "This implies that the giver holds a higher status in virtue compared to the receiver.",
                "Islam aims to foster self-reliance and a culture of helping others within society."
              ]
            }
          },
          {
            "title": {
              "urdu": "خرچ کی ترجیحات",
              "english": "Priorities in Spending"
            },
            "content": {
              "urdu": [
                "صدقہ و خیرات میں سب سے پہلا حق ان لوگوں کا ہے جو آپ کی کفالت میں ہیں۔",
                "والدین اور بہن بھائیوں پر خرچ کرنا محض احسان نہیں بلکہ شرعی فریضہ ہے۔",
                "غیروں پر خرچ کرنے سے پہلے گھر والوں کی ضروریات پوری کرنا ضروری ہے۔"
              ],
              "english": [
                "The first right to one's charity belongs to those under their direct maintenance.",
                "Spending on parents and siblings is a Sharia obligation, not just an act of kindness.",
                "It is essential to fulfill the needs of family members before reaching out to others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صلہ رحمی اور حقوق",
        "english": "Upholding Kinship and Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "والدین کا مقام",
              "english": "Status of Parents"
            },
            "content": {
              "urdu": [
                "حدیث میں سب سے پہلے ماں اور باپ کا ذکر ان کی عظمت کی دلیل ہے۔",
                "بڑھاپے میں یا ضرورت کے وقت ان کی مالی خدمت کرنا جنت کا راستہ ہے۔",
                "اولاد کا مال حقیقت میں والدین کا مال ہے اگر وہ ضرورت مند ہوں۔"
              ],
              "english": [
                "Mentioning the mother and father first highlights their supreme status in Islam.",
                "Providing for them financially in old age or need is a path to Paradise.",
                "A child's wealth rightfully belongs to the parents if they are in need."
              ]
            }
          },
          {
            "title": {
              "urdu": "قریبی رشتہ داروں کا حق",
              "english": "Rights of Close Relatives"
            },
            "content": {
              "urdu": [
                "بہن اور بھائی پر خرچ کرنا صلہ رحمی کی بہترین صورت ہے۔",
                "درجہ بدرجہ قریبی رشتہ داروں کا خیال رکھنے سے خاندانی نظام مضبوط ہوتا ہے۔",
                "قریبی رشتہ دار پر صدقہ کرنے کے دو اجر ہیں: ایک صدقہ کا اور دوسرا صلہ رحمی کا۔"
              ],
              "english": [
                "Spending on brothers and sisters is one of the best forms of upholding kinship.",
                "Taking care of relatives by proximity strengthens the social fabric of the family.",
                "Charity given to a relative earns two rewards: one for charity and one for kinship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی انصاف اور توازن",
        "english": "Social Justice and Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفالت کا دائرہ",
              "english": "Sphere of Support"
            },
            "content": {
              "urdu": [
                "اسلام ہر شخص کو اپنے قریبی حلقے کی ذمہ داری اٹھانے کا حکم دیتا ہے۔",
                "اگر ہر کوئی اپنے رشتہ داروں کی مدد کرے تو معاشرے سے غربت کا خاتمہ ممکن ہے۔",
                "یہ نظام سرکاری بیت المال پر بوجھ کم کرنے میں مددگار ثابت ہوتا ہے۔"
              ],
              "english": [
                "Islam commands every individual to take responsibility for their immediate circle.",
                "If everyone supports their relatives, poverty can be effectively eliminated from society.",
                "This system helps in reducing the financial burden on the public treasury (Bait-ul-Mal)."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل کی اہمیت",
              "english": "Importance of Equity"
            },
            "content": {
              "urdu": [
                "حقوق کی ادائیگی میں عدل و انصاف سے کام لینا ضروری ہے۔",
                "صرف شہرت کے لیے باہر خرچ کرنا اور گھر والوں کو بھوکا رکھنا سخت ناپسندیدہ ہے۔",
                "نبی ﷺ کی تعلیمات ہمیں اعتدال اور ترجیحات کا درست شعور دیتی ہیں۔"
              ],
              "english": [
                "Justice and equity must be observed when fulfilling financial rights.",
                "Spending outwardly for fame while neglecting home needs is highly disliked.",
                "The teachings of the Prophet (ﷺ) provide a correct sense of moderation and priorities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Lesson for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی برکت",
              "english": "Blessings in Wealth"
            },
            "content": {
              "urdu": [
                "اپنے اہل و عیال پر خوش دلی سے خرچ کرنے سے مال میں برکت ہوتی ہے۔",
                "اللہ کی راہ میں دیا گیا مال کبھی کم نہیں ہوتا بلکہ بڑھتا ہے۔",
                "نیت کی درستی عمل کے اجر کو کئی گنا بڑھا دیتی ہے۔"
              ],
              "english": [
                "Spending cheerfully on one's family brings divine blessings to one's wealth.",
                "Wealth given for the sake of Allah never decreases; rather, it grows.",
                "Sincerity of intention multiplies the reward of the deed many times over."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمہ داری کا احساس",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو اپنی مالی ذمہ داریوں سے آگاہ ہونا چاہیے۔",
                "رشتہ داروں کی ضروریات کو نظر انداز کرنا صلہ رحمی کے منافی ہے۔",
                "معاشرے کی بہتری کا آغاز اپنے گھر کی اصلاح اور خدمت سے ہوتا ہے۔"
              ],
              "english": [
                "Every Muslim should be fully aware of their financial responsibilities.",
                "Ignoring the needs of relatives is contrary to the spirit of maintaining kinship.",
                "The betterment of society begins with the reform and service of one's own home."
              ]
            }
          }
        ]
      }
    }
  ]
}