{
  "hadithId": 355,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bukhari:4168", "muslim:860"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "كتاب الجمعة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (4168)، ومسلم (860). والحديث صريح في أن النبي صلى الله عليه وسلم كان يبكر بصلاة الجمعة في أول وقتها.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری اور مسلم دونوں نے روایت کیا ہے۔ یہ حدیث اس بات پر واضح دلیل ہے کہ نبی کریم ﷺ جمعہ کی نماز اول وقت میں (زوال کے فوراً بعد) ادا فرماتے تھے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (4168) and Muslim (860). The Hadith clearly indicates that the Prophet (ﷺ) used to perform the Friday prayer early at the beginning of its time."
  },
  "importantWords": [
    {
      "arabic": "نَنْصَرِفُ",
      "english": "Depart / Leave",
      "urdu": "ہم واپس مڑتے / فارغ ہوتے"
    },
    {
      "arabic": "الْحِيطَانِ",
      "english": "The walls",
      "urdu": "دیواریں"
    },
    {
      "arabic": "زَالَتِ",
      "english": "Passed the meridian / Declined",
      "urdu": "سورج ڈھل گیا / زوال ہو گیا"
    },
    {
      "arabic": "الْفَيْءَ",
      "english": "The shadow (after noon)",
      "urdu": "سایہ (جو زوال کے بعد ہو)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ رسول اللہ ﷺ جمعہ کی نماز زوال کے فوراً بعد پڑھاتے تھے، یہاں تک کہ جب صحابہ واپس جاتے تو دیواروں کا سایہ اتنا نہیں پھیلا ہوتا تھا کہ وہ اس میں چل سکیں۔",
    "english": "This Hadith establishes that the Prophet (ﷺ) used to lead the Friday prayer immediately after the sun passed the meridian (Zawal), such that when the Companions returned home, the shadows of the walls were not yet long enough to provide ample shade."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (4168)",
      "english": "Sahih al-Bukhari (4168)"
    },
    {
      "arabic": "صحيح مسلم (860)",
      "english": "Sahih Muslim (860)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سلمة بن الأكوع",
        "english": "Salamah bin al-Akwa'"
      },
      "slug": "salamah-bin-al-akwa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کی نماز کا وقت",
        "english": "The Time of Friday Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اول وقت میں ادائیگی",
              "english": "Offering at the Earliest Time"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ جمعہ کی نماز میں تعجیل (جلدی) فرماتے تھے، یعنی زوال کے فوراً بعد خطبہ اور نماز ادا کر لیتے تھے۔",
                "مسلم کی روایت 'اذا زالت الشمس' (جب سورج ڈھل جاتا) سے واضح ہوتا ہے کہ جمعہ کا وقت ظہر کے وقت کی طرح زوال کے بعد ہی شروع ہوتا ہے۔",
                "صحابہ کرام کا دیواروں کا سایہ نہ پانا اس بات کی عکاسی ہے کہ نماز اور خطبہ بہت طویل نہیں ہوتے تھے اور اول وقت میں ختم ہو جاتے تھے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used to expedite the Friday prayer, delivering the sermon and praying immediately after the sun's decline (Zawal).",
                "The narration in Muslim 'when the sun passed the meridian' clarifies that the time for Friday prayer begins after Zawal, similar to Dhuhr.",
                "The fact that the Companions found no shade shows the prayer and sermon were not excessively long and ended early."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سایہ نہ ہونے کی تشریح",
        "english": "Interpretation of 'No Shade'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیواروں کا سایہ",
              "english": "Shade of the Walls"
            },
            "content": {
              "urdu": [
                "عرب کے گرم موسم میں لوگ سائے میں چلنا پسند کرتے تھے، مگر جمعہ سے واپسی پر سایہ ابھی دیواروں کے قدموں میں ہی ہوتا تھا۔",
                "اس کا مطلب یہ نہیں کہ بالکل سایہ نہیں تھا، بلکہ یہ کہ وہ اتنا طویل نہیں تھا کہ نمازی اس میں پناہ لے سکیں۔",
                "یہ اس بات کی دلیل ہے کہ جمعہ کی نماز میں بہت زیادہ تاخیر کرنا سنت کے خلاف ہے۔"
              ],
              "english": [
                "In the hot Arabian climate, people preferred walking in the shade, but upon returning from Friday prayer, the shadow was still right at the base of the walls.",
                "It doesn't mean there was absolutely no shadow, but rather that it wasn't long enough for people to walk within it for shelter.",
                "This serves as evidence that delaying the Friday prayer significantly is contrary to the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو",
        "english": "Jurisprudential Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کیا زوال سے پہلے جمعہ جائز ہے؟",
              "english": "Is Friday Prayer Valid Before Zawal?"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء (احناف، شوافع، مالکیہ) کے نزدیک جمعہ کا وقت وہی ہے جو ظہر کا ہے، یعنی زوال کے بعد۔",
                "امام احمد بن حنبل کے نزدیک زوال سے کچھ پہلے بھی جمعہ پڑھنا جائز ہے، مگر اولیٰ زوال کے بعد ہی ہے۔",
                "یہ حدیث دونوں آراء کے لیے استدلال کا ذریعہ بنتی ہے، مگر مسلم کی روایت زوال کے بعد والی رائے کو مضبوط کرتی ہے۔"
              ],
              "english": [
                "The majority of jurists (Hanafi, Shafi'i, Maliki) hold that the time for Friday prayer is the same as Dhuhr, starting after Zawal.",
                "Imam Ahmad bin Hanbal permits offering it slightly before Zawal, though after Zawal is preferred.",
                "This Hadith provides evidence for both views, but the Muslim narration strengthens the position of it being after Zawal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی اہمیت اور نظم و ضبط",
              "english": "Importance of Time and Discipline"
            },
            "content": {
              "urdu": [
                "جمعہ کے دن مسجد میں جلدی پہنچنا اور نماز کو اپنے وقت پر ادا کرنا ایک مومن کا شیوہ ہونا چاہیے۔",
                "ائمہ مساجد کو چاہیے کہ وہ خطبہ اور نماز میں اعتدال رکھیں تاکہ لوگ اکتاہٹ کا شکار نہ ہوں، جیسا کہ سنت سے ثابت ہے۔",
                "دینِ اسلام ہمیں وقت کے صحیح استعمال اور ہر عبادت کو اس کے افضل وقت میں ادا کرنے کا سبق دیتا ہے۔"
              ],
              "english": [
                "Arriving early at the mosque on Friday and offering the prayer on time should be the trait of a believer.",
                "Imams should keep the sermon and prayer moderate to prevent the congregation from becoming weary, as established by Sunnah.",
                "Islam teaches us the correct use of time and to perform every act of worship at its most virtuous time."
              ]
            }
          }
        ]
      }
    }
  ]
}