{
  "hadithId": 835,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/12"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (4/394) ، وأبو داود (2085) ، والترمذي (1101) ، وابن ماجه (1881) ، وابن حبان (1243). وصححه الأئمة علي بن المديني والبخاري والترمذي وابن حبان والحاكم.",
    "urdu": "صحیح۔ اسے امام احمد (394/4)، ابوداؤد (2085)، ترمذی (1101) اور ابن ماجہ (1881) نے روایت کیا ہے۔ امام ابن مدینی اور امام بخاری نے بھی اس کی صحت کی تائید کی ہے۔",
    "english": "Sahih. Reported by Ahmad (4/394), Abu Dawud (2085), At-Tirmidhi (1101), and Ibn Majah (1881). It has been authenticated by major Imams including Ali ibn al-Madini, Al-Bukhari, and Ibn Hibban."
  },
  "importantWords": [
    {
      "arabic": "لَا نِكَاحَ",
      "english": "No marriage / Not valid",
      "urdu": "نکاح نہیں ہوتا"
    },
    {
      "arabic": "إِلَّا",
      "english": "Except",
      "urdu": "بغیر / سوائے"
    },
    {
      "arabic": "بِوَلِيٍّ",
      "english": "With a guardian",
      "urdu": "ولی کے ساتھ"
    },
    {
      "arabic": "أُعِلَّ",
      "english": "Declared defective",
      "urdu": "علت نکالی گئی"
    },
    {
      "arabic": "الْإِرْسَالِ",
      "english": "Being Mursal",
      "urdu": "مرسل ہونا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ نکاح کی صحت کے لیے لڑکی کے سرپرست (ولی) کی موجودگی اور رضامندی لازمی شرط ہے۔",
    "english": "This Hadith establishes that the presence and consent of a guardian (Wali) is a fundamental condition for the validity of an Islamic marriage."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2085)",
      "english": "Sunan Abi Dawud (2085)"
    },
    {
      "arabic": "سنن الترمذي (1101)",
      "english": "Sunan at-Tirmidhi (1101)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa Al-Ash'ari"
      },
      "slug": "abu-musa-al-ashari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح میں ولی کی اہمیت",
        "english": "Significance of Wali in Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکنِ نکاح",
              "english": "A Pillar of Marriage"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک ولی کے بغیر نکاح سرے سے منعقد ہی نہیں ہوتا۔",
                "ولی کی موجودگی عورت کی عزت اور سماجی تحفظ کی علامت ہے۔",
                "شریعت نے خاندان کے بڑوں کو اس عمل میں شامل کر کے نظم و ضبط قائم کیا ہے۔"
              ],
              "english": [
                "According to the majority of jurists, a marriage is invalid without a Wali.",
                "The presence of a guardian symbolizes the honor and social protection of the woman.",
                "Sharia involves family elders in this process to maintain social order and discipline."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی ہم آہنگی",
              "english": "Family Harmony"
            },
            "content": {
              "urdu": [
                "ولی کی شمولیت سے دو خاندانوں کے درمیان مضبوط بنیادوں پر تعلق قائم ہوتا ہے۔",
                "یہ عمل جذباتی فیصلوں کے بجائے دانشمندانہ انتخاب میں مددگار ثابت ہوتا ہے۔",
                "سرپرست کی رضا مندی سے مستقبل میں پیدا ہونے والے تنازعات کا حل آسان ہوتا ہے۔"
              ],
              "english": [
                "The involvement of a Wali builds a strong foundation between two families.",
                "This process aids in making a wise choice rather than an emotional or impulsive decision.",
                "The guardian's consent makes it easier to resolve any future disputes that may arise."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کا تحفظ",
        "english": "Protection of Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استحصال سے بچاؤ",
              "english": "Prevention of Exploitation"
            },
            "content": {
              "urdu": [
                "ولی کی شرط عورت کو دھوکہ دہی اور سماجی استحصال سے محفوظ رکھتی ہے۔",
                "سرپرست مرد کی چھان بین کر کے اپنی ذمہ داری پوری کرتا ہے۔",
                "اسلام نے عورت کو اکیلا نہیں چھوڑا بلکہ اسے خاندانی ڈھال فراہم کی ہے۔"
              ],
              "english": [
                "The requirement of a Wali protects women from deception and social exploitation.",
                "The guardian fulfills his duty by investigating the character of the suitor.",
                "Islam does not leave a woman alone; it provides her with a familial shield."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور وقار",
              "english": "Modesty and Dignity"
            },
            "content": {
              "urdu": [
                "عورت کا خود اپنا نکاح کرنا حیا اور وقار کے منافی سمجھا جاتا ہے۔",
                "ولی کے ذریعے رشتہ طے ہونا ایک معزز اور شرعی طریقہ ہے۔",
                "یہ عمل معاشرے میں پاکیزہ روایات کو پروان چڑھاتا ہے۔"
              ],
              "english": [
                "A woman conducting her own marriage is seen as contrary to modesty and dignity.",
                "Arranging a marriage through a guardian is an honorable and Islamic method.",
                "This practice nurtures pure and righteous traditions within the society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی پہلو",
        "english": "Juristic and Legal Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولی کون ہو سکتا ہے؟",
              "english": "Who Can Be a Wali?"
            },
            "content": {
              "urdu": [
                "عام طور پر باپ، دادا یا قریبی عصبہ مرد رشتہ دار ولی ہوتے ہیں۔",
                "اگر کوئی شرعی ولی موجود نہ ہو تو قاضی یا اسلامی حکمران ولی بنتا ہے۔",
                "ولی کے لیے عاقل، بالغ اور مسلمان ہونا ضروری شرائط ہیں۔"
              ],
              "english": [
                "Generally, the father, grandfather, or close male agnate relatives are guardians.",
                "If no biological or legal guardian is available, the judge (Qadi) acts as the Wali.",
                "Essential conditions for a Wali include being sane, adult, and Muslim."
              ]
            }
          },
          {
            "title": {
              "urdu": "ولی کا جبر",
              "english": "Coercion by Guardian"
            },
            "content": {
              "urdu": [
                "ولی کو اختیار حاصل ہے مگر وہ عورت کو زبردستی نکاح پر مجبور نہیں کر سکتا۔",
                "اسلام میں عورت کی رضامندی اور ولی کی موجودگی دونوں کا حسین امتزاج ہے۔",
                "اگر ولی ناجائز رکاوٹ ڈالے تو شریعت متبادل حل فراہم کرتی ہے۔"
              ],
              "english": [
                "The guardian has authority but cannot force a woman into marriage against her will.",
                "Islam balances the woman's consent with the guardian's essential presence.",
                "If a guardian places unjust obstacles, Sharia provides alternative legal solutions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظمِ اجتماع",
              "english": "Social Order"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ ذاتی فیصلے خاندان کی مشاورت سے ہونے چاہئیں۔",
                "خاندانی نظام کا احترام ہی اسلامی معاشرے کی بقا ہے۔",
                "نکاح کو خفیہ رکھنے کے بجائے اعلانیہ اور قانونی طریقے سے کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith teaches that personal decisions should involve family consultation.",
                "Respect for the family system is key to the survival of an Islamic society.",
                "Marriage should be conducted publicly and legally rather than kept secret."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "کامیابی صرف رسول اللہ ﷺ کے بتائے ہوئے طریقوں پر عمل کرنے میں ہے۔",
                "جدید نظریات کے نام پر شرعی حدود کو پامال کرنا گمراہی ہے۔",
                "ہمیں اپنے نکاح کے معاملات کو سنت کے مطابق ڈھالنا چاہیے۔"
              ],
              "english": [
                "Success lies only in following the methods prescribed by the Prophet (ﷺ).",
                "Violating Sharia limits in the name of modern ideologies is misguidance.",
                "We must mold our marriage affairs according to the established Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}