{
  "hadithId": 840,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/17"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5112)، ومسلم (1415)، وأخرجه النسائي (3271)، وأبو داود (2064)، وابن ماجه (1881).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (5112) اور امام مسلم (1415) نے روایت کیا ہے۔ اس میں شغار کی ممانعت صریح طور پر موجود ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5112) and Muslim (1415). The prohibition of Shighar is explicitly mentioned across authentic collections including An-Nasa'i and Abu Dawud."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade / Prohibited",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "الشِّغَارِ",
      "english": "Shighar (Exchange marriage)",
      "urdu": "شغار (وٹہ سٹہ)"
    },
    {
      "arabic": "يُزَوِّجَ",
      "english": "Gives in marriage",
      "urdu": "نکاح کر دے / بیاہ دے"
    },
    {
      "arabic": "صَدَاقٌ",
      "english": "Dower / Mahr",
      "urdu": "مہر"
    },
    {
      "arabic": "تَفْسِيرَ",
      "english": "Explanation / Definition",
      "urdu": "تشریح / تعریف"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'شغار' (وٹہ سٹہ) کی ممانعت بیان کی گئی ہے، جہاں دو افراد ایک دوسرے سے اپنی بیٹیاں یا بہنیں اس شرط پر بیاہتے ہیں کہ مہر ادا نہ کرنا پڑے، جو کہ شرعاً حرام ہے۔",
    "english": "This Hadith prohibits 'Shighar' marriage, where two parties exchange daughters or sisters in marriage to avoid paying the mandatory dower (Mahr), making it an invalid and forbidden practice."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب النكاح، رقم الحديث ٥١١٢",
      "english": "Sahih Bukhari, Book of Marriage, Hadith No. 5112"
    },
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤١٥",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1415"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=p7lAatYm3oE",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح شغار کی حقیقت",
        "english": "The Reality of Shighar Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شغار کی تعریف",
              "english": "Definition of Shighar"
            },
            "content": {
              "urdu": [
                "شغار کا مطلب یہ ہے کہ ایک نکاح کو دوسرے نکاح کے لیے مہر یا شرط بنا دیا جائے۔",
                "اس میں عموماً ایک مرد اپنی بیٹی یا بہن کا نکاح دوسرے مرد سے اس کے بدلے میں کرتا ہے کہ وہ بھی اپنی بیٹی یا بہن اسے دے دے۔",
                "اس عمل میں لڑکیوں کے مہر کا ذکر نہیں ہوتا بلکہ ایک عورت کو دوسری کے بدلے میں دیا جاتا ہے۔"
              ],
              "english": [
                "Shighar refers to making one marriage contract the dower or condition for another.",
                "It typically involves a man marrying his daughter or sister to someone on the condition that the other does the same.",
                "In this practice, the mandatory Mahr is ignored, and one woman is effectively swapped for another."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی وجوہات",
              "english": "Reasons for Prohibition"
            },
            "content": {
              "urdu": [
                "اسلام نے مہر کو عورت کا بنیادی حق قرار دیا ہے اور شغار میں یہ حق غصب کیا جاتا ہے۔",
                "یہ طریقہ جاہلیت کی ایک رسم تھی جس میں عورت کو ایک مال کی طرح بدلے میں استعمال کیا جاتا تھا۔",
                "ایسے نکاح میں عورت کی مرضی اور اس کے مالی حقوق کو مکمل طور پر نظر انداز کر دیا جاتا ہے۔"
              ],
              "english": [
                "Islam establishes Mahr as a fundamental right of the woman, which is denied in Shighar.",
                "This was a pre-Islamic custom where women were treated as tradeable commodities.",
                "Such marriages completely ignore the woman's consent and her financial entitlements."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عورت کے حقوق کا تحفظ",
        "english": "Protection of Women's Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہر کی فرضیت",
              "english": "Obligation of Mahr"
            },
            "content": {
              "urdu": [
                "ہر نکاح میں مہر کی ادائیگی لازمی ہے جو صرف اور صرف عورت کی ملکیت ہوتا ہے۔",
                "شغار میں ولی (سرپرست) مہر کے بجائے دوسرے نکاح سے فائدہ اٹھاتا ہے جو کہ ظلم ہے۔",
                "اسلام نے عورت کو معاشی تحفظ فراہم کیا ہے جسے وٹہ سٹہ ختم کر دیتا ہے۔"
              ],
              "english": [
                "The payment of Mahr is mandatory in every marriage and belongs solely to the woman.",
                "In Shighar, the guardian benefits from the exchange instead of the woman receiving her dower.",
                "Islam provides economic security to women, which this exchange system effectively destroys."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی وقار کی بحالی",
              "english": "Restoration of Human Dignity"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے اس رسم کو ختم کر کے عورت کے انسانی وقار کو بلند فرمایا۔",
                "عورت کوئی جنس یا سامان نہیں جسے ایک دوسرے کے بدلے میں ادل بدل کیا جائے۔",
                "یہ حکم معاشرے میں عورت کی انفرادی حیثیت اور اس کی آزادی کو تسلیم کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) abolished this custom to elevate the human dignity of women.",
                "A woman is not a commodity to be swapped or exchanged like goods between men.",
                "This ruling recognizes the individual status and legal independence of women in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات اور پیچیدگیاں",
        "english": "Social Impacts and Complications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھریلو جھگڑوں کا سبب",
              "english": "Cause of Domestic Disputes"
            },
            "content": {
              "urdu": [
                "وٹہ سٹہ کے نکاح میں اگر ایک گھر میں جھگڑا ہو تو اس کا اثر لازماً دوسرے گھر پر پڑتا ہے۔",
                "اگر ایک شوہر اپنی بیوی کو طلاق دے تو بدلے میں دوسرا بھی طلاق دینے پر مجبور ہو جاتا ہے۔",
                "یہ سسٹم خاندانی نظام کو انتقام اور بدلے کی بھینٹ چڑھا دیتا ہے۔"
              ],
              "english": [
                "In exchange marriages, a conflict in one household inevitably impacts the other.",
                "If one husband divorces his wife, the other often feels compelled to do the same in retaliation.",
                "This system subjects the family structure to cycles of revenge and collective punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناانصافی کا خاتمہ",
              "english": "Ending Injustice"
            },
            "content": {
              "urdu": [
                "اسلامی شریعت کا مقصد معاشرے سے ہر قسم کے استحصال اور ناانصافی کو مٹانا ہے۔",
                "شغار کی ممانعت سے ان لڑکیوں کو تحفظ ملا جنہیں زبردستی اس شرط پر بیاہا جاتا تھا۔",
                "یہ حکم اس بات کی ضمانت ہے کہ نکاح محض ایک معاہدہ نہیں بلکہ ایک مقدس فریضہ ہے۔"
              ],
              "english": [
                "Islamic Shariah aims to eradicate all forms of exploitation and injustice from society.",
                "Prohibiting Shighar protected girls who were forced into marriage under exchange conditions.",
                "This ruling guarantees that marriage is seen as a sacred duty, not just a business deal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور جدید اطلاق",
        "english": "Juristic Aspects and Modern Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وٹہ سٹہ اور مہرِ مثل",
              "english": "Exchange and Proper Dower"
            },
            "content": {
              "urdu": [
                "اگر نکاح میں مہر مقرر نہ ہو تو فقہاء کے نزدیک 'مہرِ مثل' (خاندان کے برابر مہر) واجب ہوتا ہے۔",
                "جدید دور میں بھی ایسے نکاح جن میں عورت کا حق مارا جائے، شرعاً ناپسندیدہ ہیں۔",
                "نکاح کو کسی بھی قسم کی شرط سے پاک ہونا چاہیے جو فریقین کے حقوق پر اثر انداز ہو۔"
              ],
              "english": [
                "If Mahr is not specified, jurists dictate that 'Mahr al-Mithl' (equivalent dower) becomes due.",
                "Modern marriages that deprive women of their rights remain religiously condemned.",
                "A marriage contract must be free from any conditions that negatively affect the rights of either party."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشگوار معاشرے کی بنیاد",
              "english": "Foundation of a Happy Society"
            },
            "content": {
              "urdu": [
                "ایک مستحکم معاشرے کے لیے ضروری ہے کہ نکاح کی بنیاد الفت اور رضامندی پر ہو۔",
                "اسلامی تعلیمات پر عمل پیرا ہو کر ہی ہم خاندانی سکون حاصل کر سکتے ہیں۔",
                "وٹہ سٹہ جیسی فرسودہ رسومات کا خاتمہ اسلامی اقدار کی بقا کے لیے ناگزیر ہے۔"
              ],
              "english": [
                "For a stable society, marriage must be founded on mutual affection and consent.",
                "Adhering to Islamic teachings is the only way to achieve true domestic peace.",
                "Abolishing outdated customs like 'Watta Satta' is essential for preserving Islamic values."
              ]
            }
          }
        ]
      }
    }
  ]
}