{
  "hadithId": 792,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/792"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (1/295)، وابن حبان (5102)، والترمذي (3945) بنحوه. وفي رواية لأحمد زيادة تدل على أن الرجل كان أعرابياً.",
    "urdu": "صحیح۔ اسے امام احمد (295/1) اور ابن حبان (5102) نے روایت کیا ہے۔ امام ترمذی نے بھی اس کے ہم معنی روایت نقل کی ہے۔ بعض روایات میں اس بات کی وضاحت ہے کہ یہ شخص دیہاتی (اعرابی) تھا۔",
    "english": "Sahih. Reported by Ahmad (1/295) and Ibn Hibban (5102). At-Tirmidhi (3945) reported a similar version. Some narrations clarify that the man was a Bedouin."
  },
  "importantWords": [
    {
      "arabic": "نَاقَةً",
      "english": "She-camel",
      "urdu": "اونٹنی"
    },
    {
      "arabic": "فَأَثَابَهُ",
      "english": "Rewarded him",
      "urdu": "اسے بدلہ دیا"
    },
    {
      "arabic": "رَضِيتَ",
      "english": "Are you satisfied / pleased",
      "urdu": "تو راضی ہو گیا"
    },
    {
      "arabic": "فَزَادَهُ",
      "english": "So he increased for him",
      "urdu": "پس اسے مزید دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ تحفے کے بدلے بدلہ دینا سنت ہے اور تبادلے میں فریقین کی رضامندی اور خوشنودی کا خیال رکھنا نبی کریم ﷺ کا اعلیٰ اخلاق تھا۔",
    "english": "This Hadith demonstrates that reciprocating a gift is a Sunnah and highlights the Prophet's (ﷺ) noble character in ensuring the satisfaction of the giver during an exchange."
  },
  "references": [
    {
      "arabic": "رواه أحمد (2104)",
      "english": "Reported by Ahmad (2104)"
    },
    {
      "arabic": "صحيح ابن حبان (5102)",
      "english": "Sahih Ibn Hibban (5102)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہدیہ کا بدلہ اور رضامندی",
        "english": "Reciprocation and Satisfaction"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ مکافات",
              "english": "The Sunnah of Reciprocation"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا یہ طریقہ تھا کہ جب کوئی آپ کو ہدیہ دیتا تو آپ اسے بدلہ ضرور دیتے۔",
                "یہ عمل 'ہبہ بشرط العوض' (اس شرط پر تحفہ کہ بدلہ ملے گا) کے جواز کی بھی دلیل ہے۔",
                "بدلہ دینے سے باہمی تعلقات میں توازن برقرار رہتا ہے اور دینے والا بوجھ محسوس نہیں کرتا۔"
              ],
              "english": [
                "It was the Prophet's (ﷺ) habit to always give something in return for a gift.",
                "This action serves as evidence for the permissibility of 'Hiba bi-shart al-iwad' (gift with a condition of compensation).",
                "Reciprocating maintains balance in relationships and prevents the giver from feeling a burden."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینے والے کی خوشنودی",
              "english": "Giver's Contentment"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے بار بار پوچھ کر یہ یقینی بنایا کہ ہدیہ دینے والا مکمل طور پر مطمئن ہے۔",
                "یہ آپ ﷺ کی کمالِ سخاوت اور عالی ظرفی کا ثبوت ہے کہ ایک عام اعرابی کی خواہش کو بھی پورا فرمایا۔",
                "اسلامی معاشرت میں دوسروں کے جذبات اور توقعات کا احترام کرنا لازمی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) repeatedly asked to ensure the giver was completely satisfied.",
                "This demonstrates his immense generosity and magnanimity in fulfilling even a Bedouin's expectations.",
                "In Islamic social conduct, respecting the feelings and expectations of others is essential."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اعرابیوں کی طبیعت اور نبوی حکمت",
        "english": "Nature of Bedouins and Prophetic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدویانہ مزاج پر صبر",
              "english": "Patience with Bedouin Temperament"
            },
            "content": {
              "urdu": [
                "دیہاتی لوگ اکثر گفتگو میں سخت اور مطالبے میں حریص ہوتے تھے، جیسا کہ اس حدیث میں نظر آتا ہے۔",
                "آپ ﷺ نے اس شخص کی بار بار کی 'نا' پر غصہ نہیں کیا بلکہ نرمی اور فیاضی دکھائی۔",
                "یہ داعیِ اسلام کے لیے سبق ہے کہ اسے لوگوں کی تلخیوں پر صبر اور سخاوت سے کام لینا چاہیے۔"
              ],
              "english": [
                "Bedouins were often blunt in speech and eager for gain, as seen in this narration.",
                "The Prophet (ﷺ) did not get angry at the man's repeated 'No' but showed kindness and bounty.",
                "This is a lesson for dawah workers to respond to people's bitterness with patience and generosity."
              ]
            }
          },
          {
            "title": {
              "urdu": "تالیفِ قلب کا پہلو",
              "english": "Aspect of Winning Hearts"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا مقصد صرف اونٹنی لینا نہیں تھا بلکہ اس شخص کے دل میں اسلام کی محبت بٹھانا تھا۔",
                "مال خرچ کر کے لوگوں کے دل جیتنا نبوی سیاست اور حکمتِ عملی کا حصہ تھا۔",
                "خوش خلقی کے ذریعے لوگوں کو حق کی طرف راغب کرنا سب سے مؤثر طریقہ ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) goal wasn't just acquiring the camel, but instilling love for Islam in the man's heart.",
                "Winning hearts through spending wealth was a part of Prophetic strategy and wisdom.",
                "Attracting people to the truth through good character is the most effective method."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور ابحاث",
        "english": "Juristic Aspects and Analysis"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہبہ بشرط العوض کا حکم",
              "english": "Ruling on Gift for Compensation"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص اس نیت سے تحفہ دے کہ اسے بدلہ ملے گا، تو اسے 'ہبہ ثواب' کہا جاتا ہے۔",
                "امام مالک کے نزدیک اگر ہدیہ دینے والا غریب ہو اور لینے والا امیر، تو بدلہ دینا اخلاقاً لازم ہے۔",
                "جب تک بدلہ دے کر فریقین راضی نہ ہو جائیں، یہ معاملہ مکمل خوشی کا باعث نہیں بنتا۔"
              ],
              "english": [
                "If someone gives a gift expecting a return, it is known as 'Hiba Thawab'.",
                "According to Imam Malik, if a poor person gifts a wealthy person, reciprocating is morally mandatory.",
                "The transaction doesn't result in full joy until both parties are satisfied through compensation."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہدیہ قبول کرنے کی شرائط",
              "english": "Conditions of Accepting Gifts"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس کے بعد ارادہ فرمایا کہ صرف قریشی، انصاری یا ثقفی سے ہدیہ لیں گے کیونکہ وہ بااخلاق تھے۔",
                "اس سے معلوم ہوتا ہے کہ ایسے لوگوں کا ہدیہ لینے سے بچنا چاہیے جو بعد میں احسان جتائیں یا نخرے دکھائیں۔",
                "وقار کی حفاظت کے لیے بعض اوقات ہدیہ رد کرنا بھی حکمت کے مطابق ہو سکتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) later intended to accept gifts only from those known for good character (Quraysh, Ansar, etc.).",
                "This suggests avoiding gifts from people who might later remind of favors or show arrogance.",
                "Sometimes, rejecting a gift to preserve one's dignity is consistent with wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احسان کا بدلہ بہتر طریقے سے",
              "english": "Repaying Kindness Better"
            },
            "content": {
              "urdu": [
                "مومن کا شیوہ ہے کہ جب کوئی اس کے ساتھ نیکی کرے، تو وہ اسے بڑھ کر بدلہ دے۔",
                "صرف تحفہ لینا ہی کافی نہیں، بلکہ دینے والے کی عزتِ نفس اور خوشی کا بھی خیال رکھیں۔",
                "باہمی تعلقات میں کنجوسی کے بجائے فیاضی برتنے سے برکت آتی ہے۔"
              ],
              "english": [
                "It is the hallmark of a believer to repay a good deed with something even better.",
                "Accepting a gift is not enough; one must also care for the giver's dignity and happiness.",
                "Generosity instead of stinginess in mutual relationships invites blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعامل میں بردباری",
              "english": "Tolerance in Interactions"
            },
            "content": {
              "urdu": [
                "لوگوں کے مختلف مزاج اور تقاضوں کو برداشت کرنا سنتِ نبوی ہے۔",
                "اگر کوئی اپنے حق کے لیے زیادہ مطالبہ کرے، تو ممکنہ حد تک اسے راضی کرنے کی کوشش کریں۔",
                "جھگڑے کو ختم کرنے کے لیے تھوڑا مال خرچ کرنا بڑی اخلاقی فتح ہے۔"
              ],
              "english": [
                "Tolerating different temperaments and demands of people is a Prophetic Sunnah.",
                "If someone demands more for their right, strive to satisfy them as much as possible.",
                "Spending a little wealth to end a dispute is a great moral victory."
              ]
            }
          }
        ]
      }
    }
  ]
}