{
  "hadithId": 1135,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["/muslim/21/13"],
    "kitabId": 12,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصيد والذبائح وما يؤكل من الحيوان",
    "babId": 92
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم في كتاب الصيد والذبائح، باب تحريم أكل كل ذي ناب من السباع وكل ذي مخلب من الطير (1933) و (1934).",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح میں کتاب الصید (حدیث: 1933، 1934) میں روایت کیا ہے۔ یہ روایت قطعی طور پر مستند ہے۔",
    "english": "Sahih. Recorded by Muslim in the Book of Hunting and Slaughtering, Chapter: Prohibiting the eating of every fanged beast of prey and every bird with a talon (1933 & 1934)."
  },
  "importantWords": [
    {
      "arabic": "ذِي نَابٍ",
      "english": "Fanged / Having canines",
      "urdu": "کچلی والا / دانت والا"
    },
    {
      "arabic": "اَلسِّبَاعِ",
      "english": "Beasts of prey",
      "urdu": "درندے"
    },
    {
      "arabic": "حَرَامٌ",
      "english": "Prohibited / Forbidden",
      "urdu": "حرام / ممنوع"
    },
    {
      "arabic": "مِخْلَبٍ",
      "english": "Talon / Claw",
      "urdu": "پنجہ"
    },
    {
      "arabic": "اَلطَّيْرِ",
      "english": "Birds",
      "urdu": "پرندے"
    },
    {
      "arabic": "نَهَى",
      "english": "He forbade",
      "urdu": "منع فرمایا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان جانوروں اور پرندوں کی حرمت بیان کی گئی ہے جو شکار کرنے کے لیے دانتوں (کچلیوں) یا پنجوں کا استعمال کرتے ہیں۔",
    "english": "This Hadith establishes the prohibition of eating land animals that hunt with fangs and birds that hunt with talons."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1933)",
      "english": "Sahih Muslim (1933)"
    },
    {
      "arabic": "صحيح مسلم (1934)",
      "english": "Sahih Muslim (1934)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R2rXGvR_2E8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "درندوں کی حرمت",
        "english": "Prohibition of Beasts of Prey"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کچلی والے جانور",
              "english": "Fanged Animals"
            },
            "content": {
              "urdu": [
                "شریعت میں ہر وہ درندہ حرام ہے جو اپنے دانتوں سے شکار کرتا ہے۔",
                "اس میں شیر، چیتا، بھیڑیا اور کتا وغیرہ شامل ہیں۔",
                "یہ حکم انسانی فطرت اور طیبات کے حصول کے لیے دیا گیا ہے۔"
              ],
              "english": [
                "In Shariah, every predator that hunts with fangs is forbidden for consumption.",
                "This category includes lions, tigers, wolves, dogs, and similar animals.",
                "This ruling aligns with human nature and the pursuit of wholesome food."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرمت کی وجہ",
              "english": "Reason for Prohibition"
            },
            "content": {
              "urdu": [
                "درندوں کا مزاج جارحانہ ہوتا ہے جو انسانی اخلاق پر اثر انداز ہو سکتا ہے۔",
                "اسلام صرف پاکیزہ اور غیر نقصان دہ اشیاء کھانے کی اجازت دیتا ہے۔",
                "ایسے جانوروں کا گوشت انسانی صحت اور روحانیت کے لیے مضر ہے۔"
              ],
              "english": [
                "Predatory animals have aggressive natures that can affect human character.",
                "Islam only permits the consumption of pure and non-harmful substances.",
                "The meat of such animals is considered detrimental to health and spirituality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شکاری پرندوں کا حکم",
        "english": "Ruling on Birds of Prey"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پنجوں والے پرندے",
              "english": "Birds with Talons"
            },
            "content": {
              "urdu": [
                "وہ پرندے جو اپنے پنجوں سے شکار پکڑتے ہیں وہ کھانا حرام ہیں۔",
                "مثال کے طور پر عقاب، باز، اور شکرا وغیرہ اس زمرے میں آتے ہیں۔",
                "یہ اضافہ ابن عباس رضی اللہ عنہ کی روایت سے ثابت ہے۔"
              ],
              "english": [
                "Birds that use their talons to seize and kill prey are prohibited.",
                "Examples include eagles, hawks, falcons, and vultures.",
                "This specific addition is confirmed in the narration of Ibn Abbas."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستثنیٰ پرندے",
              "english": "Exceptions for Birds"
            },
            "content": {
              "urdu": [
                "صرف وہ پرندے حلال ہیں جو دانہ چگتے ہیں یا پنجوں سے شکار نہیں کرتے۔",
                "کبوتر، مرغی اور چڑیا وغیرہ حلال پرندوں کی مثالیں ہیں۔",
                "شکاری مزاج رکھنے والے پرندوں سے بچنا واجب ہے۔"
              ],
              "english": [
                "Only birds that eat grains or do not hunt with claws are permissible.",
                "Pigeons, chickens, and sparrows are examples of lawful birds.",
                "It is obligatory to avoid birds that possess a predatory nature."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و طبی حکمت",
        "english": "Juristic and Medical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوراک کا اثر",
              "english": "Impact of Diet"
            },
            "content": {
              "urdu": [
                "اسلامی تعلیمات کے مطابق غذا انسانی سوچ اور عمل پر اثر ڈالتی ہے۔",
                "حرام گوشت کھانے سے انسان میں درندگی اور سختی پیدا ہو سکتی ہے۔",
                "طیب غذا ہی صالح اعمال کی بنیاد فراہم کرتی ہے۔"
              ],
              "english": [
                "Islamic teachings emphasize that diet influences human thought and action.",
                "Consuming forbidden meat can lead to aggression and hardness of heart.",
                "Pure food provides the foundation for righteous deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی نقصانات",
              "english": "Medical Disadvantages"
            },
            "content": {
              "urdu": [
                "اکثر شکاری جانوروں کے گوشت میں جراثیم اور زہریلے اثرات پائے جاتے ہیں۔",
                "ان کا گوشت ہضم کرنا انسانی نظامِ ہضم کے لیے مشکل ہوتا ہے۔",
                "جدید تحقیق بھی بعض درندوں کے گوشت کے مضر اثرات کی تائید کرتی ہے۔"
              ],
              "english": [
                "Many predatory animals carry germs and toxic elements in their flesh.",
                "Their meat is often difficult for the human digestive system to process.",
                "Modern research supports the harmful effects of eating certain predators."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ و عمل",
        "english": "Summary and Action"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال و حرام کی تمیز",
              "english": "Distinguishing Halal and Haram"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کو اپنی خوراک کے معاملے میں انتہائی محتاط رہنا چاہیے۔",
                "کسی بھی مشکوک جانور کے بارے میں علماء سے رجوع کرنا ضروری ہے۔",
                "حدیث کے یہ واضح اصول حلال و حرام کی پہچان آسان بناتے ہیں۔"
              ],
              "english": [
                "A Muslim must be extremely cautious regarding their dietary intake.",
                "It is necessary to consult scholars about any doubtful animal.",
                "These clear Hadith principles make identifying Halal and Haram easy."
              ]
            }
          },
          {
            "title": {
              "urdu": "اطاعتِ رسول",
              "english": "Obedience to the Messenger"
            },
            "content": {
              "urdu": [
                "رسول اللہ صلی اللہ علیہ وسلم کی ہر ممانعت پر عمل کرنا ایمان کا حصہ ہے۔",
                "قرآن و حدیث کے احکامات ہی زندگی میں کامیابی کا راستہ ہیں۔",
                "حرام سے بچنا دعا کی قبولیت کے لیے بنیادی شرط ہے۔"
              ],
              "english": [
                "Following every prohibition of the Prophet (ﷺ) is a part of faith.",
                "The commands of Quran and Hadith are the path to success in life.",
                "Avoiding Haram is a fundamental condition for the acceptance of prayers."
              ]
            }
          }
        ]
      }
    }
  ]
}