{
  "hadithId": 667,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh:667"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3504)، والنسائي (7/288)، والترمذي (1234) وصححه، وابن ماجه (2188)، وأحمد (2/174)، والحاكم (2/17).",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے ائمہ خمسہ (ابو داؤد، نسائی، ترمذی، ابن ماجہ، احمد) نے روایت کیا ہے۔ امام ترمذی، ابن خزیمہ اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan (Good). Reported by the five (Abu Dawud, An-Nasa'i, At-Tirmidhi, Ibn Majah, and Ahmad). Authenticated by At-Tirmidhi, Ibn Khuzaimah, and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "سَلَفٌ",
      "english": "Loan / Advance",
      "urdu": "قرض / پیشگی رقم"
    },
    {
      "arabic": "شَرْطَانِ",
      "english": "Two conditions",
      "urdu": "دو شرطیں"
    },
    {
      "arabic": "لَمْ يُضْمَنْ",
      "english": "Not guaranteed",
      "urdu": "جس کی ذمہ داری نہ لی گئی ہو"
    },
    {
      "arabic": "لَيْسَ عِنْدَكَ",
      "english": "Not in your possession",
      "urdu": "جو تمہارے پاس موجود نہ ہو"
    },
    {
      "arabic": "لَا يَحِلُّ",
      "english": "Not lawful",
      "urdu": "حلال نہیں ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تجارت کے چار بنیادی ممنوعہ پہلو بیان کیے گئے ہیں: قرض کے ساتھ بیع، ایک سودے میں دو شرطیں، بغیر قبضہ نفع کمانا، اور غیر موجود شے کی فروخت۔",
    "english": "This Hadith outlines four prohibited aspects of trade: combining a loan with a sale, two conditions in one deal, profiting without taking risk/possession, and selling what one does not own."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1234)",
      "english": "Reported by At-Tirmidhi (1234)"
    },
    {
      "arabic": "رواه أبو داود (3504)",
      "english": "Reported by Abu Dawud (3504)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعیب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "حسن صحيح",
    "english": "Hasan Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرض اور بیع کا ملاپ",
        "english": "Combining Loan and Sale"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سود کا شبہ",
              "english": "Suspicion of Usury"
            },
            "content": {
              "urdu": [
                "قرض کے ساتھ بیع کو اس لیے منع کیا گیا ہے تاکہ کوئی قرض کی آڑ میں فائدہ نہ اٹھائے۔",
                "قرض دینے والا اس شرط پر قرض دے کہ تم مجھ سے فلاں چیز بھی خریدو گے، تو یہ سود کے زمرے میں آتا ہے۔",
                "ہر وہ قرض جو نفع کھینچ کر لائے، وہ شرعاً ناجائز اور سود کہلاتا ہے۔"
              ],
              "english": [
                "Combining a loan with a sale is forbidden to prevent taking undue advantage through the loan.",
                "If a lender stipulates that the borrower must buy something from them, it falls under usury.",
                "Every loan that draws a benefit for the lender is legally prohibited and termed Riba."
              ]
            }
          },
          {
            "title": {
              "urdu": "تجارت کی شفافیت",
              "english": "Transparency in Trade"
            },
            "content": {
              "urdu": [
                "تجارت اور ہمدردی (قرض) کو الگ الگ رہنا چاہیے تاکہ معاشی عدل قائم رہے۔",
                "قرض خالص اللہ کی رضا کے لیے ہونا چاہیے، اسے تجارتی فائدے کا ذریعہ بنانا اخلاقی زوال ہے۔",
                "یہ حکم مارکیٹ میں استحصال کو روکتا ہے اور خریدار کے حقوق کا تحفظ کرتا ہے۔"
              ],
              "english": [
                "Trade and acts of kindness (loans) must remain separate to maintain economic justice.",
                "Loans should be purely for Allah's sake; using them for commercial gain is moral decline.",
                "This ruling prevents market exploitation and protects the rights of the buyer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دو شرطیں اور ضمانت کا نفع",
        "english": "Two Conditions and Profit without Risk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک بیع میں دو شرطیں",
              "english": "Two Conditions in One Sale"
            },
            "content": {
              "urdu": [
                "اس سے مراد وہ سودا ہے جس میں قیمت غیر واضح ہو، جیسے نقد پر ایک اور ادھار پر دوسری قیمت۔",
                "اگر مجلس ختم ہونے تک ایک قیمت طے نہ ہو تو یہ جہالت (Uncertainty) کی وجہ سے باطل ہے۔",
                "سودے کے وقت قیمت اور شرائط کا بالکل واضح ہونا تنازعات سے بچنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "This refers to deals with ambiguous pricing, like one price for cash and another for credit.",
                "If a single price isn't finalized before the meeting ends, the deal is void due to uncertainty.",
                "Absolute clarity in price and terms at the time of the deal is essential to avoid disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفع اور ضمانت کا تعلق",
              "english": "Link Between Profit and Risk"
            },
            "content": {
              "urdu": [
                "آپ اس چیز پر نفع نہیں کما سکتے جس کے نقصان کی ذمہ داری (Risk) آپ کی نہ ہو۔",
                "اگر چیز ابھی پہلے مالک کے قبضے میں ہے اور وہیں تباہ ہو جائے تو نفع دوسرے کو نہیں مل سکتا۔",
                "اسلامی معاشیات کا اصول ہے کہ 'نفع نقصان کی ذمہ داری کے ساتھ ہے'۔"
              ],
              "english": [
                "One cannot earn profit on an item for which they do not bear the risk of loss.",
                "If the item is still with the first owner and gets destroyed, the second cannot claim profit.",
                "The core principle of Islamic economics is 'Profit is tied to the responsibility of loss'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غیر موجود چیز کی فروخت",
        "english": "Selling What You Do Not Possess"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر یقینی سودا (غرر)",
              "english": "Uncertain Transactions (Gharar)"
            },
            "content": {
              "urdu": [
                "جو چیز آپ کی ملکیت میں نہیں، اسے بیچنا دھوکہ دہی اور جھگڑے کا باعث بن سکتا ہے۔",
                "اس میں یہ خطرہ ہوتا ہے کہ شاید بیچنے والا وہ چیز حاصل ہی نہ کر سکے جو اس نے بیچ دی ہے۔",
                "ایسی تجارت بازار میں مصنوعی قلت اور سٹہ بازی (Speculation) کو جنم دیتی ہے۔"
              ],
              "english": [
                "Selling something not in your possession can lead to fraud and bitter disagreements.",
                "There is a risk that the seller might fail to acquire the item they have already sold.",
                "Such trade creates artificial shortages and gives rise to gambling-like speculation."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیعِ سلم کا استثناء",
              "english": "Exception of Salam Sale"
            },
            "content": {
              "urdu": [
                "بیعِ سلم (پیشگی ادائیگی) اس قاعدے سے مستثنیٰ ہے کیونکہ اس کی شرائط واضح ہوتی ہیں۔",
                "موجود نہ ہونے سے مراد وہ معین چیز ہے جس کی فراہمی یقینی نہ ہو (جیسے بھاگا ہوا غلام)۔",
                "عام تجارتی سامان کی صفات طے کر کے بیچنا 'بیعِ سلم' کے طور پر جائز ہے۔"
              ],
              "english": [
                "Salam sale (advance payment) is an exception because its terms are clearly defined.",
                "'Not possessing' refers to specific items whose delivery is uncertain (like a runaway slave).",
                "Selling generic goods by specifying attributes (Salam) is permissible and helpful."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جدید کاروباری مسائل",
              "english": "Modern Business Issues"
            },
            "content": {
              "urdu": [
                "ڈراپ شپنگ (Dropshipping) کے بعض طریقے اس حدیث کی بنا پر ممانعت کے قریب ہو سکتے ہیں۔",
                "بغیر قبضہ اور ملکیت کے صرف کمیشن کے لیے اشیاء بیچنے میں شرعی حدود کا لحاظ رکھنا ضروری ہے۔",
                "ڈیجیٹل تجارت میں بھی 'قبضہ' اور 'ملکیت' کے تصور کو سمجھنا لازمی ہے۔"
              ],
              "english": [
                "Some methods of Dropshipping may border on prohibition based on this Hadith.",
                "Selling goods for commission without ownership or possession requires careful Sharia compliance.",
                "Understanding the concepts of 'possession' and 'ownership' is vital even in digital trade."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزقِ حلال کی برکت",
              "english": "Blessing of Halal Income"
            },
            "content": {
              "urdu": [
                "ان تمام پابندیوں کا مقصد مسلمان کے رزق کو مشتبہ اور حرام مال سے پاک کرنا ہے۔",
                "جب تجارت شفاف ہوگی تو معاشرے میں برکت اور باہمی اعتماد بڑھے گا۔",
                "تاجر کو چاہیے کہ وہ صرف وہی منافع لے جس کے بدلے اس نے محنت یا رسک لیا ہو۔"
              ],
              "english": [
                "The purpose of these restrictions is to purify a Muslim's income from doubtful sources.",
                "When trade is transparent, blessings and mutual trust increase within the society.",
                "A merchant should only take profit in exchange for the labor or risk they have assumed."
              ]
            }
          }
        ]
      }
    }
  ]
}