{
  "hadithId": 915,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1051"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
  
  "takhreej": {
    "arabic": "ضعيف . رواه أبو داود ( 2177 و 2178 ) ، وابن ماجه ( 2018 ) ، والحاكم ( 2 / 169 ) موصولا ومرسلا . وأعله الدارقطني والخطابي وأبو حاتم بالإرسال، والمرسل هو المحفوظ.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے ابوداؤد (2177) اور ابن ماجہ (2018) نے روایت کیا ہے۔ اگرچہ حاکم نے اسے صحیح کہا، مگر امام ابوحاتم، دارقطنی اور خطابی جیسے ماہرینِ جرح و تعدیل نے اسے مرسل قرار دیا ہے جو کہ ضعیف کی ایک قسم ہے۔ تاہم اس کا مفہوم شریعت کے مزاج کے عین مطابق ہے۔",
    "english": "Weak (Da'if). Reported by Abu Dawud (2177) and Ibn Majah (2018). Although Al-Hakim graded it Sahih, master critics like Abu Hatim and Al-Daraqutni preferred the Mursal version. However, its meaning is supported by the general spirit of Shariah regarding family stability."
  },
  "importantWords": [
    {
      "arabic": "أَبْغَضُ",
      "english": "Most hated / loathed",
      "urdu": "سب سے زیادہ ناپسندیدہ"
    },
    {
      "arabic": "اَلْحَلَالِ",
      "english": "Lawful things",
      "urdu": "حلال چیزیں"
    },
    {
      "arabic": "اَلطَّلَاقُ",
      "english": "Divorce",
      "urdu": "طلاق"
    },
    {
      "arabic": "عِنْدَ",
      "english": "In the sight of / with",
      "urdu": "کے نزدیک"
    },
    {
      "arabic": "إِرْسَالَهُ",
      "english": "Being Mursal",
      "urdu": "اس کا مرسل ہونا"
    }
  ],
  "summary": {
    "urdu": "طلاق اگرچہ ناگزیر حالات میں جائز ہے، لیکن اللہ تعالیٰ اسے سخت ناپسند فرماتا ہے کیونکہ یہ خاندانی نظام کی تباہی کا باعث بنتی ہے۔",
    "english": "Divorce, though permitted in unavoidable circumstances, is deeply disliked by Allah because it leads to the breakdown of the family structure."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2178)",
      "english": "Sunan Abu Dawud (2178)"
    },
    {
      "arabic": "سنن ابن ماجه (2018)",
      "english": "Sunan Ibn Majah (2018)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-k8D8GvG4k",
  "grade": {
    "arabic": "ضعيف (بمعنى صحيح)",
    "english": "Weak (but meaning is correct)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طلاق کی شرعی حیثیت",
        "english": "Legal Status of Divorce"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخری راستہ",
              "english": "The Last Resort"
            },
            "content": {
              "urdu": [
                "اسلام میں طلاق کو ایک ناپسندیدہ ضرورت کے طور پر رکھا گیا ہے تاکہ ظلم سے بچا جا سکے۔",
                "یہ کوئی ایسی چیز نہیں ہے جسے معمولی باتوں پر یا شوقیہ استعمال کیا جائے۔",
                "جب نباہ کی تمام صورتیں ختم ہو جائیں، تبھی اسے آخری حل کے طور پر اپنایا جانا چاہیے۔"
              ],
              "english": [
                "In Islam, divorce is treated as an undesirable necessity to avoid oppression.",
                "It is not something to be used for trivial matters or out of whim.",
                "It should only be adopted as a last resort when all reconciliation efforts fail."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناپسندیدگی کی وجہ",
              "english": "Reason for Dislike"
            },
            "content": {
              "urdu": [
                "طلاق سے ایک خوبصورت رشتہ ٹوٹ جاتا ہے اور معاشرے میں بگاڑ پیدا ہوتا ہے۔",
                "یہ عمل اللہ کے نزدیک اس لیے ناپسندیدہ ہے کہ اس سے شیطان خوش ہوتا ہے۔",
                "خاندان کی جڑیں کمزور ہونے سے پوری نسل کی تربیت پر منفی اثرات پڑتے ہیں۔"
              ],
              "english": [
                "Divorce breaks a beautiful bond and causes social disruption.",
                "It is hated by Allah because it brings immense joy to Shaitan.",
                "Weakening family roots negatively impacts the upbringing of future generations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاندانی نظام کا تحفظ",
        "english": "Preserving the Family System"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صبر اور برداشت",
              "english": "Patience and Forbearance"
            },
            "content": {
              "urdu": [
                "شریعت میاں بیوی کو ایک دوسرے کی کوتاہیوں پر صبر کرنے کی تلقین کرتی ہے۔",
                "قرآن کا حکم ہے کہ اگر تمہیں بیوی میں کچھ ناپسند ہو تو ممکن ہے اللہ اس میں خیر رکھ دے۔",
                "برداشت کا مادہ پیدا کرنے سے طلاق جیسی نوبت سے بچا جا سکتا ہے۔"
              ],
              "english": [
                "Shariah urges spouses to be patient with each other's shortcomings.",
                "The Quran states that if you dislike something in a wife, Allah may bring good through it.",
                "Cultivating forbearance can prevent the situation from reaching divorce."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کا مستقبل",
              "english": "The Future of Children"
            },
            "content": {
              "urdu": [
                "طلاق کا سب سے زیادہ نقصان معصوم بچوں کو ہوتا ہے جو ماں یا باپ سے محروم ہو جاتے ہیں۔",
                "بکھرے ہوئے خاندانوں کے بچے نفسیاتی مسائل اور عدم تحفظ کا شکار رہتے ہیں۔",
                "والدین کو اپنے فیصلے سے پہلے بچوں کے مستقبل کو سامنے رکھنا چاہیے۔"
              ],
              "english": [
                "Divorce causes the most harm to innocent children deprived of a parent's presence.",
                "Children from broken homes often suffer from psychological issues and insecurity.",
                "Parents must consider the long-term future of their children before making a decision."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصلاحِ معاشرہ",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوشگوار ازدواجی زندگی",
              "english": "A Happy Married Life"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ تم میں بہترین وہ ہے جو اپنے گھر والوں کے لیے بہتر ہے۔",
                "گھر کا سکون معاشرتی امن کی پہلی سیڑھی ہے جسے قائم رکھنا سب کی ذمہ داری ہے۔",
                "محبت اور احترام کی بنیاد پر قائم رشتے اللہ کی خاص رحمت کا باعث بنتے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) said the best among you is the one who is best to his family.",
                "Domestic peace is the first step toward social harmony; maintaining it is a collective duty.",
                "Relationships built on love and respect attract the special mercy of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "مصالحت کی کوشش",
              "english": "Efforts for Reconciliation"
            },
            "content": {
              "urdu": [
                "اختلاف کی صورت میں خاندان کے بزرگوں کو مداخلت کر کے صلح کروانی چاہیے۔",
                "اسلام طلاق سے پہلے 'حکم' (ثالث) مقرر کرنے کا مشورہ دیتا ہے تاکہ رشتہ بچ سکے۔",
                "صلح کروانا ایک عظیم نیکی ہے جس سے گھر اجڑنے سے بچ جاتے ہیں۔"
              ],
              "english": [
                "In case of disputes, family elders should intervene to facilitate reconciliation.",
                "Islam suggests appointing arbiters before divorce to save the relationship.",
                "Reconciling a couple is a great virtue that prevents the destruction of a home."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی علمی حکمت",
        "english": "Scholarly Wisdom of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال مگر ناپسندیدہ",
              "english": "Lawful but Disliked"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک اہم قاعدہ سکھاتی ہے کہ ہر حلال چیز اللہ کو محبوب نہیں ہوتی۔",
                "کچھ چیزیں صرف ضرورت کے وقت مباح کی جاتی ہیں لیکن ان کی حوصلہ شکنی کی جاتی ہے۔",
                "یہ تضاد ظاہر کرتا ہے کہ شریعت انسانی مجبوریوں کا کتنا لحاظ رکھتی ہے۔"
              ],
              "english": [
                "This Hadith teaches a key principle: not everything lawful is beloved to Allah.",
                "Some things are permitted only as a necessity but are generally discouraged.",
                "This paradox shows how much Shariah considers human constraints and difficulties."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال کا راستہ",
              "english": "The Middle Path"
            },
            "content": {
              "urdu": [
                "اسلام نہ تو عیسائیت کی طرح طلاق کو ناممکن بناتا ہے اور نہ ہی اسے کھلونا بناتا ہے۔",
                "اعتدال کا راستہ یہ ہے کہ اسے جائز رکھا جائے مگر اس کے استعمال میں سخت احتیاط کی جائے۔",
                "یہ توازن ہی اسلامی فقہ کی خوبصورتی اور اس کی عالمگیریت کی دلیل ہے۔"
              ],
              "english": [
                "Islam neither makes divorce impossible like Christianity nor does it treat it as a toy.",
                "The middle path is to keep it lawful but strictly cautious in its application.",
                "This balance is a testament to the beauty and universality of Islamic jurisprudence."
              ]
            }
          }
        ]
      }
    }
  ]
}