{
  "hadithId": 156,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["1:3:13"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  
  "takhreej": {
    "arabic": "منكر .‏ رواه الترمذي (1959)‏ ، وتمامه : \"والشارب من شربه ، والمعتصر إذا دخل لقضاء حاجته ، ولا تقوموا حتى تروني\" .‏ وقال الترمذي : \"حديث جابر هذا حديث لا نعرفه إلا من هذا الوجه ، من حديث عبد المنعم ، وهو إسناد مجهول ، وعبد المنعم : شيخ بصري\" .‏ قلت: عبد المنعم : هو ابن نعيم الأسواري ، وهو منكر الحديث كما قال البخاري وأبو حاتم .‏ ضعيف .‏ رواه الترمذي (200)‏ وضعفه بالانقطاع بين الزهري وبين أبي هريرة .‏ قلت : ورواه أيضا (201)‏ موقوفا على أبي هريرة ‏- ولا يصح أيضا ‏- بلفظ : \"لا ينادي بالصلاة إلا متوضئ \".‏  ضعيف .‏ رواه الترمذي (199)‏ وقال : \"حديث زياد إنما نعرفه من حديث الإفريقي ، والإفريقي ضعيف عند أهل الحديث\".‏ قلت: نعم هذا هو الصواب ، وإن خالف بعضهم في ذلك كالعلامة أحمد شاكر ‏-رحمه الله‏- الذي وثقه ، وصحح حديثه ، وكالحازمي الذي حسن حديثه.‏  ضعيف .‏ رواه أبو داود (512)‏.‏",
    "urdu": "منکر (Munkar)۔ اسے ترمذی (1959) نے روایت کیا ہے، اور اس کا مکمل متن ہے: ”اور پانی پینے والا اپنے پانی سے فارغ ہو جائے، اور جسے قضائے حاجت کی ضرورت ہو وہ فارغ ہو جائے، اور تم کھڑے نہ ہو جب تک مجھے نہ دیکھ لو۔“ ترمذی نے کہا: ”جابر کی یہ حدیث ہم صرف اسی طریق عبد المنعم سے جانتے ہیں، اور اس کی سند مجہول ہے، اور عبد المنعم بصرہ کا شیخ ہے۔“ میں (حافظ ابن حجر) کہتا ہوں: عبد المنعم ابن نعیم الاسواری ہے، اور وہ منکر الحدیث ہے جیسا کہ بخاری اور ابوحاطم نے کہا ہے۔ ضعیف۔ اسے ترمذی (200) نے روایت کیا اور زہری اور ابوہریرہ کے درمیان انقطاع کی وجہ سے اسے ضعیف قرار دیا۔ میں کہتا ہوں: اور انہوں نے اسے (201) میں موقوفاً (ابوہریرہ کا قول) بھی روایت کیا ہے اور وہ بھی صحیح نہیں ہے، جس کے الفاظ ہیں: ”صرف وضو والا ہی نماز کے لیے اذان دے۔“ ضعیف۔ اسے ترمذی (199) نے روایت کیا اور کہا: ”زیاد کی حدیث ہم صرف افریقی کی حدیث سے جانتے ہیں، اور افریقی اہل حدیث کے نزدیک ضعیف ہے۔“ میں کہتا ہوں: ہاں یہی صحیح ہے، اگرچہ بعض نے اختلاف کیا جیسے علامہ احمد شاکرؒ جنہوں نے اسے ثقہ قرار دیا اور ان کی حدیث کو صحیح کہا، اور حازمی جنہوں نے ان کی حدیث کو حسن کہا۔ ضعیف۔ اسے ابوداؤد (512) نے روایت کیا ہے۔",
    "english": "Rejected (Munkar). Reported by At-Tirmidhī (1959), and its full text is: '...and the drinker finishes his drink, and the one needing to relieve himself finishes his need, and do not stand until you see me.' At-Tirmidhī said: 'We only know this Hadith of Jābir from this path, from the Hadith of 'Abdul-Mun'im, whose chain is unknown, and 'Abdul-Mun'im is a Shaykh from Baṣrah.' I say: 'Abdul-Mun'im is Ibn Nu'aym Al-Aswārī, and he is Munkar Al-Ḥadīth (rejected in Hadith) as stated by Al-Bukhārī and Abū Ḥātim. Weak (Ḍa'īf). Reported by At-Tirmidhī (200), and he weakened it due to discontinuity between Az-Zuhrī and Abū Hurayrah. I say: He also reported it (201) as Mauqūf from Abū Hurayrah—and it is also not authentic—with the wording: 'None should call the Adhān for prayer except one who is in a state of Wuḍū'.' Weak (Ḍa'īf). Reported by At-Tirmidhī (199), and he said: 'The Hadith of Ziyād is only known from the Hadith of Al-Ifrīqī, and Al-Ifrīqī is weak according to the people of Hadith.' I say: Yes, this is correct, although some scholars disagreed, like Shaykh Aḥmad Shākir (RH), who authenticated him and his Hadith, and Al-Ḥāzimī, who graded his Hadith as Ḥasan. Weak (Ḍa'īf). Reported by Abū Dāwūd (512).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "فَتَرَسَّلْ",
      "english": "Do so slowly and deliberately",
      "urdu": "ٹھہر ٹھہر کر کہو"
    },
    {
      "arabic": "فَاحْدُرْ",
      "english": "Do so quickly/hastily",
      "urdu": "جلدی جلدی کہو"
    },
    {
      "arabic": "قَدْرَ مَا يَفْرُغُ اَلْآكِلُ",
      "english": "Long enough for the eater to finish",
      "urdu": "اتنا وقفہ کہ کھانے والا فارغ ہو جائے"
    },
    {
      "arabic": "لَا يُؤَذِّنُ إِلَّا مُتَوَضِّئٌ",
      "english": "None should call Adhān except with Wuḍū'",
      "urdu": "وضو کے بغیر کوئی اذان نہ کہے"
    },
    {
      "arabic": "وَمَنْ أَذَّنَ فَهُوَ يُقِيمُ",
      "english": "Whoever calls the Adhān, he calls the Iqāmah",
      "urdu": "جو اذان کہے وہی اقامت کہے"
    },
    {
      "arabic": "فَأَقِمْ أَنْتَ",
      "english": "Then you call the Iqāmah",
      "urdu": "تم اقامت کہا کرو"
    },
    {
      "arabic": "وَضَعَّفَهُ",
      "english": "And he graded it as weak",
      "urdu": "اور اسے ضعیف قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اذان اور اقامت کے مختلف آداب و احکام بیان کرتی ہے جن میں سے چار روایات سنداً ضعیف یا منکر ہیں۔ ان روایات میں یہ اصول شامل ہیں: اذان ٹھہر ٹھہر کر اور اقامت جلدی میں کہنا، دونوں کے درمیان کھانے والے کے فارغ ہونے جتنا وقفہ کرنا، بغیر وضو کے اذان نہ کہنا، اور جس نے اذان دی وہی اقامت کہے۔ اگرچہ یہ روایات ضعیف ہیں، لیکن ان کے بعض اصولوں پر فقہاء نے عمل کیا ہے (جیسے اذان میں ٹھہر ٹھہر کر کہنا)۔",
    "english": "This Hadith presents various manners and rulings regarding the Adhān and Iqāmah, four of which are graded as weak or rejected in chain. These narrations address: calling the Adhān slowly and the Iqāmah quickly, leaving a pause between them, the necessity of Wuḍū' for the Mu'adhdhin, and the person who calls the Adhān should call the Iqāmah. Despite the weakness of these chains, some of these principles are practiced by jurists (e.g., saying the Adhān slowly)."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1959) عن جابر",
      "english": "Reported by At-Tirmidhī (1959) from Jābir"
    },
    {
      "arabic": "رواه الترمذي (200) عن أبي هريرة",
      "english": "Reported by At-Tirmidhī (200) from Abū Hurayrah"
    },
    {
      "arabic": "رواه الترمذي (199) عن زياد بن الحارث",
      "english": "Reported by At-Tirmidhī (199) from Ziyād ibn Al-Ḥārith"
    },
    {
      "arabic": "رواه أبو داود (512) عن عبد الله بن زيد",
      "english": "Reported by Abu Dawud (512) from 'Abdullāh ibn Zayd"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jābir ibn 'Abdullāh"
      },
      "slug": "jabir-ibn-abdullah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abū Hurayrah"
      },
      "slug": "abu-hurayrah"
    },
    {
      "id": 3,
      "name": {
        "arabic": "زياد بن الحارث",
        "english": "Ziyād ibn Al-Ḥārith"
      },
      "slug": "ziyad-ibn-al-harith"
    },
    {
      "id": 4,
      "name": {
        "arabic": "عبد الله بن زيد بن عبد ربه",
        "english": "Abdullāh ibn Zayd ibn 'Abd Rabbih"
      },
      "slug": "abdullah-ibn-zayd-ibn-abd-rabbih"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "منكر وضعيف",
    "english": "Rejected/Weak (Munkar/Ḍa'īf)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اذان و اقامت کی رفتار اور وقفہ",
        "english": "Pace and Pause of Adhān and Iqāmah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان میں ترسل اور اقامت میں حدر",
              "english": "Tarassul in Adhān, Ḥadr in Iqāmah"
            },
            "content": {
              "urdu": [
                "اذان کو ٹھہر ٹھہر کر (ترسل) اور اقامت کو جلدی جلدی (حدر) کہنے کا حکم فقہی طور پر معمول ہے۔",
                "اذان کا مقصد لوگوں کو جمع کرنا ہے، اس لیے ٹھہر ٹھہر کر ہر کلمہ واضح کیا جاتا ہے۔",
                "اقامت کا مقصد نماز شروع ہونے کی اطلاع دینا ہے، اس لیے اسے جلدی کہنا مسنون ہے (اگرچہ یہ روایت ضعیف ہے)۔"
              ],
              "english": [
                "The ruling to say the Adhān slowly (Tarassul) and the Iqāmah quickly (Ḥadr) is customary in jurisprudence.",
                "The Adhān's purpose is to gather people, so each word is pronounced clearly and slowly.",
                "The Iqāmah's purpose is to signal the start of the prayer, so saying it quickly is recommended (even though this narration is weak)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان اور اقامت کے درمیان وقفہ",
              "english": "Pause Between Adhān and Iqāmah"
            },
            "content": {
              "urdu": [
                "اس ضعیف روایت میں اذان اور اقامت کے درمیان اتنا وقفہ رکھنے کا حکم ہے کہ لوگ ضروری کاموں سے فارغ ہو سکیں۔",
                "اگرچہ یہ الفاظ منکر ہیں، لیکن صحیح سنت سے معلوم ہوتا ہے کہ فجر اور عشاء کی اذان و اقامت میں وقفہ ہوتا تھا۔",
                "وقفے کا بنیادی مقصد لوگوں کو تیاری اور جماعت میں شامل ہونے کا موقع فراہم کرنا ہے۔"
              ],
              "english": [
                "This weak narration instructs a pause between the Adhān and Iqāmah sufficient for people to finish essential tasks.",
                "Although the specific wording is rejected, the authentic Sunnah indicates a pause between the Adhān and Iqāmah, especially for Fajr and 'Ishā'.",
                "The primary purpose of the pause is to allow people time to prepare and join the congregation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اذان کے لیے وضو اور مؤذن کی اقامت",
        "english": "Wuḍū' for Adhān and Iqāmah Caller"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضو کے بغیر اذان کا حکم",
              "english": "Ruling on Adhān Without Wuḍū'"
            },
            "content": {
              "urdu": [
                "«لَا يُؤَذِّنُ إِلَّا مُتَوَضِّئٌ» کی روایت ضعیف ہے، لہٰذا بغیر وضو کے اذان کہنا درست ہے۔",
                "جمہور فقہاء کے نزدیک اذان کے لیے وضو شرط نہیں، لیکن یہ مستحب (Recommended) ہے کیونکہ یہ ایک عظیم ذکر ہے۔",
                "بغیر وضو کے اذان کا اجر کم ہو سکتا ہے، لیکن وہ شرعاً صحیح ہو جاتی ہے۔"
              ],
              "english": [
                "The narration 'None should call the Adhān except with Wuḍū'' is weak, so calling the Adhān without Wuḍū' is valid.",
                "According to the majority of jurists, Wuḍū' is not a prerequisite for the Adhān, but it is recommended (Mustaḥabb) because it is a great remembrance of Allah.",
                "The Adhān may lose some reward without Wuḍū', but it is legally valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان دینے والے کا اقامت کہنا",
              "english": "The Adhān Caller Calling the Iqāmah"
            },
            "content": {
              "urdu": [
                "«وَمَنْ أَذَّنَ فَهُوَ يُقِيمُ» کی روایت بھی ضعیف ہے، لیکن یہ ایک فقہی اصول ہے جسے مستحب مانا جاتا ہے۔",
                "چونکہ اذان اور اقامت دونوں ایک نماز سے متعلق ہیں، لہٰذا ایک ہی شخص کا دونوں کو کہنا سنت سے قریب ہے۔",
                "فقہی طور پر، اگر اذان کوئی اور دے اور اقامت کوئی اور تو دونوں جائز ہیں، مگر پہلے مؤذن کا حق زیادہ ہے۔"
              ],
              "english": [
                "The narration 'Whoever calls the Adhān, he calls the Iqāmah' is weak, but the principle is generally considered recommended (Mustaḥabb).",
                "Since the Adhān and Iqāmah pertain to the same prayer, it is closer to the Sunnah for the same person to perform both.",
                "Juristically, it is permissible for one person to call the Adhān and another the Iqāmah, although the first Mu'adhdhin has a greater right."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی احتیاط اور درس",
        "english": "Training Caution and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعیف احادیث سے استدلال",
              "english": "Deriving Rulings from Weak Ahadith"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ تمام ظاہری احادیث پر عمل کرنے سے پہلے ان کی صحت کو جانچنا ضروری ہے۔",
                "علمائے حدیث کا کسی راوی (جیسے عبد المنعم) کو ضعیف قرار دینا، دین کی حفاظت کے لیے ایک اہم عمل ہے۔",
                "مسلمان کو چاہیے کہ وہ عبادات کے فضائل کے لیے بھی صرف صحیح روایات پر بھروسہ کرے۔"
              ],
              "english": [
                "This Hadith clarifies that testing the authenticity of Ahadith is crucial before acting upon their apparent rulings.",
                "The grading of a narrator (like 'Abdul-Mun'im) as weak by Hadith scholars is a vital act for safeguarding the religion.",
                "A Muslim should rely only on authentic narrations even for the virtues of deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی اور وقت",
              "english": "Ease and Timing"
            },
            "content": {
              "urdu": [
                "اگرچہ وقفے کی روایت ضعیف ہے، لیکن جماعت کے وقت کا خیال رکھنا (جیسے کھانا کھانے والے کا فارغ ہونا) ایک عمومی شرعی اصول ہے۔",
                "نبی ﷺ کے عمل سے یہ سبق ملتا ہے کہ عبادات میں جلدی اور سستی کے درمیان اعتدال اختیار کیا جائے۔",
                "نمازی کو چاہیے کہ وہ اذان کے بعد اقامت کے لیے مناسب وقت کا انتظار کرے۔"
              ],
              "english": [
                "Although the narration about the pause is weak, considering the time for the congregation (like the eater finishing) is a general Islamic principle of ease.",
                "The Prophet's (ﷺ) actions teach us moderation between rushing and delaying acts of worship.",
                "A worshipper should wait for a reasonable time for the Iqāmah after the Adhān."
              ]
            }
          }
        ]
      }
    }
  ]
}
