{
  "hadithId": 1205,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2641"],
    "kitabId": 14,
    "inKitabBab": 2,
    "arabicBook": "كتاب الشهادات",
    "babId": 98
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2641).",
    "urdu": "یہ ایک صحیح روایت ہے جسے امام بخاری نے اپنی صحیح (حدیث نمبر 2641) میں نقل کیا ہے۔",
    "english": "Sahih. Recorded by Al-Bukhari (2641) in the Book of Witnesses."
  },
  "importantWords": [
    {
      "arabic": "الْوَحْيِ",
      "english": "Revelation",
      "urdu": "وحی"
    },
    {
      "arabic": "انْقَطَعَ",
      "english": "Ceased/Disconnected",
      "urdu": "منقطع ہو گیا"
    },
    {
      "arabic": "ظَهَرَ",
      "english": "Manifested/Apparent",
      "urdu": "ظاہر ہوا"
    },
    {
      "arabic": "أَعْمَالِكُمْ",
      "english": "Your deeds",
      "urdu": "تمہارے اعمال"
    },
    {
      "arabic": "سَرِيرَتَهُ",
      "english": "Inner intention/Secret",
      "urdu": "اس کا باطن"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیان کیا گیا ہے کہ وحی کے انقطاع کے بعد، دنیاوی فیصلے صرف ظاہری حالات اور اعمال کی بنیاد پر ہوں گے، جبکہ نیتوں کا معاملہ اللہ کے سپرد ہے۔",
    "english": "This Hadith clarifies that after the end of divine revelation, human judgment is restricted to apparent actions, leaving hidden intentions to Allah alone."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2641)",
      "english": "Reported by Al-Bukhari (2641)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin Al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وحی اور انسانی عدالت",
        "english": "Revelation and Human Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عہدِ نبوی میں فیصلہ",
              "english": "Judgment in the Prophet's Era"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کے دور میں وحی کے ذریعے منافقین کے راز ظاہر کر دیے جاتے تھے۔",
                "اللہ تعالیٰ باطنی حقائق سے اپنے نبی ﷺ کو آگاہ فرما دیتا تھا۔",
                "اس دور میں وحی کی وجہ سے باطنی نیتوں پر بھی گرفت ممکن تھی۔"
              ],
              "english": [
                "In the Prophet's (ﷺ) era, revelation exposed the secrets of hypocrites.",
                "Allah would inform His Prophet (ﷺ) about the hidden internal truths.",
                "During that time, judgment based on internal intentions was possible through Wahy."
              ]
            }
          },
          {
            "title": {
              "urdu": "وحی کا انقطاع",
              "english": "The Ceasing of Revelation"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کی وفات کے بعد وحی کا سلسلہ ہمیشہ کے لیے ختم ہو گیا۔",
                "اب کوئی یہ دعویٰ نہیں کر سکتا کہ اسے کسی کی نیت کا الہامی علم ہے۔",
                "قانون صرف ان باتوں پر لاگو ہوگا جو ثبوت اور مشاہدے میں آئیں۔"
              ],
              "english": [
                "After the Prophet's (ﷺ) passing, revelation has ended forever.",
                "No one can now claim inspired knowledge of another's hidden intentions.",
                "Law shall only be applied to matters supported by evidence and observation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ظاہری اعمال کا اعتبار",
        "english": "Reliance on Apparent Actions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالتی معیار",
              "english": "Judicial Standard"
            },
            "content": {
              "urdu": [
                "حکمران اور قاضی صرف ظاہری گواہی اور ثبوت کے پابند ہیں۔",
                "اگر کوئی بظاہر نیک عمل کرے گا تو ہم اسے اچھا ہی سمجھیں گے۔",
                "ہم کسی کے دل چیر کر اس کی سچائی معلوم کرنے کے مکلف نہیں ہیں۔"
              ],
              "english": [
                "Rulers and judges are bound only by apparent testimony and evidence.",
                "If someone performs a good deed outwardly, we must regard them as good.",
                "We are not commanded to tear open hearts to find the hidden truth."
              ]
            }
          },
          {
            "title": {
              "urdu": "باطن کا معاملہ اللہ کے سپرد",
              "english": "Leaving Secrets to Allah"
            },
            "content": {
              "urdu": [
                "انسانوں کی نیتوں کا حساب قیامت کے دن صرف اللہ تعالیٰ لے گا۔",
                "اگر کوئی شخص منافق ہے مگر عمل درست ہے تو دنیا میں اسے سزا نہیں ملے گی۔",
                "انسانی عدالتیں باطنی معاملات میں دخل اندازی کا حق نہیں رکھتیں۔"
              ],
              "english": [
                "Only Allah will judge human intentions on the Day of Resurrection.",
                "If someone is a hypocrite but acts correctly, they are not punished here.",
                "Human courts do not have the right to interfere in internal matters."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی فقہ کا اصول",
        "english": "Principle of Islamic Jurisprudence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسنِ ظن کی اہمیت",
              "english": "Importance of Good Suspicion"
            },
            "content": {
              "urdu": [
                "جب تک برائی ثابت نہ ہو، مسلمان کے بارے میں اچھا گمان رکھنا چاہیے۔",
                "کسی کی نیت پر شک کرنا یا الزام لگانا شرعاً ممنوع ہے۔",
                "یہ اصول معاشرے میں امن اور باہمی اعتماد کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Until evil is proven, one must maintain a good opinion of a Muslim.",
                "Doubting or accusing someone's intentions is religiously prohibited.",
                "This principle promotes peace and mutual trust within society."
              ]
            }
          },
          {
            "title": {
              "urdu": "گواہی اور ثبوت",
              "english": "Testimony and Evidence"
            },
            "content": {
              "urdu": [
                "اسلامی قانون کی بنیاد ٹھوس گواہی اور واضح ثبوتوں پر ہے۔",
                "محض شک یا 'الہام' کی بنیاد پر کسی کو سزا نہیں دی جا سکتی۔",
                "یہ حضرت عمر فاروق رضی اللہ عنہ کی عظیم سیاسی و عدالتی بصیرت ہے۔"
              ],
              "english": [
                "Islamic law is founded upon solid testimony and clear evidence.",
                "No one can be punished based on mere suspicion or 'inspiration'.",
                "This reflects the grand political and judicial insight of Umar (RA)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انفرادی رویہ",
              "english": "Individual Conduct"
            },
            "content": {
              "urdu": [
                "ہمیں لوگوں کے عیب تلاش کرنے کے بجائے ان کے ظاہر پر فیصلہ کرنا چاہیے۔",
                "دوسروں کی نیتوں کا پوسٹ مارٹم کرنا ہمارا کام نہیں ہے۔",
                "اپنی نیت کی اصلاح کریں اور دوسروں کے لیے خیر خواہ بنیں۔"
              ],
              "english": [
                "We should judge by appearances rather than searching for faults.",
                "It is not our job to perform an autopsy on the intentions of others.",
                "Correct your own intentions and be a well-wisher for others."
              ]
            }
          },
          {
            "title": {
              "urdu": "مملکت کا انتظام",
              "english": "State Administration"
            },
            "content": {
              "urdu": [
                "حکمرانوں کو چاہیے کہ وہ رعایا کے ساتھ انصاف کا برتاؤ کریں۔",
                "قانون سب کے لیے برابر ہونا چاہیے چاہے وہ بظاہر کیسا ہی ہو۔",
                "عدل کا قیام ہی کسی بھی اسلامی ریاست کی اصل کامیابی ہے۔"
              ],
              "english": [
                "Rulers must treat their subjects with absolute fairness.",
                "The law must be equal for all, regardless of outward status.",
                "Establishing justice is the true success of any Islamic state."
              ]
            }
          }
        ]
      }
    }
  ]
}