{
  "hadithId": 668,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/21"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه مالك (2/609)، وأبو داود (3502)، وابن ماجه (2192). وسبب ضعفه الانقطاع في سند مالك، وجهالة الواسطة بينه وبين عمرو بن شعيب.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے امام مالک، ابوداؤد اور ابن ماجہ نے روایت کیا ہے۔ اس کے ضعف کی وجہ امام مالک اور عمرو بن شعیب کے درمیان سند کا منقطع ہونا اور درمیانی راوی کا نامعلوم ہونا ہے۔",
    "english": "Da'if (Weak). Reported by Malik (2/609), Abu Dawud (3502), and Ibn Majah (2192). The reason for its weakness is the interruption (Inqita') in the chain of narrators between Malik and 'Amr bin Shu'aib."
  },
  "importantWords": [
    {
      "arabic": "الْعُرْبَانِ",
      "english": "Earnest Money / Down payment",
      "urdu": "بیعانہ / بیع عربان"
    },
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "بَلَغَنِي",
      "english": "It reached me",
      "urdu": "مجھے یہ خبر پہنچی"
    },
    {
      "arabic": "بَيْعِ",
      "english": "Sale",
      "urdu": "تجارت"
    },
    {
      "arabic": "عَنْ",
      "english": "From",
      "urdu": "سے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیعانہ (Down payment) دے کر سودا کرنے اور سودا منسوخ ہونے کی صورت میں وہ رقم ضبط کرنے سے منع کیا گیا ہے۔",
    "english": "This Hadith prohibits the practice of paying earnest money and forfeiting it if the buyer decides not to complete the purchase."
  },
  "references": [
    {
      "arabic": "موطأ مالك، كتاب البيوع",
      "english": "Muwatta Malik, Book of Sales"
    },
    {
      "arabic": "سنن أبي داود، كتاب البيوع",
      "english": "Sunan Abi Dawud, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0S1_WvX-oI",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیع عربان کی حقیقت",
        "english": "The Reality of 'Arban Sale"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیع عربان کی تعریف",
              "english": "Definition of 'Arban"
            },
            "content": {
              "urdu": [
                "بیع عربان سے مراد وہ سودا ہے جس میں بیعانہ دیا جائے۔",
                "اگر خریدار چیز لے لے تو رقم قیمت کا حصہ بنتی ہے۔",
                "اگر خریدار سودا ختم کرے تو بیچنے والا رقم ضبط کر لے۔"
              ],
              "english": [
                "Arban refers to a sale involving a non-refundable down payment.",
                "If the buyer completes the deal, the money is part of the price.",
                "If the deal is cancelled, the seller keeps the earnest money."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی وجہ",
              "english": "Reason for Prohibition"
            },
            "content": {
              "urdu": [
                "اس میں دوسرے کا مال بغیر کسی عوض کے کھانا پایا جاتا ہے۔",
                "یہ بیع دھوکے اور غیر یقینی صورتحال (غرر) پر مبنی ہے۔",
                "اسلامی قانون میں کسی کا مال ناحق لینا صریحاً حرام ہے۔"
              ],
              "english": [
                "It involves consuming another's wealth without any compensation.",
                "This sale is based on uncertainty and risk (Gharar).",
                "In Islamic law, taking someone's property unjustly is strictly forbidden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب اور آراء",
        "english": "Juristic Opinions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور کا موقف",
              "english": "The Majority View"
            },
            "content": {
              "urdu": [
                "ائمہ ثلاثہ (مالک، شافعی، ابوحنیفہ) اسے ناجائز قرار دیتے ہیں۔",
                "ان کے نزدیک بیعانہ ضبط کرنا ظلم اور باطل تجارت ہے۔",
                "سودا منسوخ ہونے پر پوری رقم خریدار کو واپس کرنی چاہیے۔"
              ],
              "english": [
                "The three Imams (Malik, Shafi'i, Abu Hanifa) declare it invalid.",
                "They view forfeiting earnest money as oppression and void trade.",
                "Upon cancellation, the full amount must be returned to the buyer."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام احمد کا موقف",
              "english": "Imam Ahmad's Position"
            },
            "content": {
              "urdu": [
                "امام احمد بن حنبل اسے بعض شرائط کے ساتھ جائز مانتے ہیں۔",
                "وہ سیدنا عمر رضی اللہ عنہ کے ایک اثر سے استدلال کرتے ہیں۔",
                "اگر بیچنے والے کا نقصان ہو رہا ہو تو تلافی لی جا سکتی ہے۔"
              ],
              "english": [
                "Imam Ahmad allows it based on certain conditions and reports.",
                "He derives evidence from a practice attributed to 'Umar (RA).",
                "If the seller suffers actual loss, compensation may be taken."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید معاشی تناظر",
        "english": "Modern Economic Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایڈوانس بکنگ اور بیعانہ",
              "english": "Advance Booking"
            },
            "content": {
              "urdu": [
                "آج کل جائیداد اور گاڑیوں کی بکنگ میں یہ عام ہے۔",
                "اگر رقم قیمت میں کٹ جائے تو یہ شرعاً جائز ہے۔",
                "رقم کی ضبطی کے معاملے میں احتیاط اور شرعی حل ضروری ہے۔"
              ],
              "english": [
                "This is common today in real estate and vehicle bookings.",
                "If the amount is deducted from the final price, it is permissible.",
                "Caution and Sharia-compliant solutions are needed for forfeitures."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقصان کی تلافی",
              "english": "Compensating for Losses"
            },
            "content": {
              "urdu": [
                "جدید فقہاء کے نزدیک حقیقی نقصان کا حرجانہ لیا جا سکتا ہے۔",
                "بیچنے والا صرف اتنا حصہ رکھ سکتا ہے جتنا اس کا خرچ ہوا۔",
                "پورے بیعانے کو بطور سزا ضبط کرنا انصاف کے خلاف ہے۔"
              ],
              "english": [
                "Modern jurists allow charging for actual proven damages/costs.",
                "The seller may only keep what covers their specific expenses.",
                "Forfeiting the entire deposit as a penalty is against justice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانت اور ہمدردی",
              "english": "Integrity and Sympathy"
            },
            "content": {
              "urdu": [
                "تجارت میں محض نفع خوری کے بجائے مروت کا خیال رکھیں۔",
                "دوسرے کی مجبوری سے فائدہ اٹھانا اسلامی اخلاق کے منافی ہے۔",
                "معاہدہ ٹوٹنے کی صورت میں خریدار کے ساتھ نرمی کا معاملہ کریں۔"
              ],
              "english": [
                "Consider chivalry in trade instead of just profit-seeking.",
                "Taking advantage of others' constraints is against Islamic ethics.",
                "Deal gently with the buyer if the contract is terminated."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالِ حرام سے بچاؤ",
              "english": "Avoiding Haram Wealth"
            },
            "content": {
              "urdu": [
                "ناحق لی گئی معمولی رقم بھی برکت کو ختم کر دیتی ہے۔",
                "تاجروں کو اپنی کمائی کو مشکوک ذرائع سے پاک رکھنا چاہیے۔",
                "اللہ تعالیٰ صرف پاکیزہ اور حلال رزق کو پسند فرماتا ہے۔"
              ],
              "english": [
                "Even a small amount taken unjustly destroys blessings.",
                "Traders must purify their earnings from doubtful sources.",
                "Allah Almighty only loves pure and lawful provisions."
              ]
            }
          }
        ]
      }
    }
  ]
}