{
  "hadithId": 750,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [
      ""
    ],
    "kitabId": 7,
    "inKitabBab": 10,
    "arabicBook": "كتاب البيوع",
    "babId": 51
  },
  "name": {
    "arabic": "عَنْ أَبِي ذَرٍّ رَضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ لِي رَسُولُ اَللَّهِ صلى الله عليه وسلم: { قُلِ اَلْحَقَّ, وَلَوْ كَانَ مُرًّا } صَحَّحَهُ اِبْنُ حِبَّانَ فِي حَدِيثٍ طَوِيلٍ",
    "urdu": "سیدنا ابوذر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مجھ سے فرمایا: ”حق بات کہو، خواہ وہ (کتنی ہی) کڑوی کیوں نہ ہو۔“ اسے ابن حبان نے ایک طویل حدیث کے ضمن میں صحیح قرار دیا ہے۔",
    "english": "Narrated Abu Dharr (RA): Allah's Messenger (ﷺ) said to me: 'Speak the truth even if it is bitter.' [Graded Sahih by Ibn Hibban in a long Hadith]."
  },
  "takhreej": {
    "arabic": "صحيح. رواه ابن حبان (361) في وصية النبي صلى الله عليه وسلم لأبي ذر، وأحمد (5/159). وله شواهد تقويه، منها حديث عبادة بن الصامت في مبايعة النبي صلى الله عليه وسلم على أن نقول بالحق أينما كنا.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابن حبان (361) نے نبی ﷺ کی سیدنا ابوذر کو دی گئی وصیتوں میں روایت کیا ہے۔ امام احمد (5/159) نے بھی اسے نقل کیا ہے، اور عبادہ بن صامت کی روایت سے اس کے شواہد موجود ہیں۔",
    "english": "Sahih. Reported by Ibn Hibban (361) as part of the Prophet's (ﷺ) advice to Abu Dharr, and Ahmad (5/159). It has supporting evidences, including the Hadith of 'Ubadah bin as-Samit regarding the pledge to speak the truth everywhere."
  },
  "importantWords": [
    {
      "arabic": "قُلِ",
      "english": "Speak / Say",
      "urdu": "کہو / بیان کرو"
    },
    {
      "arabic": "الْحَقَّ",
      "english": "The Truth",
      "urdu": "حق بات یا سچی بات"
    },
    {
      "arabic": "مُرًّا",
      "english": "Bitter",
      "urdu": "کڑوا یا ناگوار"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں حق گوئی کی اہمیت بیان کی گئی ہے کہ ایک مومن کو نتائج کی پروا کیے بغیر ہمیشہ سچ بولنا چاہیے، چاہے وہ اسے یا دوسروں کو کتنا ہی ناگوار گزرے۔",
    "english": "This Hadith emphasizes the importance of truthfulness, instructing believers to speak the truth regardless of the consequences or how unpleasant it may feel."
  },
  "references": [
    {
      "arabic": "صحيح ابن حبان",
      "english": "Sahih Ibn Hibban"
    },
    {
      "arabic": "مسند أحمد",
      "english": "Musnad Ahmad"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو ذر الغفاري",
        "english": "Abu Dharr al-Ghifari"
      },
      "slug": "abu-dharr-al-ghifari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حق گوئی کی اہمیت",
        "english": "Importance of Speaking the Truth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچائی کا معیار",
              "english": "Standard of Truthfulness"
            },
            "content": {
              "urdu": [
                "حق بات کہنا ایمان کی علامت اور ایک عظیم اخلاقی قدر ہے۔",
                "سچ بولنے سے معاشرے میں اعتماد پیدا ہوتا ہے اور برائیوں کا جڑ سے خاتمہ ہوتا ہے۔",
                "اللہ تعالیٰ نے سچ بولنے والوں کو اجرِ عظیم کا وعدہ دیا ہے۔"
              ],
              "english": [
                "Speaking the truth is a hallmark of faith and a supreme moral value.",
                "Truthfulness builds trust in society and helps eradicate evils at their root.",
                "Allah has promised a great reward for those who remain truthful."
              ]
            }
          },
          {
            "title": {
              "urdu": "کڑوے حق کا مطلب",
              "english": "Meaning of 'Bitter Truth'"
            },
            "content": {
              "urdu": [
                "اس سے مراد وہ بات ہے جو سننے والے کو ناگوار گزرے یا جس سے اپنی مفاد پر زد پڑتی ہو۔",
                "بعض اوقات سچ بولنے سے عارضی نقصان کا اندیشہ ہوتا ہے، مگر انجام خیر ہی ہوتا ہے۔",
                "حق گوئی کا مطلب کسی کی توہین کرنا نہیں بلکہ دیانتداری سے حقیقت بیان کرنا ہے۔"
              ],
              "english": [
                "It refers to things that might be unpleasant to hear or might harm one's own self-interest.",
                "Sometimes speaking the truth carries a risk of temporary loss, but the ultimate outcome is always good.",
                "Speaking the truth does not mean insulting others, but rather stating the facts with integrity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاملات اور عدالت میں سچائی",
        "english": "Truth in Dealings and Courts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروباری معاملات",
              "english": "Business Transactions"
            },
            "content": {
              "urdu": [
                "خرید و فروخت میں مال کے عیوب کو واضح کرنا حق گوئی ہے۔",
                "جو تاجر سچ بولتا ہے اس کے رزق میں اللہ برکت عطا فرماتا ہے۔",
                "دھوکہ دہی اور سچ چھپانا برکت کو ختم کر دیتا ہے۔"
              ],
              "english": [
                "Disclosing defects in goods during trade is an act of speaking the truth.",
                "Allah grants blessings in the sustenance of a merchant who speaks the truth.",
                "Deception and hiding the truth remove divine blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "گواہی میں حق گوئی",
              "english": "Truthfulness in Testimony"
            },
            "content": {
              "urdu": [
                "عدالت میں حق کی گواہی دینا فرض ہے، چاہے وہ اپنے رشتہ داروں ہی کے خلاف کیوں نہ ہو۔",
                "جھوٹی گواہی دینا کبیرہ گناہ ہے اور معاشرے میں ظلم کا باعث بنتا ہے۔",
                "انصاف کی فراہمی حق گوئی کے بغیر ممکن نہیں۔"
              ],
              "english": [
                "Bearing truthful witness in court is obligatory, even if it is against one's own relatives.",
                "Giving false testimony is a major sin and leads to injustice in society.",
                "The provision of justice is impossible without truthfulness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی پہلو اور معاشرتی اصلاح",
        "english": "Moral Aspect and Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ خدا",
              "english": "Fear of Allah"
            },
            "content": {
              "urdu": [
                "حق بات کہنے کے لیے لوگوں کے خوف کے بجائے اللہ کا خوف دل میں ہونا ضروری ہے۔",
                "سب سے بڑا جہاد ظالم حکمران کے سامنے کلمہ حق کہنا ہے۔",
                "مومن حق کے معاملے میں کسی ملامت کرنے والے کی ملامت سے نہیں ڈرتا۔"
              ],
              "english": [
                "To speak the truth, one must fear Allah more than people.",
                "The greatest Jihad is to speak a word of truth before a tyrannical ruler.",
                "A believer does not fear the blame of critics when it comes to the truth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچی دوستی",
              "english": "True Friendship"
            },
            "content": {
              "urdu": [
                "سچا دوست وہی ہے جو آپ کی غلطی پر آپ کو پیار سے حق بات بتا دے۔",
                "خوشامد کے بجائے مخلصانہ مشورہ دینا سنتِ نبوی ہے۔",
                "حق گوئی سے تعلقات میں پائیداری اور خلوص پیدا ہوتا ہے۔"
              ],
              "english": [
                "A true friend is one who kindly points out the truth when you make a mistake.",
                "Giving sincere advice instead of flattery is a Sunnah of the Prophet (ﷺ).",
                "Speaking the truth fosters stability and sincerity in relationships."
              ]
            }
          }
        ]
      }
    }
  ]
}