{
  "hadithId": 1133,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/63"],
    "kitabId": 11,
    "inKitabBab": 3,
    "arabicBook": "كتاب الجهاد",
    "babId": 91
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه أحمد (2/505)، وأبو داود (2579)، وابن ماجه (2876). وضعفه الأئمة لأن في سنده سفيان بن حسين وهو ضعيف في الزهري. والراجح أنه من قول سعيد بن المسيب.",
    "urdu": "ضعیف۔ اسے امام احمد (2/505)، ابوداؤد (2579) اور ابن ماجہ (2876) نے روایت کیا ہے۔ اس کی سند ضعیف ہے کیونکہ سفیان بن حسین نامی راوی زہری سے روایت کرنے میں ضعیف ہے۔ امام ابوحاتم اور دیگر کے نزدیک یہ قول صحابی یا تابعی (سعيد بن المسيب) کا ہو سکتا ہے۔",
    "english": "Da'if (Weak). Reported by Ahmad (2/505), Abu Dawud (2579), and Ibn Majah (2876). The chain is weak because Sufyan bin Husain is weak when narrating from Az-Zuhri. Scholars like Abu Hatim state it is more likely a saying of Sa'id bin al-Musayyib."
  },
  "importantWords": [
    {
      "arabic": "أَدْخَلَ",
      "english": "Entered / Introduced",
      "urdu": "داخل کیا"
    },
    {
      "arabic": "لَا يَأْمَنُ",
      "english": "Is not certain / Not secure",
      "urdu": "اسے اطمینان یا یقین نہ ہو"
    },
    {
      "arabic": "يَسْبِقَ",
      "english": "Win the race / Outrun",
      "urdu": "آگے نکل جائے / جیت جائے"
    },
    {
      "arabic": "قِمَارٌ",
      "english": "Gambling",
      "urdu": "جوا"
    },
    {
      "arabic": "فَرَسَيْنِ",
      "english": "Two horses",
      "urdu": "دو گھوڑے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مقابلوں میں شرط لگانے کے جواز کے لیے 'محلل' (تیسرے فریق) کے داخل کرنے کی بحث کی گئی ہے تاکہ اسے جوئے کی تعریف سے نکالا جا سکے۔ اگر جیت یقینی ہو تو وہ ممنوع ہوگا۔",
    "english": "This Hadith discusses the concept of a 'Muhallil' (a third party) in races involving bets to avoid the technical definition of gambling, stating that if the outcome is predetermined or certain, it remains forbidden."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2579)",
      "english": "Narrated by Abu Dawud (2579)"
    },
    {
      "arabic": "رواه ابن ماجه (2876)",
      "english": "Narrated by Ibn Majah (2876)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مقابلوں میں شرط اور 'محلل' کا تصور",
        "english": "Betting and the Concept of 'Muhallil'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "'محلل' کی تعریف",
              "english": "Definition of Muhallil"
            },
            "content": {
              "urdu": [
                "اگر دو افراد مقابلے میں رقم لگائیں، تو یہ جوا ہے۔ لیکن اگر تیسرا بندہ (محلل) بغیر رقم لگائے شریک ہو، تو وہ اسے حلال کرنے والا بنتا ہے۔",
                "اگر محلل جیت جائے تو وہ دونوں کی رقم لے لیتا ہے، اور اگر ہار جائے تو اس پر کوئی جرمانہ نہیں ہوتا۔",
                "حدیث میں اس شرط کو ذکر کیا گیا ہے کہ محلل کا گھوڑا ہارنے یا جیتنے کے برابر امکان رکھتا ہو۔"
              ],
              "english": [
                "If two people bet money on a race, it is gambling; but if a third person (Muhallil) joins without betting, he 'legalizes' the competition.",
                "If the Muhallil wins, he takes the pot; if he loses, he pays nothing.",
                "The Hadith specifies that the Muhallil's horse must have a genuine chance of either winning or losing."
              ]
            }
          },
          {
            "title": {
              "urdu": "جوئے (قمار) کی ممانعت",
              "english": "The Prohibition of Gambling"
            },
            "content": {
              "urdu": [
                "اسلام ہر اس لین دین سے روکتا ہے جہاں مال کا حصول خالصتاً اتفاق یا قسمت پر مبنی ہو۔",
                "اگر مقابلے میں دونوں طرف سے رقم لگی ہو اور کوئی تیسرا فریق نہ ہو، تو تمام ائمہ کے نزدیک وہ صریح جوا ہے۔",
                "یہ حدیث اس جوئے سے بچنے کی ایک فنی صورت بیان کرتی ہے، اگرچہ اس کی سند پر کلام ہے۔"
              ],
              "english": [
                "Islam prohibits any transaction where the acquisition of wealth is based purely on chance or luck.",
                "If both sides put up stakes without a third neutral party, it is explicitly considered gambling by all Imams.",
                "This Hadith describes a technical way to avoid gambling, though its authenticity is debated."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات",
        "english": "Juristic Disagreements"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ائمہ کی آراء",
              "english": "Opinions of the Imams"
            },
            "content": {
              "urdu": [
                "امام شافعی، ابوحنیفہ اور احمد اس حدیث کی بنا پر 'محلل' کے ذریعے شرط کو جائز قرار دیتے ہیں۔",
                "امام مالک اور بعض دیگر فقہاء کے نزدیک محلل کے باوجود یہ صورت ناپسندیدہ یا ممنوع ہے۔",
                "موجودہ دور کے علماء کی اکثریت اسے حیلہ سازی قرار دیتی ہے اگر مقصد صرف سٹہ بازی ہو۔"
              ],
              "english": [
                "Imams Shafi'i, Abu Hanifa, and Ahmad permit betting through a 'Muhallil' based on this report.",
                "Imam Malik and others find this practice disliked or prohibited despite the presence of a third party.",
                "Most modern scholars view this as a legal loophole if the primary intent is just wagering."
              ]
            }
          },
          {
            "title": {
              "urdu": "جیت کے یقین کی شرط",
              "english": "The Condition of Certainty of Winning"
            },
            "content": {
              "urdu": [
                "حدیث میں کہا گیا ہے کہ اگر اسے یقین ہو کہ وہ جیت جائے گا تو یہ جوا ہے۔",
                "اس کا مطلب یہ ہے کہ مقابلہ 'اوپن' ہونا چاہیے، کوئی 'فکسنگ' یا پہلے سے طے شدہ نتیجہ نہیں ہونا چاہیے۔",
                "شفافیت اور غیر یقینی نتیجہ ہی کسی کھیل کو جوئے سے دور رکھتا ہے۔"
              ],
              "english": [
                "The Hadith states that if the person is certain they will win, it is gambling.",
                "This implies that the competition must be open, without any 'fixing' or predetermined outcome.",
                "Transparency and an uncertain outcome are what distinguish a sport from gambling."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عسکری کھیلوں کی حوصلہ افزائی",
        "english": "Encouraging Military Sports"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین چیزوں میں مسابقت",
              "english": "Competition in Three Things"
            },
            "content": {
              "urdu": [
                "اسلام میں صرف تین چیزوں پر انعام کا مقابلہ جائز ہے: اونٹ دوڑ، گھوڑ دوڑ اور تیر اندازی۔",
                "یہ تینوں چیزیں جہاد کی تیاری اور عسکری قوت بڑھانے میں معاون ہیں۔",
                "ان کے علاوہ دیگر عام کھیلوں میں مالی شرط لگانا جوئے کے زمرے میں آتا ہے۔"
              ],
              "english": [
                "In Islam, prizes are permitted only in three types of competitions: camel racing, horse racing, and archery.",
                "These three aid in military preparedness and strengthening the defense.",
                "Betting on other common games generally falls under the category of gambling."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقصدِ حلال",
              "english": "Halal Purpose"
            },
            "content": {
              "urdu": [
                "کھیل کا مقصد جسمانی چستی اور دین کا دفاع ہونا چاہیے۔",
                "انعام کا مقصد بہترین ہنر مندوں کی حوصلہ افزائی کرنا ہے۔",
                "اگر کھیل کا مقصد صرف پیسہ کمانا بن جائے، تو اس کی برکت ختم ہو جاتی ہے۔"
              ],
              "english": [
                "The goal of sports should be physical fitness and the defense of the faith.",
                "The purpose of the prize is to encourage the most skilled practitioners.",
                "If the sport's sole purpose becomes money-making, its spiritual blessing is lost."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی تحقیق کا سبق",
              "english": "Lesson in Chain Investigation"
            },
            "content": {
              "urdu": [
                "اس حدیث کا ضعیف ہونا ہمیں سکھاتا ہے کہ ہر سنی سنائی بات کو نبی ﷺ کی طرف منسوب نہیں کرنا چاہیے۔",
                "فقہی احکام میں مضبوط اور صحیح احادیث پر اعتماد کرنا چاہیے۔",
                "علماء کی تحقیق ہمیں غلط فہمیوں سے بچاتی ہے۔"
              ],
              "english": [
                "The weakness of this Hadith teaches us not to attribute every heard report to the Prophet (ﷺ) without verification.",
                "One should rely on strong and authentic Hadiths for legal rulings.",
                "Scholarly research protects us from misconceptions."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیلہ سازی سے بچنا",
              "english": "Avoiding Legal Stratagems"
            },
            "content": {
              "urdu": [
                "اسلامی احکام کی روح کو سمجھنا الفاظ کے ہیر پھیر سے زیادہ اہم ہے۔",
                "اگر 'محلل' صرف ایک رسمی کارروائی ہو، تو وہ دلوں کے حال جاننے والے اللہ کو دھوکہ نہیں دے سکتا۔",
                "سچائی اور دیانت داری ہی دین کا اصل جوہر ہے۔"
              ],
              "english": [
                "Understanding the spirit of Islamic rulings is more important than verbal manipulation.",
                "If a 'Muhallil' is just a formality, it cannot deceive Allah, who knows the hearts.",
                "Truth and integrity are the core essence of religion."
              ]
            }
          }
        ]
      }
    }
  ]
}