{
  "hadithId": 365,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/2/419"
    ],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (879) من حديث ابن عباس، ومسلم (878) من حديث النعمان بن بشير.",
    "urdu": "یہ دونوں روایات صحیح ہیں۔ پہلی روایت ابن عباس سے مسلم (879) میں اور دوسری روایت نعمان بن بشیر سے مسلم (878) میں مروی ہے۔",
    "english": "Sahih. Reported by Muslim (879) from Ibn 'Abbas and Muslim (878) from An-Nu'man bin Bashir."
  },
  "importantWords": [
    {
      "arabic": "يَقْرَأُ",
      "english": "Recites",
      "urdu": "تلاوت کرتے تھے"
    },
    {
      "arabic": "الْعِيدَيْنِ",
      "english": "Two 'Eids",
      "urdu": "عیدین (عید الفطر اور عید الاضحی)"
    },
    {
      "arabic": "الْمُنَافِقِينَ",
      "english": "The Hypocrites",
      "urdu": "منافقین"
    },
    {
      "arabic": "الْغَاشِيَةِ",
      "english": "The Overwhelming",
      "urdu": "غاشیہ (ڈھانپ لینے والی)"
    },
    {
      "arabic": "سَبِّحِ",
      "english": "Glorify",
      "urdu": "تسبیح بیان کریں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز جمعہ اور عیدین میں مسنون سورتوں کی تلاوت کا بیان ہے، جس میں سورہ جمعہ، منافقین، اعلیٰ اور غاشیہ شامل ہیں۔",
    "english": "This Hadith describes the Sunnah Surahs for recitation in Jumu'ah and 'Eid prayers, including Al-Jumu'ah, Al-Munafiqun, Al-A'la, and Al-Ghashiyah."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (879)",
      "english": "Sahih Muslim (879)"
    },
    {
      "arabic": "صحيح مسلم (878)",
      "english": "Sahih Muslim (878)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "النعمان بن بشير",
        "english": "An-Nu'man bin Bashir"
      },
      "slug": "an-numan-bin-bashir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S5O5n8Kts",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسنون تلاوت کی حکمت",
        "english": "Wisdom of Prescribed Recitation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سورہ جمعہ اور منافقین",
              "english": "Surah Al-Jumu'ah and Al-Munafiqun"
            },
            "content": {
              "urdu": [
                "ان سورتوں میں جمعہ کی اہمیت اور منافقین کے کردار کا تذکرہ ہے۔",
                "مسلمانوں کو نفاق سے بچنے اور ذکر اللہ کی طرف آنے کی ترغیب ملتی ہے۔",
                "یہ سورتیں معاشرتی اصلاح اور ایمانی پختگی کے لیے نہایت موزوں ہیں۔"
              ],
              "english": [
                "These Surahs mention the status of Jumu'ah and the traits of hypocrites.",
                "They encourage Muslims to avoid hypocrisy and turn towards Allah's remembrance.",
                "These chapters are highly suitable for social reform and strengthening faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "سورہ اعلیٰ اور غاشیہ",
              "english": "Surah Al-A'la and Al-Ghashiyah"
            },
            "content": {
              "urdu": [
                "ان سورتوں میں اللہ کی عظمت اور آخرت کے احوال بیان کیے گئے ہیں۔",
                "یہ انسان کو دنیا کی فانی زندگی اور ابدی کامیابی کی طرف متوجہ کرتی ہیں۔",
                "عید اور جمعہ جیسے بڑے اجتماعات میں یہ پیغامات بہت مؤثر ہوتے ہیں۔"
              ],
              "english": [
                "These Surahs describe the greatness of Allah and conditions of the Hereafter.",
                "They remind humans of the transient life and the path to eternal success.",
                "These messages are very effective during large gatherings like 'Eid and Jumu'ah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنتِ نبوی کی پیروی",
        "english": "Adherence to the Prophetic Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام کے لیے رہنمائی",
              "english": "Guidance for the Imam"
            },
            "content": {
              "urdu": [
                "امام کو چاہیے کہ وہ جمعہ کی نماز میں ان مسنون سورتوں کا اہتمام کرے۔",
                "سنت کے مطابق تلاوت کرنا نماز میں برکت اور ثواب میں اضافے کا باعث ہے۔",
                "یہ طریقہ کار اسلاف اور تابعین میں بھی رائج رہا ہے۔"
              ],
              "english": [
                "The Imam should prioritize these Sunnah Surahs during the Jumu'ah prayer.",
                "Reciting according to the Sunnah brings blessings and increases rewards.",
                "This practice was widely followed by the righteous predecessors and Tabi'un."
              ]
            }
          },
          {
            "title": {
              "urdu": "تنوع اور تبدیلی",
              "english": "Variety and Change"
            },
            "content": {
              "urdu": [
                "نبی کریم کبھی ایک ترتیب پڑھتے اور کبھی دوسری، تاکہ تنوع رہے۔",
                "اس سے ثابت ہوتا ہے کہ مختلف مسنون سورتیں بدل بدل کر پڑھی جا سکتی ہیں۔",
                "یہ عمل نماز میں جمود کو ختم کرتا اور قراءت میں لذت پیدا کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used different sets of Surahs to provide variety.",
                "This proves that various Sunnah Surahs can be recited interchangeably.",
                "This practice prevents monotony and adds spiritual sweetness to the recitation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عیدین اور جمعہ کا اشتراک",
        "english": "Commonalities of 'Eid and Jumu'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتماعیت کا مظاہرہ",
              "english": "Demonstration of Unity"
            },
            "content": {
              "urdu": [
                "عیدین اور جمعہ دونوں اسلام کے شعائر اور بڑے عوامی اجتماعات ہیں۔",
                "ان میں ایک جیسی سورتوں کی تلاوت ان کے باہمی تعلق کو ظاہر کرتی ہے۔",
                "یہ دن مسلمانوں کے مابین محبت اور بھائی چارے کے فروغ کا ذریعہ ہیں۔"
              ],
              "english": [
                "Both 'Eid and Jumu'ah are symbols of Islam and large public gatherings.",
                "Reciting the same Surahs in both indicates their spiritual connection.",
                "These days serve as a means to promote love and brotherhood among Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذکر اللہ کی اہمیت",
              "english": "Importance of Dhikr"
            },
            "content": {
              "urdu": [
                "بڑے اجتماعات کا اصل مقصد اللہ کی یاد اور اس کی بڑائی بیان کرنا ہے۔",
                "ان سورتوں کے مضامین تسبیح اور حمد و ثناء پر مشتمل ہیں۔",
                "یہ مومن کو اللہ کے سامنے عاجزی اور بندگی کا احساس دلاتے ہیں۔"
              ],
              "english": [
                "The primary goal of large assemblies is the remembrance and glorification of Allah.",
                "The themes of these Surahs revolve around praise and glorification.",
                "They instill a sense of humility and servitude before Allah in a believer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن سے تعلق",
              "english": "Connection with the Quran"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو ان مسنون سورتوں کا ترجمہ اور مفہوم سیکھنا چاہیے۔",
                "جب امام یہ سورتیں پڑھے تو مقتدی ان کے معنی پر غور کریں۔",
                "یہ عمل نماز میں توجہ اور خشوع پیدا کرنے میں مددگار ثابت ہوتا ہے۔"
              ],
              "english": [
                "Muslims should learn the translation and meaning of these Sunnah Surahs.",
                "When the Imam recites them, the followers should reflect on the meanings.",
                "This practice helps in developing focus and humility during the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی ترویج",
              "english": "Promotion of the Sunnah"
            },
            "content": {
              "urdu": [
                "اپنے گھروں اور مساجد میں سنتِ نبوی کو زندہ کرنا ہم سب کی ذمہ داری ہے۔",
                "نئی نسل کو ان مسنون طریقوں سے آگاہ کرنا وقت کی اہم ضرورت ہے۔",
                "سنت پر عمل کرنا ہی دین میں اعتدال اور سلامتی کا راستہ ہے۔"
              ],
              "english": [
                "Reviving the Prophetic Sunnah in homes and mosques is our collective duty.",
                "Informing the new generation about these Sunnah ways is a vital necessity.",
                "Practicing the Sunnah is the path to moderation and safety in religion."
              ]
            }
          }
        ]
      }
    }
  ]
}