{
  "hadithId": 143,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["1:2:15"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  
  "takhreej": {
    "arabic": "ضعيف.‏ رواه أحمد (6/315) وبعض طرقه قوية موقوفة. وعلة ضعف المرفوع أنه معارض للحديث الصحيح في النهي عن الصلاة بعد العصر.‏ وقد استثنى بعض العلماء هذه الحادثة للنبي صلى الله عليه وسلم فقط (خاصية).‏ ضعيف.‏ رواه أبو داود (1280) عن عائشة؛ أن رسول الله صلى الله عليه وسلم: كان يصلي بعد العصر وينهي عنها.‏ وقال: \"لا تتخذوا ذلك عادة\".‏ وهو ضعيف أيضا.‏",
    "urdu": "ضعیف۔ اسے احمد (6/315) نے روایت کیا ہے، اور اس کی بعض سندیں موقوفاً قوی ہیں۔ مرفوع (نبی ﷺ سے منسوب) ہونے کی حالت میں اس کے ضعف کی علت یہ ہے کہ یہ اس صحیح حدیث کے معارض ہے جو عصر کے بعد نماز کی ممانعت کرتی ہے۔ بعض علماء نے اس واقعے کو صرف نبی اکرم ﷺ کے لیے خاص قرار دیا ہے (خاصیہ)۔ ضعیف۔ اسے ابوداؤد (1280) نے عائشہؓ سے روایت کیا کہ رسول اللہ ﷺ عصر کے بعد نماز پڑھتے تھے اور اس سے منع بھی کرتے تھے۔ اور فرمایا: ”اسے عادت نہ بنا لو۔“ یہ بھی ضعیف ہے۔",
    "english": "Weak (Ḍa'īf). Reported by Ahmad (6/315), and some of its chains are strong as Mauqūf. The weakness of the Marfū' version is that it contradicts the authentic Hadith prohibiting prayer after 'Aṣr. Some scholars have considered this incident specific to the Prophet (ﷺ) only (Khāṣṣiyah). Weak (Ḍa'īf). Reported by Abu Dawud (1280) from 'Ā'ishah: that the Messenger of Allah (ﷺ) used to pray after 'Aṣr while prohibiting it, and he said: 'Do not take this as a habit.' This is also weak."
  },
  "importantWords": [
    {
      "arabic": "صَلَّى اَلْعَصْرَ",
      "english": "He prayed 'Aṣr",
      "urdu": "آپ نے عصر کی نماز پڑھی"
    },
    {
      "arabic": "دَخَلَ بَيْتِي",
      "english": "He entered my house",
      "urdu": "آپ میرے گھر میں داخل ہوئے"
    },
    {
      "arabic": "رَكْعَتَيْنِ",
      "english": "Two rak'ahs",
      "urdu": "دو رکعتیں"
    },
    {
      "arabic": "شُغِلْتُ",
      "english": "I was preoccupied",
      "urdu": "میں مشغول ہو گیا تھا"
    },
    {
      "arabic": "بَعْدَ اَلظُّهْرِ",
      "english": "After Zuhr",
      "urdu": "ظہر کی نماز کے بعد"
    },
    {
      "arabic": "أَفَنَقْضِيهِمَا",
      "english": "Should we make them up?",
      "urdu": "کیا ہم بھی ان کی قضاء کریں؟"
    },
    {
      "arabic": "خَاصِيَّة",
      "english": "Exclusivity/Special permission",
      "urdu": "خاص حکم"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث، جو سنداً ضعیف ہے، اس واقعے کو بیان کرتی ہے کہ نبی اکرم ﷺ نے نماز عصر کے بعد ظہر کی فوت شدہ سنتیں ادا فرمائیں۔ اس سے بظاہر عصر کے بعد نفل نماز کی ممانعت میں استثنا معلوم ہوتا ہے، لیکن چونکہ یہ روایت ضعیف ہے اور صحیح احادیث کے خلاف ہے، اس لیے فقہاء کی اکثریت نے اسے صرف نبی ﷺ کی خصوصیت (خاصیہ) قرار دیا ہے اور اس کی قضاء امت کے لیے جائز نہیں ہے۔",
    "english": "This Hadith, which is weak in chain, narrates the incident where the Prophet (ﷺ) performed two missed Sunnah rak'ahs of Zuhr after the 'Aṣr prayer. While it seemingly suggests an exception to the prohibition of post-'Aṣr prayer, the majority of jurists consider this action to be exclusive to the Prophet (Khāṣṣiyah) due to its conflict with authentic Ahadith that prohibit prayer after 'Aṣr. Therefore, making up such prayers is not permissible for the Ummah."
  },
  "references": [
    {
      "arabic": "أخرجه أحمد (6/315)",
      "english": "Reported by Ahmad (6/315)"
    },
    {
      "arabic": "رواه أبو داود (1280) عن عائشة",
      "english": "Reported by Abu Dawud (1280) from 'Ā'ishah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة",
        "english": "Umm Salamah"
      },
      "slug": "umm-salamah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Ḍa'īf)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ممنوع وقت اور اس واقعہ کا تضاد",
        "english": "Prohibited Time and Contradiction of this Incident"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحیح احادیث کی ترجیح",
              "english": "Precedence of Authentic Ahadith"
            },
            "content": {
              "urdu": [
                "صحیح احادیث میں واضح طور پر نماز عصر کے بعد غروب آفتاب تک نفل نماز کی ممانعت وارد ہے۔",
                "یہ واقعہ بظاہر اس عمومی حکم کے خلاف نظر آتا ہے، اس لیے علمائے کرام نے اس کی سند میں ضعف بیان کیا ہے۔",
                "قاعدہ ہے کہ جب صحیح حدیث کے مقابلے میں ضعیف حدیث آئے تو صحیح کو ترجیح دی جاتی ہے۔"
              ],
              "english": [
                "Authentic Ahadith clearly prohibit voluntary prayer after the 'Aṣr prayer until sunset.",
                "This incident appears to contradict that general ruling, which is why scholars have pointed out the weakness in its chain.",
                "The rule is that when a weak Hadith opposes an authentic one, the authentic Hadith is given precedence."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا خاص عمل (خاصیہ)",
              "english": "The Prophet's Special Action (Khāṣṣiyah)"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء نے اس واقعے کی وضاحت یہ کہہ کر کی ہے کہ یہ عمل صرف نبی اکرم ﷺ کے لیے خاص تھا۔",
                "رسول اللہ ﷺ کا یہ عمل امت کے لیے عادت بنانا ممنوع تھا، جیسا کہ ایک روایت میں آپ نے منع بھی فرمایا۔",
                "نبی ﷺ کے لیے قضا نمازوں کی ادائیگی میں تاخیر کی اجازت نہیں تھی، اس لیے آپ نے فوراً ادا فرمائیں۔"
              ],
              "english": [
                "The majority of jurists explained this incident by saying that this action was exclusive to the Prophet (ﷺ) alone.",
                "The Prophet's action was forbidden for the Ummah to make a habit of, as he himself forbade it in one narration.",
                "The Prophet (ﷺ) was not permitted to delay missed obligatory or highly emphasized Sunnah prayers, hence he performed them immediately."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنتوں کی قضا کا حکم",
        "english": "Ruling on Making Up Sunnah Prayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قضا کا حکم 'نہیں' کا مطلب",
              "english": "The Meaning of the 'No' Ruling on Qadā'"
            },
            "content": {
              "urdu": [
                "ام سلمہؓ کے سوال پر نبی ﷺ کا جواب 'نہیں' اس بات کی دلیل ہے کہ عام امت کے لیے عصر کے بعد سنتوں کی قضا جائز نہیں۔",
                "اگر یہ سنتیں قضا ہو جائیں تو ان کی قضا کا کوئی شرعی حکم یا فضیلت باقی نہیں رہتی ہے۔",
                "یہ حکم اس اصول کی تائید کرتا ہے کہ نوافل کو ان کے وقت میں ادا کرنا ہی باعثِ اجر ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) 'No' answer to Umm Salamah's question indicates that making up the Sunnah prayers after 'Aṣr is not permissible for the general Ummah.",
                "If these voluntary prayers are missed, there remains no legal ruling or virtue for making them up.",
                "This ruling supports the principle that voluntary prayers earn reward only when performed within their proper time."
              ]
            }
          },
          {
            "title": {
              "urdu": "صرف قضاء شدہ نمازوں پر دلیل",
              "english": "Evidence for Only Making Up Missed Prayers"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے عمل سے صرف اسی طرح کی قضا شدہ سنتوں (ظہر کی سنتوں) کو عصر کے بعد ادا کرنے کی دلیل لی جا سکتی ہے۔",
                "لیکن یہ دلیل ضعیف ہے، اس لیے اس کی بجائے قضا نمازوں کو طلوع و غروب کے ممنوع وقت کے علاوہ ادا کرنا افضل ہے۔",
                "بعض علماء نے عذر کی صورت میں ظہر کی سنتوں کی قضا عصر کے بعد جائز قرار دی ہے۔"
              ],
              "english": [
                "Only the making up of similar missed Sunnah prayers (like Zuhr's Sunnah) could possibly be argued for based on the Prophet's act after 'Aṣr.",
                "However, since the evidence is weak, it is better to make up missed prayers outside the prohibited times of sunrise and sunset.",
                "Some scholars permit making up the missed Sunnah of Zuhr after 'Aṣr only if there was a genuine excuse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز عصر کے بعد کا حکم",
        "english": "Ruling After the 'Aṣr Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نوافل سے اجتناب",
              "english": "Abstaining from Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "صحیح احادیث کے مطابق، نماز عصر کی ادائیگی کے فوراً بعد تمام نوافل سے اجتناب کرنا واجب ہے۔",
                "یہ ممانعت اس وقت تک قائم رہتی ہے جب تک سورج مکمل طور پر غروب نہ ہو جائے۔",
                "اس حکم کی حکمت یہ ہے کہ یہ وقت سورج پرستوں کے عبادت کا وقت ہے اور اسلام شرک کی مشابہت سے منع کرتا ہے۔"
              ],
              "english": [
                "According to authentic Ahadith, abstaining from all voluntary prayers immediately after performing the 'Aṣr prayer is obligatory.",
                "This prohibition remains in effect until the sun has completely set.",
                "The wisdom behind this rule is that this is the time of worship for sun-worshippers, and Islam forbids resemblance to polytheism."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتوں میں تفریق",
              "english": "Distinction in Sunnah Prayers"
            },
            "content": {
              "urdu": [
                "فرض نمازوں کی قضا ممنوع اوقات میں کی جا سکتی ہے (ایک رائے کے مطابق)، لیکن نوافل کی نہیں، ماسوائے مخصوص صورتوں کے۔",
                "اس واقعہ کو خاصیہ (نبی ﷺ کی خصوصیت) ماننا ہی صحیح احادیث کے ساتھ ہم آہنگی پیدا کرتا ہے۔",
                "عمومی طور پر، نماز عصر کے بعد نفل نماز، چاہے وہ سبب والی ہو، نہیں پڑھنی چاہیے۔"
              ],
              "english": [
                "Missed obligatory prayers may be made up during prohibited times (according to one view), but not voluntary prayers, except in specific cases.",
                "Accepting this incident as Khāṣṣiyah (Prophetic exclusivity) is the only way to reconcile it with the authentic Ahadith.",
                "Generally, no voluntary prayer, even if it has a reason, should be performed after the 'Aṣr prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
