{
  "hadithId": 757,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/7/65"
    ],
    "kitabId": 7,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام",
    "babId": 53
  },
  
  "takhreej": {
    "arabic": "صحيح بطرقه.‏ رواه أحمد (3/465)، وأبو داود (3403)، والترمذي (1366) وقال: حسن غريب. سأل الترمذي البخاري عنه فقال: هو حديث حسن. وإنما ضُعف من طريق واحدة لا في أصله.",
    "urdu": "یہ حدیث اپنی سندوں کے لحاظ سے صحیح ہے۔ اسے احمد، ابوداؤد اور ترمذی نے روایت کیا ہے۔ امام ترمذی نے اسے حسن کہا اور امام بخاری نے بھی ایک موقع پر اسے حسن قرار دیا اگرچہ اس کی ایک خاص سند پر کلام موجود ہے۔",
    "english": "Sahih by its supporting routes. Reported by Ahmad (3/465), Abu Dawud (3403), and At-Tirmidhi (1366). Although some questioned a specific chain, the overall status is Hasan/Sahih as confirmed by Tirmidhi and others."
  },
  "importantWords": [
    {
      "arabic": "زَرَعَ",
      "english": "Sowed / Farmed",
      "urdu": "کاشت کی / زراعت کی"
    },
    {
      "arabic": "بِغَيْرِ إِذْنِهِمْ",
      "english": "Without their permission",
      "urdu": "ان کی اجازت کے بغیر"
    },
    {
      "arabic": "الزَّرْعِ",
      "english": "The crop / produce",
      "urdu": "کاشت / فصل"
    },
    {
      "arabic": "نَفَقَتُهُ",
      "english": "His expenses / spending",
      "urdu": "اس کے اخراجات"
    },
    {
      "arabic": "قَوْمٍ",
      "english": "People / Group",
      "urdu": "قوم / لوگ"
    },
    {
      "arabic": "لَيْسَ لَهُ",
      "english": "He has nothing",
      "urdu": "اس کے لیے کچھ نہیں"
    }
  ],
  "summary": {
    "urdu": "ناجائز طور پر دوسروں کی زمین پر کاشت کاری کرنے والے کو فصل میں حصہ نہیں ملے گا، بلکہ اسے صرف بیج اور محنت کے اخراجات واپس ملیں گے تاکہ مالک کو مفت فائدہ نہ ہو اور غاصب کو سزا ملے۔",
    "english": "A person who farms on someone else's land without permission is not entitled to the harvest, but only to recover their production costs to prevent unjust enrichment for either party."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3403)",
      "english": "Sunan Abu Dawud (3403)"
    },
    {
      "arabic": "سنن الترمذي (1366)",
      "english": "Sunan at-Tirmidhi (1366)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رافع بن خديج الأنصاري",
        "english": "Rafi' bin Khadij Al-Ansari"
      },
      "slug": "rafi-bin-khadij"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9j_vM94nks",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غصب شدہ زمین میں کاشت کا حکم",
        "english": "Ruling on Farming Seized Land"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجازت کی اہمیت",
              "english": "Importance of Permission"
            },
            "content": {
              "urdu": [
                "کسی کی زمین پر اس کی مرضی کے بغیر قبضہ کرنا یا کاشت کرنا سنگین جرم ہے۔",
                "اسلامی قانون انفرادی ملکیت کو تحفظ فراہم کرتا ہے اور زیادتی کو روکتا ہے۔",
                "بغیر اجازت کاشت کاری کرنے والا شرعی طور پر فصل کا مالک نہیں بن سکتا۔"
              ],
              "english": [
                "Occupying or farming someone else's land without consent is a serious offense.",
                "Islamic law protects individual property rights and prevents exploitation.",
                "One who farms without permission cannot be the legal owner of the resulting crop."
              ]
            }
          },
          {
            "title": {
              "urdu": "فصل کا مالک کون؟",
              "english": "Who Owns the Harvest?"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک ایسی صورت میں فصل زمین کے مالک کی ہوتی ہے۔",
                "کاشت کرنے والے کو اس کی محنت کا پھل نہیں ملے گا کیونکہ بنیاد ظلم پر تھی۔",
                "یہ حکم غاصب کے لیے تادیبی سزا کی حیثیت رکھتا ہے تاکہ دوسروں کو عبرت ہو۔"
              ],
              "english": [
                "According to the majority of jurists, the crop belongs to the landowner in such cases.",
                "The person who farmed it will not reap the benefits because the action was based on injustice.",
                "This ruling acts as a disciplinary penalty for the usurper to deter others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخراجات کی واپسی کا اصول",
        "english": "Principle of Recovering Expenses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل و انصاف کا تقاضا",
              "english": "Requirements of Justice"
            },
            "content": {
              "urdu": [
                "اگرچہ کاشت کار مجرم ہے، لیکن اس کے بیج اور پانی کے اخراجات واپس کیے جائیں گے۔",
                "اسلام کسی کو بھی دوسرے کے مال سے مفت فائدہ اٹھانے کی اجازت نہیں دیتا۔",
                "مالک کو فصل ملے گی لیکن اسے کاشت کار کے اخراجات ادا کرنے ہوں گے۔"
              ],
              "english": [
                "Although the farmer is at fault, they are entitled to recover seed and irrigation costs.",
                "Islam does not permit anyone to benefit for free from another's expenditure.",
                "The landowner gets the crop but must reimburse the actual costs incurred by the farmer."
              ]
            }
          },
          {
            "title": {
              "urdu": "مفت فائدے کی ممانعت",
              "english": "Prohibition of Unjust Enrichment"
            },
            "content": {
              "urdu": [
                "اگر مالک کو فصل اور اخراجات دونوں مل جائیں تو یہ اس کے لیے ناجائز نفع ہوگا۔",
                "شریعت دونوں فریقوں کے درمیان توازن برقرار رکھتی ہے تاکہ کوئی کسی کا حق نہ مارے۔",
                "یہ اصول مالیاتی دیانت اور توازن کو فروغ دیتا ہے۔"
              ],
              "english": [
                "If the owner received both the crop and the expenses, it would be an unlawful gain.",
                "Sharia maintains balance between both parties so that neither usurps the other's right.",
                "This principle promotes financial integrity and equilibrium."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور قانونی فوائد",
        "english": "Social and Legal Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لڑائی جھگڑوں کا سدِ باب",
              "english": "Prevention of Disputes"
            },
            "content": {
              "urdu": [
                "زمین کے تنازعات معاشرے میں بڑے فسادات کا سبب بنتے ہیں۔",
                "واضح قوانین کی موجودگی میں لوگ دوسروں کی زمین پر نظر ڈالنے سے گریز کرتے ہیں۔",
                "یہ حدیث زمینی حقوق کی واضح حد بندی کرتی ہے۔"
              ],
              "english": [
                "Land disputes are a major cause of significant social unrest.",
                "The existence of clear laws deters people from eyeing the property of others.",
                "This Hadith clearly delineates the boundaries of land rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانون کی حکمرانی",
              "english": "Rule of Law"
            },
            "content": {
              "urdu": [
                "عدالتی نظام میں یہ حدیث ایک اہم قانونی قاعدے کے طور پر استعمال ہوتی ہے۔",
                "ناجائز تصرف کو روکنے کے لیے اس طرح کی وعیدیں ضروری ہیں۔",
                "اسلامی عدلیہ اس بنیاد پر حقدار کو اس کا حق دلاتی ہے۔"
              ],
              "english": [
                "This Hadith serves as an important legal maxim within the judicial system.",
                "Such warnings are necessary to stop unauthorized possession of assets.",
                "The Islamic judiciary ensures the rightful owner receives their due based on this."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور اخلاقی سبق",
        "english": "Spiritual and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رزقِ حلال کی اہمیت",
              "english": "Importance of Halal Sustenance"
            },
            "content": {
              "urdu": [
                "ظلم اور غصب کے ذریعے حاصل کی گئی فصل میں برکت نہیں ہوتی۔",
                "ایک مومن کو چاہیے کہ وہ اپنی محنت حلال طریقے سے صرف کرے۔",
                "دوسروں کے حقوق پامال کر کے حاصل کیا گیا مال آخرت میں وبال بنے گا۔"
              ],
              "english": [
                "A crop obtained through injustice and seizure lacks divine blessing.",
                "A believer must invest their hard work in permissible and legal ways.",
                "Wealth gained by violating the rights of others will be a burden in the hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور دیانتداری",
              "english": "Piety and Integrity"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ دلوں کی نیتوں کو جانتا ہے، ظاہری محنت سے پہلے نیت کی اصلاح ضروری ہے۔",
                "دوسرے کے مال کو اپنی ملکیت سمجھنا اخلاقی پستی کی علامت ہے۔",
                "اسلامی معاشرے کی بنیاد دیانتداری اور ایک دوسرے کے احترام پر ہے۔"
              ],
              "english": [
                "Allah knows the intentions; rectifying intent is required before outward effort.",
                "Considering another's property as one's own is a sign of moral degradation.",
                "The foundation of Islamic society is built on integrity and mutual respect."
              ]
            }
          }
        ]
      }
    }
  ]
}