{
  "hadithId": 251,
  "hadithNo": 42,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/42"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (834) ومسلم (2705). واللفظ للبخاري في كتاب الأذان، باب الدعاء قبل السلام.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (834) اور امام مسلم (2705) نے روایت کیا ہے۔ یہ الفاظ بخاری کے ہیں جو سلام سے پہلے مانگی جانے والی دعاؤں کے باب میں مذکور ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (834) and Muslim (2705). This wording is from Al-Bukhari in the chapter concerning supplication before the Taslim."
  },
  "importantWords": [
    {
      "arabic": "ظَلَمْتُ",
      "english": "I have wronged",
      "urdu": "میں نے ظلم کیا"
    },
    {
      "arabic": "كَثِيرًا",
      "english": "Greatly / Much",
      "urdu": "بہت زیادہ"
    },
    {
      "arabic": "اَلذُّنُوبَ",
      "english": "Sins",
      "urdu": "گناہ"
    },
    {
      "arabic": "مَغْفِرَةً",
      "english": "Forgiveness",
      "urdu": "بخشش / مغفرت"
    },
    {
      "arabic": "اَلرَّحِيمُ",
      "english": "Most Merciful",
      "urdu": "نہایت رحم والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز کے آخر میں مانگی جانے والی ایک ایسی دعا کا ذکر ہے جو نبی کریم ﷺ نے سیدنا ابوبکر صدیق رضی اللہ عنہ کو سکھائی، جس میں عجز و انکساری اور مغفرت کی طلب کا بہترین اظہار ہے۔",
    "english": "This Hadith mentions a supplication for the end of the prayer taught by the Prophet (PBUH) to Abu Bakr (RA), expressing ultimate humility and the seeking of divine forgiveness."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (834)",
      "english": "Sahih Al-Bukhari (834)"
    },
    {
      "arabic": "صحيح مسلم (2705)",
      "english": "Sahih Muslim (2705)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكر الصديق",
        "english": "Abu Bakr as-Siddiq"
      },
      "slug": "abu-bakr-as-siddiq"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=Allahumma+inni+zalamtu+nafsi+explanation+urdu",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کی فضیلت اور عظمت",
        "english": "Excellence of the Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صدیقِ اکبر کی عاجزی",
              "english": "Humility of Abu Bakr (RA)"
            },
            "content": {
              "urdu": [
                "افضل البشر بعد الانبیاء ہونے کے باوجود ابوبکر صدیقؓ نے مغفرت کی دعا مانگی۔",
                "یہ اس بات کی دلیل ہے کہ انسان جتنا بھی نیک ہو، اسے اللہ کے سامنے عاجز رہنا چاہیے۔",
                "نیک لوگوں کو اپنی عبادات پر ناز کرنے کے بجائے استغفار کرتے رہنا چاہیے۔"
              ],
              "english": [
                "Despite being the best of men after prophets, Abu Bakr (RA) sought a prayer for forgiveness.",
                "This proves that no matter how righteous a person is, they must remain humble before Allah.",
                "Righteous people should constantly seek forgiveness rather than taking pride in their worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "جامع کلمات کا انتخاب",
              "english": "Choice of Comprehensive Words"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے اس دعا میں اعترافِ گناہ اور طلبِ رحمت کو جمع فرما دیا ہے۔",
                "یہ الفاظ انسان کی کوتاہیوں اور اللہ کی بے پناہ بخشش کا حسین امتزاج ہیں۔",
                "ایسی دعائیں دل میں رقت اور بندگی کا حقیقی احساس پیدا کرتی ہیں۔"
              ],
              "english": [
                "The Prophet (PBUH) combined the confession of sin and the quest for mercy in this prayer.",
                "These words are a beautiful blend of human shortcomings and Allah's boundless forgiveness.",
                "Such supplications create a true sense of servitude and tenderness in the heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقیدہ توحید اور مغفرت",
        "english": "Tawhid and Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صرف اللہ ہی بخشنے والا ہے",
              "english": "Only Allah Forgives"
            },
            "content": {
              "urdu": [
                "دعا کا جملہ 'تیرے سوا کوئی گناہ نہیں بخش سکتا' خالص توحید کی عکاسی ہے۔",
                "گناہوں کی معافی صرف خالقِ کائنات کے اختیار میں ہے، کسی مخلوق کے پاس نہیں۔",
                "یہ عقیدہ بندے کا تعلق براہِ راست اپنے رب سے جوڑ دیتا ہے۔"
              ],
              "english": [
                "The phrase 'nobody forgives sins except You' reflects pure Monotheism (Tawhid).",
                "Pardoning sins is solely in the authority of the Creator, not any created being.",
                "This belief connects the servant directly to their Lord without intermediaries."
              ]
            }
          },
          {
            "title": {
              "urdu": "خصوصی مغفرت کی طلب",
              "english": "Seeking Special Forgiveness"
            },
            "content": {
              "urdu": [
                "'اپنے پاس سے مغفرت' مانگنے کا مطلب وہ بخشش ہے جو بندے کے عمل کے بجائے اللہ کے فضل پر ہو۔",
                "اللہ کی رحمت اس کے غضب پر غالب ہے، اسی لیے اس کی خاص رحمت مانگی جاتی ہے۔",
                "مغفرت کے ساتھ رحمت کا ذکر کرنا عذاب سے بچاؤ اور درجات کی بلندی کے لیے ہے۔"
              ],
              "english": [
                "'Forgiveness from Your presence' implies a pardon based on Allah's grace rather than one's deeds.",
                "Allah's mercy prevails over His wrath, which is why His special mercy is sought.",
                "Mentioning mercy alongside forgiveness is for protection from punishment and raising ranks."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و عملی نکات",
        "english": "Juristic and Practical Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں دعا کا محل",
              "english": "Place of Prayer in Salah"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک یہ دعا آخری تشہد میں سلام پھیرنے سے پہلے پڑھنی چاہیے۔",
                "تاہم، یہ دعا نماز کے کسی بھی سجدے میں بھی مانگی جا سکتی ہے۔",
                "نبی ﷺ نے نماز کو اللہ سے مانگنے کا بہترین ذریعہ قرار دیا ہے۔"
              ],
              "english": [
                "According to most scholars, this Dua should be recited before the Taslim in the final Tashahhud.",
                "However, this supplication can also be made during any prostration (Sajdah) of the prayer.",
                "The Prophet (PBUH) designated Salah as the best means to ask from Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "استغفار کی اہمیت",
              "english": "Importance of Seeking Pardon"
            },
            "content": {
              "urdu": [
                "عبادت کے دوران اپنی کوتاہیوں کا احساس کرنا کمالِ بندگی کی نشانی ہے۔",
                "انسان کبھی بھی اللہ کی بندگی کا حق مکمل طور پر ادا نہیں کر سکتا۔",
                "لہذا ہر عبادت کے بعد اور اس کے دوران استغفار کرنا سنت ہے۔"
              ],
              "english": [
                "Realizing one's shortcomings during worship is a sign of perfected servitude.",
                "Man can never fully fulfill the right of worship due to Allah the Almighty.",
                "Therefore, seeking forgiveness during and after every act of worship is Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سوال کرنے کا سلیقہ",
              "english": "The Etiquette of Asking"
            },
            "content": {
              "urdu": [
                "صحابہ کرامؓ ہمیشہ ایسی چیزوں کا سوال کرتے تھے جو ان کی آخرت سنوار دیں۔",
                "دین سیکھنے کا بہترین طریقہ یہ ہے کہ براہِ راست عالم یا رہنما سے رہنمائی لی جائے۔",
                "سیدنا ابوبکرؓ کا سوال پوری امت کے لیے رہنمائی کا ذریعہ بن گیا۔"
              ],
              "english": [
                "The Companions always asked for things that would improve their Hereafter.",
                "The best way to learn religion is to seek direct guidance from a scholar or leader.",
                "Abu Bakr's (RA) question became a source of guidance for the entire Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کے ناموں کا وسیلہ",
              "english": "Intercession of Allah's Names"
            },
            "content": {
              "urdu": [
                "دعا کا اختتام اللہ کے صفاتی ناموں 'غفور' اور 'رحیم' پر کرنا قبولیت کا سبب ہے۔",
                "اللہ کو اس کے رحیم ہونے کا واسطہ دے کر مانگنا اس کی رحمت کو جوش دلاتا ہے۔",
                "ہمیں مسنون دعاؤں کے مفہوم کو سمجھ کر اپنی زندگیوں میں شامل کرنا چاہیے۔"
              ],
              "english": [
                "Ending the Dua with Allah's attributes 'Al-Ghafur' and 'Ar-Rahim' aids acceptance.",
                "Invoking Allah by His mercy stirs His compassion toward the supplicant.",
                "We should understand the meanings of Masnoon prayers and include them in our daily lives."
              ]
            }
          }
        ]
      }
    }
  ]
}
