{
  "hadithId": 188,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["1:6:2"],
    "kitabId": 2,
    "inKitabBab": 5,
    "arabicBook": "كتاب آداب المشي إلى الصلاة",
    "babId": 15
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (672)‏ ، ومسلم (557)‏ ، وعند مسلم \"قُرِّبَ\" بدل \"قُدِّمَ\" وعندهما \"تُصَلُّوا صَلَاةَ الْمَغْرِبِ\" .‏ وزادا : \"ولا تَعْجَلُوا عِنْدَ عَشَائِكُمْ \" .‏",
    "urdu": "صحیح۔ اسے بخاری (672) اور مسلم (557) نے روایت کیا ہے۔ اور مسلم کے ہاں «قُدِّمَ» (پیش کیا گیا ہو) کی جگہ «قُرِّبَ» (قریب لایا گیا ہو) ہے۔ اور ان دونوں کے ہاں (بخاری و مسلم) «تُصَلُّوا صَلَاةَ الْمَغْرِبِ» (مغرب کی نماز پڑھو) ہے۔ اور انہوں نے (یعنی دونوں نے) یہ اضافہ بھی کیا: ”اور اپنے کھانے کے وقت جلدی نہ کرو۔“",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (672) and Muslim (557). In Muslim, the word is 'Qurriba' (brought near) instead of 'Qudima' (presented). Both (Al-Bukhārī and Muslim) have 'tuṣallū ṣalāta al-Maghrib' (you pray the Maghrib prayer). They both also added: 'And do not rush at the time of your dinner.'",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "قُدِّمَ اَلْعَشَاءُ",
      "english": "The dinner is presented",
      "urdu": "شام کا کھانا پیش کیا گیا ہو"
    },
    {
      "arabic": "فَابْدَءُوا بِهِ",
      "english": "Begin with it",
      "urdu": "تو اس سے شروع کرو"
    },
    {
      "arabic": "قَبْلَ أَنْ تُصَلُّوا اَلْمَغْرِبَ",
      "english": "Before you pray Maghrib",
      "urdu": "مغرب کی نماز ادا کرنے سے پہلے"
    },
    {
      "arabic": "وَلَا تَعْجَلُوا عِنْدَ عَشَائِكُمْ",
      "english": "And do not rush at the time of your dinner",
      "urdu": "اور اپنے کھانے کے وقت جلدی نہ کرو"
    },
    {
      "arabic": "خُشُوع",
      "english": "Reverence/Devotion",
      "urdu": "خشوع"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon (Bukhari and Muslim)",
      "urdu": "بخاری و مسلم متفق"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز کے آداب اور خشوع کی حفاظت کے لیے ایک اہم شرعی اصول بیان کرتی ہے: جب نماز کا وقت ہو اور کھانا بھی حاضر ہو یا اس کی شدید خواہش ہو تو نماز سے پہلے کھانا کھا لینا چاہیے تاکہ نماز کے دوران دل کھانے کی طرف مشغول نہ ہو اور مکمل خشوع حاصل ہو۔ یہ حکم صرف مغرب کی نماز تک محدود نہیں بلکہ ہر اس نماز پر لاگو ہوتا ہے جس کے وقت کھانے کی شدید خواہش ہو۔",
    "english": "This Hadith sets forth an important legal principle regarding the manners of prayer and preserving reverence (Khushu'): When the time for prayer arrives and dinner is presented or there is an intense craving for food, one should eat before praying. This is to ensure that the heart is not preoccupied with food during prayer, allowing for complete devotion. This ruling is not exclusive to Maghrib but applies to any prayer when there is a strong desire to eat.",
    "english_alternative": ""
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خشوع کی حفاظت کا حکم",
        "english": "The Command to Preserve Khushu'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے کو مقدم کرنا",
              "english": "Prioritizing Food"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا یہ حکم «فَابْدَءُوا بِهِ» (اس سے شروع کرو) واضح کرتا ہے کہ کھانا نماز سے پہلے کھا لینا چاہیے تاکہ بھوک کی وجہ سے نماز میں دل مشغول نہ ہو جائے۔",
                "یہ حکم اس عمومی اصول کی بنیاد ہے کہ نماز میں دل کی حاضری اور خشوع کو ہر ممکن طریقے سے برقرار رکھا جائے۔",
                "مسلم کی روایت میں یہ بھی کہا گیا ہے کہ «ولا تَعْجَلُوا عِنْدَ عَشَائِكُمْ» (کھانے کے وقت جلدی نہ کرو)، یعنی سکون سے کھاؤ۔"
              ],
              "english": [
                "The Prophet's (ﷺ) command 'Fabda'ū bihi' (begin with it) clearly indicates that food should be consumed before prayer to prevent hunger from distracting the heart during worship.",
                "This ruling forms the basis of the general principle that the heart's presence and reverence (Khushu') must be maintained in prayer by all means.",
                "Muslim's narration adds 'And do not rush at the time of your dinner,' meaning one should eat calmly and leisurely."
              ]
            }
          },
          {
            "title": {
              "urdu": "مغرب کی تخصیص",
              "english": "Specificity of Maghrib"
            },
            "content": {
              "urdu": [
                "حدیث میں مغرب کی نماز کا ذکر اس لیے ہے کہ اس کا وقت غروب آفتاب کے فوراً بعد ہوتا ہے اور یہ کھانے کا بھی عام وقت ہوتا ہے۔",
                "تاہم، فقہاء کا اتفاق ہے کہ یہ حکم تمام نمازوں کے لیے عام ہے، جب بھی شدید بھوک ہو اور کھانا حاضر ہو۔",
                "اگر نماز کا وقت نکل جانے کا خوف ہو، تو پھر نماز کو مقدم کرنا ضروری ہے، کیونکہ فرض کو چھوڑنا جائز نہیں۔"
              ],
              "english": [
                "The Maghrib prayer is mentioned because its time immediately follows sunset, which is a common dinner time.",
                "However, jurists agree that this ruling is general and applies to all prayers whenever there is intense hunger and food is ready.",
                "If there is a fear that the prayer time will expire, then prioritizing the prayer becomes obligatory, as missing an obligatory prayer is forbidden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اصول اور مشقت کا ازالہ",
        "english": "Juristic Principle and Alleviating Hardship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی ناپسندیدگی",
              "english": "Dislike for Prayer (Makrūh)"
            },
            "content": {
              "urdu": [
                "جس نماز کو بھوک کی حالت میں یا شدید قضاء حاجت کی حالت میں پڑھا جائے، وہ مکروہ ہے، اگرچہ وہ باطل نہیں ہوتی۔",
                "مکروہ اس لیے ہے کہ خشوع میں کمی آتی ہے اور نماز کا اصل مقصد فوت ہو جاتا ہے۔",
                "یہ حکم مشقت کو دور کرنے کے اصول (رفع الحرج) کو بھی واضح کرتا ہے۔"
              ],
              "english": [
                "A prayer performed while severely hungry or urgently needing to relieve oneself is considered disliked (Makrūh), although it is not invalidated.",
                "It is disliked because the lack of Khushu' diminishes the main purpose of the prayer.",
                "This ruling also exemplifies the principle of alleviating hardship (Raf' al-Ḥaraj) in Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھانے کا انتظار",
              "english": "Waiting for Food"
            },
            "content": {
              "urdu": [
                "مسجد میں امام کو چاہیے کہ وہ جماعت کو تھوڑی دیر کے لیے مؤخر کر دے تاکہ لوگ کھانا کھا لیں۔",
                "لیکن یہ تاخیر اتنی زیادہ نہیں ہونی چاہیے کہ نماز کا وقت ہی نکل جائے۔",
                "اس حکم کا اطلاق ان لوگوں پر بھی ہوتا ہے جو قضاء حاجت کی شدید ضرورت محسوس کریں۔"
              ],
              "english": [
                "In the mosque, the Imām should delay the congregation briefly so people can finish their meal.",
                "However, this delay must not be so long that it causes the prayer time to expire.",
                "This ruling also applies to those who have an intense need to relieve themselves (quṣhū' of the heart)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا درس",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط اور خشوع",
              "english": "Discipline and Khushu'"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ اپنی عبادات کو منظم کرے اور ایسے حالات سے بچے جو خشوع کو متاثر کریں۔",
                "نبی ﷺ کے اس حکم پر عمل ہمیں سکھاتا ہے کہ دل کو اللہ کے ساتھ مکمل حاضر رکھنا چاہیے۔",
                "خشوع کو برقرار رکھنے کے لیے دنیاوی ضرورت کو پہلے پورا کرنا کوئی عیب نہیں۔"
              ],
              "english": [
                "A Muslim should organize their worship and avoid situations that compromise reverence.",
                "Following the Prophet's (ﷺ) command teaches us to keep the heart fully present with Allah.",
                "Fulfilling a worldly necessity beforehand to maintain Khushu' is not a defect."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد اور گھر",
              "english": "Mosque and Home"
            },
            "content": {
              "urdu": [
                "اگر کھانا گھر میں موجود ہو تو پہلے گھر میں کھا لینا چاہیے، پھر مسجد میں جا کر نماز ادا کرنی چاہیے۔",
                "یہ حکم اس بات کی دلیل ہے کہ نماز کو مکمل راحت اور آسودگی کی حالت میں پڑھنا چاہیے۔",
                "نماز کی تیاری صرف ظاہری طہارت نہیں، بلکہ باطنی سکون بھی ہے۔"
              ],
              "english": [
                "If food is ready at home, one should eat there first and then go to the mosque for prayer.",
                "This ruling shows that prayer should be performed in a state of comfort and ease.",
                "Preparation for prayer involves not only external purification but also internal tranquility."
              ]
            }
          }
        ]
      }
    }
  ]
}
