{
  "hadithId": 787,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/787"],
    "kitabId": 7,
    "inKitabBab": 17,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 58
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1468)، ومسلم (983). وأخرجه أبو داود (1623)، والنسائي (2464).",
    "urdu": "صحیح۔ اسے امام بخاری (1468) اور امام مسلم (983) نے روایت کیا ہے۔ اس حدیث کا پس منظر یہ ہے کہ کچھ لوگوں نے حضرت خالد پر زکوٰۃ نہ دینے کا الزام لگایا تو آپ ﷺ نے ان کا دفاع کرتے ہوئے یہ بات فرمائی۔",
    "english": "Sahih. Reported by Al-Bukhari (1468) and Muslim (983). It is also reported by Abu Dawud and An-Nasa'i. The context is that when some people accused Khalid of not paying Zakat, the Prophet (ﷺ) defended him by mentioning his endowments."
  },
  "importantWords": [
    {
      "arabic": "اِحْتَبَسَ",
      "english": "Devoted / Endowed (Waqf)",
      "urdu": "وقف کر دیا / روک لیا"
    },
    {
      "arabic": "أَدْرَاعَهُ",
      "english": "His Armors / Shields",
      "urdu": "اپنی زرہیں"
    },
    {
      "arabic": "أَعْتَادَهُ",
      "english": "His Weapons / Equipments",
      "urdu": "جنگی ساز و سامان"
    },
    {
      "arabic": "سَبِيلِ اَللَّهِ",
      "english": "The Cause of Allah",
      "urdu": "اللہ کی راہ (جہاد)"
    },
    {
      "arabic": "الصَّدَقَةِ",
      "english": "Zakat / Alms",
      "urdu": "زکوٰۃ / صدقات"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث منقولہ جائیداد (جیسے زرہیں اور اسلحہ) کے وقف کرنے کے جواز کی دلیل ہے۔ اس میں سیدنا خالد بن ولید کی دین کے لیے بے مثال قربانی اور ایثار کا بھی ذکر ہے۔",
    "english": "This Hadith proves the permissibility of endowing movable property (like armor and weapons) as Waqf. It also highlights the great sacrifice and dedication of Khalid bin al-Walid to the cause of Islam."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1468)",
      "english": "Reported by Al-Bukhari (1468)"
    },
    {
      "arabic": "رواه مسلم (983)",
      "english": "Reported by Muslim (983)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah ad-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T-XQYqBvI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "منقولہ اشیاء کا وقف",
        "english": "Waqf of Movable Property"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زرہ اور اسلحہ کا وقف",
              "english": "Endowment of Armor and Weapons"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک زمین کے علاوہ منقولہ اشیاء کا وقف کرنا بھی جائز ہے۔",
                "سیدنا خالد رضی اللہ عنہ نے اپنی قیمتی زرہیں جہاد کے لیے وقف کر رکھی تھیں۔",
                "نبی ﷺ نے ان کے اس عمل کی تحسین فرمائی اور اسے ان کی سخاوت قرار دیا۔"
              ],
              "english": [
                "The majority of jurists permit the endowment of movable items in addition to land.",
                "Khalid (RA) had dedicated his valuable armor and weapons for the sake of Jihad.",
                "The Prophet (ﷺ) praised his action and cited it as evidence of his immense generosity."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائمی نفع کا حصول",
              "english": "Attaining Perpetual Benefit"
            },
            "content": {
              "urdu": [
                "ایسی اشیاء جو بار بار استعمال ہو سکیں اور باقی رہیں، انہیں وقف کیا جا سکتا ہے۔",
                "آج کے دور میں کتابیں، ایمبولینس اور تعلیمی آلات کا وقف اسی زمرے میں آتا ہے۔",
                "مقصد یہ ہے کہ چیز کی اصل محفوظ رہے اور اس کا فائدہ مسلسل پہنچتا رہے۔"
              ],
              "english": [
                "Items that can be reused and remain durable are eligible for endowment (Waqf).",
                "In modern times, endowing books, ambulances, or educational tools falls under this.",
                "The goal is to preserve the corpus of the item while its utility serves the public continuously."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا خالد بن ولید کا دفاع",
        "english": "Defense of Khalid bin al-Walid"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الزام کا ازالہ",
              "english": "Refutation of the Accusation"
            },
            "content": {
              "urdu": [
                "کچھ لوگوں کا خیال تھا کہ حضرت خالد زکوٰۃ روک لیتے ہیں، جس کی آپ ﷺ نے تردید کی۔",
                "آپ ﷺ نے واضح کیا کہ وہ زکوٰۃ کیسے روک سکتے ہیں جبکہ وہ اپنا سب کچھ وقف کر چکے ہیں۔",
                "یہ حضرت خالد کی دیانتداری اور اخلاص پر نبوی مہرِ تصدیق ہے۔"
              ],
              "english": [
                "Some people incorrectly thought Khalid was withholding Zakat, which the Prophet (ﷺ) refuted.",
                "The Prophet clarified that one who has endowed everything for Allah would not withhold Zakat.",
                "This serves as a Prophetic certification of Khalid's integrity and sincerity."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا عشقِ الہی",
              "english": "The Sahaba's Love for Allah"
            },
            "content": {
              "urdu": [
                "صحابہ کرام اپنا بہترین مال اللہ کی رضا کے لیے وقف کرنے میں جلدی کرتے تھے۔",
                "سیدنا خالد کا جنگی سامان وقف کرنا ان کے شوقِ شہادت اور جذبہ جہاد کی دلیل ہے۔",
                "انہوں نے اپنی ذات پر قوم اور دین کے مفاد کو ہمیشہ ترجیح دی۔"
              ],
              "english": [
                "The Sahaba used to hasten in endowing their best wealth for the pleasure of Allah.",
                "Khalid's endowment of military equipment proves his passion for martyrdom and Jihad.",
                "He consistently prioritized the interests of the Ummah and Deen over his personal self."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور قانونی ابحاث",
        "english": "Juristic and Legal Analysis"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقف اور زکوٰۃ کا تعلق",
              "english": "Relationship Between Waqf and Zakat"
            },
            "content": {
              "urdu": [
                "جو چیز اللہ کی راہ میں وقف کر دی جائے، اس پر زکوٰۃ واجب نہیں رہتی۔",
                "وقف کرنے سے مال انسان کی نجی ملکیت سے نکل کر اللہ کی ملکیت میں چلا جاتا ہے۔",
                "نبی ﷺ نے اسی بنیاد پر حضرت خالد کو زکوٰۃ کی ادائیگی سے مستثنیٰ قرار دیا۔"
              ],
              "english": [
                "Zakat is not mandatory on items that have been permanently endowed (Waqf) for Allah.",
                "By making a Waqf, the wealth leaves private ownership and enters the ownership of Allah.",
                "The Prophet (ﷺ) exempted Khalid from paying Zakat on those items based on this principle."
              ]
            }
          },
          {
            "title": {
              "urdu": "زرہ اور اسلحہ کی شرعی حیثیت",
              "english": "Shariah Status of Endowing Arms"
            },
            "content": {
              "urdu": [
                "دفاعِ وطن اور تحفظِ دین کے لیے آلات کا وقف کرنا بہترین صدقہ ہے۔",
                "امام ابو حنیفہ کے نزدیک اسلحہ اور گھوڑے کا وقف کرنا بالاتفاق جائز ہے۔",
                "یہ حدیث اس موقف کی تائید کرتی ہے کہ جنگی سامان کو رفاہی مقصد کے لیے وقف کیا جا سکتا ہے۔"
              ],
              "english": [
                "Endowing tools for national defense and the protection of faith is a superior form of charity.",
                "According to Imam Abu Hanifa, endowing weapons and horses is unanimously permissible.",
                "This Hadith supports the view that military hardware can be dedicated to charitable causes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدگمانی سے بچنا",
              "english": "Avoiding Suspicion"
            },
            "content": {
              "urdu": [
                "کسی نیک انسان کے بارے میں بغیر تحقیق کے مالی بددیانتی کا گمان نہ کریں۔",
                "نبی ﷺ نے صحابی کی عزت کا دفاع کر کے ہمیں دوسروں کی آبرو کی حفاظت سکھائی۔",
                "معاملات کی تہہ تک پہنچے بغیر کوئی منفی رائے قائم کرنا گناہ ہے۔"
              ],
              "english": [
                "Do not suspect a righteous person of financial dishonesty without proper investigation.",
                "By defending his Companion's honor, the Prophet (ﷺ) taught us to protect the reputation of others.",
                "Forming a negative opinion without reaching the root of the matter is a sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین کے لیے ایثار",
              "english": "Selflessness for Religion"
            },
            "content": {
              "urdu": [
                "ہمیں بھی اپنی صلاحیتوں اور وسائل کو دین کی خدمت کے لیے وقف کرنا چاہیے۔",
                "ضروری نہیں کہ صرف زمین ہی وقف ہو، اپنی مہارت اور وقت بھی وقف کیا جا سکتا ہے۔",
                "اللہ کے لیے دی گئی معمولی چیز بھی اخلاص کی بنیاد پر عظیم بن جاتی ہے۔"
              ],
              "english": [
                "We should also dedicate our skills and resources to the service of our religion.",
                "Waqf is not limited to land; one can also endow their expertise and time.",
                "Even a small thing given for the sake of Allah becomes magnificent through sincerity."
              ]
            }
          }
        ]
      }
    }
  ]
}