{
  "hadithId": 1046,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1253"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5885) واللفظ له، وأبو داود (4930)، والترمذي (2784)، والنسائي (9161)، وابن ماجه (1904).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری نے اسے اپنی صحیح میں (5885) پر روایت کیا ہے۔ دیگر کتبِ سنن میں بھی یہ کلمات موجود ہیں۔",
    "english": "Sahih (Authentic). Reported by al-Bukhari (5885), Abu Dawud (4930), at-Tirmidhi (2784), an-Nasa'i (9161), and Ibn Majah (1904)."
  },
  "importantWords": [
    {
      "arabic": "لَعَنَ",
      "english": "Cursed",
      "urdu": "لعنت فرمائی"
    },
    {
      "arabic": "اَلْمُخَنَّثِينَ",
      "english": "Effeminate men",
      "urdu": "زنخے / مشابہتِ نساء کرنے والے مرد"
    },
    {
      "arabic": "اَلْمُتَرَجِّلَاتِ",
      "english": "Masculine women",
      "urdu": "مردانی / مشابہتِ مردانہ کرنے والی عورتیں"
    },
    {
      "arabic": "أَخْرِجُوهُمْ",
      "english": "Expel them",
      "urdu": "انہیں نکال دو"
    },
    {
      "arabic": "بُيُوتِكُمْ",
      "english": "Your houses",
      "urdu": "تمہارے گھر"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث جنس کی تبدیلی یا مشابہت (کراس ڈریسنگ) کی ممانعت بیان کرتی ہے اور معاشرے کی اخلاقی تطہیر کے لیے ایسے افراد کے بائیکاٹ کا حکم دیتی ہے۔",
    "english": "This Hadith prohibits gender imitation (cross-dressing) and orders the expulsion of such individuals from homes to maintain moral purity and natural distinctions."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5885)",
      "english": "Sahih al-Bukhari (5885)"
    },
    {
      "arabic": "سنن أبي داود (4930)",
      "english": "Sunan Abu Dawud (4930)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جنس کی مشابہت کی ممانعت",
        "english": "Prohibition of Gender Imitation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری حدود کا تحفظ",
              "english": "Protecting Natural Boundaries"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے مرد اور عورت کو الگ الگ جسمانی اور نفسیاتی خصوصیات کے ساتھ پیدا کیا ہے۔",
                "ایک صنف کا دوسری صنف کے مخصوص لباس، چال ڈھال یا گفتگو کی نقل کرنا فطرت سے بغاوت ہے۔",
                "یہ ممانعت معاشرے میں مردانگی اور نسوانیت کے وقار کو برقرار رکھنے کے لیے ہے۔"
              ],
              "english": [
                "Allah created men and women with distinct physical and psychological characteristics.",
                "Imitating the specific clothing, gait, or speech of the opposite gender is a rebellion against nature.",
                "This prohibition aims to maintain the dignity of both masculinity and femininity in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کا مفہوم",
              "english": "Meaning of the Curse"
            },
            "content": {
              "urdu": [
                "لعنت کا مطلب اللہ کی رحمت سے دوری اور محرومی ہے۔",
                "نبی ﷺ کا لعنت فرمانا اس فعل کے 'کبیرہ گناہ' ہونے کی صریح دلیل ہے۔",
                "یہ تنبیہ اس لیے دی گئی ہے تاکہ مسلمان اس اخلاقی گراوٹ سے مکمل اجتناب کریں۔"
              ],
              "english": [
                "A curse signifies being distanced and deprived of Allah's mercy.",
                "The Prophet's (ﷺ) curse is a clear proof that this act is a 'major sin'.",
                "This warning is given to ensure Muslims completely avoid this moral degradation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی بائیکاٹ کا حکم",
        "english": "Order of Social Boycott"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھروں سے نکالنے کی حکمت",
              "english": "Wisdom of Expulsion"
            },
            "content": {
              "urdu": [
                "ایسے افراد جو جان بوجھ کر اپنی صنف بدلتے ہیں، وہ بچوں اور نوجوانوں کے لیے برا نمونہ بن سکتے ہیں۔",
                "گھروں سے نکالنے کا حکم پردے کے احکام اور گھریلو تقدس کی حفاظت کے لیے ہے۔",
                "یہ ایک تادیبی کارروائی ہے تاکہ وہ توبہ کریں اور اپنی فطری حالت پر واپس آئیں۔"
              ],
              "english": [
                "Individuals who intentionally change their gender presentation can serve as bad role models for youth.",
                "The command to expel them is to protect the sanctity of the home and rules of Hijab.",
                "This is a disciplinary measure intended to lead them to repentance and their natural state."
              ]
            }
          },
          {
            "title": {
              "urdu": "فتنے کا سدِ باب",
              "english": "Preventing Strife (Fitna)"
            },
            "content": {
              "urdu": [
                "مخنث مردوں کا عورتوں کے درمیان رہنا اخلاقی بے راہ روی کا سبب بن سکتا ہے۔",
                "اسی طرح مردانی عورتوں کا مردوں میں گھل مل جانا سماجی توازن بگاڑ دیتا ہے۔",
                "اسلام گناہ کے ارتکاب سے پہلے اس کے تمام اسباب کا راستہ بند کرتا ہے۔"
              ],
              "english": [
                "The presence of effeminate men among women can lead to moral laxity.",
                "Similarly, masculine women mixing with men disrupts social balance.",
                "Islam blocks all pathways to sin before the actual commission of the act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حدود و قیود",
        "english": "Juristic Boundaries"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری بمقابلہ ارادی حالت",
              "english": "Natural vs. Intentional State"
            },
            "content": {
              "urdu": [
                "یہ وعید ان لوگوں کے لیے ہے جو تکلف اور اپنی پسند سے مشابہت اختیار کرتے ہیں۔",
                "جس کی پیدائشی ساخت ہی ایسی ہو، اس پر لعنت نہیں بلکہ اس کا علاج اور اصلاح مطلوب ہے۔",
                "اسلامی قانون 'ارادے' اور 'فعل' کی سنگینی کی بنیاد پر سزا کا تعین کرتا ہے۔"
              ],
              "english": [
                "This warning is for those who intentionally adopt imitation by choice.",
                "One born with such traits is not cursed; rather, medical and psychological help is required.",
                "Islamic law determines penalties based on the gravity of 'intent' and 'action'."
              ]
            }
          },
          {
            "title": {
              "urdu": "لباس اور تہذیب",
              "english": "Clothing and Culture"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے سونا اور ریشم پہننا اسی لیے حرام ہے کیونکہ یہ نسوانیت کی علامت ہے۔",
                "لباس کے ذریعے مرد کا مرد اور عورت کا عورت نظر آنا شرعی تقاضا ہے۔",
                "تہذیبی یلغار کے اس دور میں اس حدیث پر عمل کرنا ایمان کی حفاظت کے لیے ضروری ہے۔"
              ],
              "english": [
                "Gold and silk are forbidden for men partly because they are symbols of femininity.",
                "It is a Shariah requirement for men to appear masculine and women to appear feminine.",
                "In this age of cultural invasion, practicing this Hadith is vital for preserving faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "والدین کی ذمہ داری",
              "english": "Parental Responsibility"
            },
            "content": {
              "urdu": [
                "والدین کو چاہیے کہ بچپن ہی سے بچوں کی تربیت ان کی جنس کے مطابق کریں۔",
                "بچوں کے لباس اور مشاغل پر کڑی نظر رکھنا ضروری ہے تاکہ وہ غلط راستے پر نہ چل پڑیں۔",
                "گھر کا ماحول پاکیزہ رکھنا والدین کا اولین فریضہ ہے۔"
              ],
              "english": [
                "Parents must raise children according to their gender from a young age.",
                "Vigilance over children's clothing and hobbies is necessary to prevent deviation.",
                "Keeping the home environment pure is the primary duty of parents."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید رجحانات کا رد",
              "english": "Rejection of Modern Trends"
            },
            "content": {
              "urdu": [
                "جدید دور کے 'جنڈر آئیڈیالوجی' اور 'ایل جی بی ٹی' جیسے نظریات اسلام کی بنیادوں سے متصادم ہیں۔",
                "مسلمانوں کو میڈیا اور مغربی پروپیگنڈے سے متاثر ہوئے بغیر سنت پر قائم رہنا چاہیے۔",
                "حقیقی ترقی اللہ کے بنائے ہوئے قوانین کی پیروی میں ہے۔"
              ],
              "english": [
                "Modern 'gender ideologies' and 'LGBT' concepts conflict with Islamic foundations.",
                "Muslims should remain steadfast on the Sunnah without being influenced by media or propaganda.",
                "True progress lies in following the laws established by Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}