{
  "hadithId": 733,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh:733"
    ],
    "kitabId": 7,
    "inKitabBab": 6,
    "arabicBook": "كتاب البيوع",
    "babId": 47
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (2/179)، وأبو داود (3547)، والنسائي (5/65)، وابن ماجه (2388)، والحاكم (2/47). وصححه الألباني في صحيح الجامع (7181).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، نسائی اور ابن ماجہ نے روایت کیا ہے اور امام حاکم نے اسے صحیح قرار دیا ہے۔ علامہ البانی نے بھی اس کی صحت کی تصدیق کی ہے۔",
    "english": "Sahih. Reported by Ahmad (2/179), Abu Dawud (3547), An-Nasa'i (5/65), Ibn Majah (2388), and Al-Hakim (2/47). Authenticated by Al-Albani in Sahih al-Jami' (7181)."
  },
  "importantWords": [
    {
      "arabic": "عَطِيَّةٌ",
      "english": "Gift / Donation",
      "urdu": "عطیہ / ہبہ / تحفہ"
    },
    {
      "arabic": "بِإِذْنِ",
      "english": "Permission",
      "urdu": "اجازت سے"
    },
    {
      "arabic": "عِصْمَتَهَا",
      "english": "Protection / Marriage bond",
      "urdu": "نکاح / عصمت / نکاح کا بندھن"
    },
    {
      "arabic": "تَصَرُّفٌ",
      "english": "Management / Disposal",
      "urdu": "اختیار / معاملہ کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں شادی شدہ عورت کے مالی تصرفات میں شوہر کی مشاورت اور اجازت کی اہمیت کو بیان کیا گیا ہے تاکہ ازدواجی زندگی میں توازن اور اعتماد برقرار رہے۔",
    "english": "This Hadith highlights the importance of a husband's permission or consultation in a married woman's financial gifts to maintain balance and trust within the marriage."
  },
  "references": [
    {
      "arabic": "سنن النسائي (3756)",
      "english": "Sunan an-Nasa'i (3756)"
    },
    {
      "arabic": "سنن أبي داود (3547)",
      "english": "Sunan Abi Dawud (3547)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0O5vXJ4Xm4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عورت کی مالی خود مختاری اور شرعی حدود",
        "english": "Financial Independence of Women and Sharia Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کی ملکیت کا حق",
              "english": "Right to Ownership"
            },
            "content": {
              "urdu": [
                "اسلام نے عورت کو مال کی مالک بننے اور وراثت حاصل کرنے کا مکمل حق دیا ہے۔",
                "عورت اپنے ذاتی مال (مہر، وراثت، کمائی) کی خود مالک ہوتی ہے۔",
                "جمہور فقہاء کے نزدیک عورت اپنے مال میں تصرف کر سکتی ہے، مگر تبرعات (عطیات) میں شوہر کی رضا بہتر ہے۔"
              ],
              "english": [
                "Islam grants women the full right to own property and receive inheritance.",
                "A woman is the owner of her personal wealth, whether from Mahr, inheritance, or earnings.",
                "According to the majority of jurists, she can manage her wealth, but for donations, a husband's consent is preferred."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجازت کی نوعیت",
              "english": "Nature of Permission"
            },
            "content": {
              "urdu": [
                "اس حدیث میں ممانعت سے مراد 'اخلاقی تربیت' اور 'گھریلو نظم و ضبط' ہے تاکہ شوہر لاعلم نہ رہے۔",
                "اگر عورت فضول خرچی کرے یا اپنا سارا مال لٹا دے، تو شوہر بطور نگران اسے روکنے کا حق رکھتا ہے۔",
                "یہ پابندی عورت کی توہین نہیں بلکہ خاندان کے وسیع تر معاشی مفاد کے تحفظ کے لیے ہے۔"
              ],
              "english": [
                "The prohibition in this Hadith refers to moral training and household discipline to keep the husband informed.",
                "If a woman engages in extravagance or depletes her assets, the husband as a guardian can intervene.",
                "This restriction is not to demean women but to protect the broader economic interest of the family."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کا موقف",
        "english": "Standpoint of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء (احناف، شوافع، حنابلہ)",
              "english": "Majority (Hanafi, Shafi'i, Hanbali)"
            },
            "content": {
              "urdu": [
                "جمہور کے نزدیک بالغ اور سمجھدار عورت کو اپنے مال میں تصرف کے لیے شوہر کی اجازت قانونی طور پر واجب نہیں۔",
                "وہ اس حدیث کو 'استحباب' (پسندیدہ عمل) اور 'حسنِ معاشرت' پر محمول کرتے ہیں۔",
                "حضرت میمونہ رضی اللہ عنہا نے نبی ﷺ کی اجازت کے بغیر لونڈی آزاد کی تھی اور آپ ﷺ نے اسے جائز قرار دیا۔"
              ],
              "english": [
                "The majority holds that a mature woman does not legally require her husband's permission for financial disposal.",
                "They interpret this Hadith as a recommendation (Mustahabb) for good social conduct.",
                "Maimunah (R.A) freed a slave girl without the Prophet's prior permission, and he validated the act."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام مالکؒ کا نقطہ نظر",
              "english": "Imam Malik's Perspective"
            },
            "content": {
              "urdu": [
                "امام مالکؒ کے نزدیک عورت اپنے مال کا ایک تہائی (1/3) سے زیادہ حصہ شوہر کی اجازت کے بغیر ہبہ نہیں کر سکتی۔",
                "وہ اس حدیث کے ظاہری الفاظ سے استدلال کرتے ہوئے اسے واجب سمجھتے ہیں۔",
                "مقصد یہ ہے کہ عورت جذباتی فیصلے کر کے اپنی معاشی بنیادیں کمزور نہ کر لے۔"
              ],
              "english": [
                "Imam Malik believes a woman cannot gift more than one-third of her wealth without her husband's consent.",
                "He takes the literal meaning of the Hadith as a binding legal requirement.",
                "The aim is to prevent a woman from weakening her economic base through emotional decisions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ازدواجی زندگی میں حکمت اور توازن",
        "english": "Wisdom and Balance in Marital Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی مشاورت کی اہمیت",
              "english": "Importance of Mutual Consultation"
            },
            "content": {
              "urdu": [
                "خوشگوار ازدواجی زندگی کی بنیاد باہمی اعتماد اور مشورے پر ہے۔",
                "شوہر کو بتائے بغیر بڑے مالی فیصلے کرنا گھر میں بدگمانی پیدا کر سکتا ہے۔",
                "اسلام چاہتا ہے کہ میاں بیوی ایک ٹیم بن کر خاندان کے مستقبل کا تحفظ کریں۔"
              ],
              "english": [
                "A happy married life is built on mutual trust and consultation.",
                "Making major financial decisions without informing the husband can create suspicion.",
                "Islam wants the husband and wife to work as a team to protect the family's future."
              ]
            }
          },
          {
            "title": {
              "urdu": "عصمت اور نکاح کا بندھن",
              "english": "The Bond of Marriage"
            },
            "content": {
              "urdu": [
                "حدیث میں 'ملک زوجہا عصمتہا' کے الفاظ نکاح کے نتیجے میں پیدا ہونے والی ذمہ داری کو ظاہر کرتے ہیں۔",
                "چونکہ شوہر نان و نفقہ کا ذمہ دار ہے، اس لیے اسے گھر کے مالی حالات کا علم ہونا چاہیے۔",
                "یہ اتھارٹی جبر کے لیے نہیں بلکہ نظم و ضبط کے لیے دی گئی ہے۔"
              ],
              "english": [
                "The phrase regarding the husband's 'ownership of her protection' signifies the responsibility stemming from Nikah.",
                "Since the husband is responsible for maintenance, he should be aware of the household's financial status.",
                "This authority is granted for discipline, not for oppression."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ اور عملی سبق",
        "english": "Summary and Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال کی راہ",
              "english": "The Path of Moderation"
            },
            "content": {
              "urdu": [
                "عورت کو اپنے مال میں حق ہے، مگر اسے شوہر کے ساتھ خیر خواہی کا معاملہ کرنا چاہیے۔",
                "شوہر کو بھی چاہیے کہ وہ بلاوجہ عورت کی نیکی اور صدقہ کے راستے میں رکاوٹ نہ بنے۔",
                "دینِ اسلام ہر معاملے میں توازن اور حسنِ سلوک کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "A woman has rights over her wealth, but she should act with goodwill toward her husband.",
                "The husband should not unnecessarily hinder the woman's acts of charity and kindness.",
                "Islam teaches balance and excellence in conduct in every matter."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "یہ حدیث گھریلو استحکام کے لیے ایک سنہری اصول فراہم کرتی ہے۔",
                "مالی شفافیت سے میاں بیوی کے درمیان محبت اور احترام بڑھتا ہے۔",
                "شریعت کے احکامات پر عمل کرنے میں ہی دنیا اور آخرت کی فلاح ہے۔"
              ],
              "english": [
                "This Hadith provides a golden rule for household stability.",
                "Financial transparency increases love and respect between spouses.",
                "Success in this world and the hereafter lies in following Sharia commands."
              ]
            }
          }
        ]
      }
    }
  ]
}