{
  "hadithId": 24,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["1:24"],
    "kitabId": 1,
    "inKitabBab": 3,
    "arabicBook": "كتاب الطهارة",
    "babId": 3
  },

  "takhreej": {
    "arabic": "صحيح.  رواه أحمد (487) ، و الترمذي (2121) ، وهو وإن كان في سنده ضعف إلا أن له ما يشهد له، وللحديث تتمة، وقد فصلت ذلك في 'الأصل'. وقال الترمذي: 'حديث حسن صحيح'",
    "urdu": "صحیح (درست) حدیث۔ اسے احمد (487) اور ترمذی (2121) نے روایت کیا ہے۔ اگرچہ اس کی سند میں کچھ ضعف ہے، لیکن اسے دوسرے شواہد کی تائید حاصل ہے۔ ترمذی نے اسے حسن صحیح (درجہ میں اچھا اور درست) قرار دیا۔",
    "english": "Authentic (Sahih). Reported by Ahmad (487) and At-Tirmidhi (2121). Although there is slight weakness in its chain, it is supported by corroborating evidence. At-Tirmidhi graded it as Hasan Sahih (good and authentic)."
  },
  "importantWords": [
    {
      "arabic": "خَطَبَنَا",
      "english": "He addressed us/gave a sermon",
      "urdu": "آپ نے ہمیں خطاب فرمایا"
    },
    {
      "arabic": "بِمِنًى",
      "english": "At Mina (place near Makkah)",
      "urdu": "مقام منی"
    },
    {
      "arabic": "رَاحِلَتِهِ",
      "english": "His riding animal/mount",
      "urdu": "آپ کی سواری"
    },
    {
      "arabic": "وَلُعَابُهَا",
      "english": "And its saliva",
      "urdu": "اور اس کا لعاب دہن"
    },
    {
      "arabic": "يَسِيلُ",
      "english": "It was dripping/flowing",
      "urdu": "وہ بہتا تھا"
    },
    {
      "arabic": "كَتِفَيَّ",
      "english": "My shoulders",
      "urdu": "میرے کندھوں پر"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "He authenticated it",
      "urdu": "اس کو صحیح قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم صلی اللہ علیہ وسلم کے مقام منی میں اپنی سواری پر خطاب دینے کا واقعہ بیان کرتی ہے، جس میں اونٹنی کا لعاب دہن راوی کے کندھوں پر گرا۔ یہ واقعہ اس بات کی دلیل ہے کہ جانوروں کا لعاب اور جھوٹا پاک ہوتا ہے، اور یہ ایک شرعی حکم کی بنیاد ہے۔",
    "english": "This Hadith recounts the Prophet's sermon at Mina while riding his mount, whose saliva dripped onto the narrator's shoulders. This incident serves as proof that the saliva and leftover water of permissible animals are considered ritually pure (Tahoor)."
  },
  "references": [
    {
      "arabic": "رواه أحمد (487)",
      "english": "Reported by Ahmad (487)"
    },
    {
      "arabic": "رواه الترمذي (2121)",
      "english": "Reported by At-Tirmidhi (2121)"
    }
  ],
  "narrators": [
    {
      "id": 2401,
      "name": {
        "arabic": "عَمْرُو بْنُ خَارِجَةَ",
        "english": "Amr ibn Kharija"
      },
      "slug": "amr-ibn-kharija"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "حسن صحيح",
    "english": "Hasan Sahih (Good and Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جانوروں کی طہارت کا حکم",
        "english": "Ruling on the Purity of Animals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سواری کا لعاب",
              "english": "Saliva of the Riding Animal"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی اونٹنی کا لعاب کندھوں پر گرنے کے باوجود، آپ نے اسے پاک کرنے کا حکم نہیں دیا۔",
                "یہ اس بات کی دلیل ہے کہ ایسے جانوروں کا لعاب اور جھوٹا جن کا گوشت حلال ہو، وہ پاک (طاہر) ہے۔",
                "اگر یہ نجاست ہوتی تو نبی اکرم ﷺ اسے فوراً ہٹانے کا حکم دیتے۔"
              ],
              "english": [
                "Despite the camel's saliva dripping onto his shoulders, the Prophet (ﷺ) did not command him to clean it.",
                "This indicates that the saliva and leftover water of animals whose meat is permissible are ritually pure (Tahoor).",
                "Had it been impure (Najis), the Prophet (ﷺ) would have certainly ordered its immediate removal."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی استنباط",
              "english": "Juristic Deduction"
            },
            "content": {
              "urdu": [
                "فقہاء نے اس حدیث سے یہ اصول نکالا ہے کہ جس جانور کا گوشت حلال ہے، اس کا لعاب اور پیشاب و گوبر (سوائے اس کے کہ اس میں خون یا نجاست ظاہری ہو) بھی پاک ہے۔",
                "اونٹنی کا گوشت حلال ہے، لہٰذا اس کا لعاب پاک ہے اور لباس یا جسم کو ناپاک نہیں کرتا۔",
                "یہ حکم طہارت کے عمومی اصول کو واضح کرتا ہے اور مسلمانوں پر آسانی پیدا کرتا ہے۔"
              ],
              "english": [
                "Jurists deduced from this Hadith that the saliva and excretions (excluding visible blood or impurity) of an animal whose meat is lawful are also pure.",
                "Since camel meat is lawful, its saliva is pure and does not invalidate purity or contaminate clothes/body.",
                "This ruling clarifies the general principle of purification and brings ease to Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا طرز زندگی",
        "english": "The Prophet's Lifestyle"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی اور تواضع",
              "english": "Simplicity and Humility"
            },
            "content": {
              "urdu": [
                "خطبے کے دوران اونٹنی کی سواری اس بات کی دلیل ہے کہ نبی ﷺ کی زندگی میں سادگی اور انکساری تھی۔",
                "آپ ﷺ نے ایک بڑے مجمع میں خطاب کے دوران اس معمولی واقعے کو نظر انداز کیا، جو آپ کی عظمت کو ظاہر کرتا ہے۔",
                "صحابہ کرام کو آپ کے اقوال و افعال کو یاد رکھنے اور محفوظ کرنے کا شوق تھا۔"
              ],
              "english": [
                "Riding a camel while delivering a sermon demonstrates the simplicity and humility in the Prophet's life.",
                "He overlooked this minor incident during a major gathering, showing his focus on the essential message.",
                "The Companions were keen to remember and preserve every saying and action of the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی کا اصول",
              "english": "Principle of Ease"
            },
            "content": {
              "urdu": [
                "اگر اس طرح کے امور سے ہر شخص کو احتیاط برتنا پڑتا تو زندگی دشوار ہو جاتی۔",
                "اللہ کے نبی ﷺ کا عمل ظاہر کرتا ہے کہ دین میں بے جا سختی اور وسوسے سے بچنا چاہیے۔",
                "دین اسلام لوگوں کے لیے آسانی چاہتا ہے نہ کہ تنگی۔"
              ],
              "english": [
                "If everyone had to be meticulous about such minor things, life would become difficult.",
                "The Prophet's action shows that we must avoid unnecessary strictness and religious scrupulosity (Waswasa) in religion.",
                "The religion of Islam seeks ease for people, not hardship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عام شرعی قاعدہ",
        "english": "General Legal Principle"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جانوروں کا جھوٹا",
              "english": "Leftovers of Animals"
            },
            "content": {
              "urdu": [
                "اس حدیث کی بنیاد پر، حلال جانوروں کا لعاب اور جھوٹا پاک ہوتا ہے، اور اسے وضو میں بھی استعمال کیا جا سکتا ہے۔",
                "یہ حکم گھریلو بلی اور دیگر غیر مضر جانوروں کے جھوٹے کی طہارت کے اصول کو بھی مضبوط کرتا ہے۔",
                "البتہ، کتے اور خنزیر کا لعاب نجس ہے اور اس سے اجتناب ضروری ہے۔"
              ],
              "english": [
                "Based on this Hadith, the saliva and leftovers of lawful animals are pure and can even be used for Wudu.",
                "This ruling reinforces the principle of purity for the leftovers of domestic cats and other non-harmful animals.",
                "However, the saliva of dogs and pigs is ritually impure (Najis) and must be strictly avoided."
              ]
            }
          },
          {
            "title": {
              "urdu": "راوی کا اعتراف",
              "english": "Narrator's Acknowledgment"
            },
            "content": {
              "urdu": [
                "عمرو بن خارجہ رضی اللہ عنہ کا اس واقعے کو بیان کرنا اس کے شرعی اثر کی اہمیت کو ظاہر کرتا ہے۔",
                "ان کا یہ مشاہدہ ان احکام میں سے ہے جنہیں صحابہ کرام نے عملی طور پر سیکھا اور امت تک پہنچایا۔",
                "یہ حکم اس بات کی دلیل ہے کہ نبی ﷺ کی سنت قولی اور فعلی دونوں طرح سے ہمارے لیے حجت ہے۔"
              ],
              "english": [
                "Amr ibn Kharija's narration of this incident indicates its importance as a legal precedent.",
                "This observation is among the rulings that the Companions learned practically and transmitted to the Ummah.",
                "This ruling proves that the Prophet's Sunnah, both verbal and practical, serves as legal evidence for us."
              ]
            }
          }
        ]
      }
    }
  ]
}
