{
  "hadithId": 5,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 1,
    "inKitabBab": 1,
    "arabicBook": "",
    "babId": 1
  },

  "takhreej": {
    "arabic": "صحيح. رواه مسلم (283). 1 - البخاري رقم (239) .2 - مسلم رقم (282).3 - سنن أبي داود (70)",
    "urdu": "یہ حدیث بخاری (239)، مسلم (282, 283)، اور ابوداؤد (70) میں مروی ہے۔",
    "english": "Narrated in al-Bukhari (239), Muslim (282, 283), and Abu Dawood (70)."
  },
  "importantWords": [
    {
      "arabic": "الْمَاءِ الدَّائِمِ",
      "english": "Stagnant water — water that does not flow.",
      "urdu": "ٹھہرا ہوا پانی — جو بہتا نہیں۔"
    },
    {
      "arabic": "جُنُبٌ",
      "english": "A person in a state of major impurity (after sexual activity).",
      "urdu": "جنبی — وہ شخص جو غسلِ جنابت کا محتاج ہو۔"
    }
  ],
  "summary": {
    "urdu": "حدیث میں حکم دیا گیا ہے کہ جنبی شخص کو ٹھہرے ہوئے پانی میں غسل نہیں کرنا چاہیے، کیونکہ اس سے پانی ناپاک ہو سکتا ہے۔",
    "english": "The Hadith forbids bathing in stagnant water while in a state of major impurity, as it may contaminate the water."
  },
  "references": [
    {
      "arabic": "(البخاري (239))، (مسلم (282, 283))، (أبو داود (70))",
      "english": "(Al-Bukhari (239)), (Muslim (282, 283)), (Abu Dawood (70))"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة رضي الله عنه",
        "english": "Abu Hurairah (may Allah be pleased with him)"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وضاحت 1",
        "english": "Explanation 1"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنبی کی حالت میں غسل",
              "english": "Bathing while in a state of major impurity"
            },
            "content": {
              "urdu": [
                "حدیث میں بتایا گیا ہے کہ جنبی شخص کو ٹھہرے ہوئے پانی میں غسل نہیں کرنا چاہیے۔",
                "اس کی وجہ یہ ہے کہ پانی ناپاک ہونے کا خدشہ ہوتا ہے۔",
                "اس سے نہ صرف پانی کی صفائی متاثر ہوتی ہے بلکہ دوسروں کے لیے بھی نقصان دہ ہو سکتا ہے۔"
              ],
              "english": [
                "The Hadith instructs that a person in a state of janabah should not bathe in stagnant water.",
                "The reason is that the water may become impure.",
                "This affects the cleanliness of the water and may harm others."
              ]
            }
          },
          {
            "title": {
              "urdu": "پانی کی اہمیت",
              "english": "Importance of water"
            },
            "content": {
              "urdu": [
                "پانی کی صفائی اور پاکیزگی کی حفاظت ضروری ہے۔",
                "مسلمانوں کو ہمیشہ پانی کی حفاظت اور صفائی پر توجہ دینی چاہیے۔",
                "حدیث یہ بتاتی ہے کہ پانی میں ناپاکی شامل نہیں ہونی چاہیے۔"
              ],
              "english": [
                "Preserving the cleanliness and purity of water is essential.",
                "Muslims should always be careful about protecting and keeping water clean.",
                "The Hadith shows that water should not be contaminated."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وضاحت 2",
        "english": "Explanation 2"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف روایات",
              "english": "Different narrations"
            },
            "content": {
              "urdu": [
                "بخاری میں پانی میں پیشاب نہ کرنے کی نصیحت آئی ہے۔",
                "مسلم میں جنبی شخص کے لئے غسل کرنے سے منع کیا گیا ہے۔",
                "ابوداؤد میں بھی اسی حوالے سے حدیث موجود ہے۔"
              ],
              "english": [
                "Bukhari narrates the prohibition of urinating in stagnant water.",
                "Muslim forbids bathing in stagnant water while in a state of janabah.",
                "Abu Dawood also reports a similar narration."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط کی تعلیم",
              "english": "Lesson of caution"
            },
            "content": {
              "urdu": [
                "حدیث ہمیں صاف پانی کے استعمال میں احتیاط سکھاتی ہے۔",
                "ہمیں چاہیے کہ پانی میں نجاست نہ ڈالیں۔",
                "یہ تعلیم معاشرتی اور دینی لحاظ سے اہم ہے۔"
              ],
              "english": [
                "The Hadith teaches caution regarding the use of clean water.",
                "We should not contaminate water with impurities.",
                "This teaching is important socially and religiously."
              ]
            }
          }
        ]
      }
    }
  ]
}
