{
  "hadithId": 1299,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["tirmidhi:1977"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب البر والصلة",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "حسن. رواه الترمذي (1977)، وأحمد (1/405)، والحاكم (1/12)، والبخاري في الأدب المفرد (312). وصححه ابن حبان (192).",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام ترمذی (1977)، امام احمد (1/405) اور امام حاکم (1/12) نے روایت کیا ہے۔ امام حاکم اور ابن حبان نے اسے صحیح قرار دیا ہے جبکہ امام ترمذی کے نزدیک یہ حسن ہے۔",
    "english": "Hasan (Good). Reported by At-Tirmidhi (1977), Ahmad (1/405), and Al-Hakim (1/12). Authenticated by Ibn Hibban (192) and Al-Hakim, while At-Tirmidhi classified it as Hasan."
  },
  "importantWords": [
    {
      "arabic": "الطَّعَّانِ",
      "english": "Defamer / Taunter",
      "urdu": "طعنہ دینے والا"
    },
    {
      "arabic": "اللَّعَّانُ",
      "english": "One who curses",
      "urdu": "لعنت کرنے والا"
    },
    {
      "arabic": "الْفَاحِشَ",
      "english": "The Obscene",
      "urdu": "فحش گو / بیہودہ"
    },
    {
      "arabic": "الْبَذِيءَ",
      "english": "The Shameless",
      "urdu": "بدزبان / بے حیا"
    },
    {
      "arabic": "الْمُؤْمِنُ",
      "english": "The Believer",
      "urdu": "ایمان والا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ایک سچے مومن کے اخلاق کا خلاصہ پیش کرتی ہے کہ وہ اپنی زبان کو طعن و تشنیع، لعنت ملامت اور فحش کلامی سے پاک رکھتا ہے۔",
    "english": "This Hadith outlines the moral character of a true believer, emphasizing that they keep their tongue free from defaming, cursing, and all forms of indecency."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1977)",
      "english": "Sunan at-Tirmidhi (1977)"
    },
    {
      "arabic": "مستدرك الحاكم (1/12)",
      "english": "Mustadrak al-Hakim (1/12)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود الهذلي",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9NOnXh6g5U",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زبان کی پاکیزگی",
        "english": "Purity of Speech"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طعنہ زنی کی ممانعت",
              "english": "Prohibition of Taunting"
            },
            "content": {
              "urdu": [
                "مومن دوسروں کے حسب و نسب یا عیبوں پر طعنہ نہیں دیتا۔",
                "طعنہ زنی سے دلوں میں نفرت اور معاشرے میں فساد پیدا ہوتا ہے۔",
                "کسی کی کمزوری کا مذاق اڑانا کبر اور اخلاقی پستی کی علامت ہے۔"
              ],
              "english": [
                "A believer does not taunt others regarding their lineage or faults.",
                "Taunting creates hatred in hearts and discord within society.",
                "Mocking someone's weakness is a sign of arrogance and moral decay."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کرنے سے پرہیز",
              "english": "Refraining from Cursing"
            },
            "content": {
              "urdu": [
                "مسلمان کو گالی دینا یا اس پر لعنت کرنا کبیرہ گناہوں میں سے ہے۔",
                "لعنت کا مطلب اللہ کی رحمت سے دوری کی بددعا دینا ہے۔",
                "کثرت سے لعنت کرنے والے قیامت کے دن شفاعت نہیں کر سکیں گے۔"
              ],
              "english": [
                "Abusing or cursing a Muslim is among the major sins in Islam.",
                "Cursing means invoking a distance from the mercy of Allah.",
                "Frequent cursers will not be intercessors on the Day of Resurrection."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حیا اور ایمان کا تعلق",
        "english": "The Link between Modesty and Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فحش گوئی کی مذمت",
              "english": "Condemnation of Obscenity"
            },
            "content": {
              "urdu": [
                "ایمان اور بے حیائی ایک جگہ کبھی جمع نہیں ہو سکتے۔",
                "فحش باتیں کرنے والے کو اللہ تعالیٰ سخت ناپسند فرماتا ہے۔",
                "زبان کی بیہودگی انسان کے وقار اور نورِ ایمان کو ختم کر دیتی ہے۔"
              ],
              "english": [
                "Faith and indecency can never coexist in the same heart.",
                "Allah detests those who engage in obscene and vulgar talk.",
                "Vulgarity of speech destroys one's dignity and the light of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا ایمان کا حصہ ہے",
              "english": "Modesty is Part of Faith"
            },
            "content": {
              "urdu": [
                "مومن کی پہچان اس کی حیا اور اس کی شائستہ گفتگو ہے۔",
                "جس میں حیا نہیں رہتی وہ ہر قسم کی برائی کرنے لگتا ہے۔",
                "حیا انسان کو گناہوں سے بچانے کے لیے ایک مضبوط ڈھال ہے۔"
              ],
              "english": [
                "A believer is recognized by his modesty and polite speech.",
                "When one loses modesty, they become prone to committing all evils.",
                "Modesty is a powerful shield that protects a person from sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Social Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی تعلقات کی مضبوطی",
              "english": "Strengthening Mutual Relations"
            },
            "content": {
              "urdu": [
                "بدزبانی ختم ہونے سے رشتوں میں مٹھاس اور بھروسہ پیدا ہوتا ہے۔",
                "اسلامی معاشرہ محبت، نرمی اور خوش اخلاقی پر مبنی ہونا چاہیے۔",
                "دوسروں کی عزت کا خیال رکھنا ہی اصل اخوت اور بھائی چارہ ہے۔"
              ],
              "english": [
                "Eliminating foul speech breeds sweetness and trust in relationships.",
                "An Islamic society should be based on love, kindness, and good manners.",
                "Respecting the honor of others is the essence of true brotherhood."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلاحِ کلام",
              "english": "Reformation of Speech"
            },
            "content": {
              "urdu": [
                "مومن صرف وہی بات کہتا ہے جو خیر اور بھلائی پر مبنی ہو۔",
                "غصے کے وقت بھی اپنی زبان پر قابو رکھنا کامل ایمان کی دلیل ہے۔",
                "اچھی گفتگو بہترین صدقہ ہے جو انسان کو جنت کے قریب کرتی ہے۔"
              ],
              "english": [
                "A believer only speaks words that are based on goodness and benefit.",
                "Controlling the tongue during anger is evidence of complete faith.",
                "Good speech is a great charity that brings one closer to Paradise."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محاسبہ نفس",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "اپنی روزمرہ گفتگو کا جائزہ لیں کہ کہیں ہم بدزبانی تو نہیں کر رہے۔",
                "اگر زبان سے غلط جملہ نکل جائے تو فوراً توبہ اور تلافی کریں۔",
                "دوسروں کی برائی کرنے کے بجائے اپنی اصلاح پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "Audit your daily speech to ensure you are not using foul language.",
                "If an incorrect sentence escapes your lips, repent and amend immediately.",
                "Focus on self-reform instead of focusing on the faults of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذکر و اذکار کی عادت",
              "english": "Habit of Dhikr"
            },
            "content": {
              "urdu": [
                "زبان کو لغو باتوں کے بجائے اللہ کے ذکر سے تر رکھنا چاہیے۔",
                "درود شریف اور استغفار کی کثرت زبان کو پاکیزہ بناتی ہے۔",
                "پاکیزہ گفتگو انسان کے باطن کی صفائی کا آئینہ دار ہوتی ہے۔"
              ],
              "english": [
                "Keep the tongue busy with Dhikr instead of idle and vain talk.",
                "Abundant Salawat and Istighfar purify the human tongue.",
                "Wholesome speech reflects the internal cleanliness of a person."
              ]
            }
          }
        ]
      }
    }
  ]
}