{
  "hadithId": 708,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/76"],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3357)، وأحمد (2/171)، والحاكم (2/56)، والبيهقي (5/287). وصححه الحاكم والذهبي، وحسنه الألباني. ",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابوداؤد (3357)، احمد، حاکم اور بیہقی نے روایت کیا ہے۔ امام حاکم اور ذہبی نے اسے صحیح قرار دیا ہے، جبکہ علامہ البانی نے اسے حسن کہا ہے۔",
    "english": "Hasan. Reported by Abu Dawud (3357), Ahmad (2/171), Al-Hakim (2/56), and Al-Bayhaqi (5/287). Al-Hakim and Adh-Dhahabi graded it Sahih, while Al-Albani graded it Hasan."
  },
  "importantWords": [
    {
      "arabic": "يُجَهِّزَ",
      "english": "To equip / prepare",
      "urdu": "تیار کرنا / لیس کرنا"
    },
    {
      "arabic": "نَفِدَتْ",
      "english": "Exhausted / Run out",
      "urdu": "ختم ہو گئے"
    },
    {
      "arabic": "قَلَائِصِ",
      "english": "Young she-camels",
      "urdu": "جوان اونٹنیاں"
    },
    {
      "arabic": "الصَّدَقَةِ",
      "english": "Zakat / Alms",
      "urdu": "صدقہ یا زکوٰۃ"
    },
    {
      "arabic": "ادھار",
      "english": "On credit",
      "urdu": "نسیئہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ اگر جانوروں کی نسل یا معیار مختلف ہو تو ایک اونٹ کے بدلے دو اونٹ ادھار پر لینا جائز ہے، خاص طور پر عوامی یا حکومتی ضرورت کے وقت۔",
    "english": "This Hadith demonstrates the permissibility of exchanging one animal for two on credit if they differ in quality or species, especially for public welfare or state needs."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب البيوع",
      "english": "Sunan Abi Dawud, Book of Sales"
    },
    {
      "arabic": "مستدرك الحاكم، كتاب البيوع",
      "english": "Mustadrak al-Hakim, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah ibn Amr ibn al-As"
      },
      "slug": "abdullah-ibn-amr-ibn-al-as"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جانوروں میں ربا (سود) کا مسئلہ",
        "english": "Issue of Riba in Animals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کمی بیشی کا جواز",
              "english": "Permissibility of Excess"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک جانور 'ربوی اجناس' (سونا، چاندی، غلہ) میں شامل نہیں ہیں۔",
                "اس لیے ایک اونٹ کے بدلے دو اونٹ لینا شرعاً سود نہیں کہلاتا۔",
                "یہ اس وقت جائز ہے جب جانوروں کی عمر، نسل یا معیار میں فرق ہو۔"
              ],
              "english": [
                "Most jurists agree that animals are not Ribawi commodities (like gold or grain).",
                "Therefore, exchanging one camel for two is not considered usury (Riba).",
                "This is permissible when there is a difference in age, breed, or quality."
              ]
            }
          },
          {
            "title": {
              "urdu": "ادھار کا پہلو",
              "english": "The Aspect of Credit"
            },
            "content": {
              "urdu": [
                "یہ حدیث پچھلی ان احادیث کی وضاحت کرتی ہے جہاں جانوروں کے ادھار تبادلے سے منع کیا گیا۔",
                "ممانعت تب ہے جب دونوں طرف سے ادھار ہو (بیع کالی بکالی)۔",
                "اگر ایک طرف سے نقد ہو اور دوسری طرف سے ادھار (جیسا کہ یہاں تھا) تو یہ جائز ہے۔"
              ],
              "english": [
                "This Hadith clarifies previous narrations that forbade animal-for-animal credit.",
                "The prohibition applies when both sides are delayed (debt for debt).",
                "If one side is immediate and the other is on credit (as seen here), it is allowed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ریاستی اور عوامی ضروریات",
        "english": "State and Public Needs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لشکر کی تیاری",
              "english": "Equipping the Army"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے دفاعی ضرورت کے لیے ادھار پر جانور لینے کی اجازت دی۔",
                "حکومت عوامی مفاد میں مستقبل میں آنے والی زکوٰۃ کو بطور ضمانت استعمال کر سکتی ہے۔",
                "اس سے ثابت ہوتا ہے کہ بیت المال کے معاملات میں لچک موجود ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) allowed taking animals on credit for defense purposes.",
                "The state can use future Zakat revenues as a guarantee for public welfare.",
                "This proves flexibility exists in the management of the public treasury (Bayt al-Mal)."
              ]
            }
          },
          {
            "title": {
              "urdu": "زکوٰۃ کے مال کا مصرف",
              "english": "Utility of Zakat Property"
            },
            "content": {
              "urdu": [
                "صدقہ کے اونٹ ابھی وصول نہیں ہوئے تھے مگر ان کا وعدہ کر لیا گیا۔",
                "مستقبل کے اثاثوں کی بنیاد پر معاہدہ کرنا مخصوص حالات میں درست ہے۔",
                "یہ انتظام مسلمانوں کی طاقت اور دفاع کو مضبوط بنانے کے لیے کیا گیا تھا۔"
              ],
              "english": [
                "The Zakat camels hadn't been collected yet, but they were promised in a deal.",
                "Contracting based on future assets is valid under specific circumstances.",
                "This arrangement was made to strengthen the military power and defense of Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعارض کا حل",
              "english": "Resolving Conflict between Hadiths"
            },
            "content": {
              "urdu": [
                "سمرہ بن جندب کی حدیث (منع) اور اس حدیث (جواز) میں مطابقت ضروری ہے۔",
                "منع وہاں ہے جہاں مقصد سٹہ بازی یا غیر یقینی نفع ہو (غرر)۔",
                "جواز وہاں ہے جہاں ضرورت ہو اور قیمت و وقت واضح طور پر طے ہو۔"
              ],
              "english": [
                "The Hadith of Samurah (prohibition) and this Hadith (permissibility) must be reconciled.",
                "Prohibition applies to speculative deals or extreme uncertainty (Gharar).",
                "Permissibility applies when there is a need and terms are clearly defined."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرضِ حسنہ اور تجارت",
              "english": "Good Loans and Trade"
            },
            "content": {
              "urdu": [
                "ایک کے بدلے دو لینا سود تب ہوتا ہے جب وہ قرض (Loan) ہو اور نفع کی شرط ہو۔",
                "تجارت (Sale/Exchange) میں معیار کے فرق کی وجہ سے مقدار کا فرق جائز ہے۔",
                "اسلامی قانون میں 'قرض' اور 'بیع' کے درمیان باریک فرق کو سمجھنا لازمی ہے۔"
              ],
              "english": [
                "Taking two for one is Riba in a loan context with a stipulated benefit.",
                "In a trade/exchange context, quantity differences are allowed due to quality.",
                "Understanding the subtle difference between a 'Loan' and a 'Sale' is vital in Sharia."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظامِ زکوٰۃ کی اہمیت",
              "english": "Importance of the Zakat System"
            },
            "content": {
              "urdu": [
                "زکوٰۃ صرف غرباء کی امداد نہیں بلکہ ریاست کی مضبوطی کا ذریعہ بھی ہے۔",
                "زکوٰۃ کے نظام کو منظم کر کے معاشی بحرانوں کا حل نکالا جا سکتا ہے۔",
                "ایک دیانتدار حکومت عوامی مال کی بہتر محافظ ہوتی ہے۔"
              ],
              "english": [
                "Zakat is not just for the poor; it is a means of strengthening the state.",
                "Economic crises can be solved by properly organizing the Zakat system.",
                "An honest government is the best guardian of public wealth."
              ]
            }
          },
          {
            "title": {
              "urdu": "دفاعِ وطن",
              "english": "Defense of the Motherland"
            },
            "content": {
              "urdu": [
                "دفاعی مقاصد کے لیے ہنگامی بنیادوں پر فیصلے لینا سنتِ نبوی سے ثابت ہے۔",
                "اسلامی ریاست کی حفاظت کے لیے مالی قربانی اور بہتر حکمتِ عملی ضروری ہے۔",
                "ہر مسلمان کو دین کی سربلندی کے لیے اپنا مال اور وقت وقف کرنے کو تیار رہنا چاہیے۔"
              ],
              "english": [
                "Taking emergency measures for defense is established from Prophetic practice.",
                "Financial sacrifice and sound strategy are essential for protecting the state.",
                "Every Muslim should be ready to dedicate wealth and time for the cause of Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}