{
  "hadithId": 487,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1464",
      "https://sunnah.com/muslim:982"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1463، 1464) ومسلم (982). والحديث أصل في أن أموال القنية (الاستعمال الشخصي) لا زكاة فيها.",
    "urdu": "یہ حدیث صحیح ہے اور اسے بخاری (1464) اور مسلم (982) نے روایت کیا ہے۔ یہ حدیث اس بات کی بنیادی دلیل ہے کہ ذاتی استعمال کی اشیاء پر زکوٰۃ نہیں ہوتی۔",
    "english": "Authentic. Reported by Al-Bukhari (1464) and Muslim (982). This Hadith is a primary evidence that Zakat is not due on items kept for personal use (Qunyah)."
  },
  "importantWords": [
    {
      "arabic": "عَبْدِهِ",
      "english": "His slave",
      "urdu": "اس کا غلام"
    },
    {
      "arabic": "فَرَسِهِ",
      "english": "His horse",
      "urdu": "اس کا گھوڑا"
    },
    {
      "arabic": "صَدَقَةٌ",
      "english": "Charity (Zakat)",
      "urdu": "صدقہ / زکوٰۃ"
    },
    {
      "arabic": "صَدَقَةُ اَلْفِطْرِ",
      "english": "Sadaqat-ul-Fitr",
      "urdu": "صدقہ فطر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ وہ مال جو ذاتی ضرورت کے لیے ہو (جیسے سواری کے جانور یا خادم)، اس پر سالانہ زکوٰۃ واجب نہیں ہوتی، البتہ غلام کی طرف سے صدقہ فطر ادا کرنا مالک کی ذمہ داری ہے۔",
    "english": "This Hadith clarifies that Zakat is not due on assets kept for personal use (like riding animals or servants), although Sadaqat-ul-Fitr remains obligatory for a slave, to be paid by the owner."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1464)",
      "english": "Sahih al-Bukhari (1464)"
    },
    {
      "arabic": "صحيح مسلم (982)",
      "english": "Sahih Muslim (982)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_R_AAnM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ذاتی استعمال کے اموال پر زکوٰۃ کا حکم",
        "english": "Zakat on Personal Assets"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاجتِ اصلیہ کی رعایت",
              "english": "Consideration of Basic Needs"
            },
            "content": {
              "urdu": [
                "اسلامی قانونِ زکوٰۃ میں انسان کی بنیادی ضروریات کو زکوٰۃ سے مستثنیٰ رکھا گیا ہے۔",
                "گھوڑا (سواری) اور غلام (خادم) اس دور کی اہم ضروریات میں شامل تھے۔",
                "موجودہ دور میں ذاتی گاڑی، گھر، اور گھریلو سامان پر بھی اسی اصول کے تحت زکوٰۃ نہیں ہے۔"
              ],
              "english": [
                "In Islamic Zakat law, basic human needs are exempt from Zakat.",
                "A horse (for riding) and a slave (for service) were essential needs of that era.",
                "In modern times, personal cars, houses, and furniture are exempt under the same principle."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالِ نامی اور مالِ قنیہ",
              "english": "Productive vs. Personal Assets"
            },
            "content": {
              "urdu": [
                "زکوٰۃ اس مال پر ہوتی ہے جو بڑھنے والا ہو (جیسے تجارت کا مال یا چرنے والے جانور)۔",
                "جو مال محض استعمال کے لیے ہو اور اس سے منافع کمانا مقصود نہ ہو، وہ زکوٰۃ سے آزاد ہے۔",
                "البتہ اگر گھوڑے یا غلام تجارت کی نیت سے خریدے جائیں تو ان کی مالیت پر زکوٰۃ ہوگی۔"
              ],
              "english": [
                "Zakat is due on productive wealth (like trade goods or pasturing livestock).",
                "Wealth kept solely for use, not for profit, is free from Zakat.",
                "However, if horses or slaves are kept for trade, Zakat is due on their value."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلام اور صدقہ فطر",
        "english": "Slaves and Sadaqat-ul-Fitr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطرانہ کی ادائیگی",
              "english": "Payment of Fitrana"
            },
            "content": {
              "urdu": [
                "مسلم کی روایت واضح کرتی ہے کہ غلام پر سالانہ زکوٰۃ نہیں، مگر عید الفطر پر فطرانہ واجب ہے۔",
                "غلام کی طرف سے فطرانہ دینا اس کے مالک کی ذمہ داری ہے۔",
                "یہ اس بات کی دلیل ہے کہ صدقہ فطر بدن کی زکوٰۃ ہے، مال کی نہیں۔"
              ],
              "english": [
                "Muslim's narration clarifies that slaves are subject to Fitrana, not annual Zakat.",
                "The owner is responsible for paying the Fitrana on behalf of the slave.",
                "This proves that Sadaqat-ul-Fitr is a Zakat on the body, not on wealth."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی حقوق کی تکریم",
              "english": "Respect for Human Rights"
            },
            "content": {
              "urdu": [
                "غلام کو مالِ تجارت کے بجائے انسان تسلیم کرتے ہوئے اس پر زکوٰۃ معاف کی گئی۔",
                "یہ حکم اس وقت کے غلامی کے نظام میں غلاموں پر بوجھ کم کرنے کی ایک صورت تھی۔",
                "اسلام نے تدریجی طور پر غلامی کے خاتمے اور خادموں کے حقوق کے تحفظ پر زور دیا۔"
              ],
              "english": [
                "Exempting slaves from Zakat recognizes them as humans rather than mere trade commodities.",
                "This ruling lightened the burden within the historical system of slavery.",
                "Islam emphasized the gradual abolition of slavery and protection of servants' rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات",
        "english": "Juristic Details"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھوڑوں کی زکوٰۃ پر ائمہ کا اختلاف",
              "english": "Difference on Zakat for Horses"
            },
            "content": {
              "urdu": [
                "امام شافعی، مالک اور احمد کے نزدیک گھوڑوں پر زکوٰۃ نہیں ہے (اس حدیث کی بنا پر)۔",
                "امام ابوحنیفہ کے نزدیک اگر گھوڑے افزائشِ نسل کے لیے پالے جائیں تو زکوٰۃ واجب ہو سکتی ہے۔",
                "جمہور کے نزدیک یہ حدیث عام ہے اور گھوڑوں کو زکوٰۃ سے مستثنیٰ قرار دیتی ہے۔"
              ],
              "english": [
                "Imams Shafi'i, Malik, and Ahmad hold that horses are exempt based on this Hadith.",
                "Imam Abu Hanifa views that Zakat may be due if horses are kept for breeding.",
                "The majority consider this Hadith general, exempting horses from Zakat."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت کی تبدیلی کا اثر",
              "english": "Effect of Change in Intention"
            },
            "content": {
              "urdu": [
                "اگر کوئی چیز ذاتی استعمال سے نکال کر تجارت کے لیے رکھ دی جائے تو اس پر زکوٰۃ شروع ہو جاتی ہے۔",
                "نیت کا بدلنا نصاب اور سال کے حساب کو متاثر کرتا ہے۔",
                "مسلمان کو اپنے مال کی نوعیت کے بارے میں دیانتدار رہنا چاہیے۔"
              ],
              "english": [
                "If an item is moved from personal use to trade, Zakat becomes applicable.",
                "A change in intention affects the calculation of Nisab and the lunar year.",
                "A Muslim must remain honest regarding the nature of their assets."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شریعت کی آسانی",
              "english": "Ease of Shariah"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے دین میں تنگی نہیں رکھی، ضرورت کے اموال کو معاف فرمایا۔",
                "زکوٰۃ صرف اس مال پر ہے جو ضرورت سے زائد اور نفع بخش ہو۔",
                "یہ اعتدال اسلامی معاشی نظام کا حسن ہے۔"
              ],
              "english": [
                "Allah has not placed hardship in religion, exempting necessary assets.",
                "Zakat is only on wealth that is surplus and productive.",
                "This moderation is the beauty of the Islamic economic system."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کی پاکیزگی",
              "english": "Purification of Wealth"
            },
            "content": {
              "urdu": [
                "زکوٰۃ ادا کرنے سے باقی مال میں برکت اور دل میں سکون پیدا ہوتا ہے۔",
                "فرائض کی ادائیگی اللہ کے قرب کا ذریعہ ہے۔",
                "مسلمان کو چاہیے کہ وہ زکوٰۃ کے احکام کو تفصیل سے سیکھے۔"
              ],
              "english": [
                "Paying Zakat brings blessings to remaining wealth and peace to the heart.",
                "Fulfilling obligations is a means of proximity to Allah.",
                "A Muslim should learn the detailed rulings of Zakat."
              ]
            }
          }
        ]
      }
    }
  ]
}