{
  "hadithId": 1060,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/10/8"],
    "kitabId": 10,
    "inKitabBab": 3,
    "arabicBook": "كتاب الحدود",
    "babId": 86
  },
 
  "takhreej": {
    "arabic": "أخرجه النسائي في الكبرى (7360) وفي المجتبى (4970)، وقال: هذا حديث منقطع. وأبو حاتم الرازي في العلل (1312) وقال: هو منكر.",
    "urdu": "اسے نسائی نے الکبریٰ (7360) اور المجتبیٰ (4970) میں روایت کیا اور اسے منقطع قرار دیا۔ ابوحاتم رازی نے العلل (1312) میں اسے منکر کہا ہے۔",
    "english": "Reported by An-Nasa'i in Al-Kubra (7360) and Al-Mujtaba (4970), stating it is Munqati'. Abu Hatim Al-Razi classified it as Munkar in Al-Ilal (1312)."
  },
  "importantWords": [
    {
      "arabic": "لَا يَغْرَمُ",
      "english": "Shall not be fined",
      "urdu": "تاوان نہیں بھرے گا"
    },
    {
      "arabic": "السَّارِقُ",
      "english": "The thief",
      "urdu": "چور"
    },
    {
      "arabic": "أُقِيمَ",
      "english": "Established/Carried out",
      "urdu": "قائم کی گئی"
    },
    {
      "arabic": "الْحَدُّ",
      "english": "Legal punishment",
      "urdu": "شرعی سزا"
    },
    {
      "arabic": "مُنْقَطِعٌ",
      "english": "Broken chain",
      "urdu": "ٹوٹی ہوئی سند"
    },
    {
      "arabic": "مُنْكَرٌ",
      "english": "Rejected narration",
      "urdu": "رد کی ہوئی روایت"
    }
  ],
  "summary": {
    "urdu": "اس روایت میں یہ بیان کیا گیا ہے کہ چور پر حد لگنے کے بعد اس سے مال کا تاوان نہیں لیا جائے گا، مگر یہ حدیث سند کے لحاظ سے ضعیف ہے۔",
    "english": "This narration suggests that a thief is exempt from repaying stolen property once the physical punishment is applied; however, the narration is weak."
  },
  "references": [
    {
      "arabic": "سنن النسائي (4970)",
      "english": "Sunan an-Nasa'i (4970)"
    },
    {
      "arabic": "بلوغ المرام (1236)",
      "english": "Bulugh al-Maram (1236)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الرحمن بن عوف",
        "english": "Abdur-Rahman bin 'Auf"
      },
      "slug": "abdur-rahman-bin-auf"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "ضعيف (منكر ومنقطع)",
    "english": "Da'if (Munkar and Munqati')"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی قانونی حیثیت",
        "english": "Legal Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری",
              "english": "Weakness of the Chain"
            },
            "content": {
              "urdu": [
                "امام نسائی نے صراحت کی ہے کہ یہ روایت منقطع ہے یعنی سند درمیان سے ٹوٹی ہوئی ہے۔",
                "امام ابوحاتم نے اسے منکر قرار دیا ہے جس کا مطلب ہے کہ یہ ثقہ راویوں کے خلاف ہے۔",
                "ضعیف ہونے کی وجہ سے اس حدیث سے شرعی مسئلہ اخذ نہیں کیا جا سکتا۔"
              ],
              "english": [
                "Imam Nasa'i clarified that this narration is Munqati', meaning the chain is broken.",
                "Imam Abu Hatim classified it as Munkar, meaning it contradicts reliable narrations.",
                "Due to its weakness, this Hadith cannot be used to derive definitive Shariah rulings."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور علماء کا موقف",
              "english": "Position of the Majority"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک چور پر حد (ہاتھ کاٹنا) اور مال کی واپسی دونوں لازم ہیں۔",
                "اگر چوری شدہ مال موجود ہو تو اسے ہر صورت میں واپس کرنا واجب ہے۔",
                "سزا ملنے کا مطلب یہ نہیں کہ دوسرے کا مالی حق ساقط ہو جائے۔"
              ],
              "english": [
                "The majority of jurists hold that both the punishment and restoration of property are required.",
                "If the stolen property is still available, it must be returned under all circumstances.",
                "Receiving the legal punishment does not waive the financial rights of the victim."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق اللہ اور حق العبد",
              "english": "Rights of Allah vs. Rights of People"
        },
            "content": {
              "urdu": [
                "چوری میں حد کا نفاذ اللہ کا حق ہے تاکہ معاشرے میں امن قائم رہے۔",
                "مال کی واپسی بندے کا حق ہے جو کہ سزا پانے سے ختم نہیں ہوتا۔",
                "اسلامی قانون میں دونوں حقوق کی ادائیگی کو اہمیت دی گئی ہے۔"
              ],
              "english": [
                "Executing the Hadud for theft is a Right of Allah to maintain social peace.",
                "Returning the stolen wealth is a Right of the Servant, which punishment doesn't erase.",
                "Islamic law emphasizes the fulfillment of both types of rights simultaneously."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام شافعی کا استدلال",
              "english": "Reasoning of Imam Shafi'i"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک چور کو ہر حال میں مال کا ضمان دینا پڑے گا۔",
                "اگر مال ضائع ہو گیا ہو تو اس کی قیمت ادا کرنا چور کے ذمے رہے گا۔",
                "یہ موقف عدل و انصاف کے تقاضوں کے عین مطابق ہے۔"
              ],
              "english": [
                "According to Imam Shafi'i, the thief must provide compensation in all cases.",
                "If the property is destroyed, the thief remains liable for its monetary value.",
                "This position aligns perfectly with the requirements of justice and equity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Social Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مظلوم کی داد رسی",
              "english": "Redress for the Victim"
            },
            "content": {
              "urdu": [
                "صرف سزا سے مظلوم کا مالی نقصان پورا نہیں ہوتا جس سے بے چینی بڑھ سکتی ہے۔",
                "مال کی واپسی سے مظلوم کو قلبی اطمینان اور انصاف کا احساس ہوتا ہے۔",
                "اسلامی نظام عدل مظلوم کے حقوق کے تحفظ کی ضمانت دیتا ہے۔"
              ],
              "english": [
                "Punishment alone does not compensate the victim's financial loss, leading to unrest.",
                "The return of property provides the victim with peace of mind and a sense of justice.",
                "The Islamic judicial system guarantees the protection of the victim's rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "جرائم کا سدباب",
              "english": "Prevention of Crimes"
            },
            "content": {
              "urdu": [
                "اگر چور کو پتہ ہو کہ مال واپس نہیں کرنا پڑے گا تو وہ جرم پر دلیر ہوگا۔",
                "سزا اور جرمانے کا دوہرا خوف جرائم کی شرح کو کم کرنے میں مدد دیتا ہے۔",
                "یہ دوہرا نظام معاشرے میں عبرت کا نشان بنتا ہے۔"
              ],
              "english": [
                "If a thief knows property needn't be returned, they might become bolder in crime.",
                "The dual fear of punishment and fine helps in reducing the overall crime rate.",
                "This double-layered system serves as a powerful deterrent in the community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی نکات",
        "english": "Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علم الحدیث کی اہمیت",
              "english": "Importance of Hadith Science"
            },
            "content": {
              "urdu": [
                "اس حدیث سے معلوم ہوتا ہے کہ محدثین نے روایات کی چھان پھٹک میں کتنی محنت کی۔",
                "سند کا منقطع ہونا روایت کو استدلال کے لیے ناقابل قبول بنا دیتا ہے۔",
                "ہمیں صرف مستند اور صحیح احادیث پر ہی عمل کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith shows how rigorously scholars scrutinized narrations for authenticity.",
                "A break in the chain (Munqati') makes a narration unacceptable for legal proof.",
                "We must strictly follow only authentic and Sahih Hadith for religious practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت کی اہمیت",
              "english": "Value of Trust"
            },
            "content": {
              "urdu": [
                "اسلام دوسروں کے مال کو ناحق کھانے سے سختی سے منع کرتا ہے۔",
                "چوری ایک کبیرہ گناہ ہے جو دنیا اور آخرت دونوں میں رسوائی کا سبب ہے۔",
                "معاشرے کے ہر فرد کو دوسرے کی ملکیت کا احترام کرنا چاہیے۔"
              ],
              "english": [
                "Islam strictly forbids consuming the wealth of others through wrongful means.",
                "Theft is a major sin that causes disgrace in both this world and the Hereafter.",
                "Every member of society must respect the private property of others."
              ]
            }
          }
        ]
      }
    }
  ]
}