{
  "hadithId": 444,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/20"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },

  "takhreej": {
    "arabic": "حسن. رواه الدارقطني (2/79) والبيهقي (3/396). وله شواهد تقويه، منها فعل أبي بكر الصديق رضي الله عنه حين غسلته زوجته أسماء.",
    "urdu": "حسن۔ اسے دارقطنی (2/79) اور بیہقی (3/396) نے روایت کیا ہے۔ اس کے شواہد موجود ہیں، جیسا کہ سیدنا ابوبکر صدیق رضی اللہ عنہ کو ان کی وفات پر ان کی اہلیہ اسماء بنت عمیس نے غسل دیا تھا۔",
    "english": "Hasan (Good). Reported by Ad-Daraqutni (2/79) and Al-Bayhaqi (3/396). It has supporting evidences, including the fact that Abu Bakr (RA) was washed by his wife Asma'."
  },
  "importantWords": [
    {
      "arabic": "أَوْصَتْ",
      "english": "Bequeathed / Made a will",
      "urdu": "وصیت کی"
    },
    {
      "arabic": "يُغَسِّلَهَا",
      "english": "Wash her",
      "urdu": "اسے غسل دے"
    },
    {
      "arabic": "عَلَيْهَا اَلسَّلَامُ",
      "english": "Peace be upon her",
      "urdu": "ان پر سلام ہو"
    },
    {
      "arabic": "رَضِيَ اَللَّهُ",
      "english": "May Allah be pleased with him",
      "urdu": "اللہ ان سے راضی ہو"
    },
    {
      "arabic": "زَوْج",
      "english": "Spouse / Husband",
      "urdu": "شوہر"
    }
  ],
  "summary": {
    "urdu": "میاں بیوی کا ایک دوسرے کو غسل دینا شرعاً جائز ہے، جیسا کہ سیدہ فاطمہ رضی اللہ عنہا کی وصیت اور سیدنا علی رضی اللہ عنہ کے عمل سے ثابت ہے۔",
    "english": "It is religiously permissible for spouses to wash each other after death, as proven by the will of Fatimah (RA) and the action of 'Ali (RA)."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني، كتاب الجنائز، رقم 1876",
      "english": "Sunan ad-Daraqutni, Book of Funerals, Hadith 1876"
    },
    {
      "arabic": "السنن الكبرى للبيهقي، رقم 6620",
      "english": "As-Sunan al-Kubra by al-Bayhaqi, Hadith 6620"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أسماء بنت عميس",
        "english": "Asma' bint 'Umais"
      },
      "slug": "asma-bint-umais"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "میاں بیوی کا ایک دوسرے کو غسل دینا",
        "english": "Spouses Washing Each Other"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی جواز",
              "english": "Religious Permissibility"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک شوہر اپنی بیوی کو اور بیوی اپنے شوہر کو غسل دے سکتی ہے۔",
                "سیدہ فاطمہ کی وصیت اس بات کی قطعی دلیل ہے کہ وفات سے نکاح کا تعلق مکمل ختم نہیں ہوتا۔",
                "نبی کریم ﷺ نے سیدہ عائشہ سے فرمایا تھا کہ اگر تم مجھ سے پہلے وفات پاؤ تو میں تمہیں غسل دوں گا۔"
              ],
              "english": [
                "The majority of jurists agree that a husband can wash his wife and vice versa.",
                "Fatimah's (RA) will is a definitive proof that the marital bond's sanctity remains after death.",
                "The Prophet (ﷺ) told 'Aishah that if she died before him, he would wash her himself."
              ]
            }
          },
          {
            "title": {
              "urdu": "پردے اور حیا کا تحفظ",
              "english": "Protection of Privacy and Modesty"
            },
            "content": {
              "urdu": [
                "میاں بیوی کے درمیان زندگی میں کوئی پردہ نہیں ہوتا، اس لیے غسل میں یہ سب سے زیادہ موزوں ہیں۔",
                "اجنبی غسل دینے والوں کی نسبت شوہر یا بیوی میت کے جسمانی اسرار کی بہتر حفاظت کر سکتے ہیں۔",
                "اسلام نے میت کی حرمت اور پردے کو ہر حال میں مقدم رکھنے کی تعلیم دی ہے۔"
              ],
              "english": [
                "Spouses have no privacy barriers in life, making them most suitable for this final service.",
                "Compared to strangers, a spouse can better safeguard the physical privacy of the deceased.",
                "Islam teaches that the dignity and privacy of the deceased must be prioritized at all times."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدہ فاطمہ رضی اللہ عنہا کی وصیت",
        "english": "The Will of Fatimah (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ بیت کا نمونہ",
              "english": "Example of the Ahl al-Bayt"
            },
            "content": {
              "urdu": [
                "سیدہ فاطمہ کی وصیت سے ثابت ہوتا ہے کہ نیک خواتین اپنے معاملات میں خود فیصلہ کر سکتی ہیں۔",
                "سیدنا علی رضی اللہ عنہ نے اس وصیت پر عمل کر کے سنتِ صحابہ کو واضح فرمایا۔",
                "اہلِ بیت کے اعمال امت کے لیے تقویٰ اور شرعی احکامات کی بہترین تشریح ہیں۔"
              ],
              "english": [
                "Fatimah's (RA) will proves that righteous women can make decisions regarding their own rites.",
                "By fulfilling this will, 'Ali (RA) clarified the practice and approval of the Sahaba.",
                "The actions of the Ahl al-Bayt serve as an excellent explanation of Sharia for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبت اور رفاقت کا اظہار",
              "english": "Expression of Love and Companionship"
            },
            "content": {
              "urdu": [
                "آخری وقت میں شوہر کا غسل دینا میاں بیوی کے گہرے تعلق اور وفاداری کی علامت ہے۔",
                "یہ عمل ظاہر کرتا ہے کہ اسلام میں نکاح کا رشتہ صرف دنیاوی نہیں بلکہ برزخی بھی ہے۔",
                "سیدہ فاطمہ چاہتی تھیں کہ ان کے پردے کا سب سے زیادہ خیال ان کا شریکِ حیات رکھے۔"
              ],
              "english": [
                "A husband washing his wife is a sign of deep marital bonding and lifelong loyalty.",
                "This act shows that in Islam, marriage is not just worldly but carries over to the Barzakh.",
                "Fatimah (RA) desired that her privacy be maintained by her life partner above all others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات اور ترجیح",
        "english": "Juristic Differences and Preference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیگر مکاتبِ فکر کی رائے",
              "english": "Views of Other Schools of Thought"
            },
            "content": {
              "urdu": [
                "بعض فقہاء کے نزدیک وفات سے نکاح ٹوٹ جاتا ہے، اس لیے وہ غسل کی اجازت نہیں دیتے۔",
                "تاہم، احادیثِ صحیحہ اور عملِ صحابہ کی روشنی میں اجازت دینے والا موقف زیادہ قوی ہے۔",
                "سیدنا ابوبکر صدیق کی اہلیہ نے انہیں غسل دیا اور کسی صحابی نے اس پر اعتراض نہیں کیا۔"
              ],
              "english": [
                "Some jurists believe death terminates marriage and thus do not permit the husband to wash her.",
                "However, in light of Sahih Hadiths and Sahaba's practice, the permissive view is stronger.",
                "Abu Bakr's wife washed him, and no Companion objected to this practice at the time."
              ]
            }
          },
          {
            "title": {
              "urdu": "وصیت کی اہمیت",
              "english": "Importance of the Will"
            },
            "content": {
              "urdu": [
                "اگر میت نے غسل دینے والے کے بارے میں وصیت کی ہو تو اس پر عمل کرنا مستحب ہے۔",
                "وصیت کے ذریعے انسان اپنے آخری سفر کے انتظامات میں طہارت اور پردے کو یقینی بناتا ہے۔",
                "اسلام میں جائز وصیت کو پورا کرنا ورثاء کی اخلاقی اور شرعی ذمہ داری ہے۔"
              ],
              "english": [
                "If the deceased has made a will regarding who should wash them, fulfilling it is recommended.",
                "Through a will, a person ensures purity and privacy in their final journey arrangements.",
                "Fulfilling a permissible will is a moral and religious responsibility of the surviving heirs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت کے آداب",
              "english": "Etiquettes of Purity"
            },
            "content": {
              "urdu": [
                "غسل دینے والے کو چاہیے کہ وہ میت کے ساتھ نہایت نرمی اور احترام کا معاملہ کرے۔",
                "میت کے جسمانی عیوب کو چھپانا اور صرف خیر کی باتیں کرنا واجب ہے۔",
                "سنتِ نبوی کے مطابق غسل کے تمام مراحل کو مکمل کرنا اجرِ عظیم کا باعث ہے۔"
              ],
              "english": [
                "The person washing the deceased should act with utmost gentleness and respect.",
                "Concealing the physical defects of the deceased and speaking only good is obligatory.",
                "Completing all stages of the wash according to the Sunnah brings immense reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی تعلقات کی مضبوطی",
              "english": "Strengthening Family Bonds"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ مشکل وقت میں خاندان کے قریبی افراد ہی سہارا ہوتے ہیں۔",
                "میاں بیوی کے تعلق میں ایک دوسرے کی عزت کا خیال آخری سانس کے بعد بھی ضروری ہے۔",
                "اسلامی معاشرت میں باہمی خدمت اور ایثار ہی گھرانے کی بنیاد ہے۔"
              ],
              "english": [
                "This Hadith teaches us that close family members are the primary support in difficult times.",
                "Respect for each other in a marriage must continue even after the final breath.",
                "In Islamic society, mutual service and sacrifice are the foundations of a household."
              ]
            }
          }
        ]
      }
    }
  ]
}