{
  "hadithId": 1040,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1247"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },

  "takhreej": {
    "arabic": "رواه أبو داود (4473) مرفوعاً، ومسلم (1705) موقوفاً. والمرسل في هذا أقوى، لكن المعنى ثابت ومؤيد بأفعال الصحابة.",
    "urdu": "اسے ابوداؤد نے مرفوعاً بیان کیا ہے، جبکہ امام مسلم نے اسے موقوفاً (حضرت علی کا قول) روایت کیا ہے۔ اس کی سند میں کچھ کلام ہے مگر اس کا مفہوم صحابہ کے عمل سے ثابت ہے۔",
    "english": "Reported by Abu Dawud (4473) as Marfu' and by Muslim (1705) as Mauquf. While there is discussion on the chain, its legal implication is established by the practice of the Companions."
  },
  "importantWords": [
    {
      "arabic": "أَقِيمُوا",
      "english": "Establish / Implement",
      "urdu": "قائم کرو / نافذ کرو"
    },
    {
      "arabic": "اَلْحُدُودَ",
      "english": "Legal penalties",
      "urdu": "شرعی سزائیں / حدود"
    },
    {
      "arabic": "مَلَكَتْ أَيْمَانُكُمْ",
      "english": "Your slaves",
      "urdu": "تمہارے لونڈی غلام"
    },
    {
      "arabic": "أَرِقَّائِكُمْ",
      "english": "Your bondmen",
      "urdu": "تمہارے غلاموں"
    },
    {
      "arabic": "مَوْقُوفٌ",
      "english": "Stopped at a Companion",
      "urdu": "صحابی کا قول"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غلاموں اور لونڈیوں پر جرائم کی صورت میں شرعی سزاؤں کے نفاذ کا حکم دیتی ہے، اور واضح کرتی ہے کہ ان کی حیثیت بھی قانونی جوابدہی میں آزاد انسانوں کی طرح ہے (اگرچہ سزا کی مقدار میں فرق ہو سکتا ہے)۔",
    "english": "This Hadith mandates the implementation of Shariah penalties on slaves for their crimes, establishing that they are legally accountable, although the magnitude of penalties might differ from free persons."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4473)",
      "english": "Sunan Abu Dawud (4473)"
    },
    {
      "arabic": "صحيح مسلم (1705)",
      "english": "Sahih Muslim (1705)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYJv5_qKsqw",
  "grade": {
    "arabic": "حسن موقوفاً",
    "english": "Hasan as Mauquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غلاموں پر حدود کا نفاذ",
        "english": "Implementation of Hudud on Slaves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قانونی برابری اور جوابدہی",
              "english": "Legal Equality and Accountability"
            },
            "content": {
              "urdu": [
                "اسلام نے غلاموں کو قانونی طور پر مادرِ پدر آزاد نہیں چھوڑا بلکہ انہیں معاشرتی نظم کا حصہ بنایا۔",
                "اگر کوئی غلام چوری، زنا یا قذف جیسے جرائم کرے تو اس پر حد لاگو ہوگی۔",
                "یہ حکم اس تصور کو ختم کرتا ہے کہ غلاموں کے افعال کی کوئی قانونی حیثیت نہیں ہے۔"
              ],
              "english": [
                "Islam did not leave slaves legally unaccountable but made them part of the social order.",
                "Slaves committing crimes like theft or adultery are subject to Shariah penalties.",
                "This ruling negates the idea that slaves' actions have no legal consequence."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزا کی مقدار میں رعایت",
              "english": "Concession in Penalty Amount"
            },
            "content": {
              "urdu": [
                "قرآن کے مطابق لونڈیوں کی سزا آزاد عورتوں کے مقابلے میں نصف (آدھی) ہے۔",
                "یہ رعایت ان کی سماجی مظلومیت اور کم تر سہولیات کے پیشِ نظر دی گئی ہے۔",
                "اسلامی قانون میں سزا کے نفاذ کے ساتھ ساتھ انسانی نفسیات کا بھی لحاظ رکھا گیا ہے۔"
              ],
              "english": [
                "According to the Quran, the penalty for slave-girls is half that of free women.",
                "This concession is granted considering their social status and limited privileges.",
                "Islamic law balances the enforcement of justice with considerations of human psychology."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا علی کا طرزِ عمل",
        "english": "The Practice of Ali (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفاس والی لونڈی کا واقعہ",
              "english": "Incident of the Post-Natal Slave"
            },
            "content": {
              "urdu": [
                "سیدنا علی نے ایک لونڈی کو زنا کی سزا دینے میں تاخیر کی کیونکہ وہ بیمار تھی۔",
                "نبی ﷺ نے ان کے اس عمل کی تعریف کی کہ سزا کا مقصد جان لینا نہیں بلکہ تادیب ہے۔",
                "بیماری یا کمزوری کی حالت میں سزا کو مؤخر کرنا عین اسلامی عدل ہے۔"
              ],
              "english": [
                "Ali (RA) delayed punishing a slave-girl for adultery because she was unwell after childbirth.",
                "The Prophet (ﷺ) praised this, showing that the goal of punishment is discipline, not death.",
                "Postponing a penalty due to illness or weakness is a core principle of Islamic justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاکم کی ذمہ داری",
              "english": "Responsibility of the Ruler"
            },
            "content": {
              "urdu": [
                "سیدنا علی نے اپنے خطبے میں لوگوں کو اپنے ماتحتوں کی اصلاح کی تاکید کی۔",
                "گھر کے سربراہ یا مالک کو اپنے ماتحتوں کے اخلاق کی نگرانی کرنی چاہیے۔",
                "حدود کا نفاذ معاشرے کو برائیوں سے پاک رکھنے کا ایک ضروری ذریعہ ہے۔"
              ],
              "english": [
                "In his sermon, Ali (RA) urged people to reform those under their authority.",
                "The head of a household or owner must monitor the character of their subordinates.",
                "Implementing Hudud is an essential tool for keeping society free from vices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی نظام میں غلامی کا تصور",
        "english": "Concept of Slavery in Islamic System"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی حقوق کا تحفظ",
              "english": "Protection of Human Rights"
            },
            "content": {
              "urdu": [
                "اسلام میں غلاموں پر حد کا نفاذ ان کی انسانی جان کی اہمیت کا اعتراف ہے۔",
                "مالک کو یہ حق نہیں دیا گیا کہ وہ غلام کو بلاوجہ مارے پیٹے یا قتل کرے۔",
                "سزا صرف شرعی جرم پر اور قانون کے مطابق ہی دی جا سکتی ہے۔"
              ],
              "english": [
                "Enforcing Hudud on slaves recognizes the legal significance of their human existence.",
                "An owner is not allowed to beat or kill a slave without a legal Shariah cause.",
                "Punishment can only be administered for a Shariah-defined crime and per the law."
              ]
            }
          },
          {
            "title": {
              "urdu": "آزادی کی ترغیب",
              "english": "Encouragement of Manumission"
            },
            "content": {
              "urdu": [
                "اسلام نے حدود اور کفاروں کے ذریعے غلاموں کی آزادی کے کئی راستے کھولے۔",
                "سزاؤں میں رعایت یہ پیغام دیتی ہے کہ اصل منزل انسانی آزادی ہے۔",
                "معاشرتی اصلاح کے لیے سزا سے زیادہ تربیت اور مواقع اہم ہیں۔"
              ],
              "english": [
                "Islam created numerous paths for freeing slaves through penalties and expiations.",
                "Concessions in punishments send a message that human liberty is the ultimate goal.",
                "For social reform, training and opportunities are more vital than mere punishment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماتحتوں کے ساتھ عدل",
              "english": "Justice with Subordinates"
            },
            "content": {
              "urdu": [
                "آج کل کے دور میں اس سے مراد ملازمین اور ماتحت افراد کے ساتھ عدل کرنا ہے۔",
                "ماتحتوں کی غلطی پر قانون سے بالاتر ہو کر ظلم کرنا شرعاً ممنوع ہے۔",
                "انصاف کا ترازو ہر چھوٹے بڑے کے لیے ایک جیسا ہونا چاہیے۔"
              ],
              "english": [
                "In modern times, this implies maintaining justice with employees and subordinates.",
                "Oppressing subordinates beyond the scope of the law is strictly forbidden.",
                "The scales of justice must remain uniform for everyone, regardless of status."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم و تربیت کی اہمیت",
              "english": "Importance of Education and Training"
            },
            "content": {
              "urdu": [
                "سزا سے پہلے ماتحتوں کو دین اور اخلاقیات کی تعلیم دینا ضروری ہے۔",
                "اسلامی ریاست میں ہر فرد کو اس کے حقوق اور فرائض سے آگاہ کیا جاتا ہے۔",
                "گناہوں سے بچنا صرف خوفِ سزا سے نہیں بلکہ خوفِ خدا سے ہونا چاہیے۔"
              ],
              "english": [
                "It is necessary to educate subordinates in religion and ethics before enforcing penalties.",
                "In an Islamic state, every individual is informed of their rights and duties.",
                "Avoiding sin should stem from the fear of Allah, not just the fear of punishment."
              ]
            }
          }
        ]
      }
    }
  ]
}