{
  "hadithId": 1112,
  "hadithNo": 33,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/11/33"
    ],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (2750)‏ وابن الجارود (1079)‏، وابن حبان (4815)‏، والحاكم (2/ 133)‏، والبيهقي (6/ 304).‏ ",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد، ابن الجارود، ابن حبان اور حاکم نے روایت کیا ہے۔ امام مکحول نے اس حدیث کی تلاش میں مصر، حجاز، عراق اور شام کا سفر کیا یہاں تک کہ انہیں زیاد بن جاریہ سے یہ روایت ملی۔",
    "english": "Sahih. Reported by Abu Dawud (2750), Ibn al-Jarud (1079), Ibn Hibban (4815), and al-Hakim (2/133). Imam Makul traveled through Egypt, Hijaz, Iraq, and Syria searching for this specific ruling on Nafal until he found it."
  },
  "importantWords": [
    {
      "arabic": "نَفَّلَ",
      "english": "Gave as an extra reward",
      "urdu": "بطور انعام زائد دیا"
    },
    {
      "arabic": "الرُّبْعَ",
      "english": "The fourth",
      "urdu": "چوتھا حصہ"
    },
    {
      "arabic": "الثُّلُثَ",
      "english": "The third",
      "urdu": "تیسرا حصہ"
    },
    {
      "arabic": "الْبَدْأَةِ",
      "english": "The beginning / Outward journey",
      "urdu": "ابتداء میں / جاتے وقت"
    },
    {
      "arabic": "الرَّجْعَةِ",
      "english": "The return journey",
      "urdu": "واپسی پر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'نفل' (اضافی انعام) کا بیان ہے، جو سپہ سالار مجاہدین کی حوصلہ افزائی کے لیے مالِ غنیمت کے پانچویں حصے (خمس) سے پہلے یا بعد میں دیتا ہے۔",
    "english": "This Hadith details 'Nafal' (extra rewards), which a commander grants to soldiers from the spoils to encourage bravery during specific stages of a military campaign."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2750)",
      "english": "Sunan Abi Dawud (2750)"
    },
    {
      "arabic": "صحيح ابن حبان (4815)",
      "english": "Sahih Ibn Hibban (4815)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "حبيب بن مسلمة الفهري",
        "english": "Habib bin Maslamah al-Fihri"
      },
      "slug": "habib-bin-maslamah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نفل (اضافی انعام) کی شرعی حیثیت",
        "english": "Shariah Status of Nafal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حوصلہ افزائی کا طریقہ",
              "english": "Method of Encouragement"
            },
            "content": {
              "urdu": [
                "نفل اس اضافی مال کو کہتے ہیں جو مجاہدین کو ان کے عام حصے کے علاوہ دیا جائے۔",
                "یہ انعام سپہ سالار کی طرف سے بہادری اور جفاکشی کے اعتراف میں ہوتا ہے۔",
                "اسلام نے مادی ترغیبات کو بھی مقاصد کے حصول کے لیے استعمال کرنے کی اجازت دی ہے۔"
              ],
              "english": [
                "Nafal refers to the extra spoils given to soldiers beyond their standard share.",
                "This reward is granted by the commander in recognition of bravery and hard work.",
                "Islam permits the use of material incentives to achieve noble strategic goals."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقسیم کے اوقات",
              "english": "Timing of Distribution"
            },
            "content": {
              "urdu": [
                "جنگ کے آغاز میں جب خطرات زیادہ ہوں تو چوتھا حصہ نفل دیا جا سکتا ہے۔",
                "واپسی کے وقت جب تھکاوٹ زیادہ ہو اور دشمن کا تعاقب ہو تو تہائی حصہ دیا جاتا ہے۔",
                "حصے کی مقدار حالات کی نزاکت اور دشمن کی قوت کے مطابق طے کی جاتی ہے۔"
              ],
              "english": [
                "At the start of a war when risks are high, a fourth share can be given as Nafal.",
                "On return, when exhaustion is high and enemy pursuit is likely, a third is given.",
                "The amount is determined based on the severity of circumstances and enemy strength."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور باریکیاں",
        "english": "Jurisprudential Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خمس سے ادائیگی",
              "english": "Payment from the Khums"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک یہ اضافی انعام غنیمت کے کل مال کے پانچویں حصے سے دیا جاتا ہے۔",
                "سپہ سالار کو یہ اختیار حاصل ہے کہ وہ مصلحت کے تحت اس میں کمی بیشی کرے۔",
                "یہ انعام صرف ان دستوں کے لیے ہوتا ہے جنہوں نے خاص مہم سر انجام دی ہو۔"
              ],
              "english": [
                "Majority of jurists hold that this extra reward is paid from the state's one-fifth share.",
                "The commander has the discretion to increase or decrease this based on utility.",
                "This reward is reserved for units that perform specific, high-risk missions."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام کی اجازت کی ضرورت",
              "english": "Requirement of Leader's Permission"
            },
            "content": {
              "urdu": [
                "کوئی بھی مجاہد خود سے غنیمت کے مال میں سے کوئی چیز نہیں رکھ سکتا۔",
                "نفل کا حقدار وہی ہوتا ہے جس کے لیے حاکم یا امیر نے اعلان کیا ہو۔",
                "یہ قاعدہ لشکر میں نظم و ضبط اور امانت داری برقرار رکھنے کے لیے اہم ہے۔"
              ],
              "english": [
                "No soldier is allowed to take anything from the spoils on his own accord.",
                "The right to Nafal belongs only to those specified by the ruler or commander.",
                "This rule is vital for maintaining discipline and honesty within the army."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علم الحدیث اور طلبِ علم",
        "english": "Hadith Science and Seeking Knowledge"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام مکحول کا طویل سفر",
              "english": "Imam Makul's Long Journey"
            },
            "content": {
              "urdu": [
                "اس حدیث کی سند میں موجود امام مکحول نے اس ایک مسئلے کے لیے چار ممالک کا سفر کیا۔",
                "یہ اسلاف کی سنتِ نبوی سے محبت اور درست علم کے حصول کی تڑپ کو ظاہر کرتا ہے۔",
                "ایک مستند حدیث کی تلاش میں مشقت اٹھانا محدثین کا خاصہ رہا ہے۔"
              ],
              "english": [
                "Imam Makul, in the chain of this Hadith, traveled four countries for this one ruling.",
                "This demonstrates the predecessors' love for Sunnah and their thirst for authentic knowledge.",
                "Enduring hardships to verify a single Hadith was a hallmark of the great scholars."
              ]
            }
          },
          {
            "title": {
              "urdu": "سند کی مضبوطی",
              "english": "Strength of the Chain"
            },
            "content": {
              "urdu": [
                "کئی ائمہ حدیث نے اس روایت کی تصحیح کی ہے جو اس کے معتبر ہونے کی دلیل ہے۔",
                "مختلف طرق سے روایت کا آنا اس کے متن کو تقویت فراہم کرتا ہے۔",
                "مسلمانوں کے لیے جنگی قوانین میں یہ حدیث ایک بنیادی ماخذ کی حیثیت رکھتی ہے۔"
              ],
              "english": [
                "Several Hadith masters authenticated this report, proving its reliability.",
                "The transmission through various paths strengthens the authenticity of the text.",
                "This Hadith serves as a primary source for military legislation in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور حکمت",
        "english": "Practical Lesson and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کارکردگی کی بنیاد پر انعام",
              "english": "Performance-Based Rewards"
            },
            "content": {
              "urdu": [
                "اداروں میں ملازمین کی کارکردگی بڑھانے کے لیے بونس اور انعامات کا نظام سنت سے ثابت ہے۔",
                "اچھی کارکردگی دکھانے والوں کو سراہنا معاشرے میں ترقی کا باعث بنتا ہے۔",
                "یہ عمل دوسروں کے اندر بھی آگے بڑھنے اور محنت کرنے کا جذبہ پیدا کرتا ہے۔"
              ],
              "english": [
                "Systemic bonuses and rewards to enhance performance are proven from the Sunnah.",
                "Appreciating high achievers leads to overall progress within a society or organization.",
                "This practice instills a spirit of competition and hard work in others."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیادت کی بصیرت",
              "english": "Leadership Foresight"
            },
            "content": {
              "urdu": [
                "ایک کامیاب قائد وہی ہے جو اپنے ماتحتوں کی ضروریات اور جذبات کو سمجھے۔",
                "وسائل کی منصفانہ تقسیم اور اضافی مراعات ٹیم کے اتحاد کو مضبوط کرتی ہیں۔",
                "اسلامی قیادت ہمیشہ عدل اور مصلحت کے امتزاج سے فیصلے کرتی ہے۔"
              ],
              "english": [
                "A successful leader is one who understands the needs and emotions of subordinates.",
                "Fair distribution of resources and extra perks strengthen the team's unity.",
                "Islamic leadership always makes decisions based on a blend of justice and strategy."
              ]
            }
          }
        ]
      }
    }
  ]
}