{
  "hadithId": 1206,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/19"],
    "kitabId": 14,
    "inKitabBab": 2,
    "arabicBook": "كتاب القضاء",
    "babId": 98
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2654)، ومسلم (87). لفظه: 'ألا أنبئكم بأكبر الكبائر؟' قالها ثلاثاً، ذكر منها الإشراك بالله، وعقوق الوالدين، ثم جلس وكان متكئاً فقال: 'ألا وقول الزور، ألا وشهادة الزور'.",
    "urdu": "صحیح۔ اسے بخاری (2654) اور مسلم (87) نے روایت کیا ہے۔ آپ ﷺ ٹیک لگائے ہوئے تھے، جب جھوٹی گواہی کا ذکر آیا تو بیٹھ گئے اور اسے بار بار دہرایا۔",
    "english": "Sahih. Reported by Al-Bukhari (2654) and Muslim (87). The Prophet (ﷺ) was reclining, but he sat up when mentioning false testimony and repeated it multiple times to emphasize its gravity."
  },
  "importantWords": [
    {
      "arabic": "أَكْبَرِ",
      "english": "Greatest",
      "urdu": "سب سے بڑے"
    },
    {
      "arabic": "اَلْكَبَائِرِ",
      "english": "Major sins",
      "urdu": "کبیرہ گناہ"
    },
    {
      "arabic": "شَهَادَةَ",
      "english": "Testimony",
      "urdu": "گواہی"
    },
    {
      "arabic": "اَلزُّورِ",
      "english": "Falsehood / Lie",
      "urdu": "جھوٹ / باطل"
    },
    {
      "arabic": "مُتَّكِئاً",
      "english": "Reclining",
      "urdu": "ٹیک لگائے ہوئے"
    }
  ],
  "summary": {
    "urdu": "جھوٹی گواہی اسلام میں ایک سنگین ترین گناہ ہے جسے شرک اور والدین کی نافرمانی کے ساتھ ذکر کیا گیا ہے، کیونکہ یہ عدل کا قتل اور معاشرتی تباہی کا سبب ہے۔",
    "english": "False testimony is one of the gravest sins in Islam, categorized alongside shirk and disobeying parents, as it destroys justice and ruins lives."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الشهادات، رقم 2654",
      "english": "Sahih al-Bukhari, Book of Witnesses, No. 2654"
    },
    {
      "arabic": "صحيح مسلم، كتاب الإيمان، رقم 87",
      "english": "Sahih Muslim, Book of Faith, No. 87"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكرة الثقفي",
        "english": "Abu Bakra al-Thaqafi"
      },
      "slug": "abu-bakra-al-thaqafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=5Vj-fL2Vq6g",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جھوٹی گواہی کی سنگینی",
        "english": "The Gravity of False Testimony"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرک کے ساتھ ذکر",
              "english": "Linked with Shirk"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے جھوٹی گواہی کو شرک باللہ کے ساتھ ملا کر ذکر فرمایا ہے۔",
                "یہ اس گناہ کی حد درجہ قباحت اور سنگینی پر دلالت کرتا ہے۔",
                "جس طرح شرک دین کو تباہ کرتا ہے، جھوٹی گواہی معاشرتی ڈھانچے کو تباہ کرتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) mentioned false testimony in conjunction with associating partners with Allah.",
                "This indicates the extreme vileness and severity of this particular sin.",
                "Just as shirk destroys one's faith, false testimony destroys the social fabric."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی کیفیت میں تبدیلی",
              "english": "The Change in Prophet's (ﷺ) Posture"
            },
            "content": {
              "urdu": [
                "آپ ﷺ ٹیک لگائے ہوئے تھے لیکن جھوٹی گواہی کے ذکر پر سنجیدگی سے بیٹھ گئے۔",
                "آپ ﷺ نے اس جملے کو بار بار دہرایا یہاں تک کہ صحابہ ڈرنے لگے۔",
                "یہ اس بات کی علامت ہے کہ لوگ اسے معمولی سمجھتے ہیں جبکہ یہ ہلاک کرنے والا گناہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was reclining but sat up straight when mentioning false testimony.",
                "He repeated the warning so many times that the Companions became concerned for him.",
                "This change signifies that people often underestimate this sin despite its fatal nature."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور قانونی اثرات",
        "english": "Social and Legal Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل و انصاف کا قتل",
              "english": "The Murder of Justice"
            },
            "content": {
              "urdu": [
                "جھوٹی گواہی سے حقدار اپنا حق کھو دیتا ہے اور ظالم کامیاب ہو جاتا ہے۔",
                "یہ عدالتی نظام کو مفلوج کر دیتا ہے اور لوگوں کا قانون سے اعتبار اٹھ جاتا ہے۔",
                "معاشرے میں بے چینی اور انتقامی جذبات کو فروغ ملتا ہے۔"
              ],
              "english": [
                "Through false testimony, the rightful owner loses their right while the oppressor wins.",
                "It paralyzes the judicial system and erodes public trust in the law.",
                "It fosters restlessness and a desire for revenge within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی پامالی",
              "english": "Violation of Human Rights"
            },
            "content": {
              "urdu": [
                "جھوٹا گواہ براہِ راست کسی دوسرے انسان کی زندگی، مال یا آبرو پر حملہ کرتا ہے۔",
                "یہ ایک ایسا گناہ ہے جس کی تلافی صرف توبہ سے نہیں بلکہ حق کی واپسی سے ممکن ہے۔",
                "دھوکہ دہی اور مکر و فریب کی یہ بدترین شکل ہے جس سے اسلام سختی سے روکتا ہے۔"
              ],
              "english": [
                "A false witness directly attacks another human's life, property, or honor.",
                "This sin cannot be rectified by repentance alone; the stolen right must be returned.",
                "It is the worst form of deception and fraud, which Islam strictly prohibits."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخروی انجام",
        "english": "Consequences in the Hereafter"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جہنم کا مستحق",
              "english": "Deserving of Hellfire"
            },
            "content": {
              "urdu": [
                "جھوٹی گواہی دینے والا اللہ کے غضب اور لعنت کا شکار ہوتا ہے۔",
                "احادیث کے مطابق ایسے شخص کے لیے جنت حرام کر دی جاتی ہے جو دانستہ جھوٹ بولے۔",
                "قیامت کے دن اسے ذلت و رسوائی کا سامنا کرنا پڑے گا۔"
              ],
              "english": [
                "The one who gives false testimony becomes a target of Allah's wrath and curse.",
                "According to Hadiths, Paradise is forbidden for one who intentionally lies in testimony.",
                "On the Day of Resurrection, they will face immense humiliation and disgrace."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیکیوں کی بربادی",
              "english": "Destruction of Good Deeds"
            },
            "content": {
              "urdu": [
                "کبیرہ گناہ انسان کی دیگر نیکیوں کے اثرات کو زائل کر دیتے ہیں۔",
                "جھوٹی گواہی کا وبال اتنا بڑا ہے کہ یہ توبہ کے بغیر معاف نہیں ہوتا۔",
                "انسان کو دنیا کے معمولی فائدے کے لیے اپنی آخرت داؤ پر نہیں لگانی چاہیے۔"
              ],
              "english": [
                "Major sins can nullify the positive impacts of a person's other good deeds.",
                "The burden of false testimony is so great that it is not forgiven without sincere repentance.",
                "One should not gamble away their Hereafter for a trivial worldly benefit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصلاحی تدابیر",
        "english": "Reformative Measures"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق گوئی کی اہمیت",
              "english": "Importance of Speaking Truth"
            },
            "content": {
              "urdu": [
                "اسلام گواہی چھپانے سے منع کرتا ہے اور سچ بولنے کی تلقین کرتا ہے۔",
                "ایک مومن کی شان یہ ہے کہ وہ اپنی ذات کے خلاف بھی سچی گواہی دے۔",
                "سچائی ہی وہ بنیاد ہے جس پر ایک پرامن معاشرہ قائم ہو سکتا ہے۔"
              ],
              "english": [
                "Islam forbids concealing testimony and commands speaking the absolute truth.",
                "The hallmark of a believer is that they testify truly even if it is against themselves.",
                "Truthfulness is the foundation upon which a peaceful society can be built."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھوٹے گواہوں کا بائیکاٹ",
              "english": "Boycotting False Witnesses"
            },
            "content": {
              "urdu": [
                "معاشرے کو چاہیے کہ ایسے لوگوں کو پہچانے اور انہیں سماجی طور پر ناپسند کرے۔",
                "عدالتوں کو جھوٹی گواہی دینے والوں کے لیے سخت سزائیں مقرر کرنی چاہئیں۔",
                "خوفِ خدا ہی وہ واحد طاقت ہے جو انسان کو جھوٹ بولنے سے روک سکتی ہے۔"
              ],
              "english": [
                "Society should identify such individuals and socially discourage their behavior.",
                "Courts must establish severe punishments for those who provide false testimony.",
                "Fear of Allah is the only power that can truly restrain a person from lying."
              ]
            }
          }
        ]
      }
    }
  ]
}