{
  "hadithId": 944,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/944", "bukhari/5305", "muslim/1500"],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },

  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5305)، ومسلم (1500)، وأبو داود (2260)، والنسائي (3482)، وابن ماجه (1996).",
    "urdu": "یہ روایت صحیح ہے اور بخاری (5305) اور مسلم (1500) میں موجود ہے۔ اسے ابوداؤد، نسائی اور ابن ماجہ نے بھی روایت کیا ہے۔ یہ حدیث وراثت اور جینیات کے اصولوں کو سمجھنے کے لیے ایک بہترین مثال ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5305) and Muslim (1500). Also reported by Abu Dawud (2260), An-Nasa'i (3482), and Ibn Majah (1996)."
  },
  "importantWords": [
    {
      "arabic": "إِبِلٍ",
      "english": "Camels",
      "urdu": "اونٹ"
    },
    {
      "arabic": "حُمْرٌ",
      "english": "Red",
      "urdu": "سرخ"
    },
    {
      "arabic": "أَوْرَقَ",
      "english": "Ash-colored / Grey",
      "urdu": "خاکستری رنگ کا"
    },
    {
      "arabic": "نَزَعَهُ عِرْقٌ",
      "english": "Pulled by a strain / Heredity",
      "urdu": "کسی رگ (نسل) نے کھینچ لیا"
    },
    {
      "arabic": "يُعَرِّضُ",
      "english": "Hinting / Alluding",
      "urdu": "اشارہ کر رہا تھا"
    },
    {
      "arabic": "يَنْفِيَهُ",
      "english": "Disown / Deny",
      "urdu": "نفی کرنا / انکار کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ نے ایک بدوی کو عقلی مثال کے ذریعے سمجھایا کہ بچے کی رنگت کا والدین سے مختلف ہونا ضروری نہیں کہ بدکاری کی دلیل ہو، بلکہ یہ موروثی اثرات کی وجہ سے ہو سکتا ہے۔",
    "english": "In this Hadith, the Prophet (ﷺ) used a rational analogy to explain that a child's different skin color is not proof of adultery, but can be a result of hereditary/genetic traits from ancestors."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5305)",
      "english": "Reported by Al-Bukhari (5305)"
    },
    {
      "arabic": "رواه مسلم (1500)",
      "english": "Reported by Muslim (1500)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=7X-P8e8t8o8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "موروثیت اور جینیات کا تصور",
        "english": "Concept of Heredity and Genetics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قدیم نسلوں کے اثرات",
              "english": "Traits from Ancestors"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے واضح فرمایا کہ انسانی اوصاف قدیم آباؤ اجداد سے منتقل ہو سکتے ہیں۔",
                "رنگت کا فرق والدین کے بجائے کسی دور کے دادا یا پردادا پر جا سکتا ہے۔",
                "یہ اصول اجابتِ الہی اور تخلیقِ انسانی کی گہرائی کو بیان کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that human traits can be inherited from distant ancestors.",
                "Difference in skin color may stem from a forefather rather than the parents.",
                "This principle explains the depth of Divine creation and human biological complexity."
              ]
            }
          },
          {
            "title": {
              "urdu": "سائنسی مشاہدہ",
              "english": "Scientific Observation"
            },
            "content": {
              "urdu": [
                "جدید سائنس (Genetics) بھی اسی 'نَزَعَهُ عِرْقٌ' یعنی موروثی منتقلی کی تصدیق کرتی ہے۔",
                "رسول اللہ ﷺ کا اونٹوں کی مثال دینا ایک بہترین سائنسی و عقلی استدلال تھا۔",
                "اسلامی تعلیمات ہمیشہ فطرت اور حقیقت کے عین مطابق ہوتی ہیں۔"
              ],
              "english": [
                "Modern science (Genetics) confirms the concept of hereditary transmission of traits.",
                "The Prophet's (ﷺ) analogy of camels was a brilliant rational and scientific argument.",
                "Islamic teachings are always in complete harmony with nature and reality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بدگمانی سے بچنے کی تاکید",
        "english": "Emphasis on Avoiding Suspicion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغیر ثبوت تہمت کی ممانعت",
              "english": "Prohibition of Slander Without Proof"
            },
            "content": {
              "urdu": [
                "محض شبہ کی بنیاد پر اپنی بیوی پر بدکاری کا الزام لگانا حرام ہے۔",
                "نبی ﷺ نے بدوی کو اشاروں میں بات کرنے پر سختی سے ٹوکا۔",
                "اسلام خاندانی عزت و وقار کے تحفظ کو اولین ترجیح دیتا ہے۔"
              ],
              "english": [
                "It is forbidden to accuse one's wife of adultery based solely on suspicion.",
                "The Prophet (ﷺ) strictly corrected the Bedouin for hinting at such an accusation.",
                "Islam gives top priority to the protection of family honor and dignity."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشگوار ازدواجی زندگی",
              "english": "Happy Marital Life"
            },
            "content": {
              "urdu": [
                "اعتماد ہی میاں بیوی کے رشتے کی اصل بنیاد اور مضبوطی ہے۔",
                "شک کی بیماری گھروں کو برباد اور نسلوں کو تباہ کر دیتی ہے۔",
                "آپ ﷺ نے اس شخص کے دل سے وسوسے نکال کر اس کا گھر بچایا۔"
              ],
              "english": [
                "Trust is the true foundation and strength of the relationship between spouses.",
                "The disease of suspicion ruins households and destroys future generations.",
                "The Prophet (ﷺ) saved the man's home by removing doubts from his heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نسب کے ثبوت کا ضابطہ",
        "english": "Regulation of Establishing Lineage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الولد للفراش",
              "english": "The Child Belongs to the Marriage Bed"
            },
            "content": {
              "urdu": [
                "اسلامی قانون کے مطابق بچہ اسی کا ہے جس کے نکاح میں وہ پیدا ہوا۔",
                "محض رنگت کی تبدیلی سے بچے کے نسب کا انکار نہیں کیا جا سکتا۔",
                "نبی ﷺ نے اس معاملے میں لعان یا نفی کی اجازت بالکل نہیں دی۔"
              ],
              "english": [
                "According to Islamic law, the child belongs to the one in whose marriage he is born.",
                "A child's lineage cannot be denied simply due to a change in skin color.",
                "The Prophet (ﷺ) did not grant permission for Li'an or disowning in this case."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانونی تحفظ",
              "english": "Legal Protection"
            },
            "content": {
              "urdu": [
                "شریعت نے معصوم بچوں کے نسب کو مشکوک ہونے سے بچایا ہے۔",
                "اگر نفی کی اجازت مل جاتی تو معاشرے میں ہر طرف فساد برپا ہوتا۔",
                "یہ حدیث بچوں کے سماجی اور قانونی حقوق کے تحفظ کی ضمانت ہے۔"
              ],
              "english": [
                "Shariah has protected the lineage of innocent children from being made suspicious.",
                "If disowning was easily permitted, it would have caused widespread social chaos.",
                "This Hadith guarantees the protection of children's social and legal rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی پہلو",
        "english": "Educational and Disciplinary Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مثالوں سے سمجھانا",
              "english": "Teaching Through Analogies"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے مخاطب کے ماحول (اونٹوں) سے مثال دے کر بات سمجھائی۔",
                "یہ طریقہ تعلیم ہر دور کے مربیوں اور اساتذہ کے لیے بہترین نمونہ ہے۔",
                "مشکل مسائل کو عام فہم مثالوں سے حل کرنا نبوی حکمت ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) explained the matter using an example from the man's environment.",
                "This teaching method is a perfect model for educators and mentors of all eras.",
                "Solving complex issues through simple analogies is a part of Prophetic wisdom."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذہنی سکون کا حصول",
              "english": "Attaining Mental Peace"
            },
            "content": {
              "urdu": [
                "دینِ اسلام وسوسوں کو ختم کر کے ذہنی سکون فراہم کرتا ہے۔",
                "علمِ نافع انسان کو جہالت کی تاریکیوں اور غلط فیصلوں سے بچاتا ہے۔",
                "رسول اللہ ﷺ کی اتباع ہی تمام سماجی الجھنوں کا واحد حل ہے۔"
              ],
              "english": [
                "The religion of Islam provides mental peace by eliminating baseless whispers.",
                "Beneficial knowledge protects a person from darkness and wrong decisions.",
                "Following the Messenger of Allah (ﷺ) is the only solution to social confusion."
              ]
            }
          }
        ]
      }
    }
  ]
}