{
  "hadithId": 208,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه أبو داود في كتاب الأدب، باب في كنس المساجد (461)، والترمذي في الدعوات، باب ما جاء في كراهية التثاؤب في الصلاة (2916)، وابن خزيمة في صحيحه (1297). ورغم تضعيف الترمذي والبخاری له، فقد حسنه كثير من المتأخرين للشواهد.",
    "urdu": "صحیح بشواہدہ (شواہد کی بنا پر صحیح)۔ اسے ابو داؤد نے کتاب الأدب، باب فی کنس المساجد (461) میں، ترمذی نے کتاب الدعوات (2916) میں، اور ابن خزیمہ نے صحیحہ (1297) میں روایت کیا ہے۔ اگرچہ ترمذی اور بخاری نے اس کی سند کو ضعیف کہا، لیکن شواہد کی بنا پر بہت سے متاخرین نے اسے حسن یا صحیح قرار دیا ہے۔",
    "english": "Authentic due to corroborating reports (Sahih li ghayrihi). Reported by Abu Dawud in the Book of Manners, Chapter: Sweeping the Mosques (461), At-Tirmidhi in the Book of Supplications (2916), and Ibn Khuzaymah in his Sahih (1297). Although At-Tirmidhi and Al-Bukhari deemed its chain weak, many later scholars upgraded it to Hasan or Sahih due to supporting narrations."
  },
  "importantWords": [
    {
      "arabic": "عُرِضَتْ",
      "english": "Were presented/shown",
      "urdu": "پیش کیے گئے"
    },
    {
      "arabic": "أُجُورُ أُمَّتِي",
      "english": "The rewards of my Ummah",
      "urdu": "میری امت کے ثواب"
    },
    {
      "arabic": "الْقَذَاة",
      "english": "A piece of straw/dirt",
      "urdu": "تنکا/چھوٹی سی گندگی"
    },
    {
      "arabic": "يُخْرِجُهَا",
      "english": "He removes it",
      "urdu": "وہ اسے نکالتا ہے"
    },
    {
      "arabic": "الْمَسْجِدِ",
      "english": "The Mosque",
      "urdu": "مسجد"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ اللہ تعالیٰ اپنے بندوں کے چھوٹے سے چھوٹے نیک اعمال کو بھی دیکھتا اور ان پر اجر دیتا ہے۔ خاص طور پر مسجد کی پاکیزگی اور صفائی کو برقرار رکھنے کا عمل، خواہ وہ معمولی سی گندگی کو دور کرنا ہی کیوں نہ ہو، اللہ کے ہاں بہت بڑے اجر کا باعث ہے۔",
    "english": "This Hadith states that Allah observes and rewards even the smallest good deeds of His servants. Specifically, the act of maintaining the purity and cleanliness of the mosque, even if it is just removing a tiny piece of dirt, earns a great reward from Allah."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الأدب، باب في كنس المساجد (461)",
      "english": "Sunan Abu Dawud, Book of Manners, Chapter: Sweeping the Mosques (461)"
    },
    {
      "arabic": "صحيح ابن خزيمة، كتاب الإمامة في الصلاة، باب فضل إخراج القذاة من المسجد (1297)",
      "english": "Sahih Ibn Khuzaymah, Book of Imamat in Prayer, Chapter: Virtue of removing dirt from the mosque (1297)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Malik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9oD6QfL-tM",
  "grade": {
    "arabic": "صحيح بشواهده",
    "english": "Authentic due to corroborating reports (Sahih li ghayrihi)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اجر کی وسعت اور اخلاص",
        "english": "The Scope of Reward and Sincerity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال کے ثواب کا مشاہدہ",
              "english": "Observation of Deeds' Rewards"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم پر امت کے تمام اعمال کا ثواب پیش کیا گیا، جو آپ کی شانِ نبوت کا حصہ ہے۔",
                "اس سے معلوم ہوتا ہے کہ اللہ تعالیٰ اپنے نبی کو ہر چھوٹے بڑے عمل کے ثواب سے آگاہ فرماتا ہے۔",
                "اس عمل کے اجر کا مشاہدہ بھی اس بات کی دلیل ہے کہ مسجد کی صفائی اللہ کے ہاں بہت قدر رکھتی ہے۔"
              ],
              "english": [
                "The rewards of all deeds of the Ummah were presented to the Prophet (PBUH), which is part of his prophetic stature.",
                "This indicates that Allah informs His Prophet of the reward for every small and large deed.",
                "The observation of the reward for this act also proves that mosque cleanliness holds great value with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "چھوٹے عمل پر بڑا اجر",
              "english": "Great Reward for Small Deeds"
            },
            "content": {
              "urdu": [
                "معمولی سی گندگی (تنکا) کو مسجد سے نکالنے پر بھی ثواب ملنا اخلاص کی اہمیت کو ظاہر کرتا ہے۔",
                "اللہ کی نظر میں عمل کی مقدار سے زیادہ اس کے پیچھے کارفرما نیت اور اخلاص اہمیت رکھتا ہے۔",
                "یہ امت کو سکھایا گیا ہے کہ نیکی کے کسی بھی چھوٹے کام کو حقیر نہ سمجھا جائے۔"
              ],
              "english": [
                "Earning a reward for removing a tiny piece of dirt (straw) highlights the significance of sincerity.",
                "In Allah's sight, the intention and sincerity behind the deed matter more than its size.",
                "The Ummah is taught not to belittle any small act of goodness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسجد کا ادب اور صفائی",
        "english": "Etiquette and Cleanliness of the Mosque"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خدمتِ مسجد کی فضیلت",
              "english": "Virtue of Serving the Mosque"
            },
            "content": {
              "urdu": [
                "مسجدوں کی صفائی اور دیکھ بھال کرنا صرف انتظامی نہیں بلکہ ایک اعلیٰ دینی عمل ہے۔",
                "یہ عمل اس بات کی ضمانت ہے کہ مسجد کا ماحول پرسکون اور عبادت کے لیے سازگار رہے۔",
                "صحابہ کرامؓ مساجد کی صفائی میں بڑھ چڑھ کر حصہ لیتے تھے، جو ہمارے لیے نمونہ ہے۔"
              ],
              "english": [
                "Cleaning and maintaining mosques is not just administrative work but a superior religious act.",
                "This action guarantees that the mosque environment remains tranquil and conducive to worship.",
                "The Companions (RA) actively participated in cleaning the mosques, setting an example for us."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی کا عملی سبق",
              "english": "The Prophet's Practical Lesson"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے خود بھی مسجد میں تھوک دیکھ کر اس کو مٹا دیا تھا، جو طہارت کی اہمیت کو واضح کرتا ہے۔",
                "ہر وہ چیز جو مسجد کے تقدس کے خلاف ہو، اسے فوراً دور کر دینا ایک مومن کا فریضہ ہے۔",
                "مسجد کی ہر معمولی گندگی کو محسوس کرنا قلبی تعلق اور روحانی بیداری کی علامت ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) himself removed spittle from the mosque floor, emphasizing the importance of purity.",
                "It is the duty of a believer to immediately remove anything that compromises the sanctity of the mosque.",
                "Noticing every minute piece of dirt in the mosque is a sign of a deep heartfelt connection and spiritual vigilance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "درجہ بندی اور استدلال",
        "english": "Grading and Reasoning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ علم کا موقف",
              "english": "Stance of the Scholars"
            },
            "content": {
              "urdu": [
                "امام ترمذی کا اسے 'غریب' کہنا سند کی کمزوری کو ظاہر کرتا ہے، لیکن ابن خزیمہ نے اسے صحیح قرار دیا۔",
                "یہ حدیث اپنے مفہوم میں دوسری صحیح احادیث (جیسے مسجد کی صفائی کا حکم) سے تقویت پاتی ہے۔",
                "فقہی طور پر یہ اصول متفق علیہ ہے کہ مسجد کی صفائی افضل ترین اعمال میں سے ہے۔"
              ],
              "english": [
                "At-Tirmidhi's grading of 'Gharīb' indicates weakness in the chain, but Ibn Khuzaymah authenticated it.",
                "The meaning of this Hadith is supported by other authentic narrations (e.g., the command to clean mosques).",
                "Juristic-ally, it is an agreed-upon principle that cleaning the mosque is one of the most virtuous deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجر کے مختلف درجات",
              "english": "Different Levels of Reward"
            },
            "content": {
              "urdu": [
                "اجر کی مقدار کا تعین صرف اللہ کی مرضی پر ہے، جو چھوٹی نیکی کو بھی کئی گنا بڑھا سکتا ہے۔",
                "اس حدیث کا مقصد امت کو ہر طرح کی نیکی کی ترغیب دینا ہے، چاہے وہ کتنی ہی معمولی ہو۔",
                "یہ مومن کو ہر وقت تیار رہنے کی تعلیم دیتا ہے کہ وہ ہر موقع پر نیکی کا موقع تلاش کرے۔"
              ],
              "english": [
                "The amount of reward is solely determined by Allah's will, who can multiply a small good deed manifold.",
                "The purpose of this Hadith is to encourage the Ummah to engage in all kinds of good deeds, no matter how insignificant they seem.",
                "It teaches the believer to be perpetually ready to seek opportunities for goodness at every moment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور روحانی پیغام",
        "english": "Social and Spiritual Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احساسِ ذمہ داری",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "مسجد کی صفائی کا عمل کسی ملازم کے حوالے کرنے کے بجائے اجتماعی ذمہ داری ہونی چاہیے۔",
                "جب ہر شخص مسجد کو اپنا گھر سمجھے گا تب ہی وہ چھوٹی سے چھوٹی گندگی کو بھی دور کرے گا۔",
                "یہ حدیث ان لوگوں کے لیے ترغیب ہے جو خاموشی سے نیکی کرتے ہیں اور اجر کے طلبگار ہیں۔"
              ],
              "english": [
                "Mosque cleanliness should be a communal responsibility rather than being delegated solely to an employee.",
                "Only when every person considers the mosque their own house will they remove even the smallest piece of dirt.",
                "This Hadith is an encouragement for those who perform good deeds silently, seeking only reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنت کا راستہ",
              "english": "The Path to Paradise"
            },
            "content": {
              "urdu": [
                "چھوٹے نیکی کے اعمال بھی اگر اخلاص سے ہوں تو جنت میں داخلے کا سبب بن سکتے ہیں۔",
                "مسجد کی خدمت دراصل اللہ کی خدمت ہے، جس کا بدلہ اللہ کے پاس محفوظ ہے۔",
                "اس حدیث پر عمل کرنے سے ہمارے اندر نظافت اور باطنی پاکیزگی کا احساس اجاگر ہوتا ہے۔"
              ],
              "english": [
                "Small acts of goodness, if done with sincerity, can lead to entry into Paradise.",
                "Serving the mosque is essentially serving Allah, and its reward is secured with Him.",
                "Acting upon this Hadith enhances our sense of cleanliness and inner purity."
              ]
            }
          }
        ]
      }
    }
  ]
}
