{
  "hadithId": 174,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["1:4:15"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (مواضع التنبيه في الصلاة)",
    "babId": 13
  },
  
  "takhreej": {
    "arabic": " صحيح .‏ رواه البخاري (1203)‏ ، ومسلم (422)‏ .‏",
    "urdu": "صحیح۔ اسے بخاری (1203) اور مسلم (422) نے روایت کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (1203) and Muslim (422).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "اَلتَّسْبِيحُ لِلرِّجَالِ",
      "english": "Tasbīḥ is for men",
      "urdu": "تسبیح مردوں کے لیے ہے"
    },
    {
      "arabic": "وَالتَّصْفِيقُ لِلنِّسَاءِ",
      "english": "And clapping is for women",
      "urdu": "اور تالی بجانا عورتوں کے لیے ہے"
    },
    {
      "arabic": "فِي اَلصَّلَاةِ",
      "english": "In the prayer",
      "urdu": "نماز میں"
    },
    {
      "arabic": "سُبْحَانَ اَللَّهِ",
      "english": "Glory be to Allah",
      "urdu": "اللہ پاک ہے"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon (Bukhari and Muslim)",
      "urdu": "بخاری و مسلم متفق"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں کسی ضرورت کے پیش آنے پر امام کو متنبہ کرنے کا شرعی طریقہ بیان کرتی ہے: اگر امام سے کوئی غلطی ہو جائے تو مردوں کو تسبیح («سبحان اللہ» کہہ کر) کے ذریعے اور عورتوں کو تالی بجا کر (ہاتھ پر ہاتھ مار کر) اسے مطلع کرنا چاہیے۔ یہ حکم نماز میں گفتگو کی ممانعت کے بعد دیا گیا تاکہ امام کو مطلع بھی کیا جا سکے اور نماز بھی باطل نہ ہو۔",
    "english": "This Hadith clarifies the legal method for alerting the Imām during prayer in case of necessity: If the Imām makes an error, men should notify him by saying Tasbīḥ ('Subḥānallāh'), and women should do so by clapping (striking the palm of one hand on the back of the other). This ruling was given after ordinary speech in prayer was forbidden, allowing the Imām to be alerted without invalidating the prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1203)",
      "english": "Reported by Al-Bukhārī (1203)"
    },
    {
      "arabic": "رواه مسلم (422)",
      "english": "Reported by Muslim (422)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abū Hurayrah"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "امام کو متنبہ کرنے کا طریقہ",
        "english": "Method of Alerting the Imām"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردوں کے لیے تسبیح",
              "english": "Tasbīḥ for Men"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے نماز میں امام کی غلطی پر «سبحان الله» کہنا فرض ہے (اگر غلطی اہم ہو) اور یہ عمل کلامِ ناس میں شامل نہیں۔",
                "تسبیح اللہ کے ذکر میں شامل ہے اور نماز کو باطل نہیں کرتی، بلکہ یہ نماز کا ایک مشروع فعل ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ نماز میں غلطی کی اصلاح ضروری ہے تاکہ نماز صحیح ہو۔"
              ],
              "english": [
                "It is obligatory for men to say 'Subḥānallāh' upon the Imām's error (if the mistake is significant), and this act is not considered ordinary human speech.",
                "Tasbīḥ is classified as the remembrance of Allah and does not nullify the prayer; it is a legally sanctioned action within the prayer.",
                "This ruling proves the necessity of correcting errors during prayer to ensure its validity."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورتوں کے لیے تالی (تصفیق)",
              "english": "Clapping (Taṣfīq) for Women"
            },
            "content": {
              "urdu": [
                "عورتوں کے لیے امام کو متنبہ کرنے کا طریقہ تالی بجانا (ہاتھ کی پشت پر ہاتھ مارنا) ہے، آواز نکالنا نہیں۔",
                "یہ حکم مردوں اور عورتوں کے درمیان فرق کو واضح کرتا ہے تاکہ عورت کی آواز کا پردہ (ستر) قائم رہے۔",
                "عورتوں کے لیے تسبیح سے منع نہیں کیا گیا لیکن تالی بجانا زیادہ مستحب ہے تاکہ بلاوجہ آواز بلند نہ ہو۔"
              ],
              "english": [
                "The method for women to alert the Imām is by clapping (striking one hand on the back of the other), without raising their voice excessively.",
                "This ruling emphasizes the distinction between men and women, maintaining the woman's modesty (Satr al-Ṣawt).",
                "Women are not strictly forbidden from Tasbīḥ, but clapping is more recommended to avoid unnecessarily raising their voice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور فقہی حکمت",
        "english": "Ethical and Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کی آواز کا پردہ",
              "english": "Modesty of the Woman's Voice"
            },
            "content": {
              "urdu": [
                "عورتوں کو تالی بجانے کا حکم دے کر یہ اصول واضح کیا گیا کہ جہاں ضرورت نہ ہو، وہاں عورت کی آواز کو بھی پردہ میں رکھا جائے۔",
                "یہ حکم پردہ کے شرعی اصول کی تائید کرتا ہے کہ عورت کی آواز بھی فتنے کا سبب بن سکتی ہے۔",
                "اگر تالی سے مقصد حاصل نہ ہو تو بعض فقہاء نے ضرورت کے تحت آہستگی سے تسبیح کی اجازت دی ہے۔"
              ],
              "english": [
                "By commanding women to clap, the principle is established that a woman's voice should be modest where not necessary.",
                "This ruling supports the legal principle of Ḥijāb (covering), recognizing that a woman's voice can also be a source of temptation (Fitnah).",
                "If clapping is ineffective, some jurists allow quiet Tasbīḥ out of necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کا تسلسل",
              "english": "Continuity of Prayer"
            },
            "content": {
              "urdu": [
                "مذکورہ بالا طریقے نماز کے تسلسل اور اس کی عبادت کی حالت کو برقرار رکھتے ہیں۔",
                "اذان کے بعد نماز میں گفتگو کی مکمل ممانعت کے بعد یہ طریقے ضروری سمجھے گئے تاکہ امام کو غلطی پر چھوڑا نہ جائے۔",
                "یہ حکم اس بات کی تاکید ہے کہ عبادت میں غلطی کی اصلاح اللہ کے ذکر سے ہی ہونی چاہیے۔"
              ],
              "english": [
                "These methods maintain the continuity of the prayer and its state of worship.",
                "After the absolute prohibition of speech in prayer, these methods became necessary to ensure the Imām is not left in error.",
                "This ruling emphasizes that correcting mistakes in worship must be done through the remembrance of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عمومی آداب",
        "english": "General Manners"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباع اور اجتناب",
              "english": "Following and Abstaining"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے تالی بجانا اور عورتوں کے لیے باآواز تسبیح کرنا مکروہ ہے، کیونکہ یہ سنت کے خلاف ہے۔",
                "ہر فرد کو ان آداب کی پیروی کرنی چاہیے تاکہ ان کی نماز مکمل سنت کے مطابق ادا ہو۔",
                "مسلم کی روایت میں «فِي اَلصَّلَاةِ» کا اضافہ اس عمل کو صرف نماز تک محدود کرتا ہے۔"
              ],
              "english": [
                "It is disliked (Makrūh) for men to clap and for women to use loud Tasbīḥ, as this is contrary to the Sunnah.",
                "Everyone should adhere to these manners to ensure their prayer is performed fully according to the Sunnah.",
                "Muslim's addition of 'in the prayer' restricts this action only to the context of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام کی ذمہ داری",
              "english": "The Imām's Responsibility"
            },
            "content": {
              "urdu": [
                "امام کو چاہیے کہ وہ تسبیح یا تالی بجنے پر فوراً اپنی غلطی پر توجہ دے اور اسے درست کرے۔",
                "اگر امام کو مقتدیوں کے عمل سے اپنی غلطی کا احساس ہو جائے تو اسے ان کی طرف مڑے بغیر اصلاح کرنی چاہیے۔",
                "یہ حکم امام اور مقتدیوں کے درمیان روحانی ربط اور نظم و ضبط کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Imām must immediately pay attention to the Tasbīḥ or clapping and correct his error.",
                "If the Imām realizes his mistake through the actions of the followers, he should correct it without turning to them.",
                "This ruling demonstrates the spiritual connection and discipline between the Imām and the congregation."
              ]
            }
          }
        ]
      }
    }
  ]
}
