{
  "hadithId": 518,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/518"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1471). والحديث يحث على العمل اليدوي والاستغناء عن الناس.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (1471) نے اسے اپنی صحیح میں روایت کیا ہے۔ یہ حدیث ہاتھ سے کام کرنے اور لوگوں سے بے نیازی پر ابھارتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1471). This Hadith encourages manual labor and self-reliance rather than dependency on others."
  },
  "importantWords": [
    {
      "arabic": "حَبْلَهُ",
      "english": "His rope",
      "urdu": "اس کی رسی"
    },
    {
      "arabic": "حُزْمَةِ",
      "english": "Bundle",
      "urdu": "گٹھا"
    },
    {
      "arabic": "اَلْحَطَبِ",
      "english": "Firewood",
      "urdu": "لکڑیاں"
    },
    {
      "arabic": "يَكُفَّ",
      "english": "Preserves / Protects",
      "urdu": "روک لیتا ہے / بچا لیتا ہے"
    },
    {
      "arabic": "وَجْهَهُ",
      "english": "His face / Dignity",
      "urdu": "اس کا چہرہ / آبرو"
    },
    {
      "arabic": "مَنَعُوهُ",
      "english": "They refuse him",
      "urdu": "وہ اسے نہ دیں / منع کر دیں"
    }
  ],
  "summary": {
    "urdu": "محنت مزدوری کر کے رزقِ حلال کمانا چاہے وہ کتنا ہی چھوٹا کام کیوں نہ ہو، لوگوں کے سامنے ہاتھ پھیلانے سے بدرجہا بہتر اور باعثِ عزت ہے۔",
    "english": "Earning a lawful living through manual labor, regardless of how modest the task, is far superior and more honorable than begging from others."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1471)",
      "english": "Sahih al-Bukhari (1471)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "الزبير بن العوام رضي الله عنه",
        "english": "Az-Zubair bin al-Awwam"
      },
      "slug": "az-zubair-bin-al-awwam"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "محنت کی عظمت",
        "english": "Dignity of Labor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہاتھ کی کمائی کی فضیلت",
              "english": "Virtue of Earning by Hand"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے لکڑیاں کاٹ کر بیچنے جیسے محنت طلب کام کو مانگنے پر ترجیح دی ہے۔",
                "اسلام میں کوئی بھی حلال پیشہ حقیر یا چھوٹا نہیں ہے اگر وہ آبرو بچاتا ہو۔",
                "انبیاء کرام علیہم السلام نے بھی محنت مزدوری اور تجارت کو اپنایا تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) preferred manual labor like cutting and selling wood over begging.",
                "In Islam, no lawful occupation is lowly or insignificant if it preserves one's dignity.",
                "The Prophets (peace be upon them) also engaged in manual labor and trade."
              ]
            }
          },
          {
            "title": {
              "urdu": "باعزت روزگار",
              "english": "Honorable Employment"
            },
            "content": {
              "urdu": [
                "اپنی پشت پر بوجھ اٹھانا دوسروں کے احسان تلے دبنے سے بہتر ہے۔",
                "محنت کرنے والا اللہ کا دوست ہے اور معاشرے کا معزز رکن ہے۔",
                "جسمانی مشقت انسان کو ذہنی اور روحانی طور پر مضبوط بناتی ہے۔"
              ],
              "english": [
                "Carrying a burden on one's own back is better than being under people's favors.",
                "The hardworking person is a friend of Allah and an honorable member of society.",
                "Physical labor strengthens a person mentally and spiritually."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آبرو کی حفاظت",
        "english": "Preserving Dignity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چہرے کا وقار",
              "english": "Dignity of the Face"
            },
            "content": {
              "urdu": [
                "لوگوں سے مانگنا انسانی شخصیت اور چہرے کے وقار کو ختم کر دیتا ہے۔",
                "رزقِ حلال کی تگ و دو انسان کو لوگوں کی ملامت اور احسان سے بچاتی ہے۔",
                "اللہ تعالی محنت کرنے والے کے چہرے کو دنیا اور آخرت میں رسوائی سے بچاتا ہے۔"
              ],
              "english": [
                "Begging from people destroys human personality and the dignity of the face.",
                "Striving for Halal provision saves a person from people's reproach and favors.",
                "Allah protects the face of the hardworking person from disgrace in both worlds."
              ]
            }
          },
          {
            "title": {
              "urdu": "لوگوں سے بے نیازی",
              "english": "Self-Reliance"
            },
            "content": {
              "urdu": [
                "مانگنے والا ہمیشہ دوسروں کے رحم و کرم پر ہوتا ہے جو کہ ذلت ہے۔",
                "لوگوں کے 'دینے یا نہ دینے' کی فکر سے آزادی صرف محنت میں ہے۔",
                "استغناء اور خودداری مومن کا اصل زیور اور طاقت ہے۔"
              ],
              "english": [
                "The one who begs is always at the mercy of others, which is a form of humiliation.",
                "Freedom from the worry of 'giving or refusing' only comes through labor.",
                "Self-sufficiency and self-respect are the true ornaments and strength of a believer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی پیغام",
        "english": "Social Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گداگری کا سدِ باب",
              "english": "Eliminating Beggary"
            },
            "content": {
              "urdu": [
                "یہ حدیث معاشرے سے پیشہ ورانہ بھیک مانگنے کے خاتمے کی بنیاد فراہم کرتی ہے۔",
                "اگر ہر تندرست شخص محنت کو شعار بنائے تو معاشی مسائل حل ہو سکتے ہیں۔",
                "اسلام ہاتھ پاؤں توڑ کر بیٹھنے کے بجائے حرکت اور جدوجہد کا درس دیتا ہے۔"
              ],
              "english": [
                "This Hadith provides the basis for eliminating professional beggary from society.",
                "If every healthy person adopts labor, economic problems can be solved.",
                "Islam teaches action and struggle instead of remaining idle and helpless."
              ]
            }
          },
          {
            "title": {
              "urdu": "حلال رزق کی برکت",
              "english": "Blessings of Halal Provision"
            },
            "content": {
              "urdu": [
                "تھوڑی سی حلال کمائی حرام کے بڑے ڈھیر سے بہتر اور بابرکت ہے۔",
                "اپنے خون پسینے کی کمائی میں جو سکون ہے وہ مفت کے مال میں نہیں۔",
                "حلال رزق دعا کی قبولیت اور نیک اعمال کی بنیاد ہے۔"
              ],
              "english": [
                "A small amount of Halal income is better and more blessed than a pile of Haram.",
                "The peace found in one's own hard-earned income is absent in free money.",
                "Halal provision is the foundation for accepted prayers and good deeds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خود کفالت کی کوشش",
              "english": "Striving for Self-Sufficiency"
            },
            "content": {
              "urdu": [
                "ہمیں چھوٹے سے چھوٹے کام کو کرنے میں عار محسوس نہیں کرنی چاہیے۔",
                "نوجوانوں کو ہنر سیکھنے اور اپنے پاؤں پر کھڑے ہونے کی فکر کرنی چاہیے۔",
                "معاشی تنگی میں بھی صبر اور محنت کا دامن نہیں چھوڑنا چاہیے۔"
              ],
              "english": [
                "We should not feel ashamed of performing even the smallest tasks.",
                "Youth should focus on learning skills and standing on their own feet.",
                "One should not abandon patience and hard work even during economic hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ پر توکل",
              "english": "Reliance on Allah"
            },
            "content": {
              "urdu": [
                "بندہ محنت کرے اور برکت کے لیے اللہ کی ذات پر بھروسہ رکھے۔",
                "رزق کے اسباب پیدا کرنا سنت ہے اور نتیجہ اللہ کے ہاتھ میں ہے۔",
                "جو اللہ کے لیے مشقت اٹھاتا ہے، اللہ اسے کبھی تنہا نہیں چھوڑتا۔"
              ],
              "english": [
                "A servant should labor and trust in Allah for the resulting blessings.",
                "Creating the means for provision is Sunnah, while the outcome is with Allah.",
                "Whoever endures hardship for Allah's sake, Allah never leaves them alone."
              ]
            }
          }
        ]
      }
    }
  ]
}