{
  "hadithId": 505,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/505"],
    "kitabId": 4,
    "inKitabBab": 2,
    "arabicBook": "كتاب الزكاة",
    "babId": 30
  },
  
  "takhreej": {
    "arabic": "صحيح البخاري (1503)، صحيح مسلم (984). أما زيادة 'أغنوهم عن الطواف' فرواها الدارقطني (2/152) وابن عدي في الكامل (7/2519) وإسنادها ضعيف.",
    "urdu": "اصل حدیث صحیح ہے، اسے بخاری (1503) اور مسلم (984) نے روایت کیا ہے۔ 'اغنوهم' والی زیادتی دارقطنی اور ابن عدی نے روایت کی ہے جو کہ ضعیف ہے۔",
    "english": "The main Hadith is Sahih, reported by Al-Bukhari (1503) and Muslim (984). The addition 'relieve them from wandering' was reported by Ad-Daraqutni and Ibn Adi with a weak chain."
  },
  "importantWords": [
    {
      "arabic": "فَرَضَ",
      "english": "Enjoined/Obligated",
      "urdu": "فرض کیا / واجب کیا"
    },
    {
      "arabic": "زَكَاةَ اَلْفِطْرِ",
      "english": "Alms of Fast-breaking",
      "urdu": "صدقہ فطر"
    },
    {
      "arabic": "صَاعًا",
      "english": "Sa' (Measurement)",
      "urdu": "ایک صاع (وزن)"
    },
    {
      "arabic": "تَمْرٍ",
      "english": "Dates",
      "urdu": "کھجور"
    },
    {
      "arabic": "شَعِيرٍ",
      "english": "Barley",
      "urdu": "جو"
    },
    {
      "arabic": "اغْنُوهُمْ",
      "english": "Enrich/Relieve them",
      "urdu": "انہیں غنی کر دو"
    }
  ],
  "summary": {
    "urdu": "رسول اللہ ﷺ نے ہر مسلمان پر صدقہ فطر واجب قرار دیا ہے تاکہ غریب عید کے دن سوال کرنے سے بچیں اور اسے عید کی نماز سے پہلے ادا کرنا ضروری ہے۔",
    "english": "The Prophet (ﷺ) made Zakat-ul-Fitr obligatory for every Muslim to ensure the poor do not have to beg on Eid day, emphasizing its payment before the Eid prayer."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1503)",
      "english": "Sahih al-Bukhari (1503)"
    },
    {
      "arabic": "صحيح مسلم (984)",
      "english": "Sahih Muslim (984)"
    },
    {
      "arabic": "سنن الدارقطني (2/152)",
      "english": "Sunan al-Daraqutni (2/152)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر رضي الله عنهما",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح (والزيادة ضعيفة)",
    "english": "Sahih (The addition is weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صدقہ فطر کا وجوب",
        "english": "Obligation of Zakat-ul-Fitr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہر مسلمان پر ذمہ داری",
              "english": "Responsibility on every Muslim"
            },
            "content": {
              "urdu": [
                "صدقہ فطر ہر مسلمان پر واجب ہے چاہے وہ آزاد ہو یا غلام۔",
                "یہ بچوں، بڑوں، مردوں اور عورتوں سب کی طرف سے ادا کیا جائے گا۔",
                "گھر کا سربراہ اپنے ماتحت تمام افراد کی طرف سے اسے ادا کرنے کا ذمہ دار ہے۔"
              ],
              "english": [
                "Zakat-ul-Fitr is obligatory on every Muslim, whether free or slave.",
                "It must be paid for children, adults, males, and females alike.",
                "The head of the household is responsible for paying it for all dependents."
              ]
            }
          },
          {
            "title": {
              "urdu": "فطرانے کی مقدار",
              "english": "Quantity of Fitrana"
            },
            "content": {
              "urdu": [
                "حدیث میں فطرانے کی مقدار ایک صاع مقرر کی گئی ہے۔",
                "ایک صاع تقریبا ڈھائی سے تین کلو گرام کے برابر ہوتا ہے۔",
                "اس میں کھجور، جو، گندم یا علاقائی خوراک دی جا سکتی ہے۔"
              ],
              "english": [
                "The quantity specified in the Hadith is one Sa' for each person.",
                "One Sa' is approximately equivalent to 2.5 to 3 kilograms.",
                "It can be given in dates, barley, wheat, or common local food staples."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ادائیگی کا وقت",
        "english": "Time of Payment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمازِ عید سے پہلے ادائیگی",
              "english": "Payment before Eid Prayer"
            },
            "content": {
              "urdu": [
                "فطرانہ عید کی نماز کے لیے نکلنے سے پہلے ادا کرنا سنت ہے۔",
                "اگر کوئی اسے نماز کے بعد ادا کرے گا تو وہ عام صدقہ شمار ہوگا۔",
                "عید سے ایک یا دو دن پہلے بھی اسے ادا کرنا جائز ہے۔"
              ],
              "english": [
                "It is Sunnah to pay Fitrana before leaving for the Eid prayer.",
                "If paid after the prayer, it is considered ordinary charity, not Fitrana.",
                "It is permissible to pay it one or two days before Eid."
              ]
            }
          },
          {
            "title": {
              "urdu": "تاخیر کی ممانعت",
              "english": "Prohibition of Delay"
            },
            "content": {
              "urdu": [
                "نمازِ عید تک تاخیر کرنا اس کے اصل مقصد کے خلاف ہے۔",
                "بلا عذر عید کے دن سے زیادہ تاخیر کرنا گناہ ہے۔",
                "وقت پر ادائیگی ہی اسے زکاۃ الفطر کا درجہ دیتی ہے۔"
              ],
              "english": [
                "Delaying it until after the Eid prayer goes against its primary purpose.",
                "Delaying beyond the day of Eid without a valid reason is sinful.",
                "Timely payment is what qualifies it specifically as Zakat-ul-Fitr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور مقصد",
        "english": "Wisdom and Purpose"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزوں کی پاکیزگی",
              "english": "Purification of Fasts"
            },
            "content": {
              "urdu": [
                "صدقہ فطر روزوں کے دوران ہونے والی کوتاہیوں کا کفارہ ہے۔",
                "یہ لغو اور بیہودہ باتوں سے روزے کو پاک کرتا ہے۔",
                "یہ اللہ کی دی ہوئی توفیق پر شکر گزاری کا ایک ذریعہ ہے۔"
              ],
              "english": [
                "Zakat-ul-Fitr acts as expiation for mistakes made during fasting.",
                "It purifies the fast from idle talk or minor obscenities.",
                "It serves as a means of gratitude for Allah's guidance during Ramadan."
              ]
            }
          },
          {
            "title": {
              "urdu": "غرباء کی خوشی",
              "english": "Happiness of the Poor"
            },
            "content": {
              "urdu": [
                "اس کا مقصد عید کے دن مساکین کی ضرورت کو پورا کرنا ہے۔",
                "تاکہ عید کے دن غریبوں کو کسی کے سامنے ہاتھ نہ پھیلانا پڑے۔",
                "یہ معاشرے میں محبت اور ہمدردی کے جذبات کو فروغ دیتا ہے۔"
              ],
              "english": [
                "The goal is to provide for the needs of the poor on Eid day.",
                "It ensures that the needy do not have to beg during the festivities.",
                "It promotes feelings of love and compassion within the Muslim community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قیمت کی ادائیگی",
              "english": "Payment in Value"
            },
            "content": {
              "urdu": [
                "حدیث میں اناج کا ذکر ہے جو کہ اصل سنت ہے۔",
                "بعض فقہاء ضرورت کے تحت قیمت کی ادائیگی کو بھی جائز قرار دیتے ہیں۔",
                "احتیاط اسی میں ہے کہ جو اناج حدیث میں مذکور ہے وہی دیا جائے۔"
              ],
              "english": [
                "The Hadith mentions food items, which is the original Sunnah.",
                "Some jurists permit paying the value in cash based on necessity.",
                "It is more cautious to provide the actual food items mentioned."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستحقین کا تعین",
              "english": "Determining Recipients"
            },
            "content": {
              "urdu": [
                "صدقہ فطر کے مستحق وہی لوگ ہیں جو زکاۃ کے مستحق ہیں۔",
                "غریب اور مساکین اس کے سب سے زیادہ حقدار ہیں۔",
                "اپنے قریبی ضرورت مند رشتہ داروں کو دینا دوہرے ثواب کا باعث ہے۔"
              ],
              "english": [
                "Those eligible for Zakat-ul-Fitr are the same as Zakat recipients.",
                "The poor and the needy have the foremost right to receive it.",
                "Giving it to needy relatives brings a double reward."
              ]
            }
          }
        ]
      }
    }
  ]
}