{
  "hadithId": 605,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/605"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 39
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2129)، ومسلم (1360). واللفظ لمسلم، ولفظ البخاري 'مثل' بدل 'بمثلي'.",
    "urdu": "صحیح۔ اسے بخاری (2129) اور مسلم (1360) نے روایت کیا ہے۔ یہ الفاظ مسلم کے ہیں، بخاری میں 'مثل' (برابر) کے الفاظ ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (2129) and Muslim (1360). The wording is from Muslim; Al-Bukhari's version uses 'equal to' instead of 'twice as much'."
  },
  "importantWords": [
    {
      "arabic": "حَرَّمَ",
      "english": "Declared sanctuary / Prohibited",
      "urdu": "حرام قرار دیا / حرمت دی"
    },
    {
      "arabic": "صَاعِهَا",
      "english": "Its Sa' (Unit of measure)",
      "urdu": "مدینہ کا صاع"
    },
    {
      "arabic": "مُدِّهَا",
      "english": "Its Mudd (Unit of measure)",
      "urdu": "مدینہ کا مد"
    },
    {
      "arabic": "بِمِثْلَيْ",
      "english": "Twice as much / Double",
      "urdu": "دو گنا"
    },
    {
      "arabic": "دَعَا",
      "english": "Prayed / Invoked",
      "urdu": "دعا کی"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے مدینہ منورہ کو مکہ کی طرح حرم (خون ریزی اور شکار سے پاک) قرار دیا اور اس کے رزق و پیمانوں میں خصوصی برکت کی دعا فرمائی۔",
    "english": "The Prophet (ﷺ) declared Madinah a sacred sanctuary like Makkah and invoked special, doubled blessings for its food measures and sustenance."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2129)",
      "english": "Reported by Al-Bukhari (2129)"
    },
    {
      "arabic": "رواه مسلم (1360)",
      "english": "Reported by Muslim (1360)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن زيد بن عاصم",
        "english": "Abdullah bin Zaid bin 'Asim"
      },
      "slug": "abdullah-bin-zaid-bin-asim"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYI7H7_nO6o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرمِ مدینہ کی حقیقت",
        "english": "The Reality of Madinah's Sanctuary"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرمت کی مماثلت",
              "english": "Similarity in Sanctity"
            },
            "content": {
              "urdu": [
                "جس طرح مکہ میں شکار کرنا اور درخت کاٹنا منع ہے، نبی ﷺ نے مدینہ کی حدود میں بھی ان کاموں کو حرام قرار دیا۔",
                "حضرت ابراہیم علیہ السلام کی نسبت مکہ سے ہے جبکہ نبی ﷺ کی نسبت اور جائے ہجرت مدینہ ہے۔",
                "یہ فرمان مدینہ منورہ کی عظمت اور فضیلت پر صریح دلیل ہے۔"
              ],
              "english": [
                "Just as hunting and cutting trees are forbidden in Makkah, the Prophet (ﷺ) prohibited them within Madinah's boundaries.",
                "Prophet Ibrahim (AS) is linked to Makkah, while Prophet Muhammad (ﷺ) is linked to Madinah, his place of migration.",
                "This statement is a clear proof of the greatness and virtue of Madinah Munawwarah."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرمِ مدینہ کی حدود",
              "english": "Boundaries of Madinah's Haram"
            },
            "content": {
              "urdu": [
                "مدینہ کا حرم پہاڑ 'عیر' سے لے کر پہاڑ 'ثور' تک پھیلا ہوا ہے۔",
                "ان حدود کے اندر کسی مسلمان کے لیے خون ریزی کرنا یا کسی بدعتی کو پناہ دینا سخت گناہ ہے۔",
                "اہلِ مدینہ کی حفاظت اور شہر کا امن اللہ اور اس کے رسول ﷺ کی ترجیح ہے۔"
              ],
              "english": [
                "The sanctuary of Madinah extends between the mountains of 'Air and Thaur.",
                "Shedding blood or shielding an innovator within these limits is a severe sin.",
                "The protection of the people of Madinah and the city's peace are priorities for Allah and His Messenger (ﷺ)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مدینہ کے رزق میں برکت",
        "english": "Blessings in Madinah's Sustenance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیمانوں (صاع اور مد) میں برکت",
              "english": "Blessings in Measures (Sa' and Mudd)"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے خاص طور پر مدینہ کے غلے کے پیمانوں کے لیے دعا فرمائی۔",
                "اس دعا کا اثر یہ ہے کہ مدینہ کا تھوڑا کھانا بھی زیادہ لوگوں کے لیے کافی ہو جاتا ہے۔",
                "مدینہ کی برکت روحانی بھی ہے اور مادی (رزق کی صورت میں) بھی۔"
              ],
              "english": [
                "The Prophet (ﷺ) specifically prayed for the food measures used in Madinah.",
                "The effect of this dua is that even a small amount of food in Madinah suffices for many people.",
                "The blessing of Madinah is both spiritual and material (in terms of sustenance)."
              ]
            }
          },
          {
            "title": {
              "urdu": "مکہ پر فضیلت کا پہلو",
              "english": "Aspect of Virtue over Makkah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے مدینہ کے لیے 'دوگنی' (بمثلی) برکت کی دعا کی جو ابراہیم علیہ السلام کی دعا سے بھی زیادہ ہے۔",
                "یہ نبی ﷺ کی اپنی جائے ہجرت اور انصارِ مدینہ سے محبت کا اظہار ہے۔",
                "مدینہ کی کھجوریں اور پھل آج بھی اپنی لذت اور برکت میں بے مثال ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) prayed for 'double' blessings for Madinah, exceeding the invocation of Ibrahim (AS) for Makkah.",
                "This expresses the Prophet's (ﷺ) love for his place of migration and the Ansar.",
                "The dates and fruits of Madinah remain unparalleled in their taste and perceived blessing today."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرمت کا احترام",
              "english": "Respecting the Sanctuary"
            },
            "content": {
              "urdu": [
                "مسلمانوں پر لازم ہے کہ وہ مدینہ منورہ میں قیام کے دوران اس کے آداب کا خیال رکھیں۔",
                "وہاں کے درختوں، جانوروں اور ماحول کو نقصان پہنچانا شرعاً ناپسندیدہ ہے۔",
                "مقدس مقامات کی حرمت کا پاس رکھنا ایمان کا حصہ ہے۔"
              ],
              "english": [
                "Muslims must observe proper etiquette while staying in Madinah Munawwarah.",
                "Harming the trees, animals, or environment there is religiously discouraged.",
                "Respecting the sanctity of holy places is a component of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی طاقت",
              "english": "The Power of Supplication"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی دعائیں صدیوں بعد بھی مدینہ میں برکتوں کی صورت میں موجود ہیں۔",
                "انسان کو چاہیے کہ وہ اپنے شہر، گھر اور رزق میں برکت کے لیے اللہ سے دعا کرتا رہے۔",
                "رزق میں برکت کا مطلب صرف اس کی مقدار بڑھنا نہیں بلکہ اس سے نفع اٹھانا بھی ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) prayers continue to manifest as blessings in Madinah centuries later.",
                "One should continuously pray to Allah for blessings in their city, home, and sustenance.",
                "Blessing in sustenance doesn't just mean quantity, but also the benefit derived from it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وطن اور جائے قیام سے محبت",
              "english": "Love for One's Homeland and Residence"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے مدینہ سے محبت کی اور اسے بہترین جگہ قرار دیا۔",
                "اپنے علاقے کی بہتری اور برکت کے لیے کوشش اور دعا کرنا سنتِ نبوی ہے۔",
                "مدینہ منورہ صرف ایک شہر نہیں بلکہ اسلام کا مرکز اور سکونِ قلب کا باعث ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) loved Madinah and described it as the best of places.",
                "Striving and praying for the welfare of one's own locality is a Prophetic Sunnah.",
                "Madinah is not just a city; it is the center of Islam and a source of heart's tranquility."
              ]
            }
          },
          {
            "title": {
              "urdu": "شکر گزاری",
              "english": "Gratitude"
            },
            "content": {
              "urdu": [
                "اللہ کی دی ہوئی نعمتوں اور برکتوں کا اعتراف کرنا اور ان کا شکر ادا کرنا چاہیے۔",
                "مدینہ کی زیارت نصیب ہونا اللہ کا بڑا فضل ہے جس پر شکر واجب ہے۔",
                "نبی ﷺ کے احسانات کو یاد رکھنا اور ان کے بتائے ہوئے طریقوں پر چلنا ہی اصل شکر ہے۔"
              ],
              "english": [
                "One should acknowledge and give thanks for the blessings and barakah granted by Allah.",
                "Being granted a visit to Madinah is a great favor from Allah for which gratitude is due.",
                "True gratitude lies in remembering the favors of the Prophet (ﷺ) and following his path."
              ]
            }
          }
        ]
      }
    }
  ]
}