{
  "hadithId": 626,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh-al-maram/6/46"
    ],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1670)، ومسلم (1281). وهذا الحديث يدل على توقيت قطع التلبية للحاج.",
    "urdu": "صحیح۔ اسے امام بخاری (1670) اور امام مسلم (1281) نے روایت کیا ہے۔ یہ حدیث اس بات کی دلیل ہے کہ حاجی کو تلبیہ کب ختم کرنا چاہیے۔",
    "english": "Sahih. Reported by Al-Bukhari (1670) and Muslim (1281). This Hadith indicates the specific time when a pilgrim should stop reciting the Talbiyah."
  },
  "importantWords": [
    {
      "arabic": "لَمْ يَزَلْ",
      "english": "Kept on / Continued",
      "urdu": "مسلسل / برابر"
    },
    {
      "arabic": "يُلَبِّي",
      "english": "Reciting Talbiyah",
      "urdu": "تلبیہ (لبیک) پکارنا"
    },
    {
      "arabic": "رَمَى",
      "english": "Stoned / Threw pebbles",
      "urdu": "کنکریاں مارنا"
    },
    {
      "arabic": "جَمْرَةَ اَلْعَقَبَةِ",
      "english": "The Jamrah of Aqabah",
      "urdu": "جمرہ عقبہ (بڑا شیطان)"
    }
  ],
  "summary": {
    "urdu": "حاجی کے لیے مسنون یہ ہے کہ وہ احرام باندھنے سے لے کر 10 ذوالحجہ کو جمرہ عقبہ کی رمی شروع کرنے تک بلند آواز سے تلبیہ پکارتا رہے، رمی شروع کرتے ہی تلبیہ ختم کر دیا جاتا ہے۔",
    "english": "It is Sunnah for a pilgrim to continue reciting the Talbiyah from the moment of entering Ihram until the start of stoning the Jamrat-ul-Aqabah on the 10th of Dhul-Hijjah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1670)",
      "english": "Sahih al-Bukhari (1670)"
    },
    {
      "arabic": "صحيح مسلم (1281)",
      "english": "Sahih Muslim (1281)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أسامة بن زيد",
        "english": "Usama bin Zaid"
      },
      "slug": "usama-bin-zaid"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تلبیہ کا وقت اور خاتمہ",
        "english": "Duration and End of Talbiyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمی تک تسلسل",
              "english": "Continuity Until Stoning"
            },
            "content": {
              "urdu": [
                "حاجی جب احرام باندھتا ہے تو اس کا سب سے افضل ذکر 'تلبیہ' (لبیک اللھم لبیک) ہے۔",
                "نبی ﷺ نے مزدلفہ سے منیٰ جاتے ہوئے بھی تلبیہ جاری رکھا۔",
                "جیسے ہی 10 ذوالحجہ کو پہلی کنکری ماری جاتی ہے، تلبیہ کا وقت ختم ہو جاتا ہے اور اس کی جگہ 'تکبیر' (اللہ اکبر) شروع ہو جاتی ہے۔"
              ],
              "english": [
                "The most virtuous remembrance for a pilgrim in Ihram is the Talbiyah.",
                "The Prophet (ﷺ) continued reciting it even during the transition from Muzdalifah to Mina.",
                "The moment the first pebble is thrown at Jamrat-ul-Aqabah on the 10th of Dhul-Hijjah, Talbiyah stops and Takbir (Allah-u-Akbar) begins."
              ]
            }
          },
          {
            "title": {
              "urdu": "حج اور عمرہ میں فرق",
              "english": "Difference Between Hajj and Umrah"
            },
            "content": {
              "urdu": [
                "حج میں تلبیہ جمرہ عقبہ کی رمی تک جاری رہتا ہے۔",
                "عمرہ کرنے والا تلبیہ اس وقت بند کرتا ہے جب وہ طواف شروع کرنے کے لیے حجرِ اسود کے سامنے پہنچتا ہے۔",
                "دونوں عبادات میں تلبیہ کے ختم ہونے کے مقامات مختلف مقرر کیے گئے ہیں۔"
              ],
              "english": [
                "In Hajj, Talbiyah continues until the stoning of the large Jamrah.",
                "In Umrah, the pilgrim stops the Talbiyah upon reaching the Black Stone to begin Tawaf.",
                "Specific points for ending the Talbiyah are designated for both acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی رہنمائی اور حکمت",
        "english": "Prophetic Guidance and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکر کی تبدیلی",
              "english": "Transition of Dhikr"
            },
            "content": {
              "urdu": [
                "تلبیہ اللہ کی پکار پر حاضری کا اعلان ہے، جبکہ رمی اور قربانی اللہ کی بڑائی (تکبیر) کے مظاہر ہیں۔",
                "عبادت کے بدلتے ہوئے مراحل کے ساتھ ذکر کے الفاظ کا بدلنا بندگی کے تنوع کو ظاہر کرتا ہے۔",
                "نبی ﷺ کا عمل ہمیں سکھاتا ہے کہ ہر وقت اللہ کی یاد میں رہنا چاہیے۔"
              ],
              "english": [
                "Talbiyah is an announcement of presence, while stoning and sacrifice are manifestations of Allah's greatness (Takbir).",
                "Changing the words of Dhikr as the rituals progress reflects the diversity of servitude.",
                "The Prophet's (ﷺ) practice teaches us to remain in constant remembrance of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو",
        "english": "Juristic Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور کا موقف",
              "english": "Position of the Majority"
            },
            "content": {
              "urdu": [
                "چاروں ائمہ (ابوحنیفہ، مالک، شافعی اور احمد) اس بات پر متفق ہیں کہ رمی شروع ہونے پر تلبیہ ختم کر دیا جائے گا۔",
                "یہ حدیث اس مسئلے پر سب سے مضبوط اور واضح دلیل ہے۔",
                "حاجی کو چاہیے کہ وہ رمی کے وقت ہر کنکری کے ساتھ 'اللہ اکبر' کہے۔"
              ],
              "english": [
                "The four Imams agree that Talbiyah should cease at the commencement of stoning.",
                "This Hadith is the strongest and clearest evidence on this matter.",
                "The pilgrim should say 'Allah-u-Akbar' with every pebble thrown during Rami."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استقامت اور لگن",
              "english": "Steadfastness and Dedication"
            },
            "content": {
              "urdu": [
                "سفرِ حج کی تھکاوٹ کے باوجود زبان کو ذکر سے تر رکھنا مومن کی شان ہے۔",
                "نبی ﷺ نے آخری وقت تک سنت کی پابندی کر کے امت کے لیے نمونہ چھوڑا۔",
                "عبادت کے آداب کو باریکی سے سیکھنا اور ان پر عمل کرنا ہی اصل کامیابی ہے۔"
              ],
              "english": [
                "Keeping the tongue moist with Dhikr despite the exhaustion of the Hajj journey is the mark of a believer.",
                "The Prophet (ﷺ) modeled strict adherence to Sunnah until the very end of the rituals.",
                "True success lies in meticulously learning and practicing the etiquettes of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}