{
  "hadithId": 1010,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1160"],
    "kitabId": 9,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام",
    "babId": 80
  },
  
  "takhreej": {
    "arabic": "صحيح موقوفاً وضعيف مرفوعاً. رواه الدارقطني (3/250)، وأخرجه الأربعة: أبو داود (4544)، والترمذي (1386)، والنسائي (4801)، وابن ماجه (2631). الموقوف أصح.",
    "urdu": "یہ روایت موقوفاً (صحابہ کے قول کے طور پر) صحیح ہے لیکن مرفوعاً (نبی ﷺ کے فرمان کے طور پر) ضعیف ہے۔ اسے دارقطنی اور چاروں کتبِ سنن نے روایت کیا ہے۔",
    "english": "Sahih as Mauquf (statement of a companion) and weak as Marfu'. Reported by ad-Daraqutni (3/250) and the four Sunan: Abu Dawud (4544), At-Tirmidhi (1386), An-Nasa'i (4801), and Ibn Majah (2631)."
  },
  "importantWords": [
    {
      "arabic": "دِيَةُ اَلْخَطَأَ",
      "english": "Blood-money for accidental killing",
      "urdu": "قتلِ خطا کی دیت"
    },
    {
      "arabic": "أَخْمَاسًا",
      "english": "In five categories",
      "urdu": "پانچ حصوں میں"
    },
    {
      "arabic": "حِقَّةً",
      "english": "3-year-old she-camel",
      "urdu": "تین سالہ اونٹنی"
    },
    {
      "arabic": "جَذَعَةً",
      "english": "4-year-old she-camel",
      "urdu": "چار سالہ اونٹنی"
    },
    {
      "arabic": "بَنَاتِ مَخَاضٍ",
      "english": "1-year-old she-camel",
      "urdu": "ایک سالہ اونٹنی"
    },
    {
      "arabic": "بَنَاتِ لَبُونٍ",
      "english": "2-year-old she-camel",
      "urdu": "دو سالہ اونٹنی"
    },
    {
      "arabic": "بَنِي لَبُونٍ",
      "english": "2-year-old male camel",
      "urdu": "دو سالہ اونٹ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں قتلِ خطا کی دیت (خون بہا) کی تفصیل بیان کی گئی ہے، جس میں 100 اونٹوں کو پانچ مختلف عمر کے گروپوں میں تقسیم کیا گیا ہے۔",
    "english": "This Hadith details the compensation (Diyat) for accidental homicide, consisting of 100 camels divided into five specific age groups."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني (3/250)",
      "english": "Sunan ad-Daraqutni (3/250)"
    },
    {
      "arabic": "سنن أبي داود (4544)",
      "english": "Sunan Abu Dawud (4544)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah bin Mas'ud"
      },
      "slug": "abdullah-bin-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح موقوفاً",
    "english": "Sahih Mauquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قتلِ خطا کی دیت کی تقسیم",
        "english": "Distribution of Accidental Diyat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانچ اقسام کے اونٹ",
              "english": "Five Types of Camels"
            },
            "content": {
              "urdu": [
                "قتلِ خطا کی دیت میں کل 100 اونٹ دیے جاتے ہیں۔",
                "ان 100 اونٹوں کو 20، 20 کی پانچ اقسام میں تقسیم کیا جاتا ہے۔",
                "اس تقسیم کا مقصد قاتل پر بوجھ کم کرنا ہے کیونکہ یہ قتل ارادی نہیں ہوتا۔"
              ],
              "english": [
                "The total Diyat for accidental killing is 100 camels.",
                "These 100 camels are divided into five categories of 20 each.",
                "This distribution aims to ease the burden on the killer since the act was unintentional."
              ]
            }
          },
          {
            "title": {
              "urdu": "اونٹوں کی عمریں",
              "english": "Ages of the Camels"
            },
            "content": {
              "urdu": [
                "مختلف عمروں کے اونٹ شامل کرنا دیت کی قیمت کو متوازن بناتا ہے۔",
                "بنت مخاض (1 سال)، بنت لبون (2 سال)، حقہ (3 سال) اور جذعہ (4 سال) کے اونٹ شامل ہیں۔",
                "اس میں نر اونٹوں (بنی لبون) کی شمولیت احناف اور دیگر فقہاء کے درمیان بحث کا موضوع ہے۔"
              ],
              "english": [
                "Including camels of various ages balances the total value of the Diyat.",
                "It includes Bint Makhad (1 yr), Bint Labun (2 yr), Hiqqah (3 yr), and Jadha'ah (4 yr).",
                "The inclusion of male camels (Bani Labun) is a point of discussion among jurists."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دیت کی ادائیگی کی ذمہ داری",
        "english": "Responsibility for Paying Diyat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاقلہ کی ذمہ داری",
              "english": "Liability of the Aqilah"
            },
            "content": {
              "urdu": [
                "قتلِ خطا میں دیت کی ادائیگی قاتل کے خاندان (عاقلہ) پر ہوتی ہے۔",
                "یہ اسلامی معاشرے میں باہمی تعاون اور سماجی تحفظ کا ایک نظام ہے۔",
                "ادائیگی کی مدت عام طور پر تین سال ہوتی ہے تاکہ خاندان پر بوجھ نہ پڑے۔"
              ],
              "english": [
                "In accidental killing, the liability to pay Diyat falls on the killer's kin (Aqilah).",
                "This is a system of mutual cooperation and social security in Islamic society.",
                "The payment period is usually three years to avoid financial distress for the family."
              ]
            }
          },
          {
            "title": {
              "urdu": "قتلِ خطا بمقابلہ قتلِ عمد",
              "english": "Accidental vs. Intentional"
            },
            "content": {
              "urdu": [
                "قتلِ عمد (ارادی قتل) میں قصاص ہوتا ہے یا سخت دیت (3 اقسام میں)۔",
                "قتلِ خطا میں قصاص نہیں ہوتا بلکہ صرف دیت اور کفارہ واجب ہوتا ہے۔",
                "یہ حدیث واضح کرتی ہے کہ جرم کی نوعیت سزا کی شدت کا تعین کرتی ہے۔"
              ],
              "english": [
                "Intentional murder involves Qisas or a heavier Diyat (in 3 categories).",
                "Accidental murder has no Qisas, only Diyat and expiation (Kaffarah).",
                "This Hadith clarifies that the nature of the crime determines the severity of the penalty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و عدالتی پہلو",
        "english": "Juristic and Judicial Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اونٹوں کے علاوہ دیگر صورتیں",
              "english": "Alternatives to Camels"
            },
            "content": {
              "urdu": [
                "جدید دور میں اونٹوں کی جگہ ان کی قیمت (نقدی) بھی دی جا سکتی ہے۔",
                "مختلف ممالک میں حکومتیں دیت کی رقم کا تعین اونٹوں کی بازاری قیمت کے مطابق کرتی ہیں۔",
                "سونے، چاندی یا گائے اور بکریوں کی صورت میں بھی دیت کی گنجائش موجود ہے۔"
              ],
              "english": [
                "In modern times, the cash equivalent of the camels can be paid.",
                "Governments in various countries determine the Diyat amount based on market prices.",
                "Options for Diyat in gold, silver, cows, or goats also exist in jurisprudence."
              ]
            }
          },
          {
            "title": {
              "urdu": "روایت کی اسنادی حیثیت",
              "english": "Narrational Authenticity"
            },
            "content": {
              "urdu": [
                "محدثین کے نزدیک یہ روایت حضرت عبداللہ بن مسعود کا اپنا قول (موقوف) زیادہ صحیح ہے۔",
                "صحابہ کے اقوال شرعی احکام کے فہم میں کلیدی حیثیت رکھتے ہیں۔",
                "اسنادی کمزوری کے باوجود اس پر عمل صحابہ کے دور سے ثابت ہے۔"
              ],
              "english": [
                "Scholars consider this narration as more authentic as a statement of Ibn Mas'ud (Mauquf).",
                "Statements of companions are crucial in understanding Shariah rulings.",
                "Despite the chain's weakness as Marfu', its practice is established since the Sahaba's era."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی نظامِ عدل کی حکمت",
        "english": "Wisdom of Islamic Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون ضائع ہونے سے بچانا",
              "english": "Preventing Waste of Life"
            },
            "content": {
              "urdu": [
                "دیت کا قانون اس بات کو یقینی بناتا ہے کہ کسی کا خون رائیگاں نہ جائے۔",
                "مقتول کے ورثاء کی مالی مدد ہوتی ہے جس سے ان کی زندگی آسان ہو جاتی ہے۔",
                "یہ نظام انتقامی جذبات کو ٹھنڈا کرنے میں مددگار ثابت ہوتا ہے۔"
              ],
              "english": [
                "The law of Diyat ensures that a life does not go uncompensated.",
                "It provides financial support to the victim's family, easing their survival.",
                "This system helps in cooling down retaliatory feelings."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی توازن",
              "english": "Social Balance"
            },
            "content": {
              "urdu": [
                "اسلامی سزاؤں کا مقصد بدلہ لینا نہیں بلکہ توازن قائم کرنا ہے۔",
                "دیت کی ادائیگی میں خاندان کی شمولیت معاشرتی یکجہتی کو فروغ دیتی ہے۔",
                "یہ قانون مجرم کو اصلاح کا موقع فراہم کرتا ہے۔"
              ],
              "english": [
                "Islamic punishments aim to establish balance rather than mere revenge.",
                "The involvement of the family in paying Diyat promotes social solidarity.",
                "This law provides the offender an opportunity for reform."
              ]
            }
          }
        ]
      }
    }
  ]
}