{
  "hadithId": 755,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/12/1"
    ],
    "kitabId": 7,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام",
    "babId": 53
  },
  "name": {
    "arabic": " عَنْ سَعِيدِ بْنِ زَيْدٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ اِقْتَطَعَ شِبْرًا مِنْ اَلْأَرْضِ ظُلْماً طَوَّقَهُ اَللَّهُ إِيَّاهُ يَوْمَ اَلْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ } مُتَّفَقٌ عَلَيْهِ",
    "urdu": " سیدنا سعید بن زید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس شخص نے ایک بالشت بھر زمین کسی سے چھین لی، اللہ تعالیٰ قیامت کے روز اتنا حصہ زمیں، ساتوں زمینوں سے اس کے گلے میں طوق بنا کر ڈال دے گا۔“ (بخاری و مسلم)",
    "english": "Narrated Sa'id bin Zaid (RA): Allah's Messenger (ﷺ) said: 'If anyone unjustly takes even a hand-span of land, Allah will make him wear it as a collar around his neck from seven earths on the Day of Resurrection.' [Agreed upon]."
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه البخاري ( 3198 )‏، ومسلم ( 1610 )‏، واللفظ لمسلم.‏ ",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (3198) اور امام مسلم (1610) نے روایت کیا ہے، اور الفاظ مسلم کے ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (3198) and Muslim (1610). The wording here belongs to the narration of Muslim."
  },
  "importantWords": [
    {
      "arabic": "اِقْتَطَعَ",
      "english": "Cut off / Took away",
      "urdu": "کاٹ لیا / چھین لیا"
    },
    {
      "arabic": "شِبْرًا",
      "english": "A hand-span",
      "urdu": "بالشت بھر"
    },
    {
      "arabic": "ظُلْماً",
      "english": "Unjustly / Wrongfully",
      "urdu": "ظلم کے طور پر"
    },
    {
      "arabic": "طَوَّقَهُ",
      "english": "Will make him wear as a collar",
      "urdu": "اسے طوق بنا دے گا"
    },
    {
      "arabic": "سَبْعِ أَرَضِينَ",
      "english": "Seven earths",
      "urdu": "سات زمینیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں کسی کی زمین پر ناجائز قبضہ کرنے کی سخت وعید بیان کی گئی ہے، چاہے وہ معمولی حصہ ہی کیوں نہ ہو۔",
    "english": "This Hadith issues a severe warning against unjustly seizing land, emphasizing that even a tiny portion taken wrongfully leads to grave punishment."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (3198)",
      "english": "Sahih al-Bukhari (3198)"
    },
    {
      "arabic": "صحيح مسلم (1610)",
      "english": "Sahih Muslim (1610)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعيد بن زيد",
        "english": "Sa'id bin Zaid"
      },
      "slug": "said-bin-zaid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_I_f_6x4Qo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ظلم اور ناجائز قبضہ",
        "english": "Injustice and Illegal Possession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معمولی زیادتی کی شدت",
              "english": "Severity of Minor Encroachment"
            },
            "content": {
              "urdu": [
                "ایک بالشت زمین بظاہر معمولی معلوم ہوتی ہے مگر اس کا چھیننا حرام ہے۔",
                "اسلام کسی کے مال اور جائیداد میں ذرہ برابر بھی خیانت کی اجازت نہیں دیتا۔",
                "یہ وعید لوگوں کو دوسروں کے حقوق غصب کرنے سے روکتی ہے۔"
              ],
              "english": [
                "A hand-span of land seems minor but seizing it is strictly forbidden.",
                "Islam does not permit even a tiny bit of betrayal in property and wealth.",
                "This warning serves to deter people from usurping the rights of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملکیت کا احترام",
              "english": "Respect for Ownership"
            },
            "content": {
              "urdu": [
                "دوسرے کی زمین کی حدود تبدیل کرنا بڑے گناہوں میں سے ایک ہے۔",
                "زمین کی ملکیت کا تحفظ معاشرے میں امن و امان کی ضمانت ہے۔",
                "شریعت نے دوسروں کے مال کو ان کی اجازت کے بغیر لینا ممنوع قرار دیا ہے۔"
              ],
              "english": [
                "Changing the boundaries of another's land is among the major sins.",
                "Protecting land ownership is a guarantee for peace and order in society.",
                "Sharia has prohibited taking others' wealth without their explicit consent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کی ہولناک سزا",
        "english": "Dreadful Punishment of Resurrection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سات زمینوں کا طوق",
              "english": "Collar of Seven Earths"
            },
            "content": {
              "urdu": [
                "جس زمین پر قبضہ کیا گیا، وہ ساتوں تہوں تک اس کے گلے کا طوق بنے گی۔",
                "یہ طوق نہایت وزنی ہوگا جو مجرم کے لیے رسوائی اور عذاب کا سبب بنے گا۔",
                "اللہ تعالیٰ کا عدل مجرم کو اس کے جرم کی نوعیت کے مطابق سزا دے گا۔"
              ],
              "english": [
                "The seized land will become a collar around the neck down to seven layers.",
                "This collar will be extremely heavy, causing humiliation and torment.",
                "Allah's justice will punish the criminal according to the nature of the crime."
              ]
            }
          },
          {
            "title": {
              "urdu": "رسوائی اور عذاب",
              "english": "Humiliation and Torment"
            },
            "content": {
              "urdu": [
                "قیامت کے دن یہ سزا سب لوگوں کے سامنے دی جائے گی جو کہ بڑی رسوائی ہے۔",
                "دنیاوی فائدہ آخرت کے اس ابدی عذاب کے سامنے کچھ بھی نہیں ہے۔",
                "ساتوں زمینوں کے تذکرے سے زمین کی گہرائی اور عذاب کی شدت واضح ہوتی ہے۔"
              ],
              "english": [
                "This punishment will be given before all mankind, causing immense shame.",
                "Worldly gain is nothing compared to this eternal punishment in the hereafter.",
                "The mention of seven earths clarifies the depth and intensity of the torment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و سائنسی نکات",
        "english": "Juristic and Scientific Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زمین کی تہیں",
              "english": "Layers of the Earth"
            },
            "content": {
              "urdu": [
                "حدیث سے ثابت ہوتا ہے کہ زمین کی بھی آسمان کی طرح سات تہیں یا طبقے ہیں۔",
                "سائنسی طور پر بھی زمین کی مختلف اندرونی تہیں (layers) دریافت ہو چکی ہیں۔",
                "یہ حدیث نبی کریم ﷺ کے سچے ہونے اور علمِ غیب کی ایک روشن دلیل ہے۔"
              ],
              "english": [
                "The Hadith proves that the earth, like the sky, has seven layers.",
                "Scientifically, various internal layers of the earth have been discovered.",
                "This Hadith is a clear proof of the Prophet's (ﷺ) truth and divine knowledge."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبضہ کا شرعی حکم",
              "english": "Legal Ruling on Possession"
            },
            "content": {
              "urdu": [
                "ناجائز قبضہ شدہ زمین پر نماز پڑھنا یا کوئی بھی عمل کرنا مکروہ و ناپسندیدہ ہے۔",
                "قبضہ کرنے والے پر واجب ہے کہ وہ اصل مالک کو زمین اور اس کا نقصان واپس کرے۔",
                "فقہاء نے اس حدیث سے 'غصب' (usurpation) کے سخت احکامات اخذ کیے ہیں۔"
              ],
              "english": [
                "Praying or performing any act on unjustly occupied land is disliked/reprehensible.",
                "The usurper must return the land and compensate the owner for any loss.",
                "Jurists have derived strict rulings on 'Ghasb' (usurpation) from this Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی سبق",
        "english": "Ethical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق العباد کی حساسیت",
              "english": "Sensitivity of Human Rights"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ حقوق العباد میں ذرہ برابر بھی ظلم معاف نہیں فرمائے گا۔",
                "معاشرتی زندگی میں دوسروں کی حدود کا احترام لازم ہے۔",
                "حقوق العباد کی ادائیگی توبہ کی قبولیت کے لیے لازمی شرط ہے۔"
              ],
              "english": [
                "Allah will not forgive even the smallest injustice regarding human rights.",
                "Respecting the boundaries of others is mandatory in social life.",
                "Fulfilling the rights of others is a prerequisite for the acceptance of repentance."
              ]
            }
          },
          {
            "title": {
              "urdu": "لالچ اور حرص کا علاج",
              "english": "Remedy for Greed"
            },
            "content": {
              "urdu": [
                "یہ حدیث انسان کے اندر موجود زمین اور مال کی حرص کو ختم کرتی ہے۔",
                "مومن کو چاہیے کہ وہ تھوڑے حلال پر راضی رہے بجائے بہت سے حرام کے۔",
                "آخرت کے خوف سے ہی انسان اپنی زبان اور ہاتھ کو ظلم سے روک سکتا ہے۔"
              ],
              "english": [
                "This Hadith eliminates the human greed for land and wealth.",
                "A believer should be satisfied with little Halal rather than much Haram.",
                "Only the fear of the hereafter can stop a person from injustice with hands and tongue."
              ]
            }
          }
        ]
      }
    }
  ]
}