{
  "hadithId": 397,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-397"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (986)‏، وأبو داود (1156) من حديث ابن عمر بلفظ: أخذ يوم العيد في طريق، ثم رجع في طريق آخر.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری (986) نے روایت کیا ہے۔ اس کے شواہد ابن عمر رضی اللہ عنہ سے ابوداؤد (1156) میں بھی موجود ہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (986) and Abu Dawud (1156) through Ibn 'Umar, confirming the Prophet's practice of taking different paths on Eid."
  },
  "importantWords": [
    {
      "arabic": "خَالَفَ",
      "english": "Opposed / Changed",
      "urdu": "تبدیل کیا / مخالفت کی"
    },
    {
      "arabic": "اَلطَّرِيقَ",
      "english": "The path / route",
      "urdu": "راستہ"
    },
    {
      "arabic": "يَوْمُ اَلْعِيدِ",
      "english": "The day of Eid",
      "urdu": "عید کا دن"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Narrated / Reported it",
      "urdu": "اسے روایت کیا"
    },
    {
      "arabic": "نَحْوُهُ",
      "english": "Similar to it",
      "urdu": "اس کی مانند"
    }
  ],
  "summary": {
    "urdu": "عید گاہ جانے کے لیے ایک راستہ استعمال کرنا اور واپسی کے لیے دوسرا راستہ اختیار کرنا سنتِ نبوی ﷺ ہے۔",
    "english": "It is the Sunnah of the Prophet (ﷺ) to go to the Eidgah by one route and return by another."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (986)",
      "english": "Sahih al-Bukhari (986)"
    },
    {
      "arabic": "سنن أبي داود (1156)",
      "english": "Sunan Abu Dawud (1156)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=sunnah+of+changing+routes+on+eid+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "راستہ تبدیل کرنے کی حکمت",
        "english": "Wisdom of Changing Routes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گواہی اور برکت کا حصول",
              "english": "Seeking Witnesses and Blessings"
            },
            "content": {
              "urdu": [
                "قیامت کے دن زمین کے مختلف حصے انسان کے حق میں گواہی دیں گے۔",
                "راستہ بدلنے سے زیادہ مقامات پر ذکرِ الہی اور تکبیرات کی آواز پہنچتی ہے۔",
                "اس طرح زمین کے مختلف ٹکڑے مومن کی عبادت کے گواہ بن جاتے ہیں۔"
              ],
              "english": [
                "Different parts of the earth will testify in favor of a person on Judgement Day.",
                "Changing routes allows the sound of Takbirat and remembrance to reach more places.",
                "Thus, various patches of land become witnesses to the believer's worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی شوکت کا اظہار",
              "english": "Displaying Islamic Grandeur"
            },
            "content": {
              "urdu": [
                "مختلف راستوں سے گزرنے سے مسلمانوں کی کثرت اور شوکت کا اظہار ہوتا ہے۔",
                "اس عمل سے دور دراز رہنے والے لوگوں کو بھی عید کی رونق کا علم ہوتا ہے۔",
                "یہ اسلام کے شعائر کو بلند کرنے اور معاشرے میں خوشی پھیلانے کا ذریعہ ہے۔"
              ],
              "english": [
                "Passing through different routes displays the strength and numbers of Muslims.",
                "This practice informs people living in various areas about the Eid festivities.",
                "It is a means of exalting Islamic symbols and spreading joy in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد",
        "english": "Social Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملاقات اور تعلقات",
              "english": "Meetings and Relationships"
            },
            "content": {
              "urdu": [
                "دوسرے راستے سے واپسی پر نئے لوگوں سے ملاقات اور عید مبارک کا موقع ملتا ہے۔",
                "اس سے مسلمانوں کے درمیان باہمی ہمدردی اور تعلقات کو فروغ ملتا ہے۔",
                "ضرورت مندوں اور بیماروں کی خبر گیری کے زیادہ مواقع میسر آتے ہیں۔"
              ],
              "english": [
                "Returning via a different route provides opportunities to meet new people for Eid greetings.",
                "This promotes mutual sympathy and strengthens relationships among Muslims.",
                "It creates more chances to check on the needy and the sick in the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "فتنے سے بچاؤ اور حفاظت",
              "english": "Safety and Avoiding Discord"
            },
            "content": {
              "urdu": [
                "بعض علماء کے نزدیک یہ دشمن کی چالوں سے بچنے کی ایک حفاظتی تدبیر بھی تھی۔",
                "راستہ بدلنا انسانی نقل و حرکت میں تنوع اور نظم و ضبط سکھاتا ہے۔",
                "یہ عمل مومن کو ہر حال میں چوکس اور باشعور رہنے کی تربیت دیتا ہے۔"
              ],
              "english": [
                "Some scholars suggest this was also a safety measure against potential enemy plots.",
                "Changing routes teaches diversity and discipline in human movement.",
                "This practice trains a believer to remain alert and conscious in all situations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اتباعِ سنت کی اہمیت",
        "english": "Importance of Following Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ سے گہری محبت",
              "english": "Deep Love for the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "صحابہ کرام عید کے دن نبی ﷺ کی ہر چھوٹی بڑی سنت پر عمل کرنے کی کوشش کرتے تھے۔",
                "راستہ بدلنا بظاہر ایک سادہ عمل ہے لیکن یہ محبتِ رسول ﷺ کی نشانی ہے۔",
                "سنت پر عمل کرنا ہی حقیقی کامیابی اور اللہ کی رضا کا راستہ ہے۔"
              ],
              "english": [
                "The Companions strove to follow every Sunnah of the Prophet (ﷺ) on Eid day.",
                "Changing routes seems simple but is a sign of deep love for the Messenger (ﷺ).",
                "Adhering to the Sunnah is the path to true success and Allah's pleasure."
              ]
            }
          },
          {
            "title": {
              "urdu": "شعارِ عید کو زندہ کرنا",
              "english": "Reviving Eid Traditions"
            },
            "content": {
              "urdu": [
                "عید کے دن تکبیرات کہنا اور راستے بدلنا عید کے خاص شعائر میں سے ہے۔",
                "ان سنتوں کو زندہ کرنے سے معاشرے میں اسلامی ماحول پروان چڑھتا ہے۔",
                "ہر مسلمان کو چاہیے کہ وہ اپنی خوشیوں کو سنت کے رنگ میں ڈھالے۔"
              ],
              "english": [
                "Reciting Takbirat and changing routes are specific hallmarks of Eid.",
                "Reviving these Sunnahs helps flourish the Islamic environment in society.",
                "Every Muslim should strive to mold their joy according to the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرکت میں برکت",
              "english": "Blessing in Movement"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں جمود کے بجائے حرکت اور فعالیت کی تعلیم دیتا ہے۔",
                "راستوں کی تبدیلی زندگی کے مختلف پہلوؤں کو دیکھنے کا موقع دیتی ہے۔",
                "یہ عمل انسانی سوچ میں وسعت اور لچک پیدا کرنے کا باعث بنتا ہے۔"
              ],
              "english": [
                "Islam teaches us activity and movement instead of stagnation.",
                "The change of routes provides a chance to observe different aspects of life.",
                "This practice leads to the expansion and flexibility of human thought."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی تربیت",
              "english": "Training in Discipline"
            },
            "content": {
              "urdu": [
                "عید گاہ کی طرف جانا اور آنا ایک منظم گروہ کی صورت میں ہونا چاہیے۔",
                "یہ حدیث ہمیں اپنے سفر اور نقل و حمل کے آداب سکھاتی ہے۔",
                "مسلمان کا ہر قدم اللہ کی رضا اور سنت کی اتباع میں ہونا چاہیے۔"
              ],
              "english": [
                "Going to and from the Eidgah should be done in an organized manner.",
                "This Hadith teaches us the etiquettes of travel and transportation.",
                "Every step of a Muslim should be in pursuit of Allah's pleasure and Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
