{
  "hadithId": 882,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/72"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (1426)، وأخرجه أيضاً أبو داود (2105)، والنسائي (3344)، وابن ماجه (1886)، وأحمد (6/93).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1426) نے اسے روایت کیا ہے۔ اس کے علاوہ ابوداؤد، نسائی، ابن ماجہ اور احمد نے بھی اسے اپنی کتب میں درج کیا ہے۔",
    "english": "Sahih. Reported by Muslim (1426). Also recorded by Abu Dawud (2105), An-Nasa'i (3344), Ibn Majah (1886), and Ahmad (6/93)."
  },
  "importantWords": [
    {
      "arabic": "صَدَاقُ",
      "english": "Dower / Mahr",
      "urdu": "مہر"
    },
    {
      "arabic": "أُوقِيَّةً",
      "english": "Uqiyah (Ancient weight)",
      "urdu": "اوقیہ (وزن کی ایک اکائی)"
    },
    {
      "arabic": "نَشًّا",
      "english": "Nash (Half an Uqiyah)",
      "urdu": "نش (آدھا اوقیہ)"
    },
    {
      "arabic": "دِرْهَمٍ",
      "english": "Dirham (Silver coin)",
      "urdu": "درہم (چاندی کا سکہ)"
    },
    {
      "arabic": "أَتَدْرِي",
      "english": "Do you know?",
      "urdu": "کیا تم جانتے ہو؟"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ کی ازواجِ مطہرات کے مہر کی مقدار (500 درہم) بیان کی گئی ہے، جو کہ سادگی اور امت کے لیے ایک متوازن نمونہ ہے۔",
    "english": "This Hadith details the amount of Mahr the Prophet (ﷺ) gave to his wives (500 Dirhams), serving as a model of simplicity and moderation for the Ummah."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤٢٦",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1426"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو سلمة بن عبد الرحمن",
        "english": "Abu Salama bin Abdur Rahman"
      },
      "slug": "abu-salama-bin-abdur-rahman"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہرِ نبوی کی مقدار اور حساب",
        "english": "Amount and Calculation of Prophetic Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اوقیہ اور درہم کا حساب",
              "english": "Calculation of Uqiyah and Dirham"
            },
            "content": {
              "urdu": [
                "ایک اوقیہ چالیس درہم کے برابر ہوتا تھا، اس حساب سے بارہ اوقیہ 480 درہم بنے۔",
                "لفظ 'نش' آدھے اوقیہ یعنی 20 درہم کے لیے استعمال ہوتا ہے، یوں کل 500 درہم ہوئے۔",
                "سیدہ عائشہ رضی اللہ عنہا نے اس پیمائش کی خود وضاحت فرما کر شک دور کر دیا۔"
              ],
              "english": [
                "One Uqiyah was equal to 40 Dirhams, making twelve Uqiyahs equal to 480 Dirhams.",
                "The term 'Nash' refers to half an Uqiyah (20 Dirhams), totaling 500 Dirhams.",
                "Lady Aisha (RA) personally clarified these units to ensure the exact amount was understood."
              ]
            }
          },
          {
            "title": {
              "urdu": "سادگی کا بہترین نمونہ",
              "english": "An Exemplary Model of Simplicity"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنی اکثر ازواج کے لیے یہی مقدار مقرر فرمائی تاکہ امت کے لیے آسانی ہو۔",
                "یہ مقدار نہ اتنی کم تھی کہ بے وقعت ہو اور نہ اتنی زیادہ کہ نکاح بوجھ بن جائے۔",
                "اسلام نے مہر کو ایک تحفہ اور احترام کی علامت بنایا ہے، نہ کہ کوئی تجارتی سودا۔"
              ],
              "english": [
                "The Prophet (ﷺ) fixed this amount for most of his wives to set a standard for the Ummah.",
                "The amount was neither too low to be trivial nor too high to make marriage a burden.",
                "Islam treats Mahr as a gift and a symbol of respect rather than a commercial transaction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مہر میں اعتدال کی اہمیت",
        "english": "Importance of Moderation in Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زیادہ مہر سے اجتناب",
              "english": "Avoiding Excessive Dower"
            },
            "content": {
              "urdu": [
                "مہر میں مبالغہ آرائی اور نمود و نمائش اسلامی تعلیمات کے منافی اور ناپسندیدہ ہے۔",
                "نبی کریم ﷺ نے اس مہر سے زائد مہر اپنی بیٹیوں کے لیے بھی پسند نہیں فرمایا۔",
                "بھاری مہر کی شرط اکثر نوجوانوں کے لیے نکاح کی راہ میں بڑی رکاوٹ بن جاتی ہے۔"
              ],
              "english": [
                "Exaggeration and showing off in Mahr is contrary to Islamic teachings and discouraged.",
                "The Prophet (ﷺ) did not prefer a dower higher than this even for his own daughters.",
                "Demanding excessive Mahr often acts as a major barrier for young people seeking marriage."
              ]
            }
          },
          {
            "title": {
              "urdu": "برکت والا نکاح",
              "english": "The Most Blessed Marriage"
            },
            "content": {
              "urdu": [
                "حدیث کے مطابق سب سے زیادہ برکت والا نکاح وہ ہے جس میں اخراجات کم اور مہر آسان ہو۔",
                "مہر کی اصل روح عورت کی دلجوئی اور اسے معاشی تحفظ کا احساس دلانا ہے۔",
                "سنت کے مطابق مہر طے کرنا میاں بیوی کے درمیان الفت اور برکت کا باعث بنتا ہے۔"
              ],
              "english": [
                "According to Hadith, the most blessed marriage is the one with the easiest dower.",
                "The true spirit of Mahr is to please the woman and provide a sense of security.",
                "Setting the dower according to Sunnah invites divine blessing and love between spouses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور استثناء",
        "english": "Juristic Rulings and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف مہر کی صورتیں",
              "english": "Cases of Varying Mahr"
            },
            "content": {
              "urdu": [
                "سیدہ صفیہ اور سیدہ ام حبیبہ رضی اللہ عنہما کا مہر اس عام قاعدے سے مختلف تھا۔",
                "ام حبیبہ کا مہر شاہِ حبشہ نے اپنی طرف سے دیا تھا، جو کہ ایک خاص استثناء تھا۔",
                "یہ حدیث اس عام مہر کا تذکرہ کرتی ہے جو آپ ﷺ نے خود اپنی جیبِ مبارک سے دیا۔"
              ],
              "english": [
                "The Mahr of Safiyyah and Umm Habiba (RA) differed from this general Prophetic rule.",
                "The Negus of Abyssinia paid Umm Habiba's dower on behalf of the Prophet (ﷺ) as an exception.",
                "This Hadith describes the standard amount the Prophet (ﷺ) paid personally from his means."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہر کی شرعی حیثیت",
              "english": "Shariah Status of Mahr"
            },
            "content": {
              "urdu": [
                "مہر نکاح کے وقت واجب ہوتا ہے اور یہ مکمل طور پر عورت کی ملکیت ہوتا ہے۔",
                "والدین یا شوہر کے لیے بیوی کی اجازت کے بغیر اس میں سے کچھ لینا جائز نہیں ہے۔",
                "اگر مہر نکاح میں مقرر نہ بھی ہو، تب بھی مہرِ مثل (خاندان کے برابر) واجب رہتا ہے۔"
              ],
              "english": [
                "Mahr becomes obligatory at the time of marriage and is the sole property of the wife.",
                "It is not permissible for parents or the husband to take from it without her consent.",
                "Even if Mahr is not specified in the contract, a 'fair dower' remains a legal obligation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی پیغام اور معاشرتی اصلاح",
        "english": "Educational Message and Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کو آسان بنائیں",
              "english": "Make Marriage Easy"
            },
            "content": {
              "urdu": [
                "مہرِ نبوی کی پیروی کر کے ہم اپنے معاشرے میں نکاح کو آسان بنا سکتے ہیں۔",
                "مشکل مہر اور بے جا مطالبات معاشرے میں بے حیائی اور گناہ کا راستہ کھولتے ہیں۔",
                "والدین کو چاہیے کہ وہ مادیت کے بجائے دینداری اور اخلاق کو ترجیح دیں۔"
              ],
              "english": [
                "By following the Prophetic Mahr, we can facilitate ease of marriage in our society.",
                "Difficult dowers and excessive demands open doors to immorality and sin in the community.",
                "Parents should prioritize religious commitment and character over material wealth."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا شوقِ علم",
              "english": "Companions' Passion for Knowledge"
            },
            "content": {
              "urdu": [
                "ابوسلمہ کا سیدہ عائشہ سے یہ سوال کرنا صحابہ کے سیکھنے کے شوق کو ظاہر کرتا ہے۔",
                "نجی اور خاندانی مسائل میں امہات المؤمنین سے رہنمائی حاصل کرنا بہترین طریقہ ہے۔",
                "علمِ دین کا پھیلانا اور سنت کی تحقیق کرنا ہر دور کی ضرورت ہے۔"
              ],
              "english": [
                "Abu Salama's question to Lady Aisha demonstrates the Companions' eagerness to learn.",
                "Seeking guidance from the Mothers of the Believers on private matters is the best approach.",
                "Spreading religious knowledge and researching the Sunnah is essential in every era."
              ]
            }
          }
        ]
      }
    }
  ]
}