{
  "hadithId": 1032,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1182"],
    "kitabId": 9,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام",
    "babId": 83
  },
 
  "takhreej": {
    "arabic": "أخرجه البخاري (6922)، وأبو داود (4351)، والترمذي (1458)، والنسائي (4059)، وابن ماجه (2535).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری نے اسے اپنی صحیح میں (6922) پر روایت کیا ہے۔ دیگر کتبِ سنن میں بھی یہ موجود ہے۔",
    "english": "Sahih (Authentic). Reported by al-Bukhari (6922), Abu Dawud (4351), at-Tirmidhi (1458), an-Nasa'i (4059), and Ibn Majah (2535)."
  },
  "importantWords": [
    {
      "arabic": "بَدَّلَ",
      "english": "Changed / Exchanged",
      "urdu": "بدل لیا / تبدیل کیا"
    },
    {
      "arabic": "دِينَهُ",
      "english": "His Religion",
      "urdu": "اپنا دین"
    },
    {
      "arabic": "اقْتُلُوهُ",
      "english": "Kill him",
      "urdu": "اسے قتل کر دو"
    },
    {
      "arabic": "الْمُرْتَدّ",
      "english": "The Apostate",
      "urdu": "مرتد"
    },
    {
      "arabic": "اسْتِتَابَة",
      "english": "Seeking Repentance",
      "urdu": "توبہ کروانا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مرتد (اسلام چھوڑنے والے) کی شرعی سزا بیان کرتی ہے، جو کہ توبہ نہ کرنے کی صورت میں قتل ہے۔",
    "english": "This Hadith specifies the Shariah punishment for apostasy (leaving Islam), which is the death penalty if the individual refuses to repent."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6922)",
      "english": "Sahih al-Bukhari (6922)"
    },
    {
      "arabic": "سنن النسائي (4059)",
      "english": "Sunan An-Nasa'i (4059)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S46vX7N0S8U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ارتداد کی شرعی حیثیت",
        "english": "Shariah Status of Apostasy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینِ حق کی حفاظت",
              "english": "Protection of the True Faith"
            },
            "content": {
              "urdu": [
                "اسلام میں دین کو ایک مقدس امانت اور معاشرے کی بنیاد مانا گیا ہے۔",
                "دین کو کھیل بنانا اور بار بار داخل و خارج ہونا فتنہ گری کے زمرے میں آتا ہے۔",
                "یہ قانون دین کی عظمت اور سماجی وحدت کو برقرار رکھنے کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "In Islam, religion is considered a sacred trust and the foundation of society.",
                "Treating faith as a game by entering and leaving repeatedly is seen as inciting strife.",
                "This law is established to maintain the sanctity of faith and social cohesion."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزا کا نفاذ اور ریاست",
              "english": "Execution of Penalty and the State"
            },
            "content": {
              "urdu": [
                "ارتداد کی سزا کا نفاذ صرف اور صرف اسلامی ریاست اور عدالت کی ذمہ داری ہے۔",
                "کسی فردِ واحد کو یہ اختیار حاصل نہیں کہ وہ خود فیصلہ کرے اور قتل کرے۔",
                "انفرادی طور پر قانون ہاتھ میں لینا معاشرے میں انتشار اور انارکی کا سبب بنتا ہے۔"
              ],
              "english": [
                "The implementation of the apostasy penalty is solely the duty of the Islamic state and courts.",
                "No individual has the right to judge and execute such a sentence on their own.",
                "Taking the law into individual hands leads to total chaos and anarchy in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توبہ اور مہلت کا تصور",
        "english": "Concept of Repentance and Respite"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استتابہ (توبہ کا مطالبہ)",
              "english": "Seeking Repentance (Istitaabah)"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک مرتد کو قتل کرنے سے پہلے توبہ کی دعوت دینا ضروری ہے۔",
                "اس کے شکوک و شبہات دور کیے جاتے ہیں تاکہ وہ دوبارہ اسلام کی طرف آ سکے۔",
                "اسلام کا مقصد جان لینا نہیں بلکہ انسانوں کی ہدایت اور اصلاح کرنا ہے۔"
              ],
              "english": [
                "Most jurists agree that the apostate must be invited to repent before execution.",
                "Their doubts are addressed to facilitate a potential return to Islam.",
                "The primary goal of Islam is guidance and reform, not the taking of lives."
              ]
            }
          },
          {
            "title": {
              "urdu": "تین دن کی مہلت",
              "english": "Three-Day Grace Period"
            },
            "content": {
              "urdu": [
                "خلفائے راشدین کے عمل سے مرتد کو غور و فکر کے لیے تین دن کی مہلت دینا ثابت ہے۔",
                "اگر وہ اس دوران توبہ کر لے تو اس کی سزا ختم ہو جائے گی اور وہ معاف کر دیا جائے گا۔",
                "یہ مہلت اسلام کے عدل اور انسان دوستی کی ایک روشن مثال ہے۔"
              ],
              "english": [
                "The practice of the Rightly Guided Caliphs proves a three-day respite for reflection.",
                "If they repent during this time, the penalty is dropped and they are forgiven.",
                "This grace period is a shining example of Islamic justice and humanity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں اور استثناء",
        "english": "Juristic Nuances and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرد اور عورت کی سزا میں فرق",
              "english": "Difference in Gender Penalties"
            },
            "content": {
              "urdu": [
                "جمہور کے نزدیک مرد و عورت دونوں کے لیے ارتداد کی سزا قتل ہی ہے۔",
                "امام ابوحنیفہ کے نزدیک مرتد عورت کو قتل نہیں کیا جائے گا بلکہ توبہ تک قید رکھا جائے گا۔",
                "یہ اختلاف فقہاء کی اپنی اپنی قانونی تشریحات اور دلائل کی بنیاد پر ہے۔"
              ],
              "english": [
                "The majority of scholars hold that the penalty applies to both men and women.",
                "Imam Abu Hanifa rules that a female apostate is imprisoned until repentance, not killed.",
                "This difference stems from various juristic interpretations and evidences."
              ]
            }
          },
          {
            "title": {
              "urdu": "جبر اور مجبوری",
              "english": "Coercion and Compulsion"
            },
            "content": {
              "urdu": [
                "اگر کسی کو زبردستی کفر پر مجبور کیا جائے تو اس پر ارتداد کا حکم نہیں لگتا۔",
                "قرآن و حدیث کے مطابق دل کا اطمینانِ ایمان ہی اصل معیار ہے۔",
                "ایسے نازک معاملات میں مکمل تحقیق اور گواہیوں کے بغیر فیصلہ نہیں کیا جا سکتا۔"
              ],
              "english": [
                "If someone is forced into disbelief under duress, the ruling of apostasy does not apply.",
                "According to Quran and Hadith, the heart's firm belief is the true standard.",
                "Decisions in such sensitive matters require thorough investigation and evidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عصری تناظر اور حکمت",
        "english": "Contemporary Context and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغاوت بمقابلہ نظریہ",
              "english": "Rebellion vs. Ideology"
            },
            "content": {
              "urdu": [
                "قدیم دور میں ارتداد اکثر ریاست کے خلاف مسلح بغاوت کا پیش خیمہ ہوتا تھا۔",
                "آج کل کے علماء اس سزا کو 'ہائی ٹریزن' (سنگین غداری) کے مشابہ قرار دیتے ہیں۔",
                "یہ حکم مسلم معاشرے کی نظریاتی سرحدوں کی حفاظت کا ضامن ہے۔"
              ],
              "english": [
                "In ancient times, apostasy was often a precursor to armed rebellion against the state.",
                "Modern scholars often compare this penalty to the crime of 'High Treason'.",
                "The ruling serves as a guardian for the ideological boundaries of the Muslim society."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان کی قدر و قیمت",
              "english": "The Value of Faith"
            },
            "content": {
              "urdu": [
                "یہ سخت قانون مسلمانوں کو اپنے ایمان کی حفاظت اور قدر کرنے کی یاد دہانی کراتا ہے۔",
                "ایمان اللہ کی سب سے بڑی نعمت ہے جسے معمولی دنیاوی مفاد پر قربان نہیں کرنا چاہیے۔",
                "دین کی بنیاد پر ہی مسلمان ایک امت کی صورت میں متحد ہیں۔"
              ],
              "english": [
                "This strict law reminds Muslims to value and protect their faith diligently.",
                "Faith is the greatest blessing from Allah and shouldn't be traded for worldly gains.",
                "It is on the basis of religion that Muslims are united as a single Ummah."
              ]
            }
          }
        ]
      }
    }
  ]
}