{
  "hadithId": 967,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1112"],
    "kitabId": 8,
    "inKitabBab": 13,
    "arabicBook": "كتاب الرضاع",
    "babId": 76
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2644)، ومسلم (1445). واللفظ للبخاري. وفي الحديث إثبات أن الرضاعة من جهة الأب (لبن الفحل) تنشر الحرمة كما تنشرها من جهة الأم.",
    "urdu": "صحیح۔ اسے امام بخاری (2644) اور امام مسلم (1445) نے روایت کیا ہے۔ یہ حدیث اس بات کی دلیل ہے کہ 'لبن الفحل' (مرد کے پانی سے پیدا ہونے والے دودھ) سے بھی رضاعی حرمت ثابت ہوتی ہے، یعنی دودھ پلانے والی کا شوہر بھی بچہ کا رضاعی باپ بن جاتا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2644) and Muslim (1445). This Hadith establishes that fosterage through the father's side (Laban al-Fahl) creates the same prohibitions as fosterage through the mother's side."
  },
  "importantWords": [
    {
      "arabic": "يَسْتَأْذِنُ",
      "english": "Asking permission",
      "urdu": "اجازت مانگنا"
    },
    {
      "arabic": "اَلْحِجَابِ",
      "english": "Veil / Hijab",
      "urdu": "پردہ / حجاب"
    },
    {
      "arabic": "فَأَبَيْتُ",
      "english": "I refused",
      "urdu": "میں نے انکار کیا"
    },
    {
      "arabic": "عَمُّكِ",
      "english": "Your uncle",
      "urdu": "تمہارا چچا"
    }
  ],
  "summary": {
    "urdu": "رضاعت سے بھی وہی رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں۔ جس طرح باپ کا بھائی (چچا) محرم ہوتا ہے، اسی طرح رضاعی باپ (جس کی بیوی کا دودھ پیا ہو) کا بھائی بھی رضاعی چچا ہونے کی وجہ سے محرم ہوتا ہے۔",
    "english": "Fosterage creates the same marital prohibitions as lineage. Just as a paternal uncle is a Mahram by blood, a foster father's brother is also a Mahram, making him a foster uncle."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2644)",
      "english": "Sahih al-Bukhari (2644)"
    },
    {
      "arabic": "صحيح مسلم (1445)",
      "english": "Sahih Muslim (1445)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_vW0BTo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رضاعی حرمت کا پھیلاؤ",
        "english": "Scope of Prohibition through Fosterage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بنیادی قاعدہ",
              "english": "Fundamental Rule"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا مشہور فرمان ہے: 'رضاعت سے بھی وہ تمام رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں'۔",
                "اگر ایک بچہ کسی عورت کا دودھ پی لے تو وہ عورت اس کی رضاعی ماں بن جاتی ہے اور اس کا شوہر اس کا رضاعی باپ۔",
                "اسی اصول کے تحت رضاعی باپ کے بہن بھائی بھی بچے کے پھوپھی اور چچا بن جاتے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) said: 'Fosterage prohibits what birth prohibits.'",
                "If a child suckles from a woman, she becomes the foster mother and her husband becomes the foster father.",
                "Consequently, the foster father's siblings become the child's foster paternal aunts and uncles."
              ]
            }
          },
          {
            "title": {
              "urdu": "لبن الفحل (شوہر کا دودھ) کی بحث",
              "english": "Concept of Laban al-Fahl"
            },
            "content": {
              "urdu": [
                "عربوں میں یہ بحث تھی کہ کیا صرف دودھ پلانے والی ماں سے رشتہ جڑتا ہے یا اس کے شوہر سے بھی؟",
                "سیدہ عائشہ نے افلح کو اس لیے روکا تھا کہ انہوں نے ابوالقعیس کی بیوی کا دودھ پیا تھا، نہ کہ خود افلح کا۔",
                "آپ ﷺ نے واضح فرمایا کہ چونکہ دودھ شوہر کی وجہ سے پیدا ہوا، اس لیے شوہر کے بھائی (افلح) بھی محرم چچا ہیں۔"
              ],
              "english": [
                "There was a debate among Arabs: does the bond apply only to the nursing mother or also to her husband?",
                "Aisha (RA) initially refused Aflah because she had suckled from Abu al-Qu'ais's wife, not Aflah himself.",
                "The Prophet (ﷺ) clarified that since the milk was a result of the husband, his brother (Aflah) is a Mahram uncle."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدہ عائشہ کی احتیاط",
        "english": "Precaution of Aisha (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حجاب کی پابندی",
              "english": "Adherence to Hijab"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کا افلح کو روکنا ان کے تقویٰ اور حجاب کے معاملے میں انتہائی احتیاط کی دلیل ہے۔",
                "وہ اس وقت تک کسی مرد کو اجازت نہیں دیتی تھیں جب تک شرعی طور پر اس کا محرم ہونا قطعی ثابت نہ ہو جاتا۔",
                "یہ طرزِ عمل مسلمان خواتین کے لیے حیا اور پردے کے معاملے میں بہترین نمونہ ہے۔"
              ],
              "english": [
                "Aisha's (RA) refusal shows her intense piety and caution regarding the rules of Hijab.",
                "She would not permit any man entrance until his status as a Mahram was definitively established.",
                "This conduct serves as an excellent model for Muslim women in modesty and veiling."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم کی طلب",
              "english": "Seeking Knowledge"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ نے جب دیکھا کہ ان کے علم اور آپ ﷺ کے حکم میں فرق ہو سکتا ہے، تو فوراً سوال کیا۔",
                "مسلمان کو چاہیے کہ وہ مشکوک امور میں اپنی رائے کے بجائے وحی اور سنتِ نبوی کی طرف رجوع کرے۔",
                "دین میں کسی بھی مسئلے پر عمل کرنے کے لیے دلیل کا ہونا ضروری ہے۔"
              ],
              "english": [
                "When Aisha saw a potential discrepancy between her understanding and the Prophet's instruction, she asked immediately.",
                "A Muslim should refer to Revelation and Sunnah in doubtful matters rather than relying on personal opinion.",
                "Having evidence (Dalil) is essential before acting upon any religious matter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رضاعی باپ کا مقام",
              "english": "Status of the Foster Father"
            },
            "content": {
              "urdu": [
                "رضاعی باپ کا رشتہ نکاح کی حرمت میں سگے باپ کی طرح ہے۔",
                "جس طرح انسان اپنے سگے چچا سے پردہ نہیں کرتا، ویسے ہی رضاعی چچا سے بھی پردہ نہیں ہے۔",
                "اسلام نے رضاعی رشتوں کو سماجی طور پر مضبوط کرنے کے لیے انہیں نسبی رشتوں کے برابر درجہ دیا ہے۔"
              ],
              "english": [
                "The foster father's relationship is equal to a biological father's regarding marriage prohibitions.",
                "Just as one does not observe Hijab from a paternal uncle, one does not from a foster paternal uncle.",
                "Islam grants foster relationships a status similar to blood relations to strengthen social bonds."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی پاکیزگی",
              "english": "Family Purity"
            },
            "content": {
              "urdu": [
                "رضاعت کے قوانین کا مقصد خاندانوں کے درمیان میل جول کو سہل بنانا اور عفت کا تحفظ ہے۔",
                "محرم رشتوں کی پہچان سے معاشرے میں حدود اللہ قائم رہتی ہیں۔",
                "یہ حدیث واضح کرتی ہے کہ رضاعت محض ایک مادی عمل نہیں بلکہ ایک مستقل شرعی رشتہ ہے۔"
              ],
              "english": [
                "Fosterage laws facilitate social interaction between families while protecting chastity.",
                "Recognizing Mahram relationships helps maintain Allah's boundaries in society.",
                "This Hadith clarifies that fosterage is not just a physical act but a permanent legal bond."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے ہدایات",
        "english": "Instructions for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رضاعی رشتوں کا ریکارڈ",
              "english": "Recording Foster Relations"
            },
            "content": {
              "urdu": [
                "خاندانوں کو چاہیے کہ وہ اپنے بچوں کے رضاعی رشتوں کا مکمل ریکارڈ رکھیں تاکہ مستقبل میں نکاح کے مسائل نہ ہوں۔",
                "نادانی میں رضاعی بھائی بہن کا نکاح ہو جانا ایک سنگین شرعی غلطی ہے۔",
                "پہلے دور میں صحابہ ان رشتوں کا بہت زیادہ خیال رکھتے تھے۔"
              ],
              "english": [
                "Families should keep complete records of foster relations to avoid marriage issues in the future.",
                "Unknowingly marrying a foster sibling is a grave religious error.",
                "In the early era, the Companions were extremely vigilant about these relationships."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور سادگی",
              "english": "Modesty and Simplicity"
            },
            "content": {
              "urdu": [
                "غیر محرموں سے پردہ کرنا اور محرموں کے ساتھ حدود میں رہنا اسلامی معاشرت کا حسن ہے۔",
                "ام المومنین کا عمل ہمیں سکھاتا ہے کہ تقویٰ ہر حال میں مقدم ہے۔",
                "اللہ ہمیں اپنی عزتوں کی حفاظت اور شرعی حدود کی پاسداری کی توفیق عطا فرمائے۔"
              ],
              "english": [
                "Observing Hijab from non-mahrams and remaining within limits with mahrams is the beauty of Islamic social life.",
                "The Mother of the Believers' action teaches us that piety takes priority in all circumstances.",
                "May Allah grant us the ability to protect our honor and adhere to Shariah boundaries."
              ]
            }
          }
        ]
      }
    }
  ]
}