{
  "hadithId": 826,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/3"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (3/158، 245)، وابن حبان (1228)، وله شاهد من حديث معقل بن يسار عند أبي داود (2050) والنسائي (3227).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام احمد اور ابن حبان نے روایت کیا ہے، اور معقل بن یسار رضی اللہ عنہ کی روایت اس کی تائید کرتی ہے جو ابو داؤد اور نسائی میں ہے۔",
    "english": "Sahih. Reported by Ahmad (3/158, 245) and Ibn Hibban (1228). A supporting narration (Shahid) is reported by Abu Dawud (2050) and An-Nasa'i (3227) via Ma'qil bin Yasar."
  },
  "importantWords": [
    {
      "arabic": "الْبَاءَةِ",
      "english": "Ability to marry",
      "urdu": "نکاح کی استطاعت"
    },
    {
      "arabic": "التَّبَتُّلِ",
      "english": "Celibacy / Monasticism",
      "urdu": "تجرد / دنیا چھوڑ کر شادی نہ کرنا"
    },
    {
      "arabic": "الْوَدُودَ",
      "english": "Very loving / Affectionate",
      "urdu": "بہت محبت کرنے والی"
    },
    {
      "arabic": "الْوَلُودَ",
      "english": "Very fertile / Prolific",
      "urdu": "بہت بچے جننے والی"
    },
    {
      "arabic": "مُكَاثِرٌ",
      "english": "Outnumbering / Multiplying",
      "urdu": "تعداد میں اضافہ کرنے والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ نے شادی کرنے اور نسل بڑھانے کی ترغیب دی ہے اور بغیر شرعی عذر کے عمر بھر کنوارا رہنے کی سختی سے ممانعت فرمائی ہے۔",
    "english": "This Hadith emphasizes the importance of marriage and procreation, while strictly forbidding remaining single without a valid religious or physical reason."
  },
  "references": [
    {
      "arabic": "مسند أحمد (12613)",
      "english": "Musnad Ahmad (12613)"
    },
    {
      "arabic": "صحيح ابن حبان (4028)",
      "english": "Sahih Ibn Hibban (4028)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "انس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R2j9p_VqQic",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح کا حکم اور رہبانیت کی نفی",
        "english": "Order of Marriage and Rejection of Celibacy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح سنتِ نبوی ہے",
              "english": "Marriage as a Sunnah"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے نکاح کو اپنی سنت قرار دیا اور اسے لازم پکڑنے کا حکم دیا۔",
                "اسلام میں رہبانیت یعنی دنیا ترک کر کے شادی نہ کرنے کا کوئی تصور نہیں۔",
                "یہ عمل انسانی فطرت کے عین مطابق ہے اور معاشرے کی بقا کا ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) established marriage as his Sunnah and commanded the believers to follow it.",
                "There is no concept of monasticism or remaining celibate for spiritual reasons in Islam.",
                "Marriage aligns with human nature and serves as the primary means for the survival of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "تجرد کی ممانعت",
              "english": "Prohibition of Remaining Single"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے بلاوجہ شادی نہ کرنے اور کنوارا رہنے سے سختی سے منع فرمایا۔",
                "یہ ممانعت معاشرتی بگاڑ اور اخلاقی پستی کو روکنے کے لیے لگائی گئی ہے۔",
                "اسلام چاہتا ہے کہ ہر انسان ایک پاکیزہ خاندانی نظام کا حصہ بنے۔"
              ],
              "english": [
                "The Prophet (ﷺ) strictly forbade remaining single without a valid reason or excuse.",
                "This prohibition aims to prevent social disorder and moral degradation in the community.",
                "Islam encourages every individual to become part of a pure and structured family system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاتون کے انتخاب کے معیار",
        "english": "Criteria for Choosing a Spouse"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الودود: محبت کرنے والی",
              "english": "Al-Wadood: The Affectionate One"
            },
            "content": {
              "urdu": [
                "حدیث میں ایسی خاتون سے نکاح کی ترغیب دی گئی ہے جو بہت محبت کرنے والی ہو۔",
                "محبت اور الفت ہی گھر کے سکون اور مضبوط ازدواجی تعلق کی بنیاد ہے۔",
                "ایسی صفات بچوں کی بہترین تربیت اور خاندانی استحکام میں مددگار ثابت ہوتی ہیں۔"
              ],
              "english": [
                "The Hadith encourages marrying women who are naturally affectionate and loving.",
                "Love and affection are the foundations of a peaceful home and a strong marital bond.",
                "Such qualities assist in the proper upbringing of children and overall family stability."
              ]
            }
          },
          {
            "title": {
              "urdu": "الولود: کثرتِ اولاد کی اہمیت",
              "english": "Al-Walood: Importance of Procreation"
            },
            "content": {
              "urdu": [
                "نکاح کا ایک اہم مقصد انسانی نسل کی بقا اور امتِ مسلمہ کی تعداد میں اضافہ ہے۔",
                "زیادہ بچے جننے والی خاتون کا انتخاب امت کی قوت اور وسعت کا باعث بنتا ہے۔",
                "اسلامی معاشرے میں بچوں کو بوجھ نہیں بلکہ اللہ کی نعمت سمجھا جاتا ہے۔"
              ],
              "english": [
                "A key objective of marriage is the continuation of the human race and the growth of the Ummah.",
                "Choosing a spouse who is fertile leads to the strength and expansion of the Muslim community.",
                "In an Islamic society, children are viewed as a blessing from Allah, not a financial burden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روزِ قیامت نبی ﷺ کا فخر",
        "english": "The Pride of the Prophet (ﷺ) on Resurrection Day"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کثرتِ امت پر فخر",
              "english": "Pride in Large Numbers"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ قیامت کے دن اپنی امت کی کثرت پر دیگر انبیاء کے سامنے فخر کریں گے۔",
                "امت کی تعداد بڑھانا دراصل نبی ﷺ کی خوشی اور ان کے مقصد کی تکمیل ہے۔",
                "ایک صالح اولاد کا اضافہ امت کے مجموعی خیر اور برکت میں اضافے کا سبب ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) will take pride in the large number of his followers compared to other nations.",
                "Increasing the size of the Ummah contributes to fulfilling the Prophet's (ﷺ) vision.",
                "The addition of righteous offspring increases the overall goodness and blessing of the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اور دفاعی اہمیت",
              "english": "Social and Strategic Importance"
            },
            "content": {
              "urdu": [
                "امت کی کثرت معاشرے کی افرادی قوت اور مضبوطی کو ظاہر کرتی ہے۔",
                "صالح نوجوان نسل ہی دین کی دعوت اور تحفظ کا کام سرانجام دیتی ہے۔",
                "اسلامی نظام کی ترویج کے لیے ایک بڑی اور باشعور افرادی قوت کی ضرورت ہے۔"
              ],
              "english": [
                "The abundance of the Ummah reflects the human resource strength and resilience of society.",
                "A righteous young generation is essential for the propagation and defense of faith.",
                "The spread of the Islamic system requires a large and conscious population of believers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی ہدایات اور حکمت",
        "english": "Practical Guidelines and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انتخاب میں دور اندیشی",
              "english": "Foresight in Selection"
            },
            "content": {
              "urdu": [
                "شادی کے لیے صرف ظاہری خوبصورتی نہیں بلکہ اخلاق اور اوصاف کو دیکھنا چاہیے۔",
                "محبت اور خاندان بڑھانے کی صلاحیت خوشگوار زندگی کے لیے کلیدی اہمیت رکھتے ہیں۔",
                "یہ حدیث ایک مسلمان کو شادی کے معاملے میں صحیح ترجیحات کا تعین کرنا سکھاتی ہے۔"
              ],
              "english": [
                "One should look beyond external beauty and prioritize character and virtues when choosing a spouse.",
                "Affection and the potential for a family are key factors for a happy and fulfilling life.",
                "This Hadith teaches a Muslim how to set the right priorities when entering marriage."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کی تربیت کی ذمہ داری",
              "english": "Responsibility of Upbringing"
            },
            "content": {
              "urdu": [
                "صرف تعداد بڑھانا کافی نہیں بلکہ ان کی صالح تربیت بھی شرعی تقاضا ہے۔",
                "نبی ﷺ کا فخر ان امتیوں پر ہوگا جو ایمان اور عملِ صالح کے حامل ہوں گے۔",
                "والدین کو چاہیے کہ وہ اپنی اولاد کو اسلام کا بہترین سپاہی بنائیں۔"
              ],
              "english": [
                "Increasing numbers alone is not enough; their righteous upbringing is a religious requirement.",
                "The Prophet's (ﷺ) pride will be in those followers who possess firm faith and good deeds.",
                "Parents must strive to raise their children to be the best representatives of Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}