{
  "hadithId": 921,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1057"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري ( 5269 ) ، ومسلم ( 127 ) ، من طريق قتادة ، عن زرارة بن أوفى ، عن أبي هريرة ، به . وزاد البخاري : قال قتادة : إذا طلق في نفسه فليس بشيء .",
    "urdu": "صحیح۔ اسے بخاری (5269) اور مسلم (127) نے روایت کیا ہے۔ امام قتادہ نے اس کی تشریح میں اضافہ کیا کہ: 'اگر کسی نے اپنے جی میں طلاق دی تو وہ کچھ بھی نہیں (یعنی طلاق واقع نہیں ہوگی)'۔ یہ اللہ کی طرف سے امتِ محمدیہ پر خصوصی تخفیف ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5269) and Muslim (127). Bukhari adds that Qatadah said: 'If a man divorces his wife in his mind, it is nothing (it does not count).' This demonstrates Allah's mercy towards this Ummah."
  },
  "importantWords": [
    {
      "arabic": "تَجَاوَزَ",
      "english": "Overlooked / Forgave",
      "urdu": "درگزر فرمایا"
    },
    {
      "arabic": "حَدَّثَتْ",
      "english": "Whispered / Suggested",
      "urdu": "بات کی / وسوسہ ڈالا"
    },
    {
      "arabic": "أَنْفُسَهَا",
      "english": "Themselves / Souls",
      "urdu": "ان کے جی / نفوس"
    },
    {
      "arabic": "تَعْمَلْ",
      "english": "Act upon",
      "urdu": "عمل کرے"
    },
    {
      "arabic": "تَكَلَّمْ",
      "english": "Speak",
      "urdu": "کلام کرے / بولے"
    }
  ],
  "summary": {
    "urdu": "اللہ تعالیٰ نے صرف دل میں آنے والے برے خیالات یا طلاق کی سوچ پر کوئی گناہ یا شرعی حکم نافذ نہیں کیا، جب تک اسے زبان سے ادا نہ کیا جائے یا عملی جامہ نہ پہنایا جائے۔",
    "english": "Allah does not hold this Ummah accountable for internal whispers or thoughts of divorce as long as they remain unspoken and unacted upon."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5269)",
      "english": "Sahih al-Bukhari (5269)"
    },
    {
      "arabic": "صحيح مسلم (127)",
      "english": "Sahih Muslim (127)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وسوسہ اور قلبی خیالات",
        "english": "Whispers and Internal Thoughts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی وسیع رحمت",
              "english": "Allah's Vast Mercy"
            },
            "content": {
              "urdu": [
                "انسانی دل میں خیالات کا آنا قدرتی عمل ہے جس پر انسان کا مکمل اختیار نہیں ہوتا۔",
                "اللہ تعالیٰ نے اپنے فضل سے صرف سوچ کی بنیاد پر سزا یا مواخذہ ختم کر دیا ہے۔",
                "یہ امتِ محمدیہ کے لیے ایک بہت بڑی آسانی اور ذہنی سکون کا باعث ہے۔"
              ],
              "english": [
                "The occurrence of thoughts in the heart is a natural process beyond complete human control.",
                "Out of His grace, Allah has removed punishment or accountability based solely on thoughts.",
                "This serves as a great ease and source of mental peace for the Ummah of Muhammad (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہ اور نیکی کا معیار",
              "english": "Criteria for Sin and Virtue"
            },
            "content": {
              "urdu": [
                "برے خیال پر اس وقت تک گناہ نہیں جب تک اسے زبان سے نہ نکالا جائے۔",
                "اگر کوئی برے خیال کو اللہ کے خوف سے دل ہی میں دبا دے تو اسے نیکی ملتی ہے۔",
                "شریعت ظاہری افعال اور اقوال پر احکام جاری کرتی ہے، نہ کہ محض نیتوں پر۔"
              ],
              "english": [
                "A bad thought is not a sin until it is expressed through speech or action.",
                "If someone suppresses an evil thought for the fear of Allah, they are rewarded.",
                "Shariah issues rulings based on outward actions and speech, not mere internal intentions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طلاق اور قلبی ارادہ",
        "english": "Divorce and Internal Intention"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طلاق کے وقوع کی شرط",
              "english": "Conditions for Divorce to Occur"
            },
            "content": {
              "urdu": [
                "محض دل میں طلاق کا ارادہ کرنے یا سوچنے سے طلاق واقع نہیں ہوتی۔",
                "جب تک صریح الفاظ زبان سے ادا نہ کیے جائیں، نکاح کا رشتہ قائم رہتا ہے۔",
                "یہ اصول وسوسوں کا شکار ہونے والے میاں بیوی کے لیے ایک مضبوط ڈھال ہے۔"
              ],
              "english": [
                "Divorce does not take place merely by intending or thinking about it in the heart.",
                "The marital bond remains intact until explicit words are uttered by the tongue.",
                "This principle acts as a strong shield for spouses suffering from obsessive whispers (waswasah)."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی ضابطہ",
              "english": "Legal Jurisprudence Rule"
            },
            "content": {
              "urdu": [
                "فقہ کا قاعدہ ہے کہ 'یقین شک سے زائل نہیں ہوتا'، نکاح یقینی ہے اور خیال شک ہے۔",
                "تحریری طلاق بھی زبان سے بولنے کے قائم مقام سمجھی جاتی ہے کیونکہ وہ 'عمل' ہے۔",
                "گونگے کی طلاق اشارے سے واقع ہوتی ہے کیونکہ اس کا اشارہ کلام کے برابر ہے۔"
              ],
              "english": [
                "A legal maxim states 'Certainty is not removed by doubt'; marriage is certain, thoughts are doubt.",
                "Written divorce is also treated like spoken word as it constitutes an 'action'.",
                "A mute person's divorce is valid through signs as their signs equate to speech."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نفسیاتی و تربیتی پہلو",
        "english": "Psychological and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذہنی بوجھ سے آزادی",
              "english": "Freedom from Mental Burden"
            },
            "content": {
              "urdu": [
                "بہت سے لوگ اپنے برے خیالات کی وجہ سے احساسِ جرم اور ڈپریشن کا شکار ہو جاتے ہیں۔",
                "یہ حدیث انہیں بتاتی ہے کہ جب تک آپ عمل نہیں کرتے، آپ اللہ کی نظر میں بے گناہ ہیں۔",
                "اسلام ذہنی صحت اور قلبی اطمینان کو بہت اہمیت دیتا ہے۔"
              ],
              "english": [
                "Many people suffer from guilt and depression due to unwanted intrusive thoughts.",
                "This Hadith informs them that as long as they don't act, they are innocent before Allah.",
                "Islam places great importance on mental health and tranquility of the heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس پر قابو پانا",
              "english": "Self-Control"
            },
            "content": {
              "urdu": [
                "خیال کا آنا گناہ نہیں، لیکن اسے عمل میں بدلنا انسان کے اپنے اختیار میں ہے۔",
                "انسان کو چاہیے کہ وہ برے خیالات کو دل میں جگہ دینے کے بجائے استغفار کرے۔",
                "نفس کی تربیت کا مقصد خیالات کو قابو کرنا اور اعمال کو درست رکھنا ہے۔"
              ],
              "english": [
                "The arrival of a thought is not a sin, but converting it to action is within one's will.",
                "One should seek forgiveness (Istighfar) rather than harboring evil thoughts in the heart.",
                "The goal of self-discipline is to manage thoughts and keep actions righteous."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شیطانی چالوں کا سدِ باب",
        "english": "Preventing Satanic Plots"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وسوسوں کا علاج",
              "english": "Remedy for Whispers"
            },
            "content": {
              "urdu": [
                "شیطان مومن کے دل میں شکوک و شبہات پیدا کر کے اسے پریشان کرنے کی کوشش کرتا ہے۔",
                "یہ حدیث واضح کرتی ہے کہ شیطانی وسوسے اس وقت تک بے اثر ہیں جب تک مانے نہ جائیں۔",
                "ذکرِ الٰہی ان وسوسوں کو دور کرنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Satan tries to harass the believer by creating doubts and suspicions in the heart.",
                "This Hadith clarifies that Satanic whispers are ineffective as long as they aren't followed.",
                "The remembrance of Allah (Dhikr) is the best way to dispel these whispers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعمال کی اہمیت",
              "english": "Importance of Actions"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرے میں قانون کا نفاذ صرف ظاہر پر ہوتا ہے، باطن اللہ کے سپرد ہے۔",
                "دوسروں پر صرف ان کے اعمال اور اقوال کی بنیاد پر حکم لگانا چاہیے۔",
                "یہ اصول باہمی اعتماد اور سماجی سکون کو برقرار رکھنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "In an Islamic society, the law is applied to the outward; the inward is left to Allah.",
                "Judgments on others should only be based on their actions and spoken words.",
                "This principle helps in maintaining mutual trust and social tranquility."
              ]
            }
          }
        ]
      }
    }
  ]
}