{
  "hadithId": 1395,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["tirmidhi:1962"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب البر والصلة",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه الترمذي (1962)، والبخاري في الأدب المفرد (283). وفي سنده صدقة بن موسى الدقيقي وهو ضعيف، لكن معناه صحيح وتؤيده نصوص أخرى.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے امام ترمذی (1962) اور امام بخاری نے الادب المفرد (283) میں روایت کیا ہے۔ اس کی سند میں صدقة بن موسیٰ الدقیقی ضعیف راوی ہے، تاہم دیگر صحیح احادیث بخل اور بد اخلاقی کی مذمت میں موجود ہیں۔",
    "english": "Weak. Reported by At-Tirmidhi (1962) and Al-Bukhari in Al-Adab al-Mufrad (283). The narrator Sadaqah bin Musa is weak, though the core meaning is supported by other authentic texts condemning stinginess and ill manners."
  },
  "importantWords": [
    {
      "arabic": "خَصْلَتَانِ",
      "english": "Two qualities / traits",
      "urdu": "دو خصلتیں / عادتیں"
    },
    {
      "arabic": "لَا يَجْتَمِعَانِ",
      "english": "Do not combine / meet",
      "urdu": "جمع نہیں ہوتیں"
    },
    {
      "arabic": "مُؤْمِنٍ",
      "english": "A believer",
      "urdu": "مومن / ایمان والا"
    },
    {
      "arabic": "الْبُخْلُ",
      "english": "Stinginess / Misery",
      "urdu": "بخل / کنجوسی"
    },
    {
      "arabic": "سُوءُ اَلْخُلُقِ",
      "english": "Bad character / manners",
      "urdu": "برا اخلاق / بدتمیزی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ کامل ایمان اور بخل و بد اخلاقی ایک جگہ جمع نہیں ہو سکتے۔ ایک سچے مومن کو سخی اور خوش اخلاق ہونا چاہیے۔",
    "english": "This Hadith clarifies that perfect faith is incompatible with stinginess and bad manners. A true believer must strive to be generous and well-mannered."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1962)",
      "english": "Sunan at-Tirmidhi (1962)"
    },
    {
      "arabic": "الأدب المفرد للبخاري (283)",
      "english": "Al-Adab al-Mufrad by Bukhari (283)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqE99HlK6_o",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بخل اور ایمان کا تضاد",
        "english": "Incompatibility of Greed and Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بخل کی شرعی مذمت",
              "english": "Sharia Condemnation of Stinginess"
            },
            "content": {
              "urdu": [
                "بخل سے مراد اللہ کے دیے ہوئے مال کو اس کی راہ میں خرچ کرنے سے رکنا ہے۔",
                "یہ صفت اللہ پر بھروسے کی کمی اور دنیا کی حد سے زیادہ محبت کو ظاہر کرتی ہے۔",
                "ایمان کا تقاضا سخاوت ہے جبکہ بخل نفس کی تنگی اور کمزوری کی علامت ہے۔"
              ],
              "english": [
                "Stinginess refers to withholding wealth from the causes commanded by Allah.",
                "This trait indicates a lack of trust in Allah and excessive love for the world.",
                "Faith demands generosity, while stinginess is a sign of spiritual narrowness."
              ]
            }
          },
          {
            "title": {
              "urdu": "سابقہ قوموں کی ہلاکت",
              "english": "Destruction of Previous Nations"
            },
            "content": {
              "urdu": [
                "بخل وہ بیماری ہے جس نے پچھلی بہت سی قوموں کو فتنوں میں مبتلا کر کے ہلاک کیا۔",
                "مال کی ہوس انسان کو ظلم، قطع رحمی اور ناحق خون بہانے پر اکساتی ہے۔",
                "مومن کو چاہیے کہ وہ اس مہلک بیماری سے ہر وقت اللہ کی پناہ مانگے۔"
              ],
              "english": [
                "Greed is a disease that afflicted and destroyed many previous nations through trials.",
                "Obsession with wealth incites humans to oppression and severing of ties.",
                "A believer should constantly seek Allah's refuge from this fatal spiritual illness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بد اخلاقی کی سنگینی",
        "english": "Severity of Bad Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کی روح",
              "english": "The Spirit of Faith"
            },
            "content": {
              "urdu": [
                "حسنِ اخلاق ایمان کی تکمیل ہے اور بد اخلاقی ایمان کے نور کو بجھا دیتی ہے۔",
                "قیامت کے دن میزان میں سب سے وزنی عمل اچھے اخلاق ہی ہوں گے۔",
                "لوگوں کے ساتھ درشتی اور تلخی سے پیش آنا مومن کا شیوہ نہیں ہے۔"
              ],
              "english": [
                "Good manners complete one's faith, while bad manners extinguish its light.",
                "On Judgment Day, the heaviest deed on the scale will be good character.",
                "Interacting with people harshly or rudely is not the way of a true believer."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی اثرات",
              "english": "Social Impact"
            },
            "content": {
              "urdu": [
                "بد اخلاق شخص معاشرے میں تنہا رہ جاتا ہے اور اللہ کی رحمت سے دور ہوتا ہے۔",
                "اسلام نے معاملات اور اخلاق کو عبادات کے برابر اہمیت دی ہے۔",
                "اپنے مسلمان بھائی سے خوش اخلاقی سے ملنا بھی ایک عظیم صدقہ ہے۔"
              ],
              "english": [
                "A person with bad manners becomes isolated in society and distant from mercy.",
                "Islam places as much importance on conduct and ethics as it does on worship.",
                "Meeting one's brother with a cheerful face is considered a great charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمان کی پختگی کا معیار",
        "english": "Criteria for Maturity in Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال اور صفات کا ملاپ",
              "english": "Union of Actions and Attributes"
            },
            "content": {
              "urdu": [
                "صرف نماز روزہ کافی نہیں بلکہ دل کا سخی اور زبان کا میٹھا ہونا ضروری ہے۔",
                "کامل مومن وہی ہے جو دوسروں کو اپنے مال اور اخلاق سے فائدہ پہنچائے۔",
                "بخل اور بد اخلاقی کا اجتماع منافقانہ طرز عمل کی طرف اشارہ کرتا ہے۔"
              ],
              "english": [
                "Prayer and fasting are not enough; a generous heart and kind speech are vital.",
                "A perfect believer is one who benefits others through wealth and character.",
                "The combination of greed and bad manners hints at hypocritical behavior."
              ]
            }
          },
          {
            "title": {
              "urdu": "تزکیہ نفس کی ضرورت",
              "english": "Necessity of Self-Purification"
            },
            "content": {
              "urdu": [
                "انسان کو ہر وقت اپنے باطن کا جائزہ لینا چاہیے کہ کہیں یہ برائیاں تو نہیں۔",
                "نفس کی تربیت کے ذریعے ہی بخل کو سخاوت میں بدلا جا سکتا ہے۔",
                "اللہ سے ہدایت کی دعا مانگنا اور نیک لوگوں کی صحبت اختیار کرنا ضروری ہے۔"
              ],
              "english": [
                "One must constantly audit their inner self to detect these hidden evils.",
                "Greed can be transformed into generosity through disciplined self-training.",
                "Seeking guidance through prayer and staying in good company is essential."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور نصائح",
        "english": "Practical Training and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخاوت کی مشق",
              "english": "Practicing Generosity"
            },
            "content": {
              "urdu": [
                "تنگ دستی کے وقت بھی صدقہ کرنے کی عادت ڈالیں تاکہ بخل ختم ہو۔",
                "دوسروں کی ضروریات کو اپنی ضروریات پر ترجیح دینا سیکھیں۔",
                "مال کی حقیقت کو سمجھیں کہ یہ اللہ کی دی ہوئی ایک عارضی امانت ہے۔"
              ],
              "english": [
                "Habituate yourself to giving charity even in times of need to end greed.",
                "Learn to prioritize the needs of others over your own personal desires.",
                "Understand the nature of wealth as a temporary trust granted by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی اصلاح",
              "english": "Character Improvement"
            },
            "content": {
              "urdu": [
                "غصے اور تلخی پر قابو پانا خوش اخلاقی کا پہلا زینہ ہے۔",
                "نبی ﷺ کے اسوہ حسنہ کو اپنی روزمرہ زندگی کا نمونہ بنائیں۔",
                "دوسروں کے ساتھ ویسا ہی برتاؤ کریں جیسا آپ اپنے لیے پسند کرتے ہیں۔"
              ],
              "english": [
                "Controlling anger and bitterness is the first step toward good manners.",
                "Make the Prophet's (ﷺ) life the role model for your daily interactions.",
                "Treat others in the same manner as you would like to be treated yourself."
              ]
            }
          }
        ]
      }
    }
  ]
}