{
  "hadithId": 79,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bukhari:150", "muslim:271a"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": " صحيح. رواه البخاري (150) ، ومسلم (271) ، (70) واللفظ لمسلم. والعنزة: رميح بين العصا والرمح، فيه زج.",
    "urdu": "یہ حدیث **صحیح** ہے۔ اسے بخاری (150) اور مسلم (271) (70) نے روایت کیا ہے، اور یہ الفاظ مسلم کے ہیں۔ العنزہ (چھوٹا نیزہ) ایک چھوٹی لاٹھی اور نیزے کے درمیان کی چیز ہے جس کے سرے پر لوہا لگا ہوتا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (150) and Muslim (271) (70), with the wording belonging to Muslim. Al-'Anazah (the short spear) is a small spear-like stick, positioned between a walking stick and a full spear, having a metal tip."
  },
  "importantWords": [
    {
      "arabic": "يَدْخُلُ",
      "english": "He enters/used to enter",
      "urdu": "داخل ہوتے"
    },
    {
      "arabic": "اَلْخَلَاءَ",
      "english": "The lavatory/open ground for relief",
      "urdu": "بیت الخلاء / قضائے حاجت کی جگہ"
    },
    {
      "arabic": "غُلَامٌ",
      "english": "A boy/servant",
      "urdu": "ایک لڑکا / خادم"
    },
    {
      "arabic": "إِدَاوَةً",
      "english": "Small leather water vessel",
      "urdu": "چرمی پانی کا برتن"
    },
    {
      "arabic": "عَنَزَةً",
      "english": "Short spear / staff",
      "urdu": "چھوٹا نیزہ / عصا"
    },
    {
      "arabic": "فَيَسْتَنْجِي",
      "english": "He cleanses himself (Istinja')",
      "urdu": "استنجاء فرماتے"
    },
    {
      "arabic": "بِالْمَاءِ",
      "english": "With water",
      "urdu": "پانی سے"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْه",
      "english": "Agreed upon (by Bukhari and Muslim)",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "مَاء",
      "english": "Water",
      "urdu": "پانی"
    },
    {
      "arabic": "طَهَارَة",
      "english": "Purity",
      "urdu": "طہارت"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے بعد پانی سے استنجاء کرنے کی اہمیت، اور پردہ داری کے لیے ایک آڑ (عنزہ) استعمال کرنے کی سنت کو واضح کرتی ہے، جس پر رسول اللہ صلی اللہ علیہ وسلم کا عمل تھا۔",
    "english": "This Hadith highlights the importance of using **water for Istinja'** (cleansing after defecation/urination) and the Sunnah of using a screen or barrier ('Anazah) for privacy when relieving oneself in an open area."
  },
  "references": [
    {
      "arabic": "رواه البخاري (150)",
      "english": "Reported by Al-Bukhari (No. 150)"
    },
    {
      "arabic": "رواه مسلم (271)",
      "english": "Reported by Muslim (No. 271)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَنَسِ بْنِ مَالِكٍ  - رضى الله عنه",
        "english": "Anas ibn Malik (May Allah be pleased with him)"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih Muttafaq Alayh (Agreed upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استنجاء میں پانی کا استعمال",
        "english": "The Use of Water for Istinja'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استنجاء کا طریقہ",
              "english": "Method of Cleansing"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر ثابت کرتی ہے کہ نبی صلی اللہ علیہ وسلم نے قضائے حاجت کے بعد صفائی کے لیے **پانی کا استعمال** فرمایا۔",
                "پانی نجاست کو مکمل طور پر زائل کر دیتا ہے، اس لیے فقہاء کے نزدیک یہ استنجاء کا سب سے افضل اور مکمل طریقہ ہے۔",
                "مسلمان کو چاہیے کہ جہاں ممکن ہو، استنجاء کے لیے پانی کو ترجیح دے، ورنہ پتھر یا ٹشو پیپر وغیرہ کافی ہوں گے۔"
              ],
              "english": [
                "This Hadith clearly proves that the Prophet (PBUH) used **water for cleansing (Istinja')** after relieving himself.",
                "Water completely removes the substance of impurity, making it the most superior and thorough method of cleansing according to jurists.",
                "Where possible, a Muslim should prioritize water for Istinja'; otherwise, clean stones or tissue paper are permissible alternatives."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمع بین الماء و الحجر",
              "english": "Combining Water and Stones"
            },
            "content": {
              "urdu": [
                "بعض دیگر روایات میں پتھر (یا اسی طرح کی چیز) کے استعمال کا ذکر ہے، جس سے پتہ چلتا ہے کہ دونوں جائز ہیں۔",
                "جن فقہاء نے دونوں کو جمع کرنے کو افضل قرار دیا ہے، وہ پہلے پتھر سے نجاست دور کرنے اور پھر پانی سے جگہ کو پاک کرنے کی ترغیب دیتے ہیں۔",
                "تاہم، یہ حدیث صرف پانی کے استعمال کی سنت کو اجاگر کرتی ہے، جو تنہا بھی کافی ہے۔ "
              ],
              "english": [
                "Other narrations mention the use of stones (or similar items), indicating both methods are permissible.",
                "Jurists who recommend combining them suggest cleaning the substance of impurity first with a solid object, and then purifying the area with water.",
                "However, this Hadith highlights the Sunnah of using water, which is sufficient on its own for purification. "
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پردہ داری اور آدابِ خلاء",
        "english": "Privacy and Etiquette of the Lavatory"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عنزہ کا کردار",
              "english": "The Role of the 'Anazah"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کے ساتھ عنزہ (چھوٹا نیزہ) لے جایا جاتا تھا، تاکہ اسے قضائے حاجت کے وقت پردہ (ستر) کے طور پر گاڑ سکیں۔",
                "یہ اس بات کی دلیل ہے کہ پردہ داری اور تنہائی کا خیال رکھنا قضائے حاجت کے آداب میں شامل ہے۔",
                "فقہی حکم یہ ہے کہ اگر کوئی کھلی جگہ پر قضائے حاجت کرے تو اسے لوگوں کی نظروں سے اوجھل ہونے کے لیے آڑ کا انتظام کرنا لازم ہے۔"
              ],
              "english": [
                "The 'Anazah (short spear) was carried with the Prophet (PBUH) so it could be erected as a screen (Sutrah) for privacy while relieving himself.",
                "This proves that maintaining privacy and seclusion is a vital etiquette of answering the call of nature.",
                "The legal ruling mandates that if one relieves themselves in an open area, they must arrange a barrier to shield themselves from public view."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کی تربیت اور خدمت",
              "english": "Training of Children and Service"
            },
            "content": {
              "urdu": [
                "سیدنا انس رضی اللہ عنہ اور ان کے ہم عمر لڑکے کا برتن اٹھانا اس بات کی طرف اشارہ ہے کہ صحابہ کرام ہر چھوٹی بڑی خدمت پر مامور رہتے تھے۔",
                "یہ روایت والدین اور اساتذہ کو نوجوانی کی عمر کے بچوں کو دینی اور عملی خدمت کی تربیت دینے کی ترغیب دیتی ہے۔",
                "اس سے خادموں کی سادگی اور ادب بھی ظاہر ہوتا ہے کہ وہ آقا کی ضرورت کے وقت تمام لوازمات کا خیال رکھتے تھے۔"
              ],
              "english": [
                "Anas (RA) and the other boy carrying the vessel suggests that the Companions were keen to offer service in all matters, big or small.",
                "This narration encourages parents and educators to train young children in religious and practical service.",
                "It also demonstrates the simplicity and dedication of the servants, ensuring all necessities were taken care of for the master's needs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اصول اور دیگر احکام",
        "english": "Juristic Principles and Related Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استنجاء کا حکم",
              "english": "The Ruling of Istinja'"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک قضائے حاجت کے بعد صفائی (استنجاء) کرنا واجب ہے تاکہ نماز اور دیگر عبادات کے لیے طہارت حاصل ہو۔",
                "استنجاء صرف پانی یا صرف خشک چیز (جیسے پتھر یا ٹشو) سے بھی کافی ہے، مگر پانی سے مکمل صفائی ہوتی ہے۔",
                "اس حدیث کی بنیاد پر، اگر طہارت صرف خشک چیز سے ہو تو وضو سے پہلے ہاتھ دھونا بھی ضروری ہے۔"
              ],
              "english": [
                "According to jurists, cleansing after answering the call of nature (Istinja') is obligatory (Wajib) to ensure purity for prayer and other acts of worship.",
                "Istinja' is sufficient with only water or only a solid item (like a stone or tissue), but water ensures complete cleanliness.",
                "Based on this Sunnah, if purification is done only with a solid item, washing the hands before Wudu' is also necessary."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کا ساتھ دینا",
              "english": "The Boys Accompanying the Prophet"
            },
            "content": {
              "urdu": [
                "بچوں کا پانی لے کر ساتھ جانا اس بات کی دلیل ہے کہ خادمین پیغمبر کی ذاتی ضروریات کا بھی پورا خیال رکھتے تھے۔",
                "اس عمل کو آج بھی ایک اچھا عمل سمجھا جاتا ہے کہ سفر یا کھلی جگہ پر طہارت کے لیے پانی ساتھ رکھا جائے۔",
                "یہ واقعہ سنتِ مؤکدہ کو اجاگر کرتا ہے کہ طہارت کے معاملے میں کوئی غفلت نہیں برتنی چاہیے۔"
              ],
              "english": [
                "The boys carrying water shows that the Prophet's personal needs were diligently attended to by his servants.",
                "This practice is still considered praiseworthy today: carrying water for purity when traveling or using open spaces.",
                "This incident highlights a confirmed Sunnah (Sunnah Mu'akkadah) that one must not be negligent in matters of ritual purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "متفق علیہ کی سند اور مقام",
        "english": "Status and Strength of Muttafaq Alayh"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی پختگی",
              "english": "Strength of the Chain (Sanad)"
            },
            "content": {
              "urdu": [
                "یہ حدیث 'متفق علیہ' ہے، یعنی اسے امام بخاری اور امام مسلم دونوں نے اپنی صحیح میں روایت کیا ہے، جو سب سے اعلیٰ درجہ ہے۔",
                "اس لیے اس کے حکم پر عمل کرنا ہر مسلمان کے لیے شرعی طور پر مستند اور ثابت شدہ سنت ہے۔",
                "اس کی صحت اس بات کو یقینی بناتی ہے کہ استنجاء میں پانی کی فضیلت پر کوئی شک نہیں کیا جا سکتا۔"
              ],
              "english": [
                "This Hadith is classified as 'Muttafaq Alayh' (Agreed Upon), meaning both Imam Al-Bukhari and Imam Muslim included it in their Sahih collections, representing the highest authenticity level.",
                "Therefore, acting upon its ruling is a legally authenticated and proven Sunnah for every Muslim.",
                "Its robust authenticity ensures that the superiority of using water for Istinja' cannot be doubted."
              ]
            }
          },
          {
            "title": {
              "urdu": "آدابِ خلاء کی تعلیم",
              "english": "Teaching Lavatory Etiquette"
            },
            "content": {
              "urdu": [
                "یہ روایت قضائے حاجت کے آداب کا ایک جامع درس دیتی ہے: پردہ، پانی کا استعمال، اور اللہ کے نام کے ادب کا خیال رکھنا۔",
                "ان تمام آداب کا مقصد صرف جسمانی صفائی نہیں، بلکہ جنات کے شر سے حفاظت بھی ہے (جیسا کہ پچھلی حدیث میں دعا کا ذکر ہوا)۔",
                "طہارت کی ان تفصیلات پر عمل پیرا ہونا ایک مسلمان کی زندگی میں کامل پاکیزگی اور خدا ترسی کا اظہار ہے۔"
              ],
              "english": [
                "This narration provides a comprehensive lesson in lavatory etiquette: maintaining privacy, using water, and observing reverence for Allah's Name.",
                "The goal of these rules is not just physical cleanliness but also protection from the evil of the Jinn (as mentioned in the preceding Dua Hadith).",
                "Adhering to these details of purity expresses a Muslim's commitment to complete cleanliness and God-consciousness in their life."
              ]
            }
          }
        ]
      }
    }
  ]
}
