{
  "hadithId": 1247,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:5856"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "كتاب اللباس",
    "babId": 102
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5856)‏، ومسلم (2097).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری نے حدیث نمبر 5856 اور امام مسلم نے حدیث نمبر 2097 پر اپنی اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5856) and Muslim (2097). The wording belongs to Al-Bukhari."
  },
  "importantWords": [
    {
      "arabic": "انْتَعَلَ",
      "english": "Puts on sandals",
      "urdu": "جوتا پہنا"
    },
    {
      "arabic": "يَبْدَأْ",
      "english": "Starts",
      "urdu": "شروع کرے"
    },
    {
      "arabic": "نَزَعَ",
      "english": "Removes / Takes off",
      "urdu": "اتارا"
    },
    {
      "arabic": "الشِّمَالِ",
      "english": "The Left",
      "urdu": "بایاں"
    },
    {
      "arabic": "الْيَمِينِ",
      "english": "The Right",
      "urdu": "دایاں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں جوتا پہننے اور اتارنے کا مسنون طریقہ بتایا گیا ہے، جس میں دائیں طرف کو عزت اور اولیت دینے کی تعلیم دی گئی ہے۔",
    "english": "This Hadith outlines the Sunnah method of wearing and removing footwear, emphasizing priority and honor for the right side."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5856)",
      "english": "Reported by Al-Bukhari (5856)"
    },
    {
      "arabic": "رواه مسلم (2097)",
      "english": "Reported by Muslim (2097)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9K8Z2o3T4Y",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دائیں جانب کی فضیلت",
        "english": "Virtue of the Right Side"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلامی ضابطہ حیات",
              "english": "Islamic Code of Conduct"
            },
            "content": {
              "urdu": [
                "اسلام ہر اچھے کام کی ابتدا دائیں جانب سے کرنے کی تعلیم دیتا ہے۔",
                "نبی کریم ﷺ کو اپنے ہر کام میں دائیں جانب سے آغاز پسند تھا۔",
                "جوتا پہننا ایک زینت کا عمل ہے، اس لیے اسے دائیں سے شروع کیا جاتا ہے۔"
              ],
              "english": [
                "Islam teaches to begin every noble or good act with the right side.",
                "The Prophet (ﷺ) loved starting from the right in all his daily affairs.",
                "Wearing shoes is an act of adornment, hence it starts with the right."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائیں کو اولیت دینا",
              "english": "Prioritizing the Right"
            },
            "content": {
              "urdu": [
                "دایاں پاؤں جوتا پہنتے وقت پہلے اور اتارتے وقت آخر میں ہونا چاہیے۔",
                "اس طرح دایاں پاؤں زیادہ دیر تک جوتے کی حفاظت اور زینت میں رہتا ہے۔",
                "یہ طریقہ کار دائیں جانب کی برتری اور شرف کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The right foot should be the first to wear and the last to take off.",
                "This ensures the right foot stays longer in the state of protection/adornment.",
                "This method reflects the superiority and honor granted to the right side."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جوتا اتارنے کے آداب",
        "english": "Etiquettes of Removing Footwear"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بائیں پاؤں سے ابتدا",
              "english": "Starting with the Left"
            },
            "content": {
              "urdu": [
                "جوتا اتارنے کا آغاز بائیں پاؤں سے کرنا سنتِ نبوی ﷺ ہے۔",
                "یہ دائیں پاؤں کو زیادہ دیر تک ڈھانپ کر رکھنے کی ایک حکمت ہے۔",
                "شریعت نے ہر چھوٹے بڑے عمل کے لیے بہترین ترتیب مقرر کی ہے۔"
              ],
              "english": [
                "Removing the left shoe first is an established Sunnah of the Prophet (ﷺ).",
                "This is a wisdom to keep the right foot covered for a longer duration.",
                "Sharia has set a perfect sequence for even the smallest daily actions."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی تعلیم",
              "english": "Teaching Discipline"
            },
            "content": {
              "urdu": [
                "یہ ترتیب ہمیں زندگی کے ہر معاملے میں نظم و ضبط سکھاتی ہے۔",
                "رسول اللہ ﷺ کی اتباع میں ہی ہماری دنیا اور آخرت کی کامیابی ہے۔",
                "سنت پر عمل کرنا انسان کی شخصیت میں وقار اور نظم پیدا کرتا ہے۔"
              ],
              "english": [
                "This sequence teaches us discipline in every aspect of our lives.",
                "Success in this world and the next lies in following the Prophet (ﷺ).",
                "Acting on the Sunnah instills dignity and order in a person's character."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Juristic and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک جوتے میں چلنے کی ممانعت",
              "english": "Prohibition of Walking in One Shoe"
            },
            "content": {
              "urdu": [
                "دیگر احادیث میں ایک جوتے میں چلنے سے بھی سختی سے منع کیا گیا ہے۔",
                "انسان کو چاہیے کہ یا تو دونوں جوتے پہنے یا دونوں پاؤں ننگے رکھے۔",
                "یہ عمل دیکھنے میں بھی ناگوار اور غیر متوازن معلوم ہوتا ہے۔"
              ],
              "english": [
                "Other Hadiths strictly prohibit walking with only one shoe on.",
                "A person should either wear both shoes or keep both feet bare.",
                "This act appears unpleasant and creates an unbalanced physical gait."
              ]
            }
          },
          {
            "title": {
              "urdu": "شخصیت کی تعمیر",
              "english": "Building Personality"
            },
            "content": {
              "urdu": [
                "سنت کے آداب انسان کو مہذب اور شائستہ بناتے ہیں۔",
                "جوتا پہننے جیسی عام بات میں بھی دین کی رہنمائی موجود ہے۔",
                "مومن کا ہر عمل اللہ کے ذکر اور سنت کی پیروی سے جڑا ہوتا ہے۔"
              ],
              "english": [
                "Sunnah etiquettes transform a person into a civilized individual.",
                "Even common tasks like wearing shoes have guidance in our religion.",
                "Every action of a believer is linked to Allah's remembrance and Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آدابِ نبوی ﷺ کو اپنانا",
              "english": "Adopting Prophetic Manners"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے بچوں کو بچپن سے ہی یہ مسنون طریقے سکھانے چاہئیں۔",
                "روزمرہ کی چھوٹی نیکیوں کو حقیر نہ سمجھیں کیونکہ ان کا بڑا اجر ہے۔",
                "سنت پر عمل کرنے سے زندگی میں برکت اور نور پیدا ہوتا ہے۔"
              ],
              "english": [
                "We should teach these Sunnah methods to our children from a young age.",
                "Do not belittle small daily good deeds as they carry great rewards.",
                "Practicing the Sunnah brings blessings and spiritual light into life."
              ]
            }
          },
          {
            "title": {
              "urdu": "شعوری پیروی",
              "english": "Conscious Following"
            },
            "content": {
              "urdu": [
                "جوتا پہنتے وقت نیت کریں کہ میں سنت کی اتباع کر رہا ہوں۔",
                "یہ شعور ایک عام دنیاوی عمل کو بھی عبادت میں بدل دیتا ہے۔",
                "اللہ ہمیں اپنے پیارے نبی ﷺ کے نقشِ قدم پر چلنے کی توفیق دے۔"
              ],
              "english": [
                "Intend to follow the Sunnah whenever you put on your footwear.",
                "This consciousness turns a mundane worldly act into an act of worship.",
                "May Allah grant us the strength to walk in the footsteps of the Prophet (ﷺ)."
              ]
            }
          }
        ]
      }
    }
  ]
}