{
  "hadithId": 424,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/muslim:2069a",
      "https://sunnah.com/abudawud:4054"
    ],
    "kitabId": 2,
    "inKitabBab": 17,
    "arabicBook": "كتاب اللباس",
    "babId": 27
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2069)‏، وأبو داود (4054)‏، والبخاري في الأدب المفرد (348).‏",
    "urdu": "یہ حدیث صحیح ہے۔ اس کی اصل صحیح مسلم میں ہے، جبکہ ابوداؤد نے لباس کی تفصیل اور امام بخاری نے الادب المفرد میں جمعہ اور وفود کے لیے پہننے کا ذکر کیا ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim (2069), Abu Dawud (4054), and Al-Bukhari in Al-Adab al-Mufrad (348)."
  },
  "importantWords": [
    {
      "arabic": "جُبَّةَ",
      "english": "Cloak / Gown",
      "urdu": "چوغا / جبہ"
    },
    {
      "arabic": "مَكْفُوفَةَ",
      "english": "Hemmed / Bordered",
      "urdu": "حاشیہ لگا ہوا"
    },
    {
      "arabic": "الدِّيبَاجِ",
      "english": "Silk Brocade",
      "urdu": "دبیز ریشم"
    },
    {
      "arabic": "نَسْتَشْفِي",
      "english": "Seeking Healing",
      "urdu": "شفاء طلب کرنا"
    },
    {
      "arabic": "لِلْوَفْدِ",
      "english": "For Delegations",
      "urdu": "وفود کے لیے"
    },
    {
      "arabic": "الْفَرْجَيْنِ",
      "english": "The two slits",
      "urdu": "دونوں چاک"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ لباس پر تھوڑی مقدار میں ریشم کا حاشیہ لگانا جائز ہے، اور تبرکاتِ نبوی سے شفاء حاصل کرنا صحابہ کا معمول تھا۔",
    "english": "This Hadith proves that minor silk borders on clothing are permissible and highlights the Sahaba's practice of seeking blessings (Tabarruk) from the Prophet's (PBUH) belongings."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2069)",
      "english": "Sahih Muslim (2069)"
    },
    {
      "arabic": "سنن أبي داود (4054)",
      "english": "Sunan Abu Dawud (4054)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أسماء بنت أبي بكر",
        "english": "Asma bint Abi Bakr"
      },
      "slug": "asma-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0S_Wv7Yq9E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لباس میں ریشم کی گنجائش",
        "english": "Permissibility of Silk in Clothing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاشیہ اور بارڈر کا حکم",
              "english": "Ruling on Borders and Hems"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے مکمل ریشمی لباس حرام ہے لیکن حاشیے کی حد تک اجازت ہے۔",
                "گریبان، آستین اور چاک پر ریشم لگانا زیب وزینت کا جائز طریقہ ہے۔",
                "فقہاء کے نزدیک چار انگلیوں کے برابر ریشم کی پٹی لگانا مباح ہے۔"
              ],
              "english": [
                "Full silk clothing is forbidden for men, but silk borders are allowed.",
                "Using silk on collars, sleeves, and slits is a permissible way of adornment.",
                "Jurists state that a silk strip up to four fingers in width is permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوبصورتی اور وقار",
              "english": "Beauty and Dignity"
            },
            "content": {
              "urdu": [
                "نبی ﷺ خاص مواقع پر خوبصورت اور باوقار لباس زیب تن فرماتے تھے۔",
                "جمالیاتی ذوق کی تسکین کے لیے شریعت کے اندر رہ کر زینت اختیار کرنا مستحب ہے۔",
                "عمدہ لباس پہننا اللہ کی نعمت کا اظہار ہے بشرطیکہ اس میں تکبر نہ ہو۔"
              ],
              "english": [
                "The Prophet (PBUH) wore beautiful and dignified clothes on special occasions.",
                "Adorning oneself within Sharia limits to satisfy aesthetic taste is recommended.",
                "Wearing fine clothes is an expression of Allah's blessings, provided there is no pride."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تبرکاتِ نبوی سے شفاء",
        "english": "Healing through Prophetic Relics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا عقیدہ",
              "english": "Belief of the Sahaba"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نبی ﷺ کے استعمال شدہ لباس اور اشیاء سے برکت حاصل کرتے تھے۔",
                "بیماروں کو شفاء کے لیے آپ ﷺ کے جبے کا دھوون پلانا ثابت شدہ عمل ہے۔",
                "یہ برکت نبی ﷺ کی ذاتِ اقدس کے ساتھ خاص تھی جو آپ کی اشیاء میں بھی منتقل ہوتی۔"
              ],
              "english": [
                "The Sahaba used to seek blessings from the clothes and items used by the Prophet (PBUH).",
                "Giving sick people water used to wash the Prophet's cloak is a confirmed practice.",
                "This blessing was specific to the Prophet's person and extended to his belongings."
              ]
            }
          },
          {
            "title": {
              "urdu": "تبرک کی شرعی حیثیت",
              "english": "Legal Status of Seeking Blessings"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے جسم سے چھو جانے والی چیزیں برکت کا باعث بن جاتی تھیں۔",
                "اس سے ثابت ہوتا ہے کہ تبرکات کی حفاظت اور ان سے شفاء طلب کرنا جائز ہے۔",
                "مگر یہ عقیدہ رکھنا ضروری ہے کہ اصل شفاء دینے والا اللہ تعالیٰ ہی ہے۔"
              ],
              "english": [
                "Items that touched the Prophet's (PBUH) body became sources of blessing.",
                "This proves that preserving relics and seeking healing through them is permissible.",
                "However, one must believe that the ultimate Healer is Allah alone."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاص مواقع کا لباس",
        "english": "Clothing for Special Occasions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمعہ اور وفود کے لیے زینت",
              "english": "Adornment for Friday and Delegations"
            },
            "content": {
              "urdu": [
                "جمعہ کے دن غسل کرنا اور بہترین میسر لباس پہننا سنت ہے۔",
                "غیر ملکی وفود کے سامنے اسلامی وقار ظاہر کرنے کے لیے عمدہ لباس پہننا مستحسن ہے۔",
                "نبی ﷺ نے ان سماجی آداب کا خاص خیال رکھا جو مسلمانوں کی عزت بڑھائیں۔"
              ],
              "english": [
                "Bathing and wearing the best available clothes on Friday is Sunnah.",
                "Wearing fine attire to show Islamic dignity before foreign delegations is encouraged.",
                "The Prophet (PBUH) was mindful of social etiquettes that enhance Muslim honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی کی اتباع",
              "english": "Following the Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "لباس کے معاملے میں نبی ﷺ کی پسند اور طریقے کو اپنانا باعثِ برکت ہے۔",
                "آپ ﷺ کا جبہ مبارک سنبھال کر رکھنا صحابہ کی والہانہ محبت کا مظہر ہے۔",
                "خوش لباسی اور صفائی ستھرائی اسلامی تعلیمات کا بنیادی حصہ ہیں۔"
              ],
              "english": [
                "Adopting the Prophet's (PBUH) preferences in clothing is a source of blessing.",
                "Preserving the Prophet's cloak shows the Sahaba's intense love for him.",
                "Good dressing and cleanliness are fundamental parts of Islamic teachings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میانہ روی اختیار کریں",
              "english": "Adopt Moderation"
            },
            "content": {
              "urdu": [
                "لباس میں سادگی اور زینت کے درمیان اعتدال کا راستہ اپنائیں۔",
                "ریشم اور سونے کے استعمال میں شرعی حدود کا سختی سے خیال رکھیں۔",
                "اپنی وسعت کے مطابق صاف ستھرا اور باوقار لباس پہنیں۔"
              ],
              "english": [
                "Follow a path of moderation between simplicity and adornment in clothing.",
                "Strictly observe Sharia boundaries regarding the use of silk and gold.",
                "Wear clean and dignified clothes according to your means."
              ]
            }
          },
          {
            "title": {
              "urdu": "تبرکات کا احترام",
              "english": "Respect for Relics"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ سے منسوب اشیاء کا احترام اور ان سے برکت کا عقیدہ درست ہے۔",
                "ان تبرکات کے ذریعے اللہ سے شفاء کی دعا مانگنا سنتِ صحابہ ہے۔",
                "دین میں غلو سے بچیں اور ہر عمل کو سنت کی روشنی میں پرکھیں۔"
              ],
              "english": [
                "Respecting items attributed to the Prophet (PBUH) and believing in their blessing is correct.",
                "Asking Allah for healing through these relics is the practice of the Sahaba.",
                "Avoid extremism in religion and judge every action in the light of the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
