{
  "hadithId": 1055,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1251"],
    "kitabId": 10,
    "inKitabBab": 3,
    "arabicBook": "بلوغ المرام",
    "babId": 86
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6783) ومسلم (1687).",
    "urdu": "یہ حدیث صحیح ہے اور صحیح بخاری (6783) اور صحیح مسلم (1687) دونوں میں مروی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6783) and Muslim (1687)."
  },
  "importantWords": [
    {
      "arabic": "لَعَنَ",
      "english": "Cursed",
      "urdu": "لعنت کی"
    },
    {
      "arabic": "السَّارِقَ",
      "english": "The Thief",
      "urdu": "چور"
    },
    {
      "arabic": "الْبَيْضَةَ",
      "english": "The Egg",
      "urdu": "انڈا"
    },
    {
      "arabic": "الْحَبْلَ",
      "english": "The Rope",
      "urdu": "رسی"
    },
    {
      "arabic": "فَتُقْطَعُ",
      "english": "So it is cut",
      "urdu": "پس کاٹ دیا جاتا ہے"
    },
    {
      "arabic": "يَدُهُ",
      "english": "His hand",
      "urdu": "اس کا ہاتھ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں چوری کی مذمت کی گئی ہے اور بتایا گیا ہے کہ معمولی چیز سے شروع ہونے والی چوری انسان کو ہاتھ کٹوانے جیسے سنگین انجام تک لے جاتی ہے۔",
    "english": "This Hadith condemns theft and illustrates how starting with petty items can eventually lead a person to the severe legal penalty of losing their hand."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6783)",
      "english": "Reported by Al-Bukhari (6783)"
    },
    {
      "arabic": "رواه مسلم (1687)",
      "english": "Reported by Muslim (1687)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3G_R-OclA0",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی تشریح اور مفہوم",
        "english": "Explanation and Meaning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انڈے اور رسی سے مراد",
              "english": "Meaning of Egg and Rope"
            },
            "content": {
              "urdu": [
                "علماء کے مطابق یہاں انڈے سے مراد لوہے کا خود (ہیلمٹ) بھی ہو سکتا ہے۔",
                "اسی طرح رسی سے مراد جہاز کی قیمتی رسی بھی ہو سکتی ہے۔",
                "مطلب یہ ہے کہ چور معمولی چیز سے چوری شروع کر کے عادی بن جاتا ہے۔"
              ],
              "english": [
                "Scholars state that 'egg' here could refer to a metal helmet used in war.",
                "Similarly, 'rope' might refer to expensive ropes used for ships.",
                "The point is that a thief starts with small items and becomes habitual."
              ]
            }
          },
          {
            "title": {
              "urdu": "بتدریج جرم کی طرف مائل ہونا",
              "english": "Gradual Inclination Towards Crime"
            },
            "content": {
              "urdu": [
                "انسان جب چھوٹی چیز چراتا ہے تو اس کی ہمت بڑھتی ہے۔",
                "پھر وہ بڑی چیزیں چراتا ہے یہاں تک کہ نصاب تک پہنچ جاتا ہے۔",
                "بالآخر وہ اپنے ہاتھ سے محروم ہو کر اللہ کی لعنت کا حقدار بنتا ہے۔"
              ],
              "english": [
                "When a person steals small things, their boldness increases.",
                "Then they steal larger items until they reach the legal threshold (Nisab).",
                "Ultimately, they lose their hand and deserve the curse of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور نصاب",
        "english": "Juristic Rulings and Threshold"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نصابِ سرقہ کی شرط",
              "english": "Condition of Nisab in Theft"
            },
            "content": {
              "urdu": [
                "ہاتھ کاٹنے کی سزا صرف اس وقت ہے جب مال نصاب کے برابر ہو۔",
                "چوتھائی دینار یا اس کی قیمت کا مال چرانے پر حد لگتی ہے۔",
                "معمولی چیز (جو نصاب سے کم ہو) پر ہاتھ نہیں کاٹا جاتا۔"
              ],
              "english": [
                "The penalty of cutting the hand only applies if the value meets the Nisab.",
                "The limit is a quarter of a Dinar or its equivalent value.",
                "The hand is not cut for petty items worth less than the threshold."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کا مفہوم",
              "english": "Meaning of the Curse"
            },
            "content": {
              "urdu": [
                "لعنت کا مطلب اللہ کی رحمت سے دوری ہے۔",
                "چوری ایک کبیرہ گناہ ہے جو معاشرتی امن کو تباہ کرتا ہے۔",
                "رسول اللہ ﷺ نے چور کی حماقت پر اظہارِ افسوس بھی فرمایا ہے۔"
              ],
              "english": [
                "A curse signifies being distanced from the Mercy of Allah.",
                "Theft is a major sin that destroys social peace and security.",
                "The Prophet (ﷺ) also expressed regret over the foolishness of the thief."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Societal Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزتِ نفس کا تحفظ",
              "english": "Protection of Self-Respect"
            },
            "content": {
              "urdu": [
                "چور معمولی فائدے کے لیے اپنی بڑی جسمانی اور سماجی قدر کھو دیتا ہے۔",
                "ایک ہاتھ کی دیت (خون بہا) بہت زیادہ ہے مگر چوری میں یہ مفت جاتا ہے۔",
                "اسلام انسان کو اپنی عزت کی حفاظت کرنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "A thief loses great physical and social value for a minor gain.",
                "The blood money for a hand is very high, but in theft, it is lost for free.",
                "Islam encourages individuals to protect their own dignity and honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "امن و امان کی ضمانت",
              "english": "Guarantee of Peace and Order"
            },
            "content": {
              "urdu": [
                "سخت سزاؤں کا مقصد جرائم کو جڑ سے ختم کرنا ہے۔",
                "جب لوگوں کو انجام کا پتہ ہوتا ہے تو وہ مالِ غیر سے دور رہتے ہیں۔",
                "حدود کا نفاذ معاشرے کو چوروں کے شر سے محفوظ رکھتا ہے۔"
              ],
              "english": [
                "Severe punishments are intended to uproot crimes from society.",
                "When people know the consequences, they stay away from others' property.",
                "Implementing 'Hadd' keeps the community safe from the evil of thieves."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور اخلاقی اسباق",
        "english": "Educational and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدی کے آغاز سے بچنا",
              "english": "Avoiding the Start of Evil"
            },
            "content": {
              "urdu": [
                "چھوٹے گناہوں کو معمولی سمجھنا بڑے گناہوں کا راستہ کھولتا ہے۔",
                "تربیتِ نفس کے لیے ضروری ہے کہ ہر قسم کی خیانت سے بچا جائے۔",
                "دیانت داری ہی مومن کا اصل زیور اور پہچان ہے۔"
              ],
              "english": [
                "Viewing small sins as minor opens the door to major transgressions.",
                "For self-discipline, it is vital to avoid all forms of dishonesty.",
                "Integrity is the true ornament and identity of a believer."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانون کی نظر میں برابری",
              "english": "Equality Before the Law"
            },
            "content": {
              "urdu": [
                "چوری کا حکم سب کے لیے یکساں ہے، اس میں کوئی تخصیص نہیں۔",
                "شریعت ہر فرد کے مال و متاع کو تحفظ فراہم کرتی ہے۔",
                "عدل و انصاف کا قیام ہی اسلامی ریاست کا اولین مقصد ہے۔"
              ],
              "english": [
                "The ruling on theft is uniform for everyone without exception.",
                "Sharia provides protection for the wealth and assets of every individual.",
                "Establishing justice is the primary objective of an Islamic state."
              ]
            }
          }
        ]
      }
    }
  ]
}