{
  "hadithId": 513,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/513"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (1691)، والنسائي (2535)، وابن حبان (3326)، والحاكم (1/415) وصححه ووافقه الذهبي. زاد النسائي وأبو داود ذكر الزوجة قبل الخادم.",
    "urdu": "یہ روایت حسن ہے، اسے ابوداؤد (1691)، نسائی (2535) اور ابن حبان (3326) نے روایت کیا ہے۔ امام حاکم نے اسے صحیح قرار دیا ہے اور اس میں بیوی کا ذکر خادم سے پہلے ہے۔",
    "english": "Hasan (good). Reported by Abu Dawud (1691), an-Nasa'i (2535), Ibn Hibban (3326), and al-Hakim (1/415) who graded it Sahih, a view supported by adh-Dhahabi."
  },
  "importantWords": [
    {
      "arabic": "تَصَدَّقُوا",
      "english": "Give charity",
      "urdu": "صدقہ کرو"
    },
    {
      "arabic": "دِينَارٌ",
      "english": "Dinar (Gold coin)",
      "urdu": "دینار (سونے کا سکہ)"
    },
    {
      "arabic": "وَلَدِكَ",
      "english": "Your children",
      "urdu": "تمہاری اولاد"
    },
    {
      "arabic": "زَوْجَتِكَ",
      "english": "Your wife",
      "urdu": "تمہاری بیوی"
    },
    {
      "arabic": "خَادِمِكَ",
      "english": "Your servant",
      "urdu": "تمہارا خادم"
    },
    {
      "arabic": "أَبْصَرُ",
      "english": "More insightful/Better aware",
      "urdu": "زیادہ سمجھ بوجھ والا"
    }
  ],
  "summary": {
    "urdu": "حدیث نبوی ﷺ میں انفاق (خرچ کرنے) کی ترتیب واضح کی گئی ہے کہ انسان پہلے اپنی ذات، پھر اولاد، پھر بیوی اور پھر دیگر ضرورت مندوں پر خرچ کرے۔",
    "english": "This Hadith clarifies the priority of spending, teaching that one must first provide for oneself, then children, then the spouse, and then others."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1691)",
      "english": "Sunan Abi Dawud (1691)"
    },
    {
      "arabic": "سنن النسائي (2535)",
      "english": "Sunan an-Nasa'i (2535)"
    },
    {
      "arabic": "صحيح ابن حبان (3326)",
      "english": "Sahih Ibn Hibban (3326)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انفاق کی شرعی ترتیب",
        "english": "Islamic Order of Spending"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذاتی ضرورت اور عفت",
              "english": "Personal Need and Chastity"
            },
            "content": {
              "urdu": [
                "اپنی ذات پر خرچ کرنا سب سے پہلی ترجیح ہے تاکہ دوسروں سے نہ مانگنا پڑے۔",
                "اسلام بندے کو خود کفیل دیکھنا چاہتا ہے تاکہ اس کا وقار محفوظ رہے۔",
                "اپنے اوپر کیا گیا جائز خرچ بھی اللہ کے ہاں صدقہ شمار ہوتا ہے۔"
              ],
              "english": [
                "Spending on oneself is the first priority to avoid dependency on others.",
                "Islam desires self-sufficiency for a believer to preserve their dignity.",
                "Lawful spending on oneself is also considered an act of charity by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہل و عیال کے حقوق",
              "english": "Rights of the Family"
            },
            "content": {
              "urdu": [
                "اپنی ذات کے بعد اولاد اور پھر بیوی کے حقوق کی ادائیگی لازم ہے۔",
                "گھر والوں کی بنیادی ضرورتوں کو نظر انداز کر کے باہر صدقہ کرنا درست نہیں۔",
                "اہل خانہ کی کفالت ایک دینی فریضہ ہے جس کا ثواب عام صدقے سے زیادہ ہے۔"
              ],
              "english": [
                "After oneself, fulfilling the rights of children and then the spouse is obligatory.",
                "It is incorrect to give external charity while ignoring the needs of the household.",
                "Supporting the family is a religious duty that yields greater rewards than voluntary charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خادم اور دیگر رشتہ دار",
        "english": "Servants and Other Relatives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زیرِ اثر لوگوں کا خیال",
              "english": "Caring for Subordinates"
            },
            "content": {
              "urdu": [
                "خادموں اور ملازمین کا خیال رکھنا بھی اسلامی اخلاقیات کا حصہ ہے۔",
                "جب گھر والوں کی ضرورت پوری ہو جائے تو پھر ماتحتوں پر خرچ کرنا چاہیے۔",
                "یہ عمل معاشرے میں معاشی تحفظ اور بھائی چارے کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Taking care of servants and employees is a vital part of Islamic ethics.",
                "Once family needs are met, one should spend on those under their authority.",
                "This practice promotes economic security and brotherhood within society."
              ]
            }
          },
          {
            "title": {
              "urdu": "انتخاب کی آزادی",
              "english": "Freedom of Choice"
                },
            "content": {
              "urdu": [
                "نبی ﷺ کا فرمان 'تم خود بہتر جانتے ہو' بصیرت اور عقل کے استعمال کی ترغیب ہے۔",
                "قریبی ضرورت مندوں کے بعد بندہ اپنی مرضی سے کسی بھی نیک کام میں خرچ کر سکتا ہے۔",
                "یہ فقرہ ظاہر کرتا ہے کہ دین انسان کو سماجی ذمہ داریوں کا احساس دلاتا ہے۔"
              ],
              "english": [
                "The phrase 'You know better' encourages the use of wisdom and intellect.",
                "After satisfying close dependents, one can freely choose any noble cause to fund.",
                "This statement shows that religion instills a sense of social responsibility in humans."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور توازن",
        "english": "Wisdom and Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال کی اہمیت",
              "english": "Importance of Moderation"
            },
            "content": {
              "urdu": [
                "دین ہمیں جزباتی انفاق کے بجائے منظم مالی منصوبہ بندی سکھاتا ہے۔",
                "بہترین انفاق وہ ہے جس میں حقوق کی ادائیگی کی ترتیب کا خیال رکھا جائے۔",
                "اسلامی معاشرے میں معاشی استحکام کا راز اسی متوازن خرچ میں چھپا ہے۔"
              ],
              "english": [
                "Religion teaches organized financial planning rather than emotional spending.",
                "The best spending is that which respects the hierarchy of rights.",
                "The secret of economic stability in an Islamic society lies in balanced spending."
              ]
            }
          },
          {
            "title": {
              "urdu": "مومن کی بصیرت",
              "english": "Insight of a Believer"
            },
            "content": {
              "urdu": [
                "بندے کو اپنے حالات کے مطابق خرچ کرنے کا اختیار دیا گیا ہے۔",
                "اپنی ترجیحات کا تعین خود کرنا مومن کی فکری پختگی کی علامت ہے۔",
                "نیکی کا ہر وہ راستہ معتبر ہے جو واجبات کی ادائیگی کے بعد اختیار کیا جائے۔"
              ],
              "english": [
                "A servant is granted the authority to spend according to their circumstances.",
                "Determining one's own priorities is a sign of intellectual maturity for a believer.",
                "Every path of goodness is valid if taken after fulfilling obligatory duties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بجٹ سازی اور ترجیحات",
              "english": "Budgeting and Priorities"
            },
            "content": {
              "urdu": [
                "گھریلو بجٹ بناتے وقت پہلے بنیادی حقوق اور ضروریات کو مقدم رکھیں۔",
                "نفلی خیرات سے پہلے قرض اور واجبات کی ادائیگی زیادہ ضروری ہے۔",
                "گھر والوں کی خوشی کے لیے خرچ کرنا بھی اللہ کے ہاں بڑی عبادت ہے۔"
              ],
              "english": [
                "When making a household budget, prioritize basic rights and needs first.",
                "Fulfilling debts and obligations is more critical than voluntary charity.",
                "Spending for the happiness of the family is a great act of worship with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریا کاری سے پاک صدقہ",
              "english": "Charity Free from Ostentation"
            },
            "content": {
              "urdu": [
                "اپنے گھر والوں پر چھپ کر خرچ کرنا اخلاص کی بہترین شکل ہے۔",
                "اس سے گھر میں سکون اور باہمی اعتماد کی فضا پیدا ہوتی ہے۔",
                "صدقہ کا آغاز اپنے گھر سے کرنا شہرت کی طلب سے بچاتا ہے۔"
              ],
              "english": [
                "Spending quietly on one's family is the best form of sincerity.",
                "It fosters an atmosphere of peace and mutual trust within the home.",
                "Starting charity from home protects one from the desire for fame."
              ]
            }
          }
        ]
      }
    }
  ]
}