{
  "hadithId": 582,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/4"],
    "kitabId": 6,
    "inKitabBab": 1,
    "arabicBook": "كتاب الحج",
    "babId": 36
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه الدارقطني (2/216) والحاكم (1/442) من طريق قتادة عن أنس، والصواب أنه مرسل. ورواه الترمذي (813) من حديث ابن عمر وفي سنده إبراهيم بن يزيد الجوزي وهو متروك.",
    "urdu": "ضعیف۔ اسے دارقطنی اور حاکم نے روایت کیا ہے لیکن اس کا مرسل ہونا (صحابی کے ذکر کے بغیر) زیادہ صحیح ہے۔ امام ترمذی نے اسے ابن عمر سے روایت کیا ہے مگر اس کی سند میں ابراہیم بن یزید الجوزی نامی راوی متروک (ناقابل قبول) ہے۔",
    "english": "Da'if (Weak). Reported by ad-Daraqutni and al-Hakim. The correct technical view is that it is Mursal (chain ends at a Tabi'i). At-Tirmidhi's version contains Ibrahim bin Yazid, who is abandoned in Hadith sciences."
  },
  "importantWords": [
    {
      "arabic": "اَلسَّبِيلُ",
      "english": "The Way / Path",
      "urdu": "راستہ / سبیل"
    },
    {
      "arabic": "اَلزَّادُ",
      "english": "Provisions",
      "urdu": "زادِ راہ / توشہ"
    },
    {
      "arabic": "الرَّاحِلَةُ",
      "english": "Means of transport",
      "urdu": "سواری"
    },
    {
      "arabic": "اِسْتَطَاعَ",
      "english": "To be able / afford",
      "urdu": "استطاعت رکھنا"
    },
    {
      "arabic": "إِرْسَالُهُ",
      "english": "Its transmission as Mursal",
      "urdu": "مرسل ہونا"
    }
  ],
  "summary": {
    "urdu": "حج کی فرضیت کے لیے 'استطاعت' کا مطلب یہ ہے کہ انسان کے پاس سفر کے اخراجات (کھانا پینا) اور آنے جانے کے لیے سواری موجود ہو۔",
    "english": "The requirement of 'capability' for Hajj is interpreted as having sufficient financial provisions for the journey and a reliable means of transportation."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني (2/216)",
      "english": "Sunan ad-Daraqutni (2/216)"
    },
    {
      "arabic": "سنن الترمذي (813)",
      "english": "Sunan at-Tirmidhi (813)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=3S1N6bVvWpU",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حج کی استطاعت کا مفہوم",
        "english": "Meaning of Capability for Hajj"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زاد اور راحلہ کی وضاحت",
              "english": "Clarification of Provisions and Transport"
            },
            "content": {
              "urdu": [
                "قرآن میں حج کے لیے 'سبیل' (راستے) کی استطاعت کی شرط رکھی گئی ہے۔",
                "نبی ﷺ نے اس کی تفسیر زادِ راہ اور سواری سے فرمائی ہے۔",
                "اس کا مطلب ہے کہ سفر کے اخراجات کا مالک ہونا حج کی فرضیت کی بنیاد ہے۔"
              ],
              "english": [
                "The Quran conditions Hajj on the capability of the 'Way' (Sabil).",
                "The Prophet (ﷺ) interpreted this as having food, water, and transport.",
                "This implies that financial and physical means are the basis of Hajj obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "بنیادی ضرورت سے زائد مال",
              "english": "Wealth Beyond Basic Needs"
            },
            "content": {
              "urdu": [
                "استطاعت سے مراد وہ رقم ہے جو گھر والوں کے نفقہ سے زائد ہو۔",
                "قرض دار پر حج اس وقت تک فرض نہیں جب تک وہ قرض ادا نہ کر دے۔",
                "اپنی اصل ضروریات کو پورا کرنے کے بعد بچنے والا مال معیار ہے۔"
              ],
              "english": [
                "Capability refers to wealth remaining after providing for family needs.",
                "Hajj is not mandatory for a debtor until the debt is cleared.",
                "The standard is having surplus wealth after covering basic necessities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات اور شرائط",
        "english": "Juristic Rulings and Conditions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راستے کا امن",
              "english": "Safety of the Path"
            },
            "content": {
              "urdu": [
                "استطاعت میں راستے کا پرامن ہونا بھی ایک لازمی شرط ہے۔",
                "اگر جان یا مال کو یقینی خطرہ ہو تو حج مؤخر کیا جا سکتا ہے۔",
                "جدید دور میں ویزہ اور قانونی دستاویزات بھی اسی زمرے میں آتی ہیں۔"
              ],
              "english": [
                "A secure and safe route is a mandatory condition for capability.",
                "Hajj can be delayed if there is a certain threat to life or property.",
                "In modern times, visas and legal papers also fall under this category."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی صحت اور حج",
              "english": "Physical Health and Hajj"
            },
            "content": {
              "urdu": [
                "زاد اور راحلہ کے ساتھ جسمانی طور پر سفر کے قابل ہونا بھی ضروری ہے۔",
                "نہایت بیمار یا معذور شخص پر بنفسِ نفیس حج فرض نہیں ہوتا۔",
                "ایسی صورت میں 'حجِ بدل' کروانے کی گنجائش شریعت میں موجود ہے۔"
              ],
              "english": [
                "Along with wealth, being physically fit for travel is essential.",
                "Hajj is not personally mandatory for the extremely ill or disabled.",
                "In such cases, Sharia provides the option of Hajj al-Badal (proxy Hajj)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی فنی حیثیت",
        "english": "Technical Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری کی وضاحت",
              "english": "Explaining the Chain's Weakness"
            },
            "content": {
              "urdu": [
                "اس حدیث کی تمام اسانید میں کلام ہے اور یہ فنی طور پر ضعیف ہے۔",
                "محدثین کے نزدیک اس کا مرسل ہونا (تابعی کا قول) زیادہ مستند ہے۔",
                "تاہم اس کا مفہوم قرآن کی آیت اور اجماعِ امت کے مطابق ہے۔"
              ],
              "english": [
                "All chains of this Hadith have issues and are technically weak.",
                "Scholars prefer the Mursal version (statement of a Tabi'i) as more accurate.",
                "However, its meaning aligns with the Quranic verse and Ummah's consensus."
              ]
            }
          },
          {
            "title": {
              "urdu": "مفہوم کی قبولیت",
              "english": "Acceptance of the Meaning"
            },
            "content": {
              "urdu": [
                "اگرچہ سند ضعیف ہے، مگر تمام فقہاء نے اس مفہوم کو قبول کیا ہے۔",
                "فقہ میں 'استطاعت' کی تعریف اسی اصول پر مبنی ہے۔",
                "ضعیف حدیث جب تعاملِ امت سے مؤید ہو تو قابلِ عمل بن جاتی ہے۔"
              ],
              "english": [
                "Despite the weak chain, all jurists have accepted this interpretation.",
                "The definition of 'capability' in Fiqh is built upon this principle.",
                "A weak Hadith supported by continuous practice becomes actionable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی سبق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلام میں تنگی نہیں",
              "english": "No Undue Hardship in Islam"
            },
            "content": {
              "urdu": [
                "اللہ نے حج صرف ان پر فرض کیا ہے جو اخراجات برداشت کر سکیں۔",
                "بغیر وسائل کے قرض لے کر حج پر جانا شرعی تقاضا نہیں ہے۔",
                "اسلام بندوں کو ان کی ہمت سے زیادہ تکلیف نہیں دیتا۔"
              ],
              "english": [
                "Allah has only mandated Hajj for those who can afford the expenses.",
                "Going for Hajj by taking loans without resources is not a requirement.",
                "Islam does not burden servants beyond their individual capacities."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت کی اہمیت",
              "english": "Importance of Intention"
            },
            "content": {
              "urdu": [
                "جس کے پاس وسائل نہ ہوں، وہ سچی نیت سے حج کا اجر پا سکتا ہے۔",
                "وسائل رکھنے والوں کو حج کی ادائیگی میں دیر نہیں کرنی چاہیے۔",
                "مال کو نیکی کے کاموں میں خرچ کرنا بندگی کی معراج ہے۔"
              ],
              "english": [
                "One without means can earn Hajj rewards through sincere intention.",
                "Those with resources should not delay performing their pilgrimage.",
                "Spending wealth in acts of righteousness is the peak of servitude."
              ]
            }
          }
        ]
      }
    }
  ]
}