{
  "hadithId": 31,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 3 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب الوضوء",
    "babId": 4
  },

  "takhreej": {
    "arabic": "صحيح.  رواه أبو داود (111) . ورواه النسائي (100) والترمذي (286) وصححه، وقال الترمذي: هذا أصح شيء في هذا الباب. ",
    "urdu": "صحیح (درجہ)۔ اسے ابوداؤد (111) نے روایت کیا ہے۔ اور اسے نسائی (100) اور ترمذی (286) نے بھی روایت کر کے صحیح قرار دیا، اور ترمذی نے فرمایا کہ اس باب میں یہ سب سے زیادہ صحیح حدیث ہے۔",
    "english": "Sahih (Authentic). Narrated by Abu Dawud (111). It was also narrated by An-Nasa'i (100) and At-Tirmidhi (286) who authenticated it, with At-Tirmidhi stating: \"This is the soundest thing in this chapter.\""
  },
  "importantWords": [
    {
      "arabic": "عَلِيٍّ",
      "english": "Ali (ibn Abi Talib)",
      "urdu": "علی"
    },
    {
      "arabic": "صِفَةِ وُضُوءِ",
      "english": "Description of Wudu",
      "urdu": "وضو کا طریقہ"
    },
    {
      "arabic": "مَسَحَ",
      "english": "Wiped/wetted",
      "urdu": "مسح کیا"
    },
    {
      "arabic": "بِرَأْسِهِ",
      "english": "His head",
      "urdu": "اپنے سر کا"
    },
    {
      "arabic": "وَاحِدَةً",
      "english": "Once/one time",
      "urdu": "ایک مرتبہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث وضو کے دوران سر کے مسح کے طریقے کو واضح کرتی ہے، جو تمام فقہاء کے نزدیک اس بات کی دلیل ہے کہ سر کا مسح فرض اور سنت دونوں صورتوں میں صرف ایک بار ہی مشروع ہے۔",
    "english": "This Hadith clarifies the ruling for wiping the head during ablution, serving as the strongest evidence that wiping the head, whether obligatory or recommended, should only be done once."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 111",
      "english": "Sunan Abi Dawud, The Book of Purification, Hadith 111"
    },
    {
      "arabic": "جامع الترمذي، أبواب الطهارة، رقم 286",
      "english": "Jami' At-Tirmidhi, The Book of Purification, Hadith 286"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Ali ibn Abi Talib (May Allah be pleased with him)"
      },
      "slug": "ali-ibn-abi-talib"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-9-wiping-head-once",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وضو میں مسح کا اصول",
        "english": "The Principle of Wiping (Mas'h) in Wudu"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سر کے مسح کی تعداد",
              "english": "The Number of Times to Wipe the Head"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر بیان کرتی ہے کہ نبی اکرم ﷺ نے وضو میں اپنے سر کا مسح **صرف ایک مرتبہ** کیا تھا، نہ کہ تین مرتبہ دھویا۔",
                "یہ اس بات کی قوی ترین دلیل ہے کہ سر کا مسح ایک سے زیادہ بار کرنا سنتِ نبوی کے خلاف ہے، جو 'صحیح ترین' روایت سے ثابت ہے۔",
                "مسح کا حکم دھونے کے حکم سے مختلف ہے؛ دھونے میں تین بار افضل ہے جبکہ مسح میں صرف ایک بار کرنا ہی مسنون ہے۔"
              ],
              "english": [
                "This Hadith explicitly states that the Prophet (ﷺ) wiped his head **only once** during Wudu, rather than washing it three times like other limbs.",
                "This provides the strongest evidence that wiping the head more than once is contrary to the Prophetic Sunnah, as established by the 'soundest' narration on this topic.",
                "The ruling for wiping differs from the ruling for washing; washing thrice is preferred, whereas wiping once is the established Sunnah practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اتفاق",
              "english": "Jurisprudential Consensus (Ijma')"
            },
            "content": {
              "urdu": [
                "تمام فقہاء کا اس بات پر اجماع ہے کہ سر کے مسح کی فرضیت کے لیے ایک ہی بار مسح کرنا کافی ہے، یہ سنت کی تکمیل ہے۔",
                "یہاں مسح کا عمل دھونے سے مختلف ہے، جس کا مقصد سر پر پانی کا استیعاب (پانی پھیلانا) کرنا ہے، نہ کہ سر کو مکمل طور پر تر کرنا۔",
                "امام ترمذی کے قول کہ یہ 'اس باب میں سب سے صحیح ہے' سے اس بات کی تصدیق ہوتی ہے کہ یہ مسئلہ متفقہ طور پر تسلیم شدہ ہے۔"
              ],
              "english": [
                "There is a consensus among all jurists (Fuqahā') that wiping the head once is sufficient to fulfill the obligation of Mas'h, and doing so completes the Sunnah.",
                "The act of wiping here differs from washing; its purpose is to cover the head with moisture (Istī'āb) rather than fully saturating it with water.",
                "At-Tirmidhi's statement that this is the 'soundest Hadith in this chapter' confirms that this ruling is definitively established and accepted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسح کا طریقہ کار",
        "english": "The Method of Wiping the Head"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح کا سنت طریقہ",
              "english": "The Sunnah Way of Wiping"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حدیث صرف تعداد بیان کرتی ہے، لیکن دیگر صحیح احادیث سے مسح کا طریقہ یہ ثابت ہوتا ہے کہ دونوں ہاتھوں کو آگے سے پیچھے اور پھر واپس آگے لایا جائے۔",
                "اس طرح پورے سر کا مسح ایک ہی عمل کے ذریعے مکمل ہو جاتا ہے اور یہ ایک مرتبہ مسح کرنے کے حکم کو پورا کرتا ہے۔",
                "یہ عمل سر کے ہر حصے تک پانی کی رطوبت پہنچانے کو یقینی بناتا ہے، جو کہ طہارت کے لیے مطلوبہ معیار ہے۔"
              ],
              "english": [
                "Although this Hadith only mentions the frequency, other Sahih Ahadith clarify the method: wiping the hands from the forehead to the back of the head, and then returning them to the front.",
                "This technique effectively ensures that the entire head is wiped in a single action, fulfilling the command of wiping only once.",
                "This process guarantees that the moisture from the hands reaches all parts of the head, meeting the required standard for purification."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح اور غسل میں فرق کی حکمت",
              "english": "Wisdom of the Difference between Wiping and Washing"
            },
            "content": {
              "urdu": [
                "سر کو دھونے کے بجائے مسح کرنے کا حکم دینا، امت پر ایک بڑی آسانی (تخفیف) ہے، خاص طور پر سردی کے موسم میں یا جب سر پر عمامہ ہو۔",
                "اگر تین بار دھونے کا حکم ہوتا تو یہ بالوں کے لیے اور دن میں پانچ بار وضو کرنے والوں کے لیے بہت زیادہ مشقت کا باعث بنتا۔",
                "یہ اسلامی شریعت کی عملیت اور آسانی کو ظاہر کرتا ہے، جہاں اللہ نے بندوں کے لیے بوجھ کم کیا ہے۔"
              ],
              "english": [
                "The command to wipe the head instead of washing it is a great concession (Takhfīf) for the Ummah, especially in cold weather or when wearing a turban.",
                "If washing three times were mandatory, it would cause significant hardship for the hair and for individuals performing Wudu five times a day.",
                "This illustrates the practicality and ease of Islamic law, where Allah has lightened the burden upon His servants."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی کا مقام اور تسلسل",
        "english": "Status of the Narrator and Continuity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حضرت علیؓ کی روایت",
              "english": "The Narration of Ali (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا علی بن ابی طالب رضی اللہ عنہ جلیل القدر صحابی اور نبی اکرم ﷺ کے داماد تھے، اور آپ کی روایت کو فقہی احکام میں اعلیٰ درجہ حاصل ہے۔",
                "آپ نے وضو کے طریقہ کار کو بیان کر کے اس بات کو یقینی بنایا کہ آنے والی نسلوں تک نبی ﷺ کی سنت صحیح طریقے سے پہنچے۔",
                "یہ روایت پچھلی حدیث (حضرت عثمانؓ والی) کی تصدیق کرتی ہے، جس میں بھی سر کا مسح ایک بار کرنا ثابت ہوا تھا۔"
              ],
              "english": [
                "Sayyiduna Ali ibn Abi Talib (RA) was a major Companion and the son-in-law of the Prophet (ﷺ), and his narrations carry high authority in legal matters.",
                "By detailing the Wudu procedure, he ensured that the Prophet's Sunnah was accurately transmitted to succeeding generations of Muslims.",
                "This narration corroborates the previous Hadith (of Uthman RA), which also demonstrated that wiping the head should be performed only once."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت میں درستگی کی اہمیت",
              "english": "Importance of Accuracy in Purity"
            },
            "content": {
              "urdu": [
                "چونکہ نماز قبول ہونے کی شرط طہارت کا مکمل ہونا ہے، اس لیے نبی ﷺ کے ہر عمل کو درست طریقے سے بیان کرنا نہایت ضروری ہے۔",
                "اسماء، عثمان اور علی رضی اللہ عنہم جیسے صحابہ کا تفصیلی بیان اس بات کی دلیل ہے کہ وہ دین کے کسی بھی جز کو نظر انداز کرنے کے روادار نہیں تھے۔",
                "یہ حدیث ایک پیمانہ مقرر کرتی ہے کہ فرائض کی ادائیگی میں سنت کا خاص طریقہ ہی اختیار کیا جائے تاکہ عبادت مقبول ہو۔"
              ],
              "english": [
                "Since the acceptance of prayer is conditional upon complete purification, it was essential to transmit every act of the Prophet (ﷺ) accurately.",
                "The detailed narrations by Companions like Asma, Uthman, and Ali (RA) show their dedication to omitting no detail of the religion.",
                "This Hadith sets a standard that in performing obligatory acts, the specific method of the Sunnah must be adopted for the worship to be accepted."
              ]
            }
          }
        ]
      }
    }
  ]
}
