{
  "hadithId": 459,
  "hadithNo": 35,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3199"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3199)، وابن ماجه (1497)، وابن حبان (3076). والحديث يحث على إخلاص النية والقصد في الدعاء للميت.",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابوداؤد (3199)، ابن ماجہ (1497) اور ابن حبان (3076) نے روایت کیا ہے۔ یہ حدیث میت کے لیے دعا میں اخلاص اور توجہ پیدا کرنے کی ترغیب دیتی ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (3199), Ibn Majah (1497), and Ibn Hibban (3076). The Hadith emphasizes the importance of sincerity and devotion in supplication for the deceased."
  },
  "importantWords": [
    {
      "arabic": "صَلَّيْتُمْ",
      "english": "You prayed",
      "urdu": "تم نے نماز پڑھی"
    },
    {
      "arabic": "الْمَيِّتِ",
      "english": "The Deceased",
      "urdu": "میت / فوت شدہ"
    },
    {
      "arabic": "فَأَخْلِصُوا",
      "english": "Be sincere",
      "urdu": "تم اخلاص اختیار کرو"
    },
    {
      "arabic": "الدُّعَاءَ",
      "english": "The Supplication",
      "urdu": "دعا"
    },
    {
      "arabic": "رَوَاهُ",
      "english": "Narrated by",
      "urdu": "اسے روایت کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ نے نمازِ جنازہ کی اصل روح بیان کی ہے کہ جنازے کا مقصد محض رسمی حاضری نہیں بلکہ میت کے لیے خلوصِ دل سے مغفرت کی سفارش کرنا ہے۔",
    "english": "The Prophet (ﷺ) highlights the essence of the funeral prayer, teaching that its purpose is not just formal attendance but sincere intercession for the deceased's forgiveness."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3199)",
      "english": "Sunan Abu Dawud (3199)"
    },
    {
      "arabic": "صحيح ابن حبان (3076)",
      "english": "Sahih Ibn Hibban (3076)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R2_K-E-K98A",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا میں اخلاص کی حقیقت",
        "english": "The Reality of Sincerity in Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاضر دماغی اور توجہ",
              "english": "Mindfulness and Concentration"
            },
            "content": {
              "urdu": [
                "نمازِ جنازہ میں الفاظ کو صرف زبان سے دہرانا کافی نہیں ہے۔",
                "دل کو میت کی حاجت اور اللہ کی رحمت کی طرف متوجہ ہونا چاہیے۔",
                "اخلاص کا مطلب یہ ہے کہ انسان واقعی میت کی بخشش کا تمنائی ہو۔"
              ],
              "english": [
                "Simply repeating the words of Janazah with the tongue is not enough.",
                "The heart must be focused on the deceased's need and Allah's mercy.",
                "Sincerity means a person truly desires forgiveness for the deceased."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاکاری سے بچنا",
              "english": "Avoiding Hypocrisy"
            },
            "content": {
              "urdu": [
                "جنازے میں شرکت صرف سماجی تعلق نبھانے کے لیے نہیں ہونی چاہیے۔",
                "دعا اس نیت سے کریں کہ اللہ اس میت پر اپنا رحم فرمائے۔",
                "خلوصِ دل سے کی گئی دعا اللہ کے ہاں جلد قبول ہوتی ہے۔"
              ],
              "english": [
                "Attending a funeral should not be merely for maintaining social ties.",
                "Supplicate with the intention that Allah bestows His mercy on the dead.",
                "Prayers made with a sincere heart are quickly accepted by Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "میت کے لیے شفاعت",
        "english": "Intercession for the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسلمانوں کی گواہی",
              "english": "Testimony of Muslims"
            },
            "content": {
              "urdu": [
                "جنازہ پڑھنے والے میت کے لیے اللہ کے دربار میں گواہ ہوتے ہیں۔",
                "جب بہت سے لوگ اخلاص سے دعا کریں تو اللہ اسے قبول فرماتا ہے۔",
                "یہ دعا میت کے برزخی سفر کو آسان بنانے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Those praying Janazah act as witnesses for the dead before Allah.",
                "When many people pray with sincerity, Allah accepts their intercession.",
                "This prayer is the best means to ease the deceased's journey in Barzakh."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی ادائیگی",
              "english": "Fulfilling the Rights of Servants"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کا دوسرے پر حق ہے کہ وہ اس کے جنازے میں شریک ہو۔",
                "اخلاص کے ساتھ دعا کرنا میت کے ساتھ آخری خیر خواہی ہے۔",
                "یہ عمل مسلمانوں کے درمیان باہمی ہمدردی اور تعلق کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "A Muslim has a right over another to have their funeral attended.",
                "Praying with sincerity is the final act of goodwill towards the dead.",
                "This practice demonstrates mutual compassion among the Muslim Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازِ جنازہ کا طریقہ اور آداب",
        "english": "Method and Etiquettes of Janazah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنون دعاؤں کا انتخاب",
              "english": "Choosing Sunnah Supplications"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ سے مروی جامع دعاؤں کو پڑھنا افضل ہے۔",
                "دعا کے الفاظ کے معنی سمجھنے سے اخلاص پیدا کرنے میں مدد ملتی ہے۔",
                "جنازے کی ہر تکبیر کے بعد مسنون اذکار کی رعایت رکھنی چاہیے۔"
              ],
              "english": [
                "It is superior to recite the comprehensive prayers reported from the Prophet (ﷺ).",
                "Understanding the meaning of the words helps in developing sincerity.",
                "One should observe the prescribed Sunnah Adhkar after each Takbir."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنازہ گاہ کا وقار",
              "english": "Dignity of the Prayer Ground"
            },
            "content": {
              "urdu": [
                "جنازہ گاہ میں فضول باتوں کے بجائے میت کے لیے فکر کرنی چاہیے۔",
                "خاموشی اور سنجیدگی اخلاص اور عاجزی پیدا کرنے میں معاون ہے۔",
                "موت کے منظر سے عبرت حاصل کرنا اور اپنی باری کا سوچنا ضروری ہے۔"
              ],
              "english": [
                "Focus on the deceased instead of idle talk at the funeral ground.",
                "Silence and seriousness help in fostering sincerity and humility.",
                "It is vital to take heed from the sight of death and reflect on one's end."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی و تعلیمی اسباق",
        "english": "Spiritual and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محبتِ رسول ﷺ کا تقاضا",
              "english": "Requirement of Love for the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے حکم پر عمل کرنا ہی سچی کامیابی کا راستہ ہے۔",
                "آپ ﷺ نے امت کو جنازے جیسے اہم موقع پر ادب سکھایا ہے۔",
                "سنت کے مطابق کی گئی دعا ہی اللہ کے ہاں مقبول ٹھہرتی ہے۔"
              ],
              "english": [
                "Acting upon the Prophet's (ﷺ) command is the path to true success.",
                "He taught the Ummah the proper etiquette for the critical moment of Janazah.",
                "Only supplications made according to the Sunnah find acceptance with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستقبل کی تیاری",
              "english": "Preparation for the Future"
            },
            "content": {
              "urdu": [
                "آج ہم کسی کے لیے دعا کر رہے ہیں، کل لوگ ہمارے لیے کریں گے۔",
                "دوسروں کے لیے اخلاص برتیں گے تو اللہ ہمارے لیے بھی مخلص لوگ لائے گا۔",
                "یہ حدیث ہمیں دوسروں کے لیے خیر چاہنے کا عظیم سبق دیتی ہے۔"
              ],
              "english": [
                "Today we pray for someone; tomorrow, people will pray for us.",
                "If we are sincere for others, Allah will provide sincere people for us.",
                "This Hadith teaches us the great lesson of wishing well for others."
              ]
            }
          }
        ]
      }
    }
  ]
}