{
  "hadithId": 1344,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/114"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1488)، والترمذي (3556)، وابن ماجه (3865)، والحاكم (1/497). وصححه الحاكم ووافقه الذهبي، وصححه الألباني في صحيح الجامع (2070).",
    "urdu": "صحیح۔ اسے امام ابوداؤد (1488)، ترمذی (3556) اور ابن ماجہ (3865) نے روایت کیا ہے۔ امام حاکم نے اسے صحیح کہا ہے اور علامہ البانی نے بھی اس کی تصحیح کی ہے۔",
    "english": "Sahih. Reported by Abu Dawud (1488), At-Tirmidhi (3556), and Ibn Majah (3865). Al-Hakim graded it Sahih and Ad-Dhahabi agreed. Al-Albani also graded it Sahih in Sahih al-Jami' (2070)."
  },
  "importantWords": [
    {
      "arabic": "حَيِيٌّ",
      "english": "Shy / Modest",
      "urdu": "حیا والا"
    },
    {
      "arabic": "كَرِيمٌ",
      "english": "Generous / Kind",
      "urdu": "سخی / کرم کرنے والا"
    },
    {
      "arabic": "يَسْتَحِي",
      "english": "He feels shy",
      "urdu": "وہ حیا کرتا ہے"
    },
    {
      "arabic": "صِفَرًا",
      "english": "Empty / Zero",
      "urdu": "خالی / ناکام"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اللہ تعالیٰ کی صفتِ حیا اور کرم کا بیان ہے، جو بندوں کو اس بات کی ترغیب دیتی ہے کہ وہ اللہ سے خوب مانگیں کیونکہ وہ اپنے بندوں کی دعاؤں کو رد نہیں کرتا۔",
    "english": "This Hadith describes Allah's attributes of Shyness and Generosity, encouraging servants to supplicate extensively as He does not like to reject their sincere pleas."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب الدعاء، رقم 1488",
      "english": "Sunan Abi Dawud, Book of Prayer, Chapter on Supplication, No. 1488"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سلمان الفارسي",
        "english": "Salman al-Farsi"
      },
      "slug": "salman-al-farsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اللہ تعالیٰ کی صفتِ حیا",
        "english": "Allah's Attribute of Shyness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیا کا نبوی مفہوم",
              "english": "Prophetic Meaning of Shyness"
            },
            "content": {
              "urdu": [
                "اللہ کی حیا مخلوق کی حیا جیسی نہیں ہے؛ یہ اس کے جلال اور کمالِ کرم کی علامت ہے۔",
                "اس کا مطلب یہ ہے کہ جب بندہ عاجزی سے ہاتھ پھیلاتا ہے تو اللہ کی رحمت اسے محروم رکھنا پسند نہیں کرتی۔",
                "یہ بندے اور خالق کے درمیان ایک خاص محبت بھرے تعلق کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Allah's shyness is not like that of His creation; it is a manifestation of His Majesty and perfect Generosity.",
                "It means that when a servant humbly spreads their hands, His Mercy dislikes leaving them deprived.",
                "This reflects a special, loving relationship between the Creator and the servant."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کے آداب: ہاتھ اٹھانا",
        "english": "Etiquettes of Dua: Raising Hands"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاجزی کا اظہار",
              "english": "Expression of Humility"
            },
            "content": {
              "urdu": [
                "دعا میں ہاتھ اٹھانا سنتِ نبوی ﷺ ہے اور یہ قبولیتِ دعا کا ایک اہم سبب ہے۔",
                "ہاتھوں کا پھیلانا بندے کی محتاجی اور اللہ کی غنا (بے نیازی) کا اعتراف ہے۔",
                "ایک فقیر کی طرح رب کے سامنے ہاتھ پھیلانا اللہ کو بہت پسند ہے۔"
              ],
              "english": [
                "Raising hands during Dua is a Sunnah and a significant reason for its acceptance.",
                "Spreading the hands is an acknowledgment of the servant's neediness and Allah's self-sufficiency.",
                "Stretching hands before the Lord like a beggar is very beloved to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبولیتِ دعا کا یقین",
        "english": "Certainty in Acceptance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خالی نہ لوٹنے کا وعدہ",
              "english": "The Promise of Not Returning Empty"
            },
            "content": {
              "urdu": [
                "دعا کبھی رائیگاں نہیں جاتی؛ یا تو وہی ملتا ہے جو مانگا گیا یا اس سے بہتر آخرت کے لیے جمع کر دیا جاتا ہے۔",
                "انسان کو چاہیے کہ مانگتے وقت اللہ کے کرم پر پورا بھروسہ رکھے اور جلد بازی نہ کرے۔",
                "اللہ کی عطا بندے کی گمان سے بھی زیادہ وسیع ہے۔"
              ],
              "english": [
                "Dua is never wasted; either one receives what was asked for, or something better is stored for the Hereafter.",
                "One should have full trust in Allah's generosity while asking and avoid haste.",
                "Allah's giving is far wider than a servant's imagination."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مایوسی کا خاتمہ",
              "english": "Ending Despair"
            },
            "content": {
              "urdu": [
                "یہ حدیث مایوس دلوں کے لیے ایک عظیم تسلی ہے کہ رب ہمیشہ سننے کے لیے تیار ہے۔",
                "ہمیں چاہیے کہ اپنی ہر چھوٹی بڑی ضرورت کے لیے اللہ ہی کی طرف رجوع کریں۔",
                "کثرت سے دعا مانگنا بندگی کی روح ہے اور اللہ سے تعلق مضبوط کرنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "This Hadith is a great consolation for despairing hearts, showing that the Lord is always ready to listen.",
                "We should turn to Allah for every single need, no matter how small or large.",
                "Frequent supplication is the soul of worship and the best way to strengthen one's bond with Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}