{
  "hadithId": 1306,
  "hadithNo": 30,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/76"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "الجامع - باب الترهيب من مساوئ الأخلاق",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه الحاكم (1/60)، والبخاري في الأدب المفرد (549)، وأحمد (2/118). وصححه الحاكم ووافقه الذهبي، ورجاله رجال الصحيح.",
    "urdu": "صحیح۔ اسے امام حاکم (1/60) اور امام بخاری نے 'الادب المفرد' (549) میں روایت کیا ہے۔ امام حاکم نے اسے صحیح کہا ہے اور علامہ ذہبی نے ان کی موافقت کی ہے۔ اس کے تمام راوی ثقہ ہیں۔",
    "english": "Sahih. Reported by Al-Hakim (1/60), Al-Bukhari in Al-Adab al-Mufrad (549), and Ahmad (2/118). Al-Hakim graded it Sahih and Ad-Dhahabi agreed with him. Its narrators are those of the Sahih."
  },
  "importantWords": [
    {
      "arabic": "تَعَاظَمَ",
      "english": "Self-magnification / Pride",
      "urdu": "بڑائی چاہنا / خود کو بڑا سمجھنا"
    },
    {
      "arabic": "اِخْتَالَ",
      "english": "Arrogance / Haughtiness",
      "urdu": "اکڑ کر چلنا / تکبر کرنا"
    },
    {
      "arabic": "مِشْيَتِهِ",
      "english": "Gait / Way of walking",
      "urdu": "اس کی چال"
    },
    {
      "arabic": "غَضْبَانُ",
      "english": "Angry / Wrathful",
      "urdu": "غصے میں / غضب ناک"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں باطنی تکبر اور ظاہری اکڑ دونوں کی مذمت کی گئی ہے اور بتایا گیا ہے کہ ایسا طرزِ عمل اللہ کے غضب کا باعث بنتا ہے۔",
    "english": "This Hadith condemns both inner pride and outward arrogance in behavior, warning that such traits incur the wrath of Allah."
  },
  "references": [
    {
      "arabic": "المستدرك على الصحيحين للحاكم، كتاب الإيمان، رقم 174",
      "english": "Al-Mustadrak al-Hakim, Book of Faith, No. 174"
    },
    {
      "arabic": "الأدب المفرد للبخاري، باب الكبر، رقم 549",
      "english": "Al-Adab al-Mufrad by Al-Bukhari, Book of Pride, No. 549"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تکبر کی حقیقت اور اقسام",
        "english": "The Reality and Types of Arrogance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باطنی تکبر (تعاظم)",
              "english": "Inner Pride (Self-Magnification)"
            },
            "content": {
              "urdu": [
                "تعاظم کا مطلب ہے اپنے آپ کو دوسروں سے برتر، عالم یا معزز سمجھنا اور دوسروں کو حقیر جاننا۔",
                "یہ دل کی ایک مہلک بیماری ہے جو انسان کو اپنی خامیاں دیکھنے سے اندھا کر دیتی ہے۔",
                "نبی ﷺ نے فرمایا تھا کہ جس کے دل میں رائی کے دانے برابر بھی تکبر ہوگا وہ جنت میں نہ جائے گا۔"
              ],
              "english": [
                "Self-magnification means viewing oneself as superior, more knowledgeable, or more honorable than others while looking down on them.",
                "It is a fatal disease of the heart that blinds a person to their own flaws.",
                "The Prophet (ﷺ) said that anyone with even an atom's weight of pride in their heart will not enter Paradise."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظاہری تکبر (اختيال)",
              "english": "Outward Arrogance (Haughty Gait)"
            },
            "content": {
              "urdu": [
                "اختيال سے مراد وہ چال ہے جس میں فخر، غرور اور دکھاوا پایا جائے۔",
                "چال ڈھال انسان کے باطن کا آئینہ ہوتی ہے؛ اکڑ کر چلنا دل کے تکبر کا اعلان ہوتا ہے۔",
                "قرآن میں اللہ نے فرمایا ہے کہ زمین پر اکڑ کر نہ چلو، تم نہ زمین کو پھاڑ سکتے ہو نہ پہاڑوں کی بلندی کو پہنچ سکتے ہو۔"
              ],
              "english": [
                "Ikhtiyal refers to a way of walking that displays pride, vanity, and ostentation.",
                "One's gait is a mirror of their inner self; walking haughtily is a public declaration of an arrogant heart.",
                "In the Quran, Allah says: 'And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height.'"
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کی ناراضگی کا سبب",
        "english": "Causes of Allah's Displeasure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کبریائی صرف اللہ کی چادر ہے",
              "english": "Greatness Belongs Only to Allah"
            },
            "content": {
              "urdu": [
                "حدیث قدسی کے مطابق عظمت اور کبریائی اللہ کی صفت ہے، جو بندہ اس میں شراکت چاہے گا اللہ اسے عذاب دے گا۔",
                "تکبر کرنے والا درحقیقت اللہ کی صفتِ ربوبیت میں دخل اندازی کی کوشش کرتا ہے۔",
                "عاجزی اختیار کرنے والوں کو اللہ بلند مقام عطا کرتا ہے جبکہ متکبرین کو ذلیل کر دیتا ہے۔"
              ],
              "english": [
                "According to a Hadith Qudsi, majesty and greatness are Allah's attributes; whoever tries to compete with Him in them, He will punish.",
                "An arrogant person is essentially trying to interfere with Allah's attribute of Divinity.",
                "Allah elevates those who practice humility and humiliates those who are arrogant."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات اور علاج",
        "english": "Social Impact and Cure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی بگاڑ",
              "english": "Social Decay"
            },
            "content": {
              "urdu": [
                "تکبر سے حسد، نفرت اور طبقاتی اونچ نیچ جنم لیتی ہے جو معاشرے کے امن کو برباد کر دیتی ہے۔",
                "متکبر شخص دوسروں کے حقوق غصب کرتا ہے اور کسی کی نصیحت قبول نہیں کرتا۔",
                "اسلامی معاشرت کی بنیاد برابری اور تقویٰ پر ہے، نہ کہ مال و جاہ کی نمائش پر۔"
              ],
              "english": [
                "Arrogance breeds envy, hatred, and class hierarchies that destroy social peace.",
                "An arrogant person usurps the rights of others and refuses to accept sincere advice.",
                "Islamic society is built on equality and piety, not on the display of wealth and status."
              ]
            }
          },
          {
            "title": {
              "urdu": "عاجزی کا حصول",
              "english": "Attaining Humility"
            },
            "content": {
              "urdu": [
                "تکبر کا علاج یہ ہے کہ انسان اپنی حقیقت (مٹی سے پیدائش) پر غور کرے اور اللہ کی عظمت کو پہچانے۔",
                "اعمال میں اخلاص پیدا کرنا اور غریبوں کے ساتھ اٹھنا بیٹھنا تکبر کو ختم کرنے میں مدد دیتا ہے۔",
                "ہر نعمت کو اللہ کا فضل سمجھنا 'تعاظم' (خود کو بڑا سمجھنے) کا بہترین توڑ ہے۔"
              ],
              "english": [
                "The cure for pride is to reflect on one's origin (creation from dust) and to recognize the true greatness of Allah.",
                "Developing sincerity in deeds and associating with the poor helps in eradicating arrogance.",
                "Attributing every blessing to Allah's grace is the best antidote to self-magnification."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کے دن کا انجام",
        "english": "Consequence on the Day of Judgment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کا غضب",
              "english": "The Wrath of Allah"
            },
            "content": {
              "urdu": [
                "اللہ کا غضب ناک ہونا اس بات کی علامت ہے کہ وہ شخص رحمتِ الہی سے محروم رہے گا۔",
                "متکبرین کو قیامت کے دن چیونٹیوں کی مانند اٹھایا جائے گا جنہیں لوگ اپنے قدموں تلے روندیں گے۔",
                "اس دن صرف وہی لوگ کامیاب ہوں گے جو سلیم القلب اور عاجز ہوں گے۔"
              ],
              "english": [
                "Allah being angry is a sign that the person will be deprived of Divine Mercy.",
                "Arrogant people will be resurrected on the Day of Judgment like tiny ants, and people will trample them.",
                "On that day, only those with a sound heart and humility will be successful."
              ]
            }
          }
        ]
      }
    }
  ]
}