{
  "hadithId": 576,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/70"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "كتاب الصيام",
    "babId": 35
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1386) مرفوعاً، والراجح عند أئمة الحديث أنه موقوف من قول معاوية رضي الله عنه. وقد ذكر الحافظ ابن حجر في فتح الباري ستة وأربعين قولاً في المسألة.",
    "urdu": "صحیح۔ اسے ابوداؤد (1386) نے مرفوعاً روایت کیا ہے، مگر فنی طور پر اسے موقوف (صحابی کا قول) کہنا زیادہ راجح ہے۔ حافظ ابن حجر نے فتح الباری میں اس بارے میں 46 اقوال ذکر کیے ہیں۔",
    "english": "Sahih. Reported by Abu Dawud (1386). While reported as a statement of the Prophet (ﷺ), leading experts consider it a statement of Mu'awiyah (Mauquf). Ibn Hajar cited 46 different opinions in Fath al-Bari."
  },
  "importantWords": [
    {
      "arabic": "لَيْلَةِ الْقَدْرِ",
      "english": "The Night of Decree",
      "urdu": "شبِ قدر"
    },
    {
      "arabic": "سَبْعٍ وَعِشْرِينَ",
      "english": "Twenty-seven",
      "urdu": "ستائیس"
    },
    {
      "arabic": "تَعْيِينِهَا",
      "english": "Specifying it",
      "urdu": "اس کا تعین"
    },
    {
      "arabic": "اِخْتُلِفَ",
      "english": "Differed",
      "urdu": "اختلاف کیا گیا"
    },
    {
      "arabic": "أَرْجَحُ",
      "english": "Most correct / preferred",
      "urdu": "زیادہ راجح"
    }
  ],
  "summary": {
    "urdu": "شبِ قدر کے بارے میں بہت سے اقوال ہیں، جن میں سے ایک یہ ہے کہ یہ ستائیسویں رات ہے، مگر یہ آخری عشرے کی طاق راتوں میں منتقل ہوتی رہتی ہے۔",
    "english": "Among numerous scholarly opinions, the 27th night is frequently cited as Laylat al-Qadr, though it is understood to shift among the odd nights of the last ten days."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1386)",
      "english": "Reported by Abu Dawud (1386)"
    },
    {
      "arabic": "فتح الباري (4/263)",
      "english": "Fath al-Bari (4/263)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاوية بن أبي سفيان",
        "english": "Mu'awiyah bin Abi Sufyan"
      },
      "slug": "muawiyah-bin-abi-sufyan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0_u6uB2n7e8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ستائیسویں رات کی فضیلت",
        "english": "Virtue of the 27th Night"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور کا موقف",
              "english": "Majority Viewpoint"
            },
            "content": {
              "urdu": [
                "اکثر اہل علم اور عوام میں ستائیسویں شب کو شبِ قدر سمجھا جاتا ہے۔",
                "سیدنا معاویہ اور ابی بن کعب رضی اللہ عنہم اس پر قسم اٹھایا کرتے تھے۔",
                "اس رات میں عبادت کا خاص اہتمام کرنا سلف صالحین کا طریقہ رہا ہے۔"
              ],
              "english": [
                "The 27th night is widely regarded as Laylat al-Qadr by many scholars and laypeople.",
                "Companions like Mu'awiyah and Ubayy bin Ka'b (RA) used to swear by this date.",
                "It has been the practice of the righteous predecessors to maximize worship on this night."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعین میں پوشیدہ حکمت",
              "english": "Wisdom Behind the Ambiguity"
            },
            "content": {
              "urdu": [
                "اللہ نے اس رات کو چھپایا تاکہ لوگ پورے عشرے میں محنت کریں۔",
                "اگر ایک رات متعین ہوتی تو لوگ باقی راتوں میں سستی کرتے۔",
                "تلاش اور تڑپ ہی بندے کے درجات کو بلند کرتی ہے۔"
              ],
              "english": [
                "Allah concealed the exact night so people would strive throughout the last ten days.",
                "Had it been fixed, people might have become lazy during the other nights.",
                "The seeking and yearning for it is what elevates a servant's status."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علمی اقوال کا جائزہ",
        "english": "Analysis of Scholarly Views"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چالیس سے زائد اقوال",
              "english": "More than Forty Opinions"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر نے اس مسئلے پر 46 مختلف اقوال نقل کیے ہیں۔",
                "یہ اقوال مختلف صحابہ کی روایات اور مشاہدات پر مبنی ہیں۔",
                "اتنے زیادہ اقوال اس رات کی اہمیت اور اس کی تلاش کے شوق کو ظاہر کرتے ہیں۔"
              ],
              "english": [
                "Hafiz Ibn Hajar cited 46 different opinions regarding its exact timing.",
                "These views are based on various companions' narrations and personal experiences.",
                "Such a high number of views reflects the significance and the passion for finding this night."
              ]
            }
          },
          {
            "title": {
              "urdu": "راجح قول کیا ہے؟",
              "english": "What is the Most Correct View?"
            },
            "content": {
              "urdu": [
                "سب سے مضبوط قول یہ ہے کہ یہ آخری عشرے کی طاق راتوں میں ہوتی ہے۔",
                "یہ رات ہر سال ایک ہی تاریخ پر نہیں بلکہ منتقل ہوتی رہتی ہے۔",
                "کبھی 21، کبھی 23، کبھی 25، 27 یا 29 میں سے کوئی بھی ہو سکتی ہے۔"
              ],
              "english": [
                "The strongest view is that it occurs within the odd nights of the last ten days.",
                "It is not fixed to the same date every year but rather shifts among them.",
                "It could be the 21st, 23rd, 25th, 27th, or 29th in any given year."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مرفوع اور موقوف کی بحث",
        "english": "Marfu' and Mauquf Discussion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی باریکی",
              "english": "Subtlety of the Chain"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد نے اسے نبی ﷺ کا قول بتایا، مگر ماہرین اسے صحابی کا قول مانتے ہیں۔",
                "راجح موقوف ہونے کا مطلب ہے کہ یہ سیدنا معاویہ کی اپنی رائے یا تجربہ تھا۔",
                "تاہم صحابی کا قول بھی دینی معاملات میں ایک وزنی حجت ہوتا ہے۔"
              ],
              "english": [
                "Imam Abu Dawud linked it to the Prophet (ﷺ), but experts classify it as Mauquf.",
                "The preferred view means this was Mu'awiyah's (RA) personal conclusion or experience.",
                "Nonetheless, the statement of a companion carries significant weight in religious matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "تطبیقِ روایات",
              "english": "Harmonization of Narrations"
            },
            "content": {
              "urdu": [
                "دیگر صحیح روایات میں 21 اور 23 کا بھی ذکر ملتا ہے۔",
                "ان تمام روایات میں کوئی تضاد نہیں، بلکہ یہ مختلف برسوں کے تجربات ہیں۔",
                "مومن کو ہر طاق رات کو شبِ قدر سمجھ کر عبادت کرنی چاہیے۔"
              ],
              "english": [
                "Other authentic narrations mention the 21st and 23rd nights.",
                "There is no contradiction; these narrations reflect experiences from different years.",
                "A believer should treat every odd night as a potential Laylat al-Qadr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور نصیحت",
        "english": "Practical Training and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جستجو کا جذبہ",
              "english": "Spirit of Seeking"
            },
            "content": {
              "urdu": [
                "شبِ قدر ہزار مہینوں سے بہتر ہے، اسے پانے کے لیے پوری کوشش کریں۔",
                "صرف ستائیسویں پر تکیہ کرنے کے بجائے پورا عشرہ جاگنا سنت ہے۔",
                "دعا 'اللہم انک عفو' اس رات کا بہترین تحفہ ہے۔"
              ],
              "english": [
                "Laylat al-Qadr is better than a thousand months; strive hard to find it.",
                "Resting only on the 27th is not the Sunnah; one should stay awake the whole ten days.",
                "The supplication 'O Allah, You are Forgiving' is the best gift for this night."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختلاف میں رحمت",
              "english": "Mercy in Difference"
            },
            "content": {
              "urdu": [
                "تعین میں اختلاف مومن کے لیے زیادہ سے زیادہ عبادت کا موقع پیدا کرتا ہے۔",
                "علماء کی علمی ابحاث ہمیں اس رات کی عظمت کا احساس دلاتی ہیں۔",
                "ہمیں بحث کے بجائے عملی بندگی پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "The difference in specification creates more opportunities for worship for the believer.",
                "Scholarly research makes us realize the true greatness of this night.",
                "We should focus on practical servitude rather than theoretical debate."
              ]
            }
          }
        ]
      }
    }
  ]
}