{
  "hadithId": 1050,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1258"],
    "kitabId": 10,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام",
    "babId": 85
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو يعلي (2824)‏، وأصله في البخاري (2671)‏ من حديث ابن عباس رضي الله عنهما.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابویعلیٰ نے اپنی مسند میں روایت کیا ہے اور اس کے تمام راوی ثقہ ہیں۔ اس واقعے کی اصل صحیح بخاری میں سیدنا ابن عباس کی روایت سے بھی ثابت ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Ya'la (2824), and its origin is in Sahih al-Bukhari (2671) narrated by Ibn 'Abbas."
  },
  "importantWords": [
    {
      "arabic": "لِعَانٍ",
      "english": "Li'an / Mutual Cursing",
      "urdu": "لعان / میاں بیوی کا ایک دوسرے پر قسمیں کھانا"
    },
    {
      "arabic": "قَذَفَهُ",
      "english": "Accused him of adultery",
      "urdu": "اس پر تہمت لگائی"
    },
    {
      "arabic": "اَلْبَيِّنَةَ",
      "english": "The Proof / Witnesses",
      "urdu": "دلیل / گواہ"
    },
    {
      "arabic": "فَحَدٌّ",
      "english": "Legal Punishment",
      "urdu": "حدِ قذف / اسی کوڑے"
    },
    {
      "arabic": "ظَهْرِكَ",
      "english": "Your back",
      "urdu": "تمہاری پیٹھ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث لعان کے قانون کے آغاز کا پس منظر بیان کرتی ہے کہ جب کسی نے اپنی بیوی پر تہمت لگائی تو پہلے گواہ طلب کیے گئے، پھر لعان کی آیات نازل ہوئیں۔",
    "english": "This Hadith describes the background of the law of Li'an, where the Prophet (ﷺ) initially demanded four witnesses for an accusation of adultery, leading to the revelation of Li'an verses."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2671)",
      "english": "Sahih al-Bukhari (2671)"
    },
    {
      "arabic": "مسند أبي يعلي (2824)",
      "english": "Musnad Abu Ya'la (2824)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قانونِ قذف اور اس کی سختی",
        "english": "Law of Qadhf and its Severity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تہمت کی سزا",
              "english": "Punishment for False Accusation"
            },
            "content": {
              "urdu": [
                "اسلام میں کسی پاکدامن عورت پر زنا کی تہمت لگانا سنگین جرم ہے جس کی سزا 80 کوڑے ہے۔",
                "نبی ﷺ نے ہلال بن امیہ سے گواہ طلب کیے تاکہ معاشرے کی عزتیں محفوظ رہیں۔",
                "بغیر ثبوت کے الزام تراشی کرنا اللہ کے غضب کا باعث ہے۔"
              ],
              "english": [
                "In Islam, accusing a chaste woman of adultery is a grave crime punishable by 80 lashes.",
                "The Prophet (ﷺ) demanded witnesses from Hilal bin Umayyah to protect social honor.",
                "Making accusations without proof brings about the wrath of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کا تقاضا",
              "english": "Requirements of Justice"
            },
            "content": {
              "urdu": [
                "مدعی (الزام لگانے والے) پر لازم ہے کہ وہ اپنے دعوے کو چار عادل گواہوں سے ثابت کرے۔",
                "اگر گواہ نہ ہوں تو قانون الزام لگانے والے کو ہی مجرم قرار دیتا ہے۔",
                "یہ اصول لوگوں کو دوسروں کی آبرو کے ساتھ کھیلنے سے روکتا ہے۔"
              ],
              "english": [
                "The accuser is required to prove their claim with four upright witnesses.",
                "If no witnesses are provided, the law treats the accuser as the criminal.",
                "This principle prevents people from tarnishing the reputation of others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لعان کا آغاز اور اس کی ضرورت",
        "english": "Origin and Necessity of Li'an"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میاں بیوی کے لیے استثناء",
              "english": "Exception for Spouses"
            },
            "content": {
              "urdu": [
                "عام طور پر چار گواہ ضروری ہیں، لیکن شوہر کے لیے اپنی بیوی کے معاملے میں یہ مشکل تھا۔",
                "اس پریشانی کے حل کے لیے سورہ نور میں 'لعان' کی آیات نازل ہوئیں۔",
                "لعان وہ عمل ہے جس میں شوہر اور بیوی اللہ کی قسمیں کھا کر فیصلہ اللہ پر چھوڑ دیتے ہیں۔"
              ],
              "english": [
                "Generally four witnesses are required, but this was difficult for a husband regarding his wife.",
                "To resolve this dilemma, the verses of 'Li'an' were revealed in Surah An-Nur.",
                "Li'an is a procedure where husband and wife take oaths and leave the final judgment to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "پہلا واقعہ: ہلال بن امیہ",
              "english": "The First Case: Hilal bin Umayyah"
            },
            "content": {
              "urdu": [
                "ہلال بن امیہ نے جب اپنی بیوی پر الزام لگایا تو وہ سخت پریشان تھے کہ گواہ کہاں سے لائیں۔",
                "نبی ﷺ نے قانون کی پاسداری کرتے ہوئے حد کا حکم دیا، مگر وحی نے ان کی مشکل حل کر دی۔",
                "یہ واقعہ بتاتا ہے کہ شریعت انسانی مجبوریوں کا حل فراہم کرتی ہے۔"
              ],
              "english": [
                "When Hilal bin Umayyah accused his wife, he was deeply distressed about providing witnesses.",
                "The Prophet (ﷺ) initially ordered the Hadd according to existing law, but revelation provided a solution.",
                "This incident shows that Shariah provides solutions for genuine human dilemmas."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اور قانونی اسباق",
        "english": "Social and Legal Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی زبان پر قابو رکھنا چاہیے، خاص طور پر دوسروں کی عزت کے معاملے میں۔",
                "حدیث میں 'حد فی ظھرک' (تمہاری پیٹھ پر حد) کی وعید زبان کی بے احتیاطی کا نتیجہ ہے۔",
                "معاشرے میں بدگمانی اور الزامات کی فضا امن کو تباہ کر دیتی ہے۔"
              ],
              "english": [
                "A Muslim must control their tongue, especially concerning the honor of others.",
                "The threat of 'Hadd on your back' is a direct consequence of careless speech.",
                "An atmosphere of suspicion and accusations destroys social peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی نصیحت",
        "english": "Practical Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی اہمیت",
              "english": "Importance of Verification"
            },
            "content": {
              "urdu": [
                "کسی بھی بات کو پھیلانے سے پہلے اس کی مکمل تحقیق اور ٹھوس ثبوت ہونا ضروری ہے۔",
                "سنی سنائی باتوں پر الزامات لگانا سخت گناہ اور قانونی جرم ہے۔",
                "اسلامی معاشرہ گواہی اور ثبوت کے بغیر کسی کے خلاف کارروائی کی اجازت نہیں دیتا۔"
              ],
              "english": [
                "Thorough verification and solid proof are necessary before spreading any information.",
                "Leveling accusations based on hearsay is a grave sin and a legal offense.",
                "Islamic society does not permit action against anyone without testimony and evidence."
              ]
            }
          }
        ]
      }
    }
  ]
}