{
  "hadithId": 586,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/8"],
    "kitabId": 6,
    "inKitabBab": 1,
    "arabicBook": "كتاب الحج",
    "babId": 36
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البيهقي (4/325)، وابن أبي شيبة في المصنف. ورجاله ثقات، وصححه الحافظ ابن حجر مرفوعاً في التلخيص الحبير رغم ترجيحه للوقف هنا.",
    "urdu": "صحیح۔ اسے بیہقی اور ابن ابی شیبہ نے روایت کیا ہے۔ اگرچہ اس کے موقوف یا مرفوع ہونے میں بحث ہے، لیکن اس کا حکم صحیح اور اجماعِ امت کے مطابق ہے۔",
    "english": "Sahih. Reported by al-Baihaqi (4/325) and Ibn Abi Shaiba. Its narrators are trustworthy. Ibn Hajar graded it Sahih as a Marfu' narration in al-Talkhis al-Habir."
  },
  "importantWords": [
    {
      "arabic": "صَبِيٍّ",
      "english": "Boy / Child",
      "urdu": "بچہ"
    },
    {
      "arabic": "بَلَغَ",
      "english": "Reached",
      "urdu": "پہنچ گیا"
    },
    {
      "arabic": "اَلْحِنْثَ",
      "english": "Age of Puberty / Accountability",
      "urdu": "بلوغت / سنِ شعور"
    },
    {
      "arabic": "أُعْتِقَ",
      "english": "Emancipated / Freed",
      "urdu": "آزاد کیا گیا"
    },
    {
      "arabic": "مَوْقُوفٌ",
      "english": "Mauquf (Companion's statement)",
      "urdu": "صحابی کا قول"
    },
    {
      "arabic": "أُخْرَى",
      "english": "Another / Again",
      "urdu": "دوسرا / دوبارہ"
    }
  ],
  "summary": {
    "urdu": "نابالغ بچے اور غلام کا حج نفل شمار ہوتا ہے؛ بلوغت اور آزادی کے بعد اگر وہ صاحبِ استطاعت ہوں تو ان پر حجِ فرض کی ادائیگی دوبارہ لازم ہوگی۔",
    "english": "Hajj performed by a minor or a slave is considered voluntary; they must perform the obligatory Hajj again upon reaching puberty or gaining freedom, provided they have the means."
  },
  "references": [
    {
      "arabic": "رواه البيهقي (4/325)",
      "english": "Reported by Al-Baihaqi (4/325)"
    },
    {
      "arabic": "مصنف ابن أبي شيبة (12695)",
      "english": "Musannaf Ibn Abi Shaiba (12695)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F3XmUqM2l5o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نابالغ کے حج کا حکم",
        "english": "Ruling on Hajj for a Minor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے کے حج کی شرعی حیثیت",
              "english": "Legal Status of a Child's Hajj"
            },
            "content": {
              "urdu": [
                "نابالغ بچہ اگر حج کرے تو وہ شرعاً صحیح ہے اور اسے ثواب ملتا ہے۔",
                "تاہم یہ حج 'حجۃ الاسلام' (فرضی حج) کے طور پر کافی نہیں ہوتا۔",
                "بلوغت کے بعد استطاعت ہونے پر اسے دوبارہ حج کرنا واجب ہوگا۔"
              ],
              "english": [
                "Hajj performed by a minor is legally valid and rewarded by Allah.",
                "However, it does not fulfill the lifetime obligatory requirement of Hajj.",
                "Upon reaching puberty, if the person has the means, they must perform Hajj again."
              ]
            }
          },
          {
            "title": {
              "urdu": "بلوغت کا معیار",
              "english": "The Standard of Puberty"
            },
            "content": {
              "urdu": [
                "اسلام میں شرعی ذمہ داریوں کا آغاز بلوغت سے ہوتا ہے۔",
                "نابالغ پر حج فرض نہیں ہے اس لیے اس کا فعل نفل شمار ہوتا ہے۔",
                "بچپن کی عبادت والدین کے لیے بھی اجر کا باعث بنتی ہے۔"
              ],
              "english": [
                "Legal accountability in Islam begins with reaching the age of puberty.",
                "Hajj is not mandatory for minors; hence their performance is voluntary.",
                "Worship performed in childhood also brings rewards to the parents."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلام کے حج کا مسئلہ",
        "english": "The Issue of a Slave's Hajj"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آزادی اور فرضیت",
              "english": "Freedom and Obligation"
            },
            "content": {
              "urdu": [
                "غلام پر اس کی حالتِ غلامی میں حج فرض نہیں ہوتا۔",
                "اگر وہ اپنے مالک کی اجازت سے حج کرے تو اسے ثواب ملے گا۔",
                "آزاد ہونے کے بعد اسے اسلام کا بنیادی فرضی حج دوبارہ کرنا ہوگا۔"
              ],
              "english": [
                "Hajj is not mandatory for a slave while they are in bondage.",
                "If they perform Hajj with their master's permission, they receive rewards.",
                "Once freed, they are required to perform the primary obligatory Hajj of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملکیت اور استطاعت",
              "english": "Ownership and Capability"
            },
            "content": {
              "urdu": [
                "حج کے لیے مال کی ملکیت اور سفر کی آزادی شرط ہے۔",
                "غلام چونکہ آزاد نہیں ہوتا، اس لیے اس کی استطاعت ناقص مانی جاتی ہے۔",
                "اسلام مکمل شخصی آزادی کے بعد ہی بڑے مالی فرائض عائد کرتا ہے۔"
              ],
              "english": [
                "Ownership of wealth and freedom of travel are prerequisites for Hajj.",
                "Since a slave lacks freedom, their capability is considered incomplete.",
                "Islam imposes major financial obligations only after complete personal liberty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں اور مذاہب",
        "english": "Juristic Nuances and Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجماعِ امت",
              "english": "Consensus of the Ummah"
            },
            "content": {
              "urdu": [
                "تمام بڑے فقہی مذاہب اس بات پر متفق ہیں کہ بلوغت سے پہلے کا حج فرض ادا نہیں کرتا۔",
                "نابالغ کی طرف سے احرام اس کا ولی باندھتا ہے۔",
                "یہ حدیث اس اجماعی موقف کی بنیادی نص اور دلیل ہے۔"
              ],
              "english": [
                "All major schools of Fiqh agree that pre-puberty Hajj does not satisfy the obligation.",
                "The guardian enters the state of Ihram on behalf of the minor.",
                "This Hadith serves as the primary textual evidence for this consensus."
              ]
            }
          },
          {
            "title": {
              "urdu": "مرفوع اور موقوف کا فرق",
              "english": "Marfu' vs Mauquf Distinction"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ موقوف (صحابی کا قول) ہے، مگر اس کا تعلق ایسے معاملے سے ہے جو عقل سے معلوم نہیں ہوتا۔",
                "ایسے اقوال کو حکماً مرفوع مانا جاتا ہے کیونکہ صحابی اپنی مرضی سے ایسا نہیں کہہ سکتا۔",
                "محدثین کے نزدیک یہ شرعی حجت کے طور پر کافی مضبوط ہے۔"
              ],
              "english": [
                "Though it is Mauquf, it pertains to a matter that cannot be decided by intellect alone.",
                "Such statements are treated as Marfu' in ruling because a companion wouldn't say this personally.",
                "For Hadith scholars, it is sufficiently strong to serve as a legal proof."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچوں کی دینی تربیت",
              "english": "Religious Training of Children"
            },
            "content": {
              "urdu": [
                "بچپن میں حج کروانا بچوں کے دل میں بیت اللہ کی محبت پیدا کرتا ہے۔",
                "والدین کو چاہیے کہ وہ اپنی استطاعت کے مطابق بچوں کو عبادات کا عادی بنائیں۔",
                "یہ ان کے مستقبل کے لیے بہترین روحانی سرمایہ کاری ہے۔"
              ],
              "english": [
                "Performing Hajj in childhood instills love for the House of Allah in children.",
                "Parents should habituate their children to acts of worship within their means.",
                "This serves as an excellent spiritual investment for their future."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرض کی ادائیگی میں فکر",
              "english": "Concern for Fulfilling Obligations"
            },
            "content": {
              "urdu": [
                "انسان کو چاہیے کہ وہ بلوغت کے بعد اپنے فرائض کا جائزہ لے۔",
                "اگر بچپن میں حج کیا ہو تو اسے فرض سمجھ کر غافل نہ ہو جائے۔",
                "شرعی احکامات کی درست معلومات حاصل کرنا ہر مسلمان پر فرض ہے۔"
              ],
              "english": [
                "Individuals must evaluate their religious obligations after reaching puberty.",
                "One should not become negligent assuming a childhood Hajj covered the duty.",
                "Acquiring correct knowledge of Sharia rulings is obligatory for every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}