{
  "hadithId": 1226,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/15/7"],
    "kitabId": 15,
    "inKitabBab": 1,
    "arabicBook": "كتاب العتق",
    "babId": 100
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أحمد (5/221)، وأبو داود (3932)، والنسائي في الكبرى (3/190)، والحاكم (2/213). وصححه الحاكم ووافقه الذهبي.",
    "urdu": "حسن روایت ہے۔ اسے احمد (5/221)، ابوداؤد (3932)، نسائی اور حاکم نے روایت کیا ہے۔ امام حاکم اور علامہ ذہبی نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan (Good). Reported by Ahmad (5/221), Abu Dawud (3932), An-Nasa'i in Al-Kubra, and Al-Hakim (2/213). Al-Hakim graded it Sahih and Ad-Dhahabi agreed."
  },
  "importantWords": [
    {
      "arabic": "مَمْلُوكًا",
      "english": "Slave / Owned",
      "urdu": "غلام / زیرِ ملکیت"
    },
    {
      "arabic": "أُعْتِقُكَ",
      "english": "I emancipate you",
      "urdu": "میں تجھے آزاد کرتی ہوں"
    },
    {
      "arabic": "أَشْتَرِطُ",
      "english": "I stipulate / Condition",
      "urdu": "میں شرط لگاتی ہوں"
    },
    {
      "arabic": "تَخْدِمَ",
      "english": "To serve",
      "urdu": "خدمت کرنا"
    },
    {
      "arabic": "مَا عِشْتَ",
      "english": "As long as you live",
      "urdu": "جب تک تو زندہ رہے"
    },
    {
      "arabic": "سَفِينَةَ",
      "english": "Safinah (Prophetic title)",
      "urdu": "سفینہ (صحابی کا لقب)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مشروط آزادی (عتق بالشرط) کے جواز پر دلالت کرتی ہے، جہاں ام سلمہ رضی اللہ عنہا نے حضرت سفینہ کو نبی ﷺ کی خدمت کی شرط پر آزاد کیا۔",
    "english": "This Hadith demonstrates the permissibility of conditional manumission, where Umm Salamah freed Safinah on the condition of lifelong service to the Prophet (ﷺ)."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب العتق، رقم 3932",
      "english": "Sunan Abi Dawud, Book of Emancipation, No. 3932"
    },
    {
      "arabic": "مسند أحمد بن حنبل، رقم 21915",
      "english": "Musnad Ahmad bin Hanbal, No. 21915"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سفينة مولى رسول الله",
        "english": "Safinah, freed slave of the Messenger"
      },
      "slug": "safinah-mawla-rasul-allah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مشروط آزادی کا شرعی حکم",
        "english": "Legality of Conditional Manumission"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عتق میں شرط کا اثر",
              "english": "Impact of Conditions on Freedom"
            },
            "content": {
              "urdu": [
                "اسلامی فقہ میں آزادی دیتے وقت ایسی شرط لگانا جائز ہے جو نیکی یا خدمت پر مبنی ہو۔",
                "حضرت ام سلمہ رضی اللہ عنہا نے اپنی ملکیت ختم کی مگر اسے ایک عظیم خدمت سے جوڑ دیا۔",
                "یہ شرط غلام کے لیے بوجھ نہیں بلکہ سعادت تھی کیونکہ اسے حضور ﷺ کی قربت مل رہی تھی۔"
              ],
              "english": [
                "In Islamic jurisprudence, it is permissible to stipulate conditions based on virtue or service when freeing a slave.",
                "Umm Salamah (RA) ended her ownership but linked the act to a noble service.",
                "This condition was not a burden but a blessing for the slave as it granted him proximity to the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاہدے کی پاسداری",
              "english": "Upholding the Agreement"
            },
            "content": {
              "urdu": [
                "اگر غلام آزادی قبول کر لے تو اس پر لگائی گئی جائز شرط کو پورا کرنا لازم ہو جاتا ہے۔",
                "حضرت سفینہ رضی اللہ عنہ نے تاحیات اس عہد کو نبھایا اور اسے اپنی خوش قسمتی سمجھا۔",
                "یہ حدیث 'المسلمون علی شروطہم' (مسلمان اپنی شرائط کے پابند ہیں) کے اصول کی تائید کرتی ہے۔"
              ],
              "english": [
                "Once the slave accepts freedom under a condition, they are obligated to fulfill that valid stipulation.",
                "Safinah (RA) upheld this pledge throughout his life and considered it a mark of good fortune.",
                "This Hadith supports the principle that 'Muslims are bound by their conditions.'"
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خدمتِ نبوی کی فضیلت",
        "english": "Excellence of Serving the Prophet (ﷺ)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ام سلمہ رضی اللہ عنہا کی دانائی",
              "english": "The Wisdom of Umm Salamah (RA)"
            },
            "content": {
              "urdu": [
                "انہوں نے اپنی نیکی کو نبی کریم ﷺ کی راحت اور خدمت کے لیے وقف کر دیا۔",
                "وہ چاہتی تھیں کہ ان کا آزاد کردہ غلام دین کی خدمت کے مرکز سے جڑا رہے۔",
                "یہ ان کی نبی ﷺ سے گہری محبت اور عقیدت کا منہ بولتا ثبوت ہے۔"
              ],
              "english": [
                "She dedicated her virtuous act to the comfort and service of the Prophet (ﷺ).",
                "She intended for her freed slave to remain connected to the center of religious service.",
                "This is a clear testament to her deep love and devotion for the Messenger of Allah (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "سفینہ رضی اللہ عنہ کا جذبہ",
              "english": "The Spirit of Safinah (RA)"
            },
            "content": {
              "urdu": [
                "روایت میں آتا ہے کہ انہوں نے کہا 'اگر وہ شرط نہ بھی لگاتیں تب بھی میں آپ ﷺ کو نہ چھوڑتا'۔",
                "یہ ظاہر کرتا ہے کہ صحابہ کے نزدیک غلامی کی آزادی سے بڑھ کر حضور ﷺ کی خدمت تھی۔",
                "محبت اور عقیدت جب دل میں راسخ ہو جائے تو خدمت بوجھ نہیں بلکہ لذت بن جاتی ہے۔"
              ],
              "english": [
                "In the narration, he said, 'Even if she hadn't made it a condition, I would never have left the Prophet (ﷺ).'",
                "This shows that for the Companions, serving the Prophet was more valuable than legal freedom.",
                "When love and devotion are rooted in the heart, service becomes a pleasure rather than a chore."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مباحث اور اطلاق",
        "english": "Juristic Debates and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرط باطل ہونے کی صورت",
              "english": "Scenario of Invalid Conditions"
            },
            "content": {
              "urdu": [
                "اگر آزادی کے ساتھ کوئی ایسی شرط ہو جو شریعت کے خلاف ہو تو آزادی واقع ہو جائے گی مگر شرط باطل ہو گی۔",
                "لیکن خدمتِ نبوی یا کسی نیک کام کی شرط شرعی طور پر مستحسن اور جائز ہے۔",
                "یہاں شرط کا مقصد غلام کی آزادی کو محدود کرنا نہیں بلکہ ایک نیکی کا تسلسل تھا۔"
              ],
              "english": [
                "If a condition contrary to Sharia is attached to manumission, the freedom occurs but the condition is void.",
                "However, conditions involving prophetic service or virtuous deeds are legally commendable and valid.",
                "The purpose here was not to restrict freedom but to ensure the continuity of a righteous act."
              ]
            }
          },
          {
            "title": {
              "urdu": "ولاء کا مسئلہ",
              "english": "The Issue of Wala' (Loyalty)"
            },
            "content": {
              "urdu": [
                "آزاد کرنے کے بعد 'ولاء' (وراثت کا حق) اسی کے پاس رہتا ہے جس نے آزاد کیا ہو۔",
                "حضرت سفینہ رضی اللہ عنہ 'مولٰی رسول اللہ' کہلائے کیونکہ وہ آپ ﷺ کی خدمت میں رہے۔",
                "خدمت کی شرط لگانے سے مالک کے بنیادی حقوق (جیسے ولاء) پر اثر نہیں پڑتا۔"
              ],
              "english": [
                "After manumission, 'Wala' (the right of inheritance) remains with the one who performed the act.",
                "Safinah (RA) was called 'Mawla Rasul Allah' due to his constant service to the Prophet (ﷺ).",
                "Stipulating service does not negate the fundamental rights of the emancipator, such as Wala'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیکی کو نیکی سے جوڑنا",
              "english": "Linking Good Deed to Another"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی عبادات اور مالی قربانیوں کو بہترین مقاصد کے لیے استعمال کریں۔",
                "اگر ہم کسی کی مدد کریں تو اسے اللہ کی بندگی اور دین کی خدمت کی ترغیب بھی دیں۔",
                "انفرادی بھلائی کو اجتماعی اور دینی فائدے میں تبدیل کرنا دانشمندی ہے۔"
              ],
              "english": [
                "We should utilize our acts of worship and financial sacrifices for the highest purposes.",
                "If we help someone, we should also encourage them toward Allah's service and religious work.",
                "Transforming individual welfare into collective and religious benefit is true wisdom."
              ]
            }
          },
          {
            "title": {
              "urdu": "عہد کی پاسداری",
              "english": "Commitment to Pledges"
            },
            "content": {
              "urdu": [
                "ایک مومن جب کوئی وعدہ یا شرط قبول کرتا ہے تو اسے نبھانا اس کے ایمان کا تقاضا ہے۔",
                "حضرت سفینہ کی تاحیات خدمت ہمیں استقامت اور وفاداری کا درس دیتی ہے۔",
                "دین کی راہ میں کی گئی تھوڑی سی محنت بھی دائمی نجات کا ذریعہ بن سکتی ہے۔"
              ],
              "english": [
                "When a believer accepts a promise or condition, fulfilling it is a requirement of their faith.",
                "Safinah's lifelong service teaches us lessons in steadfastness and loyalty.",
                "Even small efforts in the path of religion can become a means for eternal salvation."
              ]
            }
          }
        ]
      }
    }
  ]
}