{
  "hadithId": 386,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-386"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (5/57 و 58)‏، وأبو داود (1157)‏، والنسائي (3/180)، وابن ماجه (1653)، والدارقطني (2/170)، وصححه الحاكم والذهبي وغيرهما.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد (5/57)، ابوداؤد (1157)، نسائی اور ابن ماجہ نے روایت کیا ہے۔ امام حاکم اور ذہبی نے اس کی سند کو صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (5/57), Abu Dawud (1157), An-Nasa'i, and Ibn Majah. Its chain is authentic as confirmed by Al-Hakim and Adh-Dhahabi."
  },
  "importantWords": [
    {
      "arabic": "رَكْبًا",
      "english": "Riders / Group",
      "urdu": "سوار / قافلہ"
    },
    {
      "arabic": "الْهِلَالَ",
      "english": "Crescent moon",
      "urdu": "ہلال / نیا چاند"
    },
    {
      "arabic": "بِالْأَمْسِ",
      "english": "Yesterday",
      "urdu": "کل / گزشتہ دن"
    },
    {
      "arabic": "يُفْطِرُوا",
      "english": "Break the fast",
      "urdu": "افطار کریں"
    },
    {
      "arabic": "يَغْدُوا",
      "english": "Go out early",
      "urdu": "صبح سویرے نکلیں"
    },
    {
      "arabic": "مُصَلَّاهُمْ",
      "english": "Prayer place (Musalla)",
      "urdu": "عید گاہ / نماز کی جگہ"
    }
  ],
  "summary": {
    "urdu": "اگر زوال کے بعد چاند کی گواہی ملے، تو روزہ اسی وقت افطار کر دیا جائے گا لیکن عید کی نماز اگلے دن پڑھی جائے گی۔",
    "english": "If the moon sighting testimony is received after the time of Eid prayer has passed, the fast should be broken immediately, but the Eid prayer is postponed until the next morning."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1157)",
      "english": "Sunan Abu Dawud (1157)"
    },
    {
      "arabic": "مسند أحمد (5/57)",
      "english": "Musnad Ahmad (5/57)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو عمير بن أنس بن مالك",
        "english": "Abu 'Umair bin Anas"
      },
      "slug": "abu-umair-bin-anas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عمومة له من الصحابة",
        "english": "Paternal Uncles (Sahaba)"
      },
      "slug": "uncles-of-abu-umair-sahaba"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=late+moon+sighting+eid+prayer+ruling+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تاخیر سے گواہی کا حکم",
        "english": "Ruling on Late Testimony"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزہ افطار کرنا",
              "english": "Breaking the Fast"
            },
            "content": {
              "urdu": [
                "جب ثقہ گواہوں سے چاند کی تصدیق ہو جائے تو روزہ رکھنا حرام ہے۔",
                "نبی ﷺ نے گواہی ملتے ہی صحابہ کو روزہ کھولنے کا حکم دیا۔",
                "یہ اس بات کی دلیل ہے کہ عید کا دن شرعی طور پر شروع ہو چکا ہے۔"
              ],
              "english": [
                "Once the moon is confirmed by reliable witnesses, fasting becomes prohibited.",
                "The Prophet (ﷺ) ordered the Companions to break the fast as soon as the news arrived.",
                "This proves that the day of Eid has legally commenced."
              ]
            }
          },
          {
            "title": {
              "urdu": "نمازِ عید کی تاخیر",
              "english": "Delaying Eid Prayer"
            },
            "content": {
              "urdu": [
                "اگر گواہی زوال کے بعد ملے تو عید کی نماز کا وقت نکل چکا ہوتا ہے۔",
                "ایسی صورت میں عید کی نماز اگلے دن کے لیے مؤخر کر دی جائے گی۔",
                "یہ شریعت کی آسانی ہے کہ لوگوں کو عید کی تیاری کا موقع مل سکے۔"
              ],
              "english": [
                "If testimony is received after midday, the time for Eid prayer has passed.",
                "In such cases, the Eid prayer is postponed to the following morning.",
                "This is a Sharia-sanctioned ease allowing people time to prepare for Eid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و شرعی نکات",
        "english": "Juristic and Sharia Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گواہی کی قبولیت",
              "english": "Acceptance of Testimony"
            },
            "content": {
              "urdu": [
                "عید کے چاند کے لیے دو عادل گواہوں کی شہادت ضروری ہے۔",
                "نبی ﷺ نے سواروں کی بات پر اعتماد کرتے ہوئے فیصلہ صادر فرمایا۔",
                "حاکمِ وقت یا ہلال کمیٹی کا فیصلہ پوری بستی پر نافذ ہوتا ہے۔"
              ],
              "english": [
                "The testimony of two upright witnesses is required for the Eid moon.",
                "The Prophet (ﷺ) made the decision based on the reliability of the riders.",
                "The decision of the ruler or Moon Committee applies to the entire community."
              ]
            }
          },
          {
            "title": {
              "urdu": "قضا اور ادائیگی",
              "english": "Makeup and Performance"
            },
            "content": {
              "urdu": [
                "عید کی نماز کی قضا اگلے دن کرنا سنت سے ثابت ہے۔",
                "یہ اس بات کی دلیل ہے کہ عید کی نماز کی اہمیت بہت زیادہ ہے۔",
                "اگر وقت گزر جائے تو اسے ضائع کرنے کے بجائے اگلے دن پڑھا جائے گا۔"
              ],
              "english": [
                "Performing the makeup (Qada) of Eid prayer the next day is Sunnah.",
                "This highlights the immense importance of the Eid prayer in Islam.",
                "If the time elapses, it should be offered the next day rather than omitted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عید گاہ اور اجتماعیت",
        "english": "Musalla and Collectivity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عید گاہ جانے کی تاکید",
              "english": "Emphasis on the Musalla"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے 'مصلیٰ' یعنی عید گاہ جانے کا خاص طور پر حکم دیا۔",
                "عید کی نماز آبادی سے باہر کھلے میدان میں پڑھنا سنتِ نبوی ہے۔",
                "اس سے مسلمانوں کی قوت اور اجتماعیت کا اظہار ہوتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) specifically commanded going to the 'Musalla' (Eidgah).",
                "Offering Eid prayer in an open field outside the town is a Sunnah.",
                "It serves as a manifestation of the strength and unity of Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبح سویرے نکلنا",
              "english": "Departing Early"
            },
            "content": {
              "urdu": [
                "لفظ 'یغدوا' سے مراد صبح سویرے عید کی طرف نکلنا ہے۔",
                "عید کے دن جلدی تیاری کرنا اور خوشی کا اظہار کرنا مستحب ہے۔",
                "یہ مسلمانوں کے لیے سال بھر کے دو سب سے بڑے خوشی کے دن ہیں۔"
              ],
              "english": [
                "The word 'Yaghdu' refers to departing early in the morning for Eid.",
                "Preparing early and expressing joy on Eid day is highly encouraged.",
                "These are the two greatest days of celebration for Muslims annually."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی پابندی",
              "english": "Adherence to Discipline"
            },
            "content": {
              "urdu": [
                "عید کے تعین میں نظم و ضبط برقرار رکھنا فتنے سے بچاتا ہے۔",
                "جب حکمران یا ذمہ دار اعلان کر دیں تو انفرادی رائے چھوڑ دینی چاہیے۔",
                "اسلام ہر کام کو ترتیب اور طریقے سے کرنے کا درس دیتا ہے۔"
              ],
              "english": [
                "Maintaining discipline in Eid determination prevents social discord.",
                "Individual opinions should be set aside once authority makes a declaration.",
                "Islam teaches us to perform every task with order and methodology."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصت سے فائدہ اٹھانا",
              "english": "Utilizing Concessions"
            },
            "content": {
              "urdu": [
                "دین اسلام نے انسانی ضروریات اور حالات کا ہمیشہ خیال رکھا ہے۔",
                "تاخیر کی صورت میں نماز کو اگلے دن منتقل کرنا ایک بڑی رخصت ہے۔",
                "مومن کو چاہیے کہ وہ اللہ کی دی ہوئی رخصتوں سے خوشی سے فائدہ اٹھائے۔"
              ],
              "english": [
                "Islam has always considered human needs and situational constraints.",
                "Moving the prayer to the next day in case of delay is a great concession.",
                "A believer should happily accept and utilize the concessions given by Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
