{
  "hadithId": 71,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["tirmidhi:993"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب الطهارة",
    "babId": 6
  },

  "takhreej": {
    "arabic": " صحيح. رواه أحمد رقم (7675) ، والترمذي (993) . والحديث قد أعله جماعة كالإمام أحمد كما نقل الحافظ ولكن طرق الحديث وشواهده الكثيرة لا تدع أدنى شك في تصحيحه، وانظر \"الأصل\" إن شئت معرفة ذلك. \"تنبيه\": وهم الحافظ عي عزوه للنسائي. والله أعلم ",
    "urdu": " یہ حدیث صحیح ہے۔ اسے امام احمد (نمبر 7675) اور ترمذی (نمبر 993) نے روایت کیا ہے۔ اگرچہ ائمہ حدیث کے ایک گروہ نے اس پر کلام کیا ہے، جیسا کہ امام احمد کا قول نقل کیا گیا ہے، لیکن اس کی متعدد اسناد اور شواہد اس کے صحیح ہونے میں کوئی شک باقی نہیں چھوڑتے۔",
    "english": "Sahih (Authentic). Narrated by Ahmad (No. 7675) and At-Tirmidhi (No. 993). Although some scholars, like Imam Ahmad, had reservations about this Hadith, its numerous chains and supporting evidences leave no doubt in its authentication."
  },
  "importantWords": [
    {
      "arabic": "غَسَّلَ",
      "english": "Washed/Gave bath",
      "urdu": "غسل دیا"
    },
    {
      "arabic": "مَيْتًا",
      "english": "A dead person",
      "urdu": "مردہ شخص"
    },
    {
      "arabic": "فَلْيَغْتَسِلْ",
      "english": "Let him perform Ghusl (full bath)",
      "urdu": "تو اسے غسل کرنا چاہیے"
    },
    {
      "arabic": "حَمَلَهُ",
      "english": "Carried him (the dead body)",
      "urdu": "اسے اٹھایا"
    },
    {
      "arabic": "فَلْيَتَوَضَّأْ",
      "english": "Let him perform Wudu’ (ablution)",
      "urdu": "تو اسے وضو کرنا چاہیے"
    },
    {
      "arabic": "إِعْلَال",
      "english": "Ailing/Criticism (of Hadith)",
      "urdu": "علت لگانا"
    },
    {
      "arabic": "صحيح",
      "english": "Authentic",
      "urdu": "صحیح"
    },
    {
      "arabic": "حَسَّنَه",
      "english": "Rated it as Hasan",
      "urdu": "حسن قرار دیا"
    },
    {
      "arabic": "شواهده",
      "english": "Supporting evidences",
      "urdu": "شواہد"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Narrated/Reported by",
      "urdu": "روایت کیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غسلِ میت دینے اور میت کو اٹھانے کے بعد طہارت سے متعلق احکام بیان کرتی ہے۔ میت کو غسل دینے والے کے لیے غسل اور میت کو اٹھانے والے کے لیے وضو کا حکم ہے۔",
    "english": "This Hadith provides rulings concerning purification after handling a deceased person, specifically commanding Ghusl for the one who washes the dead and Wudu’ for the one who carries the dead body."
  },
  "references": [
    {
      "arabic": "رواه أحمد رقم (7675)",
      "english": "Reported by Ahmad (No. 7675)"
    },
    {
      "arabic": "رواه الترمذي (993)",
      "english": "Reported by At-Tirmidhi (No. 993)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ - رضى الله عنه",
        "english": "Abu Hurairah (May Allah be pleased with him)"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "میت کو غسل دینے کا حکم اور حکمت",
        "english": "The Ruling and Wisdom of Washing the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غسل دینے والے کے لیے غسل",
              "english": "Ghusl for the Washer"
            },
            "content": {
              "urdu": [
                "حدیث میں حکم ہے کہ جو شخص میت کو غسل دے، اسے خود بھی غسل کرنا چاہیے۔",
                "یہ حکم وجوب کے لیے نہیں، بلکہ یہ استحباب (پسندیدہ عمل) کے لیے استعمال ہوتا ہے تاکہ جسمانی و روحانی پاکیزگی حاصل ہو۔",
                "یہ اس بات کو یقینی بنانے کے لیے ہے کہ نجاست کے کسی بھی ممکنہ چھینٹے یا اثر سے مکمل طہارت ہو جائے۔"
              ],
              "english": [
                "The Hadith commands that the person who washes the deceased should also perform Ghusl (a full bath).",
                "This command is generally understood to be for recommendation (Istihbab), not obligation, to achieve spiritual and physical cleanliness.",
                "It serves to ensure complete purification from any potential splashes or effects of impurity (Najasah) encountered during the washing."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل کی وجوبی حیثیت",
              "english": "Status of Ghusl (Obligation vs. Recommendation)"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک یہ غسل کرنا ضروری نہیں، بلکہ مستحب اور احتیاط کا درجہ رکھتا ہے۔",
                "امام احمد کا کلام اس بات کی طرف اشارہ کرتا ہے کہ اس حکم کی دلیل قطعی نہیں ہے۔",
                "لیکن چونکہ میت کو چھونے میں نجاست کا امکان ہوتا ہے، لہٰذا غسل کا مشورہ احتیاطاً بہت اہم ہے۔"
              ],
              "english": [
                "According to the majority of scholars, this Ghusl is not obligatory (Wajib) but rather recommended (Mustahabb) and a measure of caution.",
                "Imam Ahmad's statement about the lack of soundness suggests the ruling is not decisively established as obligatory.",
                "However, since touching the deceased involves the possibility of impurity, the recommendation of Ghusl is a significant precautionary measure."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "میت کو اٹھانے کا حکم اور طہارت",
        "english": "The Ruling and Purification for Carrying the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میت کو اٹھانے والے کے لیے وضو",
              "english": "Wudu' for the Carrier"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم نے میت کو اٹھانے والے کو وضو کرنے کا حکم دیا۔",
                "یہ حکم روحانی پاکیزگی اور میت کے احترام سے متعلق ہے۔",
                "یہ طہارت کے اسباب میں سے ہے جس کا مقصد میت کے آخری سفر کی عظمت کو برقرار رکھنا ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) instructed the one who carries the deceased body to perform Wudu' (ablution).",
                "This instruction relates to spiritual cleanliness and showing respect for the deceased.",
                "It is one of the acts of purification intended to maintain the sanctity of the deceased person's final journey."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو کی نوعیت اور مقصد",
              "english": "Nature and Purpose of the Wudu'"
            },
            "content": {
              "urdu": [
                "جس طرح غسلِ میت دینے والے کا غسل مستحب ہے، اسی طرح اٹھانے والے کا وضو بھی استحباب پر محمول ہے۔",
                "یہ وضو عام حدثِ اصغر کو دور کرنے کے لیے نہیں، بلکہ احتیاطی یا تعبدی نوعیت کا ہے۔",
                "فقہاء نے یہ وضاحت کی ہے کہ میت کو اٹھانا بذاتِ خود طہارت کو باطل نہیں کرتا، بلکہ یہ ایک افضل عمل ہے۔"
              ],
              "english": [
                "Just as the Ghusl for the washer is recommended, the Wudu' for the carrier is also generally considered a recommendation.",
                "This Wudu' is not for removing minor ritual impurity (Hadath Asghar) but is a precautionary or devotional act.",
                "Jurists clarified that carrying the dead body itself does not invalidate one's purification, but this Wudu' is considered a superior practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور تدبر",
        "english": "Juristic Disagreement and Reflection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام احمد کا نقطہ نظر",
              "english": "Imam Ahmad's Viewpoint"
            },
            "content": {
              "urdu": [
                "امام احمد کا قول ہے کہ اس باب میں کوئی حدیث صحیح نہیں، جس سے اس حکم کی وجوبیت پر شبہ پیدا ہوتا ہے۔",
                "ان کا یہ قول اس بات کو نمایاں کرتا ہے کہ سنت میں حکمِ وجوب کے لیے دلیل کی پختگی ضروری ہے۔",
                "اگرچہ وہ حدیث کی سند پر کلام کرتے ہیں، مگر دیگر ائمہ (جیسے ترمذی) نے اسے حسن قرار دیا ہے۔"
              ],
              "english": [
                "Imam Ahmad stated that no Hadith on this matter is sound, which casts doubt on the ruling's obligatory status.",
                "His statement highlights the necessity of robust evidence for establishing an obligatory ruling in Sunnah.",
                "While he criticized the chain, other great Imams (like At-Tirmidhi) classified the Hadith as Hasan (good)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تخريج میں تصحیح کا سبب",
              "english": "Reason for Authentication in Takhreej"
            },
            "content": {
              "urdu": [
                "محدثین نے اس حدیث کے شواہد اور متعدد اسناد کو مدنظر رکھتے ہوئے اسے 'صحیح' قرار دیا ہے۔",
                "شواہد کی کثرت حدیث کو تقویت دیتی ہے، بھلے ہی اس کی ایک سند میں ضعف یا کلام ہو۔",
                "یہ اصول اسلامی فقہ میں عمل کرنے کی ترغیب دیتا ہے تاکہ میت کی حرمت کا خیال رکھا جائے۔"
              ],
              "english": [
                "Hadith scholars authenticated this narration as 'Sahih' by considering its numerous supporting evidences and chains.",
                "The abundance of corroborating evidence strengthens a Hadith, even if a single chain has weakness or commentary.",
                "This principle encourages Muslims to act upon this recommendation out of reverence for the deceased."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اطلاق اور اخلاقی تعلیم",
        "english": "Practical Application and Ethical Teaching"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت میں احتیاط",
              "english": "Precaution in Purification"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ غسلِ میت دینے کے بعد مسنون عمل کے طور پر غسل کریں۔",
                "میت کو قبرستان لے جانے میں شرکت کرنے کے بعد وضو کا اہتمام کریں۔",
                "یہ عمل نہ صرف جسمانی بلکہ روحانی طور پر بھی انسان کو پاکیزہ رکھتا ہے اور ثواب کا باعث ہے۔"
              ],
              "english": [
                "Muslims should, as a practice of Sunnah, perform Ghusl after completing the washing of the deceased.",
                "It is advisable to ensure Wudu' is performed after participating in carrying the deceased to the grave.",
                "This practice cleanses a person not only physically but also spiritually, earning them reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "خدمتِ میت کی فضیلت",
              "english": "The Virtue of Serving the Deceased"
            },
            "content": {
              "urdu": [
                "میت کے تمام معاملات میں شریک ہونا ایک بڑی نیکی اور فرضِ کفایہ ہے۔",
                "غسل اور وضو کے احکامات اس عظیم عمل کی اہمیت اور تقدس کو بڑھاتے ہیں۔",
                "حدیث ہمیں سکھاتی ہے کہ یہاں تک کہ میت کی خدمت میں بھی طہارت اور احتیاط کو ملحوظ خاطر رکھا جائے۔"
              ],
              "english": [
                "Participating in all matters concerning the deceased is a great virtue and a communal obligation (Fard Kifayah).",
                "The rulings of Ghusl and Wudu' enhance the significance and sanctity of this profound act.",
                "The Hadith teaches us to maintain cleanliness and caution even when performing the service of the deceased."
              ]
            }
          }
        ]
      }
    }
  ]
}
