{
  "hadithId": 1274,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["tirmidhi:2380", "ibnmajah:3349"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزهد",
    "babId": 104
  },
  
  "takhreej": {
    "arabic": "صحيح لغيره. رواه الترمذي (2380)، وابن ماجه (3349)، وأحمد (17186). قال الترمذي: حسن صحيح. وصححه الألباني في السلسلة الصحيحة (2265).",
    "urdu": "یہ حدیث صحیح لغیرہ ہے۔ اسے امام ترمذی (2380) اور ابن ماجہ (3349) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا، اور علامہ البانی نے اسے سلسلہ صحیحہ میں صحیح قرار دیا ہے۔",
    "english": "Sahih lighairihi (Authentic). Reported by At-Tirmidhi (2380), Ibn Majah (3349), and Ahmad (17186). At-Tirmidhi graded it Hasan Sahih, and Al-Albani authenticated it in As-Silsilah as-Sahihah (2265)."
  },
  "importantWords": [
    {
      "arabic": "مَلَأَ",
      "english": "Filled",
      "urdu": "بھرا / پر کیا"
    },
    {
      "arabic": "وِعَاءً",
      "english": "Vessel / Container",
      "urdu": "برتن"
    },
    {
      "arabic": "شَرًّا",
      "english": "Worse / Evil",
      "urdu": "بدترین / برا"
    },
    {
      "arabic": "بَطْنٍ",
      "english": "Stomach",
      "urdu": "پیٹ"
    },
    {
      "arabic": "بِحَسْبِ",
      "english": "Sufficient / Enough",
      "urdu": "کافی ہونا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ضرورت سے زیادہ کھانے کی ممانعت کرتی ہے اور پیٹ کو حد سے زیادہ بھرنے کو صحت اور عبادت کے لیے نقصان دہ قرار دیتی ہے۔",
    "english": "This Hadith warns against overeating and excessive consumption, describing the overfilled stomach as the worst vessel to be filled by man."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (2380)",
      "english": "Reported by At-Tirmidhi (2380)"
    },
    {
      "arabic": "رواه ابن ماجه (3349)",
      "english": "Reported by Ibn Majah (3349)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "المقدام بن معد يكرب الكندي",
        "english": "Al-Miqdam bin Ma'dikarib"
      },
      "slug": "al-miqdam-bin-madikarib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XvK_rBf8m00",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اعتدال کی اہمیت",
        "english": "Importance of Moderation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے میں اعتدال",
              "english": "Moderation in Eating"
            },
            "content": {
              "urdu": [
                "اسلام نے ہر کام میں میانہ روی اور اعتدال کا حکم دیا ہے۔",
                "ضرورت سے زیادہ کھانا پیٹ کو بوجھل اور سست بنا دیتا ہے۔",
                "کھانے کا مقصد جسم کو توانائی فراہم کرنا ہے، محض لذت نہیں۔"
              ],
              "english": [
                "Islam commands moderation and balance in every aspect of life.",
                "Overeating makes the stomach heavy and causes lethargy.",
                "The purpose of eating is to provide energy, not just pleasure."
              ]
            }
          },
          {
            "title": {
              "urdu": "پیٹ ایک برتن کے طور پر",
              "english": "Stomach as a Vessel"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے پیٹ کو بدترین برتن اس لیے کہا کیونکہ اس کا بھرنا مضر ہے۔",
                "حد سے زیادہ بھرا ہوا پیٹ روحانیت اور ہوشیاری کو ختم کرتا ہے۔",
                "انسان کو صرف اتنا کھانا چاہیے جو اس کی کمر سیدھی رکھ سکے۔"
              ],
              "english": [
                "The Prophet (ﷺ) called it the worst vessel because overfilling it is harmful.",
                "An overfilled stomach diminishes spirituality and mental alertness.",
                "A human should eat only enough to keep their back straight."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور جسمانی فوائد",
        "english": "Medical and Physical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیماریوں سے بچاؤ",
              "english": "Prevention of Diseases"
            },
            "content": {
              "urdu": [
                "پیٹ کی بیماریاں اکثر حد سے زیادہ کھانے کی وجہ سے ہوتی ہیں۔",
                "کم خوری سے ہاضمہ درست رہتا ہے اور موٹاپے سے بچا جا سکتا ہے۔",
                "جدید طب بھی اس نبوی اصول کی تائید کرتی ہے کہ کم کھانا صحت مند ہے۔"
              ],
              "english": [
                "Many stomach ailments are the direct result of excessive eating.",
                "Eating less maintains digestion and prevents obesity.",
                "Modern medicine supports this Prophetic principle for better health."
              ]
            }
          },
          {
            "title": {
              "urdu": "چستی اور توانائی",
              "english": "Alertness and Energy"
            },
            "content": {
              "urdu": [
                "پیٹ خالی ہونے کی صورت میں جسم زیادہ چست محسوس کرتا ہے۔",
                "زیادہ کھانے سے خون کا رخ ہاضمے کی طرف ہو جاتا ہے جس سے نیند آتی ہے۔",
                "ہلکا پھلکا جسم روزمرہ کے کاموں کو بہتر طریقے سے سرانجام دیتا ہے۔"
              ],
              "english": [
                "The body feels more active and agile when the stomach is not full.",
                "Overeating diverts blood flow to digestion, causing drowsiness.",
                "A light body performs daily tasks more efficiently and effectively."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تقسیم کا نبوی قاعدہ",
        "english": "The Prophetic Rule of Division"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین حصوں کا اصول",
              "english": "The Three-Part Rule"
            },
            "content": {
              "urdu": [
                "پیٹ کا ایک حصہ کھانے کے لیے مخصوص ہونا چاہیے۔",
                "دوسرا حصہ پانی کے لیے اور تیسرا حصہ سانس کے لیے چھوڑنا چاہیے۔",
                "یہ اصول پیٹ پر دباؤ کو کم کرتا ہے اور سکون فراہم کرتا ہے۔"
              ],
              "english": [
                "One third of the stomach should be reserved for food.",
                "The second for water, and the third for air (breathing).",
                "This principle reduces pressure on the stomach and provides comfort."
              ]
            }
          },
          {
            "title": {
              "urdu": "تنفس میں آسانی",
              "english": "Ease in Breathing"
            },
            "content": {
              "urdu": [
                "پیٹ کو سانس کے لیے خالی چھوڑنا پھیپھڑوں کے لیے بہتر ہے۔",
                "اس سے خون کی گردش اور آکسیجن کی فراہمی بہتر ہوتی ہے۔",
                "سانس لینے میں دشواری پیٹ کے حد سے زیادہ بھرنے کی علامت ہے۔"
              ],
              "english": [
                "Leaving space for air is beneficial for lung expansion.",
                "It improves blood circulation and oxygen supply to the body.",
                "Difficulty in breathing is a sign of an overfilled stomach."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی پہلو",
        "english": "Spiritual and Training Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں لذت",
              "english": "Delight in Worship"
            },
            "content": {
              "urdu": [
                "خالی پیٹ عبادت میں زیادہ توجہ اور خشوع پیدا ہوتا ہے۔",
                "بھرے ہوئے پیٹ کے ساتھ نماز پڑھنا اور ذکر کرنا بوجھ محسوس ہوتا ہے۔",
                "نفس پر قابو پانے کے لیے کھانے پر قابو پانا پہلا قدم ہے۔"
              ],
              "english": [
                "An empty stomach allows for better focus and humility in worship.",
                "Praying and doing Dhikr feels burdensome with a full stomach.",
                "Controlling food intake is the first step in self-discipline."
              ]
            }
          },
          {
            "title": {
              "urdu": "زہد اور قناعت",
              "english": "Asceticism and Contentment"
            },
            "content": {
              "urdu": [
                "یہ حدیث سادگی اور قناعت پسندی کا درس دیتی ہے۔",
                "مومن کھانے کے لیے نہیں جیتا بلکہ جینے کے لیے کھاتا ہے۔",
                "ضرورت پر اکتفا کرنا تقویٰ کے قریب تر عمل ہے۔"
              ],
              "english": [
                "This Hadith teaches simplicity and contentment in lifestyle.",
                "A believer does not live to eat, but eats to live.",
                "Sufficing on what is necessary is closer to piety (Taqwa)."
              ]
            }
          }
        ]
      }
    }
  ]
}