{
  "hadithId": 821,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/821"],
    "kitabId": 7,
    "inKitabBab": 21,
    "arabicBook": "بلوغ المرام",
    "babId": 62
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده . رواه أحمد (5/267)، وأبو داود (2870)، والترمذي (2120)، وابن ماجه (2713). وصححه الألباني في إرواء الغليل (1655).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام احمد، ابوداؤد، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ اس کے شواہد متعدد صحابہ سے مروی ہیں جن کی بنا پر یہ 'صحیح لغیرہ' کے درجے پر ہے۔",
    "english": "Sahih due to multiple chains. Reported by Ahmad (5/267), Abu Dawud (2870), At-Tirmidhi (2120), and Ibn Majah (2713). Authenticated by Al-Albani in Irwa' al-Ghalil (1655)."
  },
  "importantWords": [
    {
      "arabic": "أَعْطَى",
      "english": "Granted / Bestowed",
      "urdu": "عطا فرمایا"
    },
    {
      "arabic": "ذِي حَقٍّ",
      "english": "Entitled person",
      "urdu": "حقدار"
    },
    {
      "arabic": "وَصِيَّةَ",
      "english": "Will / Bequest",
      "urdu": "وصیت"
    },
    {
      "arabic": "لِوَارِثٍ",
      "english": "For an heir",
      "urdu": "وارث کے لیے"
    },
    {
      "arabic": "يَشَاءَ",
      "english": "Wills / Wishes",
      "urdu": "چاہے / مرضی ہو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ جو شخص وراثت میں حصہ پانے والا ہے، اس کے حق میں الگ سے وصیت کرنا جائز نہیں کیونکہ اللہ نے اس کا حصہ خود مقرر کر دیا ہے۔",
    "english": "This Hadith clarifies that making a will in favor of a legal heir is prohibited because Allah has already designated their specific share in the inheritance."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (2120)",
      "english": "Sunan At-Tirmidhi (2120)"
    },
    {
      "arabic": "سنن أبي داود (2870)",
      "english": "Sunan Abu Dawud (2870)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو أمامة الباهلي",
        "english": "Abu Umamah al-Bahili"
      },
      "slug": "abu-umama-al-bahili"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9j6Q3bU_I8",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وارث کے لیے وصیت کی ممانعت",
        "english": "Prohibition of Bequest to an Heir"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کا مقرر کردہ حصہ",
              "english": "Allah's Designated Share"
            },
            "content": {
              "urdu": [
                "قرآن کریم نے وراثت کے حصے خود تفصیل سے بیان فرما دیے ہیں۔",
                "وارث کے لیے الگ سے وصیت کرنا اللہ کے فیصلے میں مداخلت کے مترادف ہے۔",
                "یہ حکم وراثت کے نظام میں توازن برقرار رکھنے کے لیے دیا گیا ہے۔"
              ],
              "english": [
                "The Quran has detailed the inheritance shares explicitly and clearly.",
                "Making a separate will for an heir amounts to interfering with Allah's decree.",
                "This ruling is given to maintain balance within the inheritance system."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی فساد کا خاتمہ",
              "english": "Prevention of Family Discord"
            },
            "content": {
              "urdu": [
                "اگر وارث کے لیے وصیت جائز ہوتی تو خاندان میں حسد اور نفرت پیدا ہوتی۔",
                "والدین اپنی پسندیدہ اولاد کو زیادہ دے کر دوسروں کی حق تلفی کر سکتے تھے۔",
                "اسلام نے اس ممانعت کے ذریعے وارثوں کے درمیان عدل و انصاف قائم کیا ہے۔"
              ],
              "english": [
                "If bequests to heirs were allowed, it would cause jealousy and hatred within families.",
                "Parents might favor certain children, leading to the deprivation of others' rights.",
                "Islam establishes justice among heirs by enforcing this strict prohibition."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استثناء اور فقہی پہلو",
        "english": "Exception and Juristic Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وارثین کی رضامندی",
              "english": "Consent of Other Heirs"
            },
            "content": {
              "urdu": [
                "اگر تمام وارثین بالغ ہوں اور اپنی مرضی سے کسی وارث کو زائد مال دینے پر راضی ہوں۔",
                "ایسی صورت میں دارقطنی کی روایت کے مطابق وصیت نافذ کی جا سکتی ہے۔",
                "یہ رعایت خاندانی ہم آہنگی اور باہمی ایثار کی بنیاد پر دی گئی ہے۔"
              ],
              "english": [
                "If all legal heirs are adults and voluntarily agree to grant an heir more wealth.",
                "In this specific case, the bequest can be executed as per Ad-Daraqutni's report.",
                "This allowance is based on family harmony and mutual selflessness."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدلِ الہی کا مظہر",
              "english": "Manifestation of Divine Justice"
            },
            "content": {
              "urdu": [
                "انسان اپنی محدود عقل سے وراثت کی تقسیم میں غلطی کر سکتا ہے۔",
                "اللہ تعالیٰ علیم و حکیم ہے، اس نے ہر ایک کی ضرورت کے مطابق حصہ طے کیا۔",
                "شرعی حصوں پر راضی ہونا ایمان کی پختگی اور اللہ پر توکل کی نشانی ہے۔"
              ],
              "english": [
                "Humans can err in distributing inheritance due to limited intellect.",
                "Allah is All-Knowing and All-Wise, fixing shares based on actual needs.",
                "Accepting Shariah shares signifies firm faith and trust in Allah's wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اثرات",
        "english": "Social Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق العباد کی پاسداری",
              "english": "Upholding Human Rights"
            },
            "content": {
              "urdu": [
                "یہ حدیث کسی بھی وارث کو محروم ہونے سے بچاتی ہے۔",
                "وراثت کو محض چند ہاتھوں میں سمٹنے سے روک کر اسے گردش میں لاتی ہے۔",
                "معاشرتی سطح پر یہ قانون غریب وارثوں کے معاشی تحفظ کا ضامن ہے۔"
              ],
              "english": [
                "This Hadith prevents any legal heir from being unjustly deprived.",
                "It keeps wealth in circulation rather than concentrating it in a few hands.",
                "On a societal level, this law guarantees the economic security of poor heirs."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھگڑوں کا مستقل حل",
              "english": "Permanent Solution to Disputes"
            },
            "content": {
              "urdu": [
                "جب مرنے والا اپنی مرضی سے وارثوں کے حصے نہیں بدل سکتا، تو مقدمات کم ہوتے ہیں۔",
                "عدالتوں میں وراثت کے طویل جھگڑوں کا یہ ایک بہترین شرعی حل ہے۔",
                "واضح قانون ہونے کی وجہ سے وارثین کے درمیان تعلقات خوشگوار رہتے ہیں۔"
              ],
              "english": [
                "Since the deceased cannot alter heirs' shares, legal disputes are minimized.",
                "This provides a superior Shariah solution to long-standing court battles.",
                "Due to clear legislation, relationships among heirs remain amicable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی علم کی ضرورت",
              "english": "Need for Shariah Knowledge"
            },
            "content": {
              "urdu": [
                "وصیت لکھنے سے پہلے کسی مستند عالم دین سے مشورہ ضرور کریں۔",
                "اپنی مرضی سے حصوں میں رد و بدل کرنا گناہِ کبیرہ اور ظلم ہے۔",
                "وراثت کے احکام سیکھنا ہر مسلمان پر اس کے معاملات کی حد تک لازم ہے۔"
              ],
              "english": [
                "Always consult an authentic scholar before finalizing a written will.",
                "Arbitrarily altering shares is a major sin and a form of oppression.",
                "Learning inheritance laws is mandatory for Muslims regarding their own affairs."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور امانت داری",
              "english": "Piety and Trustworthiness"
            },
            "content": {
              "urdu": [
                "مال کی محبت میں آ کر کسی کا حق مارنے سے بچیں۔",
                "موت کے بعد کا حساب کتاب یاد رکھ کر ہی مال کی وصیت کریں۔",
                "ایمانداری سے مال کی تقسیم معاشرے میں برکت اور امن لاتی ہے۔"
              ],
              "english": [
                "Avoid usurping someone's right due to the love of worldly wealth.",
                "Make bequests while keeping the accountability after death in mind.",
                "Honest distribution of wealth brings blessings and peace to the society."
              ]
            }
          }
        ]
      }
    }
  ]
}