{
  "hadithId": 927,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1063"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },

  "takhreej": {
    "arabic": "صحيح. رواه أحمد (6/100) وأبو داود (4398) والنسائي (3432) وابن ماجه (2041) والحاكم (2/59) وصححه الحاكم ووافقه الذهبي، وله شواهد من حديث علي بن أبي طالب رضي الله عنه.",
    "urdu": "صحیح۔ اسے امام احمد (6/100)، ابوداؤد (4398)، نسائی (3432) اور ابن ماجہ (2041) نے روایت کیا ہے۔ امام حاکم نے اسے صحیح قرار دیا اور امام ذہبی نے ان کی موافقت کی۔ حضرت علی رضی اللہ عنہ سے بھی اس کے مستند شواہد موجود ہیں۔",
    "english": "Sahih. Reported by Ahmad (6/100), Abu Dawud (4398), An-Nasa'i (3432), and Ibn Majah (2041). Al-Hakim graded it Sahih and Adh-Dhahabi agreed with him. It is also supported by narrations from 'Ali bin Abi Talib (RA)."
  },
  "importantWords": [
    {
      "arabic": "رُفِعَ اَلْقَلَمُ",
      "english": "The pen is lifted",
      "urdu": "قلم اٹھا لیا گیا"
    },
    {
      "arabic": "اَلنَّائِمِ",
      "english": "The sleeper",
      "urdu": "سونا والا"
    },
    {
      "arabic": "اَلصَّغِيرِ",
      "english": "The minor / child",
      "urdu": "بچہ"
    },
    {
      "arabic": "اَلْمَجْنُونِ",
      "english": "The insane",
      "urdu": "پاگل / دیوانہ"
    },
    {
      "arabic": "يَفِيقَ",
      "english": "Recovers / Regains",
      "urdu": "ہوش میں آ جائے"
    }
  ],
  "summary": {
    "urdu": "شریعت ان افراد پر احکام نافذ نہیں کرتی جن کی عقل یا شعور اس وقت بیدار نہ ہو، جیسے سویا ہوا شخص، ناسمجھ بچہ، اور ذہنی معذور انسان۔",
    "english": "Islamic law does not hold individuals accountable when their consciousness or reason is absent, such as during sleep, childhood, or insanity."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4398)",
      "english": "Sunan Abu Dawud (4398)"
    },
    {
      "arabic": "مسند أحمد (24694)",
      "english": "Musnad Ahmad (24694)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شرعی ذمہ داری اور عقل",
        "english": "Legal Responsibility and Intellect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عقل کی اہمیت",
              "english": "Importance of Reason"
            },
            "content": {
              "urdu": [
                "اسلام میں کسی بھی عمل پر گرفت کے لیے عقل اور شعور کا ہونا لازمی شرط ہے۔",
                "قلم اٹھا لیے جانے کا مطلب یہ ہے کہ ان کے نامہ اعمال میں گناہ نہیں لکھے جاتے۔",
                "یہ اصول اللہ تعالیٰ کے عدل اور اس کی رحمت کی بہترین عکاسی کرتا ہے۔"
              ],
              "english": [
                "In Islam, possession of intellect and consciousness is a prerequisite for legal accountability.",
                "The 'lifting of the pen' means that sins are not recorded in their book of deeds.",
                "This principle reflects the perfect justice and mercy of Allah the Almighty."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیوانگی اور شرعی احکام",
              "english": "Insanity and Legal Rulings"
            },
            "content": {
              "urdu": [
                "ذہنی توازن کھو دینے والا شخص اپنے افعال کا خود ذمہ دار نہیں ہوتا۔",
                "اس کی دی ہوئی طلاق یا اس کے کیے ہوئے اقرار شرعی طور پر نافذ نہیں ہوتے۔",
                "یہ رعایت اس وقت تک ہے جب تک وہ مکمل طور پر صحت یاب نہ ہو جائے۔"
              ],
              "english": [
                "A person who has lost mental balance is not responsible for his or her actions.",
                "Divorce issued or confessions made by an insane person are not legally valid.",
                "This concession remains in place until they fully recover their sanity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نیند اور بچپن کی رعایت",
        "english": "Concessions for Sleep and Childhood"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیند کی حالت",
              "english": "State of Sleep"
            },
            "content": {
              "urdu": [
                "نیند کے دوران انسان کا اپنے حواس پر قابو نہیں رہتا، اس لیے وہ معذور سمجھا جاتا ہے۔",
                "اگر کوئی سوتے میں کلام کرے یا کوئی حرکت کرے تو اس پر سزا نہیں دی جائے گی۔",
                "جاگنے کے بعد اسے صرف ان فرائض کی قضا کرنی ہوگی جو نیند میں چھوٹ گئے۔"
              ],
              "english": [
                "During sleep, a person lacks control over their senses and is considered excused.",
                "If one speaks or moves while asleep, they are not subjected to legal penalties.",
                "Upon waking, they are only required to make up for missed obligatory acts like prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچپن اور بلوغت",
              "english": "Childhood and Puberty"
            },
            "content": {
              "urdu": [
                "بچے پر شرعی فرائض اس وقت تک واجب نہیں ہوتے جب تک وہ بالغ نہ ہو جائے۔",
                "والدین کو چاہیے کہ وہ بلوغت سے پہلے ہی بچوں کی اخلاقی تربیت شروع کر دیں۔",
                "بلوغت کے ساتھ ہی انسان اپنے ہر عمل کا اللہ کے سامنے جوابدہ بن جاتا ہے۔"
              ],
              "english": [
                "Islamic obligations are not binding upon a child until he or she reaches puberty.",
                "Parents are encouraged to begin moral and religious training well before puberty.",
                "Upon reaching puberty, an individual becomes personally accountable for every action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور قانونی اطلاق",
        "english": "Juristic and Legal Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طلاق اور بیع و شراء",
              "english": "Divorce and Transactions"
            },
            "content": {
              "urdu": [
                "نابالغ بچے یا مجنون کی طلاق کو تمام فقہاء کے نزدیک باطل قرار دیا گیا ہے۔",
                "اسی طرح ان کے مالی معاملات اور خرید و فروخت بھی سرپرست کی اجازت کے محتاج ہیں۔",
                "یہ قانون کمزور طبقے کے حقوق کے تحفظ کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "Divorce by a minor or an insane person is considered void by all jurists.",
                "Similarly, their financial transactions and trade require the guardian's approval.",
                "This law is established to protect the rights of vulnerable members of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی ادائیگی",
              "english": "Fulfilling Rights of People"
            },
            "content": {
              "urdu": [
                "اگرچہ گناہ نہیں لکھا جاتا، مگر دوسروں کے مالی نقصان کی تلافی ان کے مال سے کی جائے گی۔",
                "مثلاً اگر بچہ کسی کا نقصان کر دے تو اس کا ولی (سرپرست) ہرجانہ ادا کرے گا۔",
                "حقوق العباد میں معافی کے باوجود مالی ذمہ داری ختم نہیں ہوتی۔"
              ],
              "english": [
                "Although sin is not recorded, financial compensation for damages is paid from their wealth.",
                "For example, if a child causes property damage, their guardian must pay the fine.",
                "In rights of people, financial liability remains even if the spiritual sin is excused."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی نظامِ عدل کی حکمت",
        "english": "Wisdom of Islamic Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انفرادی صلاحیت کا لحاظ",
              "english": "Regard for Individual Capacity"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ کسی جان پر اس کی طاقت سے بڑھ کر بوجھ نہیں ڈالتا۔",
                "یہ حدیث اس قرآنی اصول کی عملی تفسیر ہے کہ نادان پر گرفت نہیں کی جاتی۔",
                "اسلام ایک فطری دین ہے جو انسانی کمزوریوں کا مکمل لحاظ رکھتا ہے۔"
              ],
              "english": [
                "Allah does not burden a soul beyond its capacity.",
                "This Hadith is a practical explanation of the Quranic rule that the unaware are not penalized.",
                "Islam is a natural religion that takes full account of human limitations."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی ہمدردی",
              "english": "Social Compassion"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں ذہنی مریضوں اور بچوں کے ساتھ شفقت کا برتاؤ کرنے کا سبق دیتی ہے۔",
                "ان کی غلطیوں پر غصہ کرنے کے بجائے ان کی حالت پر رحم کرنا اسلامی اخلاق ہے۔",
                "معاشرے کو ان طبقوں کی فلاح و بہبود کے لیے خصوصی اقدامات کرنے چاہئیں۔"
              ],
              "english": [
                "This Hadith teaches us to treat the mentally ill and children with compassion.",
                "Showing mercy rather than anger towards their mistakes is true Islamic character.",
                "Society should take special measures for the welfare of these vulnerable groups."
              ]
            }
          }
        ]
      }
    }
  ]
}