{
  "hadithId": 1164,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/41"],
    "kitabId": 12,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأضحية",
    "babId": 94
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1963). ورغم كلام بعض المحدثين في عنعنة أبي الزبير، إلا أن الحديث في أصله صحيح لوروده في صحيح مسلم وتلقي الأمة له بالقبول.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1963) نے اسے اپنی صحیح میں روایت کیا ہے۔ اگرچہ بعض نے اس کی سند پر کلام کیا ہے، مگر مسلم میں ہونے کی وجہ سے یہ حجت ہے۔",
    "english": "Sahih. Reported by Muslim (1963). Despite the discussions of some scholars regarding the chain, being in Sahih Muslim makes it an authoritative proof."
  },
  "importantWords": [
    {
      "arabic": "لَا تَذْبَحُوا",
      "english": "Do not slaughter",
      "urdu": "تم ذبح نہ کرو"
    },
    {
      "arabic": "مُسِنَّةً",
      "english": "Mature animal (two-toothed)",
      "urdu": "دو دانتا جانور / دوندا"
    },
    {
      "arabic": "يَعْسُرَ",
      "english": "Become difficult",
      "urdu": "دشواری ہو / تنگی ہو"
    },
    {
      "arabic": "جَذَعَةً",
      "english": "Six-month-old (lamb)",
      "urdu": "چھ ماہ کا بچہ"
    },
    {
      "arabic": "اَلضَّأْنِ",
      "english": "Sheep",
      "urdu": "دنبہ / بھیڑ"
    }
  ],
  "summary": {
    "urdu": "قربانی کے لیے جانور کا دوندا (پختہ عمر) ہونا ضروری ہے، تاہم بھیڑ یا دنبے کے معاملے میں چھ ماہ کے تندرست بچے کی اجازت دی گئی ہے۔",
    "english": "For sacrifice, the animal must be a Musinnah (mature); however, a healthy six-month-old lamb is permitted in case of difficulty."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1963)",
      "english": "Sahih Muslim (1963)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Q-vF1o7fI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قربانی کے جانور کی عمر",
        "english": "Age of the Sacrificial Animal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنہ (دوندا) کی تعریف",
              "english": "Definition of Musinnah"
            },
            "content": {
              "urdu": [
                "مسنہ سے مراد وہ جانور ہے جس کے سامنے کے دو دانت گر کر نئے آ چکے ہوں۔",
                "بکری میں یہ عمر ایک سال، گائے میں دو سال اور اونٹ میں پانچ سال ہے۔",
                "قربانی کے درست ہونے کے لیے اس عمر کا پایا جانا بنیادی شرط ہے۔"
              ],
              "english": [
                "Musinnah refers to an animal that has grown its two permanent incisor teeth.",
                "This age is one year for goats, two years for cows, and five for camels.",
                "Reaching this age is a fundamental condition for a valid sacrifice."
              ]
            }
          },
          {
            "title": {
              "urdu": "جذعہ کی رخصت",
              "english": "The Concession of Jadha'ah"
            },
            "content": {
              "urdu": [
                "جذعہ وہ دنبہ یا بھیڑ ہے جو دیکھنے میں سال بھر کا لگے مگر چھ ماہ کا ہو۔",
                "یہ رخصت صرف بھیڑ اور دنبے کی نسل کے لیے مخصوص ہے۔",
                "گائے یا بکری کا بچہ چاہے کتنا ہی موٹا ہو، وہ قربانی میں جائز نہیں۔"
              ],
              "english": [
                "Jadha'ah is a lamb that appears like a year-old despite being six months old.",
                "This concession is strictly limited to the species of sheep and lambs.",
                "A young cow or goat, no matter how healthy, is not valid for sacrifice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور حکم",
        "english": "Juristic Details and Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دشواری کا مفہوم",
              "english": "Meaning of Difficulty"
            },
            "content": {
              "urdu": [
                "دشواری سے مراد بازار میں دوندے جانور کا نہ ملنا یا قیمت کا بہت زیادہ ہونا ہے۔",
                "فقہاء کے نزدیک بھیڑ کا جذعہ ہر حال میں قربانی کے لیے جائز ہے۔",
                "نبی ﷺ کی یہ تعلیم امت کے لیے مالی اور عملی آسانی کا باعث ہے۔"
              ],
              "english": [
                "Difficulty implies unavailability of mature animals or exorbitant prices.",
                "According to jurists, a Jadha'ah sheep is valid for sacrifice in any case.",
                "This Prophetic teaching provides financial and practical ease for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمر کے تعین کی اہمیت",
              "english": "Importance of Age Determination"
            },
            "content": {
              "urdu": [
                "قربانی کے لیے صرف جانور کا گوشت یا وزن نہیں بلکہ اس کی عمر دیکھی جاتی ہے۔",
                "دانتوں کا نکلنا عمر کی پختگی کی سب سے مستند ظاہری علامت ہے۔",
                "خریداری کے وقت دانتوں کی پڑتال کرنا سنتِ صحابہ اور شرعی ضرورت ہے۔"
              ],
              "english": [
                "For sacrifice, the animal's age is considered, not just its meat or weight.",
                "The appearance of permanent teeth is the most authentic sign of maturity.",
                "Checking the teeth during purchase is a Sunnah and a legal necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی حکمت اور فلسفہ",
        "english": "Shariah Wisdom and Philosophy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں معیار",
              "english": "Standard in Worship"
            },
            "content": {
              "urdu": [
                "اللہ کی بارگاہ میں بہترین اور مکمل جانور پیش کرنا تقویٰ کی نشانی ہے۔",
                "عمر کا تعین اس بات کو یقینی بناتا ہے کہ قربانی ایک عظیم عمل ہے۔",
                "یہ ضابطہ جانوروں کی افزائشِ نسل اور معاشی توازن کو بھی برقرار رکھتا ہے۔"
              ],
              "english": [
                "Presenting a mature and complete animal is a sign of piety toward Allah.",
                "Age requirements ensure that the sacrifice remains a significant act.",
                "This regulation also maintains livestock breeding and economic balance."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتباعِ سنت کا جذبہ",
              "english": "Spirit of Following Sunnah"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی پسند کے بجائے اللہ اور اس کے رسول کے بتائے طریقے پر چلنا چاہیے۔",
                "اگر چھ ماہ کا بکرا جائز ہوتا تو آپ ﷺ اس کی وضاحت ضرور فرما دیتے۔",
                "سنت کی پابندی ہی دراصل قربانی کی قبولیت کا اصل معیار ہے۔"
              ],
              "english": [
                "A Muslim must follow the Prophetic way rather than personal preference.",
                "If a six-month-old goat were valid, the Prophet (ﷺ) would have stated so.",
                "Adherence to the Sunnah is the true criterion for the sacrifice's acceptance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علمی آگاہی کی ضرورت",
              "english": "Need for Religious Awareness"
            },
            "content": {
              "urdu": [
                "قربانی سے پہلے اس کے احکام سیکھنا ہر صاحبِ استطاعت پر لازم ہے۔",
                "ناسمجھی میں کم عمر جانور کی قربانی ضائع ہو سکتی ہے۔",
                "علماء سے مشورہ کرنا اور مستند کتب سے رجوع کرنا بہترین راستہ ہے۔"
              ],
              "english": [
                "Learning the rules of sacrifice is obligatory for those who have the means.",
                "An invalid sacrifice might occur due to ignorance regarding the animal's age.",
                "Consulting scholars and authentic books is the best way to avoid mistakes."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "جہاں پختہ عمر کا جانور نہ ملے وہاں چھ ماہ کے دنبے کی اجازت اللہ کی رحمت ہے۔",
                "اسلام ایک دینِ فطرت ہے جو انسان کو تنگی میں نہیں ڈالتا۔",
                "ہمیں ان رخصتوں سے فائدہ اٹھانا چاہیے جو اللہ نے عطا فرمائی ہیں۔"
              ],
              "english": [
                "The permission for a six-month-old lamb is a mercy from Allah.",
                "Islam is a natural religion that does not impose undue hardship on people.",
                "We should appreciate and utilize the concessions that Allah has provided."
              ]
            }
          }
        ]
      }
    }
  ]
}