{
  "hadithId": 1254,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/19"],
    "kitabId": 16,
    "inKitabBab": 2,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 103
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5975)، ومسلم (593).",
    "urdu": "صحیح۔ اسے امام بخاری (5975) اور امام مسلم (593) نے اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5975) and Muslim (593)."
  },
  "importantWords": [
    {
      "arabic": "عُقُوقَ",
      "english": "Undutifulness / Disobedience",
      "urdu": "نافرمانی / دل دکھانا"
    },
    {
      "arabic": "وَأْدَ",
      "english": "Burying alive",
      "urdu": "زندہ درگور کرنا"
    },
    {
      "arabic": "مَنْعًا وَهَاتِ",
      "english": "Withholding and Demanding",
      "urdu": "حق نہ دینا اور دوسروں سے مانگنا"
    },
    {
      "arabic": "قِيلَ وَقَالَ",
      "english": "Idle talk / Gossip",
      "urdu": "فضول باتیں / افواہیں"
    },
    {
      "arabic": "إِضَاعَةَ اَلْمَالِ",
      "english": "Wasting wealth",
      "urdu": "مال ضائع کرنا"
    }
  ],
  "summary": {
    "urdu": "یہ جامع حدیث ان سماجی اور اخلاقی برائیوں کی فہرست بیان کرتی ہے جو فرد اور معاشرے کی تباہی کا باعث بنتی ہیں، جیسے والدین کی نافرمانی، اسراف اور فضول گوئی۔",
    "english": "This comprehensive Hadith lists social and moral evils that lead to the destruction of individuals and society, such as disobedience to parents, wastefulness, and idle talk."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأدب، رقم 5975",
      "english": "Sahih al-Bukhari, Book of Manners, No. 5975"
    },
    {
      "arabic": "صحيح مسلم، كتاب الأقضية، رقم 593",
      "english": "Sahih Muslim, Book of Judicial Decisions, No. 593"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "المغيرة بن شعبة",
        "english": "Al-Mughirah bin Shu'bah"
      },
      "slug": "al-mughirah-bin-shubah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرام کردہ افعال کی سنگینی",
        "english": "Severity of Forbidden Acts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماؤں کی نافرمانی",
              "english": "Disobedience to Mothers"
            },
            "content": {
              "urdu": [
                "حدیث میں خاص طور پر 'ماؤں' کا ذکر ان کی مامتا اور کمزوری کی وجہ سے کیا گیا تاکہ ان کے ادب کی تاکید ہو۔",
                "والدین کی نافرمانی شرک کے بعد سب سے بڑا گناہ قرار دیا گیا ہے۔",
                "ماں کے قدموں تلے جنت ہے، اس لیے ان کی خدمت نجات کا ذریعہ ہے۔"
              ],
              "english": [
                "Mothers are specifically mentioned due to their compassion and physical vulnerability to emphasize their respect.",
                "Disobedience to parents is considered the greatest sin after Shirk.",
                "Paradise lies under the feet of mothers; thus, serving them is a means of salvation."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیٹیوں کو زندہ درگور کرنا",
              "english": "Burying Daughters Alive"
            },
            "content": {
              "urdu": [
                "یہ جاہلیت کی ایک قبیح رسم تھی جسے اسلام نے جڑ سے ختم کیا۔",
                "اسلام نے بیٹیوں کو رحمت قرار دیا اور ان کی اچھی تربیت پر جنت کی بشارت دی۔",
                "کسی بھی جاندار کا ناحق قتل اللہ کے غضب کو دعوت دیتا ہے۔"
              ],
              "english": [
                "This was a heinous pre-Islamic practice that Islam completely abolished.",
                "Islam declared daughters a mercy and promised Paradise for their good upbringing.",
                "The unjust killing of any living being invites the wrath of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مالی اور اخلاقی توازن",
        "english": "Financial and Moral Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق کی ادائیگی اور سوال",
              "english": "Paying Rights and Asking"
            },
            "content": {
              "urdu": [
                "'منعاً و ہات' کا مطلب ہے کہ انسان واجب حقوق (زکوٰۃ وغیرہ) نہ دے اور دوسروں کے مال پر نظر رکھے۔",
                "دوسروں کے سامنے بلا ضرورت ہاتھ پھیلانا غیرتِ ایمانی کے خلاف ہے۔",
                "اسلام خودداری اور حلال کمائی کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "'Mana'an wa Hat' means withholding obligatory rights (like Zakat) while greedily seeking others' wealth.",
                "Asking others for help without dire need is against the dignity of faith.",
                "Islam encourages self-reliance and earning a lawful livelihood."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کا ضیاع اور اسراف",
              "english": "Wasting Wealth and Extravagance"
            },
            "content": {
              "urdu": [
                "مال اللہ کی امانت ہے، اسے فضول خرچی یا غیر شرعی کاموں میں اڑانا گناہ ہے۔",
                "اسراف کرنے والوں کو قرآن میں شیطان کا بھائی کہا گیا ہے۔",
                "مال کو معاشی استحکام اور رفاہِ عامہ کے لیے استعمال کرنا چاہیے۔"
              ],
              "english": [
                "Wealth is a trust from Allah; spending it on useless or un-Islamic things is a sin.",
                "Extravagant spenders are called 'brothers of Satan' in the Quran.",
                "Wealth should be used for economic stability and public welfare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زبان کی حفاظت اور فضول گوئی",
        "english": "Guarding the Tongue and Idle Talk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قیل و قال (فضول باتیں)",
              "english": "Idle Talk and Gossip"
            },
            "content": {
              "urdu": [
                "بغیر تحقیق باتیں پھیلانا اور دوسروں کی نجی زندگی پر تبصرے کرنا معاشرتی بگاڑ پیدا کرتا ہے۔",
                "مومن کی پہچان یہ ہے کہ وہ لایعنی (فضول) کاموں اور باتوں سے پرہیز کرے۔",
                "زبان کا غلط استعمال انسان کو جہنم میں لے جانے والے بڑے اسباب میں سے ایک ہے۔"
              ],
              "english": [
                "Spreading rumors without verification and gossiping about private lives causes social disorder.",
                "A believer is recognized by avoiding meaningless and idle speech.",
                "Misuse of the tongue is one of the primary reasons leading people to Hellfire."
              ]
            }
          },
          {
            "title": {
              "urdu": "کثرتِ سوال",
              "english": "Excessive Questioning"
            },
            "content": {
              "urdu": [
                "اس سے مراد وہ غیر ضروری سوالات ہیں جن کا مقصد عمل کے بجائے صرف بحث و تکرار ہو۔",
                "اسی طرح لوگوں کے نجی معاملات کریدنا بھی اس میں شامل ہے۔",
                "دین میں سادگی اور عملی پہلو کو اہمیت دی گئی ہے۔"
              ],
              "english": [
                "This refers to unnecessary questions intended for debate rather than action.",
                "It also includes prying into people's private matters.",
                "Importance is given to simplicity and practical application in religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی اصلاح",
              "english": "Social Reform"
            },
            "content": {
              "urdu": [
                "اگر معاشرے سے یہ چھ برائیاں ختم ہو جائیں تو امن و سکون قائم ہو جائے گا۔",
                "ہمیں اپنی زبان، مال اور رشتوں کے معاملے میں اللہ سے ڈرنا چاہیے۔",
                "نبی کریم ﷺ کی تعلیمات ایک بہترین اور مہذب معاشرہ تشکیل دیتی ہیں۔"
              ],
              "english": [
                "If these six evils are eliminated, peace and tranquility will prevail in society.",
                "We must fear Allah regarding our speech, wealth, and relationships.",
                "The teachings of the Prophet (ﷺ) form the basis of a civilized and ideal society."
              ]
            }
          }
        ]
      }
    }
  ]
}