{
  "hadithId": 1072,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/10/22"],
    "kitabId": 10,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحدود",
    "babId": 87
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2004)، وأبو داود (3711)، والنسائي (5701).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح (2004) میں روایت کیا ہے۔ یہ نبیذ کے حلال ہونے اور اس کے وقتِ استعمال کی حد بیان کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (2004), Abu Dawud (3711), and An-Nasa'i (5701). It outlines the permissibility and time limit for consuming Nabidh."
  },
  "importantWords": [
    {
      "arabic": "يُنْبَذُ",
      "english": "Soaked/Prepared",
      "urdu": "بھگویا جاتا/تیار کیا جاتا"
    },
    {
      "arabic": "الزَّبِيبُ",
      "english": "Raisins",
      "urdu": "منقیٰ/خشک انگور"
    },
    {
      "arabic": "السِّقَاءِ",
      "english": "Water-skin",
      "urdu": "مشکیزہ"
    },
    {
      "arabic": "أَهْرَاقَهُ",
      "english": "Poured it out",
      "urdu": "اسے گرا دیا"
    },
    {
      "arabic": "نَبِيذ",
      "english": "Date/Raisin water",
      "urdu": "پھلوں کا شربت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ پانی میں کھجور یا منقیٰ بھگو کر بنایا گیا مشروب (نبیذ) حلال ہے، بشرطیکہ اس میں نشہ پیدا نہ ہوا ہو۔ اس کی حد عموماً تین دن ہے۔",
    "english": "This Hadith proves that Nabidh (water in which raisins or dates are soaked) is permissible as long as it does not become intoxicating, generally within a three-day limit."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2004)",
      "english": "Sahih Muslim (2004)"
    },
    {
      "arabic": "سنن أبي داود (3711)",
      "english": "Sunan Abi Dawud (3711)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نبیذ کی حقیقت اور حکم",
        "english": "Nature and Ruling of Nabidh"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبیذ کا تعارف",
              "english": "Introduction to Nabidh"
            },
            "content": {
              "urdu": [
                "نبیذ وہ مشروب ہے جو پانی میں کھجور یا منقیٰ بھگو کر تیار کیا جاتا ہے۔",
                "یہ مشروب اپنی اصلی حالت میں میٹھا، فرحت بخش اور حلال ہوتا ہے۔",
                "رسول اللہ ﷺ اسے طاقت اور ذائقے کے لیے استعمال فرمایا کرتے تھے۔"
              ],
              "english": [
                "Nabidh is a beverage prepared by soaking dates or raisins in water.",
                "In its original state, this drink is sweet, refreshing, and permissible (Halal).",
                "The Messenger of Allah (ﷺ) used it for energy and its pleasant taste."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرمت کی وجہ",
              "english": "Reason for Prohibition"
            },
            "content": {
              "urdu": [
                "نبیذ اس وقت حرام ہوتی ہے جب اس میں خمیر اٹھ جائے اور نشہ پیدا ہو۔",
                "اگر مشروب کڑوا ہو جائے یا اس میں جھاگ آنے لگے تو وہ ممنوع ہے۔",
                "شریعت میں اصل ممانعت نشہ آور ہونے کی ہے، بذاتِ خود پھلوں کے پانی کی نہیں۔"
              ],
              "english": [
                "Nabidh becomes forbidden only when it ferments and becomes intoxicating.",
                "If the drink turns bitter or starts foaming, it is prohibited to consume.",
                "Shariah forbids the intoxicant property, not the fruit-infused water itself."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تین دن کی مدت کی حکمت",
        "english": "Wisdom of the Three-Day Limit"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کا تعین",
              "english": "Determination of Time"
            },
            "content": {
              "urdu": [
                "عام حالات میں تین دن تک نبیذ میں نشہ پیدا ہونے کا امکان کم ہوتا ہے۔",
                "رسول اللہ ﷺ احتیاطاً تیسرے دن کے بعد بچا ہوا شربت ضائع کر دیتے تھے۔",
                "یہ عمل امت کو مشتبہ چیزوں سے بچنے کی عملی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Under normal conditions, fermentation is unlikely to occur within three days.",
                "The Prophet (ﷺ) would discard leftovers after the third day as a precaution.",
                "This practice teaches the Ummah to avoid doubtful matters in consumption."
              ]
            }
          },
          {
            "title": {
              "urdu": "موسم کا اثر",
              "english": "Effect of Weather"
            },
            "content": {
              "urdu": [
                "گرم موسم میں خمیر جلد اٹھ سکتا ہے، اس لیے وہاں مدت کم ہو سکتی ہے۔",
                "اصل معیار نشہ ہے؛ اگر ایک دن میں نشہ آ جائے تو وہ پہلے دن ہی حرام ہے۔",
                "تین دن کی مدت ایک عمومی حفاظتی حد (Safety Limit) کے طور پر بتائی گئی۔"
              ],
              "english": [
                "In hot climates, fermentation can happen faster, shortening the safe period.",
                "The actual criterion is intoxication; if it occurs in one day, it is Haram then.",
                "The three-day limit serves as a general safety guideline for the public."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مشتبہ امور سے بچنا",
        "english": "Avoiding Ambiguous Matters"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے ہوئے شربت کو گرانا",
              "english": "Pouring Out the Excess"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا شربت گرا دینا اس لیے تھا کہ کہیں اس میں نشہ نہ شروع ہو گیا ہو۔",
                "اس سے معلوم ہوا کہ مال کا ضیاع اس وقت جائز ہے جب صحت یا ایمان کا خطرہ ہو۔",
                "مشتبہ چیز کو چھوڑ دینا تقویٰ کے اعلیٰ درجات میں سے ایک ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) poured it out to prevent consuming potential intoxicants.",
                "This shows that discarding material is okay when health or faith is at risk.",
                "Leaving doubtful things is considered one of the highest levels of piety."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسروں کو پلانا",
              "english": "Sharing with Others"
            },
            "content": {
              "urdu": [
                "تیسرے دن تک مشروب کو دوسروں میں تقسیم کرنا سخاوت کی علامت ہے۔",
                "اس سے یہ بھی معلوم ہوا کہ جب تک نشہ نہ ہو، دوسروں کو پلانا درست ہے۔",
                "آپ ﷺ اپنی ذات کے لیے بھی اور صحابہ کے لیے بھی حلال و طیب پسند فرماتے تھے۔"
              ],
              "english": [
                "Distributing the drink to others by the third day is a sign of generosity.",
                "It also signifies that sharing is permissible as long as it remains non-intoxicating.",
                "The Prophet (ﷺ) chose only pure and Halal things for himself and his companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے پینے میں اعتدال",
              "english": "Moderation in Food"
            },
            "content": {
              "urdu": [
                "طیب اور لذیذ اشیاء کا استعمال سنتِ نبوی کے خلاف نہیں ہے۔",
                "شریعت نے صرف ان چیزوں سے روکا ہے جو عقل اور جسم کو نقصان پہنچائیں۔",
                "گھریلو مشروبات تیار کرتے وقت صفائی اور وقت کا خیال رکھنا ضروری ہے۔"
              ],
              "english": [
                "Using pure and delicious items is not contrary to the Prophetic Sunnah.",
                "Shariah only prohibits things that harm the intellect or the body.",
                "It is essential to maintain hygiene and timing when preparing home-made drinks."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "نبیذ کا استعمال کرنا اور اس کی حدود کا خیال رکھنا اتباعِ سنت ہے۔",
                "موجودہ دور کے کیمیکل ملے مشروبات کے مقابلے میں قدرتی نبیذ بہتر ہے۔",
                "ہمیں ہر معاملے میں رسول اللہ ﷺ کے بتائے ہوئے طریقوں کو اپنانا چاہیے۔"
              ],
              "english": [
                "Using Nabidh while observing its limits is an act of following the Sunnah.",
                "Natural Nabidh is superior to modern chemical-laden soft drinks.",
                "We should strive to adopt the methods prescribed by the Prophet (ﷺ) in all affairs."
              ]
            }
          }
        ]
      }
    }
  ]
}