{
  "hadithId": 47,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 19 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب الفصل بين المضمضة والاستنشاق",
    "babId": 4
  },

  "takhreej": {
    "arabic": "ضعيف.  رواه أبو داود (139) . ",
    "urdu": "ضعیف (درجہ)۔ اسے ابوداؤد (139) نے روایت کیا ہے۔",
    "english": "Da'īf (Weak). Narrated by Abū Dāwūd (139)."
  },
  "importantWords": [
    {
      "arabic": "يَفْصِلُ",
      "english": "Separated/used separate (water)",
      "urdu": "الگ الگ (پانی لیتے)"
    },
    {
      "arabic": "اَلْمَضْمَضَةِ",
      "english": "Rinsing the mouth (Maḍmaḍah)",
      "urdu": "کلی"
    },
    {
      "arabic": "الِاسْتِنْشَاقِ",
      "english": "Rinsing the nose (Istinshāq)",
      "urdu": "ناک"
    },
    {
      "arabic": "أَبِي دَاوُدَ",
      "english": "Abū Dāwūd",
      "urdu": "ابوداؤد"
    },
    {
      "arabic": "ضَعِيف ٍ",
      "english": "Weak (chain)",
      "urdu": "ضعیف (سند)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث وضو میں کلی کرنے اور ناک صاف کرنے کے لیے الگ الگ پانی لینے کی اجازت کو بیان کرتی ہے، لیکن محدثین نے اس روایت کی سند کو کمزور قرار دیا ہے جبکہ زیادہ صحیح طریقہ ایک ہی پانی سے دونوں عمل کو جمع کرنا ہے۔",
    "english": "This Hadith suggests the permissibility of using separate scoops of water for rinsing the mouth and nose during Wudu. However, Hadith scholars have graded the narration as weak, with the more established Sunnah being to combine both acts with one scoop of water."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 139",
      "english": "Sunan Abī Dāwūd, The Book of Purification, Hadith 139"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ أَبِيهِ عَنْ جَدِّهِ",
        "english": "Ṭalḥah ibn Muṣarrif, from his father, from his grandfather"
      },
      "slug": "talhah-ibn-musarrif"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-25-separate-mouth-nose-water",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'īf (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کلی اور ناک میں پانی لینے کا حکم",
        "english": "The Ruling on Water for Mouth and Nose"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علیحدگی کی روایت اور اس کی قوت",
              "english": "Narration of Separation and Its Strength"
            },
            "content": {
              "urdu": [
                "یہ حدیث بیان کرتی ہے کہ نبی اکرم ﷺ نے کلی (مضمضہ) اور ناک میں پانی چڑھانے (استنشاق) کے لیے **الگ الگ** پانی لیا، جو عمل میں علیحدگی کو ظاہر کرتا ہے۔",
                "محدثین نے اس روایت کی سند کو **ضعیف** قرار دیا ہے، اس لیے اس پر شرعی حکم کی بنیاد نہیں رکھی جا سکتی، خاص طور پر جب اس کے خلاف قوی شواہد موجود ہوں۔",
                "اگرچہ یہ عمل (علیحدگی) جائز ہو سکتا ہے، لیکن افضل اور ثابت شدہ طریقہ ایک ہی پانی سے دونوں عمل کو انجام دینا ہے۔"
              ],
              "english": [
                "This Hadith suggests that the Prophet (ﷺ) used **separate scoops of water** for rinsing his mouth (Maḍmaḍah) and nose (Istinshāq), indicating separation in the act.",
                "Scholars of Hadith have graded the chain of this narration as **weak (Da'īf)**, meaning it cannot be the basis for a definitive legal ruling, especially when stronger evidence exists to the contrary.",
                "While performing the actions separately might be permissible, the preferred and more established method is to combine both actions using a single scoop of water."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحیح سنت: جمع کرنا",
              "english": "The Authentic Sunnah: Combination"
            },
            "content": {
              "urdu": [
                "دوسری **صحیح** احادیث (جیسے عبداللہ بن زیدؓ کی روایت) سے ثابت ہے کہ نبی ﷺ کلی اور ناک میں پانی چڑھانے کا عمل **ایک ہی چلو** سے کیا کرتے تھے۔",
                "ایک ہی پانی سے دونوں عمل کو جمع کرنا وقت اور پانی کی بچت کے لحاظ سے بھی زیادہ افضل اور آسانی والا طریقہ ہے۔",
                "جمہور فقہاء کے نزدیک ایک ہی پانی سے کلی اور استنشاق کرنا وضو کی سنت ہے، جو کمزور روایت پر قوی روایت کی ترجیح کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Other **authentic** Ahadith (like the narration of Abdullah ibn Zaid) prove that the Prophet (ﷺ) used to combine rinsing the mouth and nose with **a single scoop of water**.",
                "Combining the two actions with the same water is considered the more virtuous and easier method, saving both time and water.",
                "According to the majority of jurists, combining Maḍmaḍah and Istinshāq with one scoop of water is the Sunnah of Wudu, demonstrating the preference for stronger narrations over weak ones."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کے ضعف اور احتیاط کا اصول",
        "english": "Chain Weakness and Precautionary Principle"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعف کی نوعیت",
              "english": "The Nature of the Weakness"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد نے خود اس حدیث کی سند کو ضعیف قرار دیا، جو اس بات کی علامت ہے کہ اس کے راویوں میں ضعف موجود ہے اور یہ دلیل کے طور پر مضبوط نہیں۔",
                "اگرچہ وضو میں سادگی اور رخصت کا اصول موجود ہے، لیکن عبادات کے ارکان کی کیفیت ہمیشہ **صحیح** احادیث سے ہی ثابت کی جاتی ہے۔",
                "اس لیے اس حدیث کو عمل کے بجائے محض علم میں رکھا جاتا ہے اور عمل کے لیے قوی احادیث کو ترجیح دی جاتی ہے۔"
              ],
              "english": [
                "Imām Abū Dāwūd himself graded the chain of this Hadith as weak, indicating flaws in its narrators and rendering it insufficient as strong evidence.",
                "While Islam emphasizes ease, the procedure for the core acts of worship must always be established using **authentic (Sahih)** narrations.",
                "Therefore, this Hadith is held for informational purposes only, and stronger Ahadith are preferred for practical implementation of the Wudu procedure."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت میں احتیاط",
              "english": "Precaution in Purification"
            },
            "content": {
              "urdu": [
                "طہارت چونکہ نماز کی قبولیت کے لیے بنیاد ہے، اس لیے ایسے عمل کو اختیار کرنا زیادہ بہتر ہے جو سب سے زیادہ مستند اور قوی دلائل سے ثابت ہو۔",
                "ایک ہی پانی سے کلی اور ناک صاف کرنا (جمع کرنا) ان روایات سے ثابت ہے جو صحیحین (بخاری و مسلم) میں موجود ہیں، جو اعلیٰ ترین صحت کی دلیل ہیں۔",
                "اس لیے مسلمان کو چاہیے کہ وہ کمزور روایت پر عمل کرنے کے بجائے متفق علیہ اور صحیح احادیث میں بیان کردہ طریقے کو اپنائے۔"
              ],
              "english": [
                "Since purity is the foundation for accepting prayer, it is better to adopt the practice supported by the strongest and most authentic evidence.",
                "Combining Maḍmaḍah and Istinshāq with one scoop of water is proven by narrations found in Al-Ṣaḥīḥayn (Bukhari and Muslim), which are the highest authority.",
                "Therefore, a Muslim should prefer the method established by authentic and agreed-upon Ahadith over those supported only by weak narrations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت اور کمال کی پیروی",
        "english": "Following the Sunnah and Perfection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کامل سنت پر عمل",
              "english": "Adherence to the Complete Sunnah"
            },
            "content": {
              "urdu": [
                "وضو کے عمل کو مکمل طور پر نبی ﷺ کی سنت کے مطابق ادا کرنا ایک مومن کے لیے اجر اور برکت کا باعث ہے۔",
                "کلی اور ناک کے لیے ایک ہی چلو کا استعمال کرنا اسباغ الوضوء (وضو کو اچھی طرح پورا کرنا) کے اصول کے تحت آتا ہے، جو ایک قوی سنت ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی عبادات میں ہر ممکن حد تک کامل طریقہ اختیار کرے، جو صحیح احادیث سے ثابت ہے۔"
              ],
              "english": [
                "Performing the act of Wudu fully in accordance with the Prophet's Sunnah brings reward and blessing to the believer.",
                "Using a single scoop for the mouth and nose falls under the principle of Isbāgh al-Wudu (performing Wudu thoroughly), which is a strong Sunnah.",
                "A Muslim should strive to adopt the most complete method in their acts of worship, as established by authentic Ahadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائمی عمل کی رہنمائی",
              "english": "Guidance for Consistent Practice"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس بات کی دلیل ہے کہ وضو کے عمل میں ایسا طریقہ اختیار کیا جائے جو روزانہ پانچ وقت کی نمازوں کے لیے مستقل بنیادوں پر آسان ہو۔",
                "ایک ہی پانی سے دونوں کام کرنا زیادہ آسان اور پانی کی بچت والا طریقہ ہے، جو نبی ﷺ کی تعلیمات کا مقصد ہے۔",
                "اس لیے جمع کرنے کے طریقے پر عمل کرنا اس بات کا بھی ثبوت ہے کہ مسلمان نبوی رہنمائی کو زندگی کے عملی معاملات میں لاگو کرتے ہیں۔"
              ],
              "english": [
                "This Hadith provides guidance on adopting a Wudu method that is easy to sustain consistently for the five daily prayers.",
                "Combining the two acts with one scoop is simpler and conserves water, which aligns with the overall purpose of the Prophet's teachings.",
                "Therefore, practicing the combined method also proves that Muslims apply the Prophetic guidance to the practical affairs of daily life."
              ]
            }
          }
        ]
      }
    }
  ]
}
