{
  "hadithId": 1211,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2674"],
    "kitabId": 14,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 99
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- عَرَضَ عَلَى قَوْمٍ اَلْيَمِينَ, فَأَسْرَعُوا, فَأَمَرَ أَنْ يُسْهَمَ بَيْنَهُمْ فِي اَلْيَمِينِ, أَيُّهُمْ يَحْلِفُ } رَوَاهُ اَلْبُخَارِيُّ",
    "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک قوم پر قسم پیش کی تو وہ قسم کھانے پر فوراً تیار ہو گئے تو آپ صلی اللہ علیہ وسلم نے حکم فرمایا کہ ”ان لوگوں میں قرعہ اندازی کی جائے کہ کون ان میں سے قسم کھائے گا۔“ (بخاری)",
    "english": "Narrated Abu Hurairah (RA): The Prophet (ﷺ) offered an oath to a group of people, and they all hurried to take it. He then ordered that lots be cast among them to decide which of them should take the oath."
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2674)، وأبو داود (3616)، والنسائي (5415).",
    "urdu": "یہ صحیح حدیث ہے، اسے امام بخاری نے اپنی صحیح (2674) میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2674), Abu Dawud (3616), and An-Nasa'i (5415)."
  },
  "importantWords": [
    {
      "arabic": "عَرَضَ",
      "english": "Offered/Presented",
      "urdu": "پیش کیا"
    },
    {
      "arabic": "الْيَمِينَ",
      "english": "The Oath",
      "urdu": "قسم"
    },
    {
      "arabic": "فَأَسْرَعُوا",
      "english": "They hurried",
      "urdu": "وہ تیزی سے بڑھے"
    },
    {
      "arabic": "يُسْهَمَ",
      "english": "Cast lots",
      "urdu": "قرعہ اندازی کرنا"
    },
    {
      "arabic": "يَحْلِفُ",
      "english": "He swears",
      "urdu": "وہ حلف اٹھائے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ جب ایک سے زیادہ لوگ کسی معاملے میں قسم کھانے کے دعویدار ہوں، تو قرعہ اندازی کے ذریعے فیصلہ کیا جائے گا۔",
    "english": "This Hadith establishes that when multiple individuals are eager to take an oath for a single claim, casting lots is the legal way to decide."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2674)",
      "english": "Reported by Al-Bukhari (2674)"
    },
    {
      "arabic": "رواه أبو داود (3616)",
      "english": "Reported by Abu Dawud (3616)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرعہ اندازی کی شرعی حیثیت",
        "english": "Sharia Status of Casting Lots"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نزاع کے خاتمے کا ذریعہ",
              "english": "A Means to End Conflict"
            },
            "content": {
              "urdu": [
                "جب حقوق یا فرائض میں ایک سے زیادہ لوگ برابر ہوں تو قرعہ اندازی جائز ہے۔",
                "یہ طریقہ کار کسی کی دل آزاری کے بغیر منصفانہ فیصلہ کرنے میں مدد دیتا ہے۔",
                "نبی کریم ﷺ نے مختلف مواقع پر قرعہ اندازی کے ذریعے تنازعات حل کیے۔"
              ],
              "english": [
                "Casting lots is permissible when multiple people have equal rights or duties.",
                "This method helps in making a fair decision without causing resentment.",
                "The Prophet (ﷺ) used lots on various occasions to resolve disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کی روح",
              "english": "The Spirit of Justice"
            },
            "content": {
              "urdu": [
                "قرعہ اندازی جانبداری کے الزامات کو ختم کرنے کا بہترین طریقہ ہے۔",
                "اس سے یہ واضح ہوتا ہے کہ فیصلہ کسی انسانی پسند و ناپسند پر مبنی نہیں۔",
                "اسلامی نظامِ عدل میں قرعہ اندازی کو ایک ثانوی معاون ذریعے کے طور پر مانا گیا ہے۔"
              ],
              "english": [
                "Casting lots is the best way to eliminate allegations of bias.",
                "It clarifies that the decision is not based on human preference.",
                "In the Islamic judicial system, casting lots is a recognized secondary tool."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قسم اور اس کی اہمیت",
        "english": "The Oath and Its Importance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچی قسم کی ذمہ داری",
              "english": "Responsibility of a True Oath"
            },
            "content": {
              "urdu": [
                "اللہ کے نام پر قسم کھانا ایک بہت بڑا عہد اور ذمہ داری ہے۔",
                "حدیث میں لوگوں کا قسم کی طرف لپکنا ان کے اعتماد کو ظاہر کرتا ہے۔",
                "حاکم کو چاہیے کہ وہ قسم دلانے سے پہلے لوگوں کو اس کی سنگینی بتائے۔"
              ],
              "english": [
                "Taking an oath in Allah's name is a massive commitment and responsibility.",
                "The people's eagerness to take the oath shows their confidence in their claim.",
                "A ruler should explain the gravity of an oath before administering it."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھوٹی قسم سے بچنا",
              "english": "Avoiding False Oaths"
            },
            "content": {
              "urdu": [
                "جھوٹی قسم کھانا گناہِ کبیرہ ہے جسے 'یمینِ غموس' کہا جاتا ہے۔",
                "قرعہ اندازی اس لیے کی گئی تاکہ حقدار ہی قسم کھائے۔",
                "انصاف کا تقاضا ہے کہ کسی کا حق مارنے کے لیے قسم کا استعمال نہ ہو۔"
              ],
              "english": [
                "Taking a false oath is a major sin known as 'Al-Yamin al-Ghamus'.",
                "The draw was made to ensure only the relevant party takes the oath.",
                "Justice requires that an oath is not used to usurp someone's rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و سماجی اسباق",
        "english": "Juristic and Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برابری کا اصول",
              "english": "Principle of Equality"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں تمام فریقین کو برابر سمجھا جاتا ہے۔",
                "جب دلائل برابر ہوں تو قرعہ اندازی بہترین تصفیہ ہے۔",
                "یہ اصول معاشرے میں افراتفری اور جھگڑوں کو روکتا ہے۔"
              ],
              "english": [
                "In Islamic law, all parties are treated as equals.",
                "When arguments are equal, casting lots is the best settlement.",
                "This principle prevents chaos and persistent fighting in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی حکمت",
              "english": "The Wisdom of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے عملی طور پر تصفیہ کے جدید اور سادہ طریقے سکھائے۔",
                "حکمرانوں کے لیے اس میں یہ سبق ہے کہ وہ معاملات میں لچک پیدا کریں۔",
                "تنازعات کو طول دینے کے بجائے فوری اور منصفانہ حل تلاش کریں۔"
              ],
              "english": [
                "The Prophet (ﷺ) practically taught modern and simple methods of settlement.",
                "There is a lesson for rulers to be flexible in handling affairs.",
                "Search for immediate and fair solutions rather than prolonging disputes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزمرہ کے معاملات میں قرعہ",
              "english": "Lots in Daily Matters"
            },
            "content": {
              "urdu": [
                "گھریلو یا دفتری معاملات میں جہاں ترجیح دینا مشکل ہو، قرعہ ڈالیں۔",
                "اس سے کسی کی دل شکنی نہیں ہوتی اور سب مطمئن رہتے ہیں۔",
                "یہ طریقہ باہمی محبت اور شفافیت کو برقرار رکھنے میں مددگار ہے۔"
              ],
              "english": [
                "Use lots in domestic or office matters where prioritizing is difficult.",
                "This prevents hurt feelings and keeps everyone satisfied.",
                "This method helps maintain mutual love and transparency."
              ]
            }
          },
          {
            "title": {
              "urdu": "فیصلہ سازی میں تقویٰ",
              "english": "Piety in Decision Making"
            },
            "content": {
              "urdu": [
                "کوئی بھی فیصلہ کرتے وقت ہمیشہ اللہ کا خوف دل میں رکھیں۔",
                "اپنی پسند و ناپسند کو عدل کے راستے میں رکاوٹ نہ بننے دیں۔",
                "سچائی اور دیانت داری کو اپنا شعار بنانا ہی مومن کا کام ہے۔"
              ],
              "english": [
                "Always keep the fear of Allah in mind when making any decision.",
                "Do not let personal likes or dislikes hinder the path of justice.",
                "Adopting truth and integrity as a standard is the duty of a believer."
              ]
            }
          }
        ]
      }
    }
  ]
}