{
  "hadithId": 804,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/804"],
    "kitabId": 7,
    "inKitabBab": 19,
    "arabicBook": "بلوغ المرام",
    "babId": 60
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه أبو داود ( 3804 )، والترمذي (1563) وصححه، وأحمد (4/131).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (3804)، ترمذی اور احمد نے روایت کیا ہے۔ اس میں جانوروں کے ساتھ لقطہ کے احکام کا ذکر ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3804), At-Tirmidhi (1563) who authenticated it, and Ahmad (4/131)."
  },
  "importantWords": [
    {
      "arabic": "ذُو نَابٍ",
      "english": "Fanged beast",
      "urdu": "کچلیوں والا (درندہ)"
    },
    {
      "arabic": "السِّبَاعِ",
      "english": "Beasts of prey",
      "urdu": "درندے"
    },
    {
      "arabic": "الْحِمَارُ الْأَهْلِيُّ",
      "english": "Domestic donkey",
      "urdu": "گھریلو گدھا"
    },
    {
      "arabic": "مُعَاهَدٍ",
      "english": "Non-Muslim under covenant",
      "urdu": "امن والا غیر مسلم"
    },
    {
      "arabic": "يَسْتَغْنِيَ",
      "english": "Has no need",
      "urdu": "بے نیاز ہو جائے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں کچلی والے درندوں اور گھریلو گدھوں کی حرمت کے ساتھ ساتھ غیر مسلم شہریوں (معاہدین) کے مال و متاع کے تحفظ کی تاکید کی گئی ہے۔",
    "english": "This Hadith forbids eating fanged beasts and domestic donkeys, while emphasizing the protection of the property of non-Muslim citizens living under covenant."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3804)",
      "english": "Sunan Abu Dawud (3804)"
    },
    {
      "arabic": "سنن الترمذي (1563)",
      "english": "Sunan At-Tirmidhi (1563)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "المقدام بن معدي كرب",
        "english": "Al-Miqdam bin Ma'di Karib"
      },
      "slug": "al-miqdam-bin-madi-karib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیر مسلموں کے حقوق کا تحفظ",
        "english": "Protection of Non-Muslim Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہد کا مال",
              "english": "Property of a Mu'ahid"
            },
            "content": {
              "urdu": [
                "اسلام غیر مسلم شہریوں کے جان و مال کے تحفظ کی مکمل ضمانت دیتا ہے۔",
                "معاہد کی گری پڑی چیز کو بغیر اعلان کے اپنی ملکیت بنانا قطعاً حرام ہے۔",
                "یہ حکم ظاہر کرتا ہے کہ اسلامی ریاست میں سب کے حقوق برابر ہیں۔"
              ],
              "english": [
                "Islam provides full guarantees for the life and property of non-Muslim citizens.",
                "It is strictly forbidden to claim the lost property of a Mu'ahid without announcement.",
                "This ruling demonstrates that rights are equal for all within an Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "استثناء کی صورت",
              "english": "The Exception Clause"
            },
            "content": {
              "urdu": [
                "اگر مالک خود اس چیز سے دستبردار ہو جائے تو وہ حلال ہو جاتی ہے۔",
                "معمولی اشیاء جن کی مالک کو پرواہ نہ ہو، وہ اس حکم سے باہر ہیں۔",
                "رضامندی اور بے نیازی کا علم ہونا اس کے استعمال کے لیے ضروری ہے۔"
              ],
              "english": [
                "The property becomes permissible only if the owner voluntarily waives their right.",
                "Trivial items that the owner does not care about are excluded from this severity.",
                "Knowledge of the owner's consent or lack of need is essential for usage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خوراک کے شرعی احکام",
        "english": "Dietary Shariah Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "درندوں کی حرمت",
              "english": "Prohibition of Beasts of Prey"
            },
            "content": {
              "urdu": [
                "ہر وہ جانور جو کچلی کے دانت سے شکار کرتا ہے، اس کا گوشت حرام ہے۔",
                "اس میں شیر، چیتا، بھیڑیا اور کتا وغیرہ شامل ہیں۔",
                "ان جانوروں کی خوراک اور ان کی طبیعت میں موجود درندگی انسانی صحت کے لیے نقصان دہ ہے۔"
              ],
              "english": [
                "Every animal that hunts using its fangs is forbidden for consumption.",
                "This includes lions, leopards, wolves, dogs, and similar beasts.",
                "The predatory nature and diet of these animals are considered harmful to human health."
              ]
            }
          },
          {
            "title": {
              "urdu": "گھریلو گدھے کا حکم",
              "english": "Ruling on Domestic Donkeys"
            },
            "content": {
              "urdu": [
                "گھریلو گدھا خیبر کے موقع پر قطعی طور پر حرام قرار دیا گیا تھا۔",
                "جنگلی گدھا (گورخر) حلال ہے لیکن پالتو گدھے کا گوشت کھانا جائز نہیں۔",
                "اس حکم کی پابندی ہر مسلمان پر لازم ہے کیونکہ یہ صریح نص سے ثابت ہے۔"
              ],
              "english": [
                "Domestic donkeys were declared strictly forbidden during the expedition of Khaybar.",
                "Wild donkeys (zebras) are halal, but domestic ones are not permissible to eat.",
                "Adherence to this ruling is mandatory as it is established by clear prophetic text."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدل اور سماجی انصاف",
        "english": "Justice and Social Equity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلامی نظامِ عدل",
              "english": "Islamic System of Justice"
            },
            "content": {
              "urdu": [
                "حدیث میں لقطہ کے ذکر سے واضح ہے کہ اسلام چھوٹی چیزوں میں بھی انصاف چاہتا ہے۔",
                "کسی کے مال پر غاصبانہ قبضہ کرنا معاشرتی بگاڑ کا سبب بنتا ہے۔",
                "عدل و انصاف ہی وہ بنیاد ہے جس پر اسلامی معاشرہ قائم ہوتا ہے۔"
              ],
              "english": [
                "The mention of Luqatah shows that Islam demands justice even in small matters.",
                "Usurping someone's property leads to social corruption and instability.",
                "Justice and equity are the foundations upon which an Islamic society is built."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت داری کی تربیت",
              "english": "Training in Trustworthiness"
            },
            "content": {
              "urdu": [
                "دوسرے کا مال ملنے پر اسے امانت سمجھنا ایمان کا تقاضا ہے۔",
                "خواہ وہ مسلمان کا ہو یا غیر مسلم کا، امانت کا حق برابر ہے۔",
                "یہ تعلیم مسلمانوں کو عالمی سطح پر دیانت دار قوم بناتی ہے۔"
              ],
              "english": [
                "Treating found property as a trust is a requirement of one's faith.",
                "Whether it belongs to a Muslim or non-Muslim, the right of trust is the same.",
                "This teaching establishes Muslims as an honest nation on a global scale."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال و حرام کی تمیز",
              "english": "Distinction of Halal and Haram"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کو اپنی خوراک اور کمائی میں حلال و حرام کا فرق کرنا چاہیے۔",
                "مشتبہ اور حرام چیزوں سے بچنا روحانی پاکیزگی کے لیے ضروری ہے۔",
                "حدیث ہمیں زندگی کے ہر شعبے میں حدود اللہ کی پابندی سکھاتی ہے۔"
              ],
              "english": [
                "A Muslim must distinguish between Halal and Haram in food and earnings.",
                "Avoiding doubtful and forbidden things is essential for spiritual purity.",
                "The Hadith teaches us to observe the limits of Allah in all aspects of life."
              ]
            }
          },
          {
            "title": {
              "urdu": "اقلیتوں کے ساتھ سلوک",
              "english": "Treatment of Minorities"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست میں بسنے والے غیر مسلموں کے حقوق کا احترام واجب ہے۔",
                "ان کے حقوق کی پامالی اللہ اور اس کے رسول کی ناراضگی کا باعث ہے۔",
                "یہ حدیث بین المذاہب رواداری اور حقوق کی ادائیگی کا بہترین درس ہے۔"
              ],
              "english": [
                "Respecting the rights of non-Muslims in an Islamic state is obligatory.",
                "Violating their rights causes the displeasure of Allah and His Messenger.",
                "This Hadith is a prime example of interfaith tolerance and fulfillment of rights."
              ]
            }
          }
        ]
      }
    }
  ]
}