{
  "hadithId": 393,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-393"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "حسن.‏ رواه ابن ماجه (1293)‏، وأحمد (3/40)‏، والحاكم (1/297)‏، والدارقطني (2/52).‏ وهذا الحديث يوضح أن نفي الصلاة في حديث ابن عباس كان متعلقاً بالمصلى لا بمطلق الصلاة في ذلك اليوم.",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابن ماجہ (1293) اور احمد نے روایت کیا ہے۔ یہ حدیث ابن عباس رضی اللہ عنہ کی سابقہ روایت کی وضاحت کرتی ہے کہ ممانعت صرف عید گاہ کی حد تک تھی، گھر میں نفل پڑھنا ثابت ہے۔",
    "english": "Hasan (Good). Reported by Ibn Majah (1293), Ahmad, and Al-Hakim. This narration clarifies that the previous negation in Ibn 'Abbas's Hadith referred specifically to the prayer ground (Musalla), not to voluntary prayers offered at home later."
  },
  "importantWords": [
    {
      "arabic": "لَا يُصَلِّي",
      "english": "Did not pray",
      "urdu": "نماز نہیں پڑھتے تھے"
    },
    {
      "arabic": "قَبْلَ اَلْعِيدِ",
      "english": "Before the Eid",
      "urdu": "عید سے پہلے"
    },
    {
      "arabic": "شَيْئًا",
      "english": "Anything",
      "urdu": "کچھ بھی"
    },
    {
      "arabic": "رَجَعَ",
      "english": "Returned",
      "urdu": "واپس آئے"
    },
    {
      "arabic": "مَنْزِلِهِ",
      "english": "His house",
      "urdu": "ان کا گھر"
    },
    {
      "arabic": "رَكْعَتَيْنِ",
      "english": "Two units of prayer",
      "urdu": "دو رکعتیں"
    }
  ],
  "summary": {
    "urdu": "عید گاہ میں عید کی نماز سے پہلے کوئی نفل نہیں، لیکن گھر واپسی پر دو رکعت نفل پڑھنا رسول اللہ ﷺ کی سنت ہے۔",
    "english": "There are no voluntary prayers before Eid at the Musalla, but praying two units upon returning home is a confirmed Sunnah of the Prophet (ﷺ)."
  },
  "references": [
    {
      "arabic": "سنن ابن ماجه (1293)",
      "english": "Sunan Ibn Majah (1293)"
    },
    {
      "arabic": "مسند أحمد (11375)",
      "english": "Musnad Ahmad (11375)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-sa-id-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=sunnah+after+returning+from+eid+prayer+urdu",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عید گاہ اور گھر کے احکام",
        "english": "Rulings of Musalla and Home"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقامِ نماز کی اہمیت",
              "english": "Importance of the Location"
            },
            "content": {
              "urdu": [
                "عید گاہ میں پہنچ کر براہِ راست عید کی نماز کا انتظار کرنا سنت ہے۔",
                "وہاں کسی قسم کے تحیۃ المسجد یا نفل پڑھنا ثابت نہیں ہے۔",
                "یہ ممانعت عید کی نماز کی انفرادیت کو برقرار رکھنے کے لیے ہے۔"
              ],
              "english": [
                "It is Sunnah to wait directly for the Eid prayer upon reaching the Musalla.",
                "Offering Tahiyyat al-Masjid or voluntary prayers there is not established.",
                "This restriction maintains the unique identity of the Eid prayer itself."
              ]
            }
          },
          {
            "title": {
              "urdu": "گھر میں نفل کی مشروعیت",
              "english": "Permissibility of Prayer at Home"
            },
            "content": {
              "urdu": [
                "گھر واپس آکر دو رکعت پڑھنا رسول اللہ ﷺ کا اپنا معمول تھا۔",
                "یہ نفل نماز عید کی قبولیت پر اللہ کا شکر ادا کرنے کا ذریعہ ہے۔",
                "اس سے معلوم ہوتا ہے کہ عید کے دن نفل پڑھنا مطلقاً ممنوع نہیں ہے۔"
              ],
              "english": [
                "Offering two units upon returning home was the Prophet's (ﷺ) regular practice.",
                "This prayer serves as a means of thanking Allah for the completion of Eid.",
                "It indicates that voluntary prayers are not absolutely forbidden on Eid day."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعارض کا حل",
        "english": "Resolving Apparent Contradictions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایات میں تطبیق",
              "english": "Reconciliation of Narrations"
            },
            "content": {
              "urdu": [
                "ابن عباس کی روایت عید گاہ میں نفل کی ممانعت کو بیان کرتی ہے۔",
                "ابوسعید خدری کی یہ روایت گھر میں نفل کی ادائیگی کو ثابت کرتی ہے۔",
                "دونوں روایات میں کوئی تضاد نہیں بلکہ یہ مختلف مقامات کے احکام ہیں۔"
              ],
              "english": [
                "The narration of Ibn Abbas denies voluntary prayers specifically at the Musalla.",
                "This narration by Abu Sa'id confirms the performance of prayer at home.",
                "There is no contradiction, as they refer to rulings for different locations."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی بصیرت",
              "english": "Juristic Insight"
            },
            "content": {
              "urdu": [
                "محدثین نے ان دونوں احادیث کو جمع کر کے واضح اصول بیان کیا ہے۔",
                "عید گاہ میں بیٹھ کر ذکر و اذکار اور تکبیرات میں وقت گزارنا چاہیے۔",
                "گھر آ کر عبادت کا سلسلہ جاری رکھنا مستحب اور پسندیدہ عمل ہے۔"
              ],
              "english": [
                "Hadith scholars reconciled these reports to establish a clear principle.",
                "One should spend time in the Musalla with remembrance and Takbirat.",
                "Continuing worship after returning home is a recommended and beloved act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شکر گزاری اور بندگی",
        "english": "Gratitude and Devotion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نعمت پر شکر کا طریقہ",
              "english": "Way of Thanking for Blessings"
            },
            "content": {
              "urdu": [
                "عید کی خوشی اللہ کا ایک عظیم انعام اور فضل ہے۔",
                "نبی ﷺ نے اس خوشی کا آغاز اور اختتام نماز سے کرنا سکھایا۔",
                "بندگی کے یہ لمحات انسان کے روحانی درجات بلند کرنے کا سبب ہیں۔"
              ],
              "english": [
                "The joy of Eid is a great reward and favor from Allah.",
                "The Prophet (ﷺ) taught starting and ending this joy with prayer.",
                "These moments of devotion are a means to elevate one's spiritual status."
              ]
            }
          },
          {
            "title": {
              "urdu": "نوافل کی اہمیت",
              "english": "Importance of Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "نوافل انسان کو اللہ کے مزید قریب کرنے کا بہترین ذریعہ ہیں۔",
                "عید کے مصروف دن میں بھی اللہ کو یاد رکھنا اعلیٰ درجے کا ایمان ہے۔",
                "سنت پر عمل پیرا ہونا ہی حقیقی خوشی اور کامیابی کی ضمانت ہے۔"
              ],
              "english": [
                "Voluntary prayers are the best way to draw closer to Allah.",
                "Remembering Allah even on a busy Eid day reflects a high level of faith.",
                "Following the Sunnah is the ultimate guarantee of true joy and success."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کو زندہ کرنا",
              "english": "Reviving the Sunnah"
            },
            "content": {
              "urdu": [
                "گھر آ کر دو رکعت پڑھنے کی یہ سنت اکثر لوگوں میں اوجھل ہے۔",
                "اسے دوبارہ زندہ کرنا ثوابِ جاریہ اور محبتِ رسول ﷺ کا تقاضا ہے۔",
                "ہر مسلمان کو چاہیے کہ وہ اس مبارک عمل کو اپنی زندگی کا حصہ بنائے۔"
              ],
              "english": [
                "This Sunnah of praying two units at home is often overlooked by people.",
                "Reviving it is a continuous reward and a requirement of loving the Prophet (ﷺ).",
                "Every Muslim should strive to make this blessed act a part of their life."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط اور بندگی",
              "english": "Discipline and Devotion"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں خوشی کے لمحات میں بھی ضابطہ اور ترتیب سکھاتا ہے۔",
                "عید گاہ کے آداب کا خیال رکھنا بندگی کی اعلیٰ ترین مثال ہے۔",
                "تربیت یافتہ مومن وہی ہے جو ہر حال میں سنت کے مطابق عمل کرے۔"
              ],
              "english": [
                "Islam teaches us discipline and order even during moments of celebration.",
                "Observing the etiquettes of the Musalla is a prime example of servitude.",
                "A well-trained believer is one who acts according to Sunnah in all states."
              ]
            }
          }
        ]
      }
    }
  ]
}
