{
  "hadithId": 483,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1395",
      "https://sunnah.com/muslim:19"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1395)، ومسلم (19). والحديث أصل عظيم في وجوب الزكاة وبيان مصارفها.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (1395) و مسلم (19) میں مروی ہے۔ یہ حدیث زکوٰۃ کی فرضیت اور اس کے مصارف (حقداروں) کے بیان میں ایک عظیم بنیاد ہے۔",
    "english": "Authentic. Reported by Al-Bukhari (1395) and Muslim (19). This Hadith is a foundational evidence for the obligation of Zakat and the identification of its beneficiaries."
  },
  "importantWords": [
    {
      "arabic": "اِفْتَرَضَ",
      "english": "Made obligatory",
      "urdu": "فرض کیا"
    },
    {
      "arabic": "صَدَقَةً",
      "english": "Charity (Zakat)",
      "urdu": "صدقہ / زکوٰۃ"
    },
    {
      "arabic": "أَمْوَالِهِمْ",
      "english": "Their wealth",
      "urdu": "ان کے اموال"
    },
    {
      "arabic": "أَغْنِيَائِهِمْ",
      "english": "Their rich ones",
      "urdu": "ان کے مالدار"
    },
    {
      "arabic": "فُقَرَائِهِمْ",
      "english": "Their poor ones",
      "urdu": "ان کے فقراء / غریب"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں زکوٰۃ کی فرضیت اور اس کے نظام کا خلاصہ بیان کیا گیا ہے کہ یہ مالداروں سے لے کر اسی علاقے کے غریبوں میں تقسیم کی جائے گی۔",
    "english": "This Hadith summarizes the obligation and system of Zakat, stating it is collected from the wealthy and distributed among the local poor."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1395)",
      "english": "Sahih al-Bukhari (1395)"
    },
    {
      "arabic": "صحيح مسلم (19)",
      "english": "Sahih Muslim (19)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "معاذ بن جبل",
        "english": "Mu'adh bin Jabal"
      },
      "slug": "muadh-bin-jabal"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_rOun7K5bY",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ کی فرضیت اور اہمیت",
        "english": "Obligation and Importance of Zakat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکنِ اسلام",
              "english": "A Pillar of Islam"
            },
            "content": {
              "urdu": [
                "زکوٰۃ اسلام کا تیسرا اہم رکن ہے جس کے بغیر ایمان کی تکمیل ممکن نہیں۔",
                "نبی ﷺ نے اسے توحید اور نماز کے فوراً بعد ذکر فرمایا ہے۔",
                "یہ مالی عبادت ہے جو اللہ کی محبت میں مال قربان کرنے کا سبق دیتی ہے۔"
              ],
              "english": [
                "Zakat is the third pillar of Islam, essential for the completion of faith.",
                "The Prophet (ﷺ) mentioned it immediately after Monotheism and Prayer.",
                "It is a financial worship teaching the sacrifice of wealth for Allah's sake."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کی پاکیزگی",
              "english": "Purification of Wealth"
            },
            "content": {
              "urdu": [
                "زکوٰۃ دینے سے باقی بچ جانے والا مال پاک اور بابرکت ہو جاتا ہے۔",
                "یہ انسان کے دل سے بخل اور مال کی حد سے بڑھی محبت کو نکالتی ہے۔",
                "اللہ تعالیٰ زکوٰۃ ادا کرنے والوں کے رزق میں وسعت پیدا فرماتا ہے۔"
              ],
              "english": [
                "Paying Zakat purifies the remaining wealth and brings blessings to it.",
                "It removes greed and excessive love of worldly goods from the heart.",
                "Allah Almighty increases the provision of those who fulfill this duty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ کا معاشی نظام",
        "english": "Economic System of Zakat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دولت کی منصفانہ تقسیم",
              "english": "Fair Distribution of Wealth"
            },
            "content": {
              "urdu": [
                "زکوٰۃ دولت کو صرف مالداروں کے درمیان گردش کرنے سے روکتی ہے۔",
                "یہ غریبوں کی ضروریات پوری کر کے معاشرتی توازن پیدا کرتی ہے۔",
                "اسلامی معیشت میں زکوٰۃ غربت کے خاتمے کا سب سے مؤثر ذریعہ ہے۔"
              ],
              "english": [
                "Zakat prevents wealth from only circulating among the rich class.",
                "It creates social balance by fulfilling the needs of the poor.",
                "In Islamic economics, Zakat is the most effective tool to end poverty."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقامی مستحقین کو ترجیح",
              "english": "Priority to Local Needy"
            },
            "content": {
              "urdu": [
                "حدیث کے مطابق زکوٰۃ اسی علاقے کے فقراء میں بانٹنا افضل ہے۔",
                "اس سے مقامی سطح پر معاشی خوشحالی اور بھائی چارہ بڑھتا ہے۔",
                "اگر علاقے میں مستحق نہ ہوں تو دوسری جگہ بھی بھیجی جا سکتی ہے۔"
              ],
              "english": [
                "According to Hadith, it is best to distribute Zakat among the local poor.",
                "This fosters economic prosperity and brotherhood at the local level.",
                "If no needy are found locally, it can then be sent to other regions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ وصولی اور انتظامیہ",
        "english": "Zakat Collection and Administration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکومتی ذمہ داری",
              "english": "State Responsibility"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کا باقاعدہ نظام قائم کرنا اسلامی ریاست کی ذمہ داری ہے۔",
                "نبی ﷺ نے سیدنا معاذ کو وصولی کے لیے باقاعدہ نمائندہ بنا کر بھیجا۔",
                "نظم و ضبط کے ساتھ زکوٰۃ کی وصولی سے اس کے مقاصد حاصل ہوتے ہیں۔"
              ],
              "english": [
                "Establishing an organized Zakat system is the duty of an Islamic state.",
                "The Prophet (ﷺ) sent Mu'adh as a formal representative for collection.",
                "Disciplined collection ensures the true objectives of Zakat are met."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمت اور نرمی",
              "english": "Wisdom and Gentleness"
            },
            "content": {
              "urdu": [
                "زکوٰۃ وصول کرنے والوں کو لوگوں کے بہترین مال سے بچنا چاہیے۔",
                "لوگوں کے ساتھ نرمی برتنا اور ان کا دل جیتنا مبلغ کی ذمہ داری ہے۔",
                "یہ نظام جبر کے بجائے اللہ کے حکم کی تعمیل پر مبنی ہونا چاہیے۔"
              ],
              "english": [
                "Collectors should avoid taking the most prized assets of the people.",
                "A caller to Islam must act with kindness and win the people's hearts.",
                "This system should be based on obedience to Allah rather than force."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعوت و تبلیغ کی ترتیب",
              "english": "Order of Dawah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے سب سے پہلے توحید پھر نماز اور پھر زکوٰۃ کی دعوت دی۔",
                "دین کی تبلیغ میں تدریج اور اہم امور کو مقدم رکھنا ضروری ہے۔",
                "جب تک عقیدہ درست نہ ہو، دیگر عبادات کی جڑیں مضبوط نہیں ہوتیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) called to Monotheism first, then Prayer, then Zakat.",
                "Gradual progression and prioritizing essentials is vital in Dawah work.",
                "Worship lacks a strong foundation unless the core belief is correct."
              ]
            }
          },
          {
            "title": {
              "urdu": "مظلوم کی بددعا سے بچنا",
              "english": "Avoid the Supplication of the Oppressed"
            },
            "content": {
              "urdu": [
                "اسی حدیث کے آخر میں مظلوم کی بددعا سے بچنے کی تاکید کی گئی ہے۔",
                "حکام اور عاملین کو ناانصافی اور زیادتی سے ہر حال میں رکنا چاہیے۔",
                "اللہ اور مظلوم کی پکار کے درمیان کوئی پردہ یا رکاوٹ نہیں ہوتی۔"
              ],
              "english": [
                "The end of this Hadith warns against the prayer of the oppressed.",
                "Authorities and workers must avoid injustice and excess at all costs.",
                "There is no barrier between Allah and the cry of an oppressed person."
              ]
            }
          }
        ]
      }
    }
  ]
}