{
  "hadithId": 1034,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1034"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6827)، ومسلم (1697).",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم دونوں میں ان کلمات کے ساتھ موجود ہے۔ اس واقعہ کو 'حدیث العسیف' (مزدور کی حدیث) کہا جاتا ہے۔",
    "english": "Sahih (Authentic). Reported by al-Bukhari (6827) and Muslim (1697). This narration is famously known as 'Hadith al-'Asif' (The Hadith of the Laborer)."
  },
  "importantWords": [
    {
      "arabic": "عَسِيفًا",
      "english": "Laborer / Servant",
      "urdu": "مزدور / نوکر"
    },
    {
      "arabic": "افْتَدَيْتُ",
      "english": "Ransomed / Compensated",
      "urdu": "فدیہ دیا / بدلہ دیا"
    },
    {
      "arabic": "وَلِيدَةٍ",
      "english": "Slave girl",
      "urdu": "لونڈی"
    },
    {
      "arabic": "جَلْدُ مِائَةٍ",
      "english": "Hundred lashes",
      "urdu": "سو کوڑے"
    },
    {
      "arabic": "تَغْرِيبُ عَامٍ",
      "english": "Exile for a year",
      "urdu": "ایک سال کی جلاوطنی"
    },
    {
      "arabic": "فارْجُمْهَا",
      "english": "Stone her to death",
      "urdu": "اسے رجم (سنگسار) کر دو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں زنا کی شرعی سزا بیان کی گئی ہے: غیر شادی شدہ کے لیے سو کوڑے اور ایک سال کی جلاوطنی، جبکہ شادی شدہ کے لیے رجم (سنگسار) کی سزا ہے۔",
    "english": "This Hadith clarifies the Shariah punishments for adultery: for the unmarried, 100 lashes and a year's exile; for the married, the punishment is stoning (Rajm)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6827)",
      "english": "Sahih al-Bukhari (6827)"
    },
    {
      "arabic": "صحيح مسلم (1697)",
      "english": "Sahih Muslim (1697)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "زيد بن خالد الجهني",
        "english": "Zaid bin Khalid al-Juhani"
      },
      "slug": "zaid-bin-khalid-al-juhani"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زنا کی شرعی سزائیں",
        "english": "Shariah Penalties for Adultery"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کنوارے کی سزا",
              "english": "Punishment for the Unmarried"
            },
            "content": {
              "urdu": [
                "غیر شادی شدہ زانی کے لیے اسلام نے سو کوڑوں کی سزا مقرر کی ہے۔",
                "کوڑوں کے ساتھ ساتھ ایک سال کے لیے شہر بدر (جلا وطن) کرنا بھی ضروری ہے۔",
                "یہ سزا اس جرم کی شناعت اور معاشرتی بگاڑ کو روکنے کے لیے ہے۔"
              ],
              "english": [
                "Islam prescribes a punishment of 100 lashes for an unmarried adulterer.",
                "In addition to lashing, exile (Tash'hir/Taghrib) for one year is also required.",
                "This penalty is designed to deter the heinousness of the crime and prevent social decay."
              ]
            }
          },
          {
            "title": {
              "urdu": "شادی شدہ کی سزا",
              "english": "Punishment for the Married"
            },
            "content": {
              "urdu": [
                "شادی شدہ (محصن) کے لیے زنا کی سزا رجم یعنی سنگسار کرنا ہے۔",
                "یہ سزا اس لیے سخت ہے کیونکہ شادی شدہ شخص کے پاس حلال ذریعہ موجود تھا۔",
                "رجم کی سزا کا ثبوت سنتِ متواترہ اور اجماعِ صحابہ سے قطعی طور پر ثابت ہے۔"
              ],
              "english": [
                "The punishment for a married person (Muhsan) committing adultery is Rajm (stoning).",
                "This penalty is severe because the married individual had a lawful outlet for their desires.",
                "The punishment of Rajm is definitively established through Mutawatir Sunnah and the consensus of the Sahaba."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدود میں صلح اور فدیہ",
        "english": "Settlements and Ransoms in Legal Punishments"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی فدیہ کی ممانعت",
              "english": "Prohibition of Financial Ransoms"
            },
            "content": {
              "urdu": [
                "اللہ کی مقرر کردہ حدود میں مالی لین دین یا صلح جائز نہیں ہے۔",
                "نبی ﷺ نے سو بکریاں اور لونڈی واپس کر دیں کیونکہ حد میں مال نہیں لیا جا سکتا۔",
                "شرعی سزائیں سب کے لیے برابر ہیں، مالدار اسے خرید کر جان نہیں چھڑا سکتا۔"
              ],
              "english": [
                "Financial transactions or settlements are not permissible in punishments ordained by Allah (Hudud).",
                "The Prophet (ﷺ) ordered the return of the sheep and slave girl because wealth cannot replace a legal penalty.",
                "Shariah penalties are equal for everyone; a wealthy person cannot buy their way out of justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلِ علم سے رجوع",
              "english": "Consulting People of Knowledge"
            },
            "content": {
              "urdu": [
                "دیہاتی کے باپ نے غلطی کی مگر پھر اہل علم سے پوچھ کر درستگی کر لی۔",
                "شرعی مسائل میں اپنی رائے کے بجائے مستند علماء سے پوچھنا فرض ہے۔",
                "نادانی میں کیے گئے غلط معاہدے شرعاً کالعدم قرار دیے جاتے ہیں۔"
              ],
              "english": [
                "The father of the boy made a mistake but corrected it after asking people of knowledge.",
                "It is obligatory to consult authentic scholars in Shariah matters rather than following personal opinions.",
                "Illegal contracts made in ignorance are declared null and void under Shariah law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی طریقہ کار",
        "english": "Judicial Procedures"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتراف کی اہمیت",
              "english": "Importance of Confession"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے سیدنا انیس کو بھیجا کہ اگر عورت اعتراف کرے تو حد لگائی جائے۔",
                "اسلامی قانون میں اقرارِ جرم ثبوت کے لیے ایک بڑی بنیاد ہے۔",
                "تجسس کے بجائے صرف واضح اعتراف یا چار گواہوں پر سزا دی جاتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) sent Unais (RA) to verify if the woman would confess before applying the penalty.",
                "In Islamic law, a valid confession is a major basis for establishing proof of a crime.",
                "Penalties are only applied based on a clear confession or four witnesses, not surveillance."
              ]
            }
          },
          {
            "title": {
              "urdu": "کتاب اللہ سے فیصلہ",
              "english": "Judging by Allah's Book"
            },
            "content": {
              "urdu": [
                "کتاب اللہ سے مراد اللہ کا نازل کردہ قانون ہے، جس میں وحیِ جلی اور خفی دونوں شامل ہیں۔",
                "نبی ﷺ کا ہر فیصلہ وحیِ الہی کے عین مطابق ہوتا تھا۔",
                "مومن کی نشانی یہ ہے کہ وہ ہر تنازع میں اللہ کے رسول کے فیصلے پر راضی ہو۔"
              ],
              "english": [
                "The 'Book of Allah' refers to the Divinely revealed law, encompassing both explicit and implicit revelation.",
                "Every judgment of the Prophet (ﷺ) was in strict accordance with Divine guidance.",
                "A sign of a believer is their total satisfaction with the Prophet's verdict in every dispute."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی پہلو",
        "english": "Educational and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عفت اور پاکدامنی",
              "english": "Chastity and Purity"
            },
            "content": {
              "urdu": [
                "یہ حدیث معاشرے کو پاکیزہ رکھنے اور زنا کے فتنہ سے بچنے کی ترغیب دیتی ہے۔",
                "مزدوری یا ملازمت کے دوران بھی اخلاقی حدود کا خیال رکھنا لازمی ہے۔",
                "خاندان کی عزت کی حفاظت ہی ایک پرامن معاشرے کی ضمانت ہے۔"
              ],
              "english": [
                "This Hadith encourages keeping society pure and avoiding the trials of adultery.",
                "Moral boundaries must be observed even during employment or labor.",
                "Protecting the honor of families is the guarantee of a peaceful society."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقتدر حکام کی ذمہ داری",
              "english": "Responsibility of Authorities"
            },
            "content": {
              "urdu": [
                "حکام کو چاہیے کہ وہ معاملے کی مکمل تحقیق کریں اور جذبات کے بجائے عدل سے کام لیں۔",
                "ناانصافی کی بنیاد پر لیے گئے مال کو واپس کرنا عدل کا حصہ ہے۔",
                "حقدار کو اس کا حق اور مجرم کو اس کی سزا دینا ہی اسلام کا پیغام ہے۔"
              ],
              "english": [
                "Authorities must investigate matters thoroughly and act with justice rather than emotion.",
                "Returning property taken through injustice is a necessary part of judicial fairness.",
                "Granting rights to the deserving and penalties to the guilty is the core message of Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}