{
  "hadithId": 1189,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/2"],
    "kitabId": 14,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام - كتاب القضاء",
    "babId": 97
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (3571)، والترمذي (1325)، والنسائي في الكبرى (3/462)، وابن ماجه (2308)، وأحمد (2/230)، وصححه ابن خزيمة وابن حبان.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (3571)، ترمذی (1325)، نسائی (3/462)، ابن ماجہ (2308) اور احمد نے روایت کیا ہے، اور ابن خزیمہ و ابن حبان نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3571), At-Tirmidhi (1325), An-Nasa'i in Al-Kubra (3/462), Ibn Majah (2308), and Ahmad (2/230). Graded Sahih by Ibn Khuzaymah and Ibn Hibban."
  },
  "importantWords": [
    {
      "arabic": "وَلِيَ",
      "english": "Appointed/Assigned",
      "urdu": "مقرر کیا گیا / ذمہ داری دی گئی"
    },
    {
      "arabic": "اَلْقَضَاءَ",
      "english": "Judiciary/Judgement",
      "urdu": "فیصلہ کرنا / جج کا عہدہ"
    },
    {
      "arabic": "ذُبِحَ",
      "english": "Slaughtered",
      "urdu": "ذبح کر دیا گیا"
    },
    {
      "arabic": "بِغَيْرِ",
      "english": "Without",
      "urdu": "بغیر"
    },
    {
      "arabic": "سِكِّينٍ",
      "english": "Knife",
      "urdu": "چھری"
    },
    {
      "arabic": "اَلْخَمْسَةُ",
      "english": "The Five (Hadith Compilers)",
      "urdu": "پانچ ائمہ حدیث"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث منصبِ قضاء کی سنگینی اور اس کی بھاری ذمہ داری کو بیان کرتی ہے کہ ایک قاضی کا کام کتنا نازک ہے جس میں ذرا سی لغزش ہلاکت کا سبب بن سکتی ہے۔",
    "english": "This Hadith highlights the immense responsibility and danger of being a judge, suggesting that the spiritual and moral burden is equivalent to a fatal trial."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3571)",
      "english": "Sunan Abi Dawud (3571)"
    },
    {
      "arabic": "جامع الترمذي (1325)",
      "english": "Jami' at-Tirmidhi (1325)"
    },
    {
      "arabic": "سنن ابن ماجه (2308)",
      "english": "Sunan Ibn Majah (2308)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=man+waliya+al+qada+hadith+explanation+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی تشریح",
        "english": "Explanation of Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغیر چھری کے ذبح کا مفہوم",
              "english": "Meaning of Slaughter without a Knife"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ قاضی بننا اپنی جان کو خطرے میں ڈالنے کے مترادف ہے۔",
                "چھری کے بغیر ذبح ہونا زیادہ تکلیف دہ اور صبر آزما عمل کی طرف اشارہ ہے۔",
                "یہ استعارہ منصبِ قضاء کی نزاکت اور اس کے اخروی اثرات کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "It implies that accepting a judicial role is like putting one's life in danger.",
                "Slaughtering without a knife suggests a more painful and agonizing trial.",
                "This metaphor illustrates the sensitivity of judgment and its afterlife consequences."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کی ذمہ داری",
              "english": "The Burden of Justice"
            },
            "content": {
              "urdu": [
                "قاضی پر لازم ہے کہ وہ فریقین کے درمیان مکمل عدل سے کام لے۔",
                "حق کے خلاف فیصلہ کرنا قاضی کے ایمان اور آخرت کی تباہی کا باعث ہے۔",
                "لوگوں کے حقوق کا فیصلہ کرنا ایک بہت بڑی امانت ہے جس کا حساب ہوگا۔"
              ],
              "english": [
                "A judge is obligated to maintain absolute justice between parties.",
                "Deciding against the truth leads to the destruction of faith and the hereafter.",
                "Judging people's rights is a great trust for which one will be held accountable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Jurisprudential and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عہدے کی طلب سے ممانعت",
              "english": "Prohibition of Seeking Office"
            },
            "content": {
              "urdu": [
                "اسلام میں منصب اور اقتدار کی خود سے طلب کرنا ناپسندیدہ عمل ہے۔",
                "جو شخص عہدے کا حریص ہو اسے عموماً اللہ کی مدد حاصل نہیں ہوتی۔",
                "قاضی کا عہدہ صرف اسی کو سنبھالنا چاہیے جو اس کی اہلیت رکھتا ہو۔"
              ],
              "english": [
                "In Islam, seeking a position of power or authority for oneself is discouraged.",
                "One who is greedy for a position is usually not granted divine assistance.",
                "The office of a judge should only be held by those who are truly capable."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواہشاتِ نفس سے بچنا",
              "english": "Avoiding Personal Desires"
            },
            "content": {
              "urdu": [
                "قاضی کو اپنے فیصلے میں ذاتی پسند و ناپسند کو شامل نہیں کرنا چاہیے۔",
                "رشوت اور سفارش عدل کے راستے میں سب سے بڑی رکاوٹیں ہیں۔",
                "قرآن و سنت کی روشنی میں فیصلہ کرنا ہی نجات کا واحد راستہ ہے۔"
              ],
              "english": [
                "A judge must not include personal likes or dislikes in their ruling.",
                "Bribery and nepotism are the biggest obstacles in the path of justice.",
                "Judging in the light of the Quran and Sunnah is the only way to salvation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سلف صالحین کا طرزِ عمل",
        "english": "Example of the Pious Predecessors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بزرگانِ دین کا خوف",
              "english": "Fear of the Pious Scholars"
            },
            "content": {
              "urdu": [
                "بہت سے عظیم فقہاء نے قاضی بننے کے بجائے قید خانہ قبول کر لیا۔",
                "امام ابو حنیفہ رحمہ اللہ نے اس منصب سے بچنے کے لیے سختیاں جھیلیں۔",
                "سلف صالحین اسے اپنی آخرت کے لیے ایک بہت بڑا امتحان سمجھتے تھے۔"
              ],
              "english": [
                "Many great jurists preferred imprisonment over becoming a judge.",
                "Imam Abu Hanifah faced hardships specifically to avoid this appointment.",
                "The predecessors viewed it as a massive trial for their hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجر و ثواب کا پہلو",
              "english": "The Aspect of Reward"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص عدل کے ساتھ فیصلہ کرے تو اس کے لیے عظیم اجر ہے۔",
                "عادل حکمران اللہ کے عرش کے سائے تلے ہونے والوں میں شامل ہوگا۔",
                "صحیح نیت اور علم کے ساتھ قضاوت کرنا جہاد کے برابر ہو سکتا ہے۔"
              ],
              "english": [
                "If a person judges with justice, there is a magnificent reward for them.",
                "A just ruler will be among those under the shade of Allah's throne.",
                "Judging with correct intention and knowledge can be equivalent to Jihad."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذمہ داری کا احساس",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں کسی بھی ذمہ داری کو ہلکا نہ لینے کا درس دیتی ہے۔",
                "معاشرتی نظام میں ہر عہدہ ایک امتحان اور آزمائش کی جگہ ہے۔",
                "انسان کو اپنی استطاعت سے زیادہ بوجھ اٹھانے سے گریز کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith teaches us not to take any responsibility lightly.",
                "Every position in a social system is a place of trial and testing.",
                "One should avoid taking a burden greater than their capacity."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرے میں عدل کی اہمیت",
              "english": "Importance of Justice in Society"
            },
            "content": {
              "urdu": [
                "جس معاشرے میں عدل ختم ہو جاتا ہے وہ تباہ و برباد ہو جاتا ہے۔",
                "عدل و انصاف ہی ملک و قوم کی بقا اور سلامتی کی ضمانت ہے۔",
                "قاضی کا کردار معاشرے میں امن و امان قائم رکھنے کے لیے ناگزیر ہے۔"
              ],
              "english": [
                "A society where justice vanishes is bound to be destroyed.",
                "Justice is the guarantee for the survival and security of a nation.",
                "The role of a judge is indispensable for maintaining peace and order."
              ]
            }
          }
        ]
      }
    }
  ]
}