{
  "hadithId": 485,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1576",
      "https://sunnah.com/tirmidhi:623",
      "https://sunnah.com/nasai:2451",
      "https://sunnah.com/ibnmajah:1803"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (5/230)، وأبو داود (1576)، والترمذي (623)، والنسائي (5/25)، وابن ماجه (1803)، وصححه ابن حبان والحاكم. والتبيع: ما له سنة، والمسنة: ما لها سنتان.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔ 'تتبع' سے مراد ایک سالہ اور 'مسنہ' سے مراد دو سالہ جانور ہے۔",
    "english": "Authentic. Reported by Ahmad (5/230), Abu Dawud (1576), At-Tirmidhi (623), An-Nasa'i (5/25), and Ibn Majah (1803). It was authenticated by Ibn Hibban and Al-Hakim. 'Tabi' refers to a one-year-old animal, and 'Musinnah' refers to a two-year-old."
  },
  "importantWords": [
    {
      "arabic": "تَبِيعًا",
      "english": "One-year-old calf",
      "urdu": "ایک سالہ بچھڑا"
    },
    {
      "arabic": "مُسِنَّةً",
      "english": "Two-year-old cow",
      "urdu": "دو سالہ گائے"
    },
    {
      "arabic": "حَالِمٍ",
      "english": "Adult / Pubescent",
      "urdu": "بالغ / نوجوان"
    },
    {
      "arabic": "مُعَافِرَ",
      "english": "Ma'afiri cloth",
      "urdu": "یمنی کپڑا (معافری)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں گائے کی زکوٰۃ کا نصاب بیان کیا گیا ہے کہ ہر 30 گائیوں پر ایک سالہ اور ہر 40 پر دو سالہ جانور واجب ہے، نیز اہل کتاب سے جزیہ کی مقدار کا ذکر ہے۔",
    "english": "This Hadith details the Zakat threshold for cows (one-year-old for every 30, two-year-old for every 40) and establishes the Jizyah amount for non-Muslim adults."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1576)",
      "english": "Sunan Abu Dawud (1576)"
    },
    {
      "arabic": "سنن الترمذي (623)",
      "english": "Sunan at-Tirmidhi (623)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاذ بن جبل",
        "english": "Mu'adh bin Jabal"
      },
      "slug": "muadh-bin-jabal"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_R_AAnM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "گائے کی زکوٰۃ کا نصاب",
        "english": "Nisab for Cows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیس گائیوں کا نصاب",
              "english": "Threshold of Thirty Cows"
            },
            "content": {
              "urdu": [
                "اگر کسی کے پاس 30 سے کم گائیں ہوں تو اس پر زکوٰۃ واجب نہیں ہے۔",
                "30 گائیوں پر 'تتبع' یعنی ایک سال کا بچھڑا یا بچھیا دینا لازم ہے۔",
                "اسے تتبع اس لیے کہتے ہیں کہ یہ ابھی اپنی ماں کے پیچھے چلتا ہے۔"
              ],
              "english": [
                "Zakat is not obligatory if one possesses fewer than thirty cows.",
                "For 30 cows, a 'Tabi' (one-year-old male or female calf) is due.",
                "It is called Tabi because it still follows (tabi'a) its mother."
              ]
            }
          },
          {
            "title": {
              "urdu": "چالیس گائیوں کا نصاب",
              "english": "Threshold of Forty Cows"
            },
            "content": {
              "urdu": [
                "جب تعداد 40 ہو جائے تو ایک 'مسنہ' یعنی دو سالہ مادہ گائے دینا واجب ہے۔",
                "نصاب کے حساب سے اگر تعداد 60 ہو جائے تو دو تتبع (ایک ایک سال والے) دیے جائیں گے۔",
                "زکوٰۃ کا یہ نظام دولت کی منصفانہ تقسیم اور غربت کے خاتمے کے لیے ہے۔"
              ],
              "english": [
                "When the number reaches 40, a 'Musinnah' (two-year-old female) is due.",
                "If the count reaches 60, then two Tabi' calves are required.",
                "This system ensures fair wealth distribution and poverty alleviation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جزیہ اور غیر مسلموں کے حقوق",
        "english": "Jizyah and Rights of Non-Muslims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جزیہ کی مقدار",
              "english": "Amount of Jizyah"
            },
            "content": {
              "urdu": [
                "بالغ غیر مسلم مردوں سے سالانہ ایک دینار جزیہ لینے کا حکم دیا گیا۔",
                "اگر دینار میسر نہ ہو تو اس کی قیمت کا یمنی کپڑا (معافری) بھی لیا جا سکتا ہے۔",
                "جزیہ صرف ان سے لیا جاتا تھا جو برسرِ پیکار نہ ہوں اور اسلامی ریاست کے زیرِ سایہ رہیں۔"
              ],
              "english": [
                "Adult non-Muslim males were required to pay one Dinar annually as Jizyah.",
                "If a Dinar was unavailable, its equivalent in Ma'afiri cloth was accepted.",
                "Jizyah was collected from those living under the protection of the Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کے بجائے کپڑے کی قبولیت",
              "english": "Accepting Cloth Instead of Cash"
            },
            "content": {
              "urdu": [
                "شریعت میں ادائیگی کے معاملے میں لوگوں کی سہولت کا خیال رکھا گیا ہے۔",
                "کپڑے کی قبولیت سے ثابت ہوتا ہے کہ زکوٰۃ یا جزیہ میں متبادل اشیاء دی جا سکتی ہیں۔",
                "عامل (وصول کنندہ) کو چاہیے کہ وہ لوگوں کے لیے تنگی پیدا نہ کرے۔"
              ],
              "english": [
                "Shariah considers people's convenience in matters of payment.",
                "Accepting cloth proves that substitutes can be used for Zakat or Jizyah.",
                "The collector (Amil) should avoid causing hardship for the people."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعوت اور انتظامی امور",
        "english": "Dawah and Administrative Affairs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا معاذ کی یمن روانگی",
              "english": "Mu'adh's Departure to Yemen"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے یمن جیسے اہم علاقے کے لیے جلیل القدر صحابی کا انتخاب فرمایا۔",
                "حاکم یا نمائندہ بھیجتے وقت اسے واضح ہدایات اور احکامات دینا سنت ہے۔",
                "یمن میں اہل کتاب (یہود و نصاریٰ) کی بڑی تعداد آباد تھی۔"
              ],
              "english": [
                "The Prophet (ﷺ) chose an esteemed companion for an important region like Yemen.",
                "It is Sunnah to give clear instructions when appointing a representative.",
                "Yemen had a significant population of the People of the Book (Jews and Christians)."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ عملی اور تدریج",
              "english": "Strategy and Gradualism"
            },
            "content": {
              "urdu": [
                "پہلے عقیدے کی اصلاح، پھر نماز اور آخر میں مالی فرائض کی تعلیم دی گئی۔",
                "دین کی اشاعت میں لوگوں کی معاشی اور سماجی حالت کا ادراک ضروری ہے۔",
                "سیدنا معاذ کو نرمی اور خوشخبری سنانے کی نصیحت کی گئی تھی۔"
              ],
              "english": [
                "Correcting beliefs came first, followed by prayer, then financial duties.",
                "Spreading religion requires understanding people's economic and social status.",
                "Mu'adh was advised to be gentle and give glad tidings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی عبادات کی اہمیت",
              "english": "Importance of Financial Worship"
            },
            "content": {
              "urdu": [
                "زکوٰۃ صرف سونا چاندی نہیں بلکہ مویشیوں اور فصلوں پر بھی فرض ہے۔",
                "اپنے مال میں سے اللہ کا حصہ نکالنا تزکیہ نفس کا ذریعہ ہے۔",
                "نصاب کے مطابق ادائیگی کرنا ہر صاحبِ استطاعت پر لازم ہے۔"
              ],
              "english": [
                "Zakat is due on livestock and crops, not just gold and silver.",
                "Extracting Allah's portion from wealth is a means of spiritual purification.",
                "Payment according to the Nisab is mandatory for every capable person."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کا قیام",
              "english": "Establishment of Justice"
            },
            "content": {
              "urdu": [
                "اسلامی نظامِ ٹیکس میں ہر طبقے کے لیے واضح اور سہل قوانین موجود ہیں۔",
                "حکام کو چاہیے کہ وہ مقررہ مقدار سے زیادہ وصول نہ کریں۔",
                "رعایا کے حقوق کا تحفظ اسلامی حکومت کی اولین ترجیح ہے۔"
              ],
              "english": [
                "Islamic taxation has clear and easy laws for every class.",
                "Authorities must not collect more than the prescribed amounts.",
                "Protecting the rights of subjects is the top priority of an Islamic government."
              ]
            }
          }
        ]
      }
    }
  ]
}