{
  "hadithId": 153,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["1:3:10"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  
  "takhreej": {
    "arabic": " صحيح.‏ رواه البخاري (611)‏، ومسلم (383)‏. صحيح.‏ رواه البخاري (612)‏ وفي رواية له برقم (914)‏ من طريق أبي أمامة بن سهل بن حنيف قال: سمعت معاوية بن أبي سفيان، وهو جالس على المنبر، أذن المؤذن قال: الله أكبر.‏ الله أكبر.‏ قال معاوية: الله أكبر.‏ الله أكبر.‏ قال: أشهد أن لا إله إلا الله.‏ فقال معاوية: أنا فقال: أشهد أن محمدا رسول الله.‏ فقال معاوية: وأنا.‏ فلما قضى التأذين.‏ قال: يا أيها الناس! إني سمعت رسول الله صلى الله عليه وسلم على هذا المجلس ‏-حين أذن المؤذن‏- يقول: ما سمعتم مني من مقالتي.‏ صحيح.‏ رواه مسلم (385)‏ ونصه: عن عمر بن الخطاب رضي الله عنه، قال: قال رسول الله صلى الله عليه وسلم: \"إذ قال المؤذن: الله أكبر.‏ الله أكبر.‏ فقال أحدكم: الله أكبر.‏ الله أكبر.‏ ثم قال: أشهد أن لا إله إلا الله.‏ قال: أشهد أن لا إله إلا الله.‏ ثم قال: أشهد أن محمدا رسول الله.‏ قال: أشهد أن محمدا رسول الله.‏ ثم قال: حي على الصلاة .‏ قال: لا حول ولا قوة إلا بالله.‏ ثم قال: حي على الفلاح.‏ قال: لا حول ولا قوة إلا بالله.‏ ثم قال: الله أكبر.‏ الله أكبر.‏ قال: الله أكبر .‏ الله أكبر .‏ ثم قال: لا إله إلا الله.‏ قال: لا إله إلا الله.‏ من قلبه دخل الجنة\".‏ ",
    "urdu": "صحیح۔ اسے بخاری (611) اور مسلم (383) نے روایت کیا ہے۔ صحیح۔ اسے بخاری (612) نے روایت کیا اور ان کی ایک روایت (914) میں ابو امامہ بن سہل بن حنیف سے ہے کہ انہوں نے معاویہ بن ابی سفیان کو منبر پر بیٹھے ہوئے سنا، مؤذن نے اذان دی اور کہا: الله أكبر، الله أكبر۔ تو معاویہؓ نے کہا: الله أكبر، الله أكبر۔ مؤذن نے کہا: أشهد أن لا إله إلا الله۔ تو معاویہؓ نے کہا: میں بھی کہتا ہوں۔ مؤذن نے کہا: أشهد أن محمدا رسول الله۔ تو معاویہؓ نے کہا: اور میں بھی۔ جب اذان مکمل ہو گئی تو انہوں نے فرمایا: اے لوگو! میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی جگہ بیٹھے ہوئے سنا ہے کہ جب مؤذن اذان دیتا تو آپ وہی کہتے تھے جو تم نے مجھے کہتے ہوئے سنا۔ صحیح۔ اسے مسلم (385) نے روایت کیا ہے اور اس کے الفاظ یہ ہیں: عمر بن خطاب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب مؤذن کہے: الله أكبر، الله أكبر، تو تم میں سے کوئی کہے: الله أكبر، الله أكبر۔ پھر مؤذن کہے: أشهد أن لا إله إلا الله، تو تم کہو: أشهد أن لا إله إلا الله۔ پھر مؤذن کہے: أشهد أن محمدا رسول الله، تو تم کہو: أشهد أن محمدا رسول الله۔ پھر مؤذن کہے: حي على الصلاة، تو تم کہو: لا حول ولا قوة إلا بالله۔ پھر مؤذن کہے: حي على الفلاح، تو تم کہو: لا حول ولا قوة إلا بالله۔ پھر مؤذن کہے: الله أكبر، الله أكبر، تو تم کہو: الله أكبر، الله أكبر۔ پھر مؤذن کہے: لا إله إلا الله، تو تم کہو: لا إله إلا الله۔ جو یہ کلمات دل سے کہے گا، وہ جنت میں داخل ہو گا۔“",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (611) and Muslim (383). Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (612), and in a narration (914) from Abū Umāmah ibn Sahl ibn Ḥunaif, he said: I heard Mu'āwiyah ibn Abī Sufyān, while he was sitting on the minbar (pulpit), when the Mu'adhdhin called the Adhān and said: Allāhu Akbar, Allāhu Akbar. Mu'āwiyah said: Allāhu Akbar, Allāhu Akbar. He said: Ashhadu an lā ilāha illallāh. Mu'āwiyah said: And I do. He said: Ashhadu anna Muḥammadan rasūlullāh. Mu'āwiyah said: And I do. When the Adhān was finished, he said: O people! I heard the Messenger of Allah (ﷺ) in this very place—when the Mu'adhdhin called the Adhān—saying what you heard me say. Authentic (Ṣaḥīḥ). Reported by Muslim (385), and its wording is: From 'Umar ibn Al-Khaṭṭāb (RA), who said: The Messenger of Allah (ﷺ) said: 'When the Mu'adhdhin says: Allāhu Akbar, Allāhu Akbar, then one of you should say: Allāhu Akbar, Allāhu Akbar. Then he says: Ashhadu an lā ilāha illallāh, he should say: Ashhadu an lā ilāha illallāh. Then he says: Ashhadu anna Muḥammadan rasūlullāh, he should say: Ashhadu anna Muḥammadan rasūlullāh. Then he says: Ḥayya 'ala aṣ-ṣalāh, he should say: Lā ḥawla wa lā quwwata illā billāh. Then he says: Ḥayya 'ala al-falāḥ, he should say: Lā ḥawla wa lā quwwata illā billāh. Then he says: Allāhu Akbar, Allāhu Akbar, he should say: Allāhu Akbar, Allāhu Akbar. Then he says: Lā ilāha illallāh, he should say: Lā ilāha illallāh. Whoever says this from his heart will enter Paradise.'"
  },
  "importantWords": [
    {
      "arabic": "سَمِعْتُمْ اَلنِّدَاءَ",
      "english": "You hear the call (Adhān)",
      "urdu": "تم اذان سنو"
    },
    {
      "arabic": "فَقُولُوا مِثْلَ مَا يَقُولُ",
      "english": "Then say as he says",
      "urdu": "تو تم بھی اسی طرح کہتے جاؤ"
    },
    {
      "arabic": "اَلْمُؤَذِّنُ",
      "english": "The Mu'adhdhin",
      "urdu": "مؤذن"
    },
    {
      "arabic": "اَلْحَيْعَلَتَيْنِ",
      "english": "The two Ḥay'alahs (calls to prayer/success)",
      "urdu": "حیعلتین"
    },
    {
      "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاَللَّهِ",
      "english": "There is no power nor strength except with Allah",
      "urdu": "نہیں کوئی طاقت اور نہ کوئی قوت سوائے اللہ کے"
    },
    {
      "arabic": "مِنْ قَلْبِهِ",
      "english": "From his heart",
      "urdu": "اپنے دل سے"
    },
    {
      "arabic": "دَخَلَ اَلْجَنَّةَ",
      "english": "He will enter Paradise",
      "urdu": "وہ جنت میں داخل ہو گا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسلمانوں کو اذان کے وقت مؤذن کے کلمات کو دہرانے کا حکم دیتی ہے، ماسوائے «حي على الصلاة» اور «حي على الفلاح» کے۔ ان دو کلمات کے جواب میں «لا حول ولا قوة إلا بالله» کہنا مسنون ہے۔ یہ عمل، اگر دل کی سچائی سے کیا جائے، تو جنت میں داخلے کا سبب بنتا ہے، اور یہ نماز کی طرف متوجہ ہونے کی ایک اہم سنت ہے۔",
    "english": "This Hadith instructs Muslims to repeat the words of the Mu'adhdhin when they hear the Adhān, except for the two Ḥay'alah phrases ('Ḥayya 'ala aṣ-ṣalāh' and 'Ḥayya 'ala al-falāḥ'). In response to these two, it is Sunnah to say 'Lā ḥawla wa lā quwwata illā billāh.' This practice, if performed with sincerity of heart, leads to entry into Paradise, and it is a key Sunnah for responding to the call to prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري (611) عن أبي سعيد الخدري",
      "english": "Reported by Al-Bukhārī (611) from Abū Sa'īd Al-Khudrī"
    },
    {
      "arabic": "رواه مسلم (385) عن عمر بن الخطاب",
      "english": "Reported by Muslim (385) from 'Umar ibn Al-Khaṭṭāb"
    },
    {
      "arabic": "رواه البخاري (914) عن معاوية",
      "english": "Reported by Al-Bukhārī (914) from Mu'āwiyah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abū Sa'īd Al-Khudrī"
      },
      "slug": "abu-said-al-khudri"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar ibn Al-Khaṭṭāb"
      },
      "slug": "umar-ibn-al-khattab"
    },
    {
      "id": 3,
      "name": {
        "arabic": "معاوية بن أبي سفيان",
        "english": "Mu'āwiyah ibn Abī Sufyān"
      },
      "slug": "muawiyah-ibn-abi-sufyan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اذان کا جواب دینے کا طریقہ",
        "english": "Method of Responding to the Adhān"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کلمات کا دہرانا",
              "english": "Repeating the Phrases"
            },
            "content": {
              "urdu": [
                "عام حکم یہ ہے کہ اذان کے دوران مؤذن جو بھی کلمات کہے، سننے والا بھی وہی کلمات کہے۔",
                "یہ مسنون عمل مؤذن اور سامع دونوں کو اللہ کی وحدانیت اور نبی کی رسالت کا اقرار دہرانے کا موقع دیتا ہے۔",
                "معاویہؓ کی روایت سے ثابت ہوتا ہے کہ نبی ﷺ خود بھی اس عمل پر پابندی فرماتے تھے۔"
              ],
              "english": [
                "The general ruling is that the listener should repeat the exact phrases the Mu'adhdhin says during the Adhān.",
                "This recommended practice allows both the caller and the listener to reaffirm their belief in Allah's Oneness and the Prophet's Message.",
                "The narration from Mu'āwiyah (RA) confirms that the Prophet (ﷺ) himself adhered to this practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیعلتین کا استثناء",
              "english": "The Exception of the Ḥay'alatayn"
            },
            "content": {
              "urdu": [
                "صرف «حي على الصلاة» اور «حي على الفلاح» کے جواب میں الفاظ کو تبدیل کیا جاتا ہے۔",
                "ان کلمات کے جواب میں «لا حول ولا قوة إلا بالله» کہنا سنت ہے، جیسا کہ عمرؓ کی روایت میں مذکور ہے۔",
                "یہ تبدیلی اس لیے ہے کہ مؤذن تو بندے کو نماز کی دعوت دے رہا ہے، اور بندہ جواب میں اللہ کی توفیق کا اقرار کر رہا ہے۔"
              ],
              "english": [
                "Only the response to 'Ḥayya 'ala aṣ-ṣalāh' and 'Ḥayya 'ala al-falāḥ' is different from the original phrases.",
                "Responding with 'Lā ḥawla wa lā quwwata illā billāh' is Sunnah, as mentioned in 'Umar's narration.",
                "This change is because the Mu'adhdhin is calling man to prayer, and the listener responds by acknowledging that ability and strength come only from Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنت میں داخلے کی فضیلت",
        "english": "Virtue of Entering Paradise"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاص کی شرط",
              "english": "Condition of Sincerity"
            },
            "content": {
              "urdu": [
                "عمرؓ کی حدیث میں بیان ہے کہ جو شخص اذان کے ان کلمات کو دل کی سچائی کے ساتھ کہے گا، وہ جنت میں داخل ہو گا۔",
                "یہ فضیلت صرف ظاہری طور پر کلمات دہرانے پر نہیں، بلکہ ان کے معنی کو دل میں اتارنے پر منحصر ہے۔",
                "توحید اور رسالت کی گواہی کو دل کی گہرائیوں سے دینا نجات کا سبب ہے۔"
              ],
              "english": [
                "Umar's Hadith states that whoever says these Adhān phrases with sincerity of heart will enter Paradise.",
                "This virtue is contingent upon internalizing the meaning of the words, not just repeating them orally.",
                "Bearing witness to Monotheism and Prophethood with profound sincerity is a means of salvation."
              ]
            }
          },
          {
            "title": {
              "urdu": "لا حول ولا قوة إلا بالله کا معنی",
              "english": "Meaning of Lā ḥawla wa lā quwwata illā billāh"
            },
            "content": {
              "urdu": [
                "یہ جملہ اللہ کے سامنے بندے کی مکمل عاجزی اور انحصار کو ظاہر کرتا ہے کہ وہ عبادت کی طاقت نہیں رکھتا۔",
                "یہ اقرار ہے کہ نماز اور فلاح صرف اللہ کی مدد اور توفیق کے بغیر ممکن نہیں۔",
                "اس کلمے کی وجہ سے جنت کے خزانوں میں سے ایک قرار دیا گیا ہے۔"
              ],
              "english": [
                "This phrase signifies the complete humility and dependence of the servant upon Allah, acknowledging the lack of power for worship.",
                "It is an admission that prayer and success are not possible without the help and grace of Allah.",
                "This phrase is considered one of the treasures of Paradise."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی فوائد",
        "english": "Training and Practical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان کو دور کرنا",
              "english": "Expelling Satan"
            },
            "content": {
              "urdu": [
                "ایک روایت میں ہے کہ اذان کی آواز سن کر شیطان بھاگتا ہے، اور اس کا جواب دینا شیطان کو مزید دور کرتا ہے۔",
                "اذان کے جواب میں مشغول ہونا انسان کو غفلت اور دنیاوی مشاغل سے دور کر کے عبادت کی طرف متوجہ کرتا ہے۔",
                "مؤذن کی پیروی میں مسلمان ایک اجتماعی اور روحانی عمل میں شامل ہوتا ہے۔"
              ],
              "english": [
                "It is narrated that Satan flees upon hearing the Adhān, and responding to it further drives Satan away.",
                "Engaging in responding to the Adhān turns a person away from heedlessness and worldly affairs towards worship.",
                "By following the Mu'adhdhin, the Muslim participates in a collective and spiritual act."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان کے بعد کی دعا",
              "english": "The Supplication After Adhān"
            },
            "content": {
              "urdu": [
                "اذان کا جواب دینے کے بعد نبی اکرم ﷺ پر درود شریف پڑھنا اور پھر مخصوص دعا مانگنا مسنون ہے۔",
                "یہ دعا نبی ﷺ کے لیے وسیلہ اور فضیلت طلب کرتی ہے اور شفاعت کو واجب کرتی ہے۔",
                "مسلمان کو چاہیے کہ وہ اذان کے ان آداب کو مکمل طور پر اختیار کرے۔"
              ],
              "english": [
                "It is Sunnah to send peace and blessings upon the Prophet (ﷺ) after responding to the Adhān, followed by reciting a specific supplication.",
                "This supplication asks for the Wasīlah (station) and virtue for the Prophet (ﷺ) and secures his intercession.",
                "A Muslim should adopt all these manners related to the Adhān completely."
              ]
            }
          }
        ]
      }
    }
  ]
}
