{
  "hadithId": 367,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/muslim:881a"
    ],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (881)، وأبو داود (1131)، والترمذي (523)، والنسائي (1425).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام مسلم (881) نے روایت کیا ہے، نیز ابو داؤد، ترمذی اور نسائی میں بھی یہ روایت موجود ہے۔",
    "english": "Sahih. Reported by Muslim (881), Abu Dawud (1131), At-Tirmidhi (523), and An-Nasa'i (1425)."
  },
  "importantWords": [
    {
      "arabic": "صَلَّى",
      "english": "Performed prayer",
      "urdu": "نماز ادا کی"
    },
    {
      "arabic": "الْجُمُعَةَ",
      "english": "Friday Prayer",
      "urdu": "جمعہ کی نماز"
    },
    {
      "arabic": "بَعْدَهَا",
      "english": "After it",
      "urdu": "اس کے بعد"
    },
    {
      "arabic": "أَرْبَعًا",
      "english": "Four (Rak'ahs)",
      "urdu": "چار رکعتیں"
    },
    {
      "arabic": "أَحَدُكُمُ",
      "english": "One of you",
      "urdu": "تم میں سے کوئی"
    }
  ],
  "summary": {
    "urdu": "نماز جمعہ کے بعد چار رکعت سنت پڑھنا رسول اللہ صلی اللہ علیہ وسلم کا حکم اور مسنون طریقہ ہے۔",
    "english": "It is a Prophetic command and Sunnah to perform four Rak'ahs of prayer after the Friday congregational prayer."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (881)",
      "english": "Sahih Muslim (881)"
    },
    {
      "arabic": "سنن أبي داود (1131)",
      "english": "Sunan Abi Dawud (1131)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOfR8P2lT88",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کے بعد کی سنتیں",
        "english": "Sunnah after Jumu'ah Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار رکعت کا حکم",
              "english": "Ruling on Four Rak'ahs"
            },
            "content": {
              "urdu": [
                "نبی کریم صلی اللہ علیہ وسلم نے جمعہ کے بعد چار رکعت پڑھنے کا حکم دیا ہے۔",
                "یہ چار رکعتیں مسجد میں ادا کرنا افضل اور مسنون طریقہ ہے۔",
                "یہ عمل نماز جمعہ کی تکمیل اور مزید ثواب کا باعث بنتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) explicitly commanded praying four Rak'ahs after Jumu'ah.",
                "Performing these four Rak'ahs in the mosque is the preferred Sunnah method.",
                "This act serves as a completion to Jumu'ah and brings additional rewards."
              ]
            }
          },
          {
            "title": {
              "urdu": "دو رکعت کا متبادل",
              "english": "Alternative of Two Rak'ahs"
            },
            "content": {
              "urdu": [
                "دیگر روایات کے مطابق آپ صلی اللہ علیہ وسلم گھر جا کر دو رکعت پڑھتے تھے۔",
                "علماء کے نزدیک اگر مسجد میں پڑھیں تو چار اور گھر میں پڑھیں تو دو افضل ہیں۔",
                "یہ تنوع امت کے لیے آسانی اور عمل کے مختلف مواقع فراہم کرتا ہے۔"
              ],
              "english": [
                "According to other narrations, the Prophet (ﷺ) prayed two Rak'ahs at home.",
                "Scholars state that four are better in the mosque, and two are better at home.",
                "This variety provides ease and different opportunities for the Ummah to act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازوں کے درمیان فصل",
        "english": "Separation Between Prayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جگہ بدلنا یا گفتگو کرنا",
              "english": "Changing Places or Speaking"
            },
            "content": {
              "urdu": [
                "فرض اور سنت کے درمیان جگہ بدلنا یا بات چیت کرنا مستحب ہے۔",
                "اس کا مقصد فرض اور نفل نماز کے درمیان واضح فرق پیدا کرنا ہے۔",
                "صحابہ کرام اس بات کا خاص خیال رکھتے تھے کہ دونوں نمازیں خلط ملط نہ ہوں۔"
              ],
              "english": [
                "It is recommended to change spots or speak between fard and sunnah.",
                "The objective is to create a clear distinction between obligatory and voluntary acts.",
                "The Companions took great care to ensure the two prayers did not overlap."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدعت سے بچاؤ",
              "english": "Avoiding Innovation"
            },
            "content": {
              "urdu": [
                "نمازوں کو جدا رکھنا اس بات کو یقینی بناتا ہے کہ نفل کو فرض نہ سمجھ لیا جائے۔",
                "شریعت نے عبادات کی حدود کو واضح طور پر متعین کر دیا ہے۔",
                "سنت کی اتباع ہی دین میں غلو اور بدعت سے بچنے کا واحد راستہ ہے۔"
              ],
              "english": [
                "Keeping prayers separate ensures voluntary units aren't mistaken for obligatory ones.",
                "Sharia has clearly defined the boundaries of different types of worship.",
                "Following the Sunnah is the only way to avoid extremism and innovation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنتِ مؤکدہ کی اہمیت",
        "english": "Significance of Sunnah Mu'akkadah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کمی کی تلافی",
              "english": "Compensating for Deficiencies"
            },
            "content": {
              "urdu": [
                "نوافل اور سنتیں قیامت کے دن فرائض کی کمی کو پورا کریں گی۔",
                "جمعہ کے بعد کی یہ چار رکعتیں بھی اسی زمرے میں آتی ہیں۔",
                "مومن کو چاہیے کہ وہ ان سنتوں کو کبھی بلا عذر ترک نہ کرے۔"
              ],
              "english": [
                "Voluntary and Sunnah prayers will compensate for flaws in Fard on Judgment Day.",
                "These four Rak'ahs after Jumu'ah also fall into this beneficial category.",
                "A believer should not abandon these Sunnahs without a valid excuse."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی کریم سے محبت کا تقاضا",
              "english": "Requirement of Loving the Prophet"
            },
            "content": {
              "urdu": [
                "آپ صلی اللہ علیہ وسلم کے احکامات پر عمل کرنا سچی محبت کی علامت ہے۔",
                "سنتوں کی پابندی انسان کو اللہ اور اس کے رسول کے قریب کرتی ہے۔",
                "حکمِ نبوی 'فلیصل' (پس وہ نماز پڑھے) تاکید کے لیے استعمال ہوا ہے۔"
              ],
              "english": [
                "Acting upon the Prophet's (ﷺ) commands is a sign of true love.",
                "Adhering to Sunnahs brings a person closer to Allah and His Messenger.",
                "The Prophetic command 'let him pray' is used here for strong emphasis."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی نکات",
        "english": "Juristic and Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترتیب اور تعداد",
              "english": "Order and Numbering"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک چار رکعتیں دو دو کر کے پڑھنا زیادہ بہتر ہے۔",
                "بعض علماء کے نزدیک چاروں رکعتیں ایک سلام کے ساتھ بھی جائز ہیں۔",
                "اصل مقصد سنت کی ادائیگی اور اللہ کا قرب حاصل کرنا ہے۔"
              ],
              "english": [
                "According to jurists, it is better to pray the four units in pairs of two.",
                "Some scholars believe praying all four with one Taslim is also permissible.",
                "The main goal is the fulfillment of Sunnah and seeking closeness to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی برکت",
              "english": "Blessing of the Time"
            },
            "content": {
              "urdu": [
                "جمعہ کا دن مبارک ہے اور اس کی عبادات کی خاص فضیلت ہے۔",
                "نماز کے بعد ذکر و اذکار اور نوافل میں مشغول رہنا بہترین عمل ہے۔",
                "یہ وقت دعا کی قبولیت کا بھی ہوتا ہے، اس لیے تلاوت و نماز اہم ہے۔"
              ],
              "english": [
                "Friday is a blessed day and its acts of worship have special merit.",
                "Remaining engaged in Dhikr and voluntary prayers after Jumu'ah is excellent.",
                "This time includes the hour of acceptance; thus, prayer and recitation are vital."
              ]
            }
          }
        ]
      }
    }
  ]
}