{
  "hadithId": 1270,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/35"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "الجامع - باب الزهد والورع",
    "babId": 104
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه الترمذي (2516)، وأحمد (1/293). وقال الترمذي: حسن صحيح. وله رواية أخرى عند أحمد والحاكم فيها زيادات هامة: 'تعرف إلى الله في الرخاء يعرفك في الشدة'.",
    "urdu": "صحیح۔ اسے امام ترمذی (2516) اور امام احمد نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے۔ اس کا مکمل متن تقدیر اور اللہ پر توکل کے عظیم اسباق پر مشتمل ہے۔",
    "english": "Sahih. Reported by At-Tirmidhi (2516) and Ahmad. At-Tirmidhi graded it Hasan Sahih. A more detailed version exists in Musnad Ahmad, including the phrase: 'Acknowledge Allah in prosperity, He will acknowledge you in adversity.'"
  },
  "importantWords": [
    {
      "arabic": "اِحْفَظِ اَللَّهَ",
      "english": "Be mindful of Allah",
      "urdu": "اللہ (کے احکام) کی حفاظت کر"
    },
    {
      "arabic": "يَحْفَظْكَ",
      "english": "He will protect you",
      "urdu": "وہ تیری حفاظت کرے گا"
    },
    {
      "arabic": "تُجَاهَكَ",
      "english": "Before you / In front of you",
      "urdu": "اپنے سامنے / اپنے ساتھ"
    },
    {
      "arabic": "اِسْتَعَنْتَ",
      "english": "You seek help",
      "urdu": "تو نے مدد مانگی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث توحید، توکل اور اللہ کے ساتھ تعلق کی بنیاد ہے۔ اس میں سکھایا گیا ہے کہ جو اللہ کے احکام کی لاج رکھتا ہے، اللہ اسے دنیا و آخرت کی آفتوں سے بچاتا ہے۔",
    "english": "This Hadith is a cornerstone of Monotheism (Tawhid) and trust in Allah. It teaches that whoever guards Allah's commandments will find Allah's protection and support in every aspect of life."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب صفة القيامة والرقائق والورع، رقم 2516",
      "english": "Sunan at-Tirmidhi, Book on the Description of the Day of Judgement, No. 2516"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اللہ کی حفاظت سے کیا مراد ہے؟",
        "english": "What is Meant by Guarding Allah?"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احکام کی پاسداری",
              "english": "Observing the Commandments"
            },
            "content": {
              "urdu": [
                "اللہ کی حفاظت کرنے کا مطلب اس کے فرائض (نماز، روزہ وغیرہ) کو وقت پر ادا کرنا ہے۔",
                "اس کی حدود سے تجاوز نہ کرنا اور جن کاموں سے اس نے منع کیا ہے ان سے رک جانا۔",
                "اپنی زبان، نظر اور دل کی پاکیزگی کا خیال رکھنا بھی اللہ کی حدود کی حفاظت ہے۔"
              ],
              "english": [
                "Guarding Allah means fulfilling His obligations (Prayer, Fasting, etc.) on time.",
                "Not transgressing His boundaries and refraining from everything He has forbidden.",
                "Protecting one's tongue, gaze, and heart from impurity is also guarding Allah's limits."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدلے میں اللہ کی مدد",
              "english": "Allah's Protection in Return"
            },
            "content": {
              "urdu": [
                "جب بندہ اللہ کے حقوق کا خیال رکھتا ہے، تو اللہ اسے دنیاوی مصائب اور شیطانی وسوسوں سے بچاتا ہے۔",
                "اللہ اسے سیدھے راستے پر ثابت قدم رکھتا ہے اور تنگیوں میں نکلنے کا راستہ بنا دیتا ہے۔",
                "جو جوانی میں اللہ کی حدود کی حفاظت کرتا ہے، اللہ بڑھاپے میں اس کی قوتوں کی حفاظت فرماتا ہے۔"
              ],
              "english": [
                "When a servant cares for Allah's rights, Allah protects them from worldly calamities and Satanic whispers.",
                "Allah keeps them steadfast on the right path and creates ways out of their hardships.",
                "Whoever guards Allah's limits in youth, Allah preserves their faculties in old age."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صرف اللہ سے مانگنا",
        "english": "Asking Only from Allah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توحید اور دعا",
              "english": "Monotheism and Supplication"
            },
            "content": {
              "urdu": [
                "دعا عبادت کا مغز ہے، اس لیے اپنی ہر حاجت کے لیے براہِ راست اللہ ہی کی طرف رجوع کرنا چاہیے۔",
                "مخلوق عاجز ہے اور وہ صرف وہی کر سکتی ہے جو اللہ نے مقدر کر دیا ہو۔",
                "اللہ سے مانگنے سے اس کا قرب حاصل ہوتا ہے جبکہ بندوں سے مانگنے سے ذلت ملتی ہے۔"
              ],
              "english": [
                "Supplication is the essence of worship; therefore, one must turn directly to Allah for every need.",
                "Creation is powerless and can only do what Allah has already decreed.",
                "Asking from Allah brings closeness to Him, while asking from people often brings humiliation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نفع اور نقصان کا مالک اللہ ہے",
        "english": "Allah is the Owner of Benefit and Harm"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عقیدہ تقدیر",
              "english": "Belief in Predestination"
            },
            "content": {
              "urdu": [
                "اگر پوری کائنات مل کر بھی تمہیں نفع دینا چاہے تو وہ اللہ کے لکھے ہوئے کے بغیر کچھ نہیں کر سکتی۔",
                "اسی طرح کوئی تمہیں نقصان نہیں پہنچا سکتا جب تک اللہ کی مرضی نہ ہو۔",
                "یہ یقین انسان کو خوف اور لالچ سے آزاد کر کے صرف اللہ کا بندہ بنا دیتا ہے۔"
              ],
              "english": [
                "Even if the entire universe united to benefit you, they could do nothing except what Allah has written.",
                "Similarly, no one can harm you unless it is by the will of Allah.",
                "This conviction frees a person from fear and greed, making them a true servant of Allah alone."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بچوں کی تربیت کا نبوی انداز",
        "english": "Prophetic Way of Training Children"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچپن میں پختہ عقیدہ",
              "english": "Firm Belief in Childhood"
            },
            "content": {
              "urdu": [
                "حضرت ابن عباس اس وقت کم عمر تھے، لیکن آپ ﷺ نے انہیں اتنے گہرے حقائق سکھائے۔",
                "یہ حدیث ظاہر کرتی ہے کہ بچوں کو بچپن ہی سے توحید اور توکل کی تعلیم دینی چاہیے۔",
                "آپ ﷺ کا ان کو 'یا غلام' (اے لڑکے) کہہ کر مخاطب کرنا شفقت اور توجہ حاصل کرنے کا بہترین طریقہ تھا۔"
              ],
              "english": [
                "Ibn 'Abbas was young at the time, yet the Prophet (ﷺ) taught him such profound truths.",
                "This shows that children should be taught Tawhid and trust in Allah from an early age.",
                "Addressing him as 'Ya Ghulam' (O young man) was a way of showing affection and gaining his focus."
              ]
            }
          }
        ]
      }
    }
  ]
}