{
  "hadithId": 1110,
  "hadithNo": 31,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/31"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (4228)، ومسلم (1762). ورواية أبي داود (2733) صحيحة أيضاً تفصل أن المجموع للفارس ثلاثة أسهم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری (4228) اور امام مسلم (1762) نے روایت کیا ہے۔ ابوداؤد کی روایت (2733) بھی صحیح ہے جو واضح کرتی ہے کہ گھڑ سوار کو کل تین حصے ملیں گے۔",
    "english": "Sahih. Reported by Al-Bukhari (4228) and Muslim (1762). The narration of Abu Dawud (2733) is also authentic and specifies that the total shares for a cavalryman are three."
  },
  "importantWords": [
    {
      "arabic": "قَسَمَ",
      "english": "Distributed/Allotted",
      "urdu": "تقسیم کیا"
    },
    {
      "arabic": "سَهْمَيْنِ",
      "english": "Two shares",
      "urdu": "دو حصے"
    },
    {
      "arabic": "الرَّاجِلِ",
      "english": "Foot-soldier",
      "urdu": "پیدل سپاہی"
    },
    {
      "arabic": "الْفَرَسِ",
      "english": "The horse",
      "urdu": "گھوڑا"
    },
    {
      "arabic": "أَسْهَمَ",
      "english": "Assigned portions",
      "urdu": "حصے مقرر کیے"
    },
    {
      "arabic": "خَيْبَرَ",
      "english": "Khaibar",
      "urdu": "خیبر (مدینہ کے قریب مقام)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مالِ غنیمت کی تقسیم کا شرعی ضابطہ بیان ہوا ہے کہ گھڑ سوار مجاہد کو اس کی مشقت اور اخراجات کی بنا پر پیدل مجاہد سے تین گنا زیادہ حصہ دیا جائے گا۔",
    "english": "This Hadith details the Shariah rule for distributing spoils of war: a cavalryman receives three times the share of a foot-soldier due to his greater contribution and expenses."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (4228)",
      "english": "Sahih al-Bukhari (4228)"
    },
    {
      "arabic": "صحيح مسلم (1762)",
      "english": "Sahih Muslim (1762)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مالِ غنیمت کی تقسیم کا اصول",
        "english": "Principles of Distributing Spoils"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھڑ سوار اور پیدل کا فرق",
              "english": "Difference Between Cavalry and Infantry"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں مالِ غنیمت کی تقسیم مجاہد کی مشقت اور سرمائے کے مطابق ہوتی ہے۔",
                "پیدل سپاہی کو صرف اس کی ذات کا ایک حصہ دیا جاتا ہے کیونکہ اس کا خرچہ کم ہے۔",
                "گھڑ سوار کو اس کی ذات کا ایک اور گھوڑے کے دو حصے ملا کر کل تین حصے دیے جاتے ہیں۔"
              ],
              "english": [
                "In Islamic law, spoils of war are distributed based on a soldier's effort and investment.",
                "A foot-soldier is granted one single share for himself as his expenses are minimal.",
                "A horseman receives one share for himself and two for his horse, totaling three shares."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کا تقاضا",
              "english": "Requirement of Justice"
            },
            "content": {
              "urdu": [
                "گھوڑے کی دیکھ بھال، خوراک اور جنگ میں اس کی افادیت پیدل سے کہیں زیادہ ہے۔",
                "زیادہ حصے کا مقصد مجاہد کے ان اخراجات کا ازالہ کرنا ہے جو اس نے گھوڑے پر کیے ہوتے ہیں۔",
                "یہ تقسیم ثابت کرتی ہے کہ اسلام میرٹ اور معاشی توازن کو اہمیت دیتا ہے۔"
              ],
              "english": [
                "The care, fodder, and military utility of a horse far exceed those of a foot-soldier.",
                "The extra shares aim to compensate the warrior for the costs incurred in maintaining the horse.",
                "This distribution proves that Islam values meritocracy and economic balance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Opinions of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور علماء کا موقف",
              "english": "Majority Scholars' Position"
            },
            "content": {
              "urdu": [
                "امام مالک، شافعی اور احمد کے نزدیک گھڑ سوار کو تین حصے (1+2) ہی ملیں گے۔",
                "یہ موقف اسی صحیح حدیث اور رسول اللہ ﷺ کے مسلسل عمل پر مبنی ہے۔",
                "اس میں گھوڑے کی قوت کو اسلامی لشکر کے لیے ایک بڑے اثاثے کے طور پر تسلیم کیا گیا ہے۔"
              ],
              "english": [
                "Imams Malik, Shafi'i, and Ahmad hold that a cavalryman gets three shares (1+2).",
                "This position is rooted in this authentic Hadith and the continuous practice of the Prophet (ﷺ).",
                "It recognizes the horse's power as a significant asset to the Islamic military force."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام ابوحنیفہ کا مسلک",
              "english": "Imam Abu Hanifa's View"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ کے نزدیک گھڑ سوار کو دو حصے (1+1) دیے جائیں گے، ایک اپنا اور ایک گھوڑے کا۔",
                "ان کی دلیل یہ تھی کہ کسی جانور کا حصہ انسان کے حصے سے زیادہ نہیں ہونا چاہیے۔",
                "تاہم، صاحبین (ابویوسف و محمد) نے صریح حدیث کی بنا پر جمہور کے قول کو اختیار کیا۔"
              ],
              "english": [
                "Imam Abu Hanifa suggested two shares (1+1) for the horseman, one for each.",
                "His reasoning was that an animal's share shouldn't exceed a human's share in value.",
                "However, his top students (Abu Yusuf and Muhammad) followed the majority based on explicit Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنگی اہمیت اور ترغیب",
        "english": "Military Importance and Incentive"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلیٰ عسکری معیار",
              "english": "High Military Standards"
            },
            "content": {
              "urdu": [
                "گھڑ سوار دستے کسی بھی فوج کی ریڑھ کی ہڈی سمجھے جاتے تھے اور جنگ کا نقشہ بدل دیتے تھے۔",
                "زیادہ حصہ دے کر مسلمانوں کو بہترین سواری اور ہتھیار تیار رکھنے کی ترغیب دی گئی۔",
                "اسلام دفاع کے لیے جدید ترین اور بہترین ذرائع اختیار کرنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Cavalry units were considered the backbone of any army and could change the tide of battle.",
                "Higher shares incentivized Muslims to prepare the best mounts and weapons for defense.",
                "Islam teaches the adoption of the latest and best means for national defense."
              ]
            }
          },
          {
            "title": {
              "urdu": "محدود حصوں کی حکمت",
              "english": "Wisdom of Limited Shares"
            },
            "content": {
              "urdu": [
                "اگر ایک شخص کے پاس ایک سے زائد گھوڑے ہوں تو اسے صرف دو گھوڑوں تک حصہ دیا جاتا ہے۔",
                "مقصد صرف ضرورت پوری کرنا ہے نہ کہ مالِ غنیمت کے ذریعے دولت کے انبار لگانا۔",
                "نظم و ضبط کی خاطر حصوں کا تعین حاکمِ وقت کی ذمہ داری ہوتی ہے۔"
              ],
              "english": [
                "If a person owns multiple horses, he is usually allotted shares for only two of them.",
                "The aim is to fulfill necessity, not to accumulate excessive wealth through spoils.",
                "Determining portions for the sake of discipline is the responsibility of the ruler."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور اخلاقی سبق",
        "english": "Educational and Moral Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محنت کا صلہ",
              "english": "Reward for Hard Work"
            },
            "content": {
              "urdu": [
                "حدیث سے سبق ملتا ہے کہ جو زیادہ مشقت کرے اسے صلہ بھی زیادہ ملنا چاہیے۔",
                "اسلام معاشی معاملات میں کسی کی حق تلفی کرنے کی اجازت نہیں دیتا۔",
                "کارکردگی کی بنیاد پر مراعات دینا معاشرے میں بہتری کا سبب بنتا ہے۔"
              ],
              "english": [
                "The Hadith teaches that those who exert more effort should receive a greater reward.",
                "Islam does not permit the infringement of anyone's rights in economic matters.",
                "Providing incentives based on performance leads to overall societal improvement."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی نظامِ عدل",
              "english": "Islamic System of Justice"
            },
            "content": {
              "urdu": [
                "مالِ غنیمت کی یہ تقسیم شفافیت اور برابری کی بہترین مثال پیش کرتی ہے۔",
                "رسول اللہ ﷺ نے خود ان قوانین کو نافذ کر کے ایک مثالی معاشرہ قائم کیا۔",
                "آج بھی ہمیں اپنے ملازمین اور ماتحتوں کو ان کی محنت کے مطابق اجر دینا چاہیے۔"
              ],
              "english": [
                "This distribution of spoils presents an excellent example of transparency and equity.",
                "The Prophet (ﷺ) established a model society by personally implementing these laws.",
                "Even today, we should reward employees and subordinates according to their labor."
              ]
            }
          }
        ]
      }
    }
  ]
}