{
  "hadithId": 446,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/22", "muslim/978", "nasai/1964"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (978). قوله 'بمشاقص': هي سهام عراض الرؤوس. وامتناع النبي صلى الله عليه وسلم عن الصلاة عليه كان زجراً للناس عن مثل فعله، لا لأنه كافر.",
    "urdu": "صحیح۔ اسے امام مسلم (978) نے روایت کیا ہے۔ 'مشاقص' سے مراد چوڑے پھل والے تیر ہیں۔ آپ ﷺ کا نمازِ جنازہ نہ پڑھنا لوگوں کو اس قبیح فعل سے روکنے کے لیے تھا، نہ کہ اس کے کافر ہونے کی بنا پر۔",
    "english": "Sahih. Reported by Muslim (978). The word 'Mashaqis' refers to arrows with broad heads. The Prophet's (ﷺ) refusal to pray over him was a deterrent for others, not an indication that the man was a disbeliever."
  },
  "importantWords": [
    {
      "arabic": "قَتَلَ نَفْسَهُ",
      "english": "Killed himself",
      "urdu": "اپنی جان لے لی"
    },
    {
      "arabic": "بِمَشَاقِصَ",
      "english": "With broad-headed arrows",
      "urdu": "چوڑے پھل والے تیروں سے"
    },
    {
      "arabic": "فَلَمْ يُصَلِّ",
      "english": "So he did not pray",
      "urdu": "پس انہوں نے نماز نہ پڑھی"
    },
    {
      "arabic": "زجراً",
      "english": "Deterrence / Warning",
      "urdu": "ڈانٹ / تنبیہ"
    },
    {
      "arabic": "كبيرة",
      "english": "Major sin",
      "urdu": "گناہِ کبیرہ"
    }
  ],
  "summary": {
    "urdu": "خودکشی ایک گناہِ کبیرہ ہے؛ رسول اللہ ﷺ نے اس کی سنگینی واضح کرنے کے لیے خودکشی کرنے والے کا جنازہ نہیں پڑھا، تاکہ دوسرے عبرت حاصل کریں۔",
    "english": "Suicide is a major sin; the Prophet (ﷺ) abstained from leading the funeral prayer for a person who committed suicide to demonstrate its gravity and deter others."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الجنائز، رقم 978",
      "english": "Sahih Muslim, The Book of Funerals, Hadith 978"
    },
    {
      "arabic": "سنن النسائي، كتاب الجنائز، رقم 1964",
      "english": "Sunan an-Nasa'i, The Book of Funerals, Hadith 1964"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن سمرة",
        "english": "Jabir bin Samura"
      },
      "slug": "jabir-bin-samura"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0h5HjIeKofA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خودکشی کی شرعی حیثیت",
        "english": "Legal Status of Suicide"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہِ کبیرہ اور وعید",
              "english": "Major Sin and Warning"
            },
            "content": {
              "urdu": [
                "اسلام میں انسانی جان اللہ کی امانت ہے اور خودکشی کرنا اللہ کی تقدیر پر عدم اطمینان اور گناہِ کبیرہ ہے۔",
                "احادیث میں آتا ہے کہ جو شخص جس چیز سے خودکشی کرے گا، اسے جہنم میں اسی چیز سے عذاب دیا جائے گا۔",
                "یہ عمل مایوسی کی انتہا ہے جو کہ ایمان کے منافی ہے کیونکہ اللہ کی رحمت سے مایوسی کفر ہے۔"
              ],
              "english": [
                "In Islam, human life is a trust from Allah, and suicide is a major sin reflecting dissatisfaction with destiny.",
                "Hadiths state that a person who commits suicide will be punished in Hell with the same means they used to kill themselves.",
                "This act represents extreme despair, which contradicts faith since losing hope in Allah's mercy is a trait of disbelief."
              ]
            }
          },
          {
            "title": {
              "urdu": "زندگی اللہ کی ملکیت ہے",
              "english": "Life Belongs to Allah"
            },
            "content": {
              "urdu": [
                "انسان کو اپنی جان پر بھی کلی اختیار حاصل نہیں ہے کہ وہ اسے جب چاہے ختم کر دے۔",
                "مصائب اور تکالیف پر صبر کرنا اجر کا باعث ہے جبکہ خودکشی کرنا اللہ کے فیصلے سے بغاوت ہے۔",
                "اسلامی شریعت جان کے تحفظ کو ضروریاتِ خمسہ (پانچ بنیادی ضرورتوں) میں شمار کرتی ہے۔"
              ],
              "english": [
                "Man does not have absolute authority over his own life to terminate it whenever he wishes.",
                "Patience during trials and hardships earns reward, whereas suicide is a rebellion against Allah's decree.",
                "Islamic Sharia considers the preservation of life as one of the five essential objectives (Maqasid al-Sharia)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازِ جنازہ نہ پڑھنے کی حکمت",
        "english": "Wisdom Behind Not Offering Funeral Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی تنبیہ اور عبرت",
              "english": "Social Warning and Lesson"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا جنازہ نہ پڑھنا اس فعل کی قباحت کو ظاہر کرنے اور دوسروں کو عبرت دلانے کے لیے تھا۔",
                "جب معاشرے کا بڑا عالم یا رہنما کسی جنازے سے رکتا ہے تو اس کا مقصد لوگوں کو برائی سے روکنا ہوتا ہے۔",
                "اس کا یہ مطلب ہرگز نہیں کہ خودکشی کرنے والا دائرہ اسلام سے خارج ہو گیا یا اسے غسل و کفن نہ دیا جائے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) refusal to lead the prayer was to highlight the ugliness of the act and serve as a lesson for others.",
                "When a prominent scholar or leader abstains from a funeral, the intent is to deter the community from evil.",
                "This does not mean the person who committed suicide has left Islam or should be denied washing and shrouding."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہگار کے لیے دعا کا حق",
              "english": "Right of Prayer for the Sinner"
            },
            "content": {
              "urdu": [
                "اگرچہ آپ ﷺ نے خود جنازہ نہیں پڑھا، لیکن صحابہ کو جنازہ پڑھنے کی اجازت دی تاکہ اس کی مغفرت کی دعا ہو سکے۔",
                "اہلِ سنت کا عقیدہ ہے کہ گناہِ کبیرہ کا مرتکب مسلمان رہتا ہے اور اس کا جنازہ پڑھا جائے گا۔",
                "حاکمِ وقت یا جید علماء ایسے جنازوں سے الگ رہ سکتے ہیں تاکہ گناہ کی سنگینی واضح ہو۔"
              ],
              "english": [
                "Although the Prophet (ﷺ) did not lead the prayer, he allowed the Companions to do so for the man's forgiveness.",
                "The creed of Ahl al-Sunnah is that a perpetrator of a major sin remains a Muslim and their funeral prayer should be offered.",
                "The ruler of the time or top scholars may distance themselves from such funerals to emphasize the gravity of the sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نفسیاتی پہلو اور ہمدردی",
        "english": "Psychological Aspect and Sympathy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذہنی صحت اور اسلام",
              "english": "Mental Health and Islam"
            },
            "content": {
              "urdu": [
                "اسلام ذہنی سکون کے لیے ذکرِ الہی اور دعا پر زور دیتا ہے تاکہ مایوسی سے بچا جا سکے۔",
                "اگر کوئی شخص ذہنی توازن کھونے کی وجہ سے خودکشی کرے تو اس کا حکم عام خودکشی کرنے والے سے مختلف ہو سکتا ہے۔",
                "معاشرے کو چاہیے کہ وہ دکھی لوگوں کی مدد کرے تاکہ وہ ایسے انتہائی اقدامات پر مجبور نہ ہوں۔"
              ],
              "english": [
                "Islam emphasizes the remembrance of Allah and supplication for mental peace to avoid despair.",
                "If someone commits suicide due to losing their mental balance, the ruling may differ from a deliberate suicide.",
                "Society must support those in distress to prevent them from being forced into such extreme measures."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ کی دعوت",
              "english": "Call to Repentance"
            },
            "content": {
              "urdu": [
                "انسان کو چاہیے کہ وہ گناہوں کے بوجھ تلے دبنے کے بجائے اللہ کی وسیع رحمت کی طرف رجوع کرے۔",
                "خودکشی توبہ کا دروازہ ہمیشہ کے لیے بند کر دیتی ہے، اس لیے یہ سب سے بڑا نقصان ہے۔",
                "مشکلات زندگی کا حصہ ہیں اور مومن ان کا مقابلہ صبر اور نماز کے ذریعے کرتا ہے۔"
              ],
              "english": [
                "A person should turn towards Allah's vast mercy instead of being crushed under the weight of sins.",
                "Suicide closes the door of repentance forever, which is why it is the greatest loss.",
                "Difficulties are part of life, and a believer faces them through patience and prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برائی سے نفرت، گناہگار سے نہیں",
              "english": "Hate the Sin, Not the Sinner"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا عمل برائی کے خلاف ایک سخت پیغام تھا تاکہ معاشرہ پاکیزہ رہے۔",
                "ہمیں گناہوں کی حوصلہ شکنی کرنی چاہیے لیکن گناہگار کی مغفرت کے لیے دعا کا راستہ بند نہیں کرنا چاہیے۔",
                "اسلامی حدود اور تعزیرات کا مقصد انتقام نہیں بلکہ اصلاح اور امن کا قیام ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) action was a strong message against evil to keep the society pure.",
                "We must discourage sins but should not close the path of praying for the sinner's forgiveness.",
                "The purpose of Islamic boundaries and punishments is not revenge, but reform and establishing peace."
              ]
            }
          },
          {
            "title": {
              "urdu": "امید کا پیغام عام کرنا",
              "english": "Spreading the Message of Hope"
            },
            "content": {
              "urdu": [
                "معاشرے میں یہ شعور اجاگر کرنا ضروری ہے کہ ہر مسئلے کا حل اللہ کے پاس موجود ہے۔",
                "خودکشی کے رجحان کو روکنے کے لیے دینی اور اخلاقی تربیت کی اشد ضرورت ہے۔",
                "نبی ﷺ کی زندگی ہمیں آزمائشوں میں ثابت قدم رہنے کا بہترین نمونہ فراہم کرتی ہے۔"
              ],
              "english": [
                "It is essential to raise awareness in society that the solution to every problem lies with Allah.",
                "Religious and moral training is urgently needed to curb the trend of suicide.",
                "The Prophet's (ﷺ) life provides the best example of remaining steadfast during trials."
              ]
            }
          }
        ]
      }
    }
  ]
}