{
  "hadithId": 151,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["1:3:8"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  
  "takhreej": {
    "arabic": " صحيح.‏ رواه البخاري (617)‏، ومسلم (1092)‏ واللفظ للبخاري.‏ الإدراج أقسام، منها إدراج كلام بعض الرواة في متن الحديث، وقد يقع الإدراج في أول الحديث وفي وسطه، كما يقع عقبه، كما في المثال المذكور هنا.‏ والجملة المدرجة هي قوله: \"وكان رجلا أعمى لا ينادي، حتى يقال له: أصبحت.‏ أصبحت\".‏ والراجح أنها من قول الزهري كما روى ذلك الطحاوي في: \"شرح المعاني\" وغيره بالإسناد الصحيح من نفس طريق البخاري، خلافا لما جزم به ابن قدامة في \"المغني\" من أن القائل هو ابن عمر.‏ ولكن لا يمنع من أن ابن شهاب قاله أن يكون قاله غيره.‏ ",
    "urdu": "صحیح۔ اسے بخاری (617) اور مسلم (1092) نے روایت کیا ہے اور یہ الفاظ بخاری کے ہیں۔ ادراج کی اقسام ہیں، جن میں سے ایک راویوں کے کلام کو حدیث کے متن میں شامل کرنا ہے۔ ادراج حدیث کے شروع، درمیان اور آخر میں واقع ہو سکتا ہے، جیسا کہ یہاں مثال میں مذکور ہے۔ مدرج جملہ یہ ہے: ”اور وہ ایک نابینا آدمی تھے جو اذان نہیں دیتے تھے، جب تک ان سے یہ نہ کہا جاتا: صبح ہو گئی، صبح ہو گئی!“ راجح یہ ہے کہ یہ جملہ زہری کا قول ہے جیسا کہ طحاوی نے ”شرح المعانی“ اور دیگر نے صحیح سند سے بخاری کے اسی طریق سے روایت کیا ہے، برخلاف ابن قدامہ کے جنہوں نے اسے ابن عمرؓ کا قول قرار دیا ہے۔ لیکن یہ امر مانع نہیں کہ اگر زہری نے یہ بات کہی ہو تو اسے کسی اور نے بھی کہا ہو۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (617) and Muslim (1092), and the wording is from Al-Bukhārī. Idrāj (Insertion) has types, one of which is inserting the words of some narrators into the text of the Hadith. Insertion can occur at the beginning, middle, or end of the Hadith, as is the case here. The inserted phrase is: 'And he was a blind man who did not call the Adhān until it was said to him: The morning has broken! The morning has broken!' The most likely view is that this is the statement of Az-Zuhrī, as narrated by At-Ṭaḥāwī in 'Sharḥ Al-Ma'ānī' and others with an authentic chain from the same path as Al-Bukhārī, contrary to Ibn Qudāmah's assertion that the speaker was Ibn 'Umar. However, it does not preclude someone else from having said it if Az-Zuhrī also said it.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "يُؤَذِّنُ بِلَيْلٍ",
      "english": "Calls the Adhān during the night",
      "urdu": "رات میں اذان کہتا ہے"
    },
    {
      "arabic": "فَكُلُوا وَاشْرَبُوا",
      "english": "So eat and drink",
      "urdu": "تم لوگ کھا پی لیا کرو"
    },
    {
      "arabic": "اِبْنُ أُمِّ مَكْتُومٍ",
      "english": "Ibn Umm Maktūm",
      "urdu": "ابن ام مکتوم"
    },
    {
      "arabic": "حَتَّى يُنَادِيَ",
      "english": "Until he calls the Adhān",
      "urdu": "یہاں تک کہ وہ اذان دے"
    },
    {
      "arabic": "رَجُلاً أَعْمَى",
      "english": "A blind man",
      "urdu": "ایک نابینا آدمی"
    },
    {
      "arabic": "أَصْبَحْتَ",
      "english": "The morning has broken",
      "urdu": "صبح ہو گئی"
    },
    {
      "arabic": "إِدْرَاجٌ",
      "english": "Insertion (of narrator's comment)",
      "urdu": "ادراج"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث دو اذانوں کی مشروعیت کو بیان کرتی ہے: پہلی اذان (بلالؓ کی) جو فجر سے قبل دی جاتی تھی تاکہ سوئے ہوئے لوگ بیدار ہو کر سحری کر لیں اور نماز کے لیے تیار ہو جائیں؛ دوسری اذان (ابن ام مکتومؓ کی) جو فجر صادق کے طلوع ہوتے ہی دی جاتی تھی اور روزے کے لیے کھانے پینے کی ممانعت (امساک) کا اعلان کرتی تھی۔",
    "english": "This Hadith legislates two Adhāns: the first (by Bilāl) was given before the true dawn to alert those sleeping to wake up, finish their Suhoor (pre-dawn meal), and prepare for prayer; the second (by Ibn Umm Maktūm) was called exactly when Fajr Ṣādiq (True Dawn) rose, marking the start of the obligatory Fajr prayer and the prohibition of eating and drinking (Imsāk) for the fast."
  },
  "references": [
    {
      "arabic": "رواه البخاري (617)",
      "english": "Reported by Al-Bukhārī (617)"
    },
    {
      "arabic": "رواه مسلم (1092)",
      "english": "Reported by Muslim (1092)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn 'Umar"
      },
      "slug": "abdullah-ibn-umar"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فجر کی دو اذانیں",
        "english": "The Two Adhāns for Fajr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بلالؓ کی پہلی اذان (بلیل)",
              "english": "Bilāl's First Adhān (By Night)"
            },
            "content": {
              "urdu": [
                "بلالؓ کی اذان فجر کا وقت شروع ہونے سے پہلے (رات کا آخری حصہ) دی جاتی تھی، جس کا مقصد تیاری اور سحری کا وقت بتانا تھا۔",
                "نبی ﷺ نے واضح فرمایا کہ اس اذان کو سن کر روزے داروں کے لیے کھانا پینا بند کرنا فرض نہیں ہوتا۔",
                "یہ اذان نفل نمازوں (جیسے تہجد) کی طرف بھی متوجہ کرتی تھی جو رات کے آخری حصے میں پڑھی جاتی ہیں۔"
              ],
              "english": [
                "Bilāl's Adhān was called before the start of Fajr time (in the last part of the night) to announce the time for Suhoor and preparation for prayer.",
                "The Prophet (ﷺ) explicitly stated that hearing this Adhān does not obligate fasters to stop eating and drinking.",
                "This Adhān also directed attention to voluntary prayers (like Tahajjud) performed in the latter part of the night."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابن ام مکتومؓ کی دوسری اذان",
              "english": "Ibn Umm Maktūm's Second Adhān"
            },
            "content": {
              "urdu": [
                "ابن ام مکتومؓ کی اذان فجر صادق (نماز فجر کا وقت شروع ہوتے ہی) کے ساتھ دی جاتی تھی اور یہ فرض اذان تھی۔",
                "اس اذان کو سنتے ہی روزے داروں پر کھانا پینا حرام ہو جاتا تھا اور فرض نماز کا وقت شروع ہو جاتا تھا۔",
                "نبی ﷺ نے دو اذانیں مقرر کر کے لوگوں کے لیے سحری اور نماز کے اوقات میں سہولت پیدا کر دی۔"
              ],
              "english": [
                "Ibn Umm Maktūm's Adhān was called immediately upon Fajr Ṣādiq (the start of Fajr prayer time) and was the obligatory Adhān.",
                "Upon hearing this Adhān, eating and drinking became forbidden for fasters, and the obligatory prayer time began.",
                "By legislating two Adhāns, the Prophet (ﷺ) created ease for people regarding the times for Suhoor and prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ابن ام مکتومؓ اور ادراج",
        "english": "Ibn Umm Maktūm and Idrāj (Insertion)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نابینا صحابی کی خصوصیت",
              "english": "The Specialty of the Blind Companion"
            },
            "content": {
              "urdu": [
                "ابن ام مکتومؓ کا نابینا ہونا ظاہر کرتا ہے کہ وہ اذان کے وقت کو دیکھنے کے بجائے دوسروں کی اطلاع پر انحصار کرتے تھے۔",
                "یہ اس بات کی دلیل ہے کہ نابینا شخص کو مؤذن مقرر کرنا جائز ہے، بشرطیکہ وہ وقت کی صحیح اطلاع حاصل کرے۔",
                "لوگوں کا انہیں صبح کی اطلاع دینا (أصبحت، أصبحت) اس بات کو یقینی بناتا تھا کہ اذان صحیح وقت پر ہو۔"
              ],
              "english": [
                "Ibn Umm Maktūm's blindness shows that he relied on others' notification for the prayer time rather than visual confirmation.",
                "This proves that it is permissible to appoint a blind person as a Mu'adhdhin, provided he receives accurate time information.",
                "The people's notification ('Aṣbaḥta, Aṣbaḥta') ensured that the Adhān was called at the correct time."
              ]
            }
          },
          {
            "title": {
              "urdu": "ادراج کی وضاحت",
              "english": "Clarification of Idrāj"
            },
            "content": {
              "urdu": [
                "حدیث کے آخر میں نابینا ہونے اور اطلاع پر اذان دینے کی تفصیل راوی (زہری) کا کلام ہے، جسے 'ادراج' کہتے ہیں۔",
                "ادراج محدثین کی اصطلاح ہے جس میں راوی کی وضاحت کو غلطی سے حدیث کا حصہ سمجھ لیا جاتا ہے۔",
                "اس وضاحت کا مقصد یہ تھا کہ ابن ام مکتومؓ کو کیوں دو اذانوں میں سے پہلی کے بجائے دوسری کے لیے مقرر کیا گیا تھا۔"
              ],
              "english": [
                "The detail about his blindness and calling the Adhān upon notification is the narrator's (Az-Zuhrī's) commentary, known as 'Idrāj.'",
                "Idrāj is a term used by Hadith scholars when a narrator's clarification is mistakenly included as part of the Prophet's statement.",
                "The purpose of this clarification was to explain why Ibn Umm Maktūm was assigned the second Adhān instead of the first."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روزے اور نماز کے احکام",
        "english": "Rulings on Fasting and Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سحری کا آخری وقت",
              "english": "The Final Time for Suhoor"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ روزے کے لیے امساک کا آخری وقت دوسری اذان (فجر صادق) کے ساتھ منسلک ہے۔",
                "بلالؓ کی اذان کے بعد بھی کھانا پینا جائز ہے، جو سحری کے وقت میں توسیع کی آسانی فراہم کرتی ہے۔",
                "مسلمان کو چاہیے کہ وہ روزہ شروع کرنے میں احتیاط کرے اور فجر صادق کے آغاز پر سحری بند کر دے۔"
              ],
              "english": [
                "This Hadith clarifies that the deadline for Imsāk (stopping food/drink) for fasting is linked to the second Adhān (Fajr Ṣādiq).",
                "Eating and drinking are permissible even after Bilāl's Adhān, providing flexibility during Suhoor.",
                "A Muslim should be cautious when starting the fast and stop Suhoor at the beginning of Fajr Ṣādiq."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحیح اذان کا مقصد",
              "english": "The Purpose of the Correct Adhān"
            },
            "content": {
              "urdu": [
                "اذان کی شرعی اہمیت وقت کے آغاز کی صحیح اطلاع دینا ہے، جس پر فرض نماز کا انحصار ہوتا ہے۔",
                "اگر ایک اذان کا مقصد تیاری اور دوسری کا مقصد وقت کے آغاز کا ہو، تو یہ شرعی انتظام کی خوبصورتی ہے۔",
                "صحیح وقت کی اذان پر مسجد پہنچنا اور نماز ادا کرنا ہی ایمان کا تقاضا ہے۔"
              ],
              "english": [
                "The legal importance of the Adhān is to give accurate notice of the time's entry, upon which the obligatory prayer depends.",
                "The system of two Adhāns (one for preparation, one for the time's start) reflects the beauty of the legal arrangement.",
                "Reaching the mosque and performing the prayer upon the correct Adhān is a requirement of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی فوائد",
        "english": "Training and Practical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مؤذن کا مقام",
              "english": "The Status of the Mu'adhdhin"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا دو مختلف مؤذنین کو مقرر کرنا ان کے بلند مقام اور معاشرے میں ان کے کردار کو ظاہر کرتا ہے۔",
                "ہر مؤذن کا کام ایک اہم دینی ذمہ داری تھی، خواہ وہ نابینا ہی کیوں نہ ہوں۔",
                "یہ مسلمانوں کو سکھاتا ہے کہ معذور افراد بھی دینی خدمات انجام دے سکتے ہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) appointment of two different Mu'adhdhins shows their high status and role in society.",
                "The job of every Mu'adhdhin was an important religious responsibility, even if they were blind.",
                "This teaches Muslims that people with disabilities can also perform religious duties."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی اور تخفیف",
              "english": "Ease and Alleviation"
            },
            "content": {
              "urdu": [
                "پہلی اذان کے ذریعے سحری میں لوگوں کے لیے کھانے پینے کی آسانی پیدا کی گئی تاکہ وہ جاگ سکیں۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام عبادات میں مشقت نہیں ڈالتا بلکہ آسانی فراہم کرتا ہے۔",
                "اس سنت پر عمل کرنے سے مسلمان سحری کے فوائد حاصل کر کے روزے کے لیے تیار ہو جاتے ہیں۔"
              ],
              "english": [
                "The first Adhān provided ease for people to eat and drink Suhoor and wake up for it.",
                "This ruling proves that Islam does not impose hardship in worship but provides convenience.",
                "By following this Sunnah, Muslims secure the benefits of Suhoor and prepare adequately for the fast."
              ]
            }
          }
        ]
      }
    }
  ]
}
