{
  "hadithId": 91,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 15 (related context)"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب الطهارة",
    "babId": 7
  },

  "takhreej": {
    "arabic": " ضعيف.  رواه البيهقي (1/96) ، وله ما يشهد له .  رواه البيهقي في السنن الكبرى (1/144).",
    "urdu": "ضعیف (کمزور) روایت۔ اسے بیہقی (1/96) نے روایت کیا ہے، اور اس کے مؤید شواہد موجود ہیں۔ اسے بیہقی نے السنن الکبریٰ (1/144) میں بھی روایت کیا ہے۔",
    "english": "Da'if (Weak) narration. Reported by Al-Bayhaqi (1/96), and it has supporting evidence. Also reported by Al-Bayhaqi in As-Sunan Al-Kubra (1/144)."
  },
  "importantWords": [
    {
      "arabic": "الْخَلَاءِ",
      "english": "The lavatory/open ground",
      "urdu": "بیت الخلاء"
    },
    {
      "arabic": "نَقْعُدَ",
      "english": "We sit",
      "urdu": "بیٹھیں"
    },
    {
      "arabic": "الْيُسْرَى",
      "english": "The left (foot/side)",
      "urdu": "بائیں پاؤں"
    },
    {
      "arabic": "نَنْصِبَ",
      "english": "We raise/erect",
      "urdu": "کھڑا رکھیں"
    },
    {
      "arabic": "الْيُمْنَى",
      "english": "The right (foot/side)",
      "urdu": "دائیں پاؤں"
    },
    {
      "arabic": "عَلَّمْنَا",
      "english": "He taught us",
      "urdu": "ہمیں تعلیم دی"
    },
    {
      "arabic": "سَنَدٍ",
      "english": "Chain of narration",
      "urdu": "سند"
    },
    {
      "arabic": "ضَعِيف",
      "english": "Weak",
      "urdu": "ضعیف"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے دوران بیٹھنے کے ایک مخصوص طریقے کی تعلیم دیتی ہے: بائیں پاؤں پر وزن ڈالنا اور دائیں کو کھڑا رکھنا، تاکہ آسانی سے طہارت ہو سکے۔",
    "english": "This Hadith teaches a specific posture for relieving oneself: sitting with weight on the left foot while keeping the right foot raised, aiming to facilitate the thorough removal of waste."
  },
  "references": [
    {
      "arabic": "رواه البيهقي (1/96)",
      "english": "Reported by Al-Bayhaqi (1/96)"
    },
    {
      "arabic": "رواه البيهقي في السنن الكبرى (1/144)",
      "english": "Reported by Al-Bayhaqi in As-Sunan Al-Kubra (1/144)"
    }
  ],
  "narrators": [
    {
      "id": 9101,
      "name": {
        "arabic": "سراقة بن مالك",
        "english": "Suraqah ibn Malik"
      },
      "slug": "suraqah-ibn-malik"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سنت اور فقہی اصول",
        "english": "Sunnah and Juristic Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیٹھنے کا مسنون طریقہ",
              "english": "The Recommended Sitting Posture"
            },
            "content": {
              "urdu": [
                "حدیث میں بائیں پاؤں پر زور ڈال کر بیٹھنے اور دائیں پاؤں کو کھڑا رکھنے کی تعلیم دی گئی ہے۔",
                "اس طریقے سے بیٹھنے کا مقصد جسم کو اس طرح ڈھالنا ہے کہ فضلے کا اخراج آسانی سے اور مکمل ہو سکے۔",
                "اگرچہ یہ روایت **ضعیف سند** سے ہے، لیکن فقہاء نے اس حکمت کی بنا پر اس عمل کو مستحسن قرار دیا ہے۔"
              ],
              "english": [
                "The Hadith teaches sitting by putting weight on the **left foot** and keeping the **right foot raised**.",
                "The purpose of this posture is to angle the body in a way that facilitates the easy and complete excretion of waste.",
                "Although this narration has a **weak chain**, jurists have deemed the practice meritorious based on its underlying wisdom."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقصد طہارت کی تکمیل",
              "english": "Completing the Goal of Purification"
            },
            "content": {
              "urdu": [
                "استنجاء کے آداب کا اصل مقصد یہ یقینی بنانا ہے کہ نجاست کا کوئی حصہ باقی نہ رہ جائے اور مکمل صفائی ہو۔",
                "یہ مخصوص بیٹھنے کا انداز آنتوں پر دباؤ ڈال کر فضلے کے مکمل اخراج میں مددگار ثابت ہوتا ہے۔",
                "چونکہ طہارت کا مکمل ہونا نماز کی قبولیت کے لیے ضروری ہے، لہٰذا ہر ممکن تدبیر اختیار کرنی چاہیے۔"
              ],
              "english": [
                "The primary goal of Istinja' etiquette is to ensure no residual filth remains, leading to complete cleanliness.",
                "This specific sitting posture helps facilitate the full evacuation of waste by applying pressure to the bowels.",
                "Since complete purity is essential for the validity of prayer, every possible measure should be adopted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحت اور طبی حکمت",
        "english": "Health and Medical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی ساخت کا فائدہ",
              "english": "Benefit of Body Structure"
            },
            "content": {
              "urdu": [
                "دائیں پاؤں کو کھڑا رکھنے اور بائیں پر وزن ڈالنے سے فضلے کے راستے (rectum) کا زاویہ کھل جاتا ہے۔",
                "یہ جسمانی پوزیشن فضلے کے اخراج کو قدرتی طور پر آسان بناتی ہے، جس سے زور لگانے کی ضرورت کم ہوتی ہے۔",
                "جدید طب میں بھی اس 'اسکواٹنگ پوزیشن' کو آنتوں کی صحت کے لیے بہترین قرار دیا گیا ہے۔"
              ],
              "english": [
                "Raising the right foot and shifting weight to the left opens the anorectal angle, promoting easy passage.",
                "This physical position naturally facilitates defecation, minimizing the need to strain.",
                "Modern medicine also recognizes this 'squatting posture' as the optimal position for intestinal health."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت پر اثرات",
              "english": "Impact on Health"
            },
            "content": {
              "urdu": [
                "کامل اور آسان اخراج سے قبض اور بواسیر (پائلز) جیسی بیماریوں کے خطرات کم ہو جاتے ہیں۔",
                "یہ سنت ہمیں سکھاتی ہے کہ بہترین طہارت کے لیے جسمانی تکنیک بھی ضروری ہیں۔",
                "اگرچہ یہ حکم ضعیف ہے، لیکن اس کی طبی حکمت اسے مستحسن عمل بنا دیتی ہے۔"
              ],
              "english": [
                "Complete and easy evacuation reduces the risks of ailments like constipation and hemorrhoids (piles).",
                "This Sunnah teaches us that physical technique is also important for achieving the best purification.",
                "Even though the ruling is weak, its medical wisdom makes it a commendable practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ضعیف روایت پر عمل",
        "english": "Acting upon a Weak Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فضائل اعمال میں گنجائش",
              "english": "Leniency in Virtuous Deeds"
            },
            "content": {
              "urdu": [
                "محدثین کے نزدیک 'ضعیف' احادیث پر فضائل اعمال، آداب اور مستحبات کے باب میں عمل کی گنجائش ہے۔",
                "چونکہ یہ عمل حلال و حرام سے متعلق نہیں بلکہ صرف آداب سے متعلق ہے، لہٰذا اس پر عمل کیا جا سکتا ہے۔",
                "یہ عمل طہارت کی تکمیل میں معاون ہے، اس لیے اسے ایک مفید تجربہ سمجھا جاتا ہے۔"
              ],
              "english": [
                "According to Hadith scholars, there is leniency to act upon 'Weak' (Da'if) narrations concerning virtuous deeds, manners, and recommended acts.",
                "Since this practice relates only to etiquette and not fundamental Halal or Haram issues, it can be practiced.",
                "This posture assists in completing purification, so it is considered a useful and beneficial practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسری سنتوں سے موافقت",
              "english": "Conformity with Other Sunnahs"
            },
            "content": {
              "urdu": [
                "دیگر صحیح احادیث بیٹھ کر قضائے حاجت کرنے کا حکم دیتی ہیں، یہ طریقہ اسی عمومی حکم کی تفصیل ہے۔",
                "نبی اکرم ﷺ نے عام طور پر دائیں ہاتھ کو اچھے اور بائیں کو کم اہمیت والے کاموں کے لیے استعمال کرنے کی ترغیب دی۔",
                "یہ آداب، طہارت کے بنیادی مقصد یعنی مکمل صفائی کو یقینی بنانے میں مدد کرتے ہیں۔"
              ],
              "english": [
                "Other authentic Hadiths command relieving oneself while sitting, and this posture is a detail of that general command.",
                "The Prophet ﷺ generally encouraged using the **right hand** for noble deeds and the **left** for less important ones, including cleansing.",
                "These manners help ensure the core objective of purity, which is complete and thorough cleansing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیت الخلا کی نوعیت",
              "english": "Type of Lavatory"
            },
            "content": {
              "urdu": [
                "یہ ہدایت روایتی بیٹھنے والے بیت الخلاء (Squat Toilets) کے لیے زیادہ مناسب اور کارآمد ہے۔",
                "جدید کرسی نما بیت الخلاء (Western Toilets) استعمال کرتے وقت بھی ممکن ہو تو پاخانے کی پوزیشن اختیار کرنی چاہیے۔",
                "بہر حال، اصل توجہ پیشاب کے قطرے مکمل طور پر روکنے اور نجاست کے مکمل اخراج پر ہونی چاہیے۔"
              ],
              "english": [
                "This instruction is most suitable and effective for traditional **squat toilets**.",
                "When using modern seated toilets (Western Toilets), one should still try to adopt a squatting-like position if possible.",
                "Regardless of the setup, the main focus should be on fully stopping urine drips and the complete expulsion of filth."
              ]
            }
          },
          {
            "title": {
              "urdu": "آداب کی جامعیت",
              "english": "Comprehensiveness of Etiquette"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا تعلیم دینا ظاہر کرتا ہے کہ اسلامی تعلیمات زندگی کے ہر پہلو میں رہنمائی فراہم کرتی ہیں۔",
                "طہارت کے آداب کی رعایت کرنا دراصل شریعت کے تمام احکام کے احترام کی علامت ہے۔",
                "یہ حکم مسلمانوں کو دنیا کے ہر معاملے میں اچھے اور مکمل طریقے کو اپنانے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The Prophet's teaching demonstrates that Islamic guidance is provided for every aspect of life.",
                "Observing the etiquette of purity is a sign of respecting all the rulings of the Shari'ah.",
                "This instruction encourages Muslims to adopt the best and most complete method in all worldly matters."
              ]
            }
          }
        ]
      }
    }
  ]
}
