{
  "hadithId": 129,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["muslim:612d"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
    "babId": 11
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (612) في كتاب المساجد ومواضع الصلاة، باب أَوْقَاتِ الصَّلَوَاتِ الْخَمْسِ. ووردت شواهد أخرى بألفاظ مختلفة في مسلم (613، 614) من حديث بريدة وأبي موسى. ",
    "urdu": "صحیح (درجہ)۔ اسے امام مسلم (612) نے 'کتاب المساجد ومواضع الصلاۃ' میں، 'نمازوں کے پانچ اوقات کے باب' میں روایت کیا ہے۔ عصر کے وقت کی تفصیل پر بریدہ (613) اور ابوموسیٰ (614) کی احادیث سے بھی شواہد موجود ہیں۔",
    "english": "Sahih (Authentic). Reported by Muslim (612) in 'The Book of Mosques and Places of Prayer', Chapter on 'The times of the five prayers'. Further narrations with different wordings concerning Asr time are reported in Muslim (613, 614) from Buraydah and Abu Musa."
  },
  "importantWords": [
    {
      "arabic": "زَالَتْ الشَّمْسُ",
      "english": "Sun passes meridian",
      "urdu": "سورج کا ڈھلنا"
    },
    {
      "arabic": "ظِلُّ الرَّجُلِ",
      "english": "A man's shadow",
      "urdu": "آدمی کا سایہ"
    },
    {
      "arabic": "كَطُولِهِ",
      "english": "The length of his height",
      "urdu": "اس کے قد کے برابر"
    },
    {
      "arabic": "تَصْفَرَّ",
      "english": "Turns yellow (pale)",
      "urdu": "زرد ہونا"
    },
    {
      "arabic": "الشَّفَقُ",
      "english": "Twilight (redness after sunset)",
      "urdu": "شفق (سرخی)"
    },
    {
      "arabic": "نِصْفِ اللَّيْلِ الْأَوْسَطِ",
      "english": "Middle of the night",
      "urdu": "آدھی رات کا درمیانی حصہ"
    },
    {
      "arabic": "طُلُوعِ الْفَجْرِ",
      "english": "Appearance of dawn (Fajr)",
      "urdu": "فجر کا طلوع ہونا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث پانچوں فرض نمازوں (ظہر، عصر، مغرب، عشاء، فجر) کے شرعی اوقات کا تفصیلی تعین کرتی ہے۔ ظہر کا وقت زوال سے لے کر سایہ ایک مثل ہونے تک، عصر کا وقت سورج کے زرد ہونے سے پہلے، مغرب کا وقت شفق (سرخی) کے غائب ہونے تک، عشاء کا وقت آدھی رات تک، اور فجر کا وقت صبح صادق سے طلوع آفتاب تک مقرر کیا گیا ہے۔",
    "english": "This Hadith provides a precise, detailed outline of the obligatory times for all five daily prayers (Dhuhr, Asr, Maghrib, Isha, Fajr). Dhuhr time starts from the sun's meridian until the shadow is the length of one's height; Asr time lasts until the sun turns yellow; Maghrib time lasts until the twilight disappears; Isha time extends until the middle of the night; and Fajr time begins with the true dawn until sunrise."
  },
  "references": [
    {
      "arabic": "رواه مسلم (612) من حديث عبد الله بن عمرو",
      "english": "Reported by Muslim (612) from 'Abdullah ibn 'Amr"
    },
    {
      "arabic": "رواه مسلم (613) من حديث بريدة",
      "english": "Reported by Muslim (613) from Buraydah"
    },
    {
      "arabic": "رواه مسلم (614) من حديث أبي موسى",
      "english": "Reported by Muslim (614) from Abu Musa"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah ibn 'Amr ibn al-'As"
      },
      "slug": "abdullah-ibn-amr-ibn-al-aas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "بريدة بن الحصيب",
        "english": "Buraydah ibn al-Husayb"
      },
      "slug": "buraydah-ibn-al-husayb"
    },
    {
      "id": 3,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa al-Ash'ari"
      },
      "slug": "abu-musa-al-ashari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj2MxKdUiCM",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازوں کے بنیادی اوقات کا تعین",
        "english": "Determining the Fundamental Prayer Times"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظہر کا ابتدائی اور آخری وقت",
              "english": "Initial and End Time of Dhuhr"
            },
            "content": {
              "urdu": [
                "ظہر کا وقت سورج کے زوال کے ساتھ ہی شروع ہو جاتا ہے، یعنی جب سورج آسمان کے درمیان سے ڈھل جائے۔",
                "یہ وقت تب تک باقی رہتا ہے جب تک کسی بھی چیز کا سایہ اس کے اصل سائے کے علاوہ اس کے قد کے برابر نہ ہو جائے۔",
                "فقہاء کے نزدیک یہ پہلی مثل کا وقت ہے جو عصر کے وقت کے آغاز کا اشارہ ہے۔"
              ],
              "english": [
                "Dhuhr time begins immediately upon the sun's decline from the meridian (Zawal).",
                "The end time is when the shadow of an object reaches the length of the object itself, plus the size of the noon shadow (Fai Zawal).",
                "This point marks the beginning of the 'Asr time according to the majority of scholars."
              ]
            }
          },
          {
            "title": {
              "urdu": "عصر کا وقت اور افضل حالت",
              "english": "Asr Time and Preferred State"
            },
            "content": {
              "urdu": [
                "نماز عصر کا وقت اس وقت تک باقی رہتا ہے جب تک کہ سورج کی روشنی زرد یا پھیکی نہ پڑ جائے، یہ مستحب وقت ہے۔",
                "بریدہ اور ابوموسیٰ کی روایتیں عصر کی نماز کو سورج کے سفید اور بلند ہونے کی حالت میں ادا کرنے کی ترغیب دیتی ہیں۔",
                "زردی کے بعد کا وقت، اگرچہ جائز ہے، مگر ناپسندیدہ (مکروہ تنزیہی) سمجھا جاتا ہے جب تک کہ ضرورت نہ ہو۔"
              ],
              "english": [
                "The time for 'Asr prayer lasts until the sun has not yet become pale or yellow, which is the preferred time.",
                "The narrations of Buraydah and Abu Musa emphasize offering 'Asr while the sun is still high and bright.",
                "The time after the sun turns yellow is permissible but disliked (Makruh Tanzihi) unless necessary."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مغرب، عشاء اور فجر کے شرعی احکام",
        "english": "Juristic Rulings for Maghrib, Isha, and Fajr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغرب اور عشاء کے وقت کا اختتام",
              "english": "The End Time for Maghrib and Isha"
            },
            "content": {
              "urdu": [
                "نماز مغرب کا وقت غروب آفتاب کے فوراً بعد شروع ہوتا ہے اور افق پر موجود شفق (سرخی) کے غائب ہونے تک رہتا ہے۔",
                "عشاء کا وقت شفق کے غائب ہونے سے لے کر رات کے درمیانی نصف حصے تک رہتا ہے، یہ اس کا اختیار کا وقت ہے۔",
                "فقہاء کی اکثریت کے مطابق عشاء کا وقت صبح صادق تک رہتا ہے، لیکن درمیانی رات تک پڑھنا افضل ہے۔"
              ],
              "english": [
                "Maghrib prayer time starts immediately after sunset and lasts until the twilight (redness on the horizon) disappears.",
                "The time for Isha prayer begins after the disappearance of twilight and extends until the middle of the night (preferred time).",
                "Although the necessity time for Isha extends until Fajr, performing it before midnight is considered superior and recommended."
              ]
            }
          },
          {
            "title": {
              "urdu": "فجر کا وقت اور ممنوع وقت",
              "english": "Fajr Time and Prohibited Time"
            },
            "content": {
              "urdu": [
                "فجر کی نماز کا وقت صبح صادق (True Dawn) کے طلوع ہونے سے شروع ہوتا ہے اور سورج کے کنارے ظاہر ہونے تک رہتا ہے۔",
                "جیسے ہی سورج طلوع ہونا شروع ہوتا ہے، نماز کا وقت ختم ہو جاتا ہے اور نماز ادا کرنا ممنوع ہو جاتا ہے۔",
                "یہ حکم اس لیے دیا گیا تاکہ کسی بھی طرح سے سورج کی پوجا کرنے والوں سے مشابہت نہ ہو۔"
              ],
              "english": [
                "Fajr prayer time starts from the appearance of the True Dawn (Fajr Sadiq) and lasts until the sun's first edge appears.",
                "As soon as the sun begins to rise (Tulu' as-Shams), the prayer time ends, and praying at this moment is prohibited.",
                "This prohibition is established to clearly distinguish Muslim worship from those who worship the rising sun."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازوں کے اوقات میں حکمت",
        "english": "The Wisdom Behind Prayer Timings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقتوں کی آسانی سے پہچان",
              "english": "Easy Recognition of Times"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے نماز کے اوقات کو سورج کی حرکت کے ساتھ جوڑ کر انہیں دنیا کے ہر خطے میں آسانی سے قابل شناخت بنا دیا۔",
                "سائے کے بڑھنے اور سورج کی رنگت تبدیل ہونے جیسے قدرتی نشانات ہر شخص کے لیے رہنمائی کا ذریعہ ہیں۔",
                "یہ حکمت اس بات کو یقینی بناتی ہے کہ نماز کی ادائیگی کسی بھی جدید آلے کے بغیر ممکن ہو۔"
              ],
              "english": [
                "Allah connected prayer times to the sun's movement, making them easily recognizable in every region of the world.",
                "Natural signs, such as shadow length and sun color change, serve as guidance for every person.",
                "This wisdom ensures that performing the prayer is possible without reliance on modern instruments."
              ]
            }
          },
          {
            "title": {
              "urdu": "افضل وقت کی اہمیت",
              "english": "Importance of the Preferred Time"
            },
            "content": {
              "urdu": [
                "حدیث میں نماز کے شروع ہونے اور بہترین وقت (افضل) اور آخری وقت (جواز) دونوں کا ذکر کیا گیا ہے۔",
                "مسلم کی شواہد عصر کی نماز کو سورج کی سفیدی اور صفائی برقرار رہنے تک ادا کرنے کی فضیلت بتاتی ہیں۔",
                "ایک مسلمان کو کوشش کرنی چاہیے کہ وہ نماز کو اس کے افضل وقت میں ادا کرے تاکہ زیادہ ثواب حاصل ہو۔"
              ],
              "english": [
                "The Hadith mentions both the beginning, the preferred (optimal), and the final (permissible) times for prayer.",
                "The supplementary narrations in Muslim highlight the virtue of offering 'Asr while the sun is still clear and bright.",
                "A Muslim should strive to perform prayers within their most preferred window to attain greater reward and excellence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں رہنمائی",
        "english": "Guidance for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی بروقت ادائیگی",
              "english": "Performing Prayer on Time"
            },
            "content": {
              "urdu": [
                "یہ حدیث وقت پر نماز ادا کرنے کی فرضیت اور اہمیت کو واضح کرتی ہے۔",
                "نمازی کو اپنے تمام کاموں کو نماز کے اوقات کے مطابق ترتیب دینے کی کوشش کرنی چاہیے۔",
                "اوقات کی پابندی اللہ کے ساتھ ہمارے عہد کی پختگی کی علامت ہے۔"
              ],
              "english": [
                "This Hadith clearly establishes the obligation and importance of performing prayers within their prescribed times.",
                "A worshipper should strive to organize their daily activities around the prayer timings.",
                "Adherence to these timings is a sign of firmness in our covenant with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدود اور سائنسی مطابقت",
              "english": "Boundaries and Scientific Correspondence"
            },
            "content": {
              "urdu": [
                "حدیث میں دیے گئے سائے اور آسمانی رنگت کے اشارے آج کے فلکیاتی علم سے مکمل طور پر ہم آہنگ ہیں۔",
                "یہ مطابقت اس بات کی گواہی ہے کہ نبی کریم صلی اللہ علیہ وسلم کی تعلیمات وحی پر مبنی تھیں۔",
                "مسلمانوں کے لیے ضروری ہے کہ وہ ان حدود کو سمجھیں تاکہ ان کی عبادت درست ہو۔"
              ],
              "english": [
                "The indications of shadow and sky color given in the Hadith are in complete correspondence with modern astronomical science.",
                "This consistency serves as a testament that the teachings of the Prophet (ﷺ) were based on Divine Revelation.",
                "It is essential for Muslims to understand these boundaries for the validity and correctness of their worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی اور فقہی دروس",
        "english": "Shariah and Fiqh Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمع صلاۃ کا اصول",
              "english": "Principle of Combining Prayers (Jam')"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ اصول اخذ کیا جاتا ہے کہ ظہر اور عصر، نیز مغرب اور عشاء کی نمازوں میں وقت کا اشتراک ہے۔",
                "اختتامِ ظہر اور آغازِ عصر کا وقت ایک ہی نقطہ پر ملتا ہے، جو جمع صلاۃ کی گنجائش کو ظاہر کرتا ہے۔",
                "سفر یا عذر کی حالت میں دو نمازوں کو ایک وقت میں جمع کرنے کا فقہی جواز اسی بنیاد پر دیا جاتا ہے۔"
              ],
              "english": [
                "This Hadith establishes the principle that Dhuhr and 'Asr, as well as Maghrib and 'Isha, have overlapping time limits.",
                "The end of Dhuhr and the beginning of 'Asr meet at a single point, suggesting the possibility of combining them.",
                "The juristic allowance for combining two prayers (Jam') during travel or necessity is based on this principle."
              ]
            }
          },
          {
            "title": {
              "urdu": "سائے سے وقت کا تعین",
              "english": "Determining Time by Shadow"
            },
            "content": {
              "urdu": [
                "حدیث میں سائے کو ظہر اور عصر کے اوقات کے درمیان حد فاصل قرار دیا گیا ہے، جو ایک بنیادی فقہی پیمانہ ہے۔",
                "شافعی اور مالکی مذاہب میں 'سایہ ایک مثل' پر عصر کا وقت شروع ہونے کا قول اسی حدیث سے لیا گیا ہے۔",
                "سایہ ایک مثل ہونے کا مطلب ہے کہ چیز کا سایہ زوال کے سائے کے علاوہ اس کے قد کے برابر ہو جائے۔"
              ],
              "english": [
                "The Hadith designates shadow length as the boundary between Dhuhr and 'Asr, establishing a foundational juristic measure.",
                "The opinion in the Shafi'i and Maliki schools that 'Asr begins when the shadow is 'one likeness' is derived from this Hadith.",
                "'One likeness' means the object's shadow is equal to its height, in addition to the shadow present at Zawal."
              ]
            }
          }
        ]
      }
    }
  ]
}
