{
  "hadithId": 1354,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/122"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6398)، ومسلم (2719).",
    "urdu": "صحیح۔ اسے امام بخاری (6398) اور امام مسلم (2719) نے روایت کیا ہے۔ یہ دعا استغفار کے جامع ترین کلمات پر مشتمل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6398) and Muslim (2719). This supplication is one of the most comprehensive formulas for seeking forgiveness."
  },
  "importantWords": [
    {
      "arabic": "إِسْرَافِي",
      "english": "My immoderation / excess",
      "urdu": "میری زیادتی / حد سے تجاوز"
    },
    {
      "arabic": "جِدِّي",
      "english": "My seriousness",
      "urdu": "میری سنجیدگی"
    },
    {
      "arabic": "هَزْلِي",
      "english": "My jesting / joking",
      "urdu": "میرا مذاق / ہنسی"
    },
    {
      "arabic": "الْمُقَدِّمُ",
      "english": "The Advancer",
      "urdu": "آگے بڑھانے والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ نے گناہوں کی ہر ممکنہ قسم (ظاہری، باطنی، دانستہ، نادانستہ) سے اللہ کی مغفرت طلب کی ہے، جو امت کے لیے عاجزی اور توبہ کا ایک کامل نمونہ ہے۔",
    "english": "In this Hadith, the Prophet (ﷺ) sought Allah's forgiveness for every possible type of sin (hidden, apparent, intentional, accidental), providing a perfect model of humility and repentance for the Ummah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الدعوات، رقم 6398",
      "english": "Sahih al-Bukhari, Book of Supplications, No. 6398"
    },
    {
      "arabic": "صحيح مسلم، كتاب الذكر والدعاء، رقم 2719",
      "english": "Sahih Muslim, Book of Remembrance and Supplication, No. 2719"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa al-Ash'ari"
      },
      "slug": "abu-musa-al-ash-ari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استغفار کی جامعیت",
        "english": "Comprehensiveness of Seeking Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہوں کا احاطہ",
              "english": "Encompassing All Sins"
            },
            "content": {
              "urdu": [
                "اس دعا میں 'خطا' (غلطی) اور 'عمد' (ارادہ) دونوں کا ذکر ہے، جس کا مطلب ہے کہ انسان سے نادانی میں ہونے والے گناہ بھی معافی کے محتاج ہیں۔",
                "'جدی و هزلی' (سنجیدگی اور مذاق) کا ذکر اس لیے کیا گیا کہ بسا اوقات انسان ہنسی مذاق میں ایسی بات کہہ جاتا ہے جو اللہ کی ناراضگی کا سبب بنتی ہے۔",
                "'اسراف' سے مراد وہ زیادتیاں ہیں جو انسان اپنے نفس پر گناہوں کے ذریعے کرتا ہے۔"
              ],
              "english": [
                "The mention of 'mistakes' and 'intentional' sins signifies that even accidental errors require seeking forgiveness.",
                "'Seriousness and jesting' are included because sometimes a person says something in a joke that incurs Allah's displeasure.",
                "'Immoderation' refers to the excesses a person commits against their own soul through sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کے علم اور قدرت کا اعتراف",
        "english": "Acknowledging Allah's Knowledge and Power"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پوشیدہ اور اعلانیہ گناہ",
              "english": "Hidden and Manifest Sins"
            },
            "content": {
              "urdu": [
                "انسان بہت سے ایسے گناہ بھی کرتا ہے جنہیں وہ بھول جاتا ہے، مگر وہ اللہ کے ریکارڈ میں موجود ہوتے ہیں، اسی لیے 'جسے تو مجھ سے زیادہ جانتا ہے' کے الفاظ استعمال ہوئے۔",
                "اللہ ہی 'المقدم' اور 'المؤخر' ہے؛ وہ جسے چاہے اپنی رحمت سے بلند کر دے اور جسے چاہے گناہوں کی وجہ سے پیچھے کر دے۔",
                "مغفرت کا مکمل اختیار صرف اللہ کے پاس ہے کیونکہ وہی ہر چیز پر قادر ہے۔"
              ],
              "english": [
                "Humans commit many sins they forget, but these remain in Allah's record; hence the phrase 'what You know better than I' is used.",
                "Allah is the Advancer and the Delayer; He elevates whomever He wills with mercy and holds back whomever He wills due to sins.",
                "The absolute authority to forgive lies only with Allah as He is Powerful over everything."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی عاجزی اور مقامِ بندگی",
        "english": "Prophetic Humility and the Station of Servitude"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معصوم ہونے کے باوجود دعا",
              "english": "Supplication Despite Being Sinless"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ معصوم تھے، آپ ﷺ کا یہ دعا فرمانا درحقیقت امت کو توبہ کا طریقہ سکھانے اور اللہ کی بارگاہ میں انتہا درجے کی عاجزی کے لیے تھا۔",
                "یہ دعا سکھاتی ہے کہ کوئی بھی انسان اللہ کی رحمت اور مغفرت سے بے نیاز نہیں ہو سکتا۔",
                "اپنی کمزوری کا اعتراف 'وکل ذلک عندی' (یہ سب مجھ میں ہیں) بندگی کا جوہر ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was infallible (Ma'sum); his supplication was to teach the Ummah how to repent and demonstrate extreme humility before Allah.",
                "This Dua teaches that no human can be independent of Allah's mercy and forgiveness.",
                "Admitting one's weakness—'all of these are in me'—is the essence of servitude."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کا معمول",
              "english": "Routine of Supplication"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ ان مسنون کلمات کو یاد کریں اور اپنی نمازوں کے آخر میں یا تنہائی میں باقاعدگی سے پڑھیں۔",
                "گناہوں کو کبھی چھوٹا نہیں سمجھنا چاہیے، بلکہ ہمیشہ اللہ سے بخشش مانگتے رہنا چاہیے۔",
                "استغفار دل کی صفائی اور رزق میں برکت کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "We should memorize these Sunnah words and recite them regularly, especially at the end of prayers or in private.",
                "Sins should never be underestimated; one must always seek Allah's pardon.",
                "Seeking forgiveness is the best way to purify the heart and bring blessings to one's provision."
              ]
            }
          }
        ]
      }
    }
  ]
}