{
  "hadithId": 1355,
  "hadithNo": 24,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh:1532"
    ],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "كتاب الجامع",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2720) والنسائي (5511) والبخاري في الأدب المفرد (672).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح (2720) میں روایت کیا ہے۔ یہ ایک نہایت جامع دعا ہے جس میں دین، دنیا اور آخرت کی بھلائیوں کو جمع کر دیا گیا ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (2720), An-Nasa'i (5511), and Al-Bukhari in Al-Adab al-Mufrad (672)."
  },
  "importantWords": [
    {
      "arabic": "عِصْمَةُ أَمْرِي",
      "english": "Safeguard of my affairs",
      "urdu": "میرے معاملے کا تحفظ / بچاؤ"
    },
    {
      "arabic": "مَعَاشِي",
      "english": "My livelihood",
      "urdu": "میرا گزر بسر / معیشت"
    },
    {
      "arabic": "مَعَادِي",
      "english": "My return / destination",
      "urdu": "میرے لوٹنے کی جگہ"
    },
    {
      "arabic": "زِيَادَةً",
      "english": "An increase",
      "urdu": "زیادتی / اضافہ"
    },
    {
      "arabic": "رَاحَةً",
      "english": "A rest / relief",
      "urdu": "آرام / راحت"
    }
  ],
  "summary": {
    "urdu": "یہ دعا ایک مومن کی زندگی کے تمام اہم گوشوں کا احاطہ کرتی ہے: دین کی پختگی، دنیاوی ضروریات کی تکمیل، آخرت کی کامیابی، اور زندگی و موت کے فلسفے کی درستی۔",
    "english": "This supplication covers all essential aspects of a believer's life: religious integrity, worldly stability, success in the Hereafter, and a righteous perspective on life and death."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2720)",
      "english": "Sahih Muslim (2720)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دین، دنیا اور آخرت کی اصلاح",
        "english": "Rectification of Deen, Dunya, and Hereafter"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین کی اہمیت",
              "english": "Importance of Deen"
            },
            "content": {
              "urdu": [
                "دین کی اصلاح کا مطلب عقیدے اور عمل کی درستی ہے کیونکہ یہی انسان کی دنیا و آخرت کی حفاظت کرتا ہے۔",
                "اگر دین درست نہ ہو تو دنیاوی کامیابی کسی کام کی نہیں۔",
                "دین کو 'عصمت' (بچاؤ) اس لیے کہا گیا کیونکہ یہ فتنوں سے بچاتا ہے۔"
              ],
              "english": [
                "Setting the religion right means rectifying beliefs and actions as it safeguards one's life and afterlife.",
                "If religion is compromised, worldly success is meaningless.",
                "It is called a 'safeguard' (Ismah) because it protects one from spiritual trials."
              ]
            }
          },
          {
            "title": {
              "urdu": "دنیا اور آخرت کا توازن",
              "english": "Balance of Worldly and Eternal Life"
            },
            "content": {
              "urdu": [
                "اسلام دنیا کو ترک کرنے کا حکم نہیں دیتا بلکہ اس کی اصلاح (حلال رزق اور سکون) کی دعا سکھاتا ہے۔",
                "آخرت کی اصلاح کا مطلب جنت کا حصول اور اللہ کی رضا ہے۔",
                "مومن کا مقصد دنیا میں رہتے ہوئے آخرت کی تیاری کرنا ہے۔"
              ],
              "english": [
                "Islam does not order the abandonment of the world but teaches to pray for its betterment (lawful provision and peace).",
                "Rectifying the Hereafter means attaining Paradise and Allah's pleasure.",
                "A believer's goal is to prepare for the Afterlife while living in this world."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زندگی اور موت کا فلسفہ",
        "english": "The Philosophy of Life and Death"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زندگی خیر کی زیادتی ہے",
              "english": "Life as an Increase in Goodness"
            },
            "content": {
              "urdu": [
                "طویل زندگی صرف اس صورت میں نعمت ہے جب وہ نیکیوں میں اضافے کا سبب بنے۔",
                "ہر نیا دن اللہ کی طرف سے توبہ اور اجر کمانے کا ایک نیا موقع ہوتا ہے۔",
                "مومن کو لمبی زندگی کی تمنا صرف نیکی کے ارادے سے کرنی چاہیے۔"
              ],
              "english": [
                "A long life is only a blessing if it serves as a means to increase good deeds.",
                "Every new day is a fresh opportunity from Allah for repentance and earning rewards.",
                "A believer should desire a long life only with the intention of doing more good."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت شر سے راحت ہے",
              "english": "Death as a Relief from Evil"
            },
            "content": {
              "urdu": [
                "موت کے ذریعے انسان دنیا کے فتنوں، گناہوں اور تکالیف سے نجات پاتا ہے۔",
                "یہ دعا سکھاتی ہے کہ موت پر غمزدہ ہونے کے بجائے اسے اللہ کی رحمت کا ذریعہ سمجھا جائے۔",
                "مومن کے لیے موت اللہ سے ملاقات اور تمام دنیاوی شرور سے خلاصی کا نام ہے۔"
              ],
              "english": [
                "Through death, a person finds escape from worldly trials, sins, and hardships.",
                "This prayer teaches that death can be viewed as a gateway to Allah's mercy rather than just an end.",
                "For a believer, death is meeting with Allah and a release from all worldly evils."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کو معمول بنانا",
              "english": "Making Du'a a Habit"
            },
            "content": {
              "urdu": [
                "یہ دعا بہت جامع ہے، اسے روزانہ کم از کم ایک بار ضرور پڑھنا چاہیے۔",
                "اپنے معاملات کو اللہ کے سپرد کر دینے سے ذہنی سکون حاصل ہوتا ہے۔",
                "نیکی کرنے کی توفیق اور برائی سے بچنے کی ہمت صرف اللہ ہی دیتا ہے۔"
              ],
              "english": [
                "This prayer is highly comprehensive; it should be recited at least once daily.",
                "Entrusting one's affairs to Allah results in mental peace.",
                "The guidance to do good and the strength to avoid evil come only from Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}