{
  "hadithId": 574,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/68"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "كتاب الصيام",
    "babId": 35
  },
 
  "takhreej": {
    "arabic": "ضعيف مرفوعاً وصحيح موقوفاً. رواه الدارقطني (2/199) والحاكم (1/439). والراجح أنه من كلام ابن عباس رضي الله عنهما (موقوف).",
    "urdu": "ضعیف۔ یہ روایت مرفوعاً ضعیف ہے لیکن موقوفاً (ابن عباس کا قول) صحیح ہے۔ دارقطنی اور حاکم نے اسے نقل کیا ہے، مگر محدثین کے نزدیک اسے ابن عباس کا اپنا قول سمجھنا زیادہ درست ہے۔",
    "english": "Da'if as a Marfu' Hadith, but Sahih as a Mauquf statement. Reported by ad-Daraqutni (2/199) and al-Hakim (1/439). The preferred view is that it is the statement of Ibn Abbas himself."
  },
  "importantWords": [
    {
      "arabic": "اَلْمُعْتَكِفِ",
      "english": "One in Itikaf",
      "urdu": "اعتکاف کرنے والا"
    },
    {
      "arabic": "صِيَامٌ",
      "english": "Fasting",
      "urdu": "روزہ"
    },
    {
      "arabic": "لَيْسَ",
      "english": "Is not / There is no",
      "urdu": "نہیں ہے"
    },
    {
      "arabic": "يَجْعَلَهُ",
      "english": "Makes it / Obligates it",
      "urdu": "وہ اسے کر لے"
    },
    {
      "arabic": "نَفْسِهِ",
      "english": "Himself",
      "urdu": "اپنی ذات"
    }
  ],
  "summary": {
    "urdu": "اعتکاف کے لیے روزہ رکھنا بذاتِ خود لازمی شرط نہیں ہے، سوائے اس کے کہ انسان نذر مان کر اسے خود پر واجب کر لے۔",
    "english": "Fasting is not an inherent requirement for Itikaf unless the person makes it obligatory upon themselves through a vow (Nadr)."
  },
  "references": [
    {
      "arabic": "رواه الدارقطني (2382)",
      "english": "Reported by ad-Daraqutni (2382)"
    },
    {
      "arabic": "رواه الحاكم (1607)",
      "english": "Reported by al-Hakim (1607)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=D-vB0xL_V5Y",
  "grade": {
    "arabic": "ضعيف مرفوعاً / راجح موقوفاً",
    "english": "Weak as Marfu' / Likely Mauquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اعتکاف اور روزے کا تعلق",
        "english": "Relation between Itikaf and Fasting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزے کی فرضیت کا مسئلہ",
              "english": "The Issue of Mandatory Fasting"
            },
            "content": {
              "urdu": [
                "اس حدیث سے معلوم ہوتا ہے کہ اعتکاف کے لیے روزہ شرط نہیں ہے۔",
                "اگر کوئی بغیر روزے کے اعتکاف کرنا چاہے تو اس کی گنجائش موجود ہے۔",
                "تاہم، رمضان کے اعتکاف میں روزہ خود بخود شامل ہوتا ہے کیونکہ وہ مہینہ ہی روزوں کا ہے۔"
              ],
              "english": [
                "This Hadith suggests that fasting is not a mandatory condition for Itikaf.",
                "If someone wishes to perform Itikaf without fasting, there is some scholarly scope.",
                "However, in Ramadan, fasting is automatically included as it is the month of fasting anyway."
              ]
            }
          },
          {
            "title": {
              "urdu": "نذر کا اعتکاف",
              "english": "Itikaf of a Vow (Nadr)"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص منت مانے کہ وہ روزے کے ساتھ اعتکاف کرے گا، تو روزہ واجب ہوگا۔",
                "بغیر نذر کے نفلی اعتکاف میں روزے کی شرط پر فقہاء کے درمیان اختلاف ہے۔",
                "یہ حدیث اس لچک کی طرف اشارہ کرتی ہے کہ اعتکاف مستقل عبادت ہے۔"
              ],
              "english": [
                "If a person vows to perform Itikaf with a fast, then the fast becomes obligatory.",
                "Regarding voluntary Itikaf without a vow, jurists differ on the necessity of fasting.",
                "This Hadith points toward the flexibility that Itikaf is an independent act of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Opinions of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ائمہ کا اختلاف",
              "english": "Disagreement among Imams"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک بغیر روزے کے اعتکاف درست ہے۔",
                "امام ابوحنیفہ اور امام مالک کے نزدیک اعتکاف کے لیے روزہ شرط ہے۔",
                "یہ حدیث شافعی اور حنبلی مسلک کے موقف کی تائید کرتی ہے۔"
              ],
              "english": [
                "According to Imams Shafi'i and Ahmad, Itikaf is valid without fasting.",
                "According to Imams Abu Hanifa and Malik, fasting is a condition for Itikaf.",
                "This Hadith supports the position of the Shafi'i and Hanbali schools."
              ]
            }
          },
          {
            "title": {
              "urdu": "مرفوع اور موقوف کا فرق",
              "english": "Difference between Marfu' and Mauquf"
            },
            "content": {
              "urdu": [
                "محدثین کے نزدیک یہ الفاظ نبی ﷺ کے نہیں بلکہ ابن عباس کے ہیں۔",
                "کسی بھی شرعی مسئلے میں صحابی کا قول بھی اہمیت کا حامل ہوتا ہے۔",
                "مرفوع روایت کے ضعیف ہونے سے حکم کی قطیعت پر اثر پڑتا ہے۔"
              ],
              "english": [
                "Scholars of Hadith state these are words of Ibn Abbas, not the Prophet (ﷺ).",
                "The statement of a companion holds significant weight in legal issues.",
                "The weakness of the Marfu' version affects the decisiveness of the ruling."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عبادت کی روح اور مقصد",
        "english": "The Spirit and Purpose of Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتکاف کی انفرادیت",
              "english": "Uniqueness of Itikaf"
            },
            "content": {
              "urdu": [
                "اعتکاف کا مقصد مسجد میں ٹھہر کر اللہ کا قرب حاصل کرنا ہے۔",
                "اگرچہ روزہ اسے نور علیٰ نور بنا دیتا ہے، لیکن یہ بذاتِ خود مستقل ہے۔",
                "شریعت نے عبادات کو ایک دوسرے سے منسلک کرنے میں آسانی رکھی ہے۔"
              ],
              "english": [
                "The purpose of Itikaf is to seek proximity to Allah by staying in the mosque.",
                "While fasting adds light upon light to it, Itikaf is independent in nature.",
                "Sharia has provided ease in how different acts of worship are linked."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی کی پیروی",
              "english": "Following the Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا معمول ہمیشہ روزے کے ساتھ اعتکاف کرنے کا تھا۔",
                "افضل یہی ہے کہ اعتکاف روزے کی حالت میں ہی کیا جائے۔",
                "رخصت اور عزیمت کے فرق کو سمجھنا علمی گہرائی کے لیے ضروری ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) habit was always to perform Itikaf while fasting.",
                "It is superior to perform Itikaf in a state of fasting.",
                "Understanding the difference between concession and the ideal path is vital for knowledge."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفلی اعتکاف کی گنجائش",
              "english": "Scope for Voluntary Itikaf"
            },
            "content": {
              "urdu": [
                "اگر کوئی تھوڑی دیر کے لیے مسجد میں رکے تو وہ اعتکاف کی نیت کر سکتا ہے۔",
                "اس صورت میں روزے کا ہونا ضروری نہیں مانا جاتا۔",
                "مساجد میں گزارا گیا وقت ضائع ہونے کے بجائے عبادت بن جاتا ہے۔"
              ],
              "english": [
                "If someone stays in the mosque for a short time, they can intend for Itikaf.",
                "In this scenario, fasting is not considered a prerequisite.",
                "Time spent in mosques becomes worship instead of being wasted."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی تحقیق کا فائدہ",
              "english": "Benefits of Scholarly Research"
            },
            "content": {
              "urdu": [
                "احادیث کی فنی جانچ پڑتال سے مسائل کی درست تفہیم حاصل ہوتی ہے۔",
                "محدثین کی محنت ہمیں اصل دین تک پہنچنے میں مدد دیتی ہے۔",
                "اختلافی مسائل میں اعتدال اور دوسروں کے موقف کا احترام کرنا چاہیے۔"
              ],
              "english": [
                "Technical investigation of Hadith leads to correct understanding of issues.",
                "The efforts of Hadith scholars help us reach the authentic core of religion.",
                "In disputed matters, one should maintain moderation and respect other views."
              ]
            }
          }
        ]
      }
    }
  ]
}