{
  "hadithId": 577,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/577"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 35
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه الترمذي (3513)، والنسائي في الكبرى (10708)، وابن ماجه (3850)، وأحمد (25384)، والحاكم (1/530).",
    "urdu": "صحیح روایت ہے۔ اسے ترمذی (3513)، ابن ماجہ (3850)، احمد (25384) اور نسائی نے روایت کیا ہے۔ امام ترمذی اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by At-Tirmidhi (3513), Ibn Majah (3850), Ahmad (25384), and An-Nasa'i. Graded Sahih by At-Tirmidhi and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "عَفُوٌّ",
      "english": "Pardoner / Forgiver",
      "urdu": "درگزر کرنے والا"
    },
    {
      "arabic": "تُحِبُّ",
      "english": "You Love",
      "urdu": "تو پسند کرتا ہے"
    },
    {
      "arabic": "فَاعْفُ",
      "english": "So pardon / forgive",
      "urdu": "پس معاف فرما دے"
    },
    {
      "arabic": "أَرَأَيْتَ",
      "english": "Inform me / Tell me",
      "urdu": "مجھے بتائیے / کیا خیال ہے"
    },
    {
      "arabic": "لَيْلَةُ اَلْقَدْرِ",
      "english": "The Night of Decree",
      "urdu": "قدر والی رات"
    }
  ],
  "summary": {
    "urdu": "شب قدر کی سب سے افضل دعا اللہ سے معافی اور درگزر کی طلب ہے، جو نبی ﷺ نے سیدہ عائشہ رضی اللہ عنہا کو سکھائی۔",
    "english": "The most superior supplication for Laylat al-Qadr is seeking Allah's pardon and forgiveness, as taught by the Prophet (ﷺ) to Aisha (RA)."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (3513)",
      "english": "Reported by At-Tirmidhi (3513)"
    },
    {
      "arabic": "رواه ابن ماجه (3850)",
      "english": "Reported by Ibn Majah (3850)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9_mK02-v6w",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کی جامعیت اور معافی کی طلب",
        "english": "Comprehensiveness of the Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظ 'عفو' کی گہرائی",
              "english": "Depth of the word 'Afuw'"
            },
            "content": {
              "urdu": [
                "عفو کا مطلب ہے گناہ کو اس طرح مٹا دینا کہ اس کا کوئی نشان باقی نہ رہے۔",
                "یہ مغفرت سے زیادہ گہرا لفظ ہے کیونکہ اس میں گناہ کا نام و نشان مٹانا شامل ہے۔",
                "اللہ کی صفتِ عفو بندے کے نامہ اعمال سے برائیوں کو بالکل صاف کر دیتی ہے۔"
              ],
              "english": [
                "Al-Afuw means erasing the sin entirely so that no trace of it remains.",
                "It is more profound than Maghfirah as it involves wiping away the record of the sin.",
                "Allah's attribute of pardon cleanses the believer's scroll of deeds completely."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی پسندیدہ صفت",
              "english": "Allah's Beloved Attribute"
            },
            "content": {
              "urdu": [
                "حدیث بتاتی ہے کہ اللہ تعالیٰ معاف کرنے کو خود پسند فرماتا ہے۔",
                "جب بندہ معافی مانگتا ہے تو وہ اللہ کی محبوب صفت کو پکارتا ہے۔",
                "یہ دعا اللہ کے غصے کو ٹھنڈا کرنے اور اس کی رحمت کو متوجہ کرنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "The Hadith indicates that Allah Himself loves to pardon His servants.",
                "When a servant asks for pardon, they invoke an attribute beloved to Allah.",
                "This supplication is the best way to cool Allah's anger and attract His mercy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شب قدر اور خصوصی دعا",
        "english": "Laylat al-Qadr and Special Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "افضل وقت میں افضل ترین مانگ",
              "english": "The Best Request in the Best Time"
            },
            "content": {
              "urdu": [
                "ہزار مہینوں سے بہتر رات میں نبی ﷺ نے دنیاوی مال کے بجائے معافی مانگنے کی تلقین فرمائی۔",
                "اگر اللہ معاف کر دے تو دنیا اور آخرت کی تمام منزلیں خود بخود آسان ہو جاتی ہیں۔",
                "یہ دعا انسان کو تکبر سے نکال کر عاجزی اور بندگی کے مقام پر کھڑا کرتی ہے۔"
              ],
              "english": [
                "In a night better than a thousand months, the Prophet (ﷺ) urged seeking pardon over worldly gains.",
                "If Allah pardons a servant, all stages of this life and the hereafter become easy.",
                "This dua removes arrogance and places the human in a state of true humility and servitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدہ عائشہ کا علمی شوق",
              "english": "Aisha's (RA) Zeale for Knowledge"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ کا سوال ظاہر کرتا ہے کہ وہ برکت والی راتوں میں عمل کے لیے فکرمند تھیں۔",
                "انہوں نے بہترین عمل کے بارے میں پوچھا تاکہ امت کو رہنمائی مل سکے۔",
                "یہ حدیث خواتین کے علمی مقام اور ان کے سوالات کی اہمیت کو بھی اجاگر کرتی ہے۔"
              ],
              "english": [
                "Aisha's (RA) question shows her concern for performing the best actions during blessed nights.",
                "She asked for the most superior deed to provide guidance for the entire Ummah.",
                "This Hadith highlights the intellectual status of women and the importance of their queries."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی فوائد",
        "english": "Juristic and Ethical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کا طریقہ کار",
              "english": "Etiquette of Supplication"
            },
            "content": {
              "urdu": [
                "دعا میں پہلے اللہ کی تعریف (عفو ہونا) بیان کرنا اور پھر اپنی ضرورت مانگنا مسنون ہے۔",
                "اس دعا کو رمضان کے آخری عشرے کی ہر رات میں کثرت سے پڑھنا چاہیے۔",
                "اخلاص کے ساتھ مانگی گئی یہ مختصر دعا زندگی بدلنے کی طاقت رکھتی ہے۔"
              ],
              "english": [
                "It is Sunnah to first praise Allah's attributes before making a personal request.",
                "This supplication should be recited frequently during every night of the last ten days.",
                "This short dua, when asked with sincerity, has the power to transform one's life."
              ]
            }
          },
          {
            "title": {
              "urdu": "بندوں کو معاف کرنا",
              "english": "Pardoning Others"
            },
            "content": {
              "urdu": [
                "جو اللہ سے معافی کا طلبگار ہے، اسے چاہیے کہ وہ اللہ کی مخلوق کو بھی معاف کرے۔",
                "اللہ ان پر رحم کرتا ہے جو دوسروں پر رحم کرتے اور انہیں درگزر کرتے ہیں۔",
                "اس دعا کا اخلاقی تقاضا ہے کہ ہم اپنے دلوں کو دوسروں کے خلاف کینہ سے پاک کریں۔"
              ],
              "english": [
                "One who seeks Allah's pardon should also be willing to pardon Allah's creation.",
                "Allah shows mercy to those who are merciful and forgiving toward others.",
                "The ethical requirement of this dua is to cleanse our hearts of grudges against others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمضان کا حاصل",
              "english": "The Fruit of Ramadan"
            },
            "content": {
              "urdu": [
                "رمضان کا اصل مقصد مغفرت کا حصول ہے اور یہ دعا اس کا نچوڑ ہے۔",
                "روزے، تراویح اور صدقات کے بعد معافی کی طلب بندگی کا کمال ہے۔",
                "ہمیں اپنی روزمرہ کی دعاؤں میں بھی اس مسنون دعا کو شامل کرنا چاہیے۔"
              ],
              "english": [
                "The ultimate goal of Ramadan is attaining forgiveness, and this dua is its essence.",
                "Seeking pardon after fasting, praying, and charity is the perfection of servitude.",
                "We should incorporate this Prophetic supplication into our daily prayers as well."
              ]
            }
          },
          {
            "title": {
              "urdu": "مایوسی کا خاتمہ",
              "english": "Ending Despair"
            },
            "content": {
              "urdu": [
                "یہ دعا گناہگاروں کے لیے امید کی کرن ہے کہ اللہ معافی کو پسند کرتا ہے۔",
                "گناہ کتنے ہی زیادہ کیوں نہ ہوں، اللہ کا 'عفو' ہونا ان سب پر بھاری ہے۔",
                "توبہ کا دروازہ ہمیشہ کھلا ہے، خاص طور پر ان مبارک راتوں میں۔"
              ],
              "english": [
                "This dua is a ray of hope for sinners, reminding them that Allah loves to forgive.",
                "No matter how many the sins, Allah's quality of 'Al-Afuw' outweighs them all.",
                "The door of repentance is always open, especially during these blessed nights."
              ]
            }
          }
        ]
      }
    }
  ]
}