{
  "hadithId": 572,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/66"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "كتاب الصيام",
    "babId": 35
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2029)، ومسلم (297). واللفظ المذكور في المتن هو لفظ مسلم تماماً، وهو موافق للبخاري في المعنى السياقي.",
    "urdu": "صحیح۔ اسے امام بخاری (2029) اور امام مسلم (297) نے روایت کیا ہے۔ یہ روایت اعتکاف کے دوران طہارت اور مسجد سے باہر نکلنے کے ضوابط کو واضح کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2029) and Muslim (297). The wording is nearly identical in both primary Sahih collections, emphasizing the rules of movement for the Mu'takif."
  },
  "importantWords": [
    {
      "arabic": "لَيُدْخِلُ",
      "english": "Would put in",
      "urdu": "اندر کر دیتے"
    },
    {
      "arabic": "رَأْسَهُ",
      "english": "His head",
      "urdu": "اپنا سر"
    },
    {
      "arabic": "فَأُرَجِّلُهُ",
      "english": "I would comb it",
      "urdu": "میں کنگھی کرتی"
    },
    {
      "arabic": "لِحَاجَةٍ",
      "english": "For a need",
      "urdu": "کسی ضرورت کے لیے"
    },
    {
      "arabic": "مُعْتَكِفًا",
      "english": "In seclusion (Itikaf)",
      "urdu": "اعتکاف کرنے والا"
    }
  ],
  "summary": {
    "urdu": "اعتکاف کرنے والا مسجد سے صرف انسانی ضرورت کے لیے نکل سکتا ہے، اور مسجد میں رہتے ہوئے جسمانی صفائی یا کنگھی کروانا جائز ہے۔",
    "english": "A person in Itikaf may only leave the mosque for essential human needs, and it is permissible to maintain personal hygiene, like combing hair, while remaining in the mosque."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2029)",
      "english": "Reported by Al-Bukhari (2029)"
    },
    {
      "arabic": "رواه مسلم (297)",
      "english": "Reported by Muslim (297)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=yYvK2G9vL8w",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اعتکاف اور مسجد کی حدود",
        "english": "Boundaries of Itikaf and the Mosque"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد سے باہر نکلنے کا حکم",
              "english": "Ruling on Leaving the Mosque"
            },
            "content": {
              "urdu": [
                "اعتکاف کے دوران بغیر کسی سخت ضرورت کے مسجد کی حدود سے باہر نکلنا منع ہے۔",
                "صرف ایسی حاجات (مثلاً قضائے حاجت) کے لیے نکلنا جائز ہے جن کا انتظام مسجد میں نہ ہو۔",
                "بلا ضرورت گھر میں داخل ہونا اعتکاف کو باطل کر دیتا ہے۔"
              ],
              "english": [
                "Leaving the mosque boundaries without a severe necessity is prohibited during Itikaf.",
                "It is only allowed for essential human needs (like using the bathroom) if not available in the mosque.",
                "Entering one's home without an absolute necessity nullifies the state of Itikaf."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعضاء کا مسجد سے باہر نکالنا",
              "english": "Extending Body Parts Outside"
            },
            "content": {
              "urdu": [
                "اگر اعتکاف کرنے والا مسجد میں رہے اور اس کا کوئی عضو باہر ہو تو اعتکاف نہیں ٹوٹتا۔",
                "نبی ﷺ کا اپنا سر مبارک سیدہ عائشہ کے حجرے میں کرنا اس کی واضح دلیل ہے۔",
                "اس سے ثابت ہوتا ہے کہ شرعی حکم کا مدار پیروں کے مسجد میں رہنے پر ہے۔"
              ],
              "english": [
                "If the Mu'takif remains in the mosque but extends a limb outside, the Itikaf remains valid.",
                "The Prophet (ﷺ) leaning his head into 'Aishah's room is clear evidence for this.",
                "This proves that the legal standing of Itikaf depends on the person staying within the mosque."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت اور صفائی کے آداب",
        "english": "Etiquettes of Purity and Hygiene"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کنگھی اور بناؤ سنگھار",
              "english": "Combing and Grooming"
            },
            "content": {
              "urdu": [
                "اعتکاف کا مطلب یہ نہیں کہ انسان گندا رہے یا بالوں کو بکھرا ہوا رکھے۔",
                "مسجد میں رہتے ہوئے بالوں میں کنگھی کرنا یا تیل لگانا سنت سے ثابت ہے۔",
                "یہ عمل اس بات کی دلیل ہے کہ اسلام صفائی اور ستھرائی کو ہر حال میں پسند کرتا ہے۔"
              ],
              "english": [
                "Itikaf does not mean one should remain unkempt or leave hair disheveled.",
                "Combing or oiling hair while remaining in the mosque is established by the Sunnah.",
                "This action proves that Islam values cleanliness and grooming in all circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلیہ سے مدد لینا",
              "english": "Seeking Help from the Spouse"
            },
            "content": {
              "urdu": [
                "معتکف اپنی اہلیہ سے صفائی وغیرہ کے کاموں میں مدد لے سکتا ہے۔",
                "سیدہ عائشہ کا آپ ﷺ کے سر میں کنگھی کرنا ازدواجی محبت اور خدمت کی مثال ہے۔",
                "اس سے یہ بھی معلوم ہوا کہ حائضہ عورت کا ہاتھ نجس نہیں ہوتا کیونکہ سیدہ عائشہ اس وقت حیض سے تھیں۔"
              ],
              "english": [
                "A person in Itikaf can seek assistance from their spouse for hygiene tasks.",
                "Aishah (RA) combing the Prophet's (ﷺ) hair is an example of marital love and service.",
                "This also shows that a menstruating woman's touch is not impure, as 'Aishah was in that state."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ازدواجی تعلقات اور حدود",
        "english": "Spousal Relations and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی لمس کا حکم",
              "english": "Ruling on Physical Touch"
            },
            "content": {
              "urdu": [
                "محض ہاتھ لگنے یا سر دھونے سے اعتکاف پر کوئی اثر نہیں پڑتا۔",
                "مباشرت اور جنسی تعلقات اعتکاف کے دوران قطعاً حرام ہیں۔",
                "قرآن پاک نے 'ولا تباشروهن وأنتم عاكفون' میں اس کی واضح ممانعت فرمائی ہے۔"
              ],
              "english": [
                "Simple touching or washing the head does not affect the validity of Itikaf.",
                "However, sexual relations and intimacy are strictly forbidden during Itikaf.",
                "The Quran explicitly prohibits this in the verse: 'And do not have relations with them while you are in Itikaf'."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور احتیاط",
              "english": "Piety and Caution"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا گھر میں داخل نہ ہونا اس بات کی علامت ہے کہ معتکف کو غافل نہیں ہونا چاہیے۔",
                "اعتکاف کی روح یہ ہے کہ انسان دنیاوی لذتوں سے دور رہے۔",
                "گھر جانا صرف اس وقت جائز ہے جب مسجد میں کوئی متبادل انتظام نہ ہو۔"
              ],
              "english": [
                "The Prophet's (ﷺ) avoidance of entering the house shows a Mu'takif must remain focused.",
                "The spirit of Itikaf is for a person to stay away from worldly pleasures.",
                "Going home is only permissible when there is no alternative arrangement within the mosque."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبوی گھرانے کی سادگی",
              "english": "Simplicity of the Prophetic Household"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا حجرہ مبارک مسجد سے متصل تھا جس سے عبادت میں آسانی ہوتی تھی۔",
                "یہ حدیث ہمیں میاں بیوی کے درمیان تعاون اور ہمدردی کا سبق دیتی ہے۔",
                "دین کے کاموں میں گھر والوں کا تعاون ایک بڑی نعمت ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) room was adjacent to the mosque, facilitating ease in worship.",
                "This Hadith teaches us a lesson in cooperation and compassion between spouses.",
                "The support of family members in religious duties is a great blessing."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی اہمیت",
              "english": "Importance of Time"
            },
            "content": {
              "urdu": [
                "معتکف کو اپنا زیادہ سے زیادہ وقت ذکر اور تلاوت میں گزارنا چاہیے۔",
                "غیر ضروری باتوں اور ملاقاتوں سے پرہیز اعتکاف کی جان ہے۔",
                "نبی ﷺ کا عمل ہمیں وقت کی قدر اور مقصدِ اعتکاف کی طرف متوجہ کرتا ہے۔"
              ],
              "english": [
                "A Mu'takif should spend most of their time in Dhikr and recitation.",
                "Avoiding unnecessary talk and visitors is the essence of a successful Itikaf.",
                "The Prophet's (ﷺ) practice directs us toward valuing time and the true purpose of seclusion."
              ]
            }
          }
        ]
      }
    }
  ]
}