{
  "hadithId": 700,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/68"],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2201)، ومسلم (1593). وهذا الحديث أصل في تحريم ربا الفضل في الأموال الربوية.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2201) اور امام مسلم (1593) نے روایت کیا ہے۔ یہ روایت سود کی ایک قسم 'ربا الفضل' کی حرمت پر بنیادی دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2201) and Muslim (1593). This Hadith is a primary evidence for the prohibition of Riba al-Fadl (interest in excess) in Ribawi commodities."
  },
  "importantWords": [
    {
      "arabic": "جَنِيبٍ",
      "english": "High-quality dates",
      "urdu": "عمدہ کھجوریں"
    },
    {
      "arabic": "الْجَمْعَ",
      "english": "Mixed/Lower quality dates",
      "urdu": "ملی جلی یا گھٹیا کھجوریں"
    },
    {
      "arabic": "صَّاعَ",
      "english": "Sa' (Measurement unit)",
      "urdu": "صاع (پیمانہ)"
    },
    {
      "arabic": "اِبْتَعْ",
      "english": "Buy / Purchase",
      "urdu": "تم خریدو"
    },
    {
      "arabic": "الْمِيزَانِ",
      "english": "Scale / Weighing",
      "urdu": "ترازو یا وزن کرنا"
    },
    {
      "arabic": "عَامِل",
      "english": "Governor/Agent",
      "urdu": "گورنر یا تحصیلدار"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ ایک ہی جنس کی اشیاء (جیسے کھجور) کا تبادلہ کمی بیشی کے ساتھ کرنا سود ہے، خواہ ایک عمدہ ہو اور دوسری گھٹیا۔ صحیح طریقہ یہ ہے کہ ایک کو پیسوں میں بیچ کر دوسرے کو خریدا جائے۔",
    "english": "The Hadith teaches that exchanging the same commodity (like dates) with unequal quantities is Riba, regardless of quality differences. The correct method is to sell one for currency and then buy the other."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساقاة",
      "english": "Sahih Muslim, Book of Musaqah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p7U_pG_2Q",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ربا الفضل کی حقیقت",
        "english": "Reality of Riba al-Fadl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برابری کا اصول",
              "english": "Principle of Equality"
            },
            "content": {
              "urdu": [
                "اگر ایک ہی جنس کا تبادلہ ہو تو وزن اور مقدار میں برابری شرط ہے۔",
                "عمدہ اور گھٹیا ہونے کی وجہ سے مقدار میں کمی بیشی سود کہلاتی ہے۔",
                "اسلامی قانون میں معیار (Quality) کے بدلے مقدار (Quantity) کی قربانی منع ہے۔"
              ],
              "english": [
                "Equality in weight and quantity is mandatory when exchanging the same commodity.",
                "Disparity in amount due to quality differences is classified as Riba.",
                "In Islamic law, sacrificing quantity for quality in direct exchange is forbidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "سود سے بچنے کا راستہ",
              "english": "The Way to Avoid Usury"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے حل بتایا کہ پہلے ایک چیز کو رقم کے عوض بیچ دیں۔",
                "پھر حاصل شدہ رقم سے اپنی پسند کی دوسری چیز خرید لیں۔",
                "کرنسی کا بیچ میں آنا سود کے شبہ کو مکمل طور پر ختم کر دیتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) solved this by advising to sell one item for cash first.",
                "Then, use that cash to purchase the desired item of a different quality.",
                "Involving currency eliminates the suspicion of usury in the transaction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تولنے اور ناپنے والی اشیاء",
        "english": "Measurable and Weighable Items"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمومی اطلاق",
              "english": "General Application"
            },
            "content": {
              "urdu": [
                "یہ حکم صرف کھجور تک محدود نہیں بلکہ ہر تولنے والی شے پر ہے۔",
                "گندم، نمک اور دیگر اجناس میں بھی یہی اصول کارفرما ہوگا۔",
                "مسلم کی روایت 'تول میں بھی اسی طرح' اس مفہوم کو واضح کرتی ہے۔"
              ],
              "english": [
                "This ruling isn't limited to dates; it applies to all weighable goods.",
                "The same principle governs wheat, salt, and other Ribawi commodities.",
                "Muslim's report 'similarly in weight' confirms this comprehensive application."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشی شفافیت",
              "english": "Economic Transparency"
            },
            "content": {
              "urdu": [
                "ڈائریکٹ تبادلے میں بسا اوقات ایک فریق دوسرے کا استحصال کرتا ہے۔",
                "رقم کے ذریعے لین دین سے اشیاء کی حقیقی قیمت واضح ہو جاتی ہے۔",
                "یہ طریقہ مارکیٹ میں عدل و انصاف اور شفافیت کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Direct bartering often leads to the exploitation of one party.",
                "Transacting through money clarifies the actual market value of goods.",
                "This method promotes justice, equity, and transparency in the market."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیلہِ شرعی کا جواز",
              "english": "Permissibility of Legal Way-out"
            },
            "content": {
              "urdu": [
                "سود سے بچنے کے لیے جائز طریقے اختیار کرنا گناہ نہیں بلکہ مستحب ہے۔",
                "آپ ﷺ کا مشورہ حیلہِ شرعی کی ایک بہترین اور پاکیزہ مثال ہے۔",
                "مسلم کو چاہیے کہ وہ حرام سے بچنے کے لیے علمائے کرام سے مشورہ کرے۔"
              ],
              "english": [
                "Adopting lawful alternatives to avoid usury is recommended, not sinful.",
                "The Prophet's advice is a perfect example of a valid Sharia solution.",
                "A Muslim should consult scholars to find permissible ways to avoid Haram."
              ]
            }
          },
          {
            "title": {
              "urdu": "خیبر کے عامل کا قصہ",
              "english": "The Story of Khaibar's Agent"
            },
            "content": {
              "urdu": [
                "عامل نے اپنی طرف سے بہترین کوشش کی مگر اسے شرعی حکم کا علم نہ تھا۔",
                "نبی ﷺ نے اسے ڈانٹنے کے بجائے پیار سے صحیح مسئلہ سمجھایا۔",
                "تعلیم و تربیت میں نرمی اور واضح رہنمائی سنتِ نبوی کا حصہ ہے۔"
              ],
              "english": [
                "The agent tried his best but was unaware of the specific Sharia ruling.",
                "Instead of rebuking him, the Prophet (ﷺ) kindly explained the correct issue.",
                "Gentleness and clear guidance are essential parts of the Prophetic method."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروبار میں احتیاط",
              "english": "Caution in Business"
            },
            "content": {
              "urdu": [
                "سونے کے بدلے سونا بدلتے وقت وزن کی برابری کا خاص خیال رکھیں۔",
                "پرانے زیور کے بدلے نئے زیور میں نقد رقم کا لین دین الگ سے کریں۔",
                "معاملات کی صفائی آخرت کی کامیابی کے لیے انتہائی ضروری ہے۔"
              ],
              "english": [
                "Ensure exact equality in weight when exchanging gold for gold.",
                "When trading old jewelry for new, handle the cash transaction separately.",
                "Clarity in dealings is crucial for success in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمِ دین کی اہمیت",
              "english": "Importance of Religious Knowledge"
            },
            "content": {
              "urdu": [
                "تجارت کرنے والے کے لیے ضروری ہے کہ وہ سود کے مسائل سے واقف ہو۔",
                "لاعلمی انسان کو نادانستہ طور پر بڑے گناہوں میں مبتلا کر سکتی ہے۔",
                "ہمیشہ اپنے مالی معاملات کو شریعت کے مطابق ڈھالنے کی فکر کریں۔"
              ],
              "english": [
                "It is essential for traders to be familiar with the rulings on Riba.",
                "Ignorance can unintentionally lead a person into major sins.",
                "Always strive to mold your financial affairs according to Sharia."
              ]
            }
          }
        ]
      }
    }
  ]
}