{
  "hadithId": 616,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/34"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1597)، ومسلم (1270).‏",
    "urdu": "صحیح۔ اسے امام بخاری (1597) اور امام مسلم (1270) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1597) and Muslim (1270)."
  },
  "importantWords": [
    {
      "arabic": "قَبَّلَ",
      "english": "Kissed",
      "urdu": "بوسہ دیا"
    },
    {
      "arabic": "حَجَرٌ",
      "english": "Stone",
      "urdu": "پتھر"
    },
    {
      "arabic": "تَضُرُّ",
      "english": "Harm",
      "urdu": "نقصان پہنچائے"
    },
    {
      "arabic": "تَنْفَعُ",
      "english": "Benefit",
      "urdu": "نفع پہنچائے"
    }
  ],
  "summary": {
    "urdu": "حجرِ اسود کا بوسہ لینا محض اتباعِ سنت ہے، بذاتِ خود پتھر میں کوئی نفع یا نقصان نہیں۔ سیدنا عمر رضی اللہ عنہ نے یہ واضح کر کے بت پرستی کے شبہات کا خاتمہ کر دیا۔",
    "english": "Kissing the Black Stone is purely an act of following the Sunnah; the stone itself possesses no inherent power to benefit or harm. Umar (RA) clarified this to eliminate any traces of pagan thought."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1597)",
      "english": "Sahih al-Bukhari (1597)"
    },
    {
      "arabic": "صحيح مسلم (1270)",
      "english": "Sahih Muslim (1270)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin Al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عقیدہ توحید کی حفاظت",
        "english": "Safeguarding the Creed of Monotheism"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عمر کا حکیمانہ قول",
              "english": "Umar's Wise Proclamation"
            },
            "content": {
              "urdu": [
                "سیدنا عمر رضی اللہ عنہ نے یہ بات ان لوگوں کے سامنے کہی جو نئے نئے مسلمان ہوئے تھے۔",
                "مقصد یہ تھا کہ لوگ حجرِ اسود کے احترام کو بت پرستی (جاہلیت) کے مشابہ نہ سمجھ لیں۔",
                "اسلام میں عبادت صرف اللہ کے لیے ہے، اور اشیاء کی تعظیم صرف اللہ کے حکم کی وجہ سے ہے۔"
              ],
              "english": [
                "Umar (RA) made this statement in front of people who had recently embraced Islam.",
                "The aim was to ensure people did not confuse the veneration of the Black Stone with pre-Islamic idol worship.",
                "In Islam, worship is reserved for Allah alone, and objects are honored only due to His command."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفع و نقصان کا مالک",
              "english": "Owner of Benefit and Harm"
            },
            "content": {
              "urdu": [
                "یہ عقیدہ رکھنا ضروری ہے کہ کوئی پتھر، درخت یا انسان بذاتِ خود نفع یا نقصان نہیں پہنچا سکتا۔",
                "حجرِ اسود جنت کا پتھر ہے، مگر اس کی فضیلت اس کی مادی قوت میں نہیں بلکہ شرعی حیثیت میں ہے۔",
                "مومن کی عقیدت کا مرکز اللہ کی ذات اور اس کے رسول ﷺ کی سنت ہے۔"
              ],
              "english": [
                "It is essential to believe that no stone, tree, or human can inherently cause harm or benefit.",
                "The Black Stone is from Paradise, but its virtue lies in its Sharia status, not physical power.",
                "A believer's devotion is centered on Allah and the Sunnah of His Messenger (ﷺ)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اتباعِ سنت کی حقیقت",
        "english": "The Reality of Following the Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغیر سمجھے اطاعت",
              "english": "Obedience Without Rationalizing"
            },
            "content": {
              "urdu": [
                "کبھی کبھار عبادات کی حکمت انسان کی عقل میں نہیں آتی، مگر مومن پھر بھی عمل کرتا ہے۔",
                "نبی ﷺ کے فعل کو دیکھ کر اسے اپنا لینا ہی بندگی کا کمال ہے۔",
                "سیدنا عمر کا قول 'اگر میں نے نہ دیکھا ہوتا' کامل سپردگی کی مثال ہے۔"
              ],
              "english": [
                "Sometimes the wisdom behind a ritual is not apparent to the intellect, yet a believer obeys.",
                "Adopting an action simply because the Prophet (ﷺ) did it is the perfection of servitude.",
                "Umar's phrase 'Had I not seen...' is a supreme example of total surrender to the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبت اور اطاعت کا توازن",
              "english": "Balance Between Love and Obedience"
            },
            "content": {
              "urdu": [
                "صحابہ کرام کی محبت اندھی نہیں تھی بلکہ وہ شعوری طور پر نفع و نقصان کے مالک کو جانتے تھے۔",
                "ان کی اطاعت کا مدار اللہ کے خوف اور رسول ﷺ کی گہری محبت پر تھا۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ دین میں عقل کو وحی کے تابع ہونا چاہیے۔"
              ],
              "english": [
                "The love of the Companions was not blind; they consciously recognized the true source of power.",
                "Their obedience was based on the fear of Allah and profound love for the Prophet (ﷺ).",
                "This Hadith teaches that in religion, reason must be subordinate to revelation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حجرِ اسود کے فضائل",
        "english": "Virtues of the Black Stone"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنت کی نشانی",
              "english": "A Sign from Paradise"
            },
            "content": {
              "urdu": [
                "حجرِ اسود دنیا میں جنت کی موجود نشانیوں میں سے ایک ہے۔",
                "قیامت کے دن یہ ان لوگوں کے حق میں گواہی دے گا جنہوں نے خلوص سے اس کا استلام کیا۔",
                "اسے چومنا گناہوں کو جھاڑنے کا ایک روحانی ذریعہ بھی ہے۔"
              ],
              "english": [
                "The Black Stone is one of the existing signs of Paradise on Earth.",
                "On the Day of Resurrection, it will testify for those who touched it with sincerity.",
                "Kissing it serves as a spiritual means for the expiation of sins."
              ]
            }
          },
          {
            "title": {
              "urdu": "طواف کا سنگِ میل",
              "english": "The Milestone of Tawaf"
            },
            "content": {
              "urdu": [
                "طواف کا آغاز اور اختتام اسی پتھر سے ہوتا ہے۔",
                "یہ بیت اللہ کا وہ کونہ ہے جو سیدنا اسماعیل اور ابراہیم علیہما السلام کے ہاتھوں سے لگا۔",
                "اس کی تعظیم دراصل اللہ کے گھر کی تعظیم کا حصہ ہے۔"
              ],
              "english": [
                "Tawaf begins and ends at this very stone.",
                "It is the corner of the Kaaba touched by the hands of Ismail and Ibrahim (AS).",
                "Honoring it is essentially part of honoring the House of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلو سے بچنا",
              "english": "Avoiding Extremism"
            },
            "content": {
              "urdu": [
                "مقامات یا اشیاء کو اللہ کے برابر طاقتور نہیں سمجھنا چاہیے۔",
                "مقدس تبرکات کی تعظیم صرف اتنی ہونی چاہیے جتنی شریعت نے بتائی ہے۔",
                "شرک کے تمام دروازوں کو بند کرنا ہر دور کے مسلمانوں کی ذمہ داری ہے۔"
              ],
              "english": [
                "Places or objects should never be regarded as powerful as Allah.",
                "Veneration of sacred relics should stay within the limits defined by Sharia.",
                "Closing all doors leading to Shirk is the responsibility of Muslims in every age."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت پر عمل کی برکت",
              "english": "Blessing of Practicing the Sunnah"
            },
            "content": {
              "urdu": [
                "حج اور عمرہ کے دوران سنتوں پر عمل کرنے سے عبادت میں لذت آتی ہے۔",
                "اگر رش کی وجہ سے بوسہ نہ مل سکے تو دور سے اشارہ کرنا بھی کافی ہے، اللہ نیت دیکھتا ہے۔",
                "دین میں سہولت ہے، زبردستی کسی کو تکلیف دے کر سنت حاصل کرنا درست نہیں۔"
              ],
              "english": [
                "Practicing the Sunnahs during Hajj and Umrah brings sweetness to worship.",
                "If kissing is impossible due to crowds, pointing from afar is sufficient; Allah looks at the intent.",
                "Religion is easy; causing harm to others to attain a Sunnah is not correct."
              ]
            }
          }
        ]
      }
    }
  ]
}