{
  "hadithId": 458,
  "hadithNo": 34,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/34", "abudawud/3201", "tirmidhi/1024"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },

  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (3201)، والترمذي (1024)، والنسائي (1986)، وابن ماجه (1498)، وأحمد (2/368). أما عزوه لمسلم فهو وهم من المصنف، إنما روى مسلم حديثاً آخر في الباب.",
    "urdu": "صحیح۔ اسے ابوداؤد (3201)، ترمذی (1024)، نسائی (1986) اور ابن ماجہ (1498) نے روایت کیا ہے۔ حافظ ابن حجر کا اسے مسلم کی طرف منسوب کرنا سہو ہے، مسلم میں اس باب میں دیگر احادیث موجود ہیں۔",
    "english": "Sahih. Reported by Abu Dawud (3201), At-Tirmidhi (1024), An-Nasa'i (1986), Ibn Majah (1498), and Ahmad (2/368). The attribution to Muslim by the author is an oversight; Muslim reported a different Hadith in this chapter."
  },
  "importantWords": [
    {
      "arabic": "حَيِّنَا",
      "english": "Our living",
      "urdu": "ہمارے زندہ"
    },
    {
      "arabic": "مَيِّتِنَا",
      "english": "Our dead",
      "urdu": "ہمارے مردہ"
    },
    {
      "arabic": "شَاهِدِنَا",
      "english": "Those present",
      "urdu": "ہمارے حاضر"
    },
    {
      "arabic": "غَائِبِنَا",
      "english": "Those absent",
      "urdu": "ہمارے غائب"
    },
    {
      "arabic": "لَا تَحْرِمْنَا",
      "english": "Do not deprive us",
      "urdu": "ہمیں محروم نہ کر"
    },
    {
      "arabic": "لَا تُضِلَّنَا",
      "english": "Do not lead us astray",
      "urdu": "ہمیں گمراہ نہ کر"
    }
  ],
  "summary": {
    "urdu": "یہ نمازِ جنازہ کی ایک جامع مسنون دعا ہے جس میں تمام مسلمانوں کے لیے مغفرت، اسلام پر زندگی اور ایمان پر خاتمے کی التجا کی گئی ہے۔",
    "english": "This is a comprehensive Prophetic supplication for the funeral prayer, seeking forgiveness for all Muslims and asking for life upon Islam and death upon faith."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الجنائز، رقم 3201",
      "english": "Sunan Abi Dawud, Book of Funerals, Hadith 3201"
    },
    {
      "arabic": "سنن الترمذي، كتاب الجنائز، رقم 1024",
      "english": "Sunan at-Tirmidhi, Book of Funerals, Hadith 1024"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0h5HjIeKofA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کی جامعیت اور وسعت",
        "english": "Comprehensiveness of the Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تمام طبقات کے لیے مغفرت",
              "english": "Forgiveness for All Classes"
            },
            "content": {
              "urdu": [
                "اس دعا میں نبی کریم ﷺ نے صرف میت کے لیے نہیں بلکہ پوری امتِ مسلمہ کے لیے مغفرت طلب فرمائی ہے۔",
                "زندہ، مردہ، حاضر، غائب، چھوٹے، بڑے، مرد اور عورت؛ تمام اصناف کا ذکر دعا کی عمومیت کو ظاہر کرتا ہے۔",
                "یہ اس بات کی دلیل ہے کہ جنازہ مسلمانوں کے باہمی اتحاد اور ایک دوسرے کے لیے خیر خواہی کا نام ہے۔"
              ],
              "english": [
                "In this prayer, the Prophet (ﷺ) sought forgiveness not just for the deceased but for the entire Muslim Ummah.",
                "The mention of living, dead, present, absent, young, old, male, and female shows the generality of the prayer.",
                "This serves as evidence that the funeral represents mutual unity and goodwill among Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام اور ایمان پر ثبات قدمی",
              "english": "Steadfastness on Islam and Faith"
            },
            "content": {
              "urdu": [
                "دعا کا دوسرا حصہ زندگی کو اسلام کے اعمال اور موت کو ایمان کی حقیقت سے جوڑتا ہے۔",
                "اسلام ظاہری فرماں برداری کا نام ہے جبکہ ایمان دل کی تصدیق اور پختگی کا نام ہے۔",
                "اصل کامیابی یہ ہے کہ انسان کا خاتمہ ایمان کی حالت میں ہو، جیسا کہ اس دعا میں التجا کی گئی ہے۔"
              ],
              "english": [
                "The second part of the prayer links life to the actions of Islam and death to the reality of faith.",
                "Islam refers to outward submission, while faith (Iman) refers to the heart's conviction and firmness.",
                "True success is for a person's end to be in a state of faith, as requested in this supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "موت کے بعد کی آزمائش سے پناہ",
        "english": "Refuge from Trials After Death"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجر سے محرومی سے بچاؤ",
              "english": "Protection from Loss of Reward"
            },
            "content": {
              "urdu": [
                "میت پر صبر کرنے اور اس کے جنازے میں شرکت کرنے پر اللہ نے عظیم اجر رکھا ہے۔",
                "آپ ﷺ نے دعا سکھائی کہ اے اللہ! ہمیں اس صدمے پر ملنے والے اجر سے محروم نہ فرما۔",
                "یہ دعا صدمے کی گھڑی میں بے صبری اور جزع فزع سے بچنے کی تربیت فراہم کرتی ہے۔"
              ],
              "english": [
                "Allah has placed a great reward for patience over the deceased and participating in their funeral.",
                "The Prophet (ﷺ) taught to pray: O Allah, do not deprive us of the reward associated with this calamity.",
                "This prayer provides training to avoid impatience and excessive wailing during moments of grief."
              ]
            }
          },
          {
            "title": {
              "urdu": "گمراہی سے بچنے کی التجا",
              "english": "Plea to Avoid Misguidance"
            },
            "content": {
              "urdu": [
                "اکثر اوقات کسی پیارے کی وفات کے بعد انسان مایوسی کا شکار ہو کر حق سے بھٹک سکتا ہے۔",
                "دعا کے الفاظ 'ولا تضلنا بعدہ' ہمیں آزمائشوں میں ثابت قدم رہنے کا درس دیتے ہیں۔",
                "ایمان کی حفاظت موت تک اور موت کے بعد بھی اللہ ہی کی توفیق سے ممکن ہے۔"
              ],
              "english": [
                "Often, after the death of a loved one, a person may fall into despair and stray from the truth.",
                "The words 'do not lead us astray after him' teach us to remain steadfast during trials.",
                "Protecting one's faith until death and after it is only possible through Allah's guidance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمازِ جنازہ میں دعا کی اہمیت",
              "english": "Importance of Dua in Funeral Prayer"
            },
            "content": {
              "urdu": [
                "جنازے کا تیسر ا رکن میت کے لیے مخلصانہ دعا کرنا ہے، جو اس حدیث سے واضح ہے۔",
                "آپ ﷺ مختلف جنازوں میں مختلف دعائیں مانگتے تھے، جن میں سے یہ دعا سب سے زیادہ جامع ہے۔",
                "مقتدی کو چاہیے کہ وہ امام کی تکبیرات کے بعد ان مسنون دعاؤں کو یاد کر کے پڑھے۔"
              ],
              "english": [
                "The third pillar of the funeral prayer is sincere supplication for the deceased, as clear from this Hadith.",
                "The Prophet (ﷺ) used different prayers in various funerals, and this is among the most comprehensive.",
                "The follower should memorize and recite these Prophetic supplications after the Imam's Takbirs."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلمانوں کا باہمی تعلق",
              "english": "Mutual Connection of Muslims"
            },
            "content": {
              "urdu": [
                "یہ دعا مسلمانوں کو ایک جسم کی مانند محسوس کرواتی ہے جہاں ہر ایک دوسرے کے لیے مغفرت طلب کرتا ہے۔",
                "چھوٹوں اور بڑوں کا ذکر معاشرے کے ہر فرد کی اہمیت کو اجاگر کرتا ہے۔",
                "اسلامی معاشرت میں مرد اور عورت دونوں برابر کے حقوق اور دعاؤں کے مستحق ہیں۔"
              ],
              "english": [
                "This prayer makes Muslims feel like one body where everyone seeks forgiveness for each other.",
                "The mention of young and old highlights the importance of every individual in society.",
                "In Islamic social life, both men and women are entitled to equal rights and supplications."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنون دعاؤں کی پابندی",
              "english": "Adherence to Prophetic Prayers"
            },
            "content": {
              "urdu": [
                "ہمیں اپنی بنائی ہوئی دعاؤں کے بجائے آپ ﷺ کی سکھائی ہوئی مستند دعاؤں کو ترجیح دینی چاہیے۔",
                "ان دعاؤں میں وہ برکت اور اثر ہے جو انسانی الفاظ میں ممکن نہیں ہے۔",
                "جنازے کے آداب سیکھنا ہر مسلمان پر فرضِ کفایہ کی ادائیگی کے لیے ضروری ہے۔"
              ],
              "english": [
                "We should prioritize the authentic prayers taught by the Prophet (ﷺ) over our self-made ones.",
                "These prayers contain blessings and impact that are not possible in human words.",
                "Learning funeral etiquettes is necessary for every Muslim to fulfill the communal obligation (Fard al-Kifayah)."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کی یاد دہانی",
              "english": "Remembrance of Death"
            },
            "content": {
              "urdu": [
                "یہ دعا ہمیں بار بار یاد دلاتی ہے کہ ایک دن ہم بھی 'میتنا' (ہمارے مردوں) میں شامل ہوں گے۔",
                "اسلام اور ایمان پر خاتمے کی فکر ہی زندگی کا اصل مقصد ہونا چاہیے۔",
                "دوسروں کے لیے مغفرت مانگنے سے فرشتے ہمارے حق میں بھی وہی دعا کرتے ہیں۔"
              ],
              "english": [
                "This prayer repeatedly reminds us that one day we too will be among 'our dead'.",
                "Concern for an end upon Islam and faith should be the true goal of life.",
                "By seeking forgiveness for others, the angels make the same supplication for us."
              ]
            }
          }
        ]
      }
    }
  ]
}