{
  "hadithId": 85,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 9"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب الطهارة",
    "babId": 7
  },

  "takhreej": {
    "arabic": " صحيح.  رواه البخاري (144 و 394) ، ومسلم (264) ، وأبو داود (9) ، والنسائي (12 -23) ، الترمذي (8) ، وابن ماجه (318) ، وأحمد (5 /414 و 416 و 417 و 421) ",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (144 اور 394)، مسلم (264)، ابو داؤد (9)، نسائی (12-23)، ترمذی (8)، ابن ماجہ (318)، اور احمد (5/414 اور 416 اور 417 اور 421) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic) narration. Reported by Al-Bukhari (144 and 394), Muslim (264), Abu Dawud (9), An-Nasa'i (12-23), At-Tirmidhi (8), Ibn Majah (318), and Ahmad (5/414, 416, 417, and 421)."
  },
  "importantWords": [
    {
      "arabic": "الْقِبْلَةَ",
      "english": "The Qiblah",
      "urdu": "قبلہ"
    },
    {
      "arabic": "بِغَائِطٍ",
      "english": "With defecation",
      "urdu": "قضائے حاجت"
    },
    {
      "arabic": "بَوْلٍ",
      "english": "Urine/Urination",
      "urdu": "پیشاب"
    },
    {
      "arabic": "تَسْتَقْبِلُوا",
      "english": "You face",
      "urdu": "سامنا کرنا"
    },
    {
      "arabic": "شَرِّقُوا",
      "english": "Face east",
      "urdu": "مشرق کی طرف رخ کرو"
    },
    {
      "arabic": "غَرِّبُوا",
      "english": "Face west",
      "urdu": "مغرب کی طرف رخ کرو"
    },
    {
      "arabic": "لَا تَسْتَقْبِلُوا",
      "english": "Do not face",
      "urdu": "سامنا نہ کرو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی اکرم ﷺ نے قضائے حاجت کے دوران قبلہ کی طرف رخ کرنے یا پشت کرنے سے منع فرمایا ہے، اور اس کے بجائے مشرق یا مغرب کی طرف رخ کرنے کا حکم دیا ہے۔",
    "english": "This Hadith contains the Prophet's prohibition against facing the Qiblah or turning one's back to it while defecating or urinating, instructing one to face East or West instead (for people living in the Levant/Arabian Peninsula)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (144 و 394)",
      "english": "Reported by Al-Bukhari (144 and 394)"
    },
    {
      "arabic": "رواه مسلم (264)",
      "english": "Reported by Muslim (264)"
    },
    {
      "arabic": "رواه أبو داود (9)",
      "english": "Reported by Abu Dawud (9)"
    },
    {
      "arabic": "رواه النسائي (12 - 23)",
      "english": "Reported by An-Nasa'i (12-23)"
    },
    {
      "arabic": "رواه الترمذي (8)",
      "english": "Reported by At-Tirmidhi (8)"
    },
    {
      "arabic": "رواه ابن ماجه (318)",
      "english": "Reported by Ibn Majah (318)"
    },
    {
      "arabic": "رواه أحمد (5 /414 و 416 و 417 و 421)",
      "english": "Reported by Ahmad (5/414, 416, 417, and 421)"
    }
  ],
  "narrators": [
    {
      "id": 8501,
      "name": {
        "arabic": "أبو أيوب الأنصاري",
        "english": "Abu Ayyub Al-Ansari"
      },
      "slug": "abu-ayyub-al-ansari"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا شرعی حکم",
        "english": "The Legal Ruling of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استقبال قبلہ کی ممانعت",
              "english": "Prohibition of Facing the Qiblah"
            },
            "content": {
              "urdu": [
                "حدیث میں قضائے حاجت کے دوران قبلہ کی طرف منہ یا پیٹھ کرنے سے واضح طور پر منع کیا گیا ہے۔",
                "یہ ممانعت بیت اللہ کی تعظیم اور احترام کی وجہ سے ہے، جو مسلمانوں کا قبلہ ہے۔",
                "یہ حکم صرف کھلی جگہوں کے لیے ہے، لیکن فقہی اختلاف کی بنا پر احتیاطاً ہر جگہ نافذ کیا جاتا ہے۔"
              ],
              "english": [
                "The Hadith explicitly prohibits facing the Qiblah or turning one's back to it while answering the call of nature.",
                "This prohibition is due to the reverence and respect for the Ka'bah, which is the Qiblah of the Muslims.",
                "This ruling is primarily for open spaces, but due to juristic differences, it is often applied everywhere for caution."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخ بدلنے کا حکم",
              "english": "Command to Change Direction"
            },
            "content": {
              "urdu": [
                "ممانعت کے بدلے مشرق یا مغرب کی طرف رخ کرنے کا حکم دیا گیا ہے۔",
                "یہ حکم ان لوگوں کے لیے ہے جو مدینہ یا اس کے قریب رہتے تھے، جہاں قبلہ جنوب میں ہے۔",
                "دوسرے علاقوں کے لوگ قبلہ کے علاوہ کسی بھی سمت کا رخ کریں گے، جو اس حکم کا حقیقی مقصد ہے۔"
              ],
              "english": [
                "Instead of facing the Qiblah, the Prophet ﷺ commanded facing East or West.",
                "This command was specific to people living in Al-Madinah and the Levant, where the Qiblah (Makkah) lies to the South.",
                "People in other regions must simply face any direction other than the Qiblah, which is the actual intent of the ruling."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات",
        "english": "Juristic Details"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بنیادی اصول اور اختلاف",
              "english": "Fundamental Principle and Difference"
            },
            "content": {
              "urdu": [
                "چاروں مذاہب فقہاء کے درمیان اس بات پر اتفاق ہے کہ کھلی جگہوں میں قبلہ کی طرف رخ کرنا حرام ہے۔",
                "بند عمارتوں یا بیت الخلاؤں کے اندر اس حکم کے اطلاق پر فقہاء میں اختلاف پایا جاتا ہے۔",
                "امام شافعی، امام مالک، اور امام احمد کے ایک قول کے مطابق، یہ ممانعت ہر جگہ لاگو ہوتی ہے۔"
              ],
              "english": [
                "The four schools of jurisprudence agree that facing the Qiblah is forbidden in open, uncovered spaces.",
                "A difference of opinion exists among jurists regarding the application of this rule inside enclosed buildings or restrooms.",
                "According to Imam Shafi'i, Imam Malik, and one opinion of Imam Ahmad, this prohibition applies universally."
              ]
            }
          },
          {
            "title": {
              "urdu": "احترام کا مقصد",
              "english": "Objective of Respect"
            },
            "content": {
              "urdu": [
                "اس حکم کا مقصد قبلہ، یعنی بیت اللہ اور اللہ کی حرمت کا احترام سکھانا ہے۔",
                "یہ اسلام میں مقدس مقامات اور علامات کے ادب کی اہمیت کو ظاہر کرتا ہے۔",
                "اس حکم پر عمل کرنے میں طہارت اور جسمانی نجاست سے متعلق اخلاقی پہلو بھی شامل ہے۔"
              ],
              "english": [
                "The purpose of this ruling is to instill respect for the Qiblah, the House of Allah, and the sanctity of what is sacred.",
                "It highlights the importance of observing proper manners concerning holy places and symbols in Islam.",
                "Adherence to this ruling also involves ethical considerations related to purity and bodily waste."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی ہدایات",
        "english": "Practical Guidelines"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نئے گھروں کی تعمیر",
              "english": "Construction of New Homes"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو نئے گھروں یا بیت الخلاؤں کی تعمیر میں قبلہ کا رخ کرنے سے گریز کرنا چاہیے۔",
                "بیت الخلا کے ڈیزائن میں قبلہ کی طرف منہ یا پیٹھ نہ ہو، اس کا خاص خیال رکھنا چاہیے۔",
                "اس بات کو یقینی بنانا چاہیے کہ پانی اور صفائی کا انتظام شرعی تقاضوں کے مطابق ہو۔"
              ],
              "english": [
                "Muslims should avoid positioning the toilet to face or have its back towards the Qiblah when constructing new homes or restrooms.",
                "Special care must be taken in the design of the lavatory to ensure the Qiblah is not faced or backed.",
                "It should also be ensured that the arrangement for water and cleansing meets the requirements of Islamic law."
              ]
            }
          },
          {
            "title": {
              "urdu": "سفر میں احتیاط",
              "english": "Caution During Travel"
            },
            "content": {
              "urdu": [
                "سفر یا کھلی جگہ میں قضائے حاجت کرتے وقت قبلہ کی سمت کا تعین ضروری ہے۔",
                "کسی ایسی اوٹ یا آڑ کی تلاش کرنی چاہیے جو مکمل ستر اور پردہ فراہم کرے۔",
                "قبلہ کی طرف رخ یا پشت کرنے سے بچنے کے لیے سمت کو ایڈجسٹ کرنا چاہیے۔"
              ],
              "english": [""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تعلیمی پہلو",
        "english": "Ethical and Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادب کی تعلیم",
              "english": "Teaching Etiquette"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلام میں چھوٹے سے چھوٹے معاملے میں بھی ادب اور سلیقے کی تعلیم دیتی ہے۔",
                "قبلہ کی حرمت کو سمجھنا ہر مسلمان کے ایمان کا حصہ ہے۔",
                "یہ ہمیں دنیاوی ضروریات کی تکمیل میں بھی روحانی اقدار کو مدنظر رکھنے کا درس دیتی ہے۔"
              ],
              "english": [
                "This Hadith teaches etiquette and courtesy even in the smallest matters of daily life in Islam.",
                "Understanding the sanctity of the Qiblah is an integral part of a Muslim's faith.",
                "It instructs us to consider spiritual values even while fulfilling physical necessities."
              ]
            }
          },
          {
            "title": {
              "urdu": "امتثال امر کی اہمیت",
              "english": "Importance of Obedience"
            },
            "content": {
              "urdu": [
                "اس حکم پر عمل دراصل اللہ اور اس کے رسول ﷺ کے حکم کی تعمیل کی اہمیت کو ظاہر کرتا ہے۔",
                "ایک مسلمان کو کسی بھی حکم میں حکمت اور سبب تلاش کیے بغیر عمل پیرا ہونا چاہیے۔",
                "اطاعت کا یہ جذبہ دین کی پابندی اور مضبوطی کی علامت ہے۔"
              ],
              "english": [
                "Obeying this command reflects the importance of submitting to the order of Allah and His Messenger ﷺ.",
                "A Muslim should adhere to a command without necessarily seeking its complete reason or logic.",
                "This spirit of obedience is a sign of commitment and firmness in religion."
              ]
            }
          }
        ]
      }
    }
  ]
}
