{
  "hadithId": 781,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/781"],
    "kitabId": 7,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 57
  },
  
  "takhreej": {
    "arabic": "حديث حسن لشواهده. رواه ابن ماجه (2486) بسند فيه إسماعيل بن مسلم المكي وهو ضعيف. ولكن يشهد له حديث أبي هريرة عند أحمد (2/494) بلفظ: «من حفر بئراً فله ما حولها أربعون ذراعاً»، وله شاهد آخر مرسل في مراسيل أبي داود.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر حسن ہے۔ اسے ابن ماجہ (2486) نے روایت کیا جس کی سند میں اسماعیل بن مسلم المکی ضعیف ہے، مگر مسند احمد (2/494) میں حضرت ابوہریرہ کی روایت اور ابوداؤد کی مراسیل میں اس کے شواہد موجود ہیں جو اسے تقویت دیتے ہیں۔",
    "english": "A Hasan Hadith due to supporting evidences. Reported by Ibn Majah (2486). Though its specific chain is weak due to Isma'il bin Muslim al-Makki, it is supported by a narration from Abu Hurairah in Musnad Ahmad (2/494) and another in Marasil Abi Dawud."
  },
  "importantWords": [
    {
      "arabic": "حَفَرَ",
      "english": "Dug",
      "urdu": "کھودا"
    },
    {
      "arabic": "بِئْرًا",
      "english": "A Well",
      "urdu": "کنواں"
    },
    {
      "arabic": "أَرْبَعُونَ",
      "english": "Forty",
      "urdu": "چالیس"
    },
    {
      "arabic": "ذِرَاعًا",
      "english": "Cubits",
      "urdu": "ہاتھ (لمبائی کا پیمانہ)"
    },
    {
      "arabic": "عَطَنًا",
      "english": "Resting place for camels",
      "urdu": "اونٹوں کے بیٹھنے کی جگہ"
    },
    {
      "arabic": "مَاشِيَتِهِ",
      "english": "His Livestock",
      "urdu": "اس کے مویشی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ جو شخص بنجر زمین میں کنواں کھود کر اسے آباد کرتا ہے، اسے نہ صرف کنویں بلکہ اس کے ارد گرد ایک مخصوص رقبے (حریمِ بئر) کا بھی مالکانہ حق حاصل ہو جاتا ہے تاکہ وہ کنویں سے بہتر فائدہ اٹھا سکے۔",
    "english": "This Hadith clarifies that digging a well in barren land grants the person ownership of the well and a surrounding perimeter (Harim) to ensure practical usage for their livestock."
  },
  "references": [
    {
      "arabic": "رواه ابن ماجه (2486)",
      "english": "Reported by Ibn Majah (2486)"
    },
    {
      "arabic": "مسند أحمد (2/494)",
      "english": "Musnad Ahmad (2/494)"
    },
    {
      "arabic": "مراسيل أبي داود (346)",
      "english": "Marasil Abi Dawud (346)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مغفل",
        "english": "Abdullah bin Mughaffal"
      },
      "slug": "abdullah-bin-mughaffal"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "حسن لغيره",
    "english": "Hasan Lighairihi (Good due to supporting evidences)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حریمِ بئر (کنویں کی حدود) کا تصور",
        "english": "The Concept of Harim al-Bi'r"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حریم کی تعریف",
              "english": "Definition of Harim"
            },
            "content": {
              "urdu": [
                "کسی بھی کنویں کے ارد گرد وہ خالی جگہ جو اس کے استعمال کے لیے ضروری ہو، اسے 'حریم' کہتے ہیں۔",
                "یہ جگہ اس لیے چھوڑی جاتی ہے تاکہ پانی نکالنے والے اور جانوروں کو بیٹھنے میں تنگی نہ ہو۔",
                "حدیث میں چالیس ہاتھ کی جو حد بتائی گئی ہے وہ عام حالات میں ایک مثالی رقبہ ہے۔"
              ],
              "english": [
                "The 'Harim' is the surrounding area of a well necessary for its effective use.",
                "This space is reserved so that those drawing water and their animals have room to operate.",
                "The forty-cubit limit mentioned in the Hadith represents a standard practical area for usage."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملکیت کا حق",
              "english": "Right of Ownership"
            },
            "content": {
              "urdu": [
                "بنجر زمین میں کنواں کھودنا 'احیاء الموات' (بنجر زمین کو آباد کرنا) کی ایک اہم صورت ہے۔",
                "جس طرح کنواں کھودنے والا کنویں کا مالک ہوتا ہے، وہ اس کی ضروری حدود کا بھی مالک بن جاتا ہے۔",
                "اس رقبے میں کسی دوسرے شخص کو نیا کنواں کھودنے یا تعمیرات کرنے کا حق نہیں ہوتا۔"
              ],
              "english": [
                "Digging a well in barren land is a key form of 'Ihya al-Mawat' (reviving dead land).",
                "Just as the digger owns the well, they acquire ownership over its essential perimeter.",
                "No other person has the right to dig another well or build structures within this zone."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور ائمہ کی آراء",
        "english": "Juristic Details and Opinions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رقبے کی مقدار میں اختلاف",
              "english": "Difference in Area Measurement"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک عطن (پرانے کنویں) کے لیے چالیس ہاتھ اور ناعور (جدید/گہرے کنویں) کے لیے ساٹھ ہاتھ حریم ہے۔",
                "دیگر فقہاء کے نزدیک یہ مقدار ضرورت اور عرفِ عام کے مطابق متعین کی جائے گی۔",
                "مقصد یہ ہے کہ ایک کنواں دوسرے کنویں کے پانی کے ذخیرے یا استعمال میں رکاوٹ نہ بنے۔"
              ],
              "english": [
                "Hanafis suggest 40 cubits for older wells and up to 60 cubits for deeper irrigation wells.",
                "Other jurists believe the measurement should be determined by actual need and local custom.",
                "The goal is to ensure one well does not interfere with the water source or usage of another."
              ]
            }
          },
          {
            "title": {
              "urdu": "پانی کے حقوق (حقِ شرب)",
              "english": "Water Rights (Haq al-Shurb)"
            },
            "content": {
              "urdu": [
                "کنویں کا مالک اپنی ضرورت کے لیے پانی استعمال کرنے کا پہلا حق رکھتا ہے۔",
                "اگر پانی وافر ہو تو مسافروں اور دوسروں کے مویشیوں کو پلانے سے روکنا اخلاقی طور پر ناپسندیدہ ہے۔",
                "اسلامی قانون پانی کے وسائل کو انفرادی ملکیت کے باوجود عوامی نفع کے لیے کھلا رکھنے کی حوصلہ افزائی کرتا ہے۔"
              ],
              "english": [
                "The owner has the primary right to use the water for their own specific needs.",
                "If water is surplus, preventing travelers or others' livestock from drinking is discouraged.",
                "Islamic law encourages keeping water resources accessible for public benefit despite private ownership."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی اور انتظامی حکمت",
        "english": "Economic and Administrative Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وسائل کی ترقی",
              "english": "Development of Resources"
            },
            "content": {
              "urdu": [
                "یہ قانون لوگوں کو بنجر علاقوں میں سرمایہ کاری اور محنت کرنے پر ابھارتا ہے۔",
                "پانی کی دستیابی سے بنجر زمینیں سرسبز ہوتی ہیں اور معیشت مضبوط ہوتی ہے۔",
                "ریاست محنت کشوں کو ان کی محنت کا صلہ مالکانہ حقوق کی صورت میں فراہم کرتی ہے۔"
              ],
              "english": [
                "This law incentivizes people to invest labor and resources in arid or barren regions.",
                "Availability of water turns barren lands green and strengthens the national economy.",
                "The state rewards laborers for their efforts by providing them with secure ownership rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "تنازعات کا حل",
              "english": "Conflict Resolution"
            },
            "content": {
              "urdu": [
                "حدود کا تعین کرنے سے پڑوسیوں کے درمیان زمین اور پانی پر ہونے والے جھگڑے ختم ہو جاتے ہیں۔",
                "واضح ضابطے معاشرتی امن اور باہمی تعاون کو فروغ دیتے ہیں۔",
                "اسلام ہر معاملے میں ابہام کو ختم کر کے شفافیت لانے کا حکم دیتا ہے۔"
              ],
              "english": [
                "Defining boundaries eliminates disputes between neighbors over land and water access.",
                "Clear regulations promote social peace and foster a spirit of mutual cooperation.",
                "Islam commands transparency and the removal of ambiguity in all legal dealings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دوسروں کے حقوق کا احترام",
              "english": "Respecting Others' Rights"
            },
            "content": {
              "urdu": [
                "کسی کے پہلے سے موجود کنویں کے اتنے قریب نیا کنواں نہ کھودیں کہ اس کا پانی کم ہو جائے۔",
                "تکنیکی اور شرعی حدود کا خیال رکھنا ایک مسلمان کی ذمہ داری ہے۔",
                "اپنا فائدہ حاصل کرتے وقت دوسروں کو نقصان (ضرر) پہنچانے سے بچیں۔"
              ],
              "english": [
                "Do not dig a new well so close to an existing one that it depletes the other's supply.",
                "Adhering to both technical and religious boundaries is the responsibility of a Muslim.",
                "Avoid causing harm (Darar) to others while pursuing your own personal benefit."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ جاریہ کی ترغیب",
              "english": "Encouraging Continuous Charity"
            },
            "content": {
              "urdu": [
                "لوگوں اور جانوروں کے لیے پانی کا انتظام کرنا عظیم نیکی اور صدقہ ہے۔",
                "اسلام ہمیں فطرت کو آباد کرنے اور مخلوقِ خدا کی خدمت کا سبق دیتا ہے۔",
                "کنواں کھودنا نہ صرف دنیاوی ملکیت کا ذریعہ ہے بلکہ آخرت میں بھی اجر کا باعث ہے۔"
              ],
              "english": [
                "Providing water for people and animals is a great virtue and a form of Sadaqah.",
                "Islam teaches us to cultivate nature and serve the creation of Allah.",
                "Digging a well is not just a means of worldly ownership but a source of eternal reward."
              ]
            }
          }
        ]
      }
    }
  ]
}