{
  "hadithId": 601,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/601"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 39
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1829)، ومسلم (1198). واللفظ للبخاري إلا أنه ليس عنده لفظ 'الحل'. وفي رواية لمسلم زيادة 'الحية'.",
    "urdu": "صحیح۔ اسے بخاری (1829) اور مسلم (1198) نے روایت کیا ہے۔ بخاری کے الفاظ میں 'حل' کا لفظ نہیں ہے (مگر مفہوم یہی ہے)۔ مسلم کی ایک روایت میں 'سانپ' کا بھی ذکر ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1829) and Muslim (1198). The wording is from Bukhari, though the word 'al-Hill' (outside the sanctuary) is implicitly understood. A narration in Muslim also includes the snake."
  },
  "importantWords": [
    {
      "arabic": "فَاسِقٌ",
      "english": "Mischievous / Harmful",
      "urdu": "موذی / حد سے نکل جانے والا"
    },
    {
      "arabic": "الْحَرَمِ",
      "english": "Sanctuary (Makkah/Madinah)",
      "urdu": "حرم کی حدود"
    },
    {
      "arabic": "الْغُرَابُ",
      "english": "The Crow",
      "urdu": "کوا"
    },
    {
      "arabic": "الْكَلْبُ اَلْعَقُورُ",
      "english": "Rabid / Biting Dog",
      "urdu": "کاٹ کھانے والا کتا"
    },
    {
      "arabic": "يُقْتَلْنَ",
      "english": "May be killed",
      "urdu": "انہیں مار دیا جائے"
    }
  ],
  "summary": {
    "urdu": "شریعت نے حرم کی حدود میں جانور مارنے سے منع کیا ہے، مگر وہ پانچ موذی جانور جو انسانوں کو نقصان پہنچاتے ہیں، انہیں حرم کے اندر بھی مارنے کی اجازت دی گئی ہے۔",
    "english": "While hunting is forbidden in the Haram, Shariah permits killing five specific harmful animals within its boundaries due to their predatory or injurious nature."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1829)",
      "english": "Reported by Al-Bukhari (1829)"
    },
    {
      "arabic": "رواه مسلم (1198)",
      "english": "Reported by Muslim (1198)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرم کی حرمت اور استثناء",
        "english": "Sanctity of the Haram and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرم میں امن و امان",
              "english": "Peace in the Sanctuary"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے مکہ اور مدینہ کے حرم کو جائے امن بنایا ہے جہاں شکار کرنا یا درخت کاٹنا منع ہے۔",
                "یہ حکم اللہ کے گھر کی تعظیم اور وہاں آنے والے زائرین کی حفاظت کے لیے ہے۔",
                "احرام کی حالت میں بھی عام جانوروں کا شکار حرام ہے۔"
              ],
              "english": [
                "Allah has made the sanctuaries of Makkah and Madinah places of peace where hunting or cutting trees is forbidden.",
                "This command is to honor Allah's House and protect the pilgrims visiting it.",
                "Hunting ordinary animals is prohibited even while in the state of Ihram."
              ]
            }
          },
          {
            "title": {
              "urdu": "موذی جانوروں کا قتل",
              "english": "Killing Harmful Animals"
            },
            "content": {
              "urdu": [
                "شریعت نے انسانی جان کی حفاظت کو دیگر تمام احکام پر مقدم رکھا ہے۔",
                "وہ جانور جو بلا اشتعال حملہ کرتے ہیں یا بیماریاں پھیلاتے ہیں، انہیں 'فاسق' کہا گیا ہے۔",
                "ایسے جانوروں کو مارنے پر نہ کوئی گناہ ہے اور نہ ہی کوئی فدیہ (جرمانہ) واجب ہوتا ہے۔"
              ],
              "english": [
                "Shariah prioritizes the protection of human life over other general prohibitions.",
                "Animals that attack without provocation or spread diseases are termed 'Fasiq' (mischievous).",
                "Killing such animals carries no sin and requires no expiation (Fidya/penalty)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جانوروں کی تفصیل اور حکمت",
        "english": "Details of the Animals and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مخصوص جانوروں کی فہرست",
              "english": "Specific List of Animals"
            },
            "content": {
              "urdu": [
                "چوہا (خوراک ضائع کرتا ہے اور آگ لگنے کا سبب بنتا ہے)۔",
                "بچھو اور سانپ (زہریلے اور جان لیوا ہوتے ہیں)۔",
                "کاٹ کھانے والا کتا (جس میں پاگل پن ہو یا وہ درندہ بن چکا ہو، اس میں شیر اور چیتے بھی شامل کیے گئے ہیں)۔",
                "کوا اور چیل (جو لوگوں کا سامان چھینتے ہیں اور پرندوں کو نقصان پہنچاتے ہیں)۔"
              ],
              "english": [
                "The mouse (spoils food and can cause fires).",
                "The scorpion and snake (venomous and potentially lethal).",
                "The biting dog (rabid or predatory; many scholars include lions and tigers in this category).",
                "The crow and kite (scavengers that snatch belongings and harm other birds)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصولی اجازت",
              "english": "General Principle"
            },
            "content": {
              "urdu": [
                "علماء کے نزدیک یہ فہرست حتمی نہیں بلکہ اس میں وہ تمام جانور شامل ہیں جو موذی ہوں۔",
                "ہر وہ درندہ یا کیڑا جو انسانی زندگی کے لیے خطرہ ہو، اسے مارنا جائز ہے۔",
                "مقصود جانوروں سے دشمنی نہیں بلکہ انسانی بستری اور امن کا تحفظ ہے۔"
              ],
              "english": [
                "Scholars believe this list is illustrative, encompassing all animals that are inherently harmful.",
                "Any predatory beast or insect that poses a threat to human life is permissible to kill.",
                "The intent is not enmity toward animals, but the protection of human safety and peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور مسائل",
        "english": "Juristic Rulings and Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قتل کا طریقہ",
              "english": "Manner of Killing"
            },
            "content": {
              "urdu": [
                "جانوروں کو مارتے وقت بھی احسان (نرمی) کا حکم ہے، یعنی انہیں تڑپا کر نہ مارا جائے۔",
                "آگ سے جلانے کی ممانعت ہے کیونکہ آگ کا عذاب صرف اللہ ہی دے سکتا ہے۔",
                "کم سے کم تکلیف دے کر شر ختم کرنا مطلوب ہے۔"
              ],
              "english": [
                "Even when killing harmful animals, Islam commands 'Ihsan' (excellence/mercy), avoiding unnecessary torture.",
                "Killing by fire is strictly forbidden as only Allah punishes with fire.",
                "The goal is to eliminate the threat with the least amount of pain possible."
              ]
            }
          },
          {
            "title": {
              "urdu": "احرام میں قتل کا اثر",
              "english": "Effect of Killing while in Ihram"
            },
            "content": {
              "urdu": [
                "اگر کوئی محرم (حالتِ احرام میں) ان جانوروں کو مارے تو اس کا احرام باطل نہیں ہوتا۔",
                "اس پر کوئی صدقہ یا دم واجب نہیں ہے کیونکہ یہ 'فاسق' جانور ہیں۔",
                "عام پرندوں یا ہرن وغیرہ کو مارنے پر سخت جرمانہ (جزا) لازم آتی ہے۔"
              ],
              "english": [
                "If a person in Ihram kills these animals, their Ihram remains valid.",
                "No charity or sacrifice is due because these are 'mischievous' animals.",
                "Killing ordinary birds or deer results in a mandatory penalty (Jaza)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلام کی توازن پسندی",
              "english": "Islam's Balanced Approach"
            },
            "content": {
              "urdu": [
                "اسلام ایک طرف جانوروں پر رحم کی تاکید کرتا ہے تو دوسری طرف انسانی تحفظ کو یقینی بناتا ہے۔",
                "دین میں نہ تو بے جا سختی ہے اور نہ ہی عقل کے خلاف نرمی۔",
                "حرمت والے مقامات پر بھی برائی اور اذیت کو دور کرنے کا حکم ہے۔"
              ],
              "english": [
                "Islam emphasizes mercy toward animals while simultaneously ensuring human safety.",
                "The religion contains neither undue hardship nor illogical leniency.",
                "Even in sacred places, removing harm and evil is a religious mandate."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدی کو مٹانا",
              "english": "Eradicating Evil"
            },
            "content": {
              "urdu": [
                "جس طرح موذی جانوروں کو ختم کرنے کا حکم ہے، معاشرے کے 'موذی' افراد اور برائیوں کو مٹانا بھی ضروری ہے۔",
                "فتنہ و فساد پھیلانے والی چیزوں سے سمجھوتہ نہیں کرنا چاہیے۔",
                "ایک مومن کا کام امن قائم کرنا اور تکلیف دہ چیزوں کا راستہ روکنا ہے۔"
              ],
              "english": [
                "Just as harmful animals are to be removed, it is essential to eliminate 'harmful' individuals and vices from society.",
                "One should not compromise with things that spread chaos and discord.",
                "A believer's role is to establish peace and block the path of agonizing things."
              ]
            }
          }
        ]
      }
    }
  ]
}