{
  "hadithId": 27,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "Book 1, Hadith 6 (Likely Bulugh al-Maram or similar collection)"
    ],
    "kitabId": 1,
    "inKitabBab": 3,
    "arabicBook": "كتاب الطهارة",
    "babId": 3
  },

  "takhreej": {
    "arabic": "صحيح .  رواه البخاري (227) ، (307) ، مسلم (291)  من طريق فاطمة بنت المنذر، عن جدتها أسماء، به . ",
    "urdu": "صحیح۔ اسے بخاری (227)، (307) اور مسلم (291) نے فاطمہ بنت المنذر کی سند سے، ان کی دادی اسماء رضی اللہ عنہا کے ذریعے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Al-Bukhari (227), (307) and Muslim (291) through the route of Fatima bint Al-Mundhir, from her grandmother Asma, from the Prophet (ﷺ)."
  },
  "importantWords": [
    {
      "arabic": "دَمِ اَلْحَيْضِ",
      "english": "Menstrual blood",
      "urdu": "حیض کا خون"
    },
    {
      "arabic": "اَلثَّوْبَ",
      "english": "Garment / Clothes",
      "urdu": "کپڑا"
    },
    {
      "arabic": "تَحُتُّهُ",
      "english": "Scratch/scrape it off",
      "urdu": "کھرچ ڈالو"
    },
    {
      "arabic": "تَقْرُصُهُ",
      "english": "Rub/squeeze it (with water)",
      "urdu": "مل کر دھو لو"
    },
    {
      "arabic": "تَنْضَحُهُ",
      "english": "Rinse/pour water over it",
      "urdu": "پانی بہاؤ"
    },
    {
      "arabic": "تُصَلِّي فِيهِ",
      "english": "Pray in it",
      "urdu": "اس میں نماز پڑھ لو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس طریقے کی وضاحت کرتی ہے کہ کپڑے پر لگے ہوئے حیض کے خون کو کس طرح مؤثر طریقے سے پاک کیا جائے تاکہ وہ نماز پڑھنے کے لیے قابل استعمال ہو جائے۔",
    "english": "This Hadith clarifies the specific step-by-step method required to purify a garment stained with menstrual blood, ensuring it becomes ritually clean and permissible for prayer."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الوضوء، رقم 227",
      "english": "Sahih Al-Bukhari, The Book of Ablution, Hadith 227"
    },
    {
      "arabic": "صحيح مسلم، كتاب الطهارة، رقم 291",
      "english": "Sahih Muslim, The Book of Purification, Hadith 291"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اَللَّهُ عَنْهُمَا",
        "english": "Asma bint Abi Bakr (May Allah be pleased with them both)"
      },
      "slug": "asma-bint-abi-bakr"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-6-menstrual-blood",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Agreed Upon (by Bukhari and Muslim)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ناپاکی دور کرنے کا طریقہ کار",
        "english": "Step-by-Step Purification Procedure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خشک ناپاکی کو کھرچنا (تحتّہ)",
              "english": "Scratching Off Dry Impurity (Tahuttuh)"
            },
            "content": {
              "urdu": [
                "حیض کا خون چونکہ غلیظ نجاست ہے، اس لیے اسے دور کرنے کا پہلا قدم یہ ہے کہ اسے خشک حالت میں **کھرچ ڈالا** جائے۔",
                "یہ حکم اس بات کی طرف اشارہ کرتا ہے کہ جب ناپاکی ٹھوس شکل اختیار کر لے تو اسے پانی لگانے سے پہلے جسمانی طور پر ہٹانا ضروری ہے۔",
                "اس عمل سے نجاست کا زیادہ سے زیادہ حصہ کپڑے سے الگ ہو جاتا ہے، جس سے بقیہ صفائی کا عمل آسان ہو جاتا ہے۔"
              ],
              "english": [
                "Since menstrual blood is a substantial impurity (Najāsah), the first step is to **scratch or scrape it off** while it is in a dried state.",
                "This instruction indicates that when an impurity has become solid or sticky, it must first be physically removed before applying water.",
                "This ensures the removal of the bulk of the impurity from the fabric, making the subsequent washing steps more effective."
              ]
            }
          },
          {
            "title": {
              "urdu": "مل کر دھونا اور نچوڑنا (تقرُصہ)",
              "english": "Rubbing and Squeezing with Water (Taqrusuh)"
            },
            "content": {
              "urdu": [
                "دوسرا مرحلہ یہ ہے کہ بچے ہوئے داغ کو پانی سے **مل کر دھویا** جائے، جس میں کپڑے کو انگلیوں کے درمیان نچوڑ کر صاف کرنا شامل ہے۔",
                "لفظ 'تقرصہ' کپڑے کے داغ والے حصے کو انگلیوں سے دبا کر نچوڑنے کے عمل کی طرف اشارہ کرتا ہے تاکہ نجاست کے ذرات باہر نکل جائیں۔",
                "یہ مرحلہ کھرچنے کے بعد بھی باقی رہ جانے والے خون کے رنگ اور اثر کو زائل کرنے کے لیے نہایت اہم ہے۔"
              ],
              "english": [
                "The second stage involves **rubbing and squeezing** the remaining stain with water, often by pinching the fabric between the fingers to work out the impurity.",
                "The word 'Taqrusuh' implies an action of pressing and rubbing the stained part to expel the particles of impurity that have soaked into the fibers.",
                "This step is crucial for dissolving and removing the deep-seated color and residual traces of the blood left after the initial scraping."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور طہارت کا اصول",
        "english": "Fiqh Rulings and the Principle of Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی بہانا اور نماز کی اجازت",
              "english": "Rinsing and Permissibility of Prayer"
            },
            "content": {
              "urdu": [
                "تمام مراحل کے بعد، کپڑے کو مکمل طور پر پانی سے **دھویا (تنضحہ)** جائے تاکہ نجاست کے تمام اثرات زائل ہو جائیں۔",
                "حتمی نتیجہ یہ ہے کہ کپڑا پاک ہو جاتا ہے اور اس کے بعد اس **کپڑے میں نماز پڑھنا جائز** ہو جاتا ہے، خواہ خون کا ہلکا سا رنگ باقی رہ گیا ہو۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام میں صفائی اور طہارت کو حاصل کرنے کے لیے انتہائی مشقت اٹھانا ضروری نہیں، بلکہ معقول کوشش ہی کافی ہے۔"
              ],
              "english": [
                "After all previous actions, the garment must be fully **rinsed (Tanḍahuh)** by pouring water over it to ensure the removal of all traces of the impurity.",
                "The final conclusion is that the garment is purified, and it is then **permissible to pray in it**, even if a slight color residue of the blood remains.",
                "This ruling proves that Islam does not mandate excessive hardship (Mashaqqah) to achieve purity, but a reasonable and effective effort is sufficient."
              ]
            }
          },
          {
            "title": {
              "urdu": "دلیل: نجاست کو زائل کرنا",
              "english": "Evidence: The Removal of Impurity"
            },
            "content": {
              "urdu": [
                "اس حدیث کا بنیادی فقہی اصول یہ ہے کہ کسی بھی ناپاک چیز سے طہارت کا مقصد **ناپاکی کے اثر (عین نجاست)** کو زائل کرنا ہے۔",
                "اگر خون کا رنگ یا نشان باقی رہ جائے لیکن اس کی **عین نجاست** زائل ہو چکی ہو، تو کپڑا پھر بھی پاک سمجھا جائے گا، جیسا کہ امام نووی نے وضاحت کی ہے۔",
                "اس کی وجہ یہ ہے کہ خون ایک ایسا مادہ ہے جس کا رنگ گہرا ہوتا ہے اور مکمل طور پر ہٹانا بعض اوقات مشکل ہو جاتا ہے، اس لیے شرعی آسانی دی گئی ہے۔"
              ],
              "english": [
                "The core jurisprudential principle derived here is that the goal of purification from any impurity is the **removal of the substance (ʿayn al-najāsah)** itself.",
                "If the color or stain of the blood remains but the **substance** has been effectively removed, the garment is still considered pure, as elaborated by Imam Nawawi.",
                "This is because blood is a dye-like substance whose color is often hard to remove completely, hence the legal concession provided for practicality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "احکام کا اطلاق اور دیگر نجاستیں",
        "english": "Application of the Ruling and Other Impurities"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیض کے خون کی نجاست",
              "english": "The Impurity of Menstrual Blood"
            },
            "content": {
              "urdu": [
                "حیض کا خون تمام فقہی مسالک کے نزدیک **غلیظ (سخت)** ناپاکی سمجھا جاتا ہے، جس کی تطہیر دیگر نجاستوں سے زیادہ احتیاط طلب ہوتی ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام کپڑوں کی صفائی اور جمال کو اہمیت دیتا ہے تاکہ مسلمان ہر حال میں پاکیزگی کے ساتھ عبادت کر سکیں۔",
                "اسماء رضی اللہ عنہا کا سوال اس بات کو ظاہر کرتا ہے کہ صحابہ کرام چھوٹی چھوٹی باتوں میں بھی طہارت کے احکام کو جاننے کے لیے کتنے فکرمند رہتے تھے۔"
              ],
              "english": [
                "Menstrual blood is unanimously considered a **major (ghalīẓ)** impurity across all schools of jurisprudence, requiring careful purification compared to lesser impurities.",
                "This instruction demonstrates Islam's emphasis on the cleanliness and appearance of clothing so that Muslims can perform worship in a state of purity.",
                "The fact that Asma (RA) asked this question shows the great concern of the Companions in knowing the precise rulings of purification even in minor details."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر خون پر حکم کا اطلاق",
              "english": "Application to Other Types of Blood"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک، حیض کے خون کی تطہیر کا یہ طریقہ زخم وغیرہ سے نکلنے والے خون یا دیگر سخت نجاستوں کو دور کرنے کے لیے بھی بطور معیار استعمال ہو سکتا ہے۔",
                "تاہم، بعض مسالک میں معمولی مقدار میں بہنے والے خون کو معاف کر دیا گیا ہے یا اس کی تطہیر کو اس حد تک سخت نہیں رکھا گیا ہے۔",
                "لیکن جس خون کے ناپاک ہونے پر اتفاق ہے، اسے دور کرنے کے لیے اس حدیث میں بیان کردہ تین مراحل کو بہترین طریقہ سمجھا جاتا ہے۔"
              ],
              "english": [
                "According to jurists, this method of purifying menstrual blood can also be used as a template for removing other major impurities like blood from a wound.",
                "However, some schools of thought have milder rulings for small amounts of non-menstrual flowing blood, allowing for more leniency in purification.",
                "But for any blood agreed upon as a major impurity, the three-step process described in this Hadith is considered the most complete and effective method of cleansing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیرت اور راوی کا تعارف",
        "english": "Sīrah and Narrator's Introduction"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدہ اسماء بنت ابی بکر کا مقام",
              "english": "The Status of Sayyidah Asma bint Abi Bakr"
            },
            "content": {
              "urdu": [
                "سیدہ اسماء بنت ابی بکر رضی اللہ عنہا، خلیفہ اول سیدنا ابوبکر صدیق کی بیٹی اور زوجہ رسول عائشہ صدیقہ کی بڑی بہن تھیں۔",
                "آپ کا ایک بڑا مقام ہے کیونکہ آپ نے ہجرت کے موقع پر رسول اللہ ﷺ اور اپنے والد کی پرخطر خدمت کی تھی اور آپ کو 'ذاتُ النطاقین' (دو پٹوں والی) کا لقب ملا تھا۔",
                "آپ سے طہارت، نماز اور دیگر اہم مسائل پر کئی احادیث مروی ہیں جو آپ کی علمی فضیلت کو ظاہر کرتی ہیں۔"
              ],
              "english": [
                "Sayyidah Asma bint Abi Bakr (RA) was the daughter of the first Caliph, Abu Bakr, and the elder sister of the Prophet's wife, Aisha (RA).",
                "She holds a high status, having performed the crucial and dangerous service of supplying the Prophet (ﷺ) and her father during the Hijrah, earning her the title 'Dhāt an-Niṭāqayn' (The possessor of the two belts).",
                "Several Ahadith regarding purification, prayer, and other vital matters are narrated from her, showcasing her profound knowledge of Islamic law."
              ]
            }
          },
          {
            "title": {
              "urdu": "متفق علیہ حدیث کی اہمیت",
              "english": "The Significance of 'Agreed Upon' Hadith"
            },
            "content": {
              "urdu": [
                "اس حدیث کو امام بخاری اور امام مسلم دونوں نے روایت کیا ہے، اس لیے یہ حدیث کی صحت کے اعلیٰ ترین درجے **'متفق علیہ'** پر فائز ہے۔",
                "جو احادیث 'متفق علیہ' ہوتی ہیں، وہ مسلمانوں کے لیے شرعی احکام اخذ کرنے میں یقین کا سب سے بڑا ذریعہ مانی جاتی ہیں، اور ان پر عمل کرنا واجب ہے۔",
                "اس کا مطلب ہے کہ حیض کے خون کو پاک کرنے کا یہ طریقہ فقہ اسلامی میں ایک بنیادی اور غیر اختلافی طریقہ ہے۔"
              ],
              "english": [
                "Since this Hadith is narrated by both Imam Al-Bukhari and Imam Muslim, it holds the highest rank of authenticity, designated as **'Agreed Upon' (Muttafaqun ʿAlayh)**.",
                "Ahadith that are 'Agreed Upon' serve as the most certain source for deriving legal rulings (Ahkam) for Muslims, making adherence to them mandatory.",
                "This confirms that the method of purifying menstrual blood detailed here is a fundamental and non-controversial procedure in Islamic jurisprudence."
              ]
            }
          }
        ]
      }
    }
  ]
}
