{
  "hadithId": 172,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["1:4:13"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (مبطلات الصلاة)",
    "babId": 13
  },
  
  "takhreej": {
    "arabic": " صحيح .‏ رواه مسلم (537)‏ في الحديث الطويل المعروف بحديث الجارية .‏",
    "urdu": "صحیح۔ اسے مسلم (537) نے طویل حدیث میں روایت کیا ہے، جو حدیث الجاریہ کے نام سے مشہور ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (537) in the long Hadith known as Ḥadīth Al-Jāriyah (Hadith of the slave girl).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَا يَصْلُحُ فِيهَا",
      "english": "Is not compatible/suitable for it",
      "urdu": "اس میں کوئی گنجائش نہیں"
    },
    {
      "arabic": "شَيْءٌ مِنْ كَلَامِ اَلنَّاسِ",
      "english": "Anything of people's ordinary speech",
      "urdu": "انسانی گفتگو کا کوئی حصہ"
    },
    {
      "arabic": "إِنَّمَا هُوَ",
      "english": "It is only/confined to",
      "urdu": "وہ صرف ہے"
    },
    {
      "arabic": "اَلتَّسْبِيحُ",
      "english": "Tasbīḥ (saying Subḥānallāh)",
      "urdu": "تسبیح"
    },
    {
      "arabic": "وَالتَّكْبِيرُ",
      "english": "Takbīr (saying Allāhu Akbar)",
      "urdu": "تکبیر"
    },
    {
      "arabic": "وَقِرَاءَةُ اَلْقُرْآنِ",
      "english": "And recitation of the Qur'ān",
      "urdu": "اور تلاوت قرآن"
    },
    {
      "arabic": "مُبْطِلَاتِ اَلصَّلَاةِ",
      "english": "Nullifiers of the prayer",
      "urdu": "نماز کو باطل کرنے والی چیزیں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں بات چیت کی ممانعت کے بنیادی اصول کو بیان کرتی ہے اور واضح کرتی ہے کہ نماز صرف اللہ کے ذکر اور قرآن کی تلاوت کے لیے مخصوص ہے۔ نماز کے دوران لوگوں سے دنیاوی یا غیر شرعی بات چیت نماز کو باطل کر دیتی ہے۔",
    "english": "This Hadith establishes the fundamental principle prohibiting speech during prayer, clarifying that prayer is dedicated solely to the remembrance of Allah and the recitation of the Qur'ān. Engaging in ordinary or non-prescribed speech with people during prayer nullifies it."
  },
  "references": [
    {
      "arabic": "رواه مسلم (537)",
      "english": "Reported by Muslim (537)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاوية بن الحكم السلمي",
        "english": "Mu'āwiyah ibn Al-Ḥakam As-Sulamī"
      },
      "slug": "muawiyah-ibn-al-hakam-as-salami"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں گفتگو کی ممانعت",
        "english": "Prohibition of Speech During Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گفتگو نماز کو باطل کرتی ہے",
              "english": "Speech Nullifies the Prayer"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے واضح طور پر حکم دیا کہ نماز میں عام انسانی گفتگو کی کوئی گنجائش نہیں ہے۔",
                "معاویہ بن حکمؓ نے خود نماز میں چھینکنے والے کو جواب دیا تھا، جس پر نبی ﷺ نے انہیں یہ حکم دیا تھا۔",
                "جان بوجھ کر تھوڑی سی بھی دنیاوی بات کرنا نماز کو باطل کر دیتا ہے، یہی جمہور فقہاء کا موقف ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) explicitly commanded that there is no room for ordinary human speech during prayer.",
                "Mu'āwiyah ibn Al-Ḥakam (RA) himself spoke during prayer to respond to a sneezer, prompting the Prophet's instruction.",
                "Speaking even a little worldly talk intentionally nullifies the prayer, which is the position of the majority of jurists."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کے شرعی کلمات",
              "english": "The Legal Wording of Prayer"
            },
            "content": {
              "urdu": [
                "نماز کو صرف تسبیح (Subḥānallāh)، تکبیر (Allāhu Akbar) اور قرآن کی تلاوت تک محدود کیا گیا ہے۔",
                "یہ تینوں اعمال اللہ کی عظمت اور بڑائی کا اعلان ہیں، جو نماز کا بنیادی مقصد ہیں۔",
                "اگر نماز کے دوران کوئی ضرورت پیش آئے تو تسبیح یا اشارے سے بات کرنا جائز ہے، عام گفتگو نہیں۔"
              ],
              "english": [
                "Prayer is restricted only to Tasbīḥ, Takbīr, and Qur'ān recitation.",
                "These three actions are declarations of Allah's Majesty and Greatness, which is the core purpose of prayer.",
                "If a necessity arises during prayer, communicating through Tasbīḥ or gestures is permissible, but not ordinary speech."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حادثہ کی وضاحت اور شرعی تطبیق",
        "english": "Explanation of the Incident and Legal Reconciliation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیثِ جاریہ کا پس منظر",
              "english": "Background of Ḥadīth Al-Jāriyah"
            },
            "content": {
              "urdu": [
                "معاویہؓ کا واقعہ اسلام کے ابتدائی دور کا ہے، جب نماز میں گفتگو کی ممانعت کا حتمی حکم نازل نہیں ہوا تھا۔",
                "اس واقعہ کے بعد ہی نماز میں گفتگو کی ممانعت کو یقینی بنایا گیا، جس سے اس کا حکم قطعی ہو گیا۔",
                "نبی ﷺ نے معاویہؓ کو اس گفتگو پر صرف تنبیہ کی، سزا نہیں دی، کیونکہ وہ لاعلم تھے۔"
              ],
              "english": [
                "Mu'āwiyah's incident occurred early in Islam when the final prohibition against speaking in prayer had not been revealed.",
                "This incident led to the firm establishment of the prohibition of speech in prayer, making the ruling decisive.",
                "The Prophet (ﷺ) only admonished Mu'āwiyah for the speech, not punishing him, as he was ignorant of the ruling."
              ]
            }
          },
          {
            "title": {
              "urdu": "سلام اور تسبیح کا حکم",
              "english": "Ruling on Salām and Tasbīḥ"
            },
            "content": {
              "urdu": [
                "نماز کے اختتام پر سلام پھیرنا اس حکم میں شامل نہیں کیونکہ یہ نماز کا حصہ اور اختتامی اعلان ہے۔",
                "امام کو غلطی پر تنبیہ کے لیے مردوں کا تسبیح (Subḥānallāh) کہنا اور عورتوں کا ہاتھ سے اشارہ کرنا جائز ہے۔",
                "تسبیح اور اشارہ چونکہ غیر انسانی کلام ہیں، اس لیے وہ نماز کو باطل نہیں کرتے۔"
              ],
              "english": [
                "The salutation (Salām) at the end of the prayer is not included in this prohibition because it is part of the prayer and its concluding declaration.",
                "It is permissible for men to use Tasbīḥ (Subḥānallāh) and women to gesture with their hands to alert the Imām of an error.",
                "Tasbīḥ and gestures are considered non-human speech, so they do not nullify the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاص اور خشوع کا معیار",
        "english": "Standard of Sincerity and Reverence (Khushu')"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں دل کا حال",
              "english": "The State of the Heart in Prayer"
            },
            "content": {
              "urdu": [
                "نماز اللہ کے ساتھ مناجات (سرگوشی) ہے، اس لیے اس میں دنیاوی باتوں کا دخل نہیں ہونا چاہیے۔",
                "گفتگو کی ممانعت اس بات کو یقینی بناتی ہے کہ نمازی جسم اور دل سے صرف اللہ کی طرف متوجہ ہو۔",
                "یہ حکم اس بات کی ترغیب دیتا ہے کہ نماز کو مکمل خلوص اور خشوع کے ساتھ ادا کیا جائے۔"
              ],
              "english": [
                "Prayer is a private communication (Munājāt) with Allah, so it should not be contaminated by worldly talk.",
                "The prohibition of speech ensures that the worshipper is focused solely on Allah, both physically and mentally.",
                "This ruling encourages performing the prayer with complete sincerity and reverence (Khushu')."
              ]
            }
          },
          {
            "title": {
              "urdu": "تربیت اور آداب",
              "english": "Training and Manners"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اس حکم کے ذریعے صحابہ کرامؓ کی نماز کے آداب پر عملی تربیت فرمائی۔",
                "مسلمانوں کو ہر حال میں نماز کی حرمت کا خیال رکھنا چاہیے اور اسے دنیاوی کاموں سے جدا رکھنا چاہیے۔",
                "تسبیح، تکبیر، اور قرآن کی تلاوت وہ اعمال ہیں جو نماز کی روح کو تقویت دیتے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) provided practical training on the manners of prayer through this command to the Companions.",
                "Muslims must maintain the sanctity of the prayer at all times and keep it separate from worldly activities.",
                "Tasbīḥ, Takbīr, and Qur'ān recitation are the actions that strengthen the soul of the prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
