{
  "hadithId": 780,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/780"],
    "kitabId": 7,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 57
  },
 
  "takhreej": {
    "arabic": "حديث صحيح لشواهده. رواه أبو داود (3077)، وابن الجارود (1015)، والبيهقي (6/141). وصححه الألباني في إرواء الغليل (1550).",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے ابوداؤد (3077) اور ابن جارود (1015) نے روایت کیا ہے۔ علامہ البانی نے 'ارواء الغلیل' میں اسے صحیح قرار دیا ہے۔",
    "english": "A Sahih Hadith due to supporting evidences. Reported by Abu Dawud (3077) and Ibn al-Jarud (1015). Authenticated by Al-Albani in Irwa' al-Ghalil (1550)."
  },
  "importantWords": [
    {
      "arabic": "أَحَاطَ",
      "english": "Surrounded / Enclosed",
      "urdu": "گھیر لیا / احاطہ کیا"
    },
    {
      "arabic": "حَائِطًا",
      "english": "A Wall / Fence",
      "urdu": "دیوار / باڑ"
    },
    {
      "arabic": "أَرْضٍ",
      "english": "Land",
      "urdu": "زمین"
    },
    {
      "arabic": "فَهِيَ لَهُ",
      "english": "It belongs to him",
      "urdu": "پس وہ اسی کی ہے"
    },
    {
      "arabic": "مَلِكِيَّة",
      "english": "Ownership",
      "urdu": "ملکیت"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بنجر اور غیر مملوکہ زمین کی ملکیت حاصل کرنے کا ایک طریقہ بیان کرتی ہے، یعنی اس کا احاطہ کرنا اور اسے تعمیری کاموں کے لیے مخصوص کرنا ملکیت کے ثبوت کے لیے کافی ہے۔",
    "english": "This Hadith describes a method of acquiring ownership of unowned barren land: enclosing it with a wall or fence as a sign of development and claim."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3077)",
      "english": "Reported by Abu Dawud (3077)"
    },
    {
      "arabic": "رواه ابن الجارود (1015)",
      "english": "Reported by Ibn al-Jarud (1015)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احاطہ اور ملکیت کا تصور",
        "english": "Enclosure and Ownership"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیوار بنانے کا شرعی اثر",
              "english": "Legal Impact of Building a Wall"
            },
            "content": {
              "urdu": [
                "بنجر زمین کے گرد دیوار بنانا اس کے آباد کرنے (احیاء) کی ایک بنیادی صورت ہے۔",
                "یہ عمل اس بات کی علامت ہے کہ اب یہ زمین لاوارث نہیں رہی بلکہ کسی کے زیرِ استعمال ہے۔",
                "اسلام محنت کے بدلے ملکیت دینے کے اصول پر کاربند ہے۔"
              ],
              "english": [
                "Building a wall around barren land is a primary form of 'reviving' (Ihya) it.",
                "This action signifies that the land is no longer unclaimed and is now in use.",
                "Islam adheres to the principle of granting ownership in exchange for labor."
              ]
            }
          },
          {
            "title": {
              "urdu": "احاطہ کی حدود",
              "english": "Limits of the Enclosure"
            },
            "content": {
              "urdu": [
                "صرف دیوار بنانا کافی نہیں بلکہ اس کا مقصد اسے فائدہ مند بنانا ہونا چاہیے۔",
                "اگر کوئی شخص زمین گھیر کر اسے خالی چھوڑ دے تو حکومت اسے واپس لے سکتی ہے۔",
                "مقصد زمین کی پیداواری صلاحیت کو استعمال میں لانا ہے۔"
              ],
              "english": [
                "Simply building a wall is not enough; the intent must be to make the land productive.",
                "If someone encloses land but leaves it barren, the state can reclaim it.",
                "The objective is to utilize the productive capacity of the land."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی شرائط اور ابحاث",
        "english": "Juristic Conditions and Debates"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مملوکہ زمین کی شرط",
              "english": "Condition of Unowned Land"
            },
            "content": {
              "urdu": [
                "یہ حکم صرف اس زمین کے لیے ہے جس کا پہلے سے کوئی شرعی مالک نہ ہو۔",
                "کسی کی نجی ملکیت یا سرکاری زمین پر دیوار کھڑی کرنا ناجائز قبضہ شمار ہوگا۔",
                "عوامی سہولیات جیسے راستوں اور چراگاہوں کا احاطہ کرنا ممنوع ہے۔"
              ],
              "english": [
                "This ruling applies only to land that has no prior legal owner.",
                "Erecting a wall on private or state-owned land is considered illegal occupation.",
                "Enclosing public utilities like roads or common pastures is strictly forbidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "آباد کرنے کی دیگر صورتیں",
              "english": "Other Forms of Revival"
            },
            "content": {
              "urdu": [
                "دیوار بنانے کے علاوہ پانی لانا اور درخت لگانا بھی 'احیاء' میں شامل ہے۔",
                "فقہاء کے نزدیک ہر وہ کام جو عرفِ عام میں آباد کاری سمجھا جائے، وہ کافی ہے۔",
                "زمین کی نوعیت کے حساب سے آباد کرنے کا طریقہ بدل سکتا ہے۔"
              ],
              "english": [
                "In addition to building walls, bringing water and planting trees counts as revival.",
                "Jurists state that any act considered 'cultivation' by custom (Urf) is sufficient.",
                "The method of revival may vary depending on the nature of the land."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ریاستی انتظام اور نظم و ضبط",
        "english": "State Management and Order"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکومتی اجازت کی اہمیت",
              "english": "Importance of Government Permission"
            },
            "content": {
              "urdu": [
                "بغیر منصوبہ بندی کے زمین گھیرنے سے معاشرتی فساد پیدا ہو سکتا ہے۔",
                "موجودہ دور میں زمین کی الاٹمنٹ کے لیے قانونی طریقہ کار اختیار کرنا ضروری ہے۔",
                "اسلامی ریاست کا کام لوگوں کے درمیان حقوق کی منصفانہ تقسیم کو یقینی بنانا ہے۔"
              ],
              "english": [
                "Enclosing land without planning can lead to social discord and disputes.",
                "In modern times, it is essential to follow legal procedures for land allotment.",
                "The role of the Islamic state is to ensure fair distribution of rights among people."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجارہ داری کا خاتمہ",
              "english": "Eliminating Monopolies"
            },
            "content": {
              "urdu": [
                "یہ قانون طاقتور افراد کو زمینیں بلا وجہ ذخیرہ کرنے سے روکتا ہے۔",
                "ملکیت صرف اسی کو ملتی ہے جو واقعی زمین پر محنت کرتا ہے۔",
                "اسلامی معیشت وسائل کی گردش اور عوامی استعمال کو فروغ دیتی ہے۔"
              ],
              "english": [
                "This law prevents powerful individuals from hoarding land without cause.",
                "Ownership is granted only to those who truly put labor into the land.",
                "Islamic economics promotes the circulation and public use of resources."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محنت اور پیداواری عمل",
              "english": "Labor and Productivity"
            },
            "content": {
              "urdu": [
                "زمین کو معطل چھوڑنا قومی نقصان ہے، اسے آباد کرنا صدقہ جاریہ ہے۔",
                "ایک مسلمان کو چاہیے کہ وہ بنجر جگہوں کو سرسبز بنا کر ماحولیات میں بہتری لائے۔",
                "اپنی محنت سے حلال جائیداد بنانا ایک مستحسن عمل ہے۔"
              ],
              "english": [
                "Leaving land idle is a national loss; cultivating it is a continuous charity (Sadaqah Jariyah).",
                "A Muslim should improve the environment by making barren places green.",
                "Creating lawful property through one's own labor is a highly commendable act."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی پاسداری",
              "english": "Respecting Rights"
            },
            "content": {
              "urdu": [
                "کسی کی زمین پر بلا اجازت باڑ لگانا گناہ اور غصب ہے۔",
                "معاملات میں صفائی رکھیں اور ملک کے زرعی قوانین کا احترام کریں۔",
                "ہمیشہ دوسروں کے نفع اور نقصان کا خیال رکھ کر قدم اٹھائیں۔"
              ],
              "english": [
                "Fencing someone else's land without permission is a sin and usurpation.",
                "Maintain clarity in dealings and respect the agricultural laws of the country.",
                "Always act while considering the benefit and potential loss to others."
              ]
            }
          }
        ]
      }
    }
  ]
}