{
  "hadithId": 749,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/10/8"
    ],
    "kitabId": 7,
    "inKitabBab": 9,
    "arabicBook": "بلوغ المرام",
    "babId": 50
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2675) ومسلم (1697/25)، وهو جزء من حديث طويل يتعلق بحد الزنا.",
    "urdu": "صحیح بخاری (2675) اور صحیح مسلم (1697) میں روایت ہے، یہ ایک طویل حدیث کا حصہ ہے جو حدِ زنا سے متعلق ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2675) and Muslim (1697). It is part of a lengthy narration concerning the legal punishment for adultery."
  },
  "importantWords": [
    {
      "arabic": "اَلْعَسِيفِ",
      "english": "Laborer / Hired servant",
      "urdu": "مزدور / اجرت پر کام کرنے والا"
    },
    {
      "arabic": "اغْدُ",
      "english": "Go early in the morning",
      "urdu": "صبح سویرے جاؤ"
    },
    {
      "arabic": "اعْتَرَفَتْ",
      "english": "Confessed",
      "urdu": "اعتراف کر لے"
    },
    {
      "arabic": "فَارْجُمْهَا",
      "english": "Stone her",
      "urdu": "اسے سنگسار کر دو"
    },
    {
      "arabic": "قِصَّةِ",
      "english": "Story / Incident",
      "urdu": "قصہ / واقعہ"
    },
    {
      "arabic": "متفق عليه",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں زنا کے ثبوت کے لیے اعتراف کی اہمیت اور شادی شدہ زانی کے لیے سنگسار کرنے کی شرعی سزا کا ذکر ہے۔",
    "english": "This Hadith highlights the importance of confession in establishing a crime and the legal punishment of stoning for a married adulterer."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2675)",
      "english": "Sahih al-Bukhari (2675)"
    },
    {
      "arabic": "صحيح مسلم (1697)",
      "english": "Sahih Muslim (1697)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أنيس بن الضحاك الأسلمي",
        "english": "Unais bin Al-Dahhak Al-Aslami"
      },
      "slug": "unais-bin-al-dahhak"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XWp0uLpX75M",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدود میں تحقیق",
        "english": "Investigation in Punishments"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتراف کی اہمیت",
              "english": "Importance of Confession"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں سزا دینے سے پہلے جرم کا مکمل ثبوت ضروری ہے۔",
                "نبی کریم ﷺ نے صرف الزام پر سزا نہیں دی بلکہ اعتراف طلب کیا۔",
                "اقرارِ جرم کو شرعی عدالتوں میں سب سے مضبوط گواہی مانا جاتا ہے۔"
              ],
              "english": [
                "Complete evidence of a crime is mandatory before execution in Islam.",
                "The Prophet (ﷺ) did not punish based on accusation alone but sought confession.",
                "Confession is considered the strongest form of evidence in Sharia courts."
              ]
            }
          },
          {
            "title": {
              "urdu": "نائب مقرر کرنا",
              "english": "Appointing a Deputy"
            },
            "content": {
              "urdu": [
                "حاکمِ وقت کسی معاملے کی تحقیق کے لیے نائب مقرر کر سکتا ہے۔",
                "سیدنا انیس رضی اللہ عنہ کو اس معاملے میں وکیل بنا کر بھیجا گیا۔",
                "اس سے ثابت ہوتا ہے کہ عدالتی معاملات میں معاونت لی جا سکتی ہے۔"
              ],
              "english": [
                "A ruler can appoint a deputy to investigate specific legal matters.",
                "Unais (RA) was sent as a representative to handle this sensitive case.",
                "This proves that delegation is permissible in judicial administrative tasks."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدِ زنا کے احکامات",
        "english": "Laws Regarding Adultery"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رجم کی سزا",
              "english": "Punishment of Stoning"
            },
            "content": {
              "urdu": [
                "شادی شدہ مرد یا عورت اگر زنا کرے تو اس کی سزا رجم ہے۔",
                "یہ سزا قرآن و سنت اور اجماعِ امت سے ثابت شدہ ہے۔",
                "رجم معاشرے کو بے حیائی سے بچانے کے لیے ایک عبرتناک سزا ہے۔"
              ],
              "english": [
                "The punishment for a married person committing adultery is stoning.",
                "This is established through Sunnah and the consensus of the Ummah.",
                "Stoning serves as a deterrent to protect society from immorality."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کی پردہ پوشی",
              "english": "Protecting Woman's Honor"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے براہِ راست اس عورت کو دربار میں نہیں بلایا۔",
                "تحقیق کے لیے صحابی کو اس کے پاس بھیجنا حیا اور پردے کی علامت ہے۔",
                "اسلام گنہگاروں کی بھی غیر ضروری تشہیر سے گریز کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not summon the woman directly to the public court.",
                "Sending a companion to her shows concern for modesty and privacy.",
                "Islam teaches avoiding unnecessary publicity even for the accused."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی فوائد",
        "english": "Juristic Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ثبوت کے ذرائع",
              "english": "Means of Proof"
            },
            "content": {
              "urdu": [
                "زنا کا ثبوت چار گواہوں یا صریح اعتراف سے ہوتا ہے۔",
                "اس قصے میں عورت کے اعتراف کو ہی بنیاد بنایا گیا۔",
                "اگر اعتراف نہ ہوتا تو محض الزام پر سزا جاری نہیں ہو سکتی تھی۔"
              ],
              "english": [
                "Adultery is proven by four witnesses or a clear confession.",
                "In this story, the woman's own confession was the basis of the verdict.",
                "Without a confession or witnesses, punishment cannot be applied."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف",
              "english": "Justice and Equity"
            },
            "content": {
              "urdu": [
                "اسلامی نظامِ عدل میں ہر ایک کو اپنا موقف پیش کرنے کا حق ہے۔",
                "الزام لگانے والے کے بیان پر فوری فیصلہ نہیں کیا جاتا۔",
                "مظلوم کی داد رسی اور مجرم کی گرفت دونوں لازم ہیں۔"
              ],
              "english": [
                "The Islamic judicial system gives everyone the right to state their case.",
                "Decisions are not made solely on the statement of the accuser.",
                "Redressing the wronged and holding the criminal accountable are both vital."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و سماجی پہلو",
        "english": "Ethical and Social Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی پاکیزگی",
              "english": "Social Purity"
            },
            "content": {
              "urdu": [
                "حدود کا قیام معاشرے میں امن اور طہارت کا ضامن ہے۔",
                "زنا خاندانی نظام کو تباہ کرنے والا سب سے بڑا گناہ ہے۔",
                "سخت سزائیں جرائم کی شرح کو کم کرنے میں مددگار ہوتی ہیں۔"
              ],
              "english": [
                "Establishing legal limits ensures peace and purity in society.",
                "Adultery is the gravest sin that destroys the family structure.",
                "Strict punishments help in significantly reducing the crime rate."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور اعتراف",
              "english": "Repentance and Confession"
            },
            "content": {
              "urdu": [
                "اعترافِ جرم توبہ کا ایک راستہ ہے تاکہ آخرت کی سزا سے بچا جا سکے۔",
                "دنیاوی سزا گناہوں کا کفارہ بن جاتی ہے۔",
                "اللہ تعالیٰ توبہ کرنے والوں کو پسند فرماتا ہے۔"
              ],
              "english": [
                "Confessing a crime is a path to repentance to avoid afterlife punishment.",
                "Worldly punishment serves as an expiation for the sin committed.",
                "Allah Almighty loves those who turn to Him in sincere repentance."
              ]
            }
          }
        ]
      }
    }
  ]
}