{
  "hadithId": 438,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/14", "bukhari/1269", "muslim/2400"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1269) ، ومسلم (2400). وقد فعل النبي صلى الله عليه وسلم ذلك تطييباً لقلب ابنه عبد الله الذي كان صحابياً جليلاً مخلصاً.",
    "urdu": "صحیح۔ اسے بخاری (1269) اور مسلم (2400) نے روایت کیا ہے۔ آپ ﷺ نے یہ عمل عبداللہ بن ابی کے بیٹے عبداللہ (جو کہ مخلص صحابی تھے) کی دلجوئی کے لیے فرمایا۔",
    "english": "Sahih. Reported by Al-Bukhari (1269) and Muslim (2400). The Prophet (ﷺ) did this to please the heart of the son, Abdullah, who was a sincere and noble Companion."
  },
  "importantWords": [
    {
      "arabic": "تُوُفِّيَ",
      "english": "Died / Passed away",
      "urdu": "فوت ہو گیا"
    },
    {
      "arabic": "قَمِيصَكَ",
      "english": "Your shirt",
      "urdu": "آپ کی قمیص"
    },
    {
      "arabic": "أُكَفِّنْهُ",
      "english": "I shroud him",
      "urdu": "میں اسے کفن دوں"
    },
    {
      "arabic": "فَأَعْطَاهُ",
      "english": "So he gave him",
      "urdu": "پس آپ نے اسے دے دی"
    },
    {
      "arabic": "آثار",
      "english": "Relics / Remnants",
      "urdu": "تبرکات / آثار"
    }
  ],
  "summary": {
    "urdu": "آپ ﷺ نے عبداللہ بن ابی کے بیٹے کی درخواست پر اپنی قمیص کفن کے لیے عطا فرمائی، جو آپ ﷺ کے اعلیٰ اخلاق اور صحابہ کی دلجوئی کی دلیل ہے۔",
    "english": "The Prophet (ﷺ) gave his shirt to be used as a shroud for Abdullah bin Ubayy upon his son's request, demonstrating his sublime character and care for his Companions' feelings."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الجنائز، رقم 1269",
      "english": "Sahih al-Bukhari, Book of Funerals, Hadith 1269"
    },
    {
      "arabic": "صحيح مسلم، كتاب فضائل الصحابة، رقم 2400",
      "english": "Sahih Muslim, Book of Virtues of the Companions, Hadith 2400"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Muttafaqun Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا اخلاقِ کریمانہ",
        "english": "The Prophet's Noble Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دشمن کے ساتھ حسنِ سلوک",
              "english": "Kindness Towards Enemies"
            },
            "content": {
              "urdu": [
                "عبداللہ بن ابی منافقوں کا سردار تھا، لیکن آپ ﷺ نے اس کے بیٹے کی خاطر اپنی قمیص عطا فرمائی۔",
                "یہ عمل آپ ﷺ کے عفو و درگزر اور دشمنوں کے لواحقین کے ساتھ ہمدردی کی بہترین مثال ہے۔",
                "اسلام دشمنی کے باوجود انسانی ہمدردی اور تعلقات کے تقدس کو برقرار رکھنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Abdullah bin Ubayy was the leader of the hypocrites, yet the Prophet (ﷺ) gave his shirt for his son's sake.",
                "This act is a prime example of the Prophet's (ﷺ) forgiveness and sympathy toward the relatives of his enemies.",
                "Islam teaches maintaining human compassion and the sanctity of relationships despite personal enmity."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کی دلجوئی",
              "english": "Comforting the Companions"
            },
            "content": {
              "urdu": [
                "عبداللہ بن ابی کا بیٹا ایک مخلص مسلمان تھا، آپ ﷺ نے ان کی دلی تسلی کے لیے یہ درخواست قبول کی۔",
                "ایک لیڈر کو اپنے پیروکاروں کے جذبات اور ان کی نفسیاتی ضرورتوں کا خیال رکھنا چاہیے۔",
                "اس سے ثابت ہوتا ہے کہ آپ ﷺ اپنے صحابہ کی خوشی کے لیے اپنی عزیز چیز بھی قربان کر دیتے تھے۔"
              ],
              "english": [
                "The son of Abdullah bin Ubayy was a sincere Muslim, and the Prophet (ﷺ) accepted his request to comfort him.",
                "A leader should always consider the emotions and psychological needs of his followers.",
                "This proves that the Prophet (ﷺ) would sacrifice his own belongings for the happiness of his Companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تبرک اور اس کے احکامات",
        "english": "Tabarruk and Its Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آثارِ نبوی ﷺ سے تبرک",
              "english": "Seeking Blessings from Prophetic Relics"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے لباس یا جسم سے چھو جانے والی اشیاء سے برکت حاصل کرنا صحابہ کا متفقہ عمل تھا۔",
                "عبداللہ بن ابی کے بیٹے کا قمیص مانگنا اسی عقیدے کی عکاسی کرتا ہے کہ اس سے عذاب میں تخفیف ہو سکتی ہے۔",
                "نبی ﷺ کی ذات بابرکت تھی اور ان کے آثار سے تبرک لینا صرف ان کی ذات تک محدود تھا۔"
              ],
              "english": [
                "Seeking blessings from the Prophet's garments or items he touched was a unanimous practice of the Sahaba.",
                "Requesting the shirt reflects the belief that it might alleviate the punishment of the deceased.",
                "The Prophet's (ﷺ) person was blessed, and seeking Tabarruk from relics was a specialty unique to him."
              ]
            }
          },
          {
            "title": {
              "urdu": "خصوصیتِ نبوی ﷺ",
              "english": "Uniqueness of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "علماء کے مطابق آثار سے تبرک لینا صرف نبی ﷺ کے ساتھ خاص تھا، کسی اور بزرگ کے لیے نہیں۔",
                "صحابہ کرام نے کبھی ایک دوسرے کے لباس یا وضو کے پانی سے اس طرح تبرک حاصل نہیں کیا۔",
                "سلف صالحین کے فہم کے مطابق اس عمل کو عام لوگوں یا پیروں فقیروں تک پھیلانا بدعت کا سبب بن سکتا ہے۔"
              ],
              "english": [
                "According to scholars, seeking blessings from relics was specific to the Prophet (ﷺ) and not others.",
                "The Companions never sought blessings from each other's clothing or leftover Wudu water in this manner.",
                "Following the Salaf, extending this practice to ordinary people or spiritual leaders can lead to innovation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منافق کا انجام اور شفاعت",
        "english": "Fate of Hypocrites and Intercession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لباس کی محدود نفع رسانی",
              "english": "Limited Benefit of the Garment"
            },
            "content": {
              "urdu": [
                "محض نبی ﷺ کا لباس پہن لینا کفر اور نفاق کے انجام سے بچانے کے لیے کافی نہیں ہے۔",
                "آخرت میں کامیابی کا دارومدار صرف اور صرف ایمان اور نیک اعمال پر ہے۔",
                "اگرچہ آپ ﷺ نے قمیص دی، لیکن قرآن نے واضح کیا کہ منافقوں کے لیے استغفار فائدہ مند نہیں ہوتا۔"
              ],
              "english": [
                "Merely wearing the Prophet's garment is not enough to save one from the consequences of disbelief.",
                "Success in the Hereafter depends solely and exclusively on faith (Iman) and righteous deeds.",
                "Although the Prophet (ﷺ) gave his shirt, the Quran clarified that seeking forgiveness for hypocrites is futile."
              ]
            }
          },
          {
            "title": {
              "urdu": "احسان کا بدلہ",
              "english": "Repaying a Favor"
            },
            "content": {
              "urdu": [
                "ایک روایت کے مطابق عبداللہ بن ابی نے جنگِ بدر کے قیدی عباس رض کو اپنی قمیص دی تھی۔",
                "آپ ﷺ نے اس پرانے احسان کا بدلہ چکانے کے لیے اپنی قمیص عطا فرمائی۔",
                "یہ عمل ہمیں سکھاتا ہے کہ احسان کرنے والے کا بدلہ ضرور دینا چاہیے، چاہے وہ کیسا ہی کیوں نہ ہو۔"
              ],
              "english": [
                "According to one report, Abdullah bin Ubayy gave his shirt to Al-Abbas (RA) when he was a prisoner at Badr.",
                "The Prophet (ﷺ) gave his own shirt to repay that old favor and maintain his standard of gratitude.",
                "This teaches us that a favor should be repaid to the benefactor, regardless of their personal character."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلیٰ ظرفی کا مظاہرہ",
              "english": "Demonstrating Magnanimity"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی زندگی میں تنگ نظری کے بجائے فراخ دلی اور اعلیٰ ظرفی دکھانی چاہیے۔",
                "کسی کی مجبوری یا جذباتی درخواست کو اگر ممکن ہو تو رد نہیں کرنا چاہیے۔",
                "نبی ﷺ کی زندگی کا ہر پہلو ہمیں دوسروں کے لیے آسانیاں پیدا کرنے کا سبق دیتا ہے۔"
              ],
              "english": [
                "A Muslim should demonstrate magnanimity and broad-mindedness in life instead of narrow-mindedness.",
                "If possible, one should not reject someone's desperate or emotional request for help.",
                "Every aspect of the Prophet's (ﷺ) life teaches us to create ease for others in difficult times."
              ]
            }
          },
          {
            "title": {
              "urdu": "عقیدے کی درستگی",
              "english": "Correction of Belief"
            },
            "content": {
              "urdu": [
                "ہمیں تبرک کے معاملے میں غلو سے بچنا چاہیے اور سنت کے دائرے میں رہنا چاہیے۔",
                "صرف ظاہری اشیاء پر بھروسہ کرنے کے بجائے اپنی آخرت کی فکر خود کرنی چاہیے۔",
                "سچی اتباع ہی وہ تبرک ہے جو انسان کو اللہ کے قریب اور جہنم سے دور کرتی ہے۔"
              ],
              "english": [
                "We must avoid extremism in matters of seeking blessings and stay within the bounds of Sunnah.",
                "Instead of relying on external objects, one should personally worry about their own Hereafter.",
                "True following of the Prophet (ﷺ) is the real blessing that brings one closer to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}