{
  "hadithId": 1124,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/45"],
    "kitabId": 11,
    "inKitabBab": 2,
    "arabicBook": "كتاب الجهاد - باب الجزية والهدنة",
    "babId": 90
  },
  
  "takhreej": {
    "arabic": "حسن.‏ رواه أبو داود (3037) في كتاب الخراج والمارة والفيء، والبيهقي (9/187). وأصله قصة تبوك حين بعث النبي ﷺ خالد بن الوليد إلى أكيدر بن عبد الملك الكندي صاحب دومة الجندل.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام ابوداؤد (3037) اور بیہقی نے روایت کیا ہے۔ یہ واقعہ غزوہ تبوک کے موقع کا ہے جب آپ ﷺ نے خالد بن ولید کو دومۃ الجندل کے عیسائی حکمران اکیدر کی طرف بھیجا تھا۔",
    "english": "Hasan. Reported by Abu Dawud (3037) and al-Bayhaqi (9/187). It refers to the events around the Battle of Tabuk when the Prophet (ﷺ) dispatched Khalid bin al-Walid to Ukaidir bin Abdul Malik al-Kindi, the ruler of Dumah al-Jandal."
  },
  "importantWords": [
    {
      "arabic": "بَعَثَ",
      "english": "Sent/Dispatched",
      "urdu": "بھیجا"
    },
    {
      "arabic": "فَأَخَذُوهُ",
      "english": "They captured him",
      "urdu": "پس انہوں نے اسے پکڑ لیا"
    },
    {
      "arabic": "فَحَقَنَ دَمَهُ",
      "english": "Spared his life / Saved his blood",
      "urdu": "اس کا خون بچا لیا (قتل نہ کیا)"
    },
    {
      "arabic": "صَالَحَهُ",
      "english": "Made peace with him",
      "urdu": "اس سے صلح کر لی"
    },
    {
      "arabic": "الْجِزْيَةِ",
      "english": "Jizyah (Tax on non-Muslim subjects)",
      "urdu": "جزیہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ اہل کتاب (عیسائی و یہودی) سے جزیہ قبول کرنا اور انہیں قتل کے بجائے صلح کے تحت پناہ دینا اسلامی ریاست کا قانون ہے۔",
    "english": "This Hadith establishes that it is permissible to accept Jizyah from the People of the Book and grant them protection under a peace treaty instead of execution."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3037)",
      "english": "Sunan Abi Dawud (3037)"
    },
    {
      "arabic": "السنن الكبرى للبيهقي (9/187)",
      "english": "Al-Sunan al-Kubra by al-Bayhaqi (9/187)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جزیہ کا تصور اور نفاذ",
        "english": "Concept and Implementation of Jizyah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہل کتاب سے جزیہ",
              "english": "Jizyah from People of the Book"
            },
            "content": {
              "urdu": [
                "جزیہ وہ رقم ہے جو غیر مسلم (ذمی) اسلامی ریاست کے تحفظ کے بدلے ادا کرتے ہیں۔",
                "اکیدر دومہ عیسائی تھا، اس لیے اس سے جزیہ قبول کیا گیا۔",
                "جزیہ ادا کرنے کے بعد ان کی جان، مال اور عبادت گاہوں کا تحفظ اسلامی ریاست کی ذمہ داری بن جاتا ہے۔"
              ],
              "english": [
                "Jizyah is a protection tax paid by non-Muslim subjects (Dhimmis) in an Islamic state.",
                "Ukaidir was a Christian, which is why Jizyah was accepted from him.",
                "Once Jizyah is paid, the state becomes responsible for protecting their lives, property, and places of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "خون کی حرمت",
              "english": "Sanctity of Blood"
            },
            "content": {
              "urdu": [
                "حقنِ دم کا مطلب ہے کسی کے خون کو بہنے سے بچا لینا اور اسے امان دینا۔",
                "اسلام بلا ضرورت خون بہانے کے حق میں نہیں ہے، اگر دشمن صلح پر آمادہ ہو تو اسے قبول کیا جائے گا۔",
                "نبی کریم ﷺ نے اکیدر کو قیدی ہونے کے باوجود جان کی امان عطا فرمائی۔"
              ],
              "english": [
                "'Haqn al-dam' means to spare someone's life and grant them safety.",
                "Islam does not advocate unnecessary bloodshed; if an enemy inclines toward peace, it must be accepted.",
                "The Prophet (ﷺ) granted Ukaidir safety even though he was a high-profile captive."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنگی حکمت عملی اور سفارت کاری",
        "english": "War Strategy and Diplomacy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خالد بن ولید کی مہم",
              "english": "Expedition of Khalid bin al-Walid"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے حضرت خالد کو 400 سواروں کے ساتھ دومہ بھیجا تھا۔",
                "آپ ﷺ نے وحی کی بنا پر پہلے ہی بتا دیا تھا کہ تم اسے اس حال میں پاؤ گے کہ وہ نیل گائے کا شکار کر رہا ہوگا۔",
                "یہ مہم اسلامی ریاست کی سرحدوں کو محفوظ کرنے کے لیے انتہائی اہم تھی۔"
              ],
              "english": [
                "The Prophet (ﷺ) sent Khalid (R.A) with 400 horsemen to Dumah.",
                "Based on revelation, the Prophet (ﷺ) predicted that Khalid would find Ukaidir hunting wild cows.",
                "This expedition was crucial for securing the northern borders of the Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "صلح کے شرائط",
              "english": "Terms of Peace"
            },
            "content": {
              "urdu": [
                "اکیدر نے دو ہزار اونٹ، آٹھ سو گھوڑے اور چار سو زرہیں دینے کا وعدہ کیا۔",
                "صلح کے معاہدے میں فریقین کی رضامندی اور شرائط کی وضاحت ضروری ہے۔",
                "اسلامی ریاست میں غیر مسلموں کے ساتھ کیے گئے معاہدوں کی پاسداری فرض ہے۔"
              ],
              "english": [
                "Ukaidir agreed to pay two thousand camels, eight hundred horses, and four hundred armors.",
                "Clarity of terms and mutual consent are essential in peace treaties.",
                "Upholding treaties made with non-Muslims is an obligatory duty in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حقوق اور مراعات",
        "english": "Rights and Privileges"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فوجی سروس سے استثناء",
              "english": "Exemption from Military Service"
            },
            "content": {
              "urdu": [
                "جزیہ دینے والے غیر مسلموں پر مسلمانوں کی طرح فوجی دفاعی ذمہ داری نہیں ہوتی۔",
                "ان کی حفاظت کی ذمہ داری خود مسلمان اٹھاتے ہیں۔",
                "یہ رقم ریاست کے دفاعی اور انتظامی امور پر خرچ کی جاتی ہے۔"
              ],
              "english": [
                "Non-Muslims paying Jizyah are not required to participate in military defense like Muslims.",
                "Muslims take upon themselves the responsibility of protecting them.",
                "The collected funds are used for the state's defense and administrative expenses."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف",
              "english": "Justice and Equity"
            },
            "content": {
              "urdu": [
                "اسلام نے مفتوحہ اقوام کے ساتھ کبھی بھی بدسلوکی کی اجازت نہیں دی۔",
                "قیدیوں کے ساتھ حسن سلوک اور ان کی جان کی حفاظت نبوی طریقہ کار ہے۔",
                "حق دار کو اس کی حیثیت کے مطابق امان دینا سیاسی بصیرت کی علامت ہے۔"
              ],
              "english": [
                "Islam has never permitted the mistreatment of conquered nations.",
                "Treating captives with kindness and preserving their lives is the Prophetic method.",
                "Granting safety to leaders based on their status reflects political wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عہد کی پابندی",
              "english": "Fulfilling Covenants"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو اپنے وعدوں اور معاہدوں کا پکا ہونا چاہیے۔",
                "اگر کسی دشمن کو امان دے دی جائے تو اس کی خلاف ورزی دھوکہ دہی ہے۔",
                "صلح جوئی کو جنگ و جدل پر فوقیت دینا سنتِ نبوی ہے۔"
              ],
              "english": [
                "Muslims must be firm in their promises and treaties.",
                "Violating a grant of safety given to an enemy is a form of betrayal.",
                "Prioritizing reconciliation over perpetual conflict is the Sunnah of the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعوت اور حکمت",
              "english": "Da'wah and Wisdom"
            },
            "content": {
              "urdu": [
                "نرمی اور صلح کے ذریعے غیر مسلموں کے دل جیتے جا سکتے ہیں۔",
                "اسلام کی طاقت صرف تلوار نہیں بلکہ اس کا اعلیٰ اخلاقی اور قانونی نظام ہے۔",
                "ہمیں ہر حال میں انصاف اور اعلیٰ کردار کا نمونہ پیش کرنا چاہیے۔"
              ],
              "english": [
                "Hearts of non-Muslims can be won through kindness and peaceful diplomacy.",
                "The power of Islam lies not just in the sword, but in its superior moral and legal framework.",
                "We must present a model of justice and high character in all situations."
              ]
            }
          }
        ]
      }
    }
  ]
}