{
  "hadithId": 859,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/45"],
    "kitabId": 8,
    "inKitabBab": 2,
    "arabicBook": "كتاب النكاح",
    "babId": 65
  },
  
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه أحمد (4/232)، وأبو داود (2243)، والترمذي (1129)، وابن ماجه (1951). وصححه ابن حبان والدارقطني، وأعله البخاري بالإرسال ولكن المعنى ثابت بنصوص القرآن.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے احمد، ابوداؤد، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ اگرچہ امام بخاری نے اس کی سند پر کلام کیا ہے، لیکن اس کا مفہوم قرآن مجید کی نص کے عین مطابق ہے جو دو بہنوں کو جمع کرنے سے منع کرتی ہے۔",
    "english": "Sahih with supporting evidences. Reported by Ahmad (4/232), Abu Dawud (2243), At-Tirmidhi (1129), and Ibn Majah (1951). Authenticated by Ibn Hibban and Ad-Daraqutni. Al-Bukhari mentioned a technical defect in the chain, but the ruling is supported by the Quran."
  },
  "importantWords": [
    {
      "arabic": "أَسْلَمْتُ",
      "english": "Embraced Islam",
      "urdu": "میں اسلام لایا"
    },
    {
      "arabic": "تَحْتِي",
      "english": "Under me (married to)",
      "urdu": "میرے نکاح میں"
    },
    {
      "arabic": "أُخْتَانِ",
      "english": "Two sisters",
      "urdu": "دو بہنیں"
    },
    {
      "arabic": "طَلِّقْ",
      "english": "Divorce",
      "urdu": "طلاق دے دو"
    },
    {
      "arabic": "شِئْتَ",
      "english": "You wish / like",
      "urdu": "تم چاہو"
    }
  ],
  "summary": {
    "urdu": "اسلام میں دو بہنوں کو ایک ہی وقت میں نکاح میں جمع کرنا حرام ہے۔ اگر کوئی شخص بحالتِ کفر ایسا کر چکا ہو، تو اسلام لانے کے بعد اسے ایک کو منتخب کرنا ہوگا اور دوسری کو جدا کرنا ہوگا۔",
    "english": "Islam prohibits combining two sisters in marriage simultaneously. If a man has done so before converting, he must choose one and divorce the other upon embracing Islam."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2243)",
      "english": "Sunan Abi Dawud (2243)"
    },
    {
      "arabic": "سنن الترمذي (1129)",
      "english": "Sunan at-Tirmidhi (1129)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "فيروز الديلمي",
        "english": "Fairuz Ad-Dailami"
      },
      "slug": "fairuz-ad-dailami"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3L0f6LpB3M",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih lighairihi"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دو بہنوں کو جمع کرنے کی حرمت",
        "english": "Prohibition of Combining Two Sisters"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآنی حکم",
              "english": "Quranic Injunction"
            },
            "content": {
              "urdu": [
                "قرآن مجید میں سورہ النساء میں واضح طور پر دو بہنوں کو نکاح میں جمع کرنے سے منع کیا گیا ہے۔",
                "یہ ممانعت ابدی ہے اور اس پر تمام امت کا اجماع ہے۔",
                "اس حکم کا مقصد خاندانی رشتوں میں حسد اور بگاڑ کو روکنا ہے۔"
              ],
              "english": [
                "The Quran in Surah An-Nisa explicitly forbids combining two sisters in marriage simultaneously.",
                "This prohibition is eternal and there is a consensus (Ijma) among the Ummah on it.",
                "The wisdom behind this is to prevent jealousy and the breaking of kinship ties."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام لانے کے بعد انتخاب",
              "english": "Choice After Embracing Islam"
            },
            "content": {
              "urdu": [
                "اگر کوئی غیر مسلم حالتِ کفر میں دو بہنوں سے نکاح کر چکا ہو، تو اسلام لانے پر وہ نکاح برقرار نہیں رہ سکتا۔",
                "اسے اختیار دیا جاتا ہے کہ وہ اپنی مرضی سے کسی ایک کو منتخب کر لے۔",
                "نبی کریم ﷺ کا یہ فیصلہ عدل اور آسانی پر مبنی ہے۔"
              ],
              "english": [
                "If a non-Muslim had married two sisters, the contract cannot remain valid after conversion.",
                "He is given the choice to retain whichever of the two he prefers.",
                "The Prophet's (ﷺ) ruling is based on justice and making the transition easy for the new convert."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی مسائل",
        "english": "Juristic and Legal Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاحِ اول اور ثانی کا فرق",
              "english": "Difference Between First and Second Contract"
            },
            "content": {
              "urdu": [
                "اگر نکاح اسلام کی حالت میں ترتیب سے ہوئے ہوں، تو دوسرا نکاح سرے سے باطل ہوگا۔",
                "لیکن کفر کی حالت میں چونکہ ان کے اپنے قوانین تھے، اس لیے یہاں ترتیب کے بجائے انتخاب کا حق دیا گیا۔",
                "یہ رعایت صرف ان لوگوں کے لیے ہے جو حالتِ کفر سے اسلام میں داخل ہوں۔"
              ],
              "english": [
                "If the marriages happened sequentially while in Islam, the second contract would be void from the start.",
                "Since they followed their own laws while in disbelief, the right to choose is given instead of following sequence.",
                "This concession is specifically for those entering Islam from a state of disbelief."
              ]
            }
          },
          {
            "title": {
              "urdu": "طلاق کا طریقہ",
              "english": "Method of Separation"
            },
            "content": {
              "urdu": [
                "حدیث میں 'طلاق' کا لفظ علیحدگی اور انتخاب کو واضح کرنے کے لیے استعمال ہوا ہے۔",
                "اس سے مراد یہ ہے کہ وہ ایک کو چھوڑ دے اور اسے آزاد کر دے۔",
                "اس علیحدگی کے بعد وہ خاتون کسی دوسرے سے نکاح کرنے میں آزاد ہو جائے گی۔"
              ],
              "english": [
                "The word 'divorce' in the Hadith is used to clarify the act of separation and choice.",
                "It means he must let go of one and set her free from his bond.",
                "After this separation, the woman becomes free to marry someone else."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محرماتِ نسبی اور رضاعی",
        "english": "Consanguineous and Foster Relations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رشتوں کا تقدس",
              "english": "Sanctity of Relations"
            },
            "content": {
              "urdu": [
                "اسلام نے رشتوں کے احترام اور تقدس کو بہت اہمیت دی ہے۔",
                "جس طرح حقیقی بہنوں کو جمع کرنا حرام ہے، اسی طرح رضاعی (دودھ شریک) بہنوں کا بھی یہی حکم ہے۔",
                "یہ قانون خاندانی ڈھانچے کو اخلاقی پستی سے بچاتا ہے۔"
              ],
              "english": [
                "Islam places great importance on the respect and sanctity of familial relations.",
                "Just as combining biological sisters is haram, the same rule applies to foster sisters.",
                "This law protects the family structure from moral degradation."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشرک معاشرے کی اصلاح",
              "english": "Reforming Pagan Societies"
            },
            "content": {
              "urdu": [
                "جاہلیت میں ایسے نکاح عام تھے جن میں محرم رشتوں کا خیال نہیں رکھا جاتا تھا۔",
                "اسلام نے آکر ان تمام غلط روایتوں کو جڑ سے اکھاڑ پھینکا۔",
                "یہ حدیث واضح کرتی ہے کہ اسلامی قوانین ہر قسم کے سابقہ اثرات پر غالب ہیں۔"
              ],
              "english": [
                "In the days of ignorance, marriages ignoring prohibited degrees of kinship were common.",
                "Islam came and uprooted all these incorrect and harmful traditions.",
                "This Hadith clarifies that Islamic laws prevail over any previous legal status or customs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احکام کی پابندی",
              "english": "Adherence to Rulings"
            },
            "content": {
              "urdu": [
                "اسلام لانے کے بعد انسان پر لازم ہے کہ وہ اپنے تمام معاملات کو شریعت کے مطابق ڈھالے۔",
                "خواہ وہ معاملہ کتنا ہی پرانا کیوں نہ ہو، اللہ کا حکم سب سے مقدم ہے۔",
                "سچی توبہ اور اسلام کا تقاضا ہی یہی ہے کہ انسان حرام سے مکمل دستبردار ہو جائے۔"
              ],
              "english": [
                "After embracing Islam, it is mandatory for a person to align all affairs with Sharia.",
                "No matter how old the matter is, the command of Allah takes precedence.",
                "Sincere repentance and Islam require a person to completely withdraw from what is haram."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کی جامعیت",
              "english": "Comprehensiveness of Islam"
            },
            "content": {
              "urdu": [
                "اسلام ہر شعبہ زندگی بشمول ازدواجی تعلقات میں مکمل رہنمائی فراہم کرتا ہے۔",
                "نبی کریم ﷺ کے فیصلے انسانی فطرت اور عدل کے عین مطابق ہوتے ہیں۔",
                "ہمیں اپنے گھریلو معاملات میں سنتِ نبوی ﷺ کو اپنانا چاہیے۔"
              ],
              "english": [
                "Islam provides complete guidance in every walk of life, including marital relations.",
                "The Prophet's (ﷺ) decisions are in perfect harmony with human nature and justice.",
                "We must adopt the Prophetic Sunnah in our domestic and familial affairs."
              ]
            }
          }
        ]
      }
    }
  ]
}