{
  "hadithId": 775,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/775"],
    "kitabId": 7,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 56
  },
  
  "takhreej": {
    "arabic": "ضعيف مرفوعاً وصحيح موقوفاً. رواه عبد الرزاق (15023) وفيه انقطاع لأن إبراهيم النخعي لم يسمع من أبي سعيد. ورواه البيهقي (6/120) من طريق أبي حنيفة موصولاً، لكن الصواب عند أئمة الحديث كأبي زرعة أنه موقوف على أبي سعيد الخدري.",
    "urdu": "یہ روایت مرفوعاً ضعیف ہے (یعنی نبی ﷺ تک سند ٹوٹی ہوئی ہے) لیکن موقوفاً (صحابی کا قول ہونے کی حیثیت سے) صحیح ہے۔ عبدالرزاق نے اسے روایت کیا مگر ابراہیم نخعی کا ابوسعید سے سماع نہیں ہے۔ امام ابوزُرعہ کے نزدیک صحیح یہ ہے کہ یہ ابوسعید خدری کا اپنا قول ہے۔",
    "english": "Weak as a Marfu' (Prophetic) narration but authentic as a Mauquf (statement of a Companion). Reported by Abd ur-Razzaq (15023) with a break in the chain. Abu Zur'ah and others stated that the correct version is that it is a statement of Abu Sa'id himself."
  },
  "importantWords": [
    {
      "arabic": "اِسْتَأْجَرَ",
      "english": "Hired",
      "urdu": "اجرت پر لیا"
    },
    {
      "arabic": "أَجِيراً",
      "english": "Worker / Employee",
      "urdu": "مزدور / کام کرنے والا"
    },
    {
      "arabic": "فَلْيُسَلِّمْ",
      "english": "Must specify / Notify",
      "urdu": "پس اسے بتانا چاہیے"
    },
    {
      "arabic": "أُجْرَتَهُ",
      "english": "His Wage",
      "urdu": "اس کی مزدوری"
    },
    {
      "arabic": "اِنْقِطَاعٌ",
      "english": "Broken Chain",
      "urdu": "سند کا ٹوٹا ہونا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مزدوری کے معاہدے میں شفافیت کی اہمیت واضح کرتی ہے کہ کام شروع کرنے سے پہلے اجرت کا تعین لازمی ہے تاکہ بعد میں جھگڑا نہ ہو۔",
    "english": "This Hadith emphasizes transparency in employment contracts, stating that wages must be specified before work begins to prevent future disputes."
  },
  "references": [
    {
      "arabic": "رواه عبد الرزاق (15023)",
      "english": "Reported by 'Abd ur-Razzaq (15023)"
    },
    {
      "arabic": "رواه البيهقي (6/120)",
      "english": "Reported by Al-Bayhaqi (6/120)"
    },
    {
      "arabic": "سنن النسائي (3857)",
      "english": "Sunan an-Nasa'i (3857)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0Z8f28T_x-o",
  "grade": {
    "arabic": "ضعيف مرفوعاً / صحيح موقوفاً",
    "english": "Weak as Marfu' / Authentic as Mauquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اجرت کے تعین کی اہمیت",
        "english": "Importance of Specifying Wages"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفافیت اور عدل",
              "english": "Transparency and Justice"
            },
            "content": {
              "urdu": [
                "کام شروع کرنے سے پہلے مزدوری طے کرنا فریقین کے درمیان شفافیت پیدا کرتا ہے۔",
                "بغیر اجرت طے کیے کام کروانا جہالت اور دھوکے (غرر) کے زمرے میں آتا ہے۔",
                "یہ اصول اسلامی معیشت میں جھگڑوں کے سدِ باب کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "Fixing wages before starting work ensures transparency between both parties.",
                "Hiring someone without specifying the pay falls under uncertainty and deception (Gharar).",
                "This principle is established in Islamic economics to prevent potential disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "فریقین کا اطمینان",
              "english": "Satisfaction of Both Parties"
            },
            "content": {
              "urdu": [
                "جب مزدور کو اپنی اجرت معلوم ہوتی ہے، تو وہ زیادہ دلجمعی سے کام کرتا ہے۔",
                "مالک بھی ذہنی طور پر اپنی مالی ذمہ داری کے لیے تیار رہتا ہے۔",
                "معاہدے کی وضاحت برکت اور باہمی خیر خواہی کا باعث بنتی ہے۔"
              ],
              "english": [
                "When a worker knows their wage, they work with greater focus and peace of mind.",
                "The employer is also mentally prepared for their financial obligation.",
                "Clarity in the contract leads to blessings and mutual goodwill."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور اطلاق",
        "english": "Juristic Rulings and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجرت کا معین ہونا",
              "english": "Necessity of Definite Wages"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک اجرت کا معلوم ہونا عقدِ اجارہ (Renting/Hiring) کی بنیادی شرط ہے۔",
                "اگر اجرت طے نہ ہو تو یہ معاملہ فاسد (باطل) قرار دیا جا سکتا ہے۔",
                "ایسی صورت میں 'اجرِ مثل' (مارکیٹ ریٹ) کی بنیاد پر ادائیگی کرنی ہوگی۔"
              ],
              "english": [
                "Jurists consider known wages a fundamental condition for a valid hiring contract (Ijarah).",
                "If the wage is not specified, the contract may be deemed void or defective.",
                "In such cases, payment must be made based on the 'fair market wage' (Ajr al-Mithl)."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید دور کے معاہدے",
              "english": "Modern Day Contracts"
            },
            "content": {
              "urdu": [
                "آج کے دور میں اپوائنٹمنٹ لیٹر اور تحریری معاہدے اسی سنت کی تکمیل ہیں۔",
                "تمام الاؤنسز اور کٹوتیوں کا پہلے سے علم ہونا شرعی ضرورت ہے۔",
                "زبانی کلامی وعدوں کے بجائے تحریری ثبوت تنازعات سے بچنے کا بہترین حل ہے۔"
              ],
              "english": [
                "Modern-day appointment letters and written contracts fulfill this Sunnah.",
                "Knowing all allowances and deductions beforehand is a Shariah requirement.",
                "Written evidence is the best solution to avoid disputes instead of mere verbal promises."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استحصال کا خاتمہ",
        "english": "Eliminating Exploitation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مزدور کی کمزوری کا فائدہ",
              "english": "Taking Advantage of Worker's Weakness"
            },
            "content": {
              "urdu": [
                "بعض اوقات مالکان مزدور کی ضرورت دیکھ کر اجرت طے نہیں کرتے تاکہ بعد میں کم دے سکیں۔",
                "اسلام اس قسم کے استحصال اور چالاکی کی سخت مذمت کرتا ہے۔",
                "مزدور کا حق مارنا قیامت کے دن اللہ کی دشمنی مول لینے کے مترادف ہے۔"
              ],
              "english": [
                "Employers sometimes avoid fixing wages to pay less later, exploiting the worker's need.",
                "Islam strongly condemns this type of exploitation and trickery.",
                "Depriving a worker of their right is equivalent to inviting Allah's enmity on Judgment Day."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی توازن",
              "english": "Social Equilibrium"
            },
            "content": {
              "urdu": [
                "حقوق کی وضاحت سے معاشرے میں طبقاتی کشمکش کم ہوتی ہے۔",
                "عدل و انصاف پر مبنی لین دین سے غریب طبقے کی معاشی حفاظت ہوتی ہے۔",
                "اسلامی معاشرہ فرد کی محنت کی قدر دانی سکھاتا ہے۔"
              ],
              "english": [
                "Clarifying rights reduces class conflict within society.",
                "Transactions based on justice protect the economic interests of the poor.",
                "Islamic society teaches the appreciation and valuation of an individual's labor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاملات میں صفائی",
              "english": "Clarity in Dealings"
            },
            "content": {
              "urdu": [
                "گھریلو کام کاج کے لیے مزدور لائیں یا دفتر کے لیے، پہلے تنخواہ طے کریں۔",
                "شرم و حیا کی وجہ سے اجرت طے نہ کرنا بعد میں شرمندگی کا باعث بنتا ہے۔",
                "مزدور کو اس کا حق دینا اللہ کی رحمت کے حصول کا ذریعہ ہے۔"
              ],
              "english": [
                "Whether hiring for domestic chores or office work, fix the salary first.",
                "Avoiding wage negotiation out of shyness often leads to later embarrassment.",
                "Giving a worker their due is a means of attaining Allah's mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیانتدارانہ رویہ",
              "english": "Honest Conduct"
            },
            "content": {
              "urdu": [
                "مزدور کو کام کی نوعیت اور اوقاتِ کار سے بھی پہلے آگاہ کریں۔",
                "اگر کام زیادہ لیا جائے تو اجرت میں اضافہ کرنا اخلاقی ضرورت ہے۔",
                "اپنے ماتحتوں کے ساتھ وہی رویہ رکھیں جو اپنے لیے پسند کرتے ہیں۔"
              ],
              "english": [
                "Inform the worker about the nature of the task and working hours beforehand.",
                "If extra work is taken, increasing the wage is an ethical necessity.",
                "Treat your subordinates the way you would like to be treated."
              ]
            }
          }
        ]
      }
    }
  ]
}