{
  "hadithId": 456,
  "hadithNo": 32,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/32", "bukhari/1335"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1335)، والترمذي (1027)، والنسائي (1987)، وابن ماجه (1495).",
    "urdu": "صحیح۔ اسے امام بخاری (1335) نے روایت کیا ہے۔ نیز امام ترمذی، نسائی اور ابن ماجہ نے بھی اسے اپنی کتب میں درج کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1335), At-Tirmidhi (1027), An-Nasa'i (1987), and Ibn Majah (1495)."
  },
  "importantWords": [
    {
      "arabic": "خَلَفَ",
      "english": "Behind",
      "urdu": "پیچھے"
    },
    {
      "arabic": "فَقَرَأَ",
      "english": "So he recited",
      "urdu": "پس انہوں نے تلاوت کی"
    },
    {
      "arabic": "فَاتِحَةَ",
      "english": "The Opening (Surah)",
      "urdu": "سورہ فاتحہ"
    },
    {
      "arabic": "لِتَعْلَمُوا",
      "english": "So that you may know",
      "urdu": "تاکہ تم جان لو"
    },
    {
      "arabic": "سُنَّةٌ",
      "english": "Prophetic tradition",
      "urdu": "سنت"
    }
  ],
  "summary": {
    "urdu": "نمازِ جنازہ میں سورہ فاتحہ پڑھنا مسنون اور ثابت شدہ عمل ہے، جس کی تعلیم سیدنا ابن عباس رضی اللہ عنہما نے عملاً دی ہے۔",
    "english": "Reciting Surah Al-Fatiha in the funeral prayer is an established Sunnah, as practically taught and emphasized by Ibn 'Abbas (RA)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الجنائز، رقم 1335",
      "english": "Sahih al-Bukhari, Book of Funerals, Hadith 1335"
    },
    {
      "arabic": "سنن النسائي، كتاب الجنائز، رقم 1987",
      "english": "Sunan an-Nasa'i, Book of Funerals, Hadith 1987"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازِ جنازہ میں تلاوت کا حکم",
        "english": "Ruling on Recitation in Funeral Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سورہ فاتحہ کی اہمیت",
              "english": "Importance of Surah Al-Fatiha"
            },
            "content": {
              "urdu": [
                "سیدنا ابن عباس رضی اللہ عنہما نے جنازے میں سورہ فاتحہ پڑھ کر اسے رسول اللہ ﷺ کی سنت قرار دیا۔",
                "یہ اس بات کی دلیل ہے کہ نمازِ جنازہ محض دعا نہیں بلکہ اس میں قرآن کی تلاوت بھی شامل ہے۔",
                "پہلی تکبیر کے بعد سورہ فاتحہ پڑھنا جمہور فقہاء کے نزدیک افضل اور سنت طریقہ ہے۔"
              ],
              "english": [
                "Ibn 'Abbas (RA) recited Surah Al-Fatiha in the funeral and declared it a Sunnah of the Prophet (ﷺ).",
                "This serves as evidence that the funeral prayer is not merely supplication but includes Quranic recitation.",
                "Reciting Surah Al-Fatiha after the first Takbir is considered preferable and Sunnah by the majority of scholars."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت سے مراد",
              "english": "Meaning of 'Sunnah' in Context"
            },
            "content": {
              "urdu": [
                "صحابہ کرام جب کسی عمل کو 'سنت' کہتے ہیں تو اس سے مراد نبی کریم ﷺ کا طریقہ ہوتا ہے۔",
                "ابن عباس رضی اللہ عنہما نے جان بوجھ کر آواز سے پڑھا تاکہ مقتدی اس شرعی حکم سے واقف ہوں۔",
                "یہ حدیث واضح کرتی ہے کہ جنازے کے ارکان میں قرآن کی بنیادی سورت کا شامل ہونا ثابت ہے۔"
              ],
              "english": [
                "When Companions refer to an act as 'Sunnah', it specifically means the practice of the Prophet (ﷺ).",
                "Ibn 'Abbas (RA) recited it audibly on purpose so that the followers would learn this legal ruling.",
                "This Hadith clarifies that including the primary Surah of the Quran in funeral rites is established."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی حکمت اور طریقہ کار",
        "english": "Educational Wisdom and Method"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علانیہ تلاوت کی وجہ",
              "english": "Reason for Audible Recitation"
            },
            "content": {
              "urdu": [
                "اگرچہ جنازے کی قرات عموماً آہستہ کی جاتی ہے، مگر تعلیم کی غرض سے آواز بلند کرنا جائز ہے۔",
                "ابن عباس رضی اللہ عنہما امت کے جلیل القدر فقیہ تھے، انہوں نے لوگوں کی اصلاح کے لیے یہ طریقہ اپنایا۔",
                "اس سے ثابت ہوتا ہے کہ معلم کو سنت زندہ کرنے کے لیے عملی مظاہرہ کرنا چاہیے۔"
              ],
              "english": [
                "Although funeral recitation is usually silent, raising the voice for educational purposes is permissible.",
                "Ibn 'Abbas (RA) was a great jurist of the Ummah; he used this method to correct and guide people.",
                "This proves that a teacher should use practical demonstration to revive a Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نمازِ جنازہ کا طریقہ",
              "english": "Procedure of the Funeral Prayer"
            },
            "content": {
              "urdu": [
                "پہلی تکبیر کے بعد سورہ فاتحہ اور کوئی دوسری سورت بھی پڑھی جا سکتی ہے۔",
                "دوسری تکبیر کے بعد درودِ ابراہیمی، تیسری کے بعد میت کے لیے دعا اور چوتھی کے بعد سلام پھیرنا مسنون ہے۔",
                "ابن عباس رضی اللہ عنہما کا یہ اثر ان تمام مراحل میں پہلے رکن کی اہمیت کو واضح کرتا ہے۔"
              ],
              "english": [
                "After the first Takbir, Surah Al-Fatiha and another Surah can also be recited.",
                "After the second Takbir, Durood-e-Ibrahim; after the third, prayer for the dead; and after the fourth, the Taslim.",
                "This report from Ibn 'Abbas (RA) clarifies the importance of the first pillar in these stages."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور مطابقت",
        "english": "Juristic Differences and Reconciliation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف مکاتبِ فکر کی آراء",
              "english": "Views of Different Schools of Thought"
            },
            "content": {
              "urdu": [
                "امام شافعی اور احمد رحمہ اللہ کے نزدیک سورہ فاتحہ پڑھنا واجب یا ضروری سنت ہے۔",
                "امام ابوحنیفہ اور مالک رحمہ اللہ کے نزدیک جنازہ صرف دعا ہے، مگر وہ بھی اسے ثناء کے طور پر پڑھنے کے قائل ہیں۔",
                "ابن عباس رضی اللہ عنہما کی یہ صحیح روایت قرات کے قائلین کے لیے سب سے بڑی دلیل ہے۔"
              ],
              "english": [
                "According to Imams Shafi'i and Ahmad, reciting Surah Al-Fatiha is obligatory or a necessary Sunnah.",
                "According to Imams Abu Hanifa and Malik, the funeral is solely supplication, but they allow it as praise.",
                "This authentic narration from Ibn 'Abbas (RA) is the strongest evidence for those who support recitation."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت پر اتفاق",
              "english": "Agreement on the Sunnah"
            },
            "content": {
              "urdu": [
                "تمام فقہاء اس بات پر متفق ہیں کہ جنازے کا مقصد میت کے لیے اللہ سے سفارش کرنا ہے۔",
                "سورہ فاتحہ بہترین دعا اور ثناء ہے، اس لیے اس کا شامل ہونا نماز کی روح کے عین مطابق ہے۔",
                "حدیث کے الفاظ 'تاکہ تم جان لو کہ یہ سنت ہے' تمام ابہام کو دور کر دیتے ہیں۔"
              ],
              "english": [
                "All jurists agree that the purpose of the funeral is to intercede with Allah for the deceased.",
                "Surah Al-Fatiha is the best supplication and praise, making its inclusion perfectly aligned with the prayer's spirit.",
                "The words 'so that you may know it is Sunnah' remove all ambiguity regarding this matter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور فوائد",
        "english": "Practical Lessons and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کو زندہ کرنا",
              "english": "Reviving the Sunnah"
            },
            "content": {
              "urdu": [
                "اگر معاشرے میں کسی سنت کو بھول جایا جائے تو اہل علم کو اسے واضح کرنا چاہیے۔",
                "دین کے معاملے میں صحابہ کرام کی فہم اور ان کے عمل کو ترجیح دینا ہی نجات کا راستہ ہے۔",
                "نمازِ جنازہ کے آداب کو سیکھنا ہر مسلمان کے لیے ضروری ہے تاکہ وہ اپنے بھائیوں کا حق ادا کر سکے۔"
              ],
              "english": [
                "If a Sunnah is forgotten in society, people of knowledge must clarify and revive it.",
                "Prioritizing the understanding and practice of the Sahaba in religious matters is the path to salvation.",
                "Learning the etiquettes of the funeral prayer is essential for every Muslim to fulfill the rights of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلوصِ نیت",
              "english": "Sincerity of Intent"
            },
            "content": {
              "urdu": [
                "قرآن کی تلاوت کے ساتھ میت کے لیے دعا کرنے سے شفاعت کی قبولیت کے امکانات بڑھ جاتے ہیں۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی نمازوں میں مسنون دعاؤں اور قرات کا اہتمام کریں۔",
                "سنت کی اتباع ہی وہ اصل عمل ہے جو اللہ کے ہاں مقبول و منظور ہوتا ہے۔"
              ],
              "english": [
                "Combining Quranic recitation with supplication increases the chances of intercession being accepted.",
                "Muslims should ensure they incorporate Sunnah supplications and recitations in their prayers.",
                "Following the Sunnah is the core action that is accepted and approved by Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}