{
  "hadithId": 222,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه الدارقطني (1/335)، والحاكم (1/223). ورواية وائل بن حجر صحيحة عند أبي داود (932) والترمذي (248) بلفظ: \"كان رسول الله صلى الله عليه وسلم إذا قرأ (ولا الضالين) قال: 'آمين' ورفع بها صوته\".",
    "urdu": "صحیح۔ اسے دارقطنی (1/335) اور حاکم (1/223) نے روایت کیا ہے۔ اور وائل بن حجر کی روایت صحیح ہے، جسے ابو داؤد (932) اور ترمذی (248) نے روایت کیا ہے کہ 'جب رسول اللہ صلی اللہ علیہ وسلم 'ولا الضالین' پڑھتے تو 'آمین' کہتے اور اپنی آواز بلند کرتے تھے۔'",
    "english": "Authentic (Sahih). Reported by Ad-Dāraquṭnī (1/335) and Al-Ḥākim (1/223). The narration of Wā'il ibn Ḥujr is authentic, reported by Abu Dawud (932) and At-Tirmidhi (248) with the wording: 'When the Messenger of Allah (PBUH) recited 'Wa lāḍ-ḍāllīn', he would say 'Āmīn' and raise his voice with it.'"
  },
  "importantWords": [
    {
      "arabic": "فَرَغَ",
      "english": "He finished/completed",
      "urdu": "فارغ ہوتے"
    },
    {
      "arabic": "أُمِّ الْقُرْآنِ",
      "english": "Umm Al-Qur'ān (Al-Fātiḥah)",
      "urdu": "ام القرآن (سورۃ فاتحہ)"
    },
    {
      "arabic": "رَفَعَ صَوْتَهُ",
      "english": "He raised his voice",
      "urdu": "بلند آواز سے کہا"
    },
    {
      "arabic": "آمِينَ",
      "english": "Āmīn (respond with)",
      "urdu": "آمین"
    },
    {
      "arabic": "وَلَا اَلضَّالِّينَ",
      "english": "Nor of those who go astray",
      "urdu": "اور نہ گمراہوں کی راہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں سورۃ فاتحہ کی قرأت کے اختتام پر 'آمین' کہنے کے مسنون حکم کو واضح کرتی ہے۔ امام کے لیے سنت ہے کہ وہ 'ولا الضالین' کہنے کے بعد 'آمین' بلند آواز سے کہے، اور مقتدی بھی امام کے ساتھ بلند آواز سے 'آمین' کہیں۔",
    "english": "This Hadith clarifies the Sunnah ruling regarding saying 'Āmīn' at the conclusion of reciting Surah Al-Fātiḥah in prayer. It is Sunnah for the Imām to say 'Āmīn' audibly after reciting 'Wa lāḍ-ḍāllīn', and the followers should also say 'Āmīn' aloud along with the Imām."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب التأمين وراء الإمام (932)",
      "english": "Sunan Abu Dawud, Book of Prayer, Chapter: Saying Āmīn behind the Imām (932)"
    },
    {
      "arabic": "سنن الترمذي، كتاب الصلاة، باب ما جاء في التأمين (248)",
      "english": "Sunan At-Tirmidhi, Book of Prayer, Chapter: What has been related about saying Āmīn (248)"
    },
    {
      "arabic": "سنن الدارقطني، كتاب الصلاة، باب جهر الإمام بـ(آمين) (1/335)",
      "english": "Sunan Ad-Dāraquṭnī, Book of Prayer, Chapter: The Imām saying Āmīn audibly (1/335)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurayrah"
      },
      "slug": "abu-hurayrah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "وائل بن حجر",
        "english": "Wā'il ibn Ḥujr"
      },
      "slug": "wail-ibn-hujr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آمین کا حکم اور فضیلت",
        "english": "The Ruling and Virtue of Āmīn"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آمین کا مفہوم اور حکم",
              "english": "Meaning and Ruling of Āmīn"
            },
            "content": {
              "urdu": [
                "آمین کا مطلب ہے: 'اے اللہ! قبول فرما' یا 'ایسا ہی ہو'۔ یہ سورۃ فاتحہ کی دعا کا اختتام ہے۔",
                "نبی صلی اللہ علیہ وسلم کا اسے بلند آواز سے کہنا جہری نمازوں (فجر، مغرب، عشاء) میں سنت ہے۔",
                "آمین کہنا سنت ہے، لیکن اس کے بغیر بھی نماز باطل نہیں ہوتی، البتہ ثواب میں کمی آتی ہے۔"
              ],
              "english": [
                "Āmīn means: 'O Allah! Accept (this prayer)' or 'So be it.' It concludes the supplication of Surah Al-Fātiḥah.",
                "The Prophet's audible recitation of it is Sunnah in audible prayers (Fajr, Maghrib, Ishā').",
                "Saying Āmīn is Sunnah; the prayer is not invalidated without it, but the reward is diminished."
              ]
            }
          },
          {
            "title": {
              "urdu": "مغفرت کا وعدہ",
              "english": "Promise of Forgiveness"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے فرمایا کہ جس کی آمین فرشتوں کی آمین سے مل گئی اس کے پچھلے گناہ معاف کر دیے جاتے ہیں۔",
                "فرشتوں کا 'آمین' کہنا امام کے 'ولا الضالین' ختم کرنے کے ساتھ ہی ہوتا ہے۔",
                "یہ فضیلت مقتدی اور منفرد (تنہا نماز پڑھنے والے) دونوں کے لیے ہے، لیکن جماعت میں اس کی تاکید زیادہ ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) said that whoever's Āmīn coincides with the Āmīn of the angels will have their past sins forgiven.",
                "The angels' saying 'Āmīn' occurs simultaneously with the Imām finishing 'Wa lāḍ-ḍāllīn'.",
                "This virtue applies to both the follower and the one praying alone, but it is highly emphasized in congregation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جماعت اور وحدت کا اظہار",
        "english": "Expression of Congregation and Unity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام اور مقتدی کا مشترکہ عمل",
              "english": "Joint Action of Imām and Follower"
            },
            "content": {
              "urdu": [
                "آمین کو بلند آواز سے کہنا نماز میں مسلمانوں کے اتحاد اور یکجہتی کا اظہار ہے۔",
                "امام کے ولا الضالین کے بعد سب کا ایک ساتھ آمین کہنا اجتماعی دعا کی قبولیت کی امید کو بڑھاتا ہے۔",
                "حضرت وائل بن حجر کی روایت میں 'آمین کہنے' کے ساتھ 'آواز بلند کرنے' کا صریح ذکر موجود ہے۔"
              ],
              "english": [
                "Saying Āmīn audibly expresses the unity and solidarity of Muslims in prayer.",
                "Everyone saying Āmīn together after the Imām finishes 'Wa lāḍ-ḍāllīn' increases the hope for the acceptance of the collective supplication.",
                "The narration of Wā'il ibn Ḥujr explicitly mentions both 'saying Āmīn' and 'raising the voice with it'."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف اور سنت",
              "english": "Juristic Difference and the Sunnah"
            },
            "content": {
              "urdu": [
                "حنفی فقہ کے مطابق، مقتدی کو آہستہ آمین کہنا چاہیے، جبکہ شافعی اور حنبلی بلند آواز پر زور دیتے ہیں۔",
                "نبی صلی اللہ علیہ وسلم کے واضح حکم اور عمل کی وجہ سے بلند آواز سے آمین کہنا راجح ہے۔",
                "یہ اختلاف دراصل قراءتِ فاتحہ کے اختتام کے صحیح وقت کے تعین سے جڑا ہوا ہے۔"
              ],
              "english": [
                "According to Ḥanafī Fiqh, the follower should say Āmīn silently, while Shāfi'ī and Ḥanbalī schools emphasize reciting it audibly.",
                "Due to the Prophet's clear command and practice, saying Āmīn audibly is the preferred view.",
                "This difference is essentially linked to determining the precise timing of the end of Al-Fātiḥah's recitation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی اور تذکرہ",
        "english": "Practical Guidance and Remembrance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی اتباع",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ نماز میں سنت پر عمل کریں، خواہ وہ بلند آواز سے ہو یا آہستہ آواز سے۔",
                "امام کے لیے سنت ہے کہ وہ 'ولا الضالین' کہنے کے بعد خاموش نہ ہو بلکہ فوراً بلند آواز سے آمین کہے۔",
                "جب امام آمین کہے تو مقتدیوں کو اس کے ساتھ ہی، نہ اس سے پہلے اور نہ بعد میں، آمین کہنا چاہیے۔"
              ],
              "english": [
                "Muslims should adhere to the Sunnah in prayer, whether it involves audible or silent recitation.",
                "It is Sunnah for the Imām not to pause after 'Wa lāḍ-ḍāllīn' but to immediately say Āmīn audibly.",
                "When the Imām says Āmīn, the followers should say it simultaneously, neither before nor after him."
              ]
            }
          },
          {
            "title": {
              "urdu": "آمین کا روحانی اثر",
              "english": "Spiritual Impact of Āmīn"
            },
            "content": {
              "urdu": [
                "آمین دراصل صراطِ مستقیم پر چلنے اور گمراہی سے بچنے کی سورۃ فاتحہ میں کی گئی دعا کی تکمیل ہے۔",
                "اس کے ذریعے نمازی اللہ سے یہ عہد کرتا ہے کہ وہ خود کو گمراہ ہونے والوں کے راستے سے دور رکھے گا۔",
                "یہ اجتماعی دعا نہ صرف مغفرت کا ذریعہ ہے بلکہ ایمان کی مضبوطی کا سبب بھی ہے۔"
              ],
              "english": [
                "Āmīn completes the supplication in Surah Al-Fātiḥah for remaining on the Straight Path and avoiding deviation.",
                "Through it, the worshipper pledges to Allah to keep themselves away from the path of those who are astray.",
                "This collective supplication is not only a source of forgiveness but also strengthens faith."
              ]
            }
          }
        ]
      }
    }
  ]
}
