{
  "hadithId": 1283,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bukhari:6044", "muslim:64"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6044)، ومسلم (64)، والترمذي (2635)، والنسائي (4108)، وابن ماجه (3939).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (6044) اور امام مسلم (64) نے اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (6044) and Muslim (64). It is also found in Tirmidhi, Nasa'i, and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "سِبَابُ",
      "english": "Abusing / Insulting",
      "urdu": "گالی دینا / برا بھلا کہنا"
    },
    {
      "arabic": "الْمُسْلِمِ",
      "english": "The Muslim",
      "urdu": "مسلمان"
    },
    {
      "arabic": "فُسُوقٌ",
      "english": "Sinfulness / Wickedness",
      "urdu": "نافرمانی / گناہ"
    },
    {
      "arabic": "قِتَالُهُ",
      "english": "Fighting / Killing him",
      "urdu": "اسے قتل کرنا / لڑنا"
    },
    {
      "arabic": "كُفْرٌ",
      "english": "Disbelief (Minor)",
      "urdu": "کفر"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ایک مسلمان کی حرمت کو واضح کرتی ہے کہ اس کی تذلیل کرنا گناہ ہے اور اس کی جان لینا کفر کے مشابہ سنگین جرم ہے۔",
    "english": "This Hadith emphasizes the sanctity of a Muslim, declaring that insulting him is a sin and killing him is a grave act resembling disbelief."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6044)",
      "english": "Sahih al-Bukhari (6044)"
    },
    {
      "arabic": "صحيح مسلم (64)",
      "english": "Sahih Muslim (64)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود الهذلي",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9NOnXh6g5U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسلمان کی حرمت",
        "english": "The Sanctity of a Muslim"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزت و احترام",
              "english": "Honor and Respect"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کا دوسرے مسلمان پر حق ہے کہ وہ اسے عزت دے۔",
                "گالی دینا یا تذلیل کرنا اسلامی اخلاق کے مکمل خلاف ہے۔",
                "زبان کی درازی معاشرتی بگاڑ اور نفرت کا باعث بنتی ہے۔"
              ],
              "english": [
                "A Muslim has a right to be respected by his fellow Muslim brothers.",
                "Insulting or belittling others is completely against Islamic ethics.",
                "Abusive language leads to social corruption and widespread hatred."
              ]
            }
          },
          {
            "title": {
              "urdu": "فسق کی حقیقت",
              "english": "The Reality of Fusuq"
            },
            "content": {
              "urdu": [
                "فسق کا مطلب اللہ کی اطاعت کے دائرے سے باہر نکلنا ہے۔",
                "گالی دینے والے کو فاسق کہا جاتا ہے جو کہ بڑی برائی ہے۔",
                "یہ عمل انسان کے تقویٰ اور ایمان کے نور کو ختم کر دیتا ہے۔"
              ],
              "english": [
                "Fusuq means stepping out of the boundary of Allah's obedience.",
                "One who abuses others is termed a Fasiq, which is a major evil.",
                "This action diminishes a person's piety and the light of their faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قتلِ ناحق کی سنگینی",
        "english": "Severity of Unlawful Killing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفر سے تشبیہ",
              "english": "Comparison to Disbelief"
            },
            "content": {
              "urdu": [
                "مسلمان کو قتل کرنا اتنا بڑا گناہ ہے کہ اسے کفر کہا گیا۔",
                "یہاں کفر سے مراد 'کفرِ اصغر' ہے جو اسلام سے خارج نہیں کرتا۔",
                "مگر یہ ظاہر کرتا ہے کہ یہ عمل کافروں کے طور طریقوں جیسا ہے۔"
              ],
              "english": [
                "Killing a Muslim is such a grave sin that it is labeled as Kufr.",
                "Here, Kufr refers to 'Minor Disbelief' which doesn't expel one from Islam.",
                "However, it shows that such an action mimics the ways of non-believers."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی جان کی قدر",
              "english": "Value of Human Life"
            },
            "content": {
              "urdu": [
                "اسلام میں ایک بے گناہ کا قتل پوری انسانیت کا قتل ہے۔",
                "قیامت کے دن سب سے پہلے خون کے مقدمات کا فیصلہ ہوگا۔",
                "مسلمان کا خون، مال اور عزت سب دوسرے پر حرام ہیں۔"
              ],
              "english": [
                "In Islam, killing one innocent person is like killing all of humanity.",
                "On Judgment Day, the first cases to be settled will be related to blood.",
                "A Muslim's blood, property, and honor are sacred and forbidden to others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Social Implications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی تعلقات",
              "english": "Mutual Relationships"
            },
            "content": {
              "urdu": [
                "گالی گلوچ سے بھائی چارے کی فضا مکدر ہو جاتی ہے۔",
                "زبان کے زخم اکثر جسمانی زخموں سے زیادہ گہرے ہوتے ہیں۔",
                "اسلامی معاشرہ محبت اور خیر خواہی کی بنیاد پر قائم ہوتا ہے۔"
              ],
              "english": [
                "Abusive language pollutes the environment of brotherhood.",
                "Wounds caused by the tongue are often deeper than physical ones.",
                "An Islamic society is built on the foundations of love and sincerity."
              ]
            }
          },
          {
            "title": {
              "urdu": "امن و امان",
              "english": "Peace and Security"
            },
            "content": {
              "urdu": [
                "زبان پر قابو نہ رکھنے سے لڑائی جھگڑے اور قتل و غارت جنم لیتی ہے۔",
                "معاشرتی امن کے لیے دوسروں کی جان و عزت کا احترام ضروری ہے۔",
                "قانونِ الٰہی کی پاسداری ہی فتنہ و فساد کا واحد حل ہے۔"
              ],
              "english": [
                "Failing to control the tongue leads to fights and bloodshed.",
                "Respecting the life and honor of others is vital for social peace.",
                "Adhering to Divine laws is the only solution to chaos and strife."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت",
        "english": "Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کا کنٹرول",
              "english": "Control of the Tongue"
            },
            "content": {
              "urdu": [
                "غصے کی حالت میں خاموشی اختیار کرنا نفاق اور فسق سے بچاتا ہے۔",
                "ہمیشہ ایسی بات کہیں جو دوسروں کے لیے خیر کا باعث ہو۔",
                "اپنے مسلمان بھائی کے لیے نرم رویہ اختیار کرنا سنت ہے۔"
              ],
              "english": [
                "Remaining silent during anger saves one from hypocrisy and sin.",
                "Always speak words that are a source of goodness for others.",
                "Adopting a gentle attitude toward fellow Muslims is a Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور اصلاح",
              "english": "Repentance and Reform"
            },
            "content": {
              "urdu": [
                "اگر کسی کی دل آزاری ہوئی ہو تو اس سے معافی مانگنا ضروری ہے۔",
                "حقوق العباد کی تلافی کے بغیر توبہ مکمل نہیں ہوتی۔",
                "معاشرے میں مثبت اور شائستہ گفتگو کے کلچر کو فروغ دیں۔"
              ],
              "english": [
                "If someone's feelings are hurt, it is necessary to ask for forgiveness.",
                "Repentance is incomplete without making amends for human rights.",
                "Promote a culture of positive and polite conversation in society."
              ]
            }
          }
        ]
      }
    }
  ]
}