{
  "hadithId": 685,
  "hadithNo": 38,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh:685"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3508)، والنسائي (7/254)، والترمذي (1285) وقال: حسن صحيح غريب، وابن ماجه (2442)، وأحمد (6/49)، وابن حبان (4914).",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابوداؤد، نسائی، ترمذی، ابن ماجہ اور احمد نے روایت کیا ہے۔ امام ترمذی، ابن خزیمہ اور حاکم نے اسے صحیح قرار دیا ہے جبکہ امام بخاری نے اسے ضعیف کہا، مگر اس کے متابعات اور شواہد اسے تقویت دیتے ہیں۔",
    "english": "Hasan (Good). Reported by Abu Dawud (3508), An-Nasa'i (7/254), At-Tirmidhi (1285), Ibn Majah (2442), and Ahmad. Authenticated by At-Tirmidhi, Ibn Hibban, and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "الْخَرَاجُ",
      "english": "Profit / Yield",
      "urdu": "آمدنی / نفع"
    },
    {
      "arabic": "الضَّمَانِ",
      "english": "Responsibility / Liability",
      "urdu": "ضمانت / نقصان کی ذمہ داری"
    },
    {
      "arabic": "بِالضَّمَانِ",
      "english": "In exchange for liability",
      "urdu": "ذمہ داری کے بدلے"
    },
    {
      "arabic": "مَظْلِمَةٍ",
      "english": "Injustice",
      "urdu": "ظلم / حق تلفی"
    },
    {
      "arabic": "الْقَطَّانِ",
      "english": "Al-Qattan (Scholar)",
      "urdu": "ابن القطان (محدث)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اسلامی معاشیات کا ایک عظیم قاعدہ بیان کرتی ہے کہ کسی بھی چیز کا نفع اس شخص کا حق ہے جو اس کے نقصان کا رسک (Risk) اٹھانے والا ہو۔",
    "english": "This Hadith establishes a major Islamic legal maxim: profit is tied to liability; he who bears the risk of loss is entitled to the gains."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3508)",
      "english": "Reported by Abu Dawud (3508)"
    },
    {
      "arabic": "رواه الترمذي (1285)",
      "english": "Reported by At-Tirmidhi (1285)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا بنیادی مفہوم",
        "english": "Core Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفع اور نقصان کا تعلق",
              "english": "Relation Between Profit and Loss"
            },
            "content": {
              "urdu": [
                "جس شخص کی ملکیت میں کوئی چیز ہو اور وہ اس کی ہلاکت کی ذمہ داری اٹھائے، نفع بھی اسی کا ہے۔",
                "مثال کے طور پر اگر کسی نے جانور خریدا اور وہ مر گیا تو نقصان خریدار کا ہوگا، لہذا اس کا دودھ بھی اسی کا ہے۔",
                "یہ اصول تجارت میں عدل و انصاف کو یقینی بناتا ہے تاکہ کوئی بغیر ذمہ داری کے فائدہ نہ اٹھائے۔"
              ],
              "english": [
                "Whoever owns an item and bears the responsibility for its loss is entitled to its yield.",
                "For example, if one buys an animal and it dies, the loss is the buyer's, so the milk is also theirs.",
                "This principle ensures justice in trade so that no one gains benefit without assuming risk."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی قاعدہ: الغنم بالغرم",
              "english": "Legal Maxim: Gain is with Pain"
            },
            "content": {
              "urdu": [
                "فقہاء نے اس حدیث سے یہ اصول نکالا ہے کہ 'الغنَم بالغرْم' یعنی نفع نقصان کے ساتھ ہے۔",
                "کوئی بھی ایسی کمائی جائز نہیں جس میں انسان کسی قسم کا مالی رسک نہ اٹھا رہا ہو۔",
                "یہ اصول سودی کاروبار کی جڑ کاٹتا ہے جہاں نفع یقینی اور نقصان کا رسک نہیں ہوتا۔"
              ],
              "english": [
                "Jurists derived the maxim 'Al-Ghunmu bil-Ghurm', meaning gain is tied to the risk of loss.",
                "Any earning where the person does not bear a financial risk is generally considered unlawful.",
                "This principle undermines usurious dealings where profit is guaranteed without sharing risk."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تجارتی اور قانونی فوائد",
        "english": "Commercial and Legal Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عیب کی صورت میں واپسی",
              "english": "Return Due to Defect"
            },
            "content": {
              "urdu": [
                "اگر خریدار چیز استعمال کرنے کے بعد عیب کی بنا پر واپس کرے تو وہ اس کا نفع نہیں لوٹائے گا۔",
                "مثلاً مکان کرایے پر دینے کے بعد معلوم ہو کہ اس میں عیب ہے، تو پچھلا کرایہ مالک کا ہی رہے گا۔",
                "کیونکہ اگر وہ چیز خریدار کے پاس ہلاک ہوتی تو نقصان خریدار کا ہی ہونا تھا۔"
              ],
              "english": [
                "If a buyer returns an item due to a defect after using it, they need not return the profit used.",
                "If a house is rented and then a defect appears, the previous rent belongs to the temporary owner.",
                "Because had the item been destroyed while in the buyer's possession, the loss would be theirs."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشی شفافیت",
              "english": "Economic Transparency"
            },
            "content": {
              "urdu": [
                "یہ حدیث سرمایہ کاری (Investment) کے صحیح اسلامی طریقوں کی بنیاد فراہم کرتی ہے۔",
                "مضاربہ اور مشارکہ میں نفع کی تقسیم اسی ضمانت اور رسک کی بنیاد پر ہوتی ہے۔",
                "یہ بازار میں غرر (دھوکے) اور بلاوجہ نفع خوری کے رجحان کو ختم کرتی ہے۔"
              ],
              "english": [
                "This Hadith provides the foundation for correct Islamic investment methods.",
                "In Mudarabah and Musharakah, profit distribution is based on this guarantee and risk.",
                "It eliminates uncertainty (Gharar) and the trend of groundless profiteering in the market."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محدثین کی فنی تحقیق",
        "english": "Technical Analysis by Scholars"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی صحت",
              "english": "Authenticity of the Chain"
            },
            "content": {
              "urdu": [
                "اگرچہ امام بخاری نے اس کی سند پر جرح کی ہے، مگر کثرتِ طرق نے اسے قوی کر دیا ہے۔",
                "بہت سے ائمہ نے اسے 'تلقی بالقبول' (امت میں مقبول) ہونے کی وجہ سے صحیح مانا ہے۔",
                "اس حدیث کے الفاظ نہایت مختصر مگر معانی کے لحاظ سے نہایت جامع اور بصیرت افروز ہیں۔"
              ],
              "english": [
                "Although Imam Bukhari criticized its chain, the multiplicity of routes has strengthened it.",
                "Many Imams accepted it as Sahih due to its widespread acceptance among the Ummah.",
                "The words of this Hadith are brief but extremely comprehensive and insightful in meaning."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب کا اتفاق",
              "english": "Consensus of Juristic Schools"
            },
            "content": {
              "urdu": [
                "تمام چاروں بڑے فقہی مذاہب اس حدیث کو ایک بنیادی قانونی قاعدے کے طور پر تسلیم کرتے ہیں۔",
                "یہ ان احادیث میں سے ہے جن پر اسلامی قانون کی بڑی عمارت کھڑی ہے۔",
                "اس کا اطلاق کرایہ داری، بیع، اور شراکت داری کے تمام معاملات پر ہوتا ہے۔"
              ],
              "english": [
                "All four major schools of jurisprudence accept this Hadith as a primary legal maxim.",
                "It is among the Hadiths upon which a vast structure of Islamic law is built.",
                "It applies to all matters of tenancy, sales, and business partnerships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور عملی اسباق",
        "english": "Ethical and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذمہ داری کا احساس",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "نفع کمانے کے لیے انسان کو اپنی ذمہ داریوں کو بھی پہچاننا چاہیے۔",
                "بغیر محنت اور بغیر رسک کے مال جمع کرنا اسلامی مزاج کے خلاف ہے۔",
                "یہ حدیث ہمیں معاشرے میں ایک فعال اور ذمہ دار معاشی رکن بننے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "To earn profit, a person must also recognize and fulfill their responsibilities.",
                "Accumulating wealth without effort or risk is contrary to the Islamic spirit.",
                "This Hadith encourages us to be active and responsible economic members of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزقِ حلال کی پہچان",
              "english": "Identifying Lawful Income"
            },
            "content": {
              "urdu": [
                "وہی مال حلال ہے جس کے بدلے میں آپ نے کوئی خدمت دی ہو یا نقصان کا خطرہ مول لیا ہو۔",
                "سٹہ بازی اور جوا اسی لیے حرام ہیں کہ ان میں حقیقی ضمانت اور کام نہیں ہوتا۔",
                "اتباعِ سنت میں ہی معاشی برکت اور معاشرتی امن پوشیدہ ہے۔"
              ],
              "english": [
                "Halal wealth is that gained in exchange for service provided or risk assumed.",
                "Speculation and gambling are prohibited because they lack real liability and productivity.",
                "Economic blessing and social peace are hidden in following the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}