{
  "hadithId": 1286,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["muslim:1828", "bulugh:1486"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الإمارة",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1828)، وأحمد (24458)، وابن حبان (553).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح (1828) میں روایت کیا ہے۔ اس حدیث کے مکمل متن میں یہ دعا بھی شامل ہے: 'اور جو میری امت کے کسی معاملے کا والی بنے اور ان کے ساتھ نرمی کرے، تو تو بھی اس کے ساتھ نرمی فرما'۔",
    "english": "Sahih (Authentic). Reported by Muslim (1828) and Ahmad (24458). The complete narration includes the Prophetic supplication: '...and whoever is given charge of my Ummah and is kind to them, be You kind to him.'"
  },
  "importantWords": [
    {
      "arabic": "وَلِيَ",
      "english": "Was put in charge",
      "urdu": "والی بنا / سربراہ بنا"
    },
    {
      "arabic": "شَيْئًا",
      "english": "Anything / smallest matter",
      "urdu": "کوئی بھی چیز / ذرا سی بات"
    },
    {
      "arabic": "فَشَقَّ",
      "english": "Caused hardship / was harsh",
      "urdu": "مشقت میں ڈالا / سختی کی"
    },
    {
      "arabic": "فَاشْقُقْ",
      "english": "Be harsh",
      "urdu": "تو بھی سختی فرما"
    },
    {
      "arabic": "رِفْق",
      "english": "Kindness / Gentleness",
      "urdu": "نرمی / مہربانی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں حکمرانوں اور ذمہ داروں کو ڈرایا گیا ہے کہ اگر وہ عوام کے لیے مشکلات پیدا کریں گے تو وہ اللہ کی سخت پکڑ اور بد دعا کے مستحق ٹھہریں گے۔",
    "english": "This Hadith warns leaders and officials that causing unnecessary hardship for the people will result in divine severity and the Prophet's (ﷺ) supplication against them."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1828)",
      "english": "Sahih Muslim (1828)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T-X3_qQ8U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ذمہ داری کا بوجھ",
        "english": "The Burden of Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عوامی معاملات کی اہمیت",
              "english": "Importance of Public Affairs"
            },
            "content": {
              "urdu": [
                "عوامی عہدہ محض طاقت نہیں بلکہ اللہ کے ہاں ایک بہت بڑی آزمائش ہے۔",
                "لفظ 'شیئًا' ظاہر کرتا ہے کہ چاہے وہ چھوٹی سی ذمہ داری ہو، حساب برابر ہوگا۔",
                "امت کے معاملات میں کوتاہی براہِ راست اللہ کے غصے کو دعوت دینا ہے۔"
              ],
              "english": [
                "A public office is not mere power but a significant trial before Allah.",
                "The word 'shay'an' implies that even small responsibilities carry full accountability.",
                "Negligence in the affairs of the Ummah directly invites the wrath of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "سختی کی ممانعت",
              "english": "Prohibition of Harshness"
            },
            "content": {
              "urdu": [
                "ناجائز پابندیاں لگانا اور عوام کے لیے رکاوٹیں کھڑی کرنا 'شق' یعنی سختی ہے۔",
                "اختیارات کا غلط استعمال کر کے لوگوں کو تنگ کرنا سنگین گناہ ہے۔",
                "نبی ﷺ نے ایسے حاکم کے لیے سختی کی بد دعا فرمائی ہے۔"
              ],
              "english": [
                "Imposing unjust restrictions and creating hurdles for the public is 'Shaqq' (hardship).",
                "Misusing authority to trouble people is a grave and serious sin.",
                "The Prophet (ﷺ) supplicated for divine severity against such harsh rulers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مکافاتِ عمل کا اصول",
        "english": "Principle of Retribution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جیسا کرو گے ویسا بھرو گے",
              "english": "As You Sow, So Shall You Reap"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ ظالم حاکم کے ساتھ وہی معاملہ کرتا ہے جو وہ اپنی رعیت سے کرتا ہے۔",
                "اگر حاکم لوگوں پر بوجھ ڈالے گا تو اللہ اس کی زندگی مشکل کر دے گا۔",
                "دنیا میں سختی کرنے والے کے لیے آخرت کا عذاب بھی بہت سخت ہوگا۔"
              ],
              "english": [
                "Allah treats an oppressive ruler in the same manner he treats his subjects.",
                "If a ruler burdens the people, Allah will make his own life difficult.",
                "For those who are harsh in this world, the punishment of the Hereafter will be severe."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبولیتِ دعا",
              "english": "Acceptance of Supplication"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی یہ دعا ہر اس شخص کے حق میں ہے جو امت کا والی بنا۔",
                "رسول اللہ ﷺ کی دعا کبھی رد نہیں ہوتی، اس لیے یہ ایک مستقل وارننگ ہے۔",
                "حکمرانوں کو چاہیے کہ وہ اس بد دعا سے بچنے کے لیے آسانیاں پیدا کریں۔"
              ],
              "english": [
                "This supplication of the Prophet (ﷺ) applies to everyone in charge of the Ummah.",
                "The Prophet's (ﷺ) prayer is never rejected, making this a permanent warning.",
                "Rulers must create ease for people to avoid the impact of this supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نرمی کی فضیلت",
        "english": "Virtue of Gentleness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسانی پیدا کرنا",
              "english": "Creating Ease"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے نرمی کرنے والے حاکم کے لیے اللہ کی رحمت کی دعا فرمائی ہے۔",
                "عوام کے جائز کاموں میں سہولت پیدا کرنا بہترین صدقہ اور عبادت ہے۔",
                "نرمی اور رفق سے معاشرے میں محبت اور امن و سکون پیدا ہوتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) prayed for Allah's mercy for those who are gentle rulers.",
                "Facilitating the legitimate needs of the public is a great charity and worship.",
                "Kindness and gentleness foster love, peace, and tranquility in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "مثالی حکمرانی",
              "english": "Ideal Governance"
            },
            "content": {
              "urdu": [
                "خلفائے راشدین نے ہمیشہ نرمی اور عدل کو اپنا شعار بنایا۔",
                "حاکم کو چاہیے کہ وہ عوام کا خادم بن کر ان کی مشکلات دور کرے۔",
                "حقیقی لیڈر وہی ہے جو اپنے اختیارات کو عوامی بھلائی کے لیے استعمال کرے۔"
              ],
              "english": [
                "The Rightly Guided Caliphs always adopted kindness and justice as their way.",
                "A ruler should serve the people as a servant to alleviate their hardships.",
                "A true leader uses their authority solely for the benefit of the public."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lessons and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذاتی محاسبہ",
              "english": "Personal Accountability"
            },
            "content": {
              "urdu": [
                "ہر وہ شخص جو تھوڑے سے لوگوں کا بھی ذمہ دار ہے، اس پر یہ حدیث لاگو ہوتی ہے۔",
                "افسران کو چاہیے کہ وہ ماتحتوں کے ساتھ غیر ضروری سختی سے گریز کریں۔",
                "ہمارے فیصلے لوگوں کی زندگیوں میں آسانی لانے والے ہونے چاہئیں۔"
              ],
              "english": [
                "This Hadith applies to everyone responsible for even a few people.",
                "Officials should avoid unnecessary harshness toward their subordinates.",
                "Our decisions should always aim to bring ease into the lives of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کا خوف",
              "english": "Fear of the Hereafter"
            },
            "content": {
              "urdu": [
                "کرسی اور طاقت عارضی ہے، جبکہ اللہ کی پکڑ دائمی ہے۔",
                "عوام کی بد دعا اور نبی ﷺ کی وعید سے ڈرنا ایمان کا تقاضا ہے۔",
                "کامیاب وہی ہے جو اپنی ذمہ داریوں کو اللہ کے ڈر کے ساتھ پورا کرے۔"
              ],
              "english": [
                "Power and position are temporary, but Allah's seizure is eternal.",
                "Fearing the public's cries and the Prophet's (ﷺ) warning is a requirement of faith.",
                "Success belongs to those who fulfill their duties with the fear of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}