{
  "hadithId": 637,
  "hadithNo": 31,
  "hadithReferences": {
    "sunnah.com": ["bulugh/637"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1741)، ومسلم (1679). وتكملة الحديث عندهما: «فإن دماءكم وأموالكم عليكم حرام كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا».",
    "urdu": "صحیح۔ اسے امام بخاری (1741) اور امام مسلم (1679) نے روایت کیا ہے۔ اس خطبے میں آپ ﷺ نے مسلمانوں کے خون، مال اور عزت کو ایک دوسرے پر اسی طرح حرام قرار دیا جیسے مکہ، ذوالحجہ کا مہینہ اور یومِ نحر محترم ہیں۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1741) and Muslim (1679). The full text includes: \"Your blood and your property are as sacred as this day of yours, in this month of yours, in this city of yours.\""
  },
  "importantWords": [
    {
      "arabic": "خَطَبَنَا",
      "english": "Addressed us / Gave a sermon",
      "urdu": "ہمیں خطبہ دیا"
    },
    {
      "arabic": "يَوْمَ اَلنَّحْرِ",
      "english": "Day of Sacrifice (10th Dhul-Hijjah)",
      "urdu": "قربانی کا دن"
    },
    {
      "arabic": "حَرَامٌ",
      "english": "Sacred / Forbidden",
      "urdu": "محترم / حرام"
    },
    {
      "arabic": "دِمَاءَكُمْ",
      "english": "Your blood (lives)",
      "urdu": "تمہارے خون (جانیں)"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے حجۃ الوداع کے موقع پر انسانی جان، مال اور آبرو کی حرمت کو مکہ اور حج کے مقدس ایام کے برابر قرار دے کر عالمی انسانی حقوق کا منشور عطا فرمایا۔",
    "english": "During the Farewell Hajj, the Prophet (ﷺ) declared human life, property, and honor as sacred as the city of Makkah and the holy days of Hajj, establishing a charter for human rights."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1741)",
      "english": "Reported by Al-Bukhari (1741)"
    },
    {
      "arabic": "رواه مسلم (1679)",
      "english": "Reported by Muslim (1679)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكرة الثقفي",
        "english": "Abu Bakra ath-Thaqafi"
      },
      "slug": "abu-bakra-ath-thaqafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انسانی جان و مال کی حرمت",
        "english": "Sanctity of Human Life and Property"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلام کا عالمی منشور",
              "english": "Islam's Universal Charter"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے حج کے سب سے بڑے اجتماع میں مسلمانوں کو ایک دوسرے کی جان و مال کے تحفظ کی سخت تاکید فرمائی۔",
                "کسی مسلمان کا خون بہانا، اس کا مال چھیننا یا اس کی عزت پر حملہ کرنا اللہ کے نزدیک سخت ترین گناہ ہے۔",
                "آپ ﷺ نے اس حرمت کو مکہ مکرمہ اور ذوالحجہ کے مہینے جیسی تقدس والی چیزوں سے تشبیہ دی۔"
              ],
              "english": [
                "At the largest gathering of Hajj, the Prophet (ﷺ) strictly emphasized the protection of each other's lives and property.",
                "Shedding a Muslim's blood, seizing their property, or attacking their honor is among the gravest sins.",
                "He likened this sanctity to the holiness of Makkah and the month of Dhul-Hijjah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جاہلیت کے اثرات کا خاتمہ",
              "english": "Eradicating Jahiliyyah Influences"
            },
            "content": {
              "urdu": [
                "زمانہ جاہلیت میں لوگ معمولی باتوں پر قتل و غارت اور لوٹ مار کرتے تھے، اسلام نے اسے جڑ سے ختم کر دیا۔",
                "نبی ﷺ نے واضح فرمایا کہ اب تم سب بھائی بھائی ہو اور کسی کو دوسرے پر ظلم کا حق نہیں۔",
                "خون کے بدلے (انتقام) کے قدیم رواج کو ختم کر کے عدل و انصاف کا نظام قائم کیا گیا۔"
              ],
              "english": [
                "In the pre-Islamic era, people killed and looted over minor disputes; Islam abolished this culture entirely.",
                "The Prophet (ﷺ) clarified that all are brothers and no one has the right to oppress another.",
                "Ancient customs of blood feuds were replaced by a system of justice and rule of law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تبلیغِ دین کی ذمہ داری",
        "english": "Responsibility of Spreading the Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاضر غائب کو پہنچا دے",
              "english": "Let the Present Inform the Absent"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے حکم دیا کہ جو لوگ یہاں موجود ہیں وہ اس پیغام کو ان تک پہنچائیں جو موجود نہیں ہیں۔",
                "اس سے دعوت و تبلیغ کی اہمیت ثابت ہوتی ہے کہ دین کی بات سیکھ کر دوسروں تک پہنچانا ہر مسلمان کا فرض ہے۔",
                "بسا اوقات بعد میں سننے والا براہِ راست سننے والے سے زیادہ بات کو سمجھنے اور محفوظ رکھنے والا ہوتا ہے۔"
              ],
              "english": [
                "He (ﷺ) commanded those present to convey the message to those who were absent.",
                "This proves the importance of Da'wah; conveying religious knowledge is a duty upon every Muslim.",
                "Often, the one who receives the information later may understand or preserve it better than the direct hearer."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحادِ امت کی فکر",
              "english": "Concern for Ummah's Unity"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے خبردار کیا کہ میرے بعد ایک دوسرے کی گردنیں مار کر دوبارہ کافروں جیسے نہ بن جانا۔",
                "مسلمانوں کی آپسی لڑائی دین کی بنیادوں کو کمزور کر دیتی ہے۔",
                "اتحاد اور بھائی چارہ ہی وہ طاقت ہے جس سے اسلام کا بول بالا ہوتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) warned: \"Do not return to being like disbelievers after me, striking each other's necks.\"",
                "Internal conflicts among Muslims weaken the very foundations of the faith.",
                "Unity and brotherhood are the strengths through which Islam prevails."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منیٰ میں خطبہ اور اس کی اہمیت",
        "english": "The Sermon at Mina and Its Significance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعلیمی اسلوب",
              "english": "Educational Methodology"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے پہلے لوگوں سے دن، مہینے اور شہر کے بارے میں پوچھا حالانکہ سب جانتے تھے۔",
                "یہ سوالات لوگوں کی توجہ اپنی طرف مبذول کرانے اور کلام کی اہمیت جتانے کے لیے تھے۔",
                "استفہامیہ انداز (سوال و جواب) بات کو ذہن نشین کرانے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) first asked about the day, month, and city, even though everyone knew the answers.",
                "These questions were to capture attention and emphasize the gravity of the forthcoming statement.",
                "The interrogative style (Q&A) is an effective means of ensuring the message sticks in the mind."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایامِ حج میں رہنمائی",
              "english": "Guidance During Hajj Days"
            },
            "content": {
              "urdu": [
                "حج کے دوران مختلف مقامات (عرفات، منیٰ) پر خطبہ دینا سنت ہے تاکہ حجاج کو مناسک اور احکام کی یاد دہانی ہوتی رہے۔",
                "قربانی کے دن کا خطبہ حجاج کو ان کی سماجی اور اخلاقی ذمہ داریوں کا احساس دلاتا ہے۔",
                "حج صرف ظاہری افعال کا نام نہیں بلکہ یہ کردار کی تبدیلی کا ایک تربیتی کورس ہے۔"
              ],
              "english": [
                "Giving sermons at different Hajj sites (Arafat, Mina) is Sunnah to remind pilgrims of rituals and rulings.",
                "The sermon on the Day of Sacrifice reminds pilgrims of their social and ethical responsibilities.",
                "Hajj is not just outward rituals; it is a transformative course for character development."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک دوسرے کا احترام",
              "english": "Mutual Respect"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو چاہیے کہ وہ دوسرے کے مال کو اپنی جان کی طرح عزیز سمجھے اور اسے ناحق ضائع نہ کرے۔",
                "کسی کی عزت اچھالنا یا غیبت کرنا اس کی حرمت پامال کرنے کے مترادف ہے۔",
                "معاشرے میں امن تبھی قائم ہو سکتا ہے جب سب ایک دوسرے کے حقوق کا تحفظ کریں۔"
              ],
              "english": [
                "Every Muslim should cherish another's property like their own life and not waste it unjustly.",
                "Tarnishing someone's honor or backbiting is equivalent to violating their sacred sanctity.",
                "Peace in society is only possible when everyone protects the rights of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمہ داری کا احساس",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے گواہی طلب کی کہ 'کیا میں نے پہنچا دیا؟' اور لوگوں نے اثبات میں جواب دیا۔",
                "ہمیں بھی قیامت کے دن اپنے فرائض کی ادائیگی کے بارے میں جوابدہ ہونا پڑے گا۔",
                "حق بات کہنے اور اسے پھیلانے میں کبھی ہچکچاہٹ محسوس نہیں کرنی چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) sought testimony: \"Have I conveyed the message?\" and the people affirmed it.",
                "We too will be held accountable for our duties on the Day of Resurrection.",
                "One should never hesitate in speaking the truth and spreading it."
              ]
            }
          }
        ]
      }
    }
  ]
}