{
  "hadithId": 1115,
  "hadithNo": 36,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/36"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (2704)، وابن الجارود (1072)، والحاكم (2/126) وصححه ووافقه الذهبي.",
    "urdu": "صحیح۔ اسے ابو داؤد (2704)، ابن الجارود (1072) اور حاکم (2/126) نے روایت کیا ہے اور اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (2704), Ibn al-Jarud (1072), and Al-Hakim (2/126) who authenticated it, and Az-Zahabi concurred."
  },
  "importantWords": [
    {
      "arabic": "أَصَبْنَا",
      "english": "We obtained",
      "urdu": "ہمیں حاصل ہوا"
    },
    {
      "arabic": "طَعَاماً",
      "english": "Food",
      "urdu": "کھانا / غذا"
    },
    {
      "arabic": "يَوْمَ خَيْبَرَ",
      "english": "Day of Khaibar",
      "urdu": "خیبر کا دن"
    },
    {
      "arabic": "مِقْدَارَ",
      "english": "Amount / Quantity",
      "urdu": "مقدار / حصہ"
    },
    {
      "arabic": "يَكْفِيهِ",
      "english": "Sufficient for him",
      "urdu": "اس کے لیے کافی ہو"
    },
    {
      "arabic": "يَنْصَرِفُ",
      "english": "He leaves",
      "urdu": "وہ چلا جاتا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ میدانِ جنگ میں مالِ غنیمت کی باقاعدہ تقسیم سے پہلے مجاہدین اپنی فوری ضرورت اور بھوک مٹانے کے لیے کھانے پینے کی اشیاء استعمال کر سکتے ہیں۔",
    "english": "This Hadith proves that it is permissible for soldiers to consume food from the war booty before its formal distribution to satisfy their immediate hunger and needs."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2704)",
      "english": "Reported by Abu Dawud (2704)"
    },
    {
      "arabic": "رواه الحاكم (2/126)",
      "english": "Reported by Al-Hakim (2/126)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن أبي أوفى",
        "english": "Abdullah bin Abi Awfa"
      },
      "slug": "abdullah-bin-abi-awfa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غنیمت میں کھانے کا حکم",
        "english": "Ruling on Food in War Booty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فوری ضرورت کی اجازت",
              "english": "Permission for Immediate Needs"
            },
            "content": {
              "urdu": [
                "میدانِ جنگ میں مجاہدین کو بھوک مٹانے کے لیے کھانے کی فوری ضرورت پیش آتی ہے۔",
                "اسلامی فقہ کے مطابق غنیمت کا کھانا تقسیم سے پہلے کھانا خیانت میں شمار نہیں ہوتا۔",
                "نبی ﷺ نے صحابہ کو اجازت دے رکھی تھی کہ وہ ضرورت بھر کھانا وہاں سے لے لیں۔"
              ],
              "english": [
                "Soldiers in the battlefield often face an urgent need for food to sustain themselves.",
                "According to Islamic Fiqh, eating food from the booty before distribution is not embezzlement.",
                "The Prophet (ﷺ) allowed companions to take as much food as was necessary for their survival."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقسیم سے پہلے کا استثناء",
              "english": "Exception Before Distribution"
            },
            "content": {
              "urdu": [
                "عام طور پر مالِ غنیمت میں تقسیم سے پہلے ہاتھ ڈالنا 'غلول' (خیانت) کہلاتا ہے۔",
                "مگر کھانے پینے کی اشیاء اور چارہ اس سخت حکم سے مستثنیٰ قرار دیے گئے ہیں۔",
                "یہ رعایت انسانی ضرورت اور جنگی حالات کی نزاکت کو مدنظر رکھتے ہوئے دی گئی۔"
              ],
              "english": [
                "Generally, taking anything from the booty before distribution is considered 'Ghulul'.",
                "However, food items and animal fodder are exceptions to this strict ruling.",
                "This concession was granted considering human necessity and the sensitivity of war."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حدود و قیود",
        "english": "Juristic Boundaries and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صرف بقدرِ ضرورت",
              "english": "Only According to Need"
            },
            "content": {
              "urdu": [
                "اجازت صرف اتنی مقدار کی ہے جو اس وقت بھوک مٹانے کے لیے کافی ہو۔",
                "کھانے کو ذخیرہ کرنا یا تجارتی مقصد کے لیے لے جانا ہرگز جائز نہیں ہے۔",
                "مجاہد کو چاہیے کہ وہ تقویٰ کا مظاہرہ کرے اور حد سے تجاوز نہ کرے۔"
              ],
              "english": [
                "The permission is limited to the amount sufficient to satisfy immediate hunger.",
                "Storing the food for later or taking it for commercial purposes is not allowed.",
                "A warrior must demonstrate piety and ensure he does not exceed his genuine need."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر اشیاء کا حکم",
              "english": "Ruling on Other Items"
            },
            "content": {
              "urdu": [
                "کپڑے، ہتھیار اور سونا چاندی تقسیم سے پہلے لینا سخت حرام اور گناہ ہے۔",
                "کھانے کے علاوہ دیگر اموال کو باقاعدہ بیت المال میں جمع کرانا لازمی ہے۔",
                "یہ فرق واضح کرتا ہے کہ اسلام انسانی جان کو مادی اموال پر فوقیت دیتا ہے۔"
              ],
              "english": [
                "Taking clothes, weapons, or precious metals before distribution is strictly forbidden.",
                "All assets other than food must be formally deposited in the public treasury.",
                "This distinction shows that Islam prioritizes human life over material assets."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غزوہ خیبر کے مشاہدات",
        "english": "Observations from the Battle of Khaibar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا طرزِ عمل",
              "english": "The Practice of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام غنیمت حاصل ہونے پر نظم و ضبط اور قناعت کا مظاہرہ کرتے تھے۔",
                "وہ کھانا حاصل کرتے وقت کسی قسم کی لوٹ مار یا افراتفری نہیں مچاتے تھے۔",
                "ہر شخص اپنی ضرورت دیکھتا اور دوسرے بھائیوں کا بھی خیال رکھتا تھا۔"
              ],
              "english": [
                "The Companions displayed immense discipline and contentment when obtaining booty.",
                "They did not engage in looting or chaos while gathering food for their needs.",
                "Every individual assessed his own need while remaining mindful of his brothers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی عسکری اخلاقیات",
              "english": "Islamic Military Ethics"
            },
            "content": {
              "urdu": [
                "اسلامی فوج کا مقصد لوٹ مار نہیں بلکہ اللہ کے کلمے کی سربلندی تھا۔",
                "جنگ کے دوران بھی اخلاقی ضابطوں کی پاسداری مسلمانوں کا خاصہ ہے۔",
                "نبی ﷺ کی تربیت نے سپاہیوں کو امانت دار اور صابر بنا دیا تھا۔"
              ],
              "english": [
                "The goal of the Islamic army was the supremacy of Allah's word, not plunder.",
                "Adhering to ethical codes even during conflict is a characteristic of Muslims.",
                "The Prophet's (ﷺ) guidance made the soldiers trustworthy and patient."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت اور حرص کا فرق",
              "english": "Difference Between Need and Greed"
            },
            "content": {
              "urdu": [
                "انسان کو اپنی ضرورت پوری کرنی چاہیے مگر لالچ سے ہمیشہ بچنا چاہیے۔",
                "دوسروں کے حق میں بلاوجہ مداخلت کرنا ایمان کی کمزوری کی علامت ہے۔",
                "حلال طریقے سے حاصل کردہ تھوڑا مال بھی برکت کا باعث بنتا ہے۔"
              ],
              "english": [
                "A person should fulfill their needs but must always avoid falling into greed.",
                "Unjustly interfering with the rights of others is a sign of weak faith.",
                "Even a small amount of wealth obtained through Halal means brings blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی نظم و ضبط",
              "english": "Social Discipline"
            },
            "content": {
              "urdu": [
                "معاشرتی وسائل کو استعمال کرتے وقت اصولوں کی پابندی ضروری ہے۔",
                "ریاستی اموال میں خورد برد سے بچنا ہر شہری کا دینی فریضہ ہے۔",
                "نبی کریم ﷺ کی سنت ہمیں ہر حال میں میانہ روی سکھاتی ہے۔"
              ],
              "english": [
                "Adhering to principles is necessary when utilizing collective social resources.",
                "Avoiding misappropriation of state assets is a religious duty for every citizen.",
                "The Sunnah of the Prophet (ﷺ) teaches us moderation in every situation."
              ]
            }
          }
        ]
      }
    }
  ]
}