{
  "hadithId": 947,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1088"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (1480). وأصل الحديث أن فاطمة بنت قيس طلقها زوجها البتة وهو غائب، فأرسل إليها وكيله بشعير، فسخطته، فقال: والله ما لك علينا من شيء، فجاءت رسول الله صلى الله عليه وسلم فذكرت ذلك له، فقال: ليس لك عليه نفقة، وأمرها أن تعتد في بيت ابن أم مكتوم.",
    "urdu": "صحیح۔ اسے امام مسلم (1480) نے روایت کیا ہے۔ اس واقعے کی اصل یہ ہے کہ فاطمہ بنت قیس کے شوہر نے انہیں آخری طلاق دے دی تھی، جب انہوں نے نفقہ کا مطالبہ کیا تو آپ ﷺ نے فیصلہ فرمایا کہ ایسی عورت کے لیے نفقہ اور رہائش واجب نہیں، کیونکہ اب رجوع کا حق ختم ہو چکا ہے۔",
    "english": "Sahih. Reported by Muslim (1480). The background is that Fatima bint Qais was divorced irrevocably by her husband while he was away. When she demanded maintenance, the Prophet (ﷺ) ruled that she had no right to maintenance or lodging since the marriage was completely terminated."
  },
  "importantWords": [
    {
      "arabic": "اَلْمُطَلَّقَةِ",
      "english": "Divorced woman",
      "urdu": "طلاق یافتہ عورت"
    },
    {
      "arabic": "ثَلَاثًا",
      "english": "Three times",
      "urdu": "تین بار"
    },
    {
      "arabic": "سُكْنَى",
      "english": "Lodging / Housing",
      "urdu": "رہائش"
    },
    {
      "arabic": "نَفَقَةٌ",
      "english": "Maintenance / Provision",
      "urdu": "خرچہ / نان و نفقہ"
    },
    {
      "arabic": "لَيْسَ لَهَا",
      "english": "There is nothing for her",
      "urdu": "اس کے لیے نہیں ہے"
    }
  ],
  "summary": {
    "urdu": "جس عورت کو تین طلاقیں (طلاقِ بائن) مل جائیں، عدت کے دوران اس کی رہائش اور خرچے کی ذمہ داری شوہر پر نہیں ہوتی، کیونکہ نکاح کا رشتہ مکمل طور پر ختم ہو چکا ہوتا ہے۔",
    "english": "A woman divorced three times (irrevocably) is not entitled to maintenance or lodging from her former husband during her Iddah, as the marital bond is entirely severed."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1480)",
      "english": "Sahih Muslim (1480)"
    },
    {
      "arabic": "سنن النسائي (3245)",
      "english": "Sunan an-Nasa'i (3245)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "فاطمة بنت قيس",
        "english": "Fatima bint Qais"
      },
      "slug": "fatima-bint-qais"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مطلقہ ثلاثہ کا شرعی حکم",
        "english": "Legal Status of the Irrevocably Divorced"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نان و نفقہ کی عدم وجوب",
              "english": "Non-Obligation of Maintenance"
            },
            "content": {
              "urdu": [
                "جس عورت کو تیسری طلاق مل جائے اس کے لیے شوہر کے ذمہ نفقہ نہیں ہے۔",
                "نفقہ اس وقت ہوتا ہے جب شوہر کو رجوع کرنے کا حق حاصل ہو۔",
                "یہ حکم فاطمہ بنت قیس کے واقعے سے واضح طور پر ثابت ہے۔"
              ],
              "english": [
                "A woman receiving her third divorce has no right to financial maintenance from her ex-husband.",
                "Maintenance is usually tied to the husband's right to revoke the divorce.",
                "This ruling is explicitly derived from the incident of Fatima bint Qais."
              ]
            }
          },
          {
            "title": {
              "urdu": "رہائش کا مسئلہ",
              "english": "The Issue of Lodging"
            },
            "content": {
              "urdu": [
                "طلاقِ بائن کے بعد عورت جہاں چاہے اپنی عدت گزار سکتی ہے۔",
                "سابقہ شوہر اسے اپنے گھر میں رکھنے کا شرعی طور پر پابند نہیں ہے۔",
                "آپ ﷺ نے فاطمہ کو ابن ام مکتوم کے گھر عدل گزارنے کا حکم دیا۔"
              ],
              "english": [
                "After an irrevocable divorce, a woman can observe her Iddah wherever she chooses.",
                "The ex-husband is not legally obligated to provide housing in his home.",
                "The Prophet (ﷺ) instructed Fatima to observe her Iddah at Ibn Umm Maktum's house."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات کی وضاحت",
        "english": "Explanation of Juristic Differences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احناف کا موقف",
              "english": "The Hanafi Position"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک مطلقہ ثلاثہ کے لیے بھی رہائش اور نفقہ واجب ہے۔",
                "وہ دلیل دیتے ہیں کہ عدت کے دوران عورت کا تعلق نکاح سے رہتا ہے۔",
                "وہ فاطمہ بنت قیس کی حدیث کو ایک خاص واقعہ قرار دیتے ہیں۔"
              ],
              "english": [
                "Hanafis maintain that lodging and maintenance are mandatory even for the irrevocably divorced.",
                "They argue that during Iddah, some level of marital connection still exists.",
                "They view Fatima bint Qais's case as a specific exception or unique incident."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلِ حدیث اور شوافع کی رائے",
              "english": "Ahl-e-Hadith and Shafi'i View"
            },
            "content": {
              "urdu": [
                "اہلِ حدیث اور اکثر محدثین اس صحیح حدیث پر عمل کرتے ہوئے نفقہ کا انکار کرتے ہیں۔",
                "جب رشتہ مکمل طور پر ختم ہو گیا تو مالی بوجھ شوہر پر نہیں ڈالا جا سکتا۔",
                "نصوصِ صریحہ کی موجودگی میں قیاس کی گنجائش باقی نہیں رہتی۔"
              ],
              "english": [
                "Ahl-e-Hadith and most Hadith scholars follow this Sahih Hadith and deny maintenance.",
                "Once the bond is fully severed, the financial burden cannot remain on the husband.",
                "When explicit texts (Nusus) exist, there is no room for speculative reasoning (Qiyas)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدت کے احکام اور حکمت",
        "english": "Iddah Rules and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رجعی اور بائن طلاق کا فرق",
              "english": "Difference Between Revocable and Irrevocable"
            },
            "content": {
              "urdu": [
                "پہلی یا دوسری طلاق میں نفقہ واجب ہے کیونکہ رجوع ممکن ہے۔",
                "تیسری طلاق کے بعد حلالہ شرعیہ کے بغیر دوبارہ نکاح ناممکن ہے۔",
                "شرعی احکام رشتے کی نوعیت اور حقوق و فرائض کے توازن پر مبنی ہیں۔"
              ],
              "english": [
                "In the first or second divorce, maintenance is mandatory because return is possible.",
                "After the third divorce, remarriage is impossible without Halalah Shar'iyyah.",
                "Shariah rulings are based on the nature of the bond and balance of duties."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاملہ کا استثناء",
              "english": "Exception for Pregnant Women"
            },
            "content": {
              "urdu": [
                "اگر مطلقہ ثلاثہ حاملہ ہو تو اس کا نفقہ بچے کی وجہ سے واجب ہوگا۔",
                "قرآن مجید میں حاملہ عورتوں کے لیے وضع حمل تک خرچ کا حکم ہے۔",
                "یہ رعایت دراصل بچے کے تحفظ اور پرورش کے لیے دی گئی ہے۔"
              ],
              "english": [
                "If the irrevocably divorced woman is pregnant, maintenance is mandatory due to the child.",
                "The Quran commands spending on pregnant women until they give birth.",
                "This concession is provided for the protection and upbringing of the unborn child."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی پہلو",
        "english": "Social and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کا تحفظ",
              "english": "Protection of the Woman"
            },
            "content": {
              "urdu": [
                "اسلام نے عورت کو بے یار و مددگار چھوڑنے کا حکم نہیں دیا۔",
                "اگر شوہر پر نفقہ نہیں تو عورت کے اپنے خاندان کی ذمہ داری بنتی ہے۔",
                "ریاستِ مدینہ میں ایسے ضرورت مندوں کی کفالت بیت المال سے کی جاتی تھی۔"
              ],
              "english": [
                "Islam does not command leaving a woman helpless after divorce.",
                "If the husband isn't liable, the woman's own birth family takes responsibility.",
                "In the State of Madinah, the needy were supported by the Treasury (Bait-ul-Mal)."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفرت اور فتنہ سے بچاؤ",
              "english": "Avoiding Resentment and Fitnah"
            },
            "content": {
              "urdu": [
                "علیحدگی کے بعد ایک ساتھ رہنے سے فتنے اور جھگڑے کا اندیشہ ہوتا ہے۔",
                "تیسری طلاق کے بعد علیحدہ رہائش دشمنی کو کم کرنے میں مدد دیتی ہے۔",
                "شریعت کا مقصد میاں بیوی کے درمیان تلخی کو مزید بڑھنے سے روکنا ہے۔"
              ],
              "english": [
                "Living together after an irrevocable separation can lead to fitnah and disputes.",
                "Separate housing after the third divorce helps in reducing further enmity.",
                "The goal of Shariah is to prevent the escalation of bitterness between the parties."
              ]
            }
          }
        ]
      }
    }
  ]
}