{
  "hadithId": 416,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:5837"],
    "kitabId": 2,
    "inKitabBab": 17,
    "arabicBook": "كتاب اللباس",
    "babId": 27
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5837)‏، ومسلم (2067)، وأبو داود (3723)، والنسائي (5301).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری نے (5837) پر روایت کیا ہے۔ اس کے علاوہ صحیح مسلم، ابوداؤد اور نسائی میں بھی یہ ممانعت صراحت کے ساتھ موجود ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (5837). Also recorded in Sahih Muslim (2067) and the Sunan works, confirming the prohibition of these luxury items."
  },
  "importantWords": [
    {
      "arabic": "آنِيَةِ",
      "english": "Vessels / Utensils",
      "urdu": "برتن"
    },
    {
      "arabic": "اَلذَّهَبِ",
      "english": "Gold",
      "urdu": "سونا"
    },
    {
      "arabic": "الْفِضَّةِ",
      "english": "Silver",
      "urdu": "چاندی"
    },
    {
      "arabic": "اَلْحَرِيرِ",
      "english": "Silk",
      "urdu": "ریشم"
    },
    {
      "arabic": "الدِّيبَاجِ",
      "english": "Thick Silk / Brocade",
      "urdu": "موٹا ریشم / دیباج"
    },
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مسلمانوں کو سونے چاندی کے برتن استعمال کرنے اور ریشمی لباس یا بچھونے استعمال کرنے سے سختی سے منع کیا گیا ہے۔",
    "english": "This Hadith strictly prohibits Muslims from using gold and silver utensils and from wearing or sitting on silk fabrics."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5837)",
      "english": "Sahih al-Bukhari (5837)"
    },
    {
      "arabic": "صحيح مسلم (2067)",
      "english": "Sahih Muslim (2067)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "حذيفة بن اليمان",
        "english": "Hudhaifa bin Al-Yaman"
      },
      "slug": "hudhaifa-bin-al-yaman"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=5rL9E2Xm-x0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "برتنوں کا شرعی حکم",
        "english": "Ruling on Utensils"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سونے چاندی کی ممانعت",
              "english": "Prohibition of Gold and Silver"
            },
            "content": {
              "urdu": [
                "سونے اور چاندی کے برتنوں میں کھانا پینا صریحاً حرام ہے۔",
                "یہ ممانعت مردوں اور عورتوں دونوں کے لیے یکساں ہے۔",
                "ایسا کرنا تکبر اور اسراف کی علامت ہے جو اسلام میں ناپسندیدہ ہے۔"
              ],
              "english": [
                "Eating and drinking in gold and silver vessels is strictly forbidden.",
                "This prohibition applies equally to both men and women regarding utensils.",
                "Using such luxury items signifies arrogance and extravagance, which Islam dislikes."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسرے استعمالات",
              "english": "Other Uses"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک ان برتنوں کا کسی بھی طرح استعمال ناجائز ہے۔",
                "صرف کھانے پینے تک محدود نہیں بلکہ سجاوٹ میں بھی احتیاط لازم ہے۔",
                "یہ اشیاء کفار کے طرزِ زندگی کا خاصہ ہیں جن کی مشابہت سے روکا گیا ہے۔"
              ],
              "english": [
                "Most scholars consider any use of these vessels as impermissible.",
                "The ban isn't limited to eating but extends to general utility and decor.",
                "These items represent the lifestyle of disbelievers, and imitation is forbidden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ریشم اور دیباج کا حکم",
        "english": "Ruling on Silk and Brocade"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردوں کے لیے ریشم",
              "english": "Silk for Men"
            },
            "content": {
              "urdu": [
                "خالص ریشم پہننا مردوں کے لیے قطعی طور پر حرام ہے۔",
                "خواتین کے لیے زینت کی خاطر ریشم پہننا جائز قرار دیا گیا ہے۔",
                "مردوں کے لیے ریشم پہننا نسوانیت کی مشابہت اور غرور کا باعث ہے۔"
              ],
              "english": [
                "Wearing pure silk is absolutely forbidden for men in Islam.",
                "Silk is permitted for women as a means of adornment and beauty.",
                "For men, wearing silk leads to effeminacy and worldly vanity."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریشم پر بیٹھنا",
              "english": "Sitting on Silk"
            },
            "content": {
              "urdu": [
                "ریشمی بچھونوں اور گدوں پر بیٹھنے سے بھی منع کیا گیا ہے۔",
                "یہ ممانعت مردوں کے لیے ہے تاکہ وہ عیش و عشرت میں نہ پڑیں۔",
                "اسلام سادگی اور وقار کو پسند کرتا ہے، نہ کہ نمود و نمائش کو۔"
              ],
              "english": [
                "Sitting on silk carpets, cushions, or mattresses is also prohibited.",
                "This restriction for men ensures they avoid excessive worldly luxury.",
                "Islam promotes simplicity and dignity over show-off and luxury."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور فوائد",
        "english": "Wisdom and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشی مساوات",
              "english": "Economic Equality"
            },
            "content": {
              "urdu": [
                "سونا چاندی کرنسی کے طور پر معیشت کی بنیاد ہونے چاہئیں۔",
                "انہیں برتن بنا کر منجمد کرنا غریبوں کی حق تلفی اور معاشی تنگی ہے۔",
                "اسلامی معاشرے میں مال کی گردش کو عام کرنا مقصود ہے۔"
              ],
              "english": [
                "Gold and silver should serve as the economic foundation as currency.",
                "Freezing them in the form of utensils harms the poor and the economy.",
                "Islam aims to encourage the circulation of wealth within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی ترجیح",
              "english": "Priority of the Hereafter"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ یہ چیزیں دنیا میں کفار کے لیے ہیں۔",
                "مومن کے لیے اللہ نے جنت میں ان سے بہتر نعمتیں تیار کر رکھی ہیں۔",
                "دنیا کی عارضی لذت پر آخرت کی ابدی راحت کو ترجیح دینی چاہیے۔"
              ],
              "english": [
                "The Prophet (PBUH) stated these luxuries are for disbelievers in this world.",
                "For believers, better rewards are prepared by Allah in Paradise.",
                "One must prioritize eternal comfort over temporary worldly pleasures."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی اختیار کرنا",
              "english": "Adopting Simplicity"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی زندگی میں میانہ روی اور سادگی اپنانی چاہیے۔",
                "دولت کا اظہار برتنوں یا مہنگے ریشم سے کرنا مومن کا شیوہ نہیں۔",
                "سادگی ایمان کا حصہ ہے اور یہ انسان کو عاجز بناتی ہے۔"
              ],
              "english": [
                "A Muslim should adopt moderation and simplicity in their daily life.",
                "Flaunting wealth through utensils or expensive silk is not the way of a believer.",
                "Simplicity is part of faith and helps keep a person humble."
              ]
            }
          },
          {
            "title": {
              "urdu": "حلال و حرام کی تمیز",
              "english": "Distinction between Halal and Haram"
            },
            "content": {
              "urdu": [
                "فیشن یا رواج کے نام پر شرعی حدود کو پامال نہیں کرنا چاہیے۔",
                "خرید و فروخت کرتے وقت برتنوں اور کپڑوں کے شرعی احکام مدنظر رکھیں۔",
                "اللہ کی اطاعت میں ہی دنیا اور آخرت کی حقیقی کامیابی ہے۔"
              ],
              "english": [
                "Sharia boundaries should not be violated in the name of fashion or trends.",
                "Keep Islamic rulings in mind when buying or selling utensils and fabrics.",
                "True success in both worlds lies solely in the obedience to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
