{
  "hadithId": 1242,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/7"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "الجامع - باب الأدب",
    "babId": 102
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6231)، ومسلم (2160).",
    "urdu": "صحیح۔ اسے امام بخاری (6231) اور امام مسلم (2160) نے اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6231) and Muslim (2160)."
  },
  "importantWords": [
    {
      "arabic": "لِيُسَلِّمْ",
      "english": "Should greet",
      "urdu": "سلام کرنا چاہیے"
    },
    {
      "arabic": "الصَّغِيرُ",
      "english": "The younger",
      "urdu": "چھوٹا / کم عمر"
    },
    {
      "arabic": "الْمَارُّ",
      "english": "The passer-by",
      "urdu": "گزرنے والا"
    },
    {
      "arabic": "الرَّاكِبُ",
      "english": "The rider",
      "urdu": "سوار"
    },
    {
      "arabic": "الْقَلِيلُ",
      "english": "The few",
      "urdu": "تھوڑی تعداد"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے سلام میں پہل کرنے کے معاشرتی آداب سکھائے ہیں تاکہ معاشرے میں نظم و ضبط، عجز و انکساری اور بڑوں کا احترام پیدا ہو۔",
    "english": "The Prophet (ﷺ) taught social etiquettes of initiating Salām to foster discipline, humility, and respect for elders within society."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الاستئذان، رقم 6231",
      "english": "Sahih al-Bukhari, Book of Asking Permission, No. 6231"
    },
    {
      "arabic": "صحيح مسلم، كتاب السلام، رقم 2160",
      "english": "Sahih Muslim, Book of Greetings, No. 2160"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=N4f8uQ8Z0kY",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سلام میں پہل کرنے کی حکمت",
        "english": "The Wisdom Behind Initiating Salām"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بڑوں کا احترام",
              "english": "Respect for Elders"
            },
            "content": {
              "urdu": [
                "چھوٹے کو بڑے پر سلام کرنے کا حکم دے کر معاشرے میں عمر کے تفاوت اور احترام کو ملحوظ رکھا گیا ہے۔",
                "یہ عمل نوجوان نسل میں بڑوں کی عزت اور وقار کو تسلیم کرنے کا جذبہ پیدا کرتا ہے۔",
                "اسلامی معاشرت میں عمر رسیدہ افراد کا مقام بہت بلند ہے، اور یہ ادب اسی کی عکاسی کرتا ہے۔"
              ],
              "english": [
                "By commanding the younger to greet the older, Islam preserves social hierarchy and respect for age.",
                "This practice instills a spirit of acknowledging the dignity and seniority of elders in the youth.",
                "In Islamic society, the elderly hold a high station, and this etiquette directly reflects that value."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبر کا خاتمہ",
              "english": "Eradicating Arrogance"
            },
            "content": {
              "urdu": [
                "سوار کو پیدل چلنے والے پر سلام کرنے کا حکم اس لیے دیا گیا تاکہ سواری کی وجہ سے اس میں بڑائی نہ آئے۔",
                "اسی طرح تھوڑے لوگوں کا زیادہ کو سلام کرنا عجز و انکساری کی بہترین مثال ہے۔",
                "سلام میں پہل کرنا دل سے کینہ اور غرور کو ختم کرنے کا بہترین نبوی نسخہ ہے۔"
              ],
              "english": [
                "The rider greets the pedestrian to ensure that possession of a mount does not lead to feelings of superiority.",
                "Similarly, a small group greeting a larger one serves as an excellent example of humility.",
                "Initiating Salām is a Prophetic remedy to purge the heart of malice, pride, and arrogance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نظم و ضبط اور معاشرتی ترتیب",
        "english": "Social Order and Discipline"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راہ چلنے کے آداب",
              "english": "Etiquette of the Wayfarer"
            },
            "content": {
              "urdu": [
                "گزرنے والے کا بیٹھے ہوئے شخص کو سلام کرنا اس کے سکون میں خلل نہ ڈالنے اور امن کی علامت ہے۔",
                "یہ اصول راستوں پر چلنے والے مسافروں اور مقیم لوگوں کے درمیان اجنبیت کو ختم کرتا ہے۔",
                "اس سے یہ پیغام ملتا ہے کہ آنے والا شخص خیر اور سلامتی کا پیغام لے کر آیا ہے۔"
              ],
              "english": [
                "The passer-by greeting the one sitting signifies peaceful intent and respect for their rest.",
                "This principle eliminates estrangement between travelers on the road and local residents.",
                "It conveys a message that the incoming person arrives with intentions of goodness and peace."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی ادائیگی",
              "english": "Fulfilling Mutual Rights"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ ترتیب دی گئی ہے، لیکن اگر دوسرا فریق پہل کر لے تو اسے زیادہ ثواب ملتا ہے۔",
                "یہ قواعد صرف اس لیے ہیں تاکہ سلام کرنے میں تاخیر نہ ہو اور کوئی ابہام باقی نہ رہے۔",
                "سلام کے ان حقوق کی ادائیگی سے مسلمانوں کے درمیان بھائی چارے اور الفت کی فضا قائم ہوتی ہے۔"
              ],
              "english": [
                "While this order is established, if the other party initiates first, they earn a greater reward.",
                "These rules exist to prevent delays in greeting and to remove any ambiguity of responsibility.",
                "Fulfilling these rights of Salām fosters an atmosphere of brotherhood and affection among Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سلام کے فضائل اور برکات",
        "english": "Virtues and Blessings of Salām"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محبت بڑھانے کا ذریعہ",
              "english": "A Means to Increase Love"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے فرمایا کہ تم جنت میں داخل نہیں ہو سکتے جب تک ایک دوسرے سے محبت نہ کرو۔",
                "اور محبت بڑھانے کے لیے آپ ﷺ نے سلام کو عام کرنے کا مشورہ دیا تھا۔",
                "سلام صرف ایک دعا نہیں بلکہ سماجی ہم آہنگی کا ایک طاقتور اور موثر ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) stated that you cannot enter Paradise until you love one another.",
                "To increase that love, he advised the widespread practice of spreading Salām.",
                "Salām is not just a prayer but a powerful and effective tool for social harmony."
              ]
            }
          },
          {
            "title": {
              "urdu": "امن کا پیغام",
              "english": "The Message of Peace"
            },
            "content": {
              "urdu": [
                "سلام کا مطلب ہی 'سلامتی' ہے، جو اس بات کا عہد ہے کہ میری طرف سے آپ کو کوئی دکھ نہیں پہنچے گا۔",
                "یہ ایک مسلمان کا دوسرے مسلمان کو جان، مال اور عزت کے تحفظ کا غیر لفظی معاہدہ ہے۔",
                "جس معاشرے میں سلام عام ہوتا ہے، وہاں خوف اور بے چینی کے بادل چھٹ جاتے ہیں۔"
              ],
              "english": [
                "Salām literally means 'security', a pledge that 'you will receive no harm from me'.",
                "It is a non-verbal contract between Muslims to protect each other's life, property, and honor.",
                "In a society where Salām is prevalent, clouds of fear and restlessness naturally disperse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور اطلاق",
        "english": "Practical Training and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچوں کی تربیت",
              "english": "Training of Children"
            },
            "content": {
              "urdu": [
                "والدین کو چاہیے کہ وہ بچپن سے ہی بچوں کو بڑوں پر سلام کرنے کی عادت ڈالیں۔",
                "اس سے بچوں کی شخصیت میں عاجزی پیدا ہوتی ہے اور وہ بڑوں کے سامنے باادب رہتے ہیں۔",
                "یہ نبوی آداب نسل در نسل منتقل ہو کر ایک مہذب اسلامی معاشرہ تشکیل دیتے ہیں۔"
              ],
              "english": [
                "Parents should instill the habit of greeting elders in their children from an early age.",
                "This develops humility in a child's personality and teaches them to remain respectful.",
                "These Prophetic etiquettes, passed through generations, form the basis of a civilized society."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجنبیت کا خاتمہ",
              "english": "Eliminating Alienation"
            },
            "content": {
              "urdu": [
                "سنت یہ ہے کہ سلام صرف پہچان والوں کو نہیں بلکہ ہر مسلمان کو کیا جائے۔",
                "یہ عمل مسلمانوں کے درمیان سے اجنبیت کی دیواروں کو گرا دیتا ہے اور اپنائیت پیدا کرتا ہے۔",
                "آج کے دور میں اس سنت پر عمل کرنا مسلمانوں کے بکھرے ہوئے شیرازے کو جوڑنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "The Sunnah is to greet every Muslim, not just those whom one recognizes.",
                "This practice breaks down walls of alienation among Muslims and creates a sense of belonging.",
                "In modern times, practicing this Sunnah is essential to unite the fragmented Muslim Ummah."
              ]
            }
          }
        ]
      }
    }
  ]
}