{
  "hadithId": 589,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/589"],
    "kitabId": 6,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 36
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1721)، والنسائي (2620)، وابن ماجه (2886)، وأحمد (1/255)، وأصله في مسلم (1337).",
    "urdu": "صحیح۔ اسے ابوداؤد (1721)، نسائی (2620)، ابن ماجہ (2886) اور احمد نے روایت کیا ہے، اور اس کی جڑ صحیح مسلم میں ابوہریرہ رضی اللہ عنہ سے مروی ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (1721), An-Nasa'i (2620), Ibn Majah (2886), and Ahmad (1/255). Its source is in Sahih Muslim (1337) on the authority of Abu Hurairah."
  },
  "importantWords": [
    {
      "arabic": "كَتَبَ",
      "english": "Ordained / Prescribed",
      "urdu": "فرض کیا / لکھ دیا"
    },
    {
      "arabic": "كُلِّ عَامٍ",
      "english": "Every year",
      "urdu": "ہر سال"
    },
    {
      "arabic": "لَوَجَبَتْ",
      "english": "It would have become obligatory",
      "urdu": "تو وہ واجب ہو جاتا"
    },
    {
      "arabic": "مَرَّةٌ",
      "english": "Once",
      "urdu": "ایک بار"
    },
    {
      "arabic": "تَطَوُّعٌ",
      "english": "Voluntary / Optional",
      "urdu": "نفل / احسان"
    }
  ],
  "summary": {
    "urdu": "حج زندگی میں صرف ایک بار فرض ہے، بار بار کرنا نفل اور باعثِ ثواب ہے، اور دین کے احکام میں بلا ضرورت کرید کرنا پسندیدہ نہیں۔",
    "english": "Hajj is obligatory only once in a lifetime. Any additional Hajj is voluntary, and delving into unnecessary details of divine commands is discouraged."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1721)",
      "english": "Reported by Abu Dawud (1721)"
    },
    {
      "arabic": "رواه مسلم (1337)",
      "english": "Reported by Muslim (1337)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "الأقرع بن حابس",
        "english": "Al-Aqra' bin Habis"
      },
      "slug": "al-aqra-bin-habis"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0h9V6N-K3E0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حج کی فرضیت کا دورانیہ",
        "english": "Frequency of Hajj Obligation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زندگی میں ایک بار",
              "english": "Once in a Lifetime"
            },
            "content": {
              "urdu": [
                "اس حدیث سے واضح ہوتا ہے کہ صاحبِ استطاعت پر حج زندگی میں صرف ایک مرتبہ فرض ہے۔",
                "اللہ تعالیٰ نے اپنے بندوں پر رحمت فرماتے ہوئے اسے ہر سال واجب نہیں کیا تاکہ مشقت نہ ہو۔",
                "ایک بار حج کی ادائیگی سے انسان اپنے ذمے واجب حق سے فارغ ہو جاتا ہے۔"
              ],
              "english": [
                "This Hadith clarifies that Hajj is obligatory only once in a lifetime for those who can afford it.",
                "Out of His mercy, Allah did not make it an annual requirement to avoid causing hardship.",
                "By performing Hajj once, an individual fulfills their primary religious obligation for this pillar."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفل حج کی فضیلت",
              "english": "Virtue of Voluntary Hajj"
            },
            "content": {
              "urdu": [
                "پہلے حج کے بعد جتنی بار بھی حج کیا جائے گا وہ نفل عبادت شمار ہوگی۔",
                "نفل حج گناہوں کی معافی اور درجات کی بلندی کا بہترین ذریعہ ہے۔",
                "تاہم، معاشرے کے دیگر حقوق اور ضرورت مندوں کی مدد نفل حج پر مقدم ہو سکتی ہے۔"
              ],
              "english": [
                "Any Hajj performed after the first one is considered a voluntary (Nafl) act of worship.",
                "Voluntary Hajj is a means for seeking forgiveness and attaining higher spiritual ranks.",
                "However, fulfilling social rights and helping the needy may take precedence over voluntary Hajj."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کثرتِ سوال کی ممانعت",
        "english": "Prohibition of Excessive Questioning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمِ الہی پر خاموشی",
              "english": "Silence on Divine Commands"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے کثرتِ سوال سے منع فرمایا تاکہ نئے احکام یا سختی نازل نہ ہو جائے۔",
                "اقرع بن حابس کے سوال پر آپ ﷺ کی خاموشی ایک تربیتی پہلو رکھتی تھی۔",
                "صحابہ کو سکھایا گیا کہ جتنا بتایا جائے اس پر بلا چوں و چرا عمل کریں۔"
              ],
              "english": [
                "The Prophet (ﷺ) discouraged excessive questioning to prevent new or harder rulings from being revealed.",
                "His silence following Al-Aqra's question served as a pedagogical lesson for the Companions.",
                "The Sahaba were taught to follow instructions as given without seeking unnecessary complications."
              ]
            }
          },
          {
            "title": {
              "urdu": "سابقہ امتوں کی ہلاکت",
              "english": "Destruction of Previous Nations"
            },
            "content": {
              "urdu": [
                "صحیح مسلم کی روایت کے مطابق سابقہ امتیں کثرتِ سوال کی وجہ سے ہی گمراہ ہوئیں۔",
                "جب لوگ واضح احکام میں باریکیاں نکالتے ہیں تو عمل سے دور ہو جاتے ہیں۔",
                "دین میں سادگی اور روحِ عمل کو برقرار رکھنا ہی کامیابی کا راستہ ہے۔"
              ],
              "english": [
                "According to the Muslim report, previous nations were ruined by their excessive questioning.",
                "When people look for loopholes or complexities in clear commands, they stray from practice.",
                "Maintaining simplicity and the spirit of action in religion is the path to success."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مقامِ رسالت اور تشریع",
        "english": "Authority of the Messenger in Legislation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی زبان کا اثر",
              "english": "The Power of Prophetic Words"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا فرمان 'اگر میں ہاں کہہ دیتا تو واجب ہو جاتا' آپ کے مقامِ تشریع کو ظاہر کرتا ہے۔",
                "اللہ نے نبی ﷺ کو یہ اختیار دیا تھا کہ وہ شرعی احکام کی تفصیل واضح فرمائیں۔",
                "نبی ﷺ کی ہر بات وحیِ الہی کی منشا کے عین مطابق ہوتی تھی۔"
              ],
              "english": [
                "The statement 'If I had said yes, it would have become obligatory' shows his legislative authority.",
                "Allah granted the Prophet (ﷺ) the authority to clarify and detail the Sharia rulings.",
                "Every word of the Prophet (ﷺ) aligned perfectly with the Will of Divine Revelation."
              ]
            }
          },
          {
            "title": {
              "urdu": "امت کے لیے آسانی کی تڑپ",
              "english": "Yearning for the Ummah's Ease"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے 'ہاں' اس لیے نہیں کہا کیونکہ آپ کو اپنی امت کی کمزوری کا احساس تھا۔",
                "نبی کریم ﷺ ہمیشہ اپنی امت کے لیے سہولت اور نرمی تلاش فرماتے تھے۔",
                "یہ اللہ کے رسول ﷺ کی اپنی امت پر عظیم شفقت اور مہربانی کی مثال ہے۔"
              ],
              "english": [
                "He refrained from saying 'yes' because he was acutely aware of his Ummah's potential weakness.",
                "The Messenger of Allah (ﷺ) always sought ease and leniency for his followers.",
                "This is a prime example of the Prophet's immense compassion and mercy toward his Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فرائض کی اہمیت",
              "english": "Importance of Obligations"
            },
            "content": {
              "urdu": [
                "صاحبِ استطاعت کو زندگی میں ایک بار حج کی ادائیگی میں تاخیر نہیں کرنی چاہیے۔",
                "فرض کی ادائیگی اللہ کی محبت اور بندگی کا پہلا تقاضا ہے۔",
                "حج کے ذریعے انسان کی پوری زندگی کے گناہ معاف کر دیے جاتے ہیں۔"
              ],
              "english": [
                "Those who are capable should not delay performing their one-time obligatory Hajj.",
                "Fulfilling the obligation is the primary requirement of love and servitude to Allah.",
                "Through Hajj, a person's sins from their entire past life are forgiven."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور اتباع",
              "english": "Moderation and Obedience"
            },
            "content": {
              "urdu": [
                "دین میں بال کی کھال نکالنے کے بجائے سنت کی سیدھی پیروی کرنی چاہیے۔",
                "اللہ نے جس قدر رعایت دی ہے، اسے خوشی سے قبول کرنا چاہیے۔",
                "نیکی میں غلو (حد سے گزرنا) اکثر انسان کو تھکا کر عمل سے محروم کر دیتا ہے۔"
              ],
              "english": [
                "One should follow the Sunnah directly instead of hair-splitting in religious matters.",
                "The concessions granted by Allah should be accepted with gratitude and joy.",
                "Extremism in piety often leads to exhaustion and eventual abandonment of action."
              ]
            }
          }
        ]
      }
    }
  ]
}