{
  "hadithId": 789,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/789"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (2589)‏ ، ومسلم (1622). واللفظ الآخر للبخاري برقم (2622) يؤكد بشاعة هذا الفعل وقبحه في الشريعة الإسلامية.",
    "urdu": "صحیح۔ اسے امام بخاری (2589) اور امام مسلم (1622) نے روایت کیا ہے۔ بخاری کی دوسری روایت (2622) اس فعل کی قباحت اور اس کی اخلاقی گراوٹ کو مزید واضح کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2589) and Muslim (1622). Another version in Al-Bukhari (2622) emphasizes the repulsiveness of this act within Islamic ethics."
  },
  "importantWords": [
    {
      "arabic": "الْعَائِدُ",
      "english": "The one who returns",
      "urdu": "رجوع کرنے والا / واپس لینے والا"
    },
    {
      "arabic": "هِبَتِهِ",
      "english": "His gift",
      "urdu": "اپنا ہبہ / تحفہ"
    },
    {
      "arabic": "يَقِيءُ",
      "english": "Vomits",
      "urdu": "وہ قے کرتا ہے"
    },
    {
      "arabic": "مَثَلُ اَلسَّوْءِ",
      "english": "Evil simile / example",
      "urdu": "بری مثال"
    },
    {
      "arabic": "يَرْجِعُ",
      "english": "Goes back",
      "urdu": "پلٹ آتا ہے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ہبہ (تحفہ) دے کر واپس لینے کی سخت مذمت کی گئی ہے اور اسے ایک نہایت گھناونی مثال (کتے کی قے) سے تشبیہ دی گئی ہے تاکہ لوگ اس اخلاقی پستی سے بچیں۔",
    "english": "This Hadith strongly condemns revoking a gift, comparing it to a dog returning to its vomit to highlight the moral repulsiveness of such an action."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2589)",
      "english": "Reported by Al-Bukhari (2589)"
    },
    {
      "arabic": "رواه مسلم (1622)",
      "english": "Reported by Muslim (1622)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہبہ کی واپسی کی ممانعت",
        "english": "Prohibition of Revoking a Gift"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تشبیہ کی حکمت",
              "english": "Wisdom of the Simile"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ہبہ واپس لینے والے کو کتے کی قے چاٹنے سے تشبیہ دی جو انسانی فطرت کے لیے نہایت کراہت آمیز ہے۔",
                "اس تشبیہ کا مقصد مسلمانوں کو اس کم ظرفی اور پست اخلاق سے دور رکھنا ہے کہ وہ دی ہوئی چیز واپس مانگیں۔",
                "اسلامی معاشرت میں سخاوت اور بلند اخلاقی کو فروغ دیا گیا ہے، اور یہ فعل ان اصولوں کے سراسر خلاف ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) compared revoking a gift to a dog eating its vomit, which is extremely repulsive to human nature.",
                "This simile aims to discourage Muslims from such mean-spirited behavior and moral degradation.",
                "Islamic society promotes generosity and high character, and this act completely contradicts those values."
              ]
            }
          },
          {
            "title": {
              "urdu": "بری مثال سے اجتناب",
              "english": "Avoiding Evil Examples"
            },
            "content": {
              "urdu": [
                "بخاری کی روایت 'ہمارے لیے بری مثال نہیں' کا مطلب ہے کہ مومن کو ایسی حرکت زیب نہیں دیتی جو اسے جانوروں جیسی خصلت میں لے جائے۔",
                "مومن کی شان یہ ہے کہ وہ جو اللہ کے لیے دے دے، اس پر کبھی پچھتاوا نہ کرے اور نہ اسے واپس لینے کا سوچے،",
                "یہ اصول باہمی محبت اور اعتماد کو قائم رکھنے کے لیے ضروری ہے تاکہ سماجی تعلقات میں دراڑ نہ آئے۔"
              ],
              "english": [
                "The narration 'The evil simile does not apply to us' means such behavior is unbecoming of a believer.",
                "A believer’s dignity lies in never regretting or reclaiming what was given for the sake of Allah.",
                "This principle is vital for maintaining mutual love and trust, preventing cracks in social relationships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور استثناء",
        "english": "Juristic Rulings and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "والد کا حقِ رجوع",
              "english": "Father's Right to Revoke"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک ہبہ واپس لینا حرام ہے، سوائے اس ہبہ کے جو باپ اپنی اولاد کو دے۔",
                "دیگر احادیث کی روشنی میں باپ کو یہ حق حاصل ہے کہ وہ اولاد کے درمیان عدل قائم کرنے کے لیے ہبہ واپس لے سکے۔",
                "اولاد کے علاوہ کسی بھی دوسرے رشتہ دار یا اجنبی سے ہبہ واپس لینا شرعی طور پر ناجائز اور مکروہِ تحریمی ہے۔"
              ],
              "english": [
                "Most jurists hold that revoking a gift is forbidden, except for a gift given by a father to his children.",
                "In light of other Hadiths, a father has the right to take back a gift to ensure justice among his offspring.",
                "Reclaiming a gift from anyone other than one's children is Islamically impermissible and highly disliked."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہبہ مکمل ہونے کی شرط",
              "english": "Condition for Completed Gift"
            },
            "content": {
              "urdu": [
                "ہبہ اس وقت مکمل ہوتا ہے جب موہوب لہ (جسے دیا گیا) اس پر قبضہ کر لے۔",
                "قبضہ کرنے سے پہلے ہبہ سے رجوع کرنا آسان ہے، مگر قبضہ مکمل ہونے کے بعد یہ اخلاقی جرم بن جاتا ہے۔",
                "اسلامی قانون میں قبضے کی بہت اہمیت ہے کیونکہ یہی ملکیت کی حتمی منتقلی کی دلیل ہے۔"
              ],
              "english": [
                "A gift is legally complete once the recipient takes physical or legal possession of it.",
                "While revoking is easier before possession, doing so after possession becomes a moral crime.",
                "Possession (Qabd) is crucial in Islamic law as it signifies the final transfer of ownership."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور سماجی اثرات",
        "english": "Ethical and Social Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی رشتوں کی حفاظت",
              "english": "Protection of Relationships"
            },
            "content": {
              "urdu": [
                "تحائف کا مقصد دلوں میں محبت پیدا کرنا ہے، جبکہ واپسی نفرت اور کینہ کا باعث بنتی ہے۔",
                "ہبہ واپس لینے سے دینے والے کی عزت ختم ہو جاتی ہے اور لینے والے کی تذلیل ہوتی ہے۔",
                "شریعت نے ہر اس راستے کو بند کیا ہے جو سماجی بگاڑ اور باہمی دشمنی کا سبب بن سکے۔"
              ],
              "english": [
                "Gifts are intended to foster love, whereas revoking them causes hatred and malice.",
                "Taking back a gift destroys the giver's respect and humiliates the recipient.",
                "Shariah blocks every path that could lead to social corruption or mutual enmity."
              ]
            }
          },
          {
            "title": {
              "urdu": "سخاوت کی تربیت",
              "english": "Cultivating Generosity"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسلمانوں کو 'عالی ظرفی' اور 'فراخ دلی' کی تربیت دیتی ہے۔",
                "ایک بار جو چیز کسی کو دے دی، وہ اب آپ کی نہیں رہی بلکہ دوسرے کا حق بن چکی ہے۔",
                "سخی انسان اللہ کے قریب ہوتا ہے اور بخیل یا احسان جتانے والا اللہ کی رحمت سے دور۔"
              ],
              "english": [
                "This Hadith trains Muslims in magnanimity and open-heartedness.",
                "Once something is given away, it no longer belongs to you; it becomes the legal right of another.",
                "A generous person is close to Allah, while the stingy or one who reminds others of favors is far from His mercy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سوچ سمجھ کر ہبہ کریں",
              "english": "Think Before Gifting"
            },
            "content": {
              "urdu": [
                "تحفہ دینے سے پہلے اپنی مالی حالت اور نیت کا جائزہ لیں تاکہ بعد میں پچھتاوا نہ ہو۔",
                "صرف وہی چیز دیں جس پر آپ کا دل مطمئن ہو اور جو آپ خوشی سے دے سکیں۔",
                "جذبات میں آ کر ایسی چیز نہ دیں جسے بعد میں ضرورت پڑنے پر واپس مانگنے کی نوبت آئے۔"
              ],
              "english": [
                "Evaluate your financial status and intention before giving a gift to avoid later regret.",
                "Only give what your heart is satisfied with and what you can part with happily.",
                "Do not give things in a burst of emotion that you might need to ask back for later."
              ]
            }
          },
          {
            "title": {
              "urdu": "احسان جتلانے سے بچیں",
              "english": "Avoid Reminding of Favors"
            },
            "content": {
              "urdu": [
                "ہبہ واپس لینے کی ایک بڑی وجہ احسان جتلانا یا دوسرے سے اپنی بات منوانا ہوتا ہے۔",
                "نیکی کر کے بھول جانا اور اجر صرف اللہ سے مانگنا ہی حقیقی مومن کا شیوہ ہے۔",
                "تحفہ دے کر اسے دوسرے کی مرضی پر چھوڑ دیں اور اس کے بدلے دنیاوی فائدے کی امید نہ رکھیں۔"
              ],
              "english": [
                "A common reason for revoking a gift is reminding someone of favors or coercion.",
                "Forgetting a good deed and seeking reward only from Allah is the hallmark of a true believer.",
                "After giving a gift, leave it to the recipient's will and do not expect worldly gains in return."
              ]
            }
          }
        ]
      }
    }
  ]
}