{
  "hadithId": 1244,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/9"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "الجامع - باب الأدب",
    "babId": 102
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2167)، والترمذي (2700)، وأبو داود (5205)، وأحمد (2/266).",
    "urdu": "صحیح۔ اسے امام مسلم (2167) نے اپنی صحیح میں روایت کیا ہے، اور اس کے شواہد ابوداؤد اور ترمذی میں بھی موجود ہیں۔",
    "english": "Sahih. Reported by Muslim (2167), At-Tirmidhi (2700), and Abu Dawud (5205)."
  },
  "importantWords": [
    {
      "arabic": "لَا تَبْدَؤُوا",
      "english": "Do not initiate",
      "urdu": "پہل نہ کرو"
    },
    {
      "arabic": "السَّلَامِ",
      "english": "Greeting of Peace",
      "urdu": "سلام"
    },
    {
      "arabic": "لَقَيْتُمُوهُمْ",
      "english": "You meet them",
      "urdu": "تم ان سے ملو"
    },
    {
      "arabic": "طَرِيقٍ",
      "english": "Road / Path",
      "urdu": "راستہ"
    },
    {
      "arabic": "فَاضْطَرُّوهُمْ",
      "english": "Force them / Compel them",
      "urdu": "انہیں مجبور کر دو"
    },
    {
      "arabic": "أَضْيَقِهِ",
      "english": "The narrowest part",
      "urdu": "اس کا تنگ حصہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں غیر مسلموں (اہل کتاب) کے ساتھ سلام میں پہل نہ کرنے اور راستے میں چلتے وقت مسلمانوں کے وقار کو بلند رکھنے کی ہدایت دی گئی ہے۔",
    "english": "This Hadith instructs Muslims not to initiate Salām with non-Muslims and to maintain the dignity of believers when sharing a path."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب السلام، باب النهي عن ابتداء أهل الكتاب بالسلام، رقم 2167",
      "english": "Sahih Muslim, Book of Greetings, No. 2167"
    },
    {
      "arabic": "سنن الترمذي، كتاب الاستئذان، رقم 2700",
      "english": "Sunan at-Tirmidhi, Book of Seeking Permission, No. 2700"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqG0F8L_8Gk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیر مسلموں کو سلام کرنے کا حکم",
        "english": "Ruling on Greeting Non-Muslims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پہل نہ کرنے کی وجہ",
              "english": "Reason for Not Initiating"
            },
            "content": {
              "urdu": [
                "سلام 'السلام' اللہ کا نام ہے اور یہ اہل ایمان کے درمیان ایک خصوصی دعا اور اعزاز ہے۔",
                "نبی ﷺ نے مسلمانوں کو اپنی پہچان اور وقار برقرار رکھنے کے لیے پہل سے منع فرمایا۔",
                "یہ حکم اس وقت کا ہے جب غیر مسلم مسلمانوں کے ساتھ عناد اور دشمنی رکھتے تھے۔"
              ],
              "english": [
                "Salām is a name of Allah and a specific prayer and honor meant for believers.",
                "The Prophet (ﷺ) forbade initiation to maintain the distinct identity and dignity of Muslims.",
                "This ruling applied specifically to contexts where non-Muslims harbored enmity toward Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "سلام کا جواب دینا",
              "english": "Responding to Their Salām"
            },
            "content": {
              "urdu": [
                "اگر وہ خود سلام کریں تو ان کے جواب میں صرف 'وعلیکم' (اور تم پر بھی) کہنا چاہیے۔",
                "یہ اس لیے ہے کہ بعض یہود 'السلام' کی جگہ 'السام' (تم پر موت ہو) کہتے تھے۔",
                "اسلامی اخلاقیات میں جواب دینا ضروری ہے مگر الفاظ کے انتخاب میں احتیاط لازم ہے۔"
              ],
              "english": [
                "If they initiate the greeting, one should respond only with 'Wa 'alaikum' (and upon you).",
                "This was because some used to deceptively say 'As-Sām' (death be upon you) instead of 'As-Salām'.",
                "Islamic ethics require a response, but caution in the choice of words is mandatory."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راستے کے آداب اور وقار",
        "english": "Etiquettes of the Path and Dignity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنگ راستے کی حقیقت",
              "english": "Reality of the Narrow Path"
            },
            "content": {
              "urdu": [
                "اس کا مطلب یہ نہیں کہ انہیں راستے سے دھکے دیے جائیں یا ان پر ظلم کیا جائے۔",
                "بلکہ مقصد یہ ہے کہ مسلمان ان کے سامنے مغلوب نہ ہوں اور اپنا راستہ نہ چھوڑیں۔",
                "یہ مومن کی عزتِ نفس اور کفر کے مقابلے میں ایمانی برتری کے اظہار کی علامت ہے۔"
              ],
              "english": [
                "This does not mean pushing them off the road or committing acts of oppression.",
                "Rather, the goal is that Muslims should not act submissively or give up their path needlessly.",
                "It symbolizes the self-respect of a believer and the spiritual superiority of faith over disbelief."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلمانوں کی بالادستی",
              "english": "Supremacy of the Believers"
            },
            "content": {
              "urdu": [
                "اسلام چاہتا ہے کہ مسلمان ہر جگہ باوقار نظر آئیں اور کسی کے سامنے مرعوب نہ ہوں۔",
                "راستے میں جگہ نہ چھوڑنا ان کی شان و شوکت اور اجتماعی قوت کے اظہار کا ایک طریقہ تھا۔",
                "یہ احکامات خاص سیاسی اور جنگی حالات کے پس منظر میں بھی دیکھے جا سکتے ہیں۔"
              ],
              "english": [
                "Islam desires that Muslims appear dignified everywhere and not be intimidated by anyone.",
                "Not yielding the center of the path was a way to display their majesty and collective strength.",
                "These commands can also be understood within specific historical, political, or military contexts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انسانی حقوق اور حسنِ سلوک",
        "english": "Human Rights and Good Conduct"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عام اخلاقیات",
              "english": "General Morality"
            },
            "content": {
              "urdu": [
                "سلام کے علاوہ دیگر معاملات میں غیر مسلموں کے ساتھ انصاف اور حسنِ سلوک کا حکم ہے۔",
                "دین میں زبردستی نہیں ہے، اور غیر مسلموں کی جان و مال کی حفاظت اسلامی ریاست کا فرض ہے۔",
                "نبی ﷺ نے جنازوں کا احترام کیا اور غیر مسلم پڑوسیوں کے حقوق بھی ادا فرمائے۔"
              ],
              "english": [
                "Outside of the specific greeting, Islam commands justice and kindness toward non-Muslims.",
                "There is no compulsion in religion, and protecting non-Muslim lives is the duty of the state.",
                "The Prophet (ﷺ) respected their funerals and fulfilled the rights of non-Muslim neighbors."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعوتِ دین کا پہلو",
              "english": "Aspect of Dawah"
            },
            "content": {
              "urdu": [
                "اگر کسی غیر مسلم کو سلام کرنے سے اس کے اسلام لانے کی امید ہو، تو بعض علماء گنجائش دیتے ہیں۔",
                "اعلیٰ ظرفی اور اچھے اخلاق ہی غیر مسلموں کے دلوں کو اسلام کی طرف مائل کرتے ہیں۔",
                "سخت رویہ صرف ان کے لیے ہے جو اسلام اور مسلمانوں کے خلاف جنگی حالت میں ہوں۔"
              ],
              "english": [
                "Some scholars allow greeting if there is a strong hope it will lead them to accept Islam.",
                "Nobility of character and good manners are what draw non-believers' hearts toward the faith.",
                "Stern behavior is reserved for those who are in a state of active hostility against Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ابحاث اور عصری اطلاق",
        "english": "Juristic Discussion and Modern Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف فقہی آراء",
              "english": "Various Juristic Opinions"
            },
            "content": {
              "urdu": [
                "بعض فقہاء ضرورت کے وقت یا ہم آہنگی کے لیے سلام کی پہل کو جائز قرار دیتے ہیں۔",
                "اکثر علماء کے نزدیک 'السلام علیکم' کے بجائے 'صبح بخیر' جیسے الفاظ کہے جا سکتے ہیں۔",
                "مقصد سنت کی روح کو برقرار رکھتے ہوئے معاشرتی تعلقات کو بہتر بنانا ہے۔"
              ],
              "english": [
                "Some jurists permit initiating greetings in cases of necessity or for social harmony.",
                "Most scholars suggest using neutral terms like 'Good Morning' instead of 'As-Salāmu 'Alaikum'.",
                "The goal is to maintain the spirit of the Sunnah while managing social interactions properly."
              ]
            }
          },
          {
            "title": {
              "urdu": "موجودہ دور کی ضرورت",
              "english": "Necessity of the Current Era"
            },
            "content": {
              "urdu": [
                "آج کے عالمی تناظر میں مسلمانوں کو اپنے اخلاق سے اسلام کی صحیح تصویر پیش کرنی چاہیے۔",
                "کسی کی توہین کرنا یا بلاوجہ راستہ تنگ کرنا اسلام کی مجموعی تعلیمات کے خلاف ہے۔",
                "یہ حدیث ہمیں اپنے ایمان پر فخر کرنے اور اپنی منفرد شناخت برقرار رکھنے کا سبق دیتی ہے۔"
              ],
              "english": [
                "In today's global context, Muslims must present the true image of Islam through their character.",
                "Insulting others or causing unnecessary hardship contradicts the general teachings of Islam.",
                "This Hadith teaches us to take pride in our faith and maintain our unique religious identity."
              ]
            }
          }
        ]
      }
    }
  ]
}