{
  "hadithId": 1048,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1255"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه الحاكم (4/383)، والبيهقي (8/330)، وصححه الحاكم ووافقه الذهبي. وأخرجه مالك في الموطأ (2/825) مرسلاً عن زيد بن أسلم، وهو في مشكل الآثار للطحاوي (91).",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے امام حاکم نے روایت کیا اور اسے صحیح قرار دیا، جبکہ امام مالک نے اسے موطا میں مرسل سند کے ساتھ روایت کیا ہے۔",
    "english": "Sahih (Authentic) due to supporting evidence. Reported by al-Hakim (4/383) and al-Bayhaqi (8/330). Al-Hakim graded it Sahih and adh-Dhahabi agreed. Malik reported it as Mursal in al-Muwatta."
  },
  "importantWords": [
    {
      "arabic": "اجْتَنِبُوا",
      "english": "Avoid / Keep away",
      "urdu": "بچو / پرہیز کرو"
    },
    {
      "arabic": "الْقَاذُورَاتِ",
      "english": "Filth / Immoral acts",
      "urdu": "گندے کام / فواحش"
    },
    {
      "arabic": "فَلْيَسْتَتِرْ",
      "english": "Let him conceal himself",
      "urdu": "پس اسے چاہیے کہ پردہ پوشی کرے"
    },
    {
      "arabic": "صَفْحَتَهُ",
      "english": "His page / His face / His side",
      "urdu": "اپنا پہلو / گناہ کا چھپا ہوا رخ"
    },
    {
      "arabic": "نُقِمْ",
      "english": "We shall establish / carry out",
      "urdu": "ہم قائم کریں گے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث گناہوں سے بچنے اور لغزش کی صورت میں پردہ پوشی اختیار کرتے ہوئے توبہ کرنے کی ترغیب دیتی ہے، اور واضح کرتی ہے کہ جرم ظاہر ہونے پر حد کا نفاذ لازم ہے۔",
    "english": "This Hadith encourages avoiding sins and maintaining privacy if a mistake is made, while clarifying that once a crime is made public, the legal penalty must be enforced."
  },
  "references": [
    {
      "arabic": "المستدرك للحاكم (4/383)",
      "english": "Al-Mustadrak al-Hakim (4/383)"
    },
    {
      "arabic": "موطأ مالك (1501)",
      "english": "Muwatta Malik (1501)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پردہ پوشی کا حکم",
        "english": "The Command for Concealment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ستار العیوب کی صفت",
              "english": "The Attribute of the Concealer of Faults"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ 'ستار' ہے اور اسے اپنے بندوں کی پردہ پوشی پسند ہے۔",
                "اگر انسان سے کوئی ایسا گناہ ہو جائے جس پر شرعی حد ہے، تو اسے لوگوں میں بیان نہیں کرنا چاہیے۔",
                "گناہ کو چھپانا اور اللہ سے تنہائی میں توبہ کرنا اللہ کی رحمت کو دعوت دینا ہے۔"
              ],
              "english": [
                "Allah is the 'Veiler' (Sattar) and loves that His servants' faults remain hidden.",
                "If a person commits a sin liable for a Shariah penalty, they should not disclose it to people.",
                "Hiding one's sin and repenting privately invites the mercy of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہ کی تشہیر کی ممانعت",
              "english": "Prohibition of Publicizing Sins"
            },
            "content": {
              "urdu": [
                "گناہ کر کے اس کا چرچا کرنا معاشرے میں بے حیائی پھیلانے کا سبب بنتا ہے۔",
                "نبی ﷺ نے فرمایا کہ میری پوری امت معاف کر دی جائے گی سوائے ان کے جو کھلے عام گناہ کرتے ہیں۔",
                "پردہ پوشی کا مقصد مجرم کو شرمندگی سے بچانا اور اصلاح کا موقع دینا ہے۔"
              ],
              "english": [
                "Boasting about or publicizing a sin contributes to the spread of immorality in society.",
                "The Prophet (ﷺ) said all his followers would be forgiven except those who sin openly.",
                "Concealment aims to save the sinner from public disgrace and provide a chance for reform."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدود کا نفاذ اور ثبوت",
        "english": "Enforcement of Legal Penalties"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعترافِ جرم اور قانون",
              "english": "Confession and the Law"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص خود آ کر قاضی کے سامنے اپنے جرم کا اعتراف کر لے، تو عدالت پر حد قائم کرنا واجب ہو جاتا ہے۔",
                "اسلامی ریاست میں قانون کا نفاذ اس بات پر منحصر ہے کہ جرم واضح طور پر ثابت ہو جائے۔",
                "نبی ﷺ نے واضح فرمایا کہ اگر تم گناہ ظاہر کرو گے تو ہم حد نافذ کرنے پر مجبور ہوں گے۔"
              ],
              "english": [
                "If a person confesses to a crime before a judge, it becomes obligatory for the court to establish the penalty.",
                "Law enforcement in an Islamic state depends on the crime being clearly proven.",
                "The Prophet (ﷺ) clarified that if sins are made public, the legal consequence must follow."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ کی اہمیت",
              "english": "The Magnitude of Repentance"
            },
            "content": {
              "urdu": [
                "اللہ کے نزدیک سچی توبہ دنیاوی سزا سے کہیں زیادہ بہتر اور پاک کرنے والی ہے۔",
                "اگر بندہ توبہ کر لے اور اپنی اصلاح کر لے تو وہ ایسا ہے جیسے اس نے گناہ کیا ہی نہ ہو۔",
                "اسلام کا اصل مقصد سزائیں دینا نہیں بلکہ انسانوں کے اخلاق کی درستگی ہے۔"
              ],
              "english": [
                "Sincere repentance is more purifying and beloved to Allah than just worldly punishment.",
                "One who repents and reforms is like one who never committed a sin.",
                "The primary goal of Islam is not to punish but to correct human conduct."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی پاکیزگی",
        "english": "Social Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گندے کاموں سے اجتناب",
              "english": "Abstaining from Filth"
            },
            "content": {
              "urdu": [
                "حدیث میں گناہوں کو 'قاذورات' (گندگی) کہا گیا ہے جو روح اور معاشرے کو ناپاک کر دیتے ہیں۔",
                "ایک مسلمان کی پہچان یہ ہے کہ وہ خود کو ہر قسم کی بے حیائی سے دور رکھے۔",
                "پاکیزہ ماحول ہی ایک صحت مند نسل کی آبیاری کر سکتا ہے۔"
              ],
              "english": [
                "The Hadith refers to sins as 'filth' (Qadhurat) that pollute the soul and society.",
                "A Muslim is identified by their distance from all forms of immorality.",
                "A pure environment is essential for nurturing a healthy future generation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اپنی لغزشوں کو چھپائیں",
              "english": "Keep Your Mistakes Private"
            },
            "content": {
              "urdu": [
                "اگر کبھی نادانی میں کوئی غلطی ہو جائے تو اسے دوستوں یا سوشل میڈیا پر فخر سے بیان نہ کریں۔",
                "اپنے گناہوں پر اللہ سے شرمندہ ہونا ایمان کی نشانی ہے۔",
                "دوسروں کے گناہوں کی بھی پردہ پوشی کریں تاکہ اللہ آپ کے گناہ چھپائے۔"
              ],
              "english": [
                "If a mistake is made in ignorance, do not boast about it to friends or on social media.",
                "Feeling ashamed of one's sins before Allah is a sign of faith.",
                "Veil the faults of others so that Allah may veil your faults."
              ]
            }
          }
        ]
      }
    }
  ]
}