{
  "hadithId": 988,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1138"],
    "kitabId": 8,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 78
  },

  "takhreej": {
    "arabic": "صحيح. رواه أحمد (2/246)، وأبو داود (2277)، والنسائي (3496)، والترمذي (1357)، وابن ماجه (2351). وقال الترمذي: حديث حسن صحيح.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، نسائی، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic). Reported by Ahmad (2/246), Abu Dawud (2277), An-Nasa'i (3496), At-Tirmidhi (1357), and Ibn Majah (2351). At-Tirmidhi classified it as Hasan Sahih."
  },
  "importantWords": [
    {
      "arabic": "يَذْهَبَ",
      "english": "To take away / Go away",
      "urdu": "لے جائے / چلا جائے"
    },
    {
      "arabic": "نَفَعَنِي",
      "english": "Benefited me / Helped me",
      "urdu": "مجھے فائدہ پہنچایا"
    },
    {
      "arabic": "سَقَانِي",
      "english": "Gave me water",
      "urdu": "مجھے پانی پلایا"
    },
    {
      "arabic": "غُلَامُ",
      "english": "Young boy",
      "urdu": "لڑکا"
    },
    {
      "arabic": "شِئْتَ",
      "english": "You wish / You want",
      "urdu": "تم چاہو"
    },
    {
      "arabic": "فَانْطَلَقَتْ",
      "english": "She went away",
      "urdu": "وہ چل پڑی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ثابت کرتی ہے کہ سمجھدار بچے کو والدین میں سے کسی ایک کے ساتھ رہنے کا اختیار دیا جائے گا اگر ان کے درمیان علیحدگی ہو جائے۔",
    "english": "This Hadith establishes that a discerning child is given the choice to stay with either parent in case of a custody dispute following divorce."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2277)",
      "english": "Sunan Abu Dawud (2277)"
    },
    {
      "arabic": "سنن الترمذي (1357)",
      "english": "Sunan At-Tirmidhi (1357)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FisXpL9kY40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بچے کا حقِ انتخاب",
        "english": "The Child's Right of Choice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تمیز اور شعور کی حد",
              "english": "Age of Discernment"
            },
            "content": {
              "urdu": [
                "جب بچہ سمجھدار ہو جائے (تقریباً 7 سال)، تو اسے اختیار دیا جا سکتا ہے۔",
                "نبی ﷺ نے بچے کو زبردستی کسی ایک کے حوالے کرنے کے بجائے اس کی مرضی پوچھی۔",
                "یہ اصول بچے کی نفسیاتی اور جسمانی راحت کو مقدم رکھنے کے لیے ہے۔"
              ],
              "english": [
                "When a child reaches the age of discernment (approx. 7 years), they can be given a choice.",
                "The Prophet ﷺ asked for the child's preference instead of forceful assignment.",
                "This principle prioritizes the child's psychological and physical well-being."
              ]
            }
          },
          {
            "title": {
              "urdu": "والدین کی برابر حیثیت",
              "english": "Equal Status of Parents"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے فرمایا 'یہ تیرا باپ ہے اور یہ تیری ماں'، دونوں کے احترام کو برقرار رکھا۔",
                "حضانت (پرورش) کے معاملے میں دونوں کا دعویٰ سنا جائے گا۔",
                "عدل کا تقاضا ہے کہ فیصلہ بچے کے بہترین مفاد میں ہو۔"
              ],
              "english": [
                "The Prophet ﷺ identified both parents to maintain their respect and status.",
                "In custody matters, the claims of both parents must be heard fairly.",
                "Justice requires that the decision serves the best interest of the child."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حضانت کے اصول",
        "english": "Principles of Custody"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماں کی ترجیح",
              "english": "Mother's Precedence"
            },
            "content": {
              "urdu": [
                "عموماً چھوٹے بچوں کے لیے ماں کو پرورش کا پہلا حق حاصل ہے۔",
                "اس حدیث میں بچے نے خود ماں کا انتخاب کیا جسے آپ ﷺ نے برقرار رکھا۔",
                "ماں کی مامتا اور شفقت بچے کی نشوونما کے لیے ضروری ہے۔"
              ],
              "english": [
                "Generally, the mother has the primary right of custody for young children.",
                "In this Hadith, the child chose the mother, which the Prophet ﷺ approved.",
                "A mother's mercy and affection are vital for a child's development."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچے کی افادیت",
              "english": "Utility of the Child"
            },
            "content": {
              "urdu": [
                "عورت نے ذکر کیا کہ بچہ اسے پانی لا کر دیتا ہے اور کام میں مدد کرتا ہے۔",
                "بچے کی خدمت گزاری بھی اس کے والدین کے ساتھ تعلق کی ایک بنیاد ہے۔",
                "اسلام والدین کو اولاد سے نفع حاصل کرنے کا حق دیتا ہے۔"
              ],
              "english": [
                "The woman mentioned the son helps her with chores and fetching water.",
                "The child's helpfulness is also a basis for their bond with parents.",
                "Islam grants parents the right to benefit from their children's assistance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی و شرعی حکمت",
        "english": "Judicial and Shariah Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرعہ اندازی کا متبادل",
              "english": "Alternative to Drawing Lots"
            },
            "content": {
              "urdu": [
                "بعض روایات میں ایسے معاملات میں قرعہ اندازی کا ذکر بھی ملتا ہے۔",
                "لیکن جہاں بچہ باشعور ہو، وہاں اس کا انتخاب ہی حتمی فیصلہ بنتا ہے۔",
                "یہ طریقہ کار نزاع اور جھگڑے کو خوش اسلوبی سے ختم کرتا ہے۔"
              ],
              "english": [
                "Some narrations mention drawing lots in such complicated disputes.",
                "However, if the child is discerning, their choice becomes the final decision.",
                "This method gracefully ends disputes and arguments between parties."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاکم کا کردار",
              "english": "Role of the Ruler/Judge"
            },
            "content": {
              "urdu": [
                "حاکمِ وقت کو چاہیے کہ وہ خاندانی معاملات میں نرمی اور بصیرت سے کام لے۔",
                "فیصلہ کرتے وقت فریقین کے جذبات اور بچے کی تربیت کا لحاظ رکھا جائے۔",
                "سنتِ نبوی ﷺ ہمیں صلح اور باہمی اطمینان کی راہ دکھاتی ہے۔"
              ],
              "english": [
                "The ruler or judge must handle family matters with kindness and insight.",
                "Emotions of the parties and the child's upbringing must be considered.",
                "The Prophetic Sunnah guides us towards reconciliation and mutual satisfaction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اولاد کی ذمہ داری",
              "english": "Responsibility of Offspring"
            },
            "content": {
              "urdu": [
                "بچوں کو چاہیے کہ وہ اپنے والدین (بالخصوص ماں) کی کاموں میں مدد کریں۔",
                "پانی بھر کر لانا اور چھوٹے موٹے کام کرنا صحابہ کے بچوں کا شیوہ تھا۔",
                "نیک اولاد والدین کے لیے دنیا میں بھی سکون کا باعث ہوتی ہے۔"
              ],
              "english": [
                "Children should assist their parents, especially their mothers, in chores.",
                "Fetching water and helping with small tasks was common among Sahaba's children.",
                "Righteous offspring are a source of peace for parents in this world."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی نظامِ عدل",
              "english": "Islamic System of Justice"
            },
            "content": {
              "urdu": [
                "اسلام ہر کمزور (عورت اور بچہ) کو اپنا حق مانگنے کی ہمت دیتا ہے۔",
                "دربارِ رسالت میں ایک عام عورت بھی اپنا مسئلہ پیش کر سکتی تھی۔",
                "حق کا فیصلہ بغیر کسی جانبداری کے فوری طور پر کیا گیا۔"
              ],
              "english": [
                "Islam empowers every weak person (woman or child) to seek their rights.",
                "In the Prophetic court, even an ordinary woman could present her case.",
                "The rightful decision was made promptly without any partiality."
              ]
            }
          }
        ]
      }
    }
  ]
}