{
  "hadithId": 721,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/7/721"],
    "kitabId": 7,
    "inKitabBab": 5,
    "arabicBook": "كتاب البيوع",
    "babId": 46
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2387).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری نے اسے اپنی صحیح (2387) میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2387)."
  },
  "importantWords": [
    {
      "arabic": "أَمْوَالَ",
      "english": "Wealth / Money",
      "urdu": "اموال / مال"
    },
    {
      "arabic": "يُرِيدُ",
      "english": "Intends / Wants",
      "urdu": "ارادہ رکھتا ہے"
    },
    {
      "arabic": "أَدَاءَهَا",
      "english": "Its repayment",
      "urdu": "اس کی ادائیگی"
    },
    {
      "arabic": "إِتْلَافَهَا",
      "english": "Its destruction / wasting",
      "urdu": "اس کا ضیاع / تلف کرنا"
    },
    {
      "arabic": "أَتْلَفَهُ",
      "english": "He destroyed him",
      "urdu": "اسے ضائع کر دیا"
    }
  ],
  "summary": {
    "urdu": "قرض کے معاملات میں نیت کا بڑا دخل ہے؛ نیک نیت مقروض کی اللہ مدد فرماتا ہے جبکہ بد نیت شخص دنیا و آخرت میں نقصان اٹھاتا ہے۔",
    "english": "Intention plays a crucial role in debts; Allah helps those who intend to repay, while those with bad intentions face ruin."
  },
  "references": [
    {
      "arabic": "رواه البخاري في كتاب في الاستقراض (2387)",
      "english": "Reported by Al-Bukhari in the Book of Borrowing (2387)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Xh0lP9m5l_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نیت کی اہمیت",
        "english": "The Power of Intention"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادائیگی کا ارادہ",
              "english": "Intention to Repay"
            },
            "content": {
              "urdu": [
                "نیک نیت مقروض کے لیے اللہ غیبی راستے پیدا فرما دیتا ہے۔",
                "اللہ تعالیٰ اس کے رزق میں برکت دیتا ہے تاکہ قرض اتر سکے۔",
                "اگر وہ مر جائے تو اللہ اسے آخرت میں معاف فرما دے گا۔"
              ],
              "english": [
                "Allah creates unseen paths for a debtor with sincere intentions.",
                "Allah grants barakah in his sustenance to facilitate repayment.",
                "If he dies before paying, Allah may settle it for him on Judgement Day."
              ]
            }
          },
          {
            "title": {
              "urdu": "بد نیتی کا انجام",
              "english": "Consequences of Bad Intent"
            },
            "content": {
              "urdu": [
                "جو شخص مال ہضم کرنے کی نیت رکھتا ہے وہ ملعون ہے۔",
                "بد نیتی برکت کو ختم کر دیتی ہے اور تنگی لاتی ہے۔",
                "ایسا شخص دنیا میں رسوا اور آخرت میں جوابدہ ہو گا۔"
              ],
              "english": [
                "One who intends to devour others' wealth is cursed and deprived.",
                "Bad intentions eliminate blessings and lead to financial hardship.",
                "Such a person faces humiliation in this world and accountability in the next."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرض اور برکت",
        "english": "Debt and Blessings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی نصرت",
              "english": "Divine Assistance"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے خوشخبری دی کہ اللہ ایسے شخص کا ضامن ہے۔",
                "قرض کی ادائیگی کے لیے کوشش کرنا ایمان کا حصہ ہے۔",
                "اللہ کے بھروسے پر لیا گیا قرض کبھی بوجھ نہیں بنتا۔"
              ],
              "english": [
                "The Prophet (ﷺ) gave glad tidings that Allah guarantees his support.",
                "Striving to pay back one's debt is a branch of true faith.",
                "Debts taken with trust in Allah never become an unbearable burden."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کا ضیاع",
              "english": "Wasting Wealth"
            },
            "content": {
              "urdu": [
                "دوسروں کے مال کو حقیر سمجھنا ہلاکت کا باعث ہے۔",
                "امانت میں خیانت کرنے والے سے اللہ ناراض ہوتا ہے۔",
                "جان بوجھ کر تاخیر کرنا بھی بد نیتی کی ایک علامت ہے۔"
              ],
              "english": [
                "Treating others' wealth with disregard leads to total destruction.",
                "Allah is displeased with those who betray financial trusts.",
                "Deliberate delay in repayment is also a sign of bad intention."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اخلاقیات",
        "english": "Social Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی شفافیت",
              "english": "Financial Transparency"
            },
            "content": {
              "urdu": [
                "قرض لیتے وقت تمام شرائط واضح ہونی چاہئیں۔",
                "مسلم معاشرے میں لین دین کی بنیاد بھروسے پر ہے۔",
                "دیانتداری سے باہمی تعلقات اور محبت میں اضافہ ہوتا ہے۔"
              ],
              "english": [
                "All terms should be clear when entering into a debt agreement.",
                "Transactions in a Muslim society are built on the foundation of trust.",
                "Honesty strengthens social bonds and increases mutual affection."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی پاسداری",
              "english": "Fulfilling Human Rights"
            },
            "content": {
              "urdu": [
                "بندوں کے حقوق کی ادائیگی اللہ کے ہاں بہت اہم ہے۔",
                "کسی کا حق مارنا اپنی عاقبت خراب کرنے کے مترادف ہے۔",
                "قرض کی واپسی کو صدقہ سے افضل سمجھنا چاہیے۔"
              ],
              "english": [
                "Fulfilling the rights of people is paramount in the eyes of Allah.",
                "Usurping someone's right is equivalent to destroying one's afterlife.",
                "Repaying a debt should be prioritized over voluntary charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت",
        "english": "Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرض سے بچنے کی دعا",
              "english": "Dua to Avoid Debt"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو بلا ضرورت قرض سے بچنا چاہیے۔",
                "نبی ﷺ کثرت سے قرض سے پناہ مانگا کرتے تھے۔",
                "سادگی اختیار کرنے سے انسان قرض کی ضرورت سے بچتا ہے۔"
              ],
              "english": [
                "Muslims should avoid taking loans without extreme necessity.",
                "The Prophet (ﷺ) frequently sought refuge from the burden of debt.",
                "Adopting simplicity helps a person avoid the need for borrowing."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمہ دارانہ رویہ",
              "english": "Responsible Behavior"
            },
            "content": {
              "urdu": [
                "جب ادائیگی کی قدرت ہو تو فوراً قرض ادا کریں۔",
                "ٹال مٹول کرنا ظلم کے دائرے میں آتا ہے۔",
                "اپنے وارثوں کو قرض کی وصیت کرنا ضروری ہے۔"
              ],
              "english": [
                "Repay the debt immediately once you have the means to do so.",
                "Procrastination in repayment is categorized as a form of injustice.",
                "It is essential to inform and instruct heirs regarding outstanding debts."
              ]
            }
          }
        ]
      }
    }
  ]
}