{
  "hadithId": 490,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1573"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1573)، والدارقطني (2/103). وقد اختلف في رفعه ووقفه، والراجح وقفه على علي رضي الله عنه، وصحح ابن حبان رفعه. والمعنى مجمع عليه عند أكثر أهل العلم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (1573) اور دارقطنی نے روایت کیا ہے۔ اگرچہ اس کے مرفوع (نبی ﷺ کا قول) یا موقوف (صحابی کا قول) ہونے میں اختلاف ہے، مگر اس کا مفہوم جمہور علماء کے نزدیک متفق علیہ اور درست ہے۔",
    "english": "Sahih. Reported by Abu Dawud (1573) and ad-Daraqutni (2/103). While there is a difference of opinion on whether it is Marfu' or Muwquf, the legal meaning is agreed upon by the majority of scholars."
  },
  "importantWords": [
    {
      "arabic": "اَلْبَقَرِ",
      "english": "Cattle / Oxen",
      "urdu": "بیل / گائے"
    },
    {
      "arabic": "اَلْعَوَامِلِ",
      "english": "Working / Laboring",
      "urdu": "کام کرنے والے"
    },
    {
      "arabic": "صَدَقَةٌ",
      "english": "Zakat",
      "urdu": "زکوٰۃ"
    },
    {
      "arabic": "وَقْفُهُ",
      "english": "Muwquf (Stopped at companion)",
      "urdu": "موقوف ہونا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے یہ شرعی قاعدہ معلوم ہوتا ہے کہ وہ جانور جو تجارت یا افزائش کے بجائے محنت مشقت اور کام کاج (مثلاً ہل چلانے یا بوجھ ڈھونے) کے لیے پالے جائیں، ان پر زکوٰۃ واجب نہیں ہوتی۔",
    "english": "This Hadith establishes the juristic rule that livestock used for labor (such as plowing or carrying loads) rather than for trade or breeding are exempt from Zakat."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1573)",
      "english": "Sunan Abu Dawud (1573)"
    },
    {
      "arabic": "سنن الدارقطني (2/103)",
      "english": "Sunan ad-Daraqutni (2/103)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_R_AAnM",
  "grade": {
    "arabic": "صحيح (موقوفاً)",
    "english": "Sahih (as a Muwquf narration)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کام کرنے والے جانوروں پر زکوٰۃ کا حکم",
        "english": "Ruling on Working Animals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عوامل (Working Animals) کی تعریف",
              "english": "Definition of 'Awamil'"
            },
            "content": {
              "urdu": [
                "عوامل سے مراد وہ جانور ہیں جن سے کھیتی باڑی، بوجھ ڈھونے یا پانی نکالنے کا کام لیا جاتا ہے۔",
                "ایسے جانور انسان کی بنیادی ضرورت (حاجتِ اصلیہ) میں شمار ہوتے ہیں۔",
                "چونکہ یہ جانور 'مالِ نامی' (بڑھنے والا مال) نہیں بلکہ آلاتِ پیداوار ہیں، اس لیے ان پر زکوٰۃ نہیں۔"
              ],
              "english": [
                "Awamil refers to animals used for farming, carrying loads, or drawing water.",
                "These animals are categorized as basic necessities of the owner.",
                "Since they are tools of production rather than growing assets, they are exempt from Zakat."
              ]
            }
          },
          {
            "title": {
              "urdu": "زکوٰۃ کے وجوب کی شرائط",
              "english": "Conditions for Zakat Obligation"
            },
            "content": {
              "urdu": [
                "مویشیوں پر زکوٰۃ تب واجب ہوتی ہے جب وہ 'سائمہ' ہوں، یعنی سال کا اکثر حصہ مفت چراگاہوں میں چریں۔",
                "وہ جانور جو کام کے لیے استعمال ہوں یا جنہیں مالک خود چارہ کھلائے، ان پر جانوروں والی زکوٰۃ نہیں ہوتی۔",
                "یہ اسلام کے معاشی نظام میں کسانوں اور محنت کشوں کے لیے ایک بڑی رعایت ہے۔"
              ],
              "english": [
                "Zakat on livestock applies when they are 'Sa'imah' (grazing freely for most of the year).",
                "Animals used for labor or those that are stall-fed by the owner are not subject to livestock Zakat.",
                "This serves as a significant concession for farmers and laborers in the Islamic economic system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Views of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Majority Position"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ، شافعی اور احمد کے نزدیک کام کرنے والے بیلوں اور اونٹوں پر زکوٰۃ نہیں۔",
                "ان کے نزدیک زکوٰۃ کا مقصد اضافی اور نفع بخش مال میں سے غریبوں کا حق نکالنا ہے۔",
                "ضرورت کے سامان پر زکوٰۃ نہ ہونا شریعت کی آسانی کی دلیل ہے۔"
              ],
              "english": [
                "Imams Abu Hanifa, Shafi'i, and Ahmad hold that no Zakat is due on working cattle or camels.",
                "They view Zakat as a right of the poor taken from surplus and productive wealth.",
                "Exempting necessities from Zakat demonstrates the ease provided by Shariah."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام مالک کا منفرد موقف",
              "english": "Imam Malik's Unique View"
            },
            "content": {
              "urdu": [
                "امام مالک کے نزدیک مویشیوں پر زکوٰۃ واجب ہے چاہے وہ کام کرتے ہوں یا نہ کرتے ہوں۔",
                "تاہم، اکثر اہل علم نے اس حدیث اور دیگر آثار کی بنا پر جمہور کے قول کو ترجیح دی ہے۔",
                "دلائل کی رو سے وہی قول مضبوط ہے جو محنت کش جانوروں کو مستثنیٰ قرار دیتا ہے۔"
              ],
              "english": [
                "Imam Malik views Zakat as obligatory on livestock regardless of whether they work.",
                "However, most scholars prefer the majority view based on this Hadith and other reports.",
                "Evidence strongly supports the exemption of labor-intensive animals."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور میں اطلاق",
        "english": "Modern Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشینری اور آلات",
              "english": "Machinery and Tools"
            },
            "content": {
              "urdu": [
                "جس طرح کام کرنے والے بیلوں پر زکوٰۃ نہیں، اسی طرح کسان کے ٹریکٹر اور فیکٹری کی مشینوں پر زکوٰۃ نہیں۔",
                "زکوٰۃ ان مشینوں سے حاصل ہونے والی آمدنی (اگر وہ نصاب کو پہنچے) پر ہوگی، نہ کہ مشینوں کی قیمت پر۔",
                "یہ اصول ہر دور کے پیشہ ورانہ آلات اور ٹولز پر لاگو ہوتا ہے۔"
              ],
              "english": [
                "Just as working oxen are exempt, a farmer's tractor or factory machines are exempt from Zakat.",
                "Zakat is due on the income generated by these machines, not on the value of the machines themselves.",
                "This principle applies to professional equipment and tools in every era."
              ]
            }
          },
          {
            "title": {
              "urdu": "پیشہ ورانہ سہولیات",
              "english": "Professional Utilities"
            },
            "content": {
              "urdu": [
                "ذاتی سواری، رہنے کا گھر اور کام کرنے کے ذرائع زکوٰۃ سے پاک رکھے گئے ہیں۔",
                "اسلامی معیشت میں پیداواری صلاحیت کو بڑھانے کے لیے ان چیزوں پر ٹیکس کا بوجھ نہیں ڈالا گیا۔",
                "یہ نظام معاشی ترقی اور خوشحالی میں معاون ثابت ہوتا ہے۔"
              ],
              "english": [
                "Personal transport, residential homes, and means of livelihood are kept free from Zakat.",
                "Islamic economics avoids placing tax burdens on items that enhance productive capacity.",
                "This system supports economic growth and overall prosperity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شریعت کا اعتدال",
              "english": "Moderation of Shariah"
            },
            "content": {
              "urdu": [
                "اسلامی احکامات انسانی فطرت اور ضرورت کے عین مطابق ہیں۔",
                "اللہ تعالیٰ بندوں پر وہ بوجھ نہیں ڈالتا جو ان کے لیے تنگی کا باعث بنے۔",
                "زکوٰۃ کا نظام حق اور ضرورت کے درمیان بہترین توازن قائم کرتا ہے۔"
              ],
              "english": [
                "Islamic rulings are perfectly aligned with human nature and necessity.",
                "Allah does not impose burdens that cause undue hardship for His servants.",
                "The Zakat system establishes a perfect balance between rights and needs."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی دیانت",
              "english": "Intellectual Honesty"
            },
            "content": {
              "urdu": [
                "حدیث کے مرفوع یا موقوف ہونے کی تحقیق محدثین کی باریک بینی کو ظاہر کرتی ہے۔",
                "موقوف روایت بھی صحابہ کے فہم اور سنت کی عملی تشریح کی وجہ سے حجت ہے۔",
                "دین کو سمجھنے کے لیے مستند مآخذ اور اہل علم کی طرف رجوع کرنا لازمی ہے۔"
              ],
              "english": [
                "Investigating whether a Hadith is Marfu' or Muwquf shows the precision of Hadith scholars.",
                "A Muwquf report is authoritative as it represents the Companions' understanding and practical application of Sunnah.",
                "It is essential to refer to authentic sources and scholars to understand the religion."
              ]
            }
          }
        ]
      }
    }
  ]
}