{
  "hadithId": 897,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/96"],
    "kitabId": 8,
    "inKitabBab": 5,
    "arabicBook": "كتاب النكاح",
    "babId": 68
  },
  
  "takhreej": {
    "arabic": "مرسل صحيح. رواه البخاري (5172). صفية بنت شيبة تابعية، لكن الحديث له شواهد صحيحة من حديث أنس وغيره في الصحيحين تقوي معناه.",
    "urdu": "یہ روایت مرسل ہے (کیونکہ صفیہ بنت شیبہ تابعیہ ہیں) مگر صحیح بخاری (5172) میں موجود ہے اور دیگر صحیح احادیث (مثلاً سیدنا انس کی روایات) اس کے مفہوم کی تائید کرتی ہیں۔",
    "english": "Sahih Mursal. Reported by al-Bukhari (5172). Safiyyah bint Shaibah is a Tabi'un, but the Hadith has authentic supporting narrations from Anas and others in Sahihayn that strengthen its meaning."
  },
  "importantWords": [
    {
      "arabic": "أَوْلَمَ",
      "english": "Gave a wedding feast",
      "urdu": "ولیمہ کیا"
    },
    {
      "arabic": "بِمُدَّيْنِ",
      "english": "Two Mudds (approx 1.25 kg)",
      "urdu": "دو مد (ایک پیمانہ)"
    },
    {
      "arabic": "شَعِيرٍ",
      "english": "Barley",
      "urdu": "جو"
    }
  ],
  "summary": {
    "urdu": "ولیمہ کرنا سنت ہے، اور یہ ضروری نہیں کہ وہ بہت بڑے پیمانے پر ہو؛ سادہ غذا اور تھوڑی مقدار میں بھی ولیمہ کی سنت پوری ہو جاتی ہے۔",
    "english": "Performing Walimah is Sunnah, and it is not required to be on a large scale; the Sunnah can be fulfilled even with simple food and small quantities."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5172)",
      "english": "Sahih al-Bukhari (5172)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "صفية بنت شيبة",
        "english": "Safiyyah bint Shaibah"
      },
      "slug": "safiyyah-bint-shaibah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ولیمہ میں سادگی کا نمونہ",
        "english": "Model of Simplicity in Walimah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کم سے کم مقدار",
              "english": "Minimum Quantity"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے صرف دو مد (تقریباً سوا کلو) جو سے ولیمہ کر کے ثابت کیا کہ اصل مقصد اعلانِ نکاح اور برکت ہے۔",
                "ولیمہ کے لیے گوشت کا ہونا ضروری نہیں، بلکہ جو میسر ہو اس سے دعوت کی جا سکتی ہے۔",
                "اسلام نے غریبوں کے لیے بھی سنت پر عمل کرنا آسان بنا دیا ہے۔"
              ],
              "english": [
                "By giving a Walimah with only two Mudds of barley, the Prophet (ﷺ) proved that the core purpose is the announcement of marriage and seeking blessings.",
                "Meat is not a mandatory requirement for Walimah; any available food can be used for the feast.",
                "Islam has made it easy even for the less wealthy to follow this Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکلف سے گریز",
              "english": "Avoiding Formalities"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کی زندگی میں کسی بھی نکاح پر اسراف یا دکھاوا نہیں پایا گیا۔",
                "آج کل کی شاہانہ تقریبات اور قرض لے کر کیے جانے والے ولیمے سنت کے خلاف ہیں۔",
                "سادگی میں ہی اصل سکون اور گھریلو زندگی کی برکت پوشیدہ ہے۔"
              ],
              "english": [
                "No instance of extravagance or ostentation was found in any of the Prophet's (ﷺ) marriages.",
                "Modern-day lavish ceremonies and taking loans for Walimah are contrary to the Sunnah.",
                "True peace and domestic blessings are hidden in simplicity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ولیمہ کی شرعی حیثیت",
        "english": "Sharia Status of Walimah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ مؤکدہ",
              "english": "Emphasized Sunnah"
            },
            "content": {
              "urdu": [
                "ولیمہ کرنا سنتِ مؤکدہ ہے اور یہ نکاح کے اعلان کا ایک بہترین ذریعہ ہے۔",
                "مرد کو چاہیے کہ اپنی استطاعت کے مطابق ولیمہ کرے، چاہے وہ ایک بکری ہو یا صرف کھجوریں۔",
                "نبی کریم ﷺ نے صحابہ کو بھی ولیمہ کی تاکید فرمائی، جیسے عبدالرحمن بن عوف کو فرمایا: 'ولیمہ کرو، چاہے ایک بکری ہی کیوں نہ ہو'۔"
              ],
              "english": [
                "Walimah is a Sunnah Mu'akkadah and serves as an excellent means of announcing the marriage.",
                "A man should perform Walimah according to his means, whether it is a sheep or just dates.",
                "The Prophet (ﷺ) also urged his Companions, like Abdur-Rahman bin Auf: 'Give a Walimah, even if it is with a single sheep'."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی تعیین",
              "english": "Timing of Walimah"
            },
            "content": {
              "urdu": [
                "ولیمہ عموماً رخصتی یا شبِ زفاف کے بعد ہوتا ہے۔",
                "اس کا وقت رخصتی کے فوراً بعد سے شروع ہو کر تین دن تک مستحب مانا جاتا ہے۔",
                "تاہم، اگر کوئی مجبوری ہو تو نکاح کے بعد کسی بھی وقت کیا جا سکتا ہے۔"
              ],
              "english": [
                "Walimah usually takes place after the consummation of marriage or the wedding night.",
                "The recommended time starts immediately after the consummation and can last up to three days.",
                "However, if there is a necessity, it can be performed at any time after the marriage contract."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قناعت اور شکر گزاری",
              "english": "Contentment and Gratitude"
            },
            "content": {
              "urdu": [
                "جو کے دو مد جیسی معمولی چیز پر خوش ہونا اور اسے بطورِ ضیافت پیش کرنا عظیم اخلاق ہے۔",
                "مومن کو دستیاب نعمتوں پر شکر ادا کرنا چاہیے اور برتر سماجی معیاروں کا دباؤ نہیں لینا چاہیے۔",
                "خوشی کا تعلق دل کے سکون سے ہے نہ کہ مہنگے کھانوں سے۔"
              ],
              "english": [
                "Being happy with something as small as two Mudds of barley and presenting it as a feast shows great character.",
                "A believer should be grateful for available blessings and not feel pressured by high social standards.",
                "Happiness is related to inner peace, not expensive meals."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اصلاح",
              "english": "Social Reform"
            },
            "content": {
              "urdu": [
                "یہ حدیث ان لوگوں کے لیے مشعلِ راہ ہے جو مہر اور ولیمے کے اخراجات کی وجہ سے نکاح میں تاخیر کرتے ہیں۔",
                "ہمیں نبوی سادگی کو رواج دے کر معاشرے سے غربت اور بے راہ روی کا خاتمہ کرنا چاہیے۔",
                "اسلامی معاشرت کی بنیاد ہی سہولت اور ایک دوسرے کے لیے آسانی پیدا کرنے پر ہے۔"
              ],
              "english": [
                "This Hadith is a beacon for those who delay marriage due to Mahr and Walimah expenses.",
                "We should revive Prophetic simplicity to eliminate poverty and immorality from society.",
                "The foundation of Islamic social life is based on convenience and creating ease for one another."
              ]
            }
          }
        ]
      }
    }
  ]
}