{
  "hadithId": 1095,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/16"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },

  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (2670)، والترمذي (1583) وصححه، وأحمد (20134). وفي سنده الحسن البصري وقد عنعن عن سمرة، ومصطلح 'شيوخ' هنا يقصد به أصحاب الرأي والتدبير في الحرب.",
    "urdu": "ضعیف۔ اسے ابوداؤد (2670) اور ترمذی (1583) نے روایت کیا ہے۔ امام ترمذی نے اسے صحیح کہا ہے، مگر اس کی سند میں حسن بصری کی سمرہ سے روایت 'عنعنہ' کی وجہ سے ضعیف ہے، تاہم دیگر دلائل سے اس کا معنی واضح ہے۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (2670), At-Tirmidhi (1583) who graded it Sahih, and Ahmad (20134). The chain contains Al-Hasan Al-Basri who narrated with 'An' (ambiguity), and scholars clarify that 'old men' here refers to those who provide military strategy."
  },
  "importantWords": [
    {
      "arabic": "اُقْتُلُوا",
      "english": "Kill",
      "urdu": "قتل کرو"
    },
    {
      "arabic": "شُيُوخَ",
      "english": "Old men / Leaders",
      "urdu": "بوڑھے / سردار"
    },
    {
      "arabic": "وَاسْتَبْقُوا",
      "english": "Spare / Keep alive",
      "urdu": "باقی رہنے دو / زندہ چھوڑو"
    },
    {
      "arabic": "شَرْخَهُمْ",
      "english": "Their youth",
      "urdu": "ان کے نوجوان"
    },
    {
      "arabic": "الْمُشْرِكِينَ",
      "english": "Polytheists",
      "urdu": "مشرکین"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں جنگ کے دوران دشمن کے ان بوڑھوں کو قتل کرنے کا حکم ہے جو جنگی حکمت عملی میں شریک ہوں، جبکہ کم عمر نوجوانوں کو قتل کرنے سے منع کیا گیا ہے۔",
    "english": "This Hadith instructs killing the elderly enemies who contribute to military strategy while sparing the youth who have not yet participated in the war."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2670)",
      "english": "Narrated by Abu Dawud (2670)"
    },
    {
      "arabic": "رواه الترمذي (1583)",
      "english": "Narrated by At-Tirmidhi (1583)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لفظ 'شیوخ' کی مراد",
        "english": "The Meaning of 'Shuyukh'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنگی تدبیر اور مشورہ",
              "english": "War Strategy and Counsel"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک اس حدیث میں بوڑھوں سے مراد وہ لوگ ہیں جو جنگی ماہر ہوں۔",
                "وہ بوڑھے جو اپنی رائے اور مشورے سے مسلمانوں کے خلاف جنگ کو تقویت دیں۔",
                "عام بوڑھے جو لڑائی کے قابل نہ ہوں اور نہ مشورہ دیں، وہ اس حکم سے خارج ہیں۔"
              ],
              "english": [
                "Jurists state that 'old men' here refers to those who are military experts.",
                "It applies to those who strengthen the war against Muslims through their advice.",
                "Common elderly who are unable to fight and do not advise are excluded from this."
              ]
            }
          },
          {
            "title": {
              "urdu": "معصوموں سے استثناء",
              "english": "Exclusion of Innocents"
            },
            "content": {
              "urdu": [
                "اسلامی جنگی قوانین میں بوڑھوں، بچوں اور عورتوں کا قتل عام حالات میں ممنوع ہے۔",
                "یہ حدیث اس قاعدے کی وضاحت ہے کہ قتل کا معیار صرف عمر نہیں بلکہ شرکت ہے۔",
                "اگر کوئی بوڑھا عملی طور پر فتنہ پیدا کرے تو اسے کیفرِ کردار تک پہنچایا جائے گا۔"
              ],
              "english": [
                "In Islamic rules of war, killing elders, children, and women is generally forbidden.",
                "This Hadith clarifies that the criteria for combat is participation, not just age.",
                "If an elderly person actively creates strife, they shall face the legal consequences."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نوجوانوں کو زندہ رکھنا",
        "english": "Sparing the Youth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اصلاح اور دعوت کا موقع",
              "english": "Chance for Reform and Dawah"
            },
            "content": {
              "urdu": [
                "نوجوانوں اور بچوں کو زندہ رکھنے کا مقصد انہیں اسلام کی دعوت دینا ہے۔",
                "چھوٹی عمر کے لوگ تعصبات سے پاک ہوتے ہیں اور حق کو جلد قبول کرتے ہیں۔",
                "اسلام دشمنی کے خاتمے کے لیے نئی نسل کی ذہنی تربیت کو ترجیح دیتا ہے۔"
              ],
              "english": [
                "The purpose of sparing the youth and children is to invite them to Islam.",
                "Younger people are often free from prejudices and accept the truth more readily.",
                "Islam prioritizes training the new generation to end future hostilities."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستقبل کی افرادی قوت",
              "english": "Future Human Resource"
            },
            "content": {
              "urdu": [
                "نوجوانوں کو قتل نہ کرنا اس لیے بھی ہے کہ وہ مستقبل میں کارآمد شہری بن سکیں۔",
                "اسلامی ریاست ان کی تعلیم و تربیت کی ذمہ داری اٹھا کر انہیں بدلا جا سکتا ہے۔",
                "جنگ کا مقصد انسانی نسل کشی نہیں بلکہ نظامِ عدل کا قیام ہے۔"
              ],
              "english": [
                "Not killing the youth ensures they can become useful citizens in the future.",
                "By taking responsibility for their education, the Islamic state can reform them.",
                "The objective of war is establishing justice, not carrying out genocide."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنگی اخلاقیات",
        "english": "Ethics of Warfare"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توازن اور انصاف",
              "english": "Balance and Justice"
            },
            "content": {
              "urdu": [
                "اسلامی نظامِ جنگ غصے اور انتقام کے بجائے ضابطوں کے تابع ہوتا ہے۔",
                "صرف ان کو نشانہ بنایا جاتا ہے جو عملاً اسلام کے خلاف سرگرمِ عمل ہوں۔",
                "بے گناہ لوگوں کا خون بہانا اسلام کے بنیادی نظریات کے سخت خلاف ہے۔"
              ],
              "english": [
                "The Islamic system of war is subject to regulations, not anger or revenge.",
                "Only those who are actively working against Islam are targeted in battle.",
                "Shedding the blood of innocent people is strictly against basic Islamic ideologies."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکیمانہ پالیسی",
              "english": "Wise Policy"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کی یہ پالیسی دور اندیشی اور انسانیت پر مبنی تھی۔",
                "دشمن کے دماغ (بوڑھے مفکرین) کو ختم کرنا عسکری ضرورت ہو سکتی ہے۔",
                "دشمن کے مستقبل (نوجوانوں) کو بچانا ایک عظیم سماجی اور دینی مصلحت ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) policy was based on profound foresight and humanity.",
                "Neutralizing the enemy's strategic minds can be a military necessity.",
                "Saving the enemy's future (the youth) is a great social and religious benefit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور عملی سبق",
        "english": "Educational and Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیقِ حدیث کی اہمیت",
              "english": "Importance of Hadith Research"
            },
            "content": {
              "urdu": [
                "اس حدیث کی سند ضعیف ہے، اس لیے اسے اکیلے حکم کے لیے استعمال نہیں کیا جائے گا۔",
                "دیگر صحیح احادیث کے ساتھ ملا کر اس کا صحیح مفہوم واضح ہوتا ہے۔",
                "طالب علم کو چاہیے کہ وہ حدیث کے الفاظ کے ساتھ اس کی فنی حیثیت بھی دیکھے۔"
              ],
              "english": [
                "The chain of this Hadith is weak, so it won't be used alone for rulings.",
                "Its correct meaning becomes clear when combined with other authentic Hadiths.",
                "A student must look at the technical status of a Hadith along with its wording."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانیت کا احترام",
              "english": "Respect for Humanity"
            },
            "content": {
              "urdu": [
                "اسلام جنگ میں بھی دشمن کے حقوق اور انسانیت کا خیال رکھنے کی تعلیم دیتا ہے۔",
                "بلاوجہ کسی کی جان لینا شریعت میں پسندیدہ عمل نہیں ہے۔",
                "نبی ﷺ کی زندگی ہمیں ہر حال میں عدل و رحمت کا راستہ دکھاتی ہے۔"
              ],
              "english": [
                "Islam teaches consideration for the enemy's rights and humanity even in war.",
                "Taking a life without a valid reason is not a preferred act in Sharia.",
                "The Prophet's (ﷺ) life shows us the path of justice and mercy in every state."
              ]
            }
          }
        ]
      }
    }
  ]
}