{
  "hadithId": 1326,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/96"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 106
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (55)، وأبو داود (4944)، والنسائي (7/156)، وأحمد (4/102).",
    "urdu": "صحیح۔ اسے امام مسلم (55) نے روایت کیا ہے۔ یہ حدیث دین کے جامع ترین اصولوں میں سے ایک ہے۔",
    "english": "Sahih. Reported by Muslim (55), Abu Dawud, and An-Nasa'i. This Hadith is considered one of the most comprehensive pillars of faith."
  },
  "importantWords": [
    {
      "arabic": "النَّصِيحَةُ",
      "english": "Sincerity / Well-wishing",
      "urdu": "خیر خواہی / اخلاص"
    },
    {
      "arabic": "لِكِتَابِهِ",
      "english": "To His Book",
      "urdu": "اس کی کتاب کے لیے"
    },
    {
      "arabic": "لِأَئِمَّةِ",
      "english": "To the leaders",
      "urdu": "آئمہ (رہنماؤں) کے لیے"
    },
    {
      "arabic": "عَامَّتِهِمْ",
      "english": "The common folk",
      "urdu": "ان کے عام لوگ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ دین صرف رسومات کا نام نہیں بلکہ اللہ، اس کے رسول، قرآن اور پوری انسانیت کے ساتھ مخلصانہ تعلق اور خیر خواہی کا نام ہے۔",
    "english": "This Hadith clarifies that religion is not merely rituals but sincere devotion and well-wishing toward Allah, His Messenger, the Quran, and all of humanity."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الإيمان، باب بيان أن الدين النصيحة، رقم 55",
      "english": "Sahih Muslim, Book of Faith, No. 55"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "تميم بن أوس الداري",
        "english": "Tamim bin Aws ad-Dari"
      },
      "slug": "tamim-ad-dari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نصیحت (خیر خواہی) کا مفہوم",
        "english": "Meaning of Nasihah (Sincerity)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جامع لفظ 'نصیحت'",
              "english": "The Comprehensive Term 'Nasihah'"
            },
            "content": {
              "urdu": [
                "عربی زبان میں 'نصیحت' کا مطلب صرف وعظ کرنا نہیں بلکہ خلوصِ دل سے کسی کا بھلا چاہنا اور اس کے حق میں کھوٹ سے پاک ہونا ہے۔",
                "نبی ﷺ نے اسے تین بار دہرا کر اس کی اہمیت کو اجاگر کیا کہ پورے دین کا خلاصہ یہی ایک صفت ہے۔",
                "یہ صفت انسان کے ایمان کو محض زبانی دعووں سے نکال کر عملی زندگی میں لے آتی ہے۔"
              ],
              "english": [
                "In Arabic, 'Nasihah' implies more than just advice; it means being sincere and pure-hearted toward something or someone.",
                "The Prophet (ﷺ) repeated it thrice to emphasize that the essence of the entire religion is contained in this quality.",
                "This trait transitions faith from mere verbal claims into practical action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ، کتاب اور رسول کے لیے خیر خواہی",
        "english": "Sincerity to Allah, His Book, and His Messenger"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کے تقاضے",
              "english": "Requirements of Faith"
            },
            "content": {
              "urdu": [
                "اللہ کے لیے خیر خواہی کا مطلب اس کی توحید پر یقین رکھنا، اس کی عبادت میں کسی کو شریک نہ کرنا اور اس کی اطاعت کرنا ہے۔",
                "کتاب (قرآن) کے لیے خیر خواہی اسے کلام الہی ماننا، اس کی تلاوت کرنا، اسے سمجھنا اور اس کے احکامات پر عمل کرنا ہے۔",
                "رسول ﷺ کے لیے خیر خواہی آپ کی سنت کی اتباع کرنا، آپ سے محبت کرنا اور آپ کے لائے ہوئے پیغام کو پھیلانا ہے۔"
              ],
              "english": [
                "Sincerity to Allah means believing in His Oneness, not associating partners with Him, and obeying His commands.",
                "Sincerity to His Book means believing it is the Word of Allah, reciting it, understanding it, and acting upon its rulings.",
                "Sincerity to His Messenger means following his Sunnah, loving him, and spreading his message."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمرانوں اور عام مسلمانوں کے لیے خیر خواہی",
        "english": "Sincerity to Leaders and Common Muslims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "ائمہ (حکمرانوں) کے لیے خیر خواہی یہ ہے کہ حق بات میں ان کا ساتھ دیا جائے اور اگر وہ غلطی کریں تو حکمت کے ساتھ ان کی اصلاح کی جائے۔",
                "عام مسلمانوں کے لیے خیر خواہی یہ ہے کہ ان کے دکھ سکھ میں شریک ہوں، ان کے عیب چھپائیں اور ان کے لیے وہی پسند کریں جو اپنے لیے پسند کرتے ہیں۔",
                "یہ اصول معاشرے میں طبقاتی دشمنی کو ختم کر کے باہمی ہمدردی اور وحدت پیدا کرتا ہے۔"
              ],
              "english": [
                "Sincerity to leaders involves supporting them in truth and correcting them with wisdom if they err.",
                "Sincerity to common Muslims means sharing their joys and sorrows, concealing their faults, and wishing for them what you wish for yourself.",
                "This principle eradicates class animosity and fosters mutual empathy and unity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ اور عملی سبق",
        "english": "Summary and Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین کا نچوڑ",
              "english": "The Essence of Religion"
            },
            "content": {
              "urdu": [
                "یہ حدیث سکھاتی ہے کہ ایک مسلمان کو صرف اپنی ذات تک محدود نہیں رہنا چاہیے بلکہ اسے پورے معاشرے کا خیر خواہ ہونا چاہیے۔",
                "اگر ہم ہر معاملے میں مخلص ہو جائیں تو ہماری عبادتیں اور معاملات دونوں سنور سکتے ہیں۔",
                "خلوص اور بے غرضی ہی وہ بنیاد ہے جس پر ایک مثالی اسلامی معاشرہ قائم ہو سکتا ہے۔"
              ],
              "english": [
                "This Hadith teaches that a Muslim should not be self-centered but should be a well-wisher for the whole society.",
                "If we become sincere in every matter, our worship and our dealings will both improve.",
                "Sincerity and altruism are the foundations upon which an ideal Islamic society is built."
              ]
            }
          }
        ]
      }
    }
  ]
}