{
  "hadithId": 639,
  "hadithNo": 33,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:1211n"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح مسلم (1211)، كتاب الحج، باب بيان وجوه الإحرام وأنه يجوز الإفراد والقران والتمتع",
    "urdu": "صحیح مسلم (1211)، کتاب الحج، باب: احرام کی اقسام کا بیان اور یہ کہ افراد، قران اور تمتع سب جائز ہیں۔",
    "english": "Sahih Muslim (1211), Book of Hajj, Chapter: Explanation of the types of Ihram."
  },
  "importantWords": [
    {
      "arabic": "طَوَافُكِ",
      "english": "Your Tawaf",
      "urdu": "تمہارا طواف"
    },
    {
      "arabic": "يَكْفِيكَ",
      "english": "Sufficient for you",
      "urdu": "تمہیں کافی ہے"
    },
    {
      "arabic": "الصَّفَا وَاَلْمَرْوَةِ",
      "english": "Safa and Marwa",
      "urdu": "صفا اور مروہ"
    },
    {
      "arabic": "حَجِّكِ",
      "english": "Your Hajj",
      "urdu": "تمہارا حج"
    },
    {
      "arabic": "عُمْرَتِكِ",
      "english": "Your Umrah",
      "urdu": "تمہارا عمرہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث حجِ قران کرنے والے کے لیے یہ بیان کرتی ہے کہ ایک ہی طواف اور ایک ہی سعی حج اور عمرہ دونوں کی طرف سے کافی ہو جاتی ہے۔",
    "english": "This Hadith establishes that for a person performing Hajj al-Qiran, one Tawaf and one Sa'i suffice for both Hajj and Umrah."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1211)",
      "english": "Reported by Muslim (1211)"
    },
    {
      "arabic": "سنن أبي داود (1897)",
      "english": "Sunan Abi Dawud (1897)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=J3mR2I5J6Q4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حج قران کی فضیلت",
        "english": "Excellence of Hajj al-Qiran"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حج اور عمرہ کا ملاپ",
              "english": "Combining Hajj and Umrah"
            },
            "content": {
              "urdu": [
                "حج قران میں حاجی حج اور عمرہ دونوں کی نیت ایک ساتھ کرتا ہے۔",
                "اس صورت میں ایک ہی عمل دونوں عبادات کے لیے کفایت کر جاتا ہے۔",
                "یہ اللہ تعالیٰ کی طرف سے بندوں کے لیے ایک عظیم آسانی ہے۔"
              ],
              "english": [
                "In Hajj al-Qiran, the pilgrim intends both Hajj and Umrah together.",
                "In this case, a single set of rituals suffices for both acts of worship.",
                "This is a great ease provided by Allah for His servants."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعمال کا تداخل",
              "english": "Overlapping of Rituals"
            },
            "content": {
              "urdu": [
                "جب عمرہ حج میں داخل ہو جائے تو الگ الگ سعی کی ضرورت نہیں رہتی۔",
                "نبی کریم صلی اللہ علیہ وسلم نے سیدہ عائشہ کو اسی رعایت کی خبر دی تھی۔",
                "یہ حکم ان لوگوں کے لیے ہے جو قربانی کا جانور ساتھ لاتے ہیں۔"
              ],
              "english": [
                "When Umrah is incorporated into Hajj, separate Sa'i is not required.",
                "The Prophet (PBUH) informed Lady Aishah of this specific concession.",
                "This ruling applies to those who bring their sacrificial animal with them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدہ عائشہ کا واقعہ",
        "english": "The Incident of Lady Aishah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عذر کی حالت میں حکم",
              "english": "Ruling in Case of Excuse"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ رضی اللہ عنہا کو ایامِ حج میں حیض آ گیا تھا جس سے وہ عمرہ نہ کر سکیں۔",
                "نبی کریم صلی اللہ علیہ وسلم نے انہیں عمرہ کو حج میں شامل کرنے کا حکم دیا۔",
                "یہ حدیث خواتین کے لیے مخصوص فقہی مسائل میں ایک بنیادی دلیل ہے۔"
              ],
              "english": [
                "Lady Aishah (R.A) experienced menses during Hajj and couldn't perform Umrah separately.",
                "The Prophet (PBUH) instructed her to merge her Umrah into her Hajj.",
                "This Hadith is a primary evidence for juristic issues related to women."
              ]
            }
          },
          {
            "title": {
              "urdu": "طمانیتِ قلب",
              "english": "Peace of Mind"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ پریشان تھیں کہ ان کا عمرہ رہ گیا ہے مگر آپ نے تسلی دی۔",
                "آپ صلی اللہ علیہ وسلم نے واضح کیا کہ حج کا طواف عمرہ کے لیے بھی کافی ہے۔",
                "اسلامی تعلیمات انسان کو نفسیاتی بوجھ سے نکال کر راحت فراہم کرتی ہیں۔"
              ],
              "english": [
                "Lady Aishah was worried about missing her Umrah, but the Prophet comforted her.",
                "He clarified that the Hajj circumambulation is sufficient for Umrah as well.",
                "Islamic teachings provide relief by removing psychological burdens from believers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات",
        "english": "Juristic Differences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ائمہ کے موقف",
              "english": "Positions of the Imams"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک قارن کے لیے ایک ہی طواف اور سعی ہے۔",
                "امام ابوحنیفہ کے نزدیک قارن کو دو طواف اور دو سعی کرنی چاہئیں۔",
                "جمہور فقہاء اس حدیث کو اپنی دلیل کے طور پر پیش کرتے ہیں۔"
              ],
              "english": [
                "According to Shafi'i and Ahmad, a Qarin performs only one Tawaf and Sa'i.",
                "Imam Abu Hanifa views that a Qarin must perform two of each.",
                "The majority of jurists present this Hadith as their primary evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث کی ترجیح",
              "english": "Precedence of Hadith"
            },
            "content": {
              "urdu": [
                "صحیح مسلم کی یہ روایت واضح طور پر ایک سعی کے کافی ہونے کو بیان کرتی ہے۔",
                "فقہی آراء پر صحیح اور صریح حدیث کو ترجیح دینا سنت کا تقاضا ہے۔",
                "اس سے دین میں مروج آسانیوں پر عمل کرنے کی ترغیب ملتی ہے۔"
              ],
              "english": [
                "This narration in Sahih Muslim clearly states that one Sa'i is sufficient.",
                "Prioritizing authentic Hadith over juristic opinions is a requirement of Sunnah.",
                "This encourages practicing the facilitations established within the religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی فوائد",
        "english": "Educational and Moral Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیت کی اہمیت",
              "english": "Importance of Intention"
            },
            "content": {
              "urdu": [
                "اعمال کا دارومدار نیت پر ہے، نیت بدلنے سے حکم بدل جاتا ہے۔",
                "سیدہ عائشہ نے عمرہ سے حجِ قران کی طرف نیت بدلی تو عمل سہل ہو گیا۔",
                "مومن کو حالات کے مطابق شرعی رخصتوں سے فائدہ اٹھانا چاہیے۔"
              ],
              "english": [
                "Actions are judged by intentions; changing intention changes the ruling.",
                "When Lady Aishah shifted to Hajj al-Qiran, the rituals became easier.",
                "A believer should utilize Sharia concessions according to their circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں غلو سے بچاؤ",
              "english": "Avoiding Extremism in Religion"
            },
            "content": {
              "urdu": [
                "عبادت میں بلاوجہ کی مشقت ڈالنا مطلوبِ شریعت نہیں ہے۔",
                "نبی کریم صلی اللہ علیہ وسلم نے ہمیشہ امت کے لیے آسانی کو پسند فرمایا۔",
                "یہ حدیث دین کے معتدل اور آسان ہونے کی ایک روشن مثال ہے۔"
              ],
              "english": [
                "Imposing unnecessary hardship in worship is not sought by Sharia.",
                "The Prophet (PBUH) always preferred ease for his Ummah.",
                "This Hadith is a shining example of the balanced and easy nature of religion."
              ]
            }
          }
        ]
      }
    }
  ]
}  