{
  "hadithId": 1035,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/10/2"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },

  "takhreej": {
    "arabic": " صحيح.‏ رواه مسلم (1690).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح میں روایت کیا ہے۔ یہ حدیث سورہ نساء کی آیت 15 کی وضاحت میں نازل ہوئی جہاں اللہ نے فرمایا تھا کہ اللہ ان عورتوں کے لیے کوئی راستہ نکالے گا۔",
    "english": "Sahih (Authentic). Reported by Muslim (1690). This Hadith explains the 'way' mentioned in Surah An-Nisa (4:15) regarding the punishment for illegal sexual intercourse."
  },
  "importantWords": [
    {
      "arabic": "خُذُوا عَنِّي",
      "english": "Take from me / Learn from me",
      "urdu": "مجھ سے لے لو / سیکھ لو"
    },
    {
      "arabic": "سَبِيلاً",
      "english": "A way / A path",
      "urdu": "راستہ"
    },
    {
      "arabic": "الْبِكْرُ",
      "english": "Unmarried / Virgin",
      "urdu": "کنوارہ / غیر شادی شدہ"
    },
    {
      "arabic": "نَفْيُ سَنَةٍ",
      "english": "Exile for a year",
      "urdu": "ایک سال کی جلاوطنی"
    },
    {
      "arabic": "الثَّيِّبُ",
      "english": "Married person",
      "urdu": "شادی شدہ"
    },
    {
      "arabic": "الرَّجْمُ",
      "english": "Stoning to death",
      "urdu": "رجم کرنا / سنگسار کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں زنا کی شرعی سزا (حد) بیان کی گئی ہے، جس میں غیر شادی شدہ کے لیے سو کوڑے اور جلاوطنی، جبکہ شادی شدہ کے لیے رجم کا حکم ہے۔",
    "english": "This Hadith specifies the legal penalties (Hudud) for adultery and fornication, distinguishing between unmarried and married offenders."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1690)",
      "english": "Reported by Muslim (1690)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبادة بن الصامت",
        "english": "Ubadah bin As-Samit"
      },
      "slug": "ubadah-bin-as-samit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Jb-DqIq8X9o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیر شادی شدہ کی سزا",
        "english": "Punishment for Unmarried"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سو کوڑوں کی حد",
              "english": "Hundred Lashes"
            },
            "content": {
              "urdu": [
                "غیر شادی شدہ مرد اور عورت اگر زنا کے مرتکب ہوں تو ان پر سو کوڑے واجب ہیں۔",
                "یہ سزا قرآن مجید کی سورہ نور میں صراحت کے ساتھ بیان کی گئی ہے۔",
                "اس سزا کا مقصد معاشرے میں بے حیائی کو روکنا اور مجرم کی تادیب ہے۔"
              ],
              "english": [
                "Unmarried men and women who commit fornication must be lashed 100 times.",
                "This specific punishment is explicitly mentioned in Surah An-Nur of the Quran.",
                "The goal is to curb immorality and serve as a disciplinary measure for the offender."
              ]
            }
          },
          {
            "title": {
              "urdu": "جلاوطنی کا حکم",
              "english": "Expulsion from Country"
            },
            "content": {
              "urdu": [
                "کوڑوں کے ساتھ ایک سال کے لیے شہر بدر کرنا بھی سنتِ نبوی سے ثابت ہے۔",
                "جلاوطنی کا مقصد مجرم کو اس کے برے ماحول سے دور کر کے اصلاح کرنا ہے۔",
                "فقہاء کے نزدیک یہ سزا حالات اور حاکم کی صوابدید پر منحصر ہو سکتی ہے۔"
              ],
              "english": [
                "Expulsion for one year along with lashing is established from the Sunnah.",
                "Exile aims to remove the offender from an evil environment for reform.",
                "According to jurists, this may depend on circumstances and the ruler's discretion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شادی شدہ کی سزا (رجم)",
        "english": "Punishment for Married (Rajm)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رجم کی شرعی حیثیت",
              "english": "Legal Status of Rajm"
            },
            "content": {
              "urdu": [
                "شادی شدہ زانی کے لیے رجم یعنی سنگسار کرنے کی سزا مقرر کی گئی ہے۔",
                "اگرچہ یہ قرآن میں تلاوت نہیں ہوتی، مگر سنتِ متواترہ سے قطعی ثابت ہے۔",
                "شادی شدہ ہونے کے باوجود ایسا فعل خاندانی نظام کی جڑوں کو کاٹنا ہے۔"
              ],
              "english": [
                "Stoning to death (Rajm) is prescribed for married persons who commit adultery.",
                "Though not recited in the Quran now, it is established through mass-narrated Sunnah.",
                "Committing such an act despite being married destroys the foundation of family."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزا میں سختی کی وجہ",
              "english": "Reason for Severity"
            },
            "content": {
              "urdu": [
                "شادی شدہ کو پاکدامنی کا ذریعہ میسر ہونے کے باوجود جرم کرنا اسے سنگین بناتا ہے۔",
                "یہ سخت سزا معاشرے کی اخلاقی بقا اور نسب کے تحفظ کے لیے ضروری ہے۔",
                "اسلام نے حدود اللہ کے نفاذ میں کسی قسم کی نرمی سے منع فرمایا ہے۔"
              ],
              "english": [
                "Having a lawful outlet for desire makes the crime of a married person more grave.",
                "This severe penalty is vital for moral survival and protecting lineage.",
                "Islam forbids showing undue leniency in implementing the prescribed limits (Hudud)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ثبوت اور گواہی کے شرائط",
        "english": "Conditions of Proof and Witness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار گواہوں کی ضرورت",
              "english": "Requirement of Four Witnesses"
            },
            "content": {
              "urdu": [
                "زنا کی حد جاری کرنے کے لیے چار عادل مرد گواہوں کی عینی شہادت لازمی ہے۔",
                "گواہی میں معمولی شک بھی سزا کو ساقط کر دیتا ہے، جو اسلام کا عدل ہے۔",
                "اگر گواہ جھوٹے ثابت ہوں تو ان پر قذف (تہمت) کی حد جاری ہوتی ہے۔"
              ],
              "english": [
                "Executing the limit for adultery requires eye-witness testimony of four just men.",
                "Even a slight doubt in the testimony waives the penalty, showing Islamic justice.",
                "If witnesses are proven false, they are subject to the penalty for slander (Qadhf)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اقرارِ جرم",
              "english": "Confession"
            },
            "content": {
              "urdu": [
                "اگر مجرم چار بار اعتراف کرے تو بھی حد نافذ کی جا سکتی ہے۔",
                "اعتراف کے بعد بھی اگر وہ توبہ کر کے بھاگنا چاہے تو اسے چھوڑا جا سکتا ہے۔",
                "اسلام کا مقصود ستر پوشی اور اصلاح ہے، محض تشہیر اور سزا نہیں۔"
              ],
              "english": [
                "If the offender confesses four times, the penalty can also be implemented.",
                "If they withdraw or flee after confession, they may be let go under certain rules.",
                "Islam aims for concealment and reform, not just publicity and punishment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد",
        "english": "Social Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عفت اور پاکدامنی",
              "english": "Chastity and Modesty"
            },
            "content": {
              "urdu": [
                "یہ سزائیں معاشرے کو جنسی آوارگی اور گندگی سے پاک رکھتی ہیں۔",
                "خوفِ سزا برائی کے خیالات کو عملی جامہ پہنانے سے روکتا ہے۔",
                "حیا پر مبنی معاشرہ ہی مستحکم اور پرامن زندگی فراہم کر سکتا ہے۔"
              ],
              "english": [
                "These penalties keep the society pure from sexual perversion and filth.",
                "Fear of punishment deters individuals from acting on immoral thoughts.",
                "A society based on modesty provides a stable and peaceful life for all."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسب کی حفاظت",
              "english": "Protection of Lineage"
            },
            "content": {
              "urdu": [
                "زنا سے نسب خلط ملط ہو جاتا ہے جس سے وراثت اور نکاح کے مسائل بنتے ہیں۔",
                "اسلام نے انسانی نسل کی پاکیزگی کو بچانے کے لیے یہ دیواریں کھڑی کی ہیں۔",
                "حدود اللہ کا احترام ہی انسانی وقار کا ضامن ہے۔"
              ],
              "english": [
                "Adultery confuses lineages, leading to issues in inheritance and marriage.",
                "Islam erected these barriers to protect the purity of the human race.",
                "Respect for Allah's limits is the ultimate guarantor of human dignity."
              ]
            }
          }
        ]
      }
    }
  ]
}