{
  "hadithId": 121,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["1:121"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "صحيح.  وهو موقوف.  رواه البخاري (326) ، وأبو داود (307) . وهو وإن كان موقوفاً على أم عطية، إلا أنه في حكم المرفوع لأنه في بيان حكم شرعي لا مجال للرأي فيه.",
    "urdu": "صحیح (درست) روایت۔ یہ موقوف (صحابی کا قول) ہے۔ اسے بخاری (326) اور ابو داؤد (307) نے روایت کیا ہے۔ اگرچہ یہ ام عطیہ رضی اللہ عنہا کا موقوف قول ہے، لیکن یہ حکماً مرفوع ہے کیونکہ یہ ایک ایسے شرعی حکم کے بارے میں ہے جس میں رائے کی گنجائش نہیں ہے۔",
    "english": "Sahih (Authentic). It is a Mawquf (statement of a Companion) narration. Reported by Al-Bukhari (326) and Abu Dawud (307). Although it is a statement stopped at Umm Atiyyah, it holds the ruling of a Marfu' (traced to the Prophet) narration because it relates to a legal ruling where personal opinion is not applicable."
  },
  "importantWords": [
    {
      "arabic": "اَلْكُدْرَةَ",
      "english": "Kuddrah (Brownish/Cloudy discharge)",
      "urdu": "گدلا مادہ"
    },
    {
      "arabic": "وَالصُّفْرَةَ",
      "english": "Sufrah (Yellowish discharge)",
      "urdu": "زرد مادہ"
    },
    {
      "arabic": "بَعْدَ اَلطُّهْرِ",
      "english": "After purification/purity",
      "urdu": "پاک ہونے کے بعد"
    },
    {
      "arabic": "شَيْئًا",
      "english": "Anything/of significance",
      "urdu": "کوئی چیز"
    },
    {
      "arabic": "لَا نَعُدُّ",
      "english": "We used not to consider",
      "urdu": "ہم نہیں گنتی تھیں"
    }
  ],
  "summary": {
    "urdu": "سیدہ ام عطیہ رضی اللہ عنہا کی گواہی کے مطابق، صحابیات حیض کے بعد مکمل پاکی حاصل کر لینے کے بعد خارج ہونے والے گدلے یا زرد رنگ کے مواد کو حیض کا حصہ نہیں سمجھتی تھیں اور اس کی وجہ سے نماز نہیں چھوڑتی تھیں۔",
    "english": "According to Umm Atiyyah's testimony, the female Companions did not consider the brownish (Kuddrah) or yellowish (Sufrah) discharge that appeared after achieving complete purity from menstruation as part of the menses, and thus did not stop praying because of it."
  },
  "references": [
    {
      "arabic": "رواه البخاري (326)",
      "english": "Reported by Al-Bukhari (326)"
    },
    {
      "arabic": "رواه أبو داود (307)",
      "english": "Reported by Abu Dawud (307)"
    }
  ],
  "narrators": [
    {
      "id": 12101,
      "name": {
        "arabic": "أُمُّ عَطِيَّةَ اَلْأَنْصَارِيَّةِ",
        "english": "Umm Atiyyah Al-Ansariyyah"
      },
      "slug": "umm-atiyyah-al-ansariyyah"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پاکی کی حتمی علامت",
        "english": "Final Sign of Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پاکی کی پہچان",
              "english": "Identification of Purity"
            },
            "content": {
              "urdu": [
                "حیض کے اختتام کی حتمی علامت سفید رطوبت کا نظر آنا یا مکمل خشکی ہے۔",
                "جب عورت پاک ہو جائے اور غسل کر لے، تو اس کے بعد خارج ہونے والا زرد یا گدلا پانی حیض نہیں ہے۔",
                "یہ اس بات کی دلیل ہے کہ مکمل پاکی حاصل کرنے کے بعد شک میں نہیں پڑنا چاہیے۔"
              ],
              "english": [
                "The final sign of the end of menses is the sighting of a white discharge or complete dryness.",
                "Once a woman has become pure and performed Ghusl, any subsequent yellowish or brownish discharge is not menses.",
                "This proves that one should not entertain doubts after achieving complete purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "گدلا اور زرد مادہ",
              "english": "Brownish and Yellowish Discharge"
            },
            "content": {
              "urdu": [
                "الکدرۃ (گدلا) اور الصفرۃ (زرد) حیض کے اختتامی دنوں میں عام طور پر نظر آتے ہیں۔",
                "اگر یہ مادہ حیض کے دنوں میں یا اس سے پہلے آئے تو یہ حیض شمار ہوتا ہے۔",
                "لیکن یہ حدیث خاص طور پر پاکی کے بعد کے احکام کو واضح کرتی ہے جو استحاضہ میں شامل ہے۔"
              ],
              "english": [
                "Kuddrah (brownish) and Sufrah (yellowish) discharges are commonly seen towards the end of menses.",
                "If this discharge appears during the days of menses or immediately before, it is counted as menses.",
                "However, this Hadith specifically clarifies the ruling for the period *after* purity, classifying it as Istihadah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اثرات",
        "english": "Juristic and Practical Implications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کا ترک نہ کرنا",
              "english": "Not Abandoning Worship"
            },
            "content": {
              "urdu": [
                "چونکہ یہ خارج ہونے والا مادہ حیض نہیں ہے، لہٰذا اس کی وجہ سے نماز، روزہ یا دیگر عبادات ترک نہیں کی جائیں گی۔",
                "یہ مادہ استحاضہ کے حکم میں آتا ہے اور اس کے لیے ہر نماز کے وقت وضو کر لینا کافی ہے۔",
                "اس حکم کا مقصد عورتوں کو غیر ضروری سختی اور عبادت سے محرومی سے بچانا ہے۔"
              ],
              "english": [
                "Since this discharge is not menses, worship like prayer or fasting should not be abandoned because of it.",
                "This discharge falls under the ruling of Istihadah, and performing Wudu for each prayer is sufficient.",
                "The purpose of this ruling is to protect women from unnecessary hardship and deprivation from worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "موقوف کی اہمیت",
              "english": "Importance of the Mawquf Narration"
            },
            "content": {
              "urdu": [
                "یہ روایت موقوف ہے، یعنی سیدہ ام عطیہ کا قول ہے، لیکن اس کی شرعی حیثیت مرفوع کے برابر ہے۔",
                "یہ اس لیے کہ حیض و طہارت کے احکام رائے یا قیاس پر مبنی نہیں ہوتے، بلکہ توقیفی (نبی ﷺ کی تعلیمات پر مبنی) ہوتے ہیں۔",
                "صحابہ کا متفقہ عمل اور قول نبی ﷺ کی سنت کے تابع ہی ہوتا ہے۔"
              ],
              "english": [
                "This narration is Mawquf (a Companion's statement), but its legal authority is equivalent to Marfu' (from the Prophet).",
                "This is because the rulings of menses and purity are not based on opinion but on Tawqifi (Prophetic teaching).",
                "The unanimous practice and statement of the Companions follow the Sunnah of the Prophet ﷺ."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پاکی اور حیض کی حدود",
        "english": "Boundaries of Purity and Menses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیض کی مدت کا اختتام",
              "english": "Conclusion of Menstrual Period"
            },
            "content": {
              "urdu": [
                "اس حدیث کا بنیادی حکم یہ ہے کہ عورت کو اپنے آپ کو مکمل پاک سمجھنا چاہیے جب وہ واضح طور پر پاکی کی علامت دیکھ لے۔",
                "اگر حیض کی عادت ختم ہو جائے اور خون کا بہاؤ رک جائے، تو معمولی گدلاہٹ طہارت کو متاثر نہیں کرتی۔",
                "پاکی کا حصول عبادت کے لیے لازمی ہے، اس لیے بلاوجہ تاخیر نہیں کرنی چاہیے۔"
              ],
              "english": [
                "The core ruling of this Hadith is that a woman must consider herself completely pure once she sees a clear sign of purity.",
                "If the menses habit ends and the flow of blood stops, minor brownish discharge does not affect the state of purity.",
                "Attaining purity is mandatory for worship, so one should not delay it without a valid reason."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط کا معیار",
              "english": "Standard of Precaution"
            },
            "content": {
              "urdu": [
                "شریعت میں جہاں حیض کے خون میں بہت احتیاط کا حکم ہے، وہیں پاکی کے بعد آسانی بھی فراہم کی گئی ہے۔",
                "ضرورت سے زیادہ احتیاط (یعنی زردی کو حیض سمجھنا) مشقت کا باعث بن سکتا ہے جو دین میں ناپسندیدہ ہے۔",
                "عورتوں کو یہ پہچان ہونی چاہیے کہ ان کا حقیقی حیض کب ختم ہوتا ہے۔"
              ],
              "english": [
                "While Sharia mandates high caution regarding menstrual blood, it also provides ease after purity is attained.",
                "Excessive precaution (considering yellowness as menses) can lead to undue hardship, which is discouraged in religion.",
                "Women must be able to recognize when their actual menstrual period has ended."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت اور نماز",
        "english": "Purity and Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کا وقت فوت نہ کرنا",
              "english": "Not Missing Prayer Time"
            },
            "content": {
              "urdu": [
                "اس اصول پر عمل کرنے سے عورتیں نماز کا وقت فوت ہونے سے بچ سکتی ہیں، خواہ ہلکا مادہ آ رہا ہو۔",
                "طہارت کے بعد غسل کر کے نماز پڑھنا لازم ہے اور اس معاملے میں لاپرواہی نہیں ہونی چاہیے۔",
                "گدلے مادہ کو حیض سمجھ کر نماز چھوڑنا صحیح نہیں ہے۔"
              ],
              "english": [
                "Adhering to this principle helps women avoid missing prayer times, even if a slight discharge occurs.",
                "It is obligatory to perform Ghusl after purity and start praying, and negligence in this matter is unacceptable.",
                "It is incorrect to consider brownish discharge as menses and consequently abandon prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی زندگی میں نفاذ",
              "english": "Implementation in Daily Life"
            },
            "content": {
              "urdu": [
                "عورتوں کو چاہیے کہ وہ حیض کی عادت اور پہچان کو اچھی طرح یاد رکھیں۔",
                "مکمل پاکی کے بعد، اگر نماز کے دوران زرد یا گدلا مادہ خارج ہو تو وہ وضو کے ٹوٹنے کا سبب بنے گا، نہ کہ حیض کا۔",
                "یہ حکم طہارت کے دائمی مسائل (استحاضہ وغیرہ) کے بارے میں رہنمائی فراہم کرتا ہے۔"
              ],
              "english": [
                "Women should carefully remember their menstrual habit and its characteristics.",
                "After complete purity, if yellowish or brownish discharge appears during prayer, it only breaks Wudu, not the state of purity from menses.",
                "This ruling provides guidance regarding continuous issues of purity (Istihadah, etc.)."
              ]
            }
          }
        ]
      }
    }
  ]
}
