{
  "hadithId": 997,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/5"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },
 
  "takhreej": {
    "arabic": "صحيح بطرقه وشواهده. رواه أحمد (1/12)، والترمذي (1400)، وابن ماجه (2662)، وابن الجارود (788)، والبيهقي (8/38). وصححه الألباني في إرواء الغليل.",
    "urdu": "یہ حدیث اپنے طرق اور شواہد کی بنا پر صحیح ہے۔ اسے احمد، ترمذی، ابن ماجہ اور بیہقی نے روایت کیا ہے۔ امام ترمذی نے اس میں اضطراب کا ذکر کیا ہے مگر دیگر ائمہ نے اسے حسن و صحیح قرار دیا ہے۔",
    "english": "Sahih due to its multiple chains and supporting evidences. Reported by Ahmad (1/12), At-Tirmidhi (1400), Ibn Majah (2662), Ibn al-Jarud (788), and Al-Bayhaqi (8/38). Al-Albani graded it Sahih in Irwa al-Ghalil."
  },
  "importantWords": [
    {
      "arabic": "لَا يُقَادُ",
      "english": "Not to be executed in retaliation",
      "urdu": "قصاص نہیں لیا جائے گا"
    },
    {
      "arabic": "اَلْوَالِدُ",
      "english": "The father",
      "urdu": "باپ"
    },
    {
      "arabic": "بِالْوَلَدِ",
      "english": "For the son",
      "urdu": "بیٹے کے بدلے"
    },
    {
      "arabic": "مُضْطَرِبٌ",
      "english": "Inconsistent / Shaky chain",
      "urdu": "اضطراب والی حدیث"
    },
    {
      "arabic": "الْقِصَاص",
      "english": "Retaliation",
      "urdu": "قصاص / بدلہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں یہ فقہی قاعدہ بیان کیا گیا ہے کہ اگر کوئی باپ اپنے بیٹے کو قتل کر دے تو اس سے قصاص (سزائے موت) نہیں لیا جائے گا، البتہ دیگر سزائیں دی جا سکتی ہیں۔",
    "english": "This Hadith establishes the juristic rule that a father is not subject to capital punishment (Qisas) for the killing of his son, though other penalties apply."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1400)",
      "english": "Reported by At-Tirmidhi (1400)"
    },
    {
      "arabic": "رواه ابن ماجه (2662)",
      "english": "Reported by Ibn Majah (2662)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R6w6e7pU678",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih lighairihi (Authentic due to external evidence)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور قصاص",
        "english": "Juristic Aspect and Qisas"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باپ کے لیے قصاص کی نفی",
              "english": "Exemption of Father from Qisas"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک باپ کو بیٹے کے قتل کے بدلے قتل نہیں کیا جائے گا۔",
                "والد بچے کے وجود کا سبب ہے، اس لیے بچہ والد کے خاتمے کا سبب نہیں بنے گا۔",
                "یہ حکم ماں، دادا اور نانی وغیرہ پر بھی اسی طرح لاگو ہوتا ہے۔"
              ],
              "english": [
                "Majority of jurists agree that a father is not executed for killing his son.",
                "The father is the cause of the child's existence, so the child shouldn't cause his end.",
                "This ruling applies equally to mothers, grandfathers, and grandmothers."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیت اور تعزیری سزا",
              "english": "Diyyah and Ta'zir"
            },
            "content": {
              "urdu": [
                "قصاص نہ ہونے کا مطلب یہ نہیں کہ والد کو بالکل چھوڑ دیا جائے گا۔",
                "والد پر مقتول بیٹے کی دیت (خون بہا) اور کفارہ ادا کرنا لازم ہوگا۔",
                "حاکمِ وقت والد کو عبرت ناک تعزیری سزا (قید وغیرہ) دینے کا مجاز ہے۔"
              ],
              "english": [
                "No Qisas does not mean the father is exempt from all punishment.",
                "The father must pay blood money (Diyyah) and perform expiation (Kaffarah).",
                "The ruler can impose discretionary punishment (Ta'zir) like imprisonment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی فنی حیثیت",
        "english": "Technical Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اضطراب کی وضاحت",
              "english": "Explanation of Idtirab"
            },
            "content": {
              "urdu": [
                "امام ترمذی نے اس حدیث کے اسناد میں اختلاف کی وجہ سے اسے مضطرب کہا۔",
                "مگر کثرتِ طرق اور شواہد کی بنا پر اسے قبول کیا گیا ہے۔",
                "شریعت کے دیگر اصول بھی اس مفہوم کی تائید کرتے نظر آتے ہیں۔"
              ],
              "english": [
                "At-Tirmidhi called it 'Mudtarib' due to variations in its chain of narrators.",
                "However, it is accepted due to numerous supporting paths and evidences.",
                "Other principles of Shariah also seem to support this general meaning."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف",
              "english": "Juristic Difference"
            },
            "content": {
              "urdu": [
                "امام مالک کے نزدیک اگر باپ جان بوجھ کر ذبح کرے تو قصاص لیا جائے گا۔",
                "دیگر ائمہ اس حدیث کو عام رکھتے ہوئے ہر حال میں قصاص کی نفی کرتے ہیں۔",
                "یہ مسئلہ اسلامی قانونِ وراثت اور ولایت سے بھی گہرا تعلق رکھتا ہے۔"
              ],
              "english": [
                "Imam Malik holds that if a father slaughters his son deliberately, Qisas applies.",
                "Other Imams keep this Hadith general, denying Qisas in all such cases.",
                "This issue is closely linked to Islamic laws of inheritance and guardianship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "والدین کا مقام اور شفقت",
        "english": "Status of Parents and Compassion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری شفقت کا لحاظ",
              "english": "Regard for Natural Affection"
            },
            "content": {
              "urdu": [
                "والدین کی اولاد کے لیے شفقت ایک مسلمہ فطری حقیقت ہے۔",
                "قانون یہ فرض کرتا ہے کہ کوئی والدین بلاوجہ اپنی اولاد کو قتل نہیں کرتے۔",
                "اسی غیر معمولی رشتے کی بنیاد پر سزا میں تخفیف رکھی گئی ہے۔"
              ],
              "english": [
                "Parental affection for children is an established natural reality.",
                "The law assumes parents do not kill their children without extreme cause.",
                "Reduction in punishment is based on this extraordinary relationship."
              ]
            }
          },
          {
            "title": {
              "urdu": "ادب اور احترام",
              "english": "Etiquette and Respect"
            },
            "content": {
              "urdu": [
                "اسلام نے والدین کو انتہائی بلند مقام اور مرتبہ عطا کیا ہے۔",
                "اولاد کو والدین پر ہاتھ اٹھانے یا بدزبانی سے سختی سے روکا گیا ہے۔",
                "یہ حکم والدین کی اسی حرمت اور احترام کے باب سے تعلق رکھتا ہے۔"
              ],
              "english": [
                "Islam has granted parents an extremely high and noble status.",
                "Children are strictly forbidden from striking or insulting parents.",
                "This ruling relates to the sanctity and respect due to parents."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اسباق",
        "english": "Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کا تحفظ",
              "english": "Protection of Family System"
            },
            "content": {
              "urdu": [
                "اسلامی قوانین خاندانی ڈھانچے کو مضبوط بنانے کے لیے وضع کیے گئے ہیں۔",
                "والدین اور اولاد کے حقوق کا توازن معاشرے کے لیے ناگزیر ہے۔",
                "سزاؤں کا مقصد محض بدلہ لینا نہیں بلکہ انصاف اور اصلاح ہے۔"
              ],
              "english": [
                "Islamic laws are designed to strengthen the family structure.",
                "Balance between the rights of parents and children is vital for society.",
                "The goal of punishment is justice and reform, not just revenge."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبر اور ضبطِ نفس",
              "english": "Patience and Self-Control"
            },
            "content": {
              "urdu": [
                "شدید غصے کی حالت میں بھی والدین کو اپنے جذبات پر قابو رکھنا چاہیے۔",
                "اولاد کی تربیت میں سختی کی ایک حد مقرر کی گئی ہے۔",
                "ایمان کا تقاضا ہے کہ ہم ہر حال میں حدود اللہ کی پاسداری کریں۔"
              ],
              "english": [
                "Parents must control their emotions even in states of severe anger.",
                "There is a limit set for discipline in the upbringing of children.",
                "Faith requires us to uphold the boundaries of Allah in all situations."
              ]
            }
          }
        ]
      }
    }
  ]
}