{
  "hadithId": 1176,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/13/6"],
    "kitabId": 13,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 96
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6675) في كتاب الأيمان والنذور، باب اليمين الغموس، وأخرجه أيضاً في كتاب الديات.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری نے اپنی صحیح (حدیث: 6675) میں 'کتاب الایمان والنذور' کے تحت روایت کیا ہے۔ یہ گناہِ کبیرہ کی سنگینی پر واضح دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6675) in the Book of Oaths and Vows, Chapter: The Engulfing Oath. It is also recorded in the Book of Blood Money."
  },
  "importantWords": [
    {
      "arabic": "الْكَبَائِرُ",
      "english": "Major sins",
      "urdu": "کبیرہ گناہ"
    },
    {
      "arabic": "الْيَمِينُ",
      "english": "Oath",
      "urdu": "قسم"
    },
    {
      "arabic": "الْغَمُوسُ",
      "english": "Engulfing / Drowning",
      "urdu": "ڈبو دینے والی"
    },
    {
      "arabic": "يَقْتَطِعُ",
      "english": "Usurps / Takes away",
      "urdu": "کاٹ لینا / اڑا لینا"
    },
    {
      "arabic": "كَاذِبٌ",
      "english": "Liar / False",
      "urdu": "جھوٹا"
    }
  ],
  "summary": {
    "urdu": "یمینِ غموس وہ جھوٹی قسم ہے جس کے ذریعے کسی کا حق غصب کیا جائے؛ اسے 'غموس' اس لیے کہتے ہیں کیونکہ یہ انسان کو گناہ اور پھر جہنم میں ڈبو دیتی ہے۔",
    "english": "Al-Yamin al-Ghamus is a false oath used to seize someone's rights; it is called 'engulfing' because it drowns the person in sin and subsequently in Hellfire."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6675)",
      "english": "Sahih al-Bukhari (6675)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-As"
      },
      "slug": "abdullah-bin-amr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=f-w5oTndxR8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "یمینِ غموس کی حقیقت",
        "english": "Reality of Al-Yamin al-Ghamus"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعریف اور لغوی معنی",
              "english": "Definition and Literal Meaning"
            },
            "content": {
              "urdu": [
                "غموس کا لغوی مطلب کسی چیز کو پانی میں غوطہ دینا یا ڈبو دینا ہے۔",
                "شرعی اصطلاح میں جان بوجھ کر اللہ کے نام پر جھوٹی قسم کھانا غموس ہے۔",
                "اسے یہ نام اس لیے دیا گیا کیونکہ یہ قسم کھانے والے کو گناہ میں ڈبو دیتی ہے۔"
              ],
              "english": [
                "Literal meaning of Ghamus is to dip or submerge something in water.",
                "In Shariah, it is to intentionally take a false oath in Allah's name.",
                "It is named so because it drowns the swearer in deep sin and guilt."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہِ کبیرہ کی سنگینی",
              "english": "Severity of the Major Sin"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اسے شرک اور قتلِ ناحق جیسے بڑے گناہوں کے ساتھ ذکر کیا۔",
                "یہ اللہ کی عظمت کی توہین اور معاشرتی امن کے لیے شدید خطرہ ہے۔",
                "اس گناہ کی شدت کی وجہ سے اس کا کوئی شرعی کفارہ (روزہ یا صدقہ) نہیں ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) listed it alongside Shirk and unlawful killing of souls.",
                "It is an insult to Allah's Majesty and a threat to social peace.",
                "Due to its intensity, there is no formal expiation like fasting or charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حقوق العباد اور جھوٹی قسم",
        "english": "Human Rights and False Oaths"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالِ غصب کرنے کا جرم",
              "english": "Crime of Usurping Property"
            },
            "content": {
              "urdu": [
                "دوسرے مسلمان کا مال جھوٹی قسم کے ذریعے لینا حرام ترین عمل ہے۔",
                "عدالتوں میں جھوٹی گواہی اور قسم معاشرے کی بنیادیں کھوکھلی کر دیتی ہیں۔",
                "ایسا کرنے والا درحقیقت جہنم کا ایک ٹکڑا اپنے پیٹ میں بھر رہا ہے۔"
              ],
              "english": [
                "Seizing another Muslim's property via false oaths is a prohibited act.",
                "False testimony and oaths in courts hollow out the foundations of society.",
                "One who does this is actually filling their belly with a piece of Hellfire."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ کی شرائط",
              "english": "Conditions of Repentance"
            },
            "content": {
              "urdu": [
                "یمینِ غموس سے توبہ کے لیے صرف استغفار کرنا کافی نہیں ہے۔",
                "لازم ہے کہ جس کا حق مارا گیا ہے، اس کا مال اسے واپس کیا جائے۔",
                "مظلوم سے معافی مانگنا اور تلافی کرنا سچی توبہ کا لازمی جزو ہے۔"
              ],
              "english": [
                "Seeking forgiveness alone is not sufficient for repentance from Ghamus.",
                "It is mandatory to return the usurped property to its rightful owner.",
                "Asking the victim for forgiveness and redress is vital for true repentance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و روحانی احکام",
        "english": "Juristic and Spiritual Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفارہ کا مسئلہ",
              "english": "The Issue of Expiation"
            },
            "content": {
              "urdu": [
                "عام قسموں پر کفارہ ہوتا ہے مگر یمینِ غموس اس سے بہت بڑی ہے۔",
                "امام شافعی کے نزدیک اس میں بھی کفارہ ہے مگر جمہور کے نزدیک نہیں۔",
                "یہ اتنا بڑا جرم ہے کہ اس کی تلافی محض مالی جرمانے سے نہیں ہو سکتی۔"
              ],
              "english": [
                "Standard oaths have expiation, but Yamin al-Ghamus is far greater.",
                "Shafi'i view includes expiation, but the majority of Imams disagree.",
                "The crime is so immense that financial penalty alone cannot rectify it."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کا خسارہ",
              "english": "Loss in the Hereafter"
            },
            "content": {
              "urdu": [
                "جھوٹی قسم کھانے والے سے اللہ تعالیٰ قیامت کے دن کلام نہیں فرمائے گا۔",
                "اس کے لیے دردناک عذاب تیار کیا گیا ہے جو کبھی ختم نہیں ہوگا۔",
                "دنیا کا حقیر فائدہ آخرت کی ابدی زندگی کی تباہی کا سبب بنتا ہے۔"
              ],
              "english": [
                "Allah will not speak to the one who takes false oaths on Judgment Day.",
                "A painful punishment is prepared for them that will never conclude.",
                "Trivial worldly gains cause the destruction of the eternal Hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی سبق اور نصیحت",
        "english": "Ethical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "مومن کو ہر بات میں سچائی اور دیانت داری کا دامن تھامنا چاہیے۔",
                "زبان کا غلط استعمال انسان کو دنیا و آخرت میں رسوا کر دیتا ہے۔",
                "اللہ کے نام کی تعظیم کا تقاضا ہے کہ اسے جھوٹ کے لیے استعمال نہ کریں۔"
              ],
              "english": [
                "A believer must hold onto truth and integrity in every statement.",
                "Misuse of the tongue brings disgrace in both this world and the next.",
                "Revering Allah's name requires not using it to validate falsehood."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیانت دارانہ طرزِ عمل",
              "english": "Honest Conduct"
            },
            "content": {
              "urdu": [
                "رزقِ حلال کی طلب اور دوسروں کے حقوق کی پاسداری ایمان ہے۔",
                "ہمیں اپنے معاملات میں شفافیت اور انصاف کو برقرار رکھنا چاہیے۔",
                "جھوٹی قسم سے بچنا اللہ کے خوف اور تقویٰ کی واضح علامت ہے۔"
              ],
              "english": [
                "Seeking Halal sustenance and respecting others' rights is part of faith.",
                "We must maintain transparency and justice in all our dealings.",
                "Avoiding false oaths is a clear sign of the fear of Allah and piety."
              ]
            }
          }
        ]
      }
    }
  ]
}