{
  "hadithId": 1334,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/104"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2700).",
    "urdu": "صحیح۔ اسے امام مسلم (2700) نے روایت کیا ہے۔ اس حدیث میں ذکرِ الہی کی مجالس کی غیر معمولی فضیلت بیان کی گئی ہے۔",
    "english": "Sahih. Reported by Muslim (2700). This Hadith highlights the extraordinary virtues of gatherings dedicated to the remembrance of Allah."
  },
  "importantWords": [
    {
      "arabic": "حَفَّتْ",
      "english": "Surrounded",
      "urdu": "گھیر لیا / ہالہ بنا لیا"
    },
    {
      "arabic": "غَشِيَتْهُمُ",
      "english": "Covered them",
      "urdu": "انہیں ڈھانپ لیا"
    },
    {
      "arabic": "ذَكَرَهُمُ",
      "english": "Mentioned them",
      "urdu": "ان کا ذکر فرمایا"
    },
    {
      "arabic": "عِنْدَهُ",
      "english": "With Him (High Assembly)",
      "urdu": "اپنے پاس (مقرب فرشتوں میں)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اجتماعی ذکر اور دینی مجالس کی فضیلت بیان کرتی ہے کہ ایسی محافل میں شرکت کرنے والوں کو فرشتوں کی رفاقت، اللہ کی رحمت اور رب کی خوشنودی نصیب ہوتی ہے۔",
    "english": "This Hadith explains the excellence of collective remembrance and religious gatherings, promising participants the company of angels, Divine mercy, and mention by Allah Himself."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الذكر والدعاء والتوبة، رقم 2700",
      "english": "Sahih Muslim, Book of Remembrance, Supplication, Repentance and Seeking Forgiveness, No. 2700"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ذکر کی مجالس کے چار عظیم انعامات",
        "english": "Four Great Rewards of Gatherings of Dhikr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فرشتوں کا گھیر لینا",
              "english": "Surrounding by Angels"
            },
            "content": {
              "urdu": [
                "اللہ کے کچھ فرشتے دنیا میں ایسی محافل کو تلاش کرتے ہیں جہاں اللہ کا ذکر ہو رہا ہو۔",
                "جب وہ ایسی مجلس پا لیتے ہیں تو ایک دوسرے کو پکارتے ہیں اور آسمان تک اس محفل کو اپنے پروں سے ڈھانپ لیتے ہیں۔",
                "یہ فرشتوں کی رفاقت ذاکرین کے لیے سکون اور تحفظ کا باعث بنتی ہے۔"
              ],
              "english": [
                "Certain angels roam the earth specifically searching for gatherings where Allah is remembered.",
                "When they find such a gathering, they call out to one another and surround the participants with their wings up to the sky.",
                "This companionship of angels brings tranquility and spiritual protection to the participants."
              ]
            }
          },
          {
            "title": {
              "urdu": "رحمت اور سکینت کا نزول",
              "english": "Descent of Mercy and Tranquility"
            },
            "content": {
              "urdu": [
                "ایسی مجالس پر اللہ کی خاص رحمت سایہ فگن ہوتی ہے جو گناہوں کی بخشش اور دلوں کی نرمی کا سبب بنتی ہے۔",
                "سکینت سے مراد وہ باطنی اطمینان اور وقار ہے جو انسان کو دنیاوی فکروں سے آزاد کر دیتا ہے۔",
                "یہ سکون صرف ذکرِ الہی کی محافل میں ہی میسر آتا ہے جو روح کی غذا ہے۔"
              ],
              "english": [
                "Special Divine mercy overshadows such gatherings, leading to the forgiveness of sins and softening of hearts.",
                "Tranquility (Sakina) refers to inner peace and dignity that frees a person from worldly anxieties.",
                "This unique peace is found only in gatherings of remembrance, serving as nourishment for the soul."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کا اپنے پاس تذکرہ فرمانا",
        "english": "Allah Mentioning them in His Presence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلیٰ ترین اعزاز",
              "english": "The Highest Honor"
            },
            "content": {
              "urdu": [
                "سب سے بڑا انعام یہ ہے کہ کائنات کا خالق و مالک اپنے مقرب فرشتوں (ملاء اعلیٰ) میں ان بندوں کا نام لے کر ذکر کرتا ہے۔",
                "یہ اس بات کی دلیل ہے کہ اللہ اپنے ان بندوں سے خوش ہے جو غفلت کے اس دور میں اسے یاد رکھتے ہیں۔",
                "حدیث قدسی کے مطابق: 'اگر بندہ مجھے محفل میں یاد کرتا ہے تو میں اسے اس سے بہتر محفل میں یاد کرتا ہوں۔'"
              ],
              "english": [
                "The greatest reward is that the Creator of the universe mentions these servants by name among His chosen angels (the High Assembly).",
                "This is proof that Allah is pleased with those who remember Him in an age of heedlessness.",
                "According to a Hadith Qudsi: 'If my servant mentions Me in a gathering, I mention him in a gathering better than his.'"
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ذکر کا وسیع مفہوم",
        "english": "The Broad Meaning of Dhikr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کون سی مجالس مراد ہیں؟",
              "english": "Which Gatherings are Intended?"
            },
            "content": {
              "urdu": [
                "اس میں تسبیح و تہلیل کی محافل، قرآن کریم کے حلقہ ہائے درس اور دین سیکھنے سکھانے کی مجالس شامل ہیں۔",
                "ایسی ہر جگہ جہاں اللہ کی بڑائی بیان ہو اور اس کے احکامات پر بات ہو، وہ ذکر کی مجلس ہے۔",
                "حتیٰ کہ دو دوستوں کا آپس میں دین کی بات کرنا بھی اس فضیلت میں شامل ہو سکتا ہے۔"
              ],
              "english": [
                "This includes gatherings of Tasbih, Quranic study circles, and classes where religion is taught and learned.",
                "Any place where Allah's greatness is proclaimed and His commandments are discussed is a gathering of Dhikr.",
                "Even two friends discussing religious matters between themselves can be included in this virtue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اچھی صحبت اختیار کرنا",
              "english": "Adopting Good Company"
            },
            "content": {
              "urdu": [
                "ہمیں کوشش کرنی چاہیے کہ اپنا کچھ وقت ایسی نیکی کی محافل میں گزاریں تاکہ اللہ کی رحمتوں کے مستحق بن سکیں۔",
                "ایسی جگہوں پر بیٹھنے سے انسان کے ایمان میں تازگی پیدا ہوتی ہے اور برے کاموں سے نفرت ہوتی ہے۔",
                "تنہائی کے ذکر کے ساتھ ساتھ اجتماعی ذکر کی برکات سے بھی فائدہ اٹھانا چاہیے۔"
              ],
              "english": [
                "We should strive to spend some of our time in such virtuous gatherings to deserve Allah's mercies.",
                "Sitting in such places refreshes one's faith and fosters a dislike for sinful actions.",
                "Alongside individual remembrance, one should also benefit from the blessings of collective remembrance."
              ]
            }
          }
        ]
      }
    }
  ]
}