{
  "hadithId": 575,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/575"],
    "kitabId": 5,
    "inKitabBab": 3,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 35
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2015)، ومسلم (1165).",
    "urdu": "صحیح۔ اسے بخاری (2015) اور مسلم (1165) نے روایت کیا ہے۔ یہ حدیث شب قدر کے تعین کے حوالے سے ایک اہم بنیاد ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2015) and Muslim (1165)."
  },
  "importantWords": [
    {
      "arabic": "الْمَنَامِ",
      "english": "The Dream / Sleep",
      "urdu": "خواب / نیند"
    },
    {
      "arabic": "السَّبْعِ اَلْأَوَاخِرِ",
      "english": "Last seven nights",
      "urdu": "آخری سات راتیں"
    },
    {
      "arabic": "تَوَاطَأَتْ",
      "english": "Coincided / Agreed",
      "urdu": "موافق آئیں / متفق ہو گئیں"
    },
    {
      "arabic": "مُتَحَرِّيَهَا",
      "english": "Seeking it",
      "urdu": "اسے تلاش کرنے والا"
    },
    {
      "arabic": "رُؤْيَاكُمْ",
      "english": "Your dreams",
      "urdu": "تمہارے خواب"
    }
  ],
  "summary": {
    "urdu": "شب قدر رمضان کے آخری عشرے کی آخری سات راتوں میں ہونے کا قوی امکان ہے، جس کی تصدیق صحابہ کے خوابوں سے بھی ہوئی۔",
    "english": "Laylat al-Qadr is highly likely to be in the last seven nights of Ramadan, as corroborated by the collective dreams of the Sahaba."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2015)",
      "english": "Reported by Al-Bukhari (2015)"
    },
    {
      "arabic": "رواه مسلم (1165)",
      "english": "Reported by Muslim (1165)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar bin Al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=J_jKj8k7S_8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواب کی شرعی حیثیت اور شب قدر",
        "english": "Dreams in Shariah and Laylat al-Qadr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچے خوابوں کی اہمیت",
              "english": "Importance of True Dreams"
            },
            "content": {
              "urdu": [
                "صحابہ کرام کے خوابوں کا ایک ہی وقت پر متفق ہونا ان کے سچے ہونے کی علامت تھا۔",
                "نبی ﷺ نے ان خوابوں کی تصدیق فرمائی جس سے معلوم ہوا کہ اجتماعی خواب حقیقت پر مبنی ہو سکتے ہیں۔",
                "سچا خواب نبوت کے چھیالیسویں حصے میں سے ایک حصہ ہے۔"
              ],
              "english": [
                "The agreement of multiple companions' dreams on the same timing was a sign of their truthfulness.",
                "The Prophet (ﷺ) confirmed these dreams, showing that collective dreams can reflect reality.",
                "A true dream is considered one of the forty-six parts of Prophethood."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخری سات راتوں کی تخصیص",
              "english": "Specifying the Last Seven Nights"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے رہنمائی فرمائی کہ اگر پورا عشرہ تلاش نہ کر سکو تو آخری سات راتیں نہ چھوڑو۔",
                "یہ امت کے لیے اللہ کی طرف سے آسانی ہے تاکہ وہ اپنی محنت کو مرکوز کر سکیں۔",
                "ان سات راتوں میں طاق راتوں (23، 25، 27، 29) کی اہمیت سب سے زیادہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) guided that if one cannot seek it the whole decade, they shouldn't miss the last seven nights.",
                "This is a concession from Allah for the Ummah to focus their spiritual efforts.",
                "Among these seven, the odd nights (23rd, 25th, 27th, 29th) hold the greatest significance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شب قدر کا وقت اور تلاش",
        "english": "Timing and Seeking Laylat al-Qadr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کا اخفا اور اس کی حکمت",
              "english": "Hidden Timing and its Wisdom"
            },
            "content": {
              "urdu": [
                "شب قدر کا وقت متعین طور پر نہیں بتایا گیا تاکہ لوگ آخری تمام راتوں میں عبادت کریں۔",
                "اگر وقت معلوم ہوتا تو لوگ صرف اسی ایک رات پر اکتفا کر لیتے۔",
                "عبادت میں تجسس اور تلاش انسان کے روحانی درجات کو بلند کرتی ہے۔"
              ],
              "english": [
                "The exact timing is hidden so that believers exert effort throughout all the final nights.",
                "If the timing were fixed, people might have limited their worship to just that one night.",
                "The process of seeking and anticipation elevates a person's spiritual stations."
              ]
            }
          },
          {
            "title": {
              "urdu": "مختلف روایات میں تطبیق",
              "english": "Reconciliation of Narrations"
            },
            "content": {
              "urdu": [
                "کچھ روایات میں آخری عشرے، کچھ میں طاق راتوں اور کچھ میں سات راتوں کا ذکر ہے۔",
                "علماء کے نزدیک یہ رات ہر سال تبدیل ہو سکتی ہے، اس لیے ہر روایت اپنی جگہ درست ہے۔",
                "ان تمام روایات کا مجموعی مقصد آخری عشرے کی اہمیت کو اجاگر کرنا ہے۔"
              ],
              "english": [
                "Some narrations mention the last ten, some the odd nights, and some the last seven.",
                "Scholars suggest the night may shift each year, making each narration valid in its context.",
                "The collective goal of these reports is to highlight the sanctity of the final ten days."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عبادات اور معمولات",
        "english": "Worship and Routine"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تلاش کا صحیح طریقہ",
              "english": "The Correct Way to Seek"
            },
            "content": {
              "urdu": [
                "شب قدر کو تلاش کرنے کا مطلب راتوں کو جاگنا، نماز پڑھنا اور دعا کرنا ہے۔",
                "صرف بیدار رہنا کافی نہیں بلکہ اسے اللہ کے ذکر اور توبہ میں گزارنا ضروری ہے۔",
                "سیدہ عائشہ کو سکھائی گئی دعا 'اللهم إنك عفو...' ان راتوں کا بہترین وظیفہ ہے۔"
              ],
              "english": [
                "Seeking Laylat al-Qadr means spending the nights in prayer, recitation, and supplication.",
                "Merely staying awake is insufficient; the time must be spent in dhikr and repentance.",
                "The dua taught to Aisha (RA), 'O Allah, You are Forgiving...', is the best invocation for these nights."
              ]
            }
          },
          {
            "title": {
              "urdu": "انفرادی اور اجتماعی محنت",
              "english": "Individual and Collective Effort"
            },
            "content": {
              "urdu": [
                "صحابہ کا ایک دوسرے کو خواب بتانا اجتماعی خیر کی ترغیب دینے کا طریقہ تھا۔",
                "مسلمانوں کو چاہیے کہ ان راتوں میں ایک دوسرے کو عبادت کے لیے متحرک کریں۔",
                "گھر والوں اور بچوں کو بھی ان بابرکت لمحات میں شریک کرنا مسنون ہے۔"
              ],
              "english": [
                "The Sahaba sharing dreams was a way to encourage one another toward collective goodness.",
                "Muslims should motivate each other to remain steadfast in worship during these nights.",
                "Involving family members and children in these blessed moments is a Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی رحمت کی وسعت",
              "english": "Vastness of Allah's Mercy"
            },
            "content": {
              "urdu": [
                "ایک رات کی عبادت ہزار مہینوں سے بہتر ہونا اللہ کا عظیم تحفہ ہے۔",
                "اللہ چاہتا ہے کہ بندہ کسی بہانے بخشش کے قریب آ جائے۔",
                "شب قدر مومن کے لیے گناہوں سے پاک ہونے کا سالانہ موقع ہے۔"
              ],
              "english": [
                "One night's worship being better than a thousand months is a magnificent gift from Allah.",
                "Allah desires for His servants to find excuses to draw near to His forgiveness.",
                "Laylat al-Qadr is an annual opportunity for a believer to be cleansed of sins."
              ]
            }
          },
          {
            "title": {
              "urdu": "استقامت کا امتحان",
              "english": "Test of Steadfastness"
            },
            "content": {
              "urdu": [
                "رمضان کے آخر میں تھکاوٹ کے باوجود عبادت بڑھانا ایمان کا امتحان ہے۔",
                "نبی ﷺ کی سنت ہمیں سکھاتی ہے کہ اختتام جتنا قریب ہو، محنت اتنی زیادہ ہونی چاہیے۔",
                "کامیاب وہ ہے جو آخری لمحات تک اللہ کی رضا کی تلاش میں ثابت قدم رہے۔"
              ],
              "english": [
                "Increasing worship at the end of Ramadan despite fatigue is a test of faith.",
                "The Sunnah teaches that as the end approaches, the effort should intensify.",
                "Successful is the one who remains steadfast in seeking Allah's pleasure until the very end."
              ]
            }
          }
        ]
      }
    }
  ]
}