{
  "hadithId": 671,
  "hadithNo": 24,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2142"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح البخاري (2142)، كتاب البيوع، باب النجش؛ وصحيح مسلم (1516)، كتاب البيوع، باب تحريم النجش.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (2142) اور مسلم (1516) دونوں میں موجود ہے۔ نجش کا مطلب ہے کسی چیز کی قیمت میں محض دوسرے کو دھوکہ دینے کے لیے اضافہ کرنا جبکہ خریدنے کا ارادہ نہ ہو۔",
    "english": "Sahih al-Bukhari (2142) and Sahih Muslim (1516). Najsh refers to an artificial increase in the price of a commodity by someone who has no intention of buying it, but only to deceive others."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "النَّجْشِ",
      "english": "Artificially inflating prices",
      "urdu": "بیع نجش / مصنوعی بولی"
    },
    {
      "arabic": "السلعة",
      "english": "Commodity / Goods",
      "urdu": "سودا / سامان"
    },
    {
      "arabic": "ثمن",
      "english": "Price / Value",
      "urdu": "قیمت"
    },
    {
      "arabic": "خداع",
      "english": "Deception",
      "urdu": "دھوکہ دہی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اس دھوکہ دہی سے روکا گیا ہے جہاں کوئی شخص بازار میں کسی چیز کی بولی محض اس لیے بڑھاتا ہے تاکہ اصلی خریدار کو مہنگا مال بیچا جا سکے، جبکہ اس کا اپنا ارادہ خریدنے کا نہیں ہوتا۔",
    "english": "This Hadith prohibits the deceptive practice where a person raises the bid for a product without intending to buy it, but solely to trick a real buyer into paying a higher price."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2142)",
      "english": "Sahih al-Bukhari (2142)"
    },
    {
      "arabic": "صحيح مسلم (1516)",
      "english": "Sahih Muslim (1516)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نجش کا مفہوم اور ممانعت",
        "english": "Meaning and Prohibition of Najsh"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مصنوعی بولی کا دھوکہ",
              "english": "Deception of Artificial Bidding"
            },
            "content": {
              "urdu": [
                "نجش اس عمل کو کہتے ہیں جہاں بیچنے والے کا ساتھی خریدار بن کر قیمت بڑھاتا ہے۔",
                "اس کا مقصد خریدار کو یہ باور کرانا ہوتا ہے کہ چیز بہت قیمتی اور مانگ میں ہے۔",
                "اسلام نے اس عمل کو دھوکہ دہی قرار دے کر سختی سے منع کیا ہے۔"
              ],
              "english": [
                "Najsh occurs when an associate of the seller poses as a buyer to raise the price.",
                "The intent is to make the actual buyer believe the item is highly valuable and in demand.",
                "Islam strictly forbids this practice, categorizing it as a form of deception."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیانتدارانہ تجارت کی اہمیت",
              "english": "Importance of Honest Trading"
            },
            "content": {
              "urdu": [
                "تجارت کی بنیاد سچائی اور شفافیت پر ہونی چاہیے تاکہ فریقین کو نقصان نہ ہو۔",
                "نجش کے ذریعے حاصل کیا گیا نفع حرام اور ناجائز قرار پاتا ہے۔",
                "مسلمان کو چاہیے کہ وہ خرید و فروخت میں کسی قسم کا مکر و فریب نہ کرے۔"
              ],
              "english": [
                "Trade must be based on truth and transparency to avoid harming any party.",
                "Profit gained through the practice of Najsh is considered unlawful and forbidden.",
                "A Muslim must refrain from any kind of plotting or fraud during transactions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور معاشی اثرات",
        "english": "Social and Economic Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی اعتماد کی فضا",
              "english": "Atmosphere of Mutual Trust"
            },
            "content": {
              "urdu": [
                "جب بازار میں دھوکہ عام ہوتا ہے تو لوگوں کا ایک دوسرے پر سے اعتماد ختم ہو جاتا ہے۔",
                "اسلامی ریاست میں بازاروں کی نگرانی اس لیے ضروری ہے تاکہ ایسے منفی عوامل کا خاتمہ ہو۔",
                "یہ حکم معاشرے میں معاشی عدل اور بھائی چارے کے قیام کا ذریعہ ہے۔"
              ],
              "english": [
                "When deception becomes common in markets, people lose trust in one another.",
                "Monitoring markets in an Islamic state is essential to eliminate such negative factors.",
                "This ruling serves as a means to establish economic justice and brotherhood in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیمتوں کا استحکام",
              "english": "Price Stability"
            },
            "content": {
              "urdu": [
                "نجش سے اشیاء کی قیمتیں اپنی اصل قدر سے زیادہ بڑھ جاتی ہیں جو ظلم ہے۔",
                "اس سے عام صارف کی جیب پر بوجھ پڑتا ہے اور معیشت میں بگاڑ آتا ہے۔",
                "حقیقی طلب اور رسد (Demand & Supply) کے مطابق قیمتیں طے ہونا ہی اصل انصاف ہے۔"
              ],
              "english": [
                "Najsh causes prices to rise above their actual value, which is an act of injustice.",
                "It burdens the average consumer's pocket and leads to economic imbalance.",
                "True justice lies in prices being determined by genuine demand and supply."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور اطلاق",
        "english": "Juristic Issues and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عقدِ بیع پر اثر",
              "english": "Effect on the Sale Contract"
            },
            "content": {
              "urdu": [
                "اگر خریدار کو پتہ چلے کہ نجش ہوا ہے تو اسے سودا منسوخ کرنے کا حق حاصل ہے۔",
                "فقہاء کے نزدیک ایسا گناہ کرنے والا سخت وعید کا مستحق ہے۔",
                "اگرچہ سودا مکمل ہو جائے، مگر گناہ کی وجہ سے اس کی برکت ختم ہو جاتی ہے۔"
              ],
              "english": [
                "If a buyer discovers that Najsh occurred, they have the right to cancel the deal.",
                "According to jurists, the perpetrator of this act deserves severe warning.",
                "Even if the transaction is completed, its spiritual blessing is lost due to the sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید دور کی صورتیں",
              "english": "Modern Day Forms"
            },
            "content": {
              "urdu": [
                "آن لائن نیلامی میں فرضی آئی ڈی سے بولی بڑھانا نجش کی جدید شکل ہے۔",
                "سوشل میڈیا پر جھوٹی ریٹنگ اور تعریفیں بھی اسی زمرے میں آ سکتی ہیں۔",
                "ہر وہ طریقہ جو مصنوعی طور پر قیمت یا مانگ بڑھائے، وہ شرعاً ممنوع ہے۔"
              ],
              "english": [
                "Raising bids using fake IDs in online auctions is a modern form of Najsh.",
                "False ratings and fake reviews on social media can also fall under this category.",
                "Any method that artificially inflates price or demand is legally prohibited."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانت اور امانت",
              "english": "Integrity and Trust"
            },
            "content": {
              "urdu": [
                "ایک سچے تاجر کا حشر قیامت کے دن انبیاء اور شہداء کے ساتھ ہوگا۔",
                "اپنے مسلمان بھائی کے لیے وہی پسند کریں جو اپنے لیے پسند کرتے ہیں۔",
                "دھوکہ دہی سے بچنا ایمان کی پختگی کی علامت ہے۔"
              ],
              "english": [
                "A truthful merchant will be resurrected with the Prophets and martyrs on Judgment Day.",
                "Prefer for your Muslim brother what you prefer for yourself.",
                "Avoiding deception is a sign of the firmness of one's faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "اسلام نے معاشی معاملات میں اعلیٰ اخلاقی معیار مقرر کیے ہیں۔",
                "تاجر کو چاہیے کہ وہ تھوڑے نفع کے لیے اپنی آخرت داؤ پر نہ لگائے۔",
                "بازار میں شفافیت اللہ کی رحمت اور خوشنودی کا باعث ہے۔"
              ],
              "english": [
                "Islam has set high moral standards for economic transactions.",
                "A merchant should not risk their hereafter for a small worldly profit.",
                "Transparency in the marketplace leads to Allah's mercy and pleasure."
              ]
            }
          }
        ]
      }
    }
  ]
}