{
  "hadithId": 631,
  "hadithNo": 25,
  "hadithReferences": {
    "sunnah.com": ["bulugh/631"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (83)، ومسلم (1306). وهذا الحديث أصل عظيم في تيسير مناسك الحج ورفع الحرج عن الأمة.",
    "urdu": "صحیح۔ اسے بخاری (83) اور مسلم (1306) نے روایت کیا ہے۔ یہ حدیث حج کے مناسک میں آسانی اور امت سے تنگی کو دور کرنے کے لیے ایک عظیم بنیادی اصول ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (83) and Muslim (1306). This Hadith is a major principle regarding the facilitation of Hajj rituals and the removal of hardship."
  },
  "importantWords": [
    {
      "arabic": "لَمْ أَشْعُرْ",
      "english": "I did not realize / know",
      "urdu": "مجھے شعور نہ رہا / پتہ نہ چلا"
    },
    {
      "arabic": "حَلَقْتُ",
      "english": "I shaved (my head)",
      "urdu": "میں نے سر منڈوایا"
    },
    {
      "arabic": "نَحَرْتُ",
      "english": "I sacrificed",
      "urdu": "میں نے قربانی کی"
    },
    {
      "arabic": "لَا حَرَجَ",
      "english": "There is no harm / sin",
      "urdu": "کوئی حرج نہیں / کوئی گناہ نہیں"
    },
    {
      "arabic": "قُدِّمَ وَلَا أُخِّرَ",
      "english": "Done before or after",
      "urdu": "آگے کر دیا یا پیچھے کر دیا"
    }
  ],
  "summary": {
    "urdu": "10 ذوالحجہ کے مناسک (رمی، قربانی، حلق اور طواف) کی ترتیب سنت ہے، لیکن اگر کوئی بھول کر یا نادانی میں ترتیب بدل دے تو اس کا عمل درست ہے اور اس پر کوئی فدیہ یا گناہ نہیں ہے۔",
    "english": "The sequence of rituals on the 10th of Dhul-Hijjah (stoning, sacrifice, shaving, and Tawaf) is Sunnah, but if the order is changed due to ignorance or forgetfulness, the act is valid without penalty."
  },
  "references": [
    {
      "arabic": "رواه البخاري (83)",
      "english": "Reported by Al-Bukhari (83)"
    },
    {
      "arabic": "رواه مسلم (1306)",
      "english": "Reported by Muslim (1306)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-As"
      },
      "slug": "abdullah-bin-amr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "10 ذوالحجہ کے مناسک کی ترتیب",
        "english": "Sequence of Rituals on the 10th of Dhul-Hijjah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت اور افضل ترتیب",
              "english": "Sunnah and Preferred Order"
            },
            "content": {
              "urdu": [
                "10 ذوالحجہ کو افضل ترتیب یہ ہے: (1) جمرہ عقبہ کی رمی، (2) قربانی کرنا، (3) سر منڈوانا یا بال کاٹنا، (4) طوافِ افاضہ کرنا۔",
                "نبی ﷺ نے خود اسی ترتیب سے یہ کام انجام دیے تھے۔",
                "اس ترتیب کی پابندی مستحب اور مسنون ہے تاکہ حج کے افعال منظم رہیں۔"
              ],
              "english": [
                "The preferred sequence on the 10th is: (1) Stoning Jamrat al-Aqaba, (2) Sacrificing, (3) Shaving or cutting hair, (4) Tawaf al-Ifadah.",
                "The Prophet (ﷺ) personally followed this specific sequence.",
                "Adhering to this order is recommended (Mustahabb) to keep the Hajj rituals organized."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترتیب بدلنے کی گنجائش",
              "english": "Allowance for Changing Order"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص ان چار کاموں کی ترتیب آگے پیچھے کر دے تو اس کا حج صحیح ہے۔",
                "نبی ﷺ کا 'لا حرج' (کوئی حرج نہیں) فرمانا اس بات کی واضح دلیل ہے کہ ترتیب کی خلاف ورزی سے دم (قربانی) واجب نہیں ہوتا۔",
                "یہ حکم بھولنے والے، جاہل اور جان بوجھ کر کرنے والے سب کے لیے عام ہے، اگرچہ جان بوجھ کر سنت چھوڑنا خلافِ اولیٰ ہے۔"
              ],
              "english": [
                "If someone changes the order of these four acts, their Hajj remains valid.",
                "The Prophet's (ﷺ) repeated phrase \"No harm\" proves that violating the sequence does not necessitate a penalty (Damm).",
                "This ruling applies to the forgetful, the ignorant, and those who do it intentionally, though skipping the Sunnah order on purpose is discouraged."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلام میں آسانی اور رحمت کا پہلو",
        "english": "Ease and Mercy in Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین میں تنگی نہیں ہے",
              "english": "No Hardship in Religion"
            },
            "content": {
              "urdu": [
                "حج کے دوران لاکھوں کے ہجوم اور تھکاوٹ کی وجہ سے غلطی کا امکان بہت زیادہ ہوتا ہے۔",
                "اللہ اور اس کے رسول ﷺ نے بندوں کی بشری کمزوریوں کا لحاظ رکھا ہے۔",
                "یہ حدیث اس فقہی قاعدے کی مثال ہے کہ 'تنگی آسانی کو کھینچ لاتی ہے' (المشقة تجلب التيسير)۔"
              ],
              "english": [
                "Due to massive crowds and exhaustion during Hajj, the possibility of mistakes is high.",
                "Allah and His Messenger (ﷺ) have accounted for human limitations and weaknesses.",
                "This Hadith exemplifies the juristic maxim: \"Hardship brings about ease.\""
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی شفقت اور رہنمائی",
              "english": "Prophetic Compassion and Guidance"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا منیٰ میں کھڑے ہو کر لوگوں کے سوالات سننا ان کی عظیم تواضع کو ظاہر کرتا ہے۔",
                "آپ ﷺ نے لوگوں کو ڈرانے یا بوجھ ڈالنے کے بجائے اطمینان اور سکون عطا فرمایا۔",
                "ایک عالم اور مفتی کو چاہیے کہ وہ فتوے میں عوام کے لیے آسانی اور سنت کی روح کو ملحوظ رکھے۔"
              ],
              "english": [
                "The Prophet (ﷺ) standing in public to answer questions shows his immense humility.",
                "Instead of intimidating people or imposing burdens, he provided comfort and peace of mind.",
                "A scholar or Mufti should prioritize ease and the spirit of Sunnah when issuing fatwas."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات",
        "english": "Juristic Details"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار مخصوص افعال",
              "english": "Four Specific Acts"
            },
            "content": {
              "urdu": [
                "رمی، نحر (قربانی)، حلق (سر منڈوانا) اور طوافِ افاضہ؛ ان چاروں میں تقدیم و تاخیر جائز ہے۔",
                "جمہور فقہاء (شافعی، احمد، اسحاق) کے نزدیک اس میں کسی قسم کا فدیہ نہیں ہے۔",
                "امام ابوحنیفہ کے نزدیک ترتیب واجب ہے، لیکن صاحبِ علم کے لیے اس حدیث پر عمل کرنا ہی محفوظ راستہ ہے۔"
              ],
              "english": [
                "The four acts: Stoning, Sacrifice, Shaving, and Tawaf al-Ifadah; any can precede the other.",
                "The majority of jurists (Shafi'i, Ahmad, Ishaq) hold that no fidyah (penalty) is required.",
                "While Imam Abu Hanifa emphasized the order, following the explicit text of this Hadith is the safer path for a seeker of truth."
              ]
            }
          },
          {
            "title": {
              "urdu": "نادانی اور علم کا فرق",
              "english": "Difference between Ignorance and Intent"
            },
            "content": {
              "urdu": [
                "سائلین نے 'لم اشعر' (مجھے پتہ نہیں چلا) کہہ کر اپنی معذرت پیش کی تھی۔",
                "اگرچہ علم ہونے کے باوجود سنت کی مخالفت نہیں کرنی چاہیے، مگر حکمِ نبوی کی وسعت سب کے لیے ہے۔",
                "حج جیسے نازک موقع پر شک اور وسوسوں سے بچنا ضروری ہے، جس کا حل یہ حدیث فراہم کرتی ہے۔"
              ],
              "english": [
                "The questioners apologized saying, \"I did not realize.\"",
                "While one shouldn't oppose Sunnah knowingly, the breadth of the Prophet's (ﷺ) command covers all.",
                "Avoiding doubt and whispers during Hajj is crucial; this Hadith provides the necessary resolution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سائل کا مقام",
              "english": "The Status of the Questioner"
            },
            "content": {
              "urdu": [
                "صحابہ کا فورا سوال کرنا ظاہر کرتا ہے کہ اپنی غلطی پر شرمندہ ہونے کے بجائے اصلاح کی فکر کرنی چاہیے۔",
                "دین کے معاملے میں لاعلمی کا علاج سوال پوچھنا ہے۔",
                "نبی ﷺ کے سامنے اپنی کمزوری کا اعتراف کرنا ہی سچی بندگی ہے۔"
              ],
              "english": [
                "The Sahaba's immediate questioning shows that one should focus on correction rather than just being ashamed of a mistake.",
                "The cure for ignorance in religious matters is to ask.",
                "Admitting one's weakness before the Messenger of Allah (ﷺ) is true servitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشخبری اور اطمینان",
              "english": "Glad Tidings and Peace"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے الفاظ 'افعل ولا حرج' آج بھی حاجیوں کے لیے پریشانی میں سکون کا باعث ہیں۔",
                "اللہ تعالیٰ نیتوں کو دیکھتا ہے، ظاہری ترتیب میں غلطی معاف فرماتا ہے۔",
                "مومن کو چاہیے کہ وہ اللہ کی رحمت سے ہمیشہ پرامید رہے اور دوسروں کے لیے بھی آسانیاں پیدا کرے۔"
              ],
              "english": [
                "The Prophet's words \"Do it, and there is no harm\" remain a source of peace for pilgrims today.",
                "Allah looks at the intentions; He forgives errors in external sequence.",
                "A believer should always remain hopeful of Allah's mercy and strive to make things easy for others."
              ]
            }
          }
        ]
      }
    }
  ]
}