{
  "hadithId": 691,
  "hadithNo": 44,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh:691"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (3460)، وابن ماجه (2199)، وابن حبان (7/243)، والحاكم (2/45).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد، ابن ماجہ، ابن حبان اور حاکم نے روایت کیا ہے۔ امام حاکم نے اسے بخاری و مسلم کی شرائط پر صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3460), Ibn Majah (2199), Ibn Hibban (5029), and Al-Hakim (2244)."
  },
  "importantWords": [
    {
      "arabic": "أَقَالَ",
      "english": "Rescinded / Cancelled",
      "urdu": "منسوخ کر دیا / اقالہ کیا"
    },
    {
      "arabic": "بَيْعَتَهُ",
      "english": "His transaction / Sale",
      "urdu": "اس کا سودا"
    },
    {
      "arabic": "عَثْرَتَهُ",
      "english": "His slip / Sin",
      "urdu": "اس کی لغزش / گناہ"
    },
    {
      "arabic": "مُسْلِماً",
      "english": "A Muslim",
      "urdu": "ایک مسلمان"
    },
    {
      "arabic": "الْقِيَامَةِ",
      "english": "The Resurrection",
      "urdu": "قیامت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'اقالہ' (سودا منسوخ کرنے) کی فضیلت بیان ہوئی ہے کہ اگر کوئی خریدار یا بیچنے والا پچھتاوے کی وجہ سے سودا ختم کرنا چاہے تو اسے قبول کرنا گناہوں کی معافی کا ذریعہ ہے۔",
    "english": "This Hadith highlights the virtue of 'Iqala' (canceling a deal). It encourages accepting a request to rescind a transaction if the other party regrets it, promising divine forgiveness in return."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3460)",
      "english": "Reported by Abu Dawud (3460)"
    },
    {
      "arabic": "رواه ابن ماجه (2199)",
      "english": "Reported by Ibn Majah (2199)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اقالہ کا مفہوم اور اہمیت",
        "english": "Concept and Importance of Iqala"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اقالہ کی تعریف",
              "english": "Definition of Iqala"
            },
            "content": {
              "urdu": [
                "اقالہ کا مطلب ہے کہ فریقین کی رضامندی سے ایک مکمل ہو چکے سودے کو ختم کر دینا۔",
                "جب خریدار یا بیچنے والا محسوس کرے کہ اسے اس سودے میں نقصان ہوا ہے تو وہ دوسرے سے درخواست کرتا ہے۔",
                "قانوناً سودا لازم ہو چکا ہوتا ہے مگر اخلاقاً اسے منسوخ کرنا نیکی ہے۔"
              ],
              "english": [
                "Iqala refers to the cancellation of a finalized transaction by mutual consent.",
                "It occurs when a buyer or seller regrets the deal due to loss or a change in circumstances.",
                "Legally, the contract is binding, but ethically, rescinding it is considered a virtuous act."
              ]
            }
          },
          {
            "title": {
              "urdu": "احسان اور ہمدردی کا مظاہرہ",
              "english": "Demonstrating Kindness and Empathy"
            },
            "content": {
              "urdu": [
                "اقالہ محض ایک معاشی عمل نہیں بلکہ یہ اسلامی اخوت اور ہمدردی کی علامت ہے۔",
                "اپنے بھائی کی پریشانی دور کرنے کے لیے اپنا قانونی حق چھوڑ دینا بہت بڑا عمل ہے۔",
                "یہ عمل معاشرے میں لالچ اور خود غرضی کے بجائے ایثار کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Iqala is not just a business act; it is a sign of Islamic brotherhood and sympathy.",
                "Giving up a legal right to alleviate a brother's distress is a highly rewarded deed.",
                "This practice promotes altruism in society instead of greed and selfishness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لغزشوں کی معافی کی بشارت",
        "english": "Glad Tidings of Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مکافاتِ عمل کا اصول",
              "english": "The Principle of Retribution"
            },
            "content": {
              "urdu": [
                "اس حدیث میں 'جنسِ عمل' سے جزا کا وعدہ کیا گیا ہے کہ تم یہاں درگزر کرو وہاں اللہ کرے گا۔",
                "جو انسان دنیا میں دوسروں کی مالی لغزشوں کو معاف کرتا ہے، اللہ اس کے گناہ معاف کرے گا۔",
                "قیامت کے دن جب ہر انسان مغفرت کا محتاج ہوگا، یہ عمل بہت کام آئے گا۔"
              ],
              "english": [
                "The Hadith promises a reward similar to the deed: show leniency here, receive it there.",
                "One who overlooks the financial slips of others will find Allah overlooking their sins.",
                "On the Day of Judgment, when everyone needs forgiveness, this act will be invaluable."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی رحمت کا حصول",
              "english": "Attaining Allah's Mercy"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ اپنے ان بندوں پر رحم کرتا ہے جو اس کی مخلوق پر رحم کرتے ہیں۔",
                "تجارتی معاملات میں سختی کے بجائے نرمی اختیار کرنا سنتِ نبوی ﷺ ہے۔",
                "کسی کی پشیمانی پر اسے رعایت دینا اللہ کی قربت کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Allah shows mercy to those of His servants who are merciful toward His creation.",
                "Choosing leniency over rigidity in commercial dealings is the Sunnah of the Prophet (PBUH).",
                "Providing relief to someone in their regret is an excellent way to gain proximity to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور شرائط",
        "english": "Juristic Rulings and Conditions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی رضامندی شرط ہے",
              "english": "Mutual Consent is Required"
            },
            "content": {
              "urdu": [
                "اقالہ کے لیے دونوں فریقین کی رضامندی ضروری ہے، کوئی کسی پر زبردستی نہیں کر سکتا۔",
                "اگر ایک فریق سودا منسوخ کرنے پر تیار نہ ہو تو دوسرا اسے قانوناً مجبور نہیں کر سکتا۔",
                "یہ ایک مستحب اور فضیلت والا کام ہے، قانونی طور پر واجب نہیں ہے۔"
              ],
              "english": [
                "Iqala requires the consent of both parties; no one can be legally forced to rescind.",
                "If one party refuses to cancel the deal, the other cannot legally compel them.",
                "It is a recommended and meritorious act (Mustahabb), not a legal obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیمت کی واپسی",
              "english": "Return of the Original Price"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک اقالہ میں وہی قیمت واپس کی جائے گی جس پر سودا ہوا تھا۔",
                "قیمت میں کمی یا اضافہ کر کے سودا منسوخ کرنا ایک نئی بیع کہلائے گا۔",
                "اصل فضیلت اسی صورت میں ہے جب انسان بغیر کسی اضافی نفع کے حق واپس کر دے۔"
              ],
              "english": [
                "Most jurists agree that the original price must be returned during Iqala.",
                "Changing the price during cancellation would classify it as a new sale transaction.",
                "The true virtue lies in returning the right without seeking any additional profit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کاروباری اخلاقیات پر اثر",
        "english": "Impact on Business Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتماد کی بحالی",
              "english": "Restoration of Trust"
            },
            "content": {
              "urdu": [
                "جب بازار میں اقالہ کا رواج ہو تو گاہک اطمینان سے خریداری کرتا ہے۔",
                "اس سے تاجر اور خریدار کے درمیان دیرپا اور مضبوط تعلقات قائم ہوتے ہیں۔",
                "یہ عمل معاشی نظام میں انسانیت اور اخلاق کا عنصر شامل کرتا ہے۔"
              ],
              "english": [
                "When Iqala is practiced in markets, customers purchase with greater confidence.",
                "It establishes long-term and strong relationships between traders and buyers.",
                "This practice infuses human values and ethics into the economic system."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھگڑوں کا خاتمہ",
              "english": "Ending Disputes"
            },
            "content": {
              "urdu": [
                "بہت سے تجارتی جھگڑے صرف اس لیے طول پکڑتے ہیں کہ فریقین پیچھے ہٹنے کو تیار نہیں ہوتے۔",
                "اقالہ کا راستہ اختیار کرنے سے عدالتوں کا بوجھ کم ہوتا ہے اور دشمنی ختم ہوتی ہے۔",
                "اسلام چاہتا ہے کہ مسلمان کا مال اور دل دونوں پاک رہیں۔"
              ],
              "english": [
                "Many business disputes escalate simply because parties are unwilling to backtrack.",
                "Adopting Iqala reduces the burden on courts and prevents lingering animosities.",
                "Islam desires that a Muslim's wealth and heart both remain pure."
              ]
            }
          }
        ]
      }
    }
  ]
}