{
  "hadithId": 679,
  "hadithNo": 32,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/abudawud:3451"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (3/156)، وأبو داود (3451)، والترمذي (1314)، وابن ماجه (2200)، وابن حبان (4914). قال الترمذي: حسن صحيح.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے احمد، ابو داؤد، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے اور حافظ ابن حجر کے مطابق اس کی سند مسلم کی شرط پر ہے۔",
    "english": "Sahih. Reported by Ahmad (3/156), Abu Dawud (3451), At-Tirmidhi (1314), and Ibn Majah (2200). At-Tirmidhi graded it Hasan Sahih."
  },
  "importantWords": [
    {
      "arabic": "غَلَا اَلسِّعْرُ",
      "english": "Prices became high",
      "urdu": "قیمتیں بڑھ گئیں"
    },
    {
      "arabic": "اَلْمُسَعِّرُ",
      "english": "The Price-Fixer",
      "urdu": "نرخ مقرر کرنے والا"
    },
    {
      "arabic": "اَلْقَابِضُ",
      "english": "The Withholder",
      "urdu": "تنگی کرنے والا"
    },
    {
      "arabic": "اَلْبَاسِطُ",
      "english": "The Expander",
      "urdu": "کشادگی کرنے والا"
    },
    {
      "arabic": "مَظْلِمَةٍ",
      "english": "Injustice/Wrong",
      "urdu": "ظلم / ناحق مطالبہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بازار میں قیمتوں کے خودکار نظام اور حکومت کی طرف سے بلاوجہ نرخ مقرر کرنے کی ممانعت کا بیان ہے تاکہ کسی فریق پر ظلم نہ ہو۔",
    "english": "This Hadith discusses market price mechanisms and the prohibition of arbitrary price-fixing by the state to avoid injustice to any party."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3451)",
      "english": "Reported by Abu Dawud (3451)"
    },
    {
      "arabic": "رواه الترمذي (1314)",
      "english": "Reported by At-Tirmidhi (1314)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نرخ مقرر کرنے کا شرعی حکم",
        "english": "Islamic Ruling on Price Fixing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری معاشی نظام",
              "english": "Natural Economic System"
            },
            "content": {
              "urdu": [
                "اسلامی معیشت میں قیمتوں کا تعین رسد اور طلب (Supply and Demand) کے فطری نظام پر چھوڑ دیا گیا ہے۔",
                "اگر قیمتیں کسی تاجر کی ذخیرہ اندوزی کے بغیر فطری طور پر بڑھیں تو حکومت کو مداخلت نہیں کرنی چاہیے۔",
                "بلاوجہ نرخ مقرر کرنا تاجروں کے حق میں ظلم ہو سکتا ہے کیونکہ ان کی لاگت مختلف ہو سکتی ہے۔"
              ],
              "english": [
                "In Islamic economics, price determination is left to the natural system of supply and demand.",
                "If prices rise naturally without hoarding by merchants, the government should not intervene.",
                "Arbitrary price-fixing can be an injustice to traders whose costs may vary."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کی اہمیت",
              "english": "Importance of Justice"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے نرخ مقرر کرنے سے اس لیے انکار کیا تاکہ کسی کا معاشی حق متاثر نہ ہو۔",
                "حکمران کی ذمہ داری ہے کہ وہ عوام اور تاجر دونوں کے درمیان توازن برقرار رکھے۔",
                "ظلم سے پاک معاشرہ ہی اسلامی ریاست کا اصل ہدف ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) refused to fix prices to ensure no one's economic rights were violated.",
                "It is the ruler's responsibility to maintain a balance between the public and the merchants.",
                "A society free from injustice is the primary goal of an Islamic state."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کی صفات اور رزق",
        "english": "Attributes of Allah and Sustenance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "القابض اور الباسط",
              "english": "The Withholder and The Expander"
            },
            "content": {
              "urdu": [
                "رزق میں تنگی اور فراخی خالصتاً اللہ تعالیٰ کے ہاتھ میں ہے۔",
                "جب اللہ رزق روکتا ہے تو قیمتیں بڑھتی ہیں، اور جب وہ کشادگی کرتا ہے تو افراطِ زر کم ہوتا ہے۔",
                "مومن کو معاشی تنگی میں بھی اللہ کی حکمت پر بھروسہ رکھنا چاہیے۔"
              ],
              "english": [
                "Constriction and expansion of sustenance are purely in the hands of Allah.",
                "When Allah withholds, prices rise; and when He expands, inflation decreases.",
                "A believer must trust in Allah's wisdom even during economic hardships."
              ]
            }
          },
          {
            "title": {
              "urdu": "توکل اور اسباب",
              "english": "Reliance and Means"
            },
            "content": {
              "urdu": [
                "قیمتوں کا اتار چڑھاؤ اللہ کی طرف سے آزمائش یا انعام ہو سکتا ہے۔",
                "صرف ظاہری اسباب پر نظر رکھنے کے بجائے مسبب الاسباب سے رجوع کرنا چاہیے۔",
                "معاشی مسائل کا حل دعا اور شرعی حدود کی پاسداری میں ہے۔"
              ],
              "english": [
                "Fluctuations in prices can be a trial or a reward from Allah.",
                "Instead of only focusing on external causes, one should turn to the Provider of causes.",
                "The solution to economic issues lies in prayer and adherence to Sharia limits."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکومتی مداخلت کی حدود",
        "english": "Limits of Government Intervention"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذخیرہ اندوزی کی صورت میں",
              "english": "In Case of Hoarding"
            },
            "content": {
              "urdu": [
                "اگر تاجر مل کر مصنوعی مہنگائی کریں یا ذخیرہ اندوزی کریں تو حکومت مداخلت کر سکتی ہے۔",
                "ایسی صورت میں نرخ مقرر کرنا ظلم نہیں بلکہ انصاف کا تقاضا بن جاتا ہے۔",
                "حکومت کا مقصد بازار میں ہونے والے مکر و فریب کا سدِ باب کرنا ہے۔"
              ],
              "english": [
                "If traders collude to cause artificial inflation or hoarding, the government can intervene.",
                "In such cases, fixing prices becomes a requirement of justice rather than oppression.",
                "The government's aim is to prevent deception and fraud in the marketplace."
              ]
            }
          },
          {
            "title": {
              "urdu": "عوامی مصلحت",
              "english": "Public Interest"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست کو اختیار ہے کہ وہ اجارہ داری (Monopoly) کو ختم کرے۔",
                "ضروریاتِ زندگی کی فراہمی کو یقینی بنانا ریاست کا اولین فریضہ ہے۔",
                "لیکن یہ مداخلت صرف اسی صورت میں ہو جب بازار کا فطری توازن بگڑ چکا ہو۔"
              ],
              "english": [
                "An Islamic state has the authority to abolish monopolies.",
                "Ensuring the supply of essential commodities is the state's primary duty.",
                "However, this intervention should only occur if the market's natural balance is disrupted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آخرت کی جوابدہی",
        "english": "Accountability in the Hereafter"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق العباد کی حساسیت",
              "english": "Sensitivity to Human Rights"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنے اسوہ سے یہ سکھایا کہ حکمران کو اپنی رعایا کے حقوق کا کس قدر خیال ہونا چاہیے۔",
                "خون اور مال کے معاملات میں ادنیٰ سا ظلم بھی آخرت میں گرفت کا باعث بن سکتا ہے۔",
                "یہ حدیث حکمرانوں کے لیے تقویٰ اور عدل کا ایک عظیم معیار فراہم کرتی ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) taught through his example how sensitive a ruler should be to the rights of subjects.",
                "Even minor injustice regarding blood or property can lead to accountability in the Hereafter.",
                "This Hadith provides a grand standard of piety and justice for rulers."
              ]
            }
          },
          {
            "title": {
              "urdu": "برائے مصلحتِ عامہ",
              "english": "For the General Good"
            },
            "content": {
              "urdu": [
                "قیامت کے دن سرخرو وہی ہوگا جس نے لوگوں کے حقوق غصب نہ کیے ہوں۔",
                "تجارت اور معیشت میں دیانتداری برتنا اجرِ عظیم کا باعث ہے۔",
                "ہمیں ہر معاملے میں اللہ کی رضا اور آخرت کی کامیابی کو پیشِ نظر رکھنا چاہیے۔"
              ],
              "english": [
                "One who does not usurp the rights of people will be successful on the Day of Resurrection.",
                "Maintaining integrity in trade and economics leads to a great reward.",
                "We should prioritize Allah's pleasure and success in the Hereafter in every matter."
              ]
            }
          }
        ]
      }
    }
  ]
}