{
  "hadithId": 96,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 96"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": " صحيح.  رواه البخاري (282) ، ومسلم (313) ، وزاد مسلم: \"فقالت أم سلمة: يا رسول الله! وتحتلم المرأة؟ فقال: تربت يداك! فبم يشبهها ولدها\".  وزاد في رواية أخرى: \"قالت: قلت: فضحت النساء\".",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (282) اور مسلم (313) نے روایت کیا ہے۔ مسلم نے یہ اضافہ کیا ہے: \"تو ام سلمہ نے پوچھا: یا رسول اللہ! کیا عورت کو بھی احتلام ہوتا ہے؟ آپ نے فرمایا: 'تیرے ہاتھ خاک آلود ہوں! پھر اس کا بچہ کس کی وجہ سے اس سے مشابہت رکھتا ہے؟'\" اور ایک دوسری روایت میں یہ اضافہ ہے: \"ام سلمہ نے کہا: میں نے کہا، میں نے تو عورتوں کو شرمندہ کر دیا!\"",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (282) and Muslim (313). Muslim adds: \"Then Umm Salamah asked: 'O Messenger of Allah! Does a woman also have a wet dream?' He said: 'May your hands be covered with dust! Then how does her child resemble her?'\" And in another narration, the addition is: \"She said: I said, I have disgraced the women!\""
  },
  "importantWords": [
    {
      "arabic": "لَا يَسْتَحِي",
      "english": "Is not ashamed/shy",
      "urdu": "حیا نہیں کرتا"
    },
    {
      "arabic": "اَلْحَقِّ",
      "english": "The truth",
      "urdu": "حق"
    },
    {
      "arabic": "اِحْتَلَمَتْ",
      "english": "She has a wet dream",
      "urdu": "احتلام ہو جائے"
    },
    {
      "arabic": "اَلْمَرْأَةِ",
      "english": "The woman",
      "urdu": "عورت"
    },
    {
      "arabic": "الْمَاءَ",
      "english": "The water (semen/fluid)",
      "urdu": "پانی (منی)"
    },
    {
      "arabic": "يُشْبِهُهَا",
      "english": "Resembles her",
      "urdu": "اس سے مشابہت رکھتا ہے"
    },
    {
      "arabic": "وَجَبَ اَلْغُسْلُ",
      "english": "Ghusl became obligatory",
      "urdu": "غسل فرض ہوا"
    },
    {
      "arabic": "تُرْبَتْ يَدَاك",
      "english": "May your hands be covered with dust (A mild idiom of reproach)",
      "urdu": "تیرے ہاتھ خاک آلود ہوں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس اصول کو واضح کرتی ہے کہ عورت پر بھی مرد کی طرح غسل اس صورت میں واجب ہوتا ہے جب اسے احتلام ہو اور بیداری پر وہ منی (سیال) کے آثار دیکھے۔",
    "english": "This Hadith establishes the rule that Ghusl (major ritual bath) becomes obligatory upon a woman, just like a man, if she experiences a wet dream and finds traces of seminal fluid upon waking."
  },
  "references": [
    {
      "arabic": "رواه البخاري (282)",
      "english": "Reported by Al-Bukhari (282)"
    },
    {
      "arabic": "رواه مسلم (313)",
      "english": "Reported by Muslim (313)"
    },
    {
      "arabic": "متفق عليه",
      "english": "Agreed upon (by Bukhari and Muslim)"
    }
  ],
  "narrators": [
    {
      "id": 9601,
      "name": {
        "arabic": "أم سلمة",
        "english": "Umm Salamah"
      },
      "slug": "umm-salamah"
    },
    {
      "id": 9602,
      "name": {
        "arabic": "أم سليم",
        "english": "Umm Sulaim (The inquirer)"
      },
      "slug": "umm-sulaim"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عورت پر غسل کا وجوب",
        "english": "Obligation of Ghusl Upon a Woman"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احتلام اور غسل",
              "english": "Wet Dream and Ghusl"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے واضح کیا کہ احتلام کی صورت میں عورت پر بھی غسل واجب ہے، بشرطیکہ وہ بیداری پر منی (پانی) دیکھے۔",
                "یہ حکم مرد اور عورت کے درمیان طہارت کے اصولوں میں مساوات کو قائم کرتا ہے کہ انزال ہونے پر دونوں کو غسل کرنا ہے۔",
                "اگر خواب دیکھا ہو لیکن بیداری پر کوئی تری نہ ہو تو غسل واجب نہیں ہوتا، خواہ خواب کیسا ہی کیوں نہ ہو۔"
              ],
              "english": [
                "The Prophet ﷺ clarified that Ghusl is obligatory for a woman if she has a wet dream, provided she sees seminal fluid (water) upon waking.",
                "This ruling establishes equality between men and women in the rules of purification: both must perform Ghusl upon ejaculation/emission.",
                "If she has a dream but finds no wetness upon waking, Ghusl is not mandatory, regardless of the nature of the dream."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتلام کی فطری حقیقت",
              "english": "The Natural Reality of Wet Dreams"
            },
            "content": {
              "urdu": [
                "ام سلیم رضی اللہ عنہا کا سوال اور ام سلمہ رضی اللہ عنہا کا تعجب ظاہر کرتا ہے کہ اس موضوع پر گفتگو حیا کی وجہ سے کم ہوتی تھی۔",
                "نبی ﷺ کا جواب کہ 'پھر اس کا بچہ کس کی وجہ سے اس سے مشابہت رکھتا ہے' عورت میں منی کے وجود اور اخراج کی تصدیق کرتا ہے۔",
                "یہ حدیث اس بات کو واضح کرتی ہے کہ احتلام مرد اور عورت دونوں کے لیے ایک فطری اور شرعی حقیقت ہے۔"
              ],
              "english": [
                "Umm Sulaim's question and Umm Salamah's surprise show that discussion on this topic was rare due to modesty.",
                "The Prophet's reply, 'Then how does her child resemble her?', confirms the existence and emission of fluid (semen) in women.",
                "This Hadith clarifies that a wet dream is a natural and religious reality for both men and women."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور اخلاقی اصول",
        "english": "Juristic and Ethical Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق کا بیان اور حیا",
              "english": "Stating the Truth and Modesty"
            },
            "content": {
              "urdu": [
                "ام سلیم رضی اللہ عنہا کا جملہ \"اللہ حق بیان کرنے سے حیا نہیں کرتا\" ایک بنیادی اصول کو قائم کرتا ہے۔",
                "شرعی مسائل میں حیاء کی وجہ سے حق بات بتانے اور پوچھنے سے رکنا جائز نہیں ہے۔",
                "مسلمانوں کو دینی معاملات میں شرمندگی محسوس کیے بغیر علم حاصل کرنا چاہیے، کیونکہ حیا اور دین دونوں ضروری ہیں۔"
              ],
              "english": [
                "Umm Sulaim's statement, 'Allah is not ashamed of the truth', establishes a fundamental principle of Shari'ah.",
                "It is not permissible to refrain from asking or stating the truth in legal matters due to modesty.",
                "Muslims must seek knowledge in religious affairs without feeling embarrassed, as both modesty and faith are important."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشابہت اولاد کا مسئلہ",
              "english": "The Issue of Children's Resemblance"
            },
            "content": {
              "urdu": [
                "احتلام سے غسل واجب ہونے کی دلیل میں نبی ﷺ کا اولاد کی مشابہت کا ذکر ایک اہم سائنسی اشارہ بھی ہے۔",
                "اس سے معلوم ہوتا ہے کہ اولاد کی پیدائش میں مرد اور عورت دونوں کی منی (سیال) کا حصہ ہوتا ہے، جس پر مشابہت کا انحصار ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ عورت کا اخراج ہونے والا سیال بھی منی کا حکم رکھتا ہے اور نجاست غسل کو لازم کرتی ہے۔"
              ],
              "english": [
                "The Prophet's reference to the child's resemblance to the mother in the context of Ghusl provides a significant scientific indication.",
                "It shows that both the man's and the woman's fluids contribute to the creation of the child, upon which resemblance depends.",
                "This ruling proves that the fluid emitted by a woman is considered semen, and its impurity necessitates Ghusl."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غسل اور طہارت کا حکم",
        "english": "Ruling on Ghusl and Purification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منی اور مذی میں فرق",
              "english": "Difference between Mani (Semen) and Madhiy (Pre-ejaculatory fluid)"
            },
            "content": {
              "urdu": [
                "غسل صرف اس صورت میں واجب ہوتا ہے جب خواب کے بعد منی (تھکی اور گاڑھی تری) نظر آئے نہ کہ مذی (خفیف اور پتلی تری)۔",
                "منی کے اخراج سے غسل فرض ہوتا ہے جبکہ مذی کے اخراج سے صرف وضو ٹوٹتا ہے اور اس جگہ کو دھونا ضروری ہوتا ہے۔",
                "عورت کی منی کی پہچان اس کی مختلف خصوصیات اور مباشرت کے بعد بیداری پر اس کے آثار سے کی جاتی ہے۔"
              ],
              "english": [
                "Ghusl is only mandatory if semen (thick, concentrated fluid) is seen after the dream, not Madhiy (thin, pre-ejaculatory fluid).",
                "The emission of Mani necessitates Ghusl, whereas the emission of Madhiy only breaks Wudu' and requires washing the affected area.",
                "The identity of the woman's fluid is determined by its characteristics and its presence upon waking after intercourse."
              ]
            }
          },
          {
            "title": {
              "urdu": "شک کی صورت میں حکم",
              "english": "Ruling in Case of Doubt"
            },
            "content": {
              "urdu": [
                "اگر کسی شخص کو خواب یاد نہ ہو لیکن بیداری پر کوئی تری نظر آئے اور منی ہونے کا شک ہو، تو احتیاطاً غسل واجب ہے۔",
                "یقین کا اصول یہ ہے کہ طہارت پر شک ہو تو طہارت کو برقرار مانیں، لیکن جنابت میں احتیاط افضل ہے۔",
                "فقہاء نے تاکید کی ہے کہ طہارت کے معاملے میں شبہات سے بچنا چاہیے تاکہ عبادت میں کوئی کمی نہ آئے۔"
              ],
              "english": [
                "If a person does not recall a dream but sees wetness upon waking and suspects it might be semen, Ghusl is obligatory for caution.",
                "The principle of certainty states that if purity is doubted, purity is assumed, but caution is preferred in cases of Janabah.",
                "Jurists emphasize that one should avoid doubts in matters of purity so that acts of worship are not deficient."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دینی تعلیم کا دائرہ",
        "english": "Scope of Religious Education"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواتین کا کردار",
              "english": "The Role of Women"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلامی معاشرے میں خواتین کے کردار کی اہمیت اور ان کے شرعی سوالات پوچھنے کی جرأت کو ظاہر کرتی ہے۔",
                "ام سلیم رضی اللہ عنہا کا براہ راست نبی ﷺ سے سوال کرنا علم کی طلب اور فہم دین کی عمدہ مثال ہے۔",
                "یہ واقعہ ہمیں سکھاتا ہے کہ علمی مجلسوں میں حقائق پر بات کرنے میں حیا کو مانع نہیں ہونا چاہیے۔"
              ],
              "english": [
                "This Hadith illustrates the significance of women's roles in Islamic society and their courage to ask legal questions.",
                "Umm Sulaim's direct question to the Prophet ﷺ is an excellent example of seeking knowledge and religious understanding.",
                "This incident teaches us that modesty should not prevent discussing facts in academic or religious gatherings."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا طرز تعلیم",
              "english": "The Prophet's Teaching Method"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے عورتوں کے ذاتی مسئلے کا بھی مکمل وضاحت اور حکمت کے ساتھ جواب دیا۔",
                "آپ کا طرز تعلیم شگفتہ، صاف اور علمی تھا، جہاں ذاتی یا مشکل سوالات کو بھی جگہ ملتی تھی۔",
                "آپ نے ہر وہ بات سکھائی جو مسلمانوں کے لیے ان کی دنیا اور آخرت میں ضروری ہے۔"
              ],
              "english": [
                "The Prophet ﷺ answered the personal issue of women with complete clarity and wisdom.",
                "His teaching style was pleasant, clear, and academic, accommodating even private or complex questions.",
                "He taught every matter that was necessary for Muslims in their lives in this world and the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}
