{
  "hadithId": 968,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/968",
      "muslim/1452"
    ],
    "kitabId": 8,
    "inKitabBab": 13,
    "arabicBook": "كتاب الرضاع",
    "babId": 76
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (1452) في كتاب الرضاع، باب التحريم بخمس رضعات. وأخرجه أبو داود (2062) والنسائي (3307) والترمذي (1150).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام مسلم (1452) نے اپنی صحیح میں روایت کیا ہے۔ امام نوویؒ کے مطابق اس کا مطلب یہ ہے کہ نسخ کا حکم کچھ لوگوں تک دیر سے پہنچا، اسی لیے وہ اسے تلاوت کرتے رہے یہاں تک کہ تلاوت کا نسخ ہونا سب پر واضح ہو گیا۔",
    "english": "Sahih. Reported by Muslim (1452) in the Book of Suckling. It is also recorded by Abu Dawud, An-Nasa'i, and At-Tirmidhi. It explains the gradual legislation and abrogation regarding fosterage."
  },
  "importantWords": [
    {
      "arabic": "رَضَعَاتٍ",
      "english": "Sucklings / Feedings",
      "urdu": "دودھ پینا / رضعات"
    },
    {
      "arabic": "مَعْلُومَاتٍ",
      "english": "Known / Distinct",
      "urdu": "معلوم / متعین"
    },
    {
      "arabic": "نُسِخْنَ",
      "english": "Abrogated / Cancelled",
      "urdu": "منسوخ کر دی گئیں"
    },
    {
      "arabic": "يُحَرِّمْنَ",
      "english": "They make unlawful",
      "urdu": "وہ (نکاح کو) حرام کر دیتی ہیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں رضاعت (دودھ پلانے) کے ذریعے حرمت ثابت ہونے کی نصابی مقدار بیان کی گئی ہے، جو کہ حتمی طور پر پانچ بار پیٹ بھر کر دودھ پینا ہے۔",
    "english": "This Hadith specifies the legal requirement for establishing a foster relationship that prohibits marriage, which is five distinct and full feedings."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1452)",
      "english": "Reported by Muslim (1452)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نسخ اور تدریجِ احکام",
        "english": "Abrogation and Gradual Legislation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احکامات میں تبدیلی",
              "english": "Changes in Rulings"
            },
            "content": {
              "urdu": [
                "شریعت کے ابتدائی دور میں حرمت کے لیے دس بار دودھ پینے کی شرط تھی۔",
                "بعد میں اللہ تعالیٰ نے تخفیف فرماتے ہوئے اسے پانچ بار کر دیا۔",
                "یہ 'نسخ' (Abrogation) کی ایک قسم ہے جہاں تلاوت منسوخ ہو گئی مگر حکم باقی رہا۔"
              ],
              "english": [
                "In the early stages of Shariah, ten feedings were required for prohibition.",
                "Later, Allah reduced the requirement to five distinct feedings.",
                "This is a type of abrogation where the recitation was removed, but the ruling remained."
              ]
            }
          },
          {
            "title": {
              "urdu": "وفاتِ نبوی ﷺ کے وقت صورتحال",
              "english": "Situation at the Prophet's (ﷺ) Death"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہؓ کا مطلب یہ ہے کہ تلاوت کے منسوخ ہونے کا علم کچھ صحابہ کو دیر سے ہوا۔",
                "اسی لیے کچھ لوگ وفاتِ نبوی کے قریب تک اسے قرآن سمجھ کر پڑھتے رہے۔",
                "بعد میں اجماع ہو گیا کہ یہ الفاظ قرآن کا حصہ نہیں بلکہ صرف شرعی حکم ہیں۔"
              ],
              "english": [
                "Aishah (RA) meant that the knowledge of the verse's abrogation reached some late.",
                "Thus, some continued reciting it as Qur'an near the time of the Prophet's death.",
                "Consensus later established that these words are not part of the Mushaf, only the ruling applies."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رضاعت کی مقدار اور فقہی مذاہب",
        "english": "Amount of Suckling and Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شافعی اور حنبلی موقف",
              "english": "Shafi'i and Hanbali View"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد بن حنبل اس حدیث کی بنیاد پر پانچ رضعات کے قائل ہیں۔",
                "ان کے نزدیک پانچ سے کم بار دودھ پینے سے نکاح حرام نہیں ہوتا۔",
                "یہ مقدار ایسی ہونی چاہیے جسے عرفِ عام میں 'پیٹ بھر کر پینا' کہا جا سکے۔"
              ],
              "english": [
                "Imams Shafi'i and Ahmad base their view on this Hadith, requiring five feedings.",
                "According to them, less than five feedings do not establish a foster relationship.",
                "The amount must be what is customarily recognized as a full feeding."
              ]
            }
          },
          {
            "title": {
              "urdu": "احناف اور مالکیہ کا موقف",
              "english": "Hanafi and Maliki View"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ اور امام مالک کے نزدیک ایک بار دودھ پینا بھی حرمت ثابت کر دیتا ہے۔",
                "وہ قرآن کی عام آیت 'وأمهاتكم اللاتي أرضعنكم' سے استدلال کرتے ہیں۔",
                "تاہم، سیدہ عائشہؓ کی یہ صریح روایت پہلے موقف کی زیادہ تائید کرتی ہے۔"
              ],
              "english": [
                "Imams Abu Hanifa and Malik hold that even a single feeding establishes prohibition.",
                "They derive this from the general Quranic verse regarding foster mothers.",
                "However, this explicit narration from Aishah (RA) provides stronger evidence for the five-feeding view."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور شرائط",
        "english": "Wisdom and Conditions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معلوم اور متفرق رضعات",
              "english": "Known and Distinct Feedings"
            },
            "content": {
              "urdu": [
                "حدیث میں 'معلومات' کی قید سے مراد یہ ہے کہ شک کی بنیاد پر فیصلہ نہیں ہوگا۔",
                "پانچوں بار دودھ پینا الگ الگ اوقات میں ہونا ضروری ہے۔",
                "اگر بچہ ایک ہی بار میں وقفہ کر کے پیئے تو وہ ایک ہی رضعت شمار ہوگی۔"
              ],
              "english": [
                "The term 'known' implies that rulings are not based on mere doubt.",
                "The five feedings must occur at distinct and separate times.",
                "If a child pauses and continues in one sitting, it counts as a single feeding."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی نشوونما",
              "english": "Physical Growth"
            },
            "content": {
              "urdu": [
                "پانچ بار دودھ پینے سے بچے کی ہڈیوں اور گوشت کی بناوٹ پر اثر پڑتا ہے۔",
                "یہی وہ بنیاد ہے جس کی وجہ سے دودھ پلانے والی عورت حقیقی ماں کے قائم مقام ہو جاتی ہے۔",
                "شریعت نے ایک معقول حد مقرر کر کے انسانی رشتوں میں نظم و ضبط پیدا کیا ہے۔"
              ],
              "english": [
                "Five feedings significantly contribute to the child's physical development.",
                "This serves as the basis for the foster mother taking the status of a biological mother.",
                "Shariah established a reasonable limit to bring discipline to human relationships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور علمی اسباق",
        "english": "Educational and Scholarly Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدہ عائشہؓ کی علمی فقاہت",
              "english": "Aishah's (RA) Juristic Depth"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہؓ پیچیدہ شرعی مسائل اور تاریخِ احکام کی ماہر تھیں۔",
                "صحابہ کرام مشکل مسائل کے حل کے لیے ان کی طرف رجوع کرتے تھے۔",
                "ان کی روایات شریعت کے ارتقاء کو سمجھنے میں کلیدی اہمیت رکھتی ہیں۔"
              ],
              "english": [
                "Aishah (RA) was an expert in complex Shariah issues and the history of rulings.",
                "Companions frequently consulted her to resolve difficult legal matters.",
                "Her narrations are vital in understanding the chronological development of Shariah."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط کا تقاضا",
              "english": "Requirement of Caution"
            },
            "content": {
              "urdu": [
                "نکاح اور حرمت جیسے معاملات میں مکمل یقین کا ہونا لازمی ہے۔",
                "اگر رضاعت کی تعداد میں شک ہو تو 'اصل' (عدمِ حرمت) پر عمل کیا جائے گا۔",
                "دین میں غلو اور وہم کے بجائے ٹھوس شرعی دلائل کی پیروی کرنی چاہیے۔"
              ],
              "english": [
                "Certainty is mandatory in matters of marriage and legal prohibitions.",
                "If the number of feedings is doubtful, the default state (no prohibition) applies.",
                "One should follow solid Shariah evidence rather than extremism or baseless doubts."
              ]
            }
          }
        ]
      }
    }
  ]
}