{
  "hadithId": 384,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-384"],
    "kitabId": 2,
    "inKitabBab": 13,
    "arabicBook": "بلوغ المرام",
    "babId": 23
  },
 
  "takhreej": {
    "arabic": "ضعيف.‏ رواه الدارقطني (2/58) وضعفه، وفي سنده ليد بن سلمة، وهو ضعيف، والحديث مخالف للقواعد العامة في الصلاة.",
    "urdu": "یہ حدیث ضعیف ہے۔ اسے امام دارقطنی نے روایت کیا اور اسے خود ہی ضعیف قرار دیا۔ اس کی سند میں لیث بن ابی سلیم یا لید بن سلمہ جیسے راویوں کی وجہ سے ضعف پایا جاتا ہے۔",
    "english": "Weak. Reported by Ad-Daraqutni (2/58), who also declared it weak. Its chain contains weak narrators and it contradicts the general principles of prayer."
  },
  "importantWords": [
    {
      "arabic": "مَرْفُوعًا",
      "english": "Marfu' (Attributed to Prophet)",
      "urdu": "مرفوع (نبی ﷺ تک منسوب)"
    },
    {
      "arabic": "صَلَاةِ اَلْخَوْفِ",
      "english": "Fear Prayer",
      "urdu": "نماز خوف"
    },
    {
      "arabic": "سَهْوٌ",
      "english": "Forgetfulness",
      "urdu": "بھول چوک"
    },
    {
      "arabic": "لَيْسَ",
      "english": "There is no",
      "urdu": "نہیں ہے"
    },
    {
      "arabic": "إِسْنَادٍ",
      "english": "Chain of transmission",
      "urdu": "سند"
    }
  ],
  "summary": {
    "urdu": "اس روایت کے مطابق نماز خوف میں سجدہ سہو نہیں ہے، لیکن یہ بات علمی اور فنی طور پر ثابت نہیں ہے کیونکہ روایت ضعیف ہے۔",
    "english": "According to this narration, there is no prostration of forgetfulness in the Fear Prayer, but this claim is not established due to the weakness of the report."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني (2/58)",
      "english": "Sunan Ad-Daraqutni (2/58)"
    },
    {
      "arabic": "نصب الراية (2/212)",
      "english": "Nasb al-Rayah (2/212)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=sujud+sahw+in+salah+al+khawf+urdu",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی فنی حیثیت",
        "english": "Technical Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری",
              "english": "Weakness of the Chain"
            },
            "content": {
              "urdu": [
                "امام دارقطنی نے اسے نقل کرنے کے بعد خود اس کے ضعف کی نشاندہی کی ہے۔",
                "اس کی سند میں ایسے راوی موجود ہیں جن کی حفظ کی صلاحیت متنازع ہے۔",
                "ایسی ضعیف روایات سے فقہی احکام کشید کرنا درست نہیں ہے۔"
              ],
              "english": [
                "Imam Ad-Daraqutni himself pointed out the weakness after narrating it.",
                "The chain includes narrators whose memory and reliability are disputed.",
                "Deriving legal rulings from such weak narrations is not permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصولِ صلوٰۃ سے تعارض",
              "english": "Contradiction with Prayer Principles"
            },
            "content": {
              "urdu": [
                "سجدہ سہو کا مقصد نماز میں ہونے والی کمی کی تلافی کرنا ہے۔",
                "نماز خوف میں بھی بھول چوک کا امکان موجود رہتا ہے۔",
                "عام اصول یہ ہے کہ ہر نماز میں بھولنے پر سجدہ سہو واجب ہوتا ہے۔"
              ],
              "english": [
                "Sujud as-Sahw is meant to compensate for deficiencies in prayer.",
                "The possibility of forgetfulness exists even in the Fear Prayer.",
                "The general rule is that Sujud as-Sahw is required in every prayer if needed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز خوف میں سجدہ سہو کا حکم",
        "english": "Ruling on Sahw in Fear Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور کا موقف",
              "english": "Position of the Majority"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک اگر امام سے غلطی ہو جائے تو سجدہ سہو ضروری ہے۔",
                "اگر مقتدی امام کے ساتھ ہو تو امام کا سجدہ اسے کافی ہوتا ہے۔",
                "نماز خوف میں بھی نماز کے بنیادی ارکان کی حفاظت لازم ہے۔"
              ],
              "english": [
                "Most scholars believe if the Imam errs, Sujud as-Sahw is necessary.",
                "If the follower is with the Imam, the Imam's prostration suffices.",
                "In Fear Prayer, preserving the basic pillars of prayer is essential."
              ]
            }
          },
          {
            "title": {
              "urdu": "انتہائی خوف کی حالت",
              "english": "State of Extreme Fear"
            },
            "content": {
              "urdu": [
                "اگر لڑائی اتنی شدید ہو کہ سجدہ کرنا ناممکن ہو تو رعایت دی جاتی ہے۔",
                "ایسی حالت میں جہاں نماز اشارے سے ہو، وہاں سجدہ سہو کا تصور بدل جاتا ہے۔",
                "شریعت نے مشقت کے وقت آسانی کا اصول مدنظر رکھا ہے۔"
              ],
              "english": [
                "If combat is so intense that prostration is impossible, concessions apply.",
                "When prayer is done via gestures, the concept of Sujud as-Sahw changes.",
                "Sharia keeps the principle of ease in mind during times of hardship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سجدہ سہو کی اہمیت",
        "english": "Importance of Sujud as-Sahw"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کی تکمیل",
              "english": "Completion of Worship"
            },
            "content": {
              "urdu": [
                "سجدہ سہو نماز کی کمی کو پورا کر کے اسے اللہ کے ہاں مقبول بناتا ہے۔",
                "یہ شیطان کو ذلیل کرنے اور اپنی عاجزی کا اظہار کرنے کا ذریعہ ہے۔",
                "اس سے ثابت ہوتا ہے کہ انسان خطا کا پتلا ہے اور اللہ بے عیب ہے۔"
              ],
              "english": [
                "Sujud as-Sahw fixes gaps in prayer to make it acceptable to Allah.",
                "It is a means of humbling oneself and frustrating the Shaitan.",
                "It proves that man is prone to error while Allah is perfect."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی احتیاط",
              "english": "Religious Caution"
            },
            "content": {
              "urdu": [
                "نماز جیسے اہم فریضہ میں احتیاط برتنا ہر مسلمان کا فرض ہے۔",
                "روایات کی تحقیق کے بغیر کسی رخصت کو نہیں اپنانا چاہیے۔",
                "علمی دیانت کا تقاضا ہے کہ صرف مستند احکام پر عمل کیا جائے۔"
              ],
              "english": [
                "Taking caution in a duty as vital as prayer is every Muslim's job.",
                "Concessions should not be adopted without verifying the reports.",
                "Academic honesty requires following only authenticated rulings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی پہلو",
        "english": "Educational Perspective"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محدثین کی کاوشیں",
              "english": "Efforts of Hadith Scholars"
            },
            "content": {
              "urdu": [
                "محدثین نے ضعیف روایات کی نشاندہی کر کے دین کو ملاوٹ سے بچایا۔",
                "امام دارقطنی کا روایت نقل کر کے اس پر جرح کرنا ان کی دیانت ہے۔",
                "ہمیں دین سیکھنے کے لیے ان معتبر مآخذ کی طرف رجوع کرنا چاہیے۔"
              ],
              "english": [
                "Scholars protected religion by identifying weak narrations.",
                "Imam Daraqutni's critique after narrating shows his integrity.",
                "We should refer to these reliable sources to learn our religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی زندگی میں اطلاق",
              "english": "Practical Application"
            },
            "content": {
              "urdu": [
                "سخت حالات میں بھی نماز کے آداب کا خیال رکھنا مومن کی نشانی ہے۔",
                "بنیادی احکام کو ضعیف روایات کی بنیاد پر ترک نہیں کرنا چاہیے۔",
                "علم حاصل کرنا اور اس کی حقیقت تک پہنچنا ہر مسلمان پر لازم ہے۔"
              ],
              "english": [
                "Following prayer etiquettes even in hardship is a sign of faith.",
                "Basic rulings should not be abandoned based on weak reports.",
                "Seeking knowledge and reaching its truth is mandatory for all."
              ]
            }
          }
        ]
      }
    }
  ]
}
