{
  "hadithId": 555,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/555"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1969)، ومسلم (1156). وأخرج نحوه النسائي وأبو داود.",
    "urdu": "صحیح۔ اسے بخاری (1969) اور مسلم (1156) نے روایت کیا ہے۔ یہ روایت شعبان کی فضیلت اور نفلی روزوں میں اعتدال پر مبنی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1969) and Muslim (1156). It highlights the merit of Sha'ban and moderation in voluntary fasting."
  },
  "importantWords": [
    {
      "arabic": "اِسْتَكْمَلَ",
      "english": "Completed",
      "urdu": "مکمل کیا"
    },
    {
      "arabic": "قَطُّ",
      "english": "Ever / Never",
      "urdu": "کبھی بھی"
    },
    {
      "arabic": "أَكْثَرَ",
      "english": "More / Most",
      "urdu": "زیادہ"
    },
    {
      "arabic": "يُفْطِرُ",
      "english": "Breaks fast / Does not fast",
      "urdu": "روزہ نہ رکھنا / افطار کرنا"
    },
    {
      "arabic": "شَعْبَانَ",
      "english": "Sha'ban",
      "urdu": "شعبان (اسلامی مہینہ)"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ صرف رمضان کے پورے روزے رکھتے تھے، تاہم نفلی روزوں میں آپ ﷺ شعبان کے مہینے کو بہت اہمیت دیتے تھے اور اس میں کثرت سے روزے رکھتے تھے۔",
    "english": "The Prophet (ﷺ) only ever fasted a full month during Ramadan, but among voluntary fasts, he prioritized Sha'ban more than any other month."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1969)",
      "english": "Reported by Al-Bukhari (1969)"
    },
    {
      "arabic": "رواه مسلم (1156)",
      "english": "Reported by Muslim (1156)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Xh0lD-8L7Y8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نفلی روزوں میں نبوی طرزِ عمل",
        "english": "Prophetic Approach to Voluntary Fasting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال اور میانہ روی",
              "english": "Moderation and Balance"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے روزوں کا کوئی مستقل طے شدہ شیڈول نہیں تھا بلکہ آپ ﷺ حالات کے مطابق روزے رکھتے تھے۔",
                "کبھی آپ ﷺ مسلسل روزے رکھتے اور کبھی مسلسل ناغہ فرماتے تاکہ امت پر بوجھ نہ بنے۔",
                "یہ طرزِ عمل ظاہر کرتا ہے کہ نفلی عبادات میں انسان کو اپنی ہمت اور نشاط کا خیال رکھنا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not follow a rigid schedule for voluntary fasts but adapted to circumstances.",
                "He would sometimes fast consecutively and sometimes abstain, ensuring no undue burden on the Ummah.",
                "This practice shows that one should consider personal strength and enthusiasm in voluntary worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "صرف رمضان کے مکمل روزے",
              "english": "Full Fasting Only in Ramadan"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے رمضان کے علاوہ کسی اور مہینے کے پورے ۳۰ روزے کبھی نہیں رکھے۔",
                "یہ رمضان کی امتیازی شان اور اس کی فرضیت کو دیگر مہینوں سے ممتاز کرنے کے لیے تھا۔",
                "مسلمانوں کو چاہیے کہ وہ رمضان کے علاوہ کسی مہینے کو مکمل روزوں کے لیے خاص نہ کریں۔"
              ],
              "english": [
                "The Prophet (ﷺ) never fasted a full 30 days in any month other than Ramadan.",
                "This was to maintain the unique status of Ramadan and distinguish its obligation from other months.",
                "Muslims should avoid dedicating any other full month exclusively to fasting as a regular sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شعبان کے روزوں کی اہمیت",
        "english": "Significance of Fasting in Sha'ban"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمضان کی تیاری",
              "english": "Preparation for Ramadan"
            },
            "content": {
              "urdu": [
                "شعبان میں کثرت سے روزے رکھنا دراصل رمضان المبارک کے لیے جسمانی اور روحانی تیاری ہے۔",
                "اس سے انسان روزوں کا عادی ہو جاتا ہے اور رمضان شروع ہوتے ہی مشقت محسوس نہیں ہوتی۔",
                "شعبان کے روزے رمضان کے فرض روزوں کے لیے ویسے ہی ہیں جیسے فرض نماز سے پہلے سنتیں۔"
              ],
              "english": [
                "Fasting frequently in Sha'ban serves as physical and spiritual preparation for the holy month of Ramadan.",
                "It helps the body acclimatize to fasting so that Ramadan does not feel sudden or burdensome.",
                "Sha'ban fasts relate to Ramadan much like Sunnah prayers relate to the obligatory (Fard) prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعمال کی پیشی کا مہینہ",
              "english": "The Month of Actions being Raised"
            },
            "content": {
              "urdu": [
                "دیگر احادیث میں ذکر ہے کہ شعبان میں بندوں کے اعمال اللہ کے حضور پیش کیے جاتے ہیں۔",
                "نبی ﷺ نے پسند فرمایا کہ جب آپ کے اعمال پیش ہوں تو آپ ﷺ روزے کی حالت میں ہوں۔",
                "یہ مہینہ غفلت کا مہینہ سمجھا جاتا ہے، اس لیے اس میں عبادت کا اجر بھی زیادہ ہے۔"
              ],
              "english": [
                "Other narrations mention that in Sha'ban, deeds are raised to Allah the Almighty.",
                "The Prophet (ﷺ) loved to be in a state of fasting while his annual deeds were being presented.",
                "This month is often neglected by people, thus worship during this time carries extra merit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور حدود",
        "english": "Juristic Rulings and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "۱۵ شعبان کے بعد روزہ",
              "english": "Fasting After Mid-Sha'ban"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ان لوگوں کو شعبان کے آخری دنوں میں روزہ رکھنے سے روکا ہے جو عادی نہیں ہیں۔",
                "تاہم جو شخص پہلے سے روزے رکھ رہا ہو، وہ ۱۵ شعبان کے بعد بھی جاری رکھ سکتا ہے۔",
                "مقصد یہ ہے کہ انسان رمضان کے استقبال کے لیے تروتازہ رہے اور حد سے زیادہ کمزور نہ ہو۔"
              ],
              "english": [
                "The Prophet (ﷺ) discouraged fasting in the last days of Sha'ban for those not accustomed to it.",
                "However, if someone has a habit of fasting, they may continue even after the 15th of Sha'ban.",
                "The goal is to remain fresh for Ramadan and avoid entering it in a state of extreme weakness."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفل روزے اور حقوق العباد",
              "english": "Voluntary Fasting and Human Rights"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا مسلسل روزے چھوڑنا اس لیے تھا تاکہ وہ اپنے گھر والوں اور دیگر امور کو وقت دے سکیں۔",
                "اسلام میں حقوق اللہ اور حقوق العباد کے درمیان توازن قائم کرنا سنت ہے۔",
                "صرف عبادت میں غرق ہو کر گھر والوں کے حقوق پامال کرنا پسندیدہ نہیں ہے۔"
              ],
              "english": [
                "The Prophet's period of not fasting allowed him to fulfill marital duties and social responsibilities.",
                "It is Sunnah to maintain a balance between the rights of Allah and the rights of people.",
                "Total immersion in voluntary worship at the expense of family rights is discouraged."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور تربیت",
        "english": "Practical Lesson and Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تدریجی ترقی",
              "english": "Gradual Progress"
            },
            "content": {
              "urdu": [
                "شعبان کے روزے ہمیں سکھاتے ہیں کہ بڑے ہدف (رمضان) کے لیے آہستہ آہستہ خود کو تیار کریں۔",
                "دین میں ثابت قدمی کے لیے یکدم بوجھ ڈالنے کے بجائے تدریج اختیار کرنا بہتر ہے۔",
                "جو شخص شعبان میں روزے رکھتا ہے، اس کے لیے رمضان کی برکات سمیٹنا آسان ہو جاتا ہے۔"
              ],
              "english": [
                "Sha'ban fasts teach us to gradually prepare ourselves for major goals like Ramadan.",
                "For steadfastness in religion, gradual progression is better than sudden, heavy burdens.",
                "Those who fast in Sha'ban find it easier to reap the full spiritual harvest of Ramadan."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی زندگی میں نفلی روزوں کا کچھ حصہ ضرور شامل کریں۔",
                "خاص طور پر شعبان کے مہینے میں جتنا ہو سکے سنت کے مطابق روزے رکھنے کی کوشش کریں۔",
                "عبادت میں تنوع اور نشاط پیدا کرنا سنتِ نبوی پر عمل پیرا ہونے کا راستہ ہے۔"
              ],
              "english": [
                "We should strive to incorporate a portion of voluntary fasting into our regular lives.",
                "In particular, we should try to fast as much as possible during Sha'ban in line with the Sunnah.",
                "Creating variety and renewed energy in worship is the way to follow the Prophetic path."
              ]
            }
          }
        ]
      }
    }
  ]
}