{
  "hadithId": 669,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/abudawud:3499"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أحمد (5/191)، وأبو داود (3499)، وابن حبان (1120 موارد)، والحاكم (2/40).",
    "urdu": "یہ حدیث حسن درجے کی ہے، اسے احمد، ابو داؤد، ابن حبان اور حاکم نے روایت کیا ہے۔ امام ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan (Good). Reported by Ahmad (5/191), Abu Dawud (3499), Ibn Hibban (1120), and Al-Hakim (2/40). Authenticated by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "اِبْتَعْتُ",
      "english": "I bought",
      "urdu": "میں نے خریدا"
    },
    {
      "arabic": "اِسْتَوْجَبْتُهُ",
      "english": "I acquired it",
      "urdu": "میں نے اسے واجب کر لیا / وصول کر لیا"
    },
    {
      "arabic": "تَحُوزَهُ",
      "english": "You possess/transfer it",
      "urdu": "تم اسے اپنی جگہ لے جاؤ"
    },
    {
      "arabic": "اَلسِّلَعُ",
      "english": "Commodities / Goods",
      "urdu": "سامانِ تجارت"
    },
    {
      "arabic": "رِحَالِهِمْ",
      "english": "Their dwellings / Places",
      "urdu": "ان کے ٹھکانے / گھر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ خریدا ہوا سامان اسی جگہ فروخت کرنا منع ہے، جب تک اسے وہاں سے منتقل کر کے اپنے مکمل قبضے میں نہ لے لیا جائے۔",
    "english": "This Hadith establishes that it is forbidden to resell purchased goods at the same spot until they are moved and taken into full physical possession."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3499)",
      "english": "Reported by Abu Dawud (3499)"
    },
    {
      "arabic": "رواه أحمد (5/191)",
      "english": "Reported by Ahmad (5/191)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    },
    {
      "id": 2,
      "name": {
        "arabic": "زيد بن ثابت",
        "english": "Zaid bin Thabit"
      },
      "slug": "zaid-bin-thabit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبضہ کی حقیقت اور منتقلی",
        "english": "Concept of Possession and Transfer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبضہِ جسمانی کی اہمیت",
              "english": "Importance of Physical Possession"
            },
            "content": {
              "urdu": [
                "محض کاغذات پر ملکیت کا تبادلہ کافی نہیں بلکہ سامان کی جگہ تبدیل کرنا ضروری ہے۔",
                "سامان کو اس کی جگہ سے ہٹانا 'حوز' (منتقلی) کہلاتا ہے جو قبضے کی تکمیل ہے۔",
                "جب تک سامان منتقل نہ ہو، ذمہ داری (Risk) مکمل طور پر منتقل نہیں ہوتی۔"
              ],
              "english": [
                "Mere transfer of ownership on paper is insufficient; moving the goods is necessary.",
                "Moving goods from their place is called 'Hauz', which completes the possession.",
                "Until the goods are moved, the liability (risk) is not fully transferred to the buyer."
              ]
            }
          },
          {
            "title": {
              "urdu": "جائے وقوعہ پر فروخت کی ممانعت",
              "english": "Prohibition of Sale at Purchase Spot"
            },
            "content": {
              "urdu": [
                "اسی مقام پر بیچنے سے بازاری قیمتوں میں بلاوجہ مصنوعی اضافہ ہوتا ہے۔",
                "اس ممانعت سے تجارت میں 'غرر' (دھوکہ) اور 'ربا' (سود) کے امکانات ختم ہوتے ہیں۔",
                "اسلامی شریعت حقیقی مادی تبادلے پر مبنی معیشت کو پسند کرتی ہے۔"
              ],
              "english": [
                "Selling at the same spot causes an unnecessary artificial rise in market prices.",
                "This prohibition eliminates potential for 'Gharar' (deception) and 'Riba' (usury).",
                "Islamic Sharia favors an economy based on real, physical exchange of commodities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور اطلاق",
        "english": "Juristic Wisdom and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Position of Majority Jurists"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام احمد کے نزدیک ہر منقولہ چیز میں منتقلی ضروری ہے۔",
                "اگر سامان ضائع ہو جائے تو اس کا نقصان خریدار پر تبھی آئے گا جب وہ اسے منتقل کر لے۔",
                "یہ اصول مارکیٹ میں اشیاء کی حقیقی گردش کو یقینی بناتا ہے۔"
              ],
              "english": [
                "According to Shafi'i and Ahmad, transfer is necessary for all movable property.",
                "Liability for loss falls on the buyer only after they have moved the goods.",
                "This principle ensures the actual circulation of goods within the market."
              ]
            }
          },
          {
            "title": {
              "urdu": "دھوکے سے بچاؤ",
              "english": "Prevention of Deception"
            },
            "content": {
              "urdu": [
                "بغیر قبضے کے فروخت سے ایک ہی چیز کئی بار بکتی ہے بغیر کسی مادی تبدیلی کے۔",
                "اس سے معاشرے میں سٹہ بازی اور فرضی تجارت کو فروغ ملتا ہے۔",
                "شریعت کا مقصد خریدار اور بیچنے والے کے درمیان شفافیت قائم کرنا ہے۔"
              ],
              "english": [
                "Reselling without possession leads to a single item being sold multiple times artificially.",
                "This promotes speculation and fictitious trade within the community.",
                "The Sharia aims to establish absolute transparency between buyer and seller."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کا طرزِ عمل",
        "english": "Conduct of the Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امر بالمعروف اور نصیحت",
              "english": "Enjoining Good and Advice"
            },
            "content": {
              "urdu": [
                "سیدنا زید بن ثابت نے ابن عمر کو فوراً ٹوکا تاکہ وہ غلطی سے بچ جائیں۔",
                "صحابہ کرام بازاروں میں بھی ایک دوسرے کی شرعی رہنمائی فرماتے تھے۔",
                "یہ واقعہ سنتِ نبوی پر عمل کرنے کی شدید تڑپ کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Zaid bin Thabit immediately corrected Ibn Umar to save him from a mistake.",
                "Companions provided Sharia guidance to one another even in marketplaces.",
                "This incident shows their intense desire to strictly follow the Prophetic Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی گرفت",
              "english": "Scholarly Authority"
            },
            "content": {
              "urdu": [
                "سیدنا ابن عمر نے اپنے سے بڑے عالم (زید بن ثابت) کی بات کو بخوشی تسلیم کیا۔",
                "بازو پکڑ کر روکنا اس مسئلے کی اہمیت اور نزاکت کو واضح کرتا ہے۔",
                "سودے بازی میں منافع کے لالچ پر شرعی حکم کو مقدم رکھنا عین ایمان ہے۔"
              ],
              "english": [
                "Ibn Umar happily accepted the correction from a senior scholar like Zaid.",
                "Catching the arm signifies the urgency and importance of this legal issue.",
                "Prioritizing Sharia over the lure of profit in bargaining is the essence of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید تجارتی مسائل",
        "english": "Modern Commercial Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سٹاک مارکیٹ اور ڈیلیوری",
              "english": "Stock Market and Delivery"
            },
            "content": {
              "urdu": [
                "بغیر قبضے کے شیئرز یا مال کو آگے بیچنا اس حدیث کی روشنی میں ناجائز ہے۔",
                "ڈیجیٹل قبضے (Constructive Possession) کی صورتیں بھی اب اہم ہیں۔",
                "اصول وہی رہے گا کہ سامان بیچنے والے کے مکمل کنٹرول میں ہونا چاہیے۔"
              ],
              "english": [
                "Reselling shares or goods without taking possession is invalid per this Hadith.",
                "Modern forms of constructive possession are now a subject of juristic debate.",
                "The core principle remains: the goods must be under the seller's full control."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفعِ حلال کی پہچان",
              "english": "Identifying Halal Profit"
            },
            "content": {
              "urdu": [
                "وہی نفع برکت والا ہے جو شرعی ضوابط کے مطابق کمایا گیا ہو۔",
                "صرف کاغذوں کا ہیر پھیر حقیقی تجارت نہیں بلکہ معاشی بوجھ ہے۔",
                "مسلم تاجر کو چاہیے کہ وہ مال کی منتقلی اور قبضے کے بعد ہی اسے فروخت کرے۔"
              ],
              "english": [
                "Only profit earned through Sharia-compliant regulations contains divine blessing.",
                "Paper shuffling is not real trade; rather, it is an economic burden on society.",
                "A Muslim merchant should only sell goods after transfer and full possession."
              ]
            }
          }
        ]
      }
    }
  ]
}