{
  "hadithId": 204,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري في كتاب الصلاة، باب الخباء في المسجد (439) في قصة الوشاح المشهورة، وهي وليدة من بني الحارث بن الخزرج. والقول بأن الحديث من أفراد البخاري وهمٌ من الحافظ، لأن اللفظ 'كان لها خباء في المسجد' بخاری میں ہی ہے۔",
    "urdu": "صحیح ہے۔ اسے بخاری نے کتاب الصلاة، باب الخباء فی المسجد (439) میں مشہور قصہ وشاح کے تحت روایت کیا ہے، اور وہ بنو حارث بن خزرج کی آزاد کردہ لونڈی تھی۔ یہ قول کہ یہ حدیث مسلم میں بھی ہے، درست نہیں بلکہ یہ بخاری کی منفرد روایت ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari in the Book of Prayer, Chapter: A tent (Khaba') in the mosque (439), in the well-known story of Al-Wishah (the necklace). The statement that the Hadith is Muttafaq 'Alayh might be slightly inaccurate, as the specific wording 'had a tent in the mosque' is unique to Al-Bukhari."
  },
  "importantWords": [
    {
      "arabic": "وليدة سوداء",
      "english": "Black slave-girl (liberated)",
      "urdu": "سیاہ رنگ کی آزاد کردہ لڑکی"
    },
    {
      "arabic": "خباء",
      "english": "Small tent/Shelter",
      "urdu": "چھوٹا خیمہ"
    },
    {
      "arabic": "تأتيني",
      "english": "She used to come to me",
      "urdu": "وہ میرے پاس آتی تھی"
    },
    {
      "arabic": "فتحدث",
      "english": "And converse/talk",
      "urdu": "اور باتیں کرتی تھی"
    },
    {
      "arabic": "المسجد",
      "english": "The Mosque",
      "urdu": "مسجد"
    },
    {
      "arabic": "كان لها",
      "english": "She had",
      "urdu": "اس کا تھا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسجد کے کثیر المقاصد استعمال کو ظاہر کرتی ہے، جہاں ضرورت کے تحت عارضی رہائش (خیمہ) بھی لگایا جا سکتا ہے، جیسے کہ ایک غریب صحابیہ نے مسجد میں اپنا خیمہ لگا رکھا تھا۔ اس سے یہ بھی ثابت ہوتا ہے کہ مسجد ایک سماجی مرکز تھی جہاں لوگ ایک دوسرے سے ملتے اور دینی و دنیاوی گفتگو کرتے تھے۔",
    "english": "This Hadith demonstrates the multi-purpose use of the mosque, where temporary residency (a small tent) could be set up out of necessity, as done by a poor female Companion. It also proves that the mosque was a social center where people met and engaged in religious and general conversations."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب الخباء في المسجد (439)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: A tent (Khaba') in the mosque (439)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "وليدة سوداء (التي أسلمت)",
        "english": "Black Slave-girl (who became Muslim)"
      },
      "slug": "black-slave-girl"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S8L_o_0aJkU",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسجد میں عارضی رہائش",
        "english": "Temporary Residence in the Mosque"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غریب اور بے گھر کی پناہ گاہ",
              "english": "Shelter for the Poor and Homeless"
            },
            "content": {
              "urdu": [
                "اس عورت کا مسجد میں خیمہ لگانا اس بات کی دلیل ہے کہ مسجد بے گھر اور ضرورت مندوں کی پناہ گاہ بھی تھی۔",
                "یہ وہی اصول ہے جو اصحابِ صفہ کے لیے مسجد کے ایک حصے (صفہ) کو مخصوص کرنے سے بھی ثابت ہوتا ہے۔",
                "مسجد مسلمانوں کے لیے صرف عبادت کی جگہ نہیں بلکہ سماجی کفالت کا ایک ذریعہ بھی تھی۔"
              ],
              "english": [
                "The woman erecting a tent in the mosque proves that the mosque also served as a shelter for the homeless and needy.",
                "This principle is also established by designating a section of the mosque (Suffah) for the Companions known as 'Ahl As-Suffah'.",
                "The mosque was not only a place of worship for Muslims but also a means of social security."
              ]
            }
          },
          {
            "title": {
              "urdu": "خیمہ لگانے کا مقصد",
              "english": "Purpose of Erecting the Tent"
            },
            "content": {
              "urdu": [
                "خیمہ (خباء) یا چوبی مکان (حفش) لگانے سے مراد اس عورت کے لیے پردہ اور ذاتی سامان رکھنے کی جگہ بنانا تھا۔",
                "یہ خیمہ عارضی ضرورت کی بنا پر لگایا گیا تھا اور یہ مسجد کا مستقل حصہ نہیں تھا۔",
                "مسجد میں قیام اس وقت تک جائز ہے جب تک وہ اس کے تقدس اور طہارت کو متاثر نہ کرے۔"
              ],
              "english": [
                "The tent (Khaba') or wooden structure (Hafsh) was intended to provide privacy and space for personal belongings for the woman.",
                "This tent was set up for a temporary necessity and was not a permanent structure of the mosque.",
                "Staying in the mosque is permissible as long as it does not compromise its sanctity and purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسجد میں بات چیت اور تعلق",
        "english": "Conversation and Relationship in the Mosque"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی گفتگو کا جواز",
              "english": "Permissibility of Mutual Conversation"
            },
            "content": {
              "urdu": [
                "اس حدیث میں ذکر ہے کہ وہ عورت سیدہ عائشہ رضی اللہ عنہا کے پاس آ کر بات چیت کرتی تھی۔",
                "مسجد میں دنیاوی اور سماجی معاملات پر معتدل گفتگو کرنا جائز ہے، بشرطیکہ وہ شور و غل کا سبب نہ بنے۔",
                "یہ مکالمہ اس عورت کے قبولِ اسلام کی خوشی اور اس کے جذباتی تعلق کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Hadith mentions that the woman used to come to 'Aishah (RA) to converse with her.",
                "It is permissible to have moderate conversations on social and worldly matters in the mosque, provided they do not cause noise.",
                "This dialogue highlights the woman's joy in accepting Islam and her emotional connection."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی رابطے کا مرکز",
              "english": "Center for Social Connection"
            },
            "content": {
              "urdu": [
                "مسجد مسلمانوں کے درمیان باہمی اخلاقی تعلقات قائم کرنے کا بہترین ذریعہ ہے۔",
                "یہ واقعہ ثابت کرتا ہے کہ مسجد مختلف طبقات (آزاد، غلام، غریب) کے درمیان رابطے کی جگہ تھی۔",
                "نبی اکرم صلی اللہ علیہ وسلم کی ازواج مطہرات بھی سماجی سرگرمیوں میں شریک ہوتی تھیں۔"
              ],
              "english": [
                "The mosque is an excellent means for establishing mutual moral relationships among Muslims.",
                "This incident proves that the mosque was a place for interaction between different social classes (free, enslaved, poor).",
                "The wives of the Prophet (PBUH) were also involved in social activities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توحید اور تاریخ کا درس",
        "english": "Lesson of Tawheed and History"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وشاح کا قصہ (گمشدہ چیز)",
              "english": "The Story of Al-Wishah (Lost Necklace)"
            },
            "content": {
              "urdu": [
                "طویل حدیث کا وہ حصہ جس میں وشاح کی گمشدگی اور برآمدگی کا ذکر ہے، ایمان کو تقویت دیتا ہے۔",
                "یہ واقعہ اس بات کو واضح کرتا ہے کہ اللہ تعالیٰ کس طرح اپنے نیک بندوں کو بے گناہی ثابت کرنے میں مدد کرتا ہے۔",
                "اس سیاہ فام عورت کا بے گناہ ثابت ہونا اس کے ایمان کی سچائی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The part of the longer Hadith about the lost and recovered necklace (Wishah) strengthens faith.",
                "This incident clearly illustrates how Allah helps His righteous servants prove their innocence.",
                "The exoneration of the black woman demonstrates the truthfulness of her faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "قصے کا اثر اور شعر",
              "english": "Impact of the Story and Poetry"
            },
            "content": {
              "urdu": [
                "اس واقعہ کے بعد وہ عورت خوشی سے شعر پڑھا کرتی تھی جس کا ذکر حدیث میں ہے۔",
                "شعر پڑھنا (یوم الوشاح من تعاجیب ربنا) اس کی حالت پر اللہ کے فضل کا شکر ادا کرنے کا ذریعہ تھا۔",
                "یہ دوبارہ ثابت ہوا کہ مسجد میں نیک مقصد کے لیے شعر پڑھنا جائز ہے، بشرطیکہ وہ عبادت میں خلل نہ ڈالے۔"
              ],
              "english": [
                "After this event, the woman used to recite poetry (mentioning Al-Wishah) as a way of thanking Allah for His favor.",
                "Reciting the poetry (Yom al-Wishah min ta'ajibi Rabbina) was a means of expressing gratitude for Allah's grace upon her.",
                "This confirms again that reciting purposeful poetry in the mosque is permissible, provided it does not disrupt worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیمے کی ممانعت نہیں",
              "english": "No Prohibition of Tents"
            },
            "content": {
              "urdu": [
                "مسجد میں عارضی خیمے یا رکاوٹیں لگانا منع نہیں، اگر وہ عام نماز اور راستے میں رکاوٹ نہ بنیں۔",
                "یہ عمل مسجد کے فرشی یا مستقل استعمال کو تبدیل کرنے کی کوشش نہیں ہونا چاہیے۔",
                "اعتکاف کے لیے خیمے لگانا اسی حکم اور اصول کے تحت جائز ہے۔"
              ],
              "english": [
                "Erecting temporary tents or barriers in the mosque is not prohibited, provided they do not obstruct general prayer and pathways.",
                "This action should not be an attempt to permanently change the mosque's flooring or usage.",
                "Erecting tents for I'tikaf (spiritual retreat) is permissible under this same ruling and principle."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد کا جامع کردار",
              "english": "Comprehensive Role of the Mosque"
            },
            "content": {
              "urdu": [
                "یہ واقعہ ہمیں سکھاتا ہے کہ مسجد ایک روحانی، تعلیمی، اور سماجی طور پر جامع ادارہ ہے۔",
                "اس میں ضرورت مندوں کو پناہ ملتی ہے اور مسلمانوں کے درمیان باہمی تعلقات استوار ہوتے ہیں۔",
                "ہمیں مساجد کو صرف نماز کے تنگ دائرے تک محدود نہیں کرنا چاہیے بلکہ نبی کی سنت کے مطابق استعمال کرنا چاہیے۔"
              ],
              "english": [
                "This incident teaches us that the mosque is a comprehensive spiritual, educational, and social institution.",
                "It provides shelter for the needy and strengthens mutual relationships among Muslims.",
                "We should not confine mosques to the narrow scope of mere prayer but use them according to the Prophet's Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
