{
  "hadithId": 356,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bukhari:939", "muslim:859"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "صحيح البخاري / صحيح مسلم",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (939)، ومسلم (859).",
    "urdu": "صحیح روایت، اسے امام بخاری (939) اور امام مسلم (859) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (939) and Muslim (859)."
  },
  "importantWords": [
    {
      "arabic": "نَقِيلُ",
      "english": "Take a midday nap",
      "urdu": "قیلولہ کرنا"
    },
    {
      "arabic": "نَتَغَدَّى",
      "english": "Eat lunch",
      "urdu": "دوپہر کا کھانا کھانا"
    },
    {
      "arabic": "بَعْدَ",
      "english": "After",
      "urdu": "کے بعد"
    },
    {
      "arabic": "الْجُمُعَةِ",
      "english": "Friday Prayer",
      "urdu": "جمعہ"
    },
    {
      "arabic": "عَهْدِ",
      "english": "Era / Lifetime",
      "urdu": "زمانہ / عہد"
    },
    {
      "arabic": "اللَّفْظُ",
      "english": "The wording",
      "urdu": "الفاظ"
    }
  ],
  "summary": {
    "urdu": "صحابہ کرام جمعہ کے دن کی اہمیت کی وجہ سے اپنا دوپہر کا آرام اور کھانا نمازِ جمعہ کے بعد تک مؤخر کر دیتے تھے تاکہ وقت پر مسجد پہنچ سکیں۔",
    "english": "Due to the significance of Friday, the Sahaba would postpone their midday nap and lunch until after the prayer to prioritize their presence at the mosque."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (939)",
      "english": "Sahih al-Bukhari (939)"
    },
    {
      "arabic": "صحيح مسلم (859)",
      "english": "Sahih Muslim (859)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سهل بن سعد",
        "english": "Sahl bin Sa'd"
      },
      "slug": "sahl-bin-sad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2uF1f6uK7c",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کے لیے مستعدی",
        "english": "Readiness for Friday"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کو ترجیح دینا",
              "english": "Prioritizing Worship"
            },
            "content": {
              "urdu": [
                "صحابہ کرام رضی اللہ عنہم دنیاوی آرام پر دینی فرائض کو ترجیح دیتے تھے۔",
                "جمعہ کے دن وہ کھانے اور سونے جیسے معمولات کو نماز کے بعد رکھتے تھے۔",
                "یہ طرز عمل اللہ کے احکامات کی تعظیم اور محبت کی نشاندہی کرتا ہے۔"
              ],
              "english": [
                "The Sahaba prioritized religious duties over worldly comforts and rest.",
                "On Fridays, they scheduled lunch and naps after the congregational prayer.",
                "This practice demonstrates profound respect and love for Allah's commands."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی اہمیت",
              "english": "Importance of Timing"
            },
            "content": {
              "urdu": [
                "جمعہ کی نماز کے لیے جلد نکلنا سنتِ نبوی اور افضل عمل ہے۔",
                "کھانے اور آرام میں مشغول ہونا مسجد پہنچنے میں تاخیر کا سبب بن سکتا ہے۔",
                "صحابہ کا یہ معمول اس بات کی ضمانت تھا کہ وہ خطبہ شروع ہونے سے پہلے حاضر ہوں۔"
              ],
              "english": [
                "Heading early for Friday prayer is a Sunnah and a highly virtuous act.",
                "Engaging in meals or rest can lead to delays in reaching the mosque.",
                "The Sahaba's routine guaranteed their presence before the sermon started."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازِ جمعہ کا وقت",
        "english": "Timing of Friday Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زوال سے پہلے نماز",
              "english": "Prayer Before Declining Sun"
            },
            "content": {
              "urdu": [
                "اس حدیث سے بعض فقہاء نے استدلال کیا ہے کہ جمعہ زوال سے پہلے بھی جائز ہے۔",
                "کھانے اور قیلولے کا وقت عموماً زوال کے وقت شروع ہوتا ہے۔",
                "تاہم جمہور کے نزدیک جمعہ کا افضل وقت زوالِ آفتاب کے بعد ہی ہے۔"
              ],
              "english": [
                "Some jurists use this Hadith to argue that Friday prayer is valid before noon.",
                "The time for lunch and naps usually begins exactly at the sun's meridian.",
                "However, the majority of scholars hold that the preferred time is after Zawal."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ صحابہ",
              "english": "Practice of the Sahaba"
            },
            "content": {
              "urdu": [
                "صحابہ کا عمل رسول اللہ ﷺ کی موجودگی میں ان کی تائید پر مبنی تھا۔",
                "انہوں نے اپنی زندگیوں کو نبوی تعلیمات کے سانچے میں ڈھال لیا تھا۔",
                "ان کا یہ عمل قیامت تک کے مسلمانوں کے لیے بہترین نمونہ ہے۔"
              ],
              "english": [
                "The Sahaba's actions were confirmed by the Prophet's ﷺ approval.",
                "They meticulously molded their lives according to prophetic teachings.",
                "Their conduct serves as the ultimate role model for Muslims until the end."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیلولہ اور آرام کی اہمیت",
        "english": "Significance of Midday Nap"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت قیلولہ",
              "english": "The Sunnah of Qailulah"
            },
            "content": {
              "urdu": [
                "دوپہر کے وقت تھوڑی دیر آرام کرنا (قیلولہ) سنتِ نبوی ہے۔",
                "صحابہ اس سنت پر عمل کرتے تھے لیکن جمعہ کے دن اسے مؤخر کر دیتے۔",
                "آرام کا مقصد رات کی عبادت کے لیے توانائی حاصل کرنا ہوتا ہے۔"
              ],
              "english": [
                "Taking a short nap in the afternoon (Qailulah) is a Prophetic Sunnah.",
                "The Sahaba observed this Sunnah but postponed it specifically on Fridays.",
                "The purpose of this rest is to gain energy for nighttime worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترجیحات کا تعین",
              "english": "Setting Priorities"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں وقت اور حالات کے مطابق ترجیحات بدلنا سکھاتا ہے۔",
                "جمعہ کے مبارک دن میں بنیادی توجہ ذکرِ الٰہی پر ہونی چاہیے۔",
                "ایک مومن کے لیے سب سے بڑی راحت اللہ کے حضور سجدہ ریزی ہے۔"
              ],
              "english": [
                "Islam teaches us to adjust priorities based on time and circumstances.",
                "On the blessed day of Friday, primary focus should be on Allah's remembrance.",
                "For a believer, the greatest comfort lies in prostrating before Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتماعی معاشرت",
        "english": "Social and Collective Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسلمانوں کا اجتماع",
              "english": "Gathering of Muslims"
            },
            "content": {
              "urdu": [
                "جمعہ کا دن مسلمانوں کی اجتماعی طاقت کے اظہار کا دن ہے۔",
                "صحابہ مسجد میں جلد جمع ہو کر ایک دوسرے کے حالات سے واقف ہوتے۔",
                "کھانے پینے کے انفرادی کاموں کو چھوڑ کر اجتماعیت کو اہمیت دینا ضروری ہے۔"
              ],
              "english": [
                "Friday is a day to demonstrate the collective strength of Muslims.",
                "Sahaba gathered early in the mosque to interact with one another.",
                "Prioritizing collectivism over individual activities like dining is essential."
              ]
            }
          },
          {
            "title": {
              "urdu": "دن کی برکت",
              "english": "Blessings of the Day"
            },
            "content": {
              "urdu": [
                "جمعہ کے دن کے لمحات بہت قیمتی اور برکت والے ہوتے ہیں۔",
                "اس دن کی برکت پانے کے لیے عبادات میں جلد بازی بہتر ہے۔",
                "صحابہ کا یہ طرزِ عمل ہمیں سستی اور کاہلی سے بچنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The moments of Friday are extremely precious and full of blessings.",
                "Being prompt in worship is the best way to attain the day's barakah.",
                "The Sahaba's lifestyle encourages us to avoid laziness and procrastination."
              ]
            }
          }
        ]
      }
    }
  ]
}