{
  "hadithId": 1237,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:2963c"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزهد والرقائق",
    "babId": 102
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (6490)، ومسلم (2963).",
    "urdu": "یہ حدیث صحیح اور متفق علیہ ہے۔ اسے امام بخاری (6490) اور امام مسلم (2963) نے روایت کیا ہے۔",
    "english": "Sahih. Muttafaqun 'Alayh. Reported by Al-Bukhari (6490) and Muslim (2963)."
  },
  "importantWords": [
    {
      "arabic": "انْظُرُوا",
      "english": "Look at/Observe",
      "urdu": "تم دیکھو"
    },
    {
      "arabic": "أَسْفَلَ",
      "english": "Lower/Below",
      "urdu": "نیچے والا"
    },
    {
      "arabic": "فَوْقَكُمْ",
      "english": "Above you",
      "urdu": "تم سے اوپر"
    },
    {
      "arabic": "أَجْدَرُ",
      "english": "More appropriate",
      "urdu": "زیادہ بہتر"
    },
    {
      "arabic": "تَزْدَرُوا",
      "english": "Underestimate/Disdain",
      "urdu": "تم حقیر سمجھو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قناعت اور شکر گزاری کا بہترین نسخہ پیش کرتی ہے کہ دنیاوی معاملات میں اپنے سے کم تر کو دیکھنا چاہیے تاکہ اللہ کی نعمتوں کی قدر ہو سکے۔",
    "english": "This Hadith provides a remedy for discontentment by advising believers to look at those with fewer worldly means to appreciate Allah's blessings."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6490)",
      "english": "Reported by Al-Bukhari (6490)"
    },
    {
      "arabic": "رواه مسلم (2963)",
      "english": "Reported by Muslim (2963)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F3S0B_3W7S4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قناعت اور ذہنی سکون",
        "english": "Contentment and Peace of Mind"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرص کا علاج",
              "english": "Cure for Greed"
            },
            "content": {
              "urdu": [
                "اپنے سے امیر کو دیکھنا انسان میں احساسِ کمتری اور حرص پیدا کرتا ہے۔",
                "نبی ﷺ نے اس نفسیاتی بیماری کا علاج کم تر کو دیکھنے میں بتایا ہے۔",
                "جب انسان ضرورت مندوں کو دیکھتا ہے تو اسے اپنی عافیت کا احساس ہوتا ہے۔"
              ],
              "english": [
                "Looking at the wealthy creates a sense of inferiority and greed.",
                "The Prophet (ﷺ) offered a cure by advising to look at the less fortunate.",
                "Seeing those in need makes a person realize their own state of well-being."
              ]
            }
          },
          {
            "title": {
              "urdu": "شکر گزاری کی اہمیت",
              "english": "Importance of Gratitude"
            },
            "content": {
              "urdu": [
                "شکر گزاری سے اللہ کی نعمتوں میں مزید اضافہ اور برکت ہوتی ہے۔",
                "ناشکری انسان کو نفسیاتی طور پر بے چین اور ناخوش رکھتی ہے۔",
                "اللہ کی چھوٹی نعمت کو بھی بڑا سمجھنا ہی حقیقی بندگی ہے۔"
              ],
              "english": [
                "Gratitude leads to an increase and blessing in Allah's favors.",
                "Ingratitude keeps a person psychologically restless and unhappy.",
                "Considering even small blessings as grand is the essence of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مقابلے کا صحیح رخ",
        "english": "The Right Direction of Comparison"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دنیاوی معاملات میں اعتدال",
              "english": "Moderation in Worldly Affairs"
            },
            "content": {
              "urdu": [
                "دنیا کے پیچھے بھاگنا انسان کو کبھی مطمئن نہیں ہونے دیتا۔",
                "اپنے سے نیچے والوں کو دیکھ کر انسان اپنی موجودہ حالت پر خوش رہتا ہے۔",
                "یہ طرزِ عمل انسان کو حسد جیسی مہلک بیماری سے بھی محفوظ رکھتا ہے۔"
              ],
              "english": [
                "Chasing worldly desires never allows a person to be satisfied.",
                "Looking at those below helps a person stay happy with their current state.",
                "This approach protects an individual from the deadly disease of envy."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی معاملات میں بلند نگاہ",
              "english": "Aiming High in Religious Matters"
            },
            "content": {
              "urdu": [
                "دیگر روایات کے مطابق دین کے معاملے میں اپنے سے بہتر کو دیکھنا چاہیے۔",
                "نیکی میں دوسروں سے آگے بڑھنے کی کوشش کرنا محمود اور پسندیدہ ہے۔",
                "دنیا میں قناعت اور دین میں ترقی ہی مومن کا اصل نصب العین ہے۔"
              ],
              "english": [
                "In religious matters, one should look at those superior in piety.",
                "Striving to surpass others in good deeds is praiseworthy and liked.",
                "Contentment in dunya and progress in deen is the believer's goal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اثرات",
        "english": "Social Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سماجی ہمدردی",
              "english": "Social Empathy"
            },
            "content": {
              "urdu": [
                "کم تر لوگوں پر نظر رکھنے سے ان کی مدد کا جذبہ پیدا ہوتا ہے۔",
                "معاشرے کے محروم طبقات کی تکالیف کا احساس انسانیت کی جان ہے۔",
                "یہ حدیث ایک ہمدرد اور متوازن معاشرے کی تشکیل میں مدد دیتی ہے۔"
              ],
              "english": [
                "Observing those with less fosters a spirit of helping them.",
                "Feeling the pain of deprived social classes is the soul of humanity.",
                "This Hadith assists in forming a compassionate and balanced society."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبر کا خاتمہ",
              "english": "Eliminating Arrogance"
            },
            "content": {
              "urdu": [
                "نعمتوں پر اترانا اور دوسروں کو حقیر سمجھنا تکبر کی نشانی ہے۔",
                "اللہ کی دی ہوئی نعمت کو اس کا فضل سمجھنا عاجزی پیدا کرتا ہے۔",
                "جو شخص اللہ کا شکر گزار ہوتا ہے، وہ لوگوں کے ساتھ بھی نرم رہتا ہے۔"
              ],
              "english": [
                "Boasting about blessings and belittling others are signs of pride.",
                "Recognizing blessings as Allah's grace cultivates deep humility.",
                "A person grateful to Allah is naturally gentle with fellow humans."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت",
        "english": "Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نعمتوں کی فہرست",
              "english": "Counting Blessings"
            },
            "content": {
              "urdu": [
                "انسان کو چاہیے کہ وہ اپنی صحت، وقت اور امن جیسی نعمتوں پر غور کرے۔",
                "بہت سے لوگ ان بنیادی ضرورتوں سے بھی محروم ہیں جو ہمیں میسر ہیں۔",
                "غور و فکر کرنے والا کبھی اللہ کی ناشکری کا مرتکب نہیں ہوتا۔"
              ],
              "english": [
                "One should reflect on blessings like health, time, and safety.",
                "Many people lack even the basic necessities that we enjoy daily.",
                "One who contemplates never falls into the trap of ingratitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذہنی تناؤ سے نجات",
              "english": "Relief from Mental Stress"
            },
            "content": {
              "urdu": [
                "جدید دور میں ذہنی دباؤ کی بڑی وجہ دوسروں سے اپنا موازنہ کرنا ہے۔",
                "اسلامی تعلیمات انسان کو ذہنی اطمینان اور قلبی سکون عطا کرتی ہیں۔",
                "اللہ کی تقسیم پر راضی رہنا ہی دنیا کی سب سے بڑی دولت ہے۔"
              ],
              "english": [
                "In the modern era, comparing oneself to others is a major cause of stress.",
                "Islamic teachings provide mental satisfaction and tranquility of heart.",
                "Being pleased with Allah's distribution is the greatest wealth on earth."
              ]
            }
          }
        ]
      }
    }
  ]
}