{
  "hadithId": 648,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/1"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "رواه البزار وصححه الحاكم، وله شواهد من حديث ابن عمر عند الطبراني في الأوسط.",
    "urdu": "اسے بزار نے روایت کیا اور حاکم نے اسے صحیح قرار دیا۔ اس کے شواہد ابن عمر کی روایت سے طبرانی اوسط میں بھی موجود ہیں۔",
    "english": "Reported by al-Bazzar and authenticated by al-Hakim. It has supporting narrations from Ibn 'Umar in al-Tabarani's al-Awsat."
  },
  "importantWords": [
    {
      "arabic": "الْكَسْبِ",
      "english": "Earning",
      "urdu": "کمائی / روزگار"
    },
    {
      "arabic": "أَطْيَبُ",
      "english": "Best / Purest",
      "urdu": "سب سے پاکیزہ"
    },
    {
      "arabic": "بِيَدِهِ",
      "english": "With his hand",
      "urdu": "اپنے ہاتھ سے"
    },
    {
      "arabic": "بَيْعٍ",
      "english": "Trading / Sale",
      "urdu": "تجارت / خرید و فروخت"
    },
    {
      "arabic": "مَبْرُورٍ",
      "english": "Righteous / Blessed",
      "urdu": "مقبول / نیکی والی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بہترین اور پاکیزہ ترین رزق کے دو ذرائع بتائے گئے ہیں: اپنے ہاتھ کی محنت اور دیانتدارانہ تجارت۔",
    "english": "This Hadith highlights the two best sources of pure income: manual labor and honest, transparent trade."
  },
  "references": [
    {
      "arabic": "رواه البزار (كشف الأستار 2/83)",
      "english": "Reported by al-Bazzar (Kashf al-Astar 2/83)"
    },
    {
      "arabic": "المستدرك للحاكم (2/10)",
      "english": "Al-Mustadrak by al-Hakim (2/10)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رفاعة بن رافع",
        "english": "Rifa'ah bin Rafi'"
      },
      "slug": "rifa-ah-bin-rafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XWp7eR7yR3E",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic due to supporting chains)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہاتھ کی کمائی کی عظمت",
        "english": "Greatness of Manual Labor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انبیاء کی سنت",
              "english": "Sunnah of the Prophets"
            },
            "content": {
              "urdu": [
                "تمام انبیاء کرام علیہم السلام اپنے ہاتھ سے کام کر کے رزق کمایا کرتے تھے۔",
                "حضرت داؤد علیہ السلام زرہیں بناتے تھے اور حضرت زکریا علیہ السلام بڑھئی تھے۔",
                "ہاتھ کی محنت انسان کو خودداری اور دوسروں کے سامنے سوال سے بچاتی ہے۔"
              ],
              "english": [
                "All the Prophets (peace be upon them) earned their livelihood through manual labor.",
                "Prophet Dawud made chainmail and Prophet Zakariya was a skilled carpenter.",
                "Hard work builds self-respect and saves a person from begging others."
              ]
            }
          },
          {
            "title": {
              "urdu": "محنت میں برکت",
              "english": "Blessing in Hard Work"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ محنت کش انسان کو اپنا محبوب قرار دیتا ہے جو حلال رزق تلاش کرتا ہے۔",
                "اپنے ہاتھ سے کما کر کھانا بہترین صدقہ اور بہترین غذا قرار دیا گیا ہے۔",
                "یہ اسلام کے معاشی نظام میں کام کرنے کی اہمیت اور عظمتِ رفتہ کی علامت ہے۔"
              ],
              "english": [
                "Allah loves the hardworking person who strives to seek lawful sustenance.",
                "Eating from one's own manual labor is described as the best food and charity.",
                "This signifies the importance of productivity and dignity in the Islamic economy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تجارتِ مبرور کا مفہوم",
        "english": "Meaning of Blessed Trade"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانتدارانہ لین دین",
              "english": "Honest Transactions"
            },
            "content": {
              "urdu": [
                "تجارت مبرور وہ ہے جس میں سچائی ہو اور کوئی دھوکہ دہی نہ کی جائے۔",
                "مال کے عیب چھپائے بغیر فروخت کرنا برکت کا باعث بنتا ہے۔",
                "تاجر کے لیے ضروری ہے کہ وہ ناپ تول میں کمی اور جھوٹی قسموں سے پرہیز کرے۔"
              ],
              "english": [
                "A blessed trade is one involving truthfulness without any deception or fraud.",
                "Selling goods without hiding their defects brings immense blessing to business.",
                "It is essential for traders to avoid short-measuring and taking false oaths."
              ]
            }
          },
          {
            "title": {
              "urdu": "سچے تاجر کا مقام",
              "english": "Status of a Truthful Merchant"
            },
            "content": {
              "urdu": [
                "اسلام میں دیانتدار تاجر کا درجہ انبیاء، صدیقین اور شہداء کے ساتھ بتایا گیا ہے۔",
                "ایسی تجارت نہ صرف رزق بلکہ معاشرے میں اعتماد کی فضا بھی پیدا کرتی ہے۔",
                "خرید و فروخت میں نرمی اور سچائی اختیار کرنا اخروی نجات کا ذریعہ ہے۔"
              ],
              "english": [
                "In Islam, an honest merchant is ranked with Prophets and the truthful martyrs.",
                "Such business not only brings wealth but also creates trust within society.",
                "Practicing kindness and truth in sales is a path toward salvation hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رزقِ حلال کی اہمیت",
        "english": "Importance of Lawful Income"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال کی قبولیت",
              "english": "Acceptance of Deeds"
            },
            "content": {
              "urdu": [
                "پاکیزہ رزق کی تلاش ہر مسلمان پر فرض ہے کیونکہ اس پر عبادات کا مدار ہے۔",
                "جب تک لقمہ حلال نہ ہو، انسان کی دعائیں اور نیک اعمال قبول نہیں ہوتے۔",
                "یہ حدیث ہمیں ترغیب دیتی ہے کہ ہم کمائی کی مقدار سے زیادہ پاکیزگی دیکھیں۔"
              ],
              "english": [
                "Seeking pure sustenance is obligatory as it is the foundation for all worship.",
                "Supplications and good deeds are not accepted unless the source of food is Halal.",
                "This Hadith encourages us to prioritize the purity of income over its quantity."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اصلاح",
              "english": "Social Reformation"
            },
            "content": {
              "urdu": [
                "جب پورا معاشرہ حلال ذرائع اختیار کرتا ہے تو معاشی ظلم کا خاتمہ ہوتا ہے۔",
                "سود، چوری اور غصب سے بچ کر ہی ایک اسلامی ریاست مضبوط بن سکتی ہے۔",
                "ہاتھ کی کمائی اور دیانتدار تجارت بے روزگاری کے خاتمے کا بہترین نسخہ ہے۔"
              ],
              "english": [
                "Economic injustice ends when a society adopts purely lawful means of earning.",
                "An Islamic state strengthens by avoiding interest, theft, and usurpation.",
                "Manual labor and honest trade are the best remedies for ending unemployment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیشہ ورانہ مہارت",
              "english": "Professional Excellence"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ کسی بھی جائز ہنر یا پیشے میں مہارت حاصل کرے۔",
                "کام کو بوجھ سمجھنے کے بجائے اسے عبادت سمجھ کر دیانتداری سے انجام دیں۔",
                "اپنے عمل سے یہ ثابت کریں کہ مسلمان بہترین کاریگر اور تاجر ہوتا ہے۔"
              ],
              "english": [
                "A Muslim should strive to achieve mastery in any permissible skill or craft.",
                "Instead of viewing work as a burden, perform it as a form of worship.",
                "Prove through your actions that a Muslim is the best artisan and merchant."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزقِ طیب کی جستجو",
              "english": "Quest for Wholesome Wealth"
            },
            "content": {
              "urdu": [
                "ہر وہ ذریعہ آمدن ترک کر دینا چاہیے جس میں ذرا بھی مشتبہ عنصر موجود ہو۔",
                "اطمینان قلب صرف اسی مال میں ہے جو خالص محنت اور سچائی سے حاصل ہو۔",
                "یہ حدیث دورِ حاضر کے پیچیدہ کاروباری معاملات میں ایک رہنما اصول فراہم کرتی ہے۔"
              ],
              "english": [
                "Any source of income containing even a slight doubtful element should be left.",
                "Peace of mind lies only in wealth gained through pure hard work and truth.",
                "This Hadith provides a guiding principle for complex modern business dealings."
              ]
            }
          }
        ]
      }
    }
  ]
}