{
  "hadithId": 991,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/45"],
    "kitabId": 8,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 78
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5460)‏، ومسلم (1663). وفي رواية للبخاري زاد: «فإنه ولي حرّه وعلاجه».",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم دونوں میں موجود ہے۔ بخاری کی ایک روایت میں یہ اضافہ ہے کہ خادم نے ہی اس کھانے کی تپش اور تیاری کی مشقت برداشت کی ہوتی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (5460) and Muslim (1663). Al-Bukhari's version adds: 'For he has endured its heat and the labor of preparing it.'"
  },
  "importantWords": [
    {
      "arabic": "خَادِمُهُ",
      "english": "His servant",
      "urdu": "اس کا خادم"
    },
    {
      "arabic": "بِطَعَامِهِ",
      "english": "With his food",
      "urdu": "اس کے کھانے کے ساتھ"
    },
    {
      "arabic": "فَلْيُنَاوِلْهُ",
      "english": "He should give him",
      "urdu": "پس وہ اسے دے"
    },
    {
      "arabic": "لُقْمَةً",
      "english": "A morsel / bite",
      "urdu": "ایک لقمہ"
    },
    {
      "arabic": "يُجْلِسْهُ",
      "english": "Make him sit",
      "urdu": "اسے بٹھائے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں خادموں کے ساتھ حسنِ سلوک اور انسانی ہمدردی کی تعلیم دی گئی ہے کہ کھانا تیار کرنے والے کو اس میں سے حصہ دیا جائے۔",
    "english": "This Hadith teaches kindness and empathy toward servants, emphasizing that they should share in the food they helped prepare."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5460)",
      "english": "Reported by Al-Bukhari (5460)"
    },
    {
      "arabic": "رواه مسلم (1663)",
      "english": "Reported by Muslim (1663)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2nNfJ0r6sE",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خادموں کے حقوق",
        "english": "Rights of Servants"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی برابری کا تصور",
              "english": "Concept of Human Equality"
            },
            "content": {
              "urdu": [
                "اسلام نے مالک اور خادم کے درمیان انسانیت کی بنیاد پر برابری قائم کی ہے۔",
                "خادم کو اپنے ساتھ بٹھا کر کھلانا بہترین اخلاق اور تواضع کی علامت ہے۔",
                "تکبر اور بڑائی کا خاتمہ اسلام کے معاشرتی نظام کا اہم حصہ ہے۔"
              ],
              "english": [
                "Islam establishes equality between master and servant based on humanity.",
                "Sharing a meal with a servant is a sign of noble character and humility.",
                "Eradicating arrogance is a key part of the Islamic social system."
              ]
            }
          },
          {
            "title": {
              "urdu": "محنت کی قدر دانی",
              "english": "Appreciation of Labor"
            },
            "content": {
              "urdu": [
                "خادم کھانا تیار کرتے وقت آگ کی تپش اور دھوئیں کی تکلیف سہتا ہے۔",
                "جس نے محنت کی ہو، اس کا دل اس چیز میں اٹکا ہوتا ہے۔",
                "کھانے میں سے حصہ دینا اس کی محنت کا اخلاقی اعتراف ہے۔"
              ],
              "english": [
                "The servant endures the heat and smoke while preparing the food.",
                "One who puts in the effort naturally feels a connection to the result.",
                "Giving a share of the food is a moral recognition of their labor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی معاشرت",
        "english": "Islamic Social Conduct"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احسان اور ہمدردی",
              "english": "Excellence and Empathy"
            },
            "content": {
              "urdu": [
                "اگر ساتھ بٹھانا ممکن نہ ہو تو کم از کم کچھ حصہ ضرور دینا چاہیے۔",
                "اسلام ہر حال میں خیر خواہی اور ہمدردی کا حکم دیتا ہے۔",
                "یہ عمل خادم کے دل میں محبت اور وفاداری پیدا کرتا ہے۔"
              ],
              "english": [
                "If sitting together is not possible, at least a portion must be given.",
                "Islam commands well-wishing and empathy in all circumstances.",
                "This act fosters love and loyalty in the heart of the servant."
              ]
            }
          },
          {
            "title": {
              "urdu": "بخل سے بچاؤ",
              "english": "Avoiding Stinginess"
            },
            "content": {
              "urdu": [
                "دوسروں کو محروم رکھ کر اکیلے کھانا اخلاقی پستی کی نشانی ہے۔",
                "اپنے ماتحتوں کا خیال رکھنا ایمان کی تکمیل کے لیے ضروری ہے۔",
                "سخاوت اور فیض رسانی سے مال اور کھانے میں برکت ہوتی ہے۔"
              ],
              "english": [
                "Eating alone while depriving others is a sign of moral decline.",
                "Caring for subordinates is essential for the completion of faith.",
                "Generosity brings blessings to one's wealth and sustenance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلیٰ اخلاق کی تربیت",
              "english": "Training in High Morals"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں چھوٹے درجے کے لوگوں کی عزت کرنا سکھاتی ہے۔",
                "نبی کریم ﷺ نے عملی طور پر غلاموں کے ساتھ کھانا کھا کر دکھایا۔",
                "معاشرے کے پسماندہ طبقوں کو اہمیت دینا سنتِ نبوی ہے۔"
              ],
              "english": [
                "This Hadith teaches us to respect those in lower social positions.",
                "The Prophet (ﷺ) practically demonstrated eating with slaves.",
                "Valuing the marginalized sections of society is a Prophetic Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفسیاتی پہلو",
              "english": "Psychological Aspect"
            },
            "content": {
              "urdu": [
                "بھوک کی حالت میں کھانے کی خوشبو سے خادم کی رغبت بڑھ جاتی ہے۔",
                "اسے کھانا دینے سے اس کی محرومی کا احساس ختم ہوتا ہے۔",
                "اسلامی تعلیمات انسانی نفسیات اور جذبات کا مکمل لحاظ رکھتی ہیں۔"
              ],
              "english": [
                "The aroma of food increases a servant's desire while they are hungry.",
                "Giving them food eliminates their sense of deprivation.",
                "Islamic teachings fully respect human psychology and emotions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی نفاذ",
        "english": "Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موجودہ دور میں اطلاق",
              "english": "Application in the Modern Era"
            },
            "content": {
              "urdu": [
                "گھروں اور ہوٹلوں میں کام کرنے والوں کا خاص خیال رکھنا چاہیے۔",
                "ملازمین کو اچھا کھانا فراہم کرنا ان کی کارکردگی بہتر بناتا ہے۔",
                "یہ اصول ہر اس شخص پر لاگو ہوتا ہے جو آپ کی خدمت کرتا ہے۔"
              ],
              "english": [
                "Special care should be taken of domestic and hospitality workers.",
                "Providing quality food to employees improves their performance.",
                "This principle applies to anyone who serves or assists you."
              ]
            }
          },
          {
            "title": {
              "urdu": "برکت کا ذریعہ",
              "english": "Source of Blessing"
            },
            "content": {
              "urdu": [
                "دوسروں کے ساتھ بانٹ کر کھانے سے کھانے میں اضافہ ہوتا ہے۔",
                "اللہ تعالیٰ ان لوگوں سے راضی ہوتا ہے جو رحم دل ہوتے ہیں۔",
                "خادم کی خوشی اور دعا گھر میں خیر و برکت کا باعث بنتی ہے۔"
              ],
              "english": [
                "Sharing food with others increases its sufficiency and blessing.",
                "Allah is pleased with those who are merciful to others.",
                "The joy and prayers of a servant bring goodness to the household."
              ]
            }
          }
        ]
      }
    }
  ]
}