{
  "hadithId": 1276,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh:1476"
    ],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "كتاب الجامع",
    "babId": 104
  },
 
  "takhreej": {
    "arabic": "ضعيف مرفوعاً، وصحيح موقوفاً. أخرجه البيهقي في شعب الإيمان (5027)، وابن عدي في الكامل (5/1816). والصواب أنه من كلام لقمان الحكيم كما ذكر المصنف.",
    "urdu": "یہ روایت مرفوعاً ضعیف ہے، تاہم موقوفاً صحیح ہے۔ اسے امام بیہقی نے 'شعب الایمان' اور ابن عدی نے 'الکامل' میں روایت کیا ہے۔ محققین کے نزدیک درست بات یہ ہے کہ یہ لقمان حکیم کا قول ہے۔",
    "english": "Weak as a Hadith of the Prophet, but authentic as a saying of Luqman al-Hakim. Reported by al-Baihaqi (5027) and Ibn 'Adi (5/1816). Scholars agree it is 'Mauquf' (attributed to a non-Prophetic source)."
  },
  "importantWords": [
    {
      "arabic": "الصَّمْتُ",
      "english": "Silence",
      "urdu": "خاموشی"
    },
    {
      "arabic": "حِكْمَةٌ",
      "english": "Wisdom",
      "urdu": "دانائی / حکمت"
    },
    {
      "arabic": "قَلِيلٌ",
      "english": "Few / Little",
      "urdu": "تھوڑے / قلیل"
    },
    {
      "arabic": "فَاعِلُهُ",
      "english": "Its practitioner",
      "urdu": "اس پر عمل کرنے والے"
    },
    {
      "arabic": "مَوْقُوفٌ",
      "english": "Stopped (Attributed to Sahabi or Hakim)",
      "urdu": "قولِ صحابی یا حکیم پر رکا ہوا"
    }
  ],
  "summary": {
    "urdu": "یہ روایت خاموشی کی اہمیت اور اس کی فضیلت بیان کرتی ہے کہ کم بولنا اور ضرورت کے وقت خاموش رہنا بڑی دانائی ہے، مگر بہت کم لوگ اس پر عمل کرتے ہیں۔",
    "english": "This narration highlights the excellence of silence, emphasizing that remaining quiet is a form of deep wisdom, though it is a trait rarely practiced by people."
  },
  "references": [
    {
      "arabic": "البيهقي في شعب الإيمان (5027)",
      "english": "Al-Baihaqi in Shu'ab al-Iman (5027)"
    },
    {
      "arabic": "ابن عدي في الكامل (5/1816)",
      "english": "Ibn 'Adi in al-Kamil (5/1816)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYI8jKkUu94",
  "grade": {
    "arabic": "ضعيف مرفوعاً / صحيح موقوفاً",
    "english": "Weak (Prophetic) / Authentic (as a Saying)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خاموشی کی حقیقت",
        "english": "The Reality of Silence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمت کا ذریعہ",
              "english": "Source of Wisdom"
            },
            "content": {
              "urdu": [
                "خاموشی انسان کو سوچنے اور غور و فکر کرنے کا موقع فراہم کرتی ہے۔",
                "بلا ضرورت کلام کرنا انسان کی فکری گہرائی کو کم کر دیتا ہے۔",
                "حکمت و دانائی کا تعلق زبان کی حفاظت اور کلام میں اعتدال سے ہے۔"
              ],
              "english": [
                "Silence provides a person the opportunity to reflect and contemplate.",
                "Unnecessary speech reduces the intellectual depth of an individual.",
                "Wisdom is directly linked to guarding the tongue and moderate speech."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمل کرنے والوں کی کمی",
              "english": "Rarity of Practice"
            },
            "content": {
              "urdu": [
                "اکثر لوگ اپنی زبان پر قابو پانے میں ناکام رہتے ہیں۔",
                "جذبات کی رو میں بہہ کر انسان اکثر غیر ضروری باتیں کر جاتا ہے۔",
                "خاموشی پر قائم رہنا ایک مشکل ترین اخلاقی مجاہدہ ہے۔"
              ],
              "english": [
                "Most people fail to exercise control over their own tongues.",
                "People often speak unnecessarily when caught up in their emotions.",
                "Maintaining silence is one of the most difficult moral struggles."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زبان کی حفاظت",
        "english": "Guarding the Tongue"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہوں سے بچاؤ",
              "english": "Protection from Sins"
            },
            "content": {
              "urdu": [
                "زیادہ تر معاشرتی برائیاں جیسے غیبت اور جھوٹ زبان سے جنم لیتے ہیں۔",
                "خاموش رہ کر انسان بہت سے لایعنی گناہوں سے محفوظ ہو جاتا ہے۔",
                "جو شخص اپنی زبان کی حفاظت کرتا ہے وہ اپنے ایمان کی حفاظت کرتا ہے۔"
              ],
              "english": [
                "Most social evils like backbiting and lying originate from the tongue.",
                "By remaining silent, a person is saved from many irrelevant sins.",
                "Whoever guards their tongue effectively guards their faith as well."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقار اور رعب",
              "english": "Dignity and Respect"
            },
            "content": {
              "urdu": [
                "خاموش رہنے والے شخص کا معاشرے میں ایک خاص وقار ہوتا ہے۔",
                "بلا ضرورت کلام انسان کی عزت اور رعب کو کم کر دیتا ہے۔",
                "کم گو انسان کی بات زیادہ توجہ اور اثر کے ساتھ سنی جاتی ہے۔"
              ],
              "english": [
                "A silent person maintains a specific dignity within society.",
                "Speaking without necessity diminishes one's respect and aura.",
                "The words of a concise person are heard with more attention."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لقمان حکیم کی نصاحت",
        "english": "Advice of Luqman the Wise"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمتِ لقمان",
              "english": "Wisdom of Luqman"
            },
            "content": {
              "urdu": [
                "لقمان حکیم نے اپنے بیٹے کو بھی خاموشی کی کثرت کی وصیت کی تھی۔",
                "ان کے نزدیک کلام اگر چاندی ہے تو خاموشی سونا ہے۔",
                "حکمت کا پہلا زینہ حلم اور دوسری خاموشی ہے۔"
              ],
              "english": [
                "Luqman the Wise advised his son to practice frequent silence.",
                "To him, if speech is silver, then silence is pure gold.",
                "The first step of wisdom is forbearance, and the second is silence."
              ]
            }
          },
          {
            "title": {
              "urdu": "موقع اور محل",
              "english": "Context and Occasion"
            },
            "content": {
              "urdu": [
                "خاموشی وہاں حکمت ہے جہاں کلام کا کوئی فائدہ نہ ہو۔",
                "حق بات کہنے کے وقت خاموش رہنا دانائی نہیں بزدلی ہے۔",
                "حکمت یہ ہے کہ انسان جان سکے کہ کب بولنا ہے اور کب نہیں۔"
              ],
              "english": [
                "Silence is wisdom only when speaking yields no benefit.",
                "Remaining silent when truth must be told is cowardice, not wisdom.",
                "True wisdom is knowing exactly when to speak and when not to."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی نتائج",
        "english": "Educational Outcomes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفس پر قابو",
              "english": "Self-Control"
            },
            "content": {
              "urdu": [
                "خاموشی کی مشق انسان کو اپنے نفس پر قابو پانا سکھاتی ہے۔",
                "غصے کے وقت خاموشی بڑے فتنوں کو دبانے کا کام کرتی ہے۔",
                "یہ صفت انسان کے اندر بردباری اور تحمل پیدا کرتی ہے۔"
              ],
              "english": [
                "The practice of silence teaches a person to control their lower self.",
                "Silence during anger serves to suppress major tribulations.",
                "This attribute develops tolerance and patience within a person."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی بہتری",
              "english": "Collective Improvement"
            },
            "content": {
              "urdu": [
                "معاشرے میں ہونے والی آدھی سے زیادہ لڑائیاں غلط کلامی کا نتیجہ ہیں۔",
                "اگر لوگ خاموشی کی عادت اپنا لیں تو باہمی تعلقات بہتر ہوں گے۔",
                "اسلامی معاشرت میں کلام صرف خیر اور بھلائی کے لیے ہونا چاہیے۔"
              ],
              "english": [
                "More than half of the conflicts in society result from wrong speech.",
                "If people adopt the habit of silence, mutual relationships would improve.",
                "In Islamic social life, speech should only be used for good."
              ]
            }
          }
        ]
      }
    }
  ]
}