{
  "hadithId": 53,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 1 (Chapter 5)"],
    "kitabId": 1,
    "inKitabBab": 5,
    "arabicBook": "كتاب المسح على الخفين",
    "babId": 5
  },

  "takhreej": {
    "arabic": "  صحيح.  رواه البخاري (206) ، ومسلم (274)  (79) . ",
    "urdu": "صحیح (درجہ)۔ اسے بخاری (206) اور مسلم (274) (79) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Al-Bukhari (206) and Muslim (274) (79)."
  },
  "importantWords": [
    {
      "arabic": "فَأَهْوَيْتُ",
      "english": "I bent down/leapt",
      "urdu": "میں لپکا"
    },
    {
      "arabic": "لِأَنْزِعَ",
      "english": "To remove",
      "urdu": "اتارنے کیلئے"
    },
    {
      "arabic": "خُفَّيْهِ",
      "english": "His leather socks",
      "urdu": "ان کے موزے"
    },
    {
      "arabic": "طَاهِرَتَيْنِ",
      "english": "Pure (in state of Wudu)",
      "urdu": "وضو سے (پاک)"
    },
    {
      "arabic": "دَعْهُمَا",
      "english": "Leave them (alone)",
      "urdu": "چھوڑ دو"
    },
    {
      "arabic": "فَمَسَحَ عَلَيْهِمَا",
      "english": "Then he wiped over them",
      "urdu": "پھر ان پر مسح فرمایا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس عظیم شرعی رخصت (آسانی) کو واضح کرتی ہے کہ وضو کے دوران پاؤں کو دھونے کے بجائے موزوں پر مسح کرنا جائز ہے، بشرطیکہ وہ موزے مکمل طہارت (وضو) کی حالت میں پہنے گئے ہوں۔",
    "english": "This Hadith clarifies the great legal concession (Rukhṣah) that wiping over the Khuffayn (leather socks) is permissible during Wudu instead of washing the feet, provided they were put on when the feet were already in a state of ritual purity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الوضوء، رقم 206",
      "english": "Sahih Al-Bukhari, The Book of Ablution, Hadith 206"
    },
    {
      "arabic": "صحيح مسلم، كتاب الطهارة، رقم 274",
      "english": "Sahih Muslim, The Book of Purification, Hadith 274"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "اَلْمُغِيرَةِ بْنِ شُعْبَةَ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Al-Mughīrah ibn Shuʿbah (May Allah be pleased with him)"
      },
      "slug": "al-mughirah-ibn-shubah"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-31-wiping-khuffayn-condition",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Agreed Upon (by Bukhari and Muslim)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسح علی الخفین کی شرط",
        "english": "The Condition for Wiping Over Khuffayn"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت کی حالت میں پہنا",
              "english": "Putting Them on in a State of Purity"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ قاعدہ ثابت ہوتا ہے کہ موزوں پر مسح کی بنیادی اور لازمی شرط یہ ہے کہ موزے پہنے جانے سے **قبل پاؤں مکمل طور پر پاک** (وضو سے دھلے ہوئے) ہوں۔",
                "نبی اکرم ﷺ کا یہ فرمان کہ **\"فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ\"** (میں نے انہیں پاک حالت میں پہنا تھا) اس شرط کو فرضیت کے درجے تک لے جاتا ہے۔",
                "اگر موزے بغیر وضو کے یا پاؤں خشک ہونے کی حالت میں پہنے جائیں، تو ان پر مسح کرنا جائز نہیں ہوگا اور وضو باطل ہو جائے گا۔"
              ],
              "english": [
                "This Hadith establishes the basic and mandatory rule that the *Khuffayn* must be put on **after the feet have been completely washed** (in a state of Wudu).",
                "The Prophet's (ﷺ) statement **\"for I put them on while my feet were pure\"** elevates this condition to an obligatory level for the permissibility of wiping.",
                "If the socks are put on without Wudu or while the feet are dry, wiping over them is not permissible and invalidates the purification."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصت اور آسانی",
              "english": "Concession and Ease"
            },
            "content": {
              "urdu": [
                "مسح علی الخفین (موزوں پر مسح) اسلامی شریعت کی **عظیم رخصتوں (آسانیوں)** میں سے ایک ہے، جو مسلمانوں کو مشقت سے بچانے کے لیے دی گئی ہے۔",
                "یہ رخصت خاص طور پر سردی کے موسم، سفر یا ایسے حالات کے لیے ہے جب پاؤں کو بار بار دھونا مشکل ہو۔",
                "یہ اس بات کی دلیل ہے کہ اسلام میں عبادت کے عمل میں مشقت کو کم کرنے کا بھرپور خیال رکھا گیا ہے اور یہ دین آسانی کا ہے۔"
              ],
              "english": [
                "Wiping over the *Khuffayn* (Masḥ alā al-Khuffayn) is one of the **great concessions (Rukhṣah)** in Islamic Law, granted to relieve Muslims of difficulty.",
                "This concession is especially relevant for cold weather, travel, or situations where repeatedly washing the feet is difficult or causes hardship.",
                "It proves that Islam takes hardship into consideration and aims to alleviate difficulty in the performance of acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور اطلاق",
        "english": "Fiqh Details and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح کا طریقہ کار",
              "english": "The Method of Wiping"
            },
            "content": {
              "urdu": [
                "جب مسح کی اجازت ہو تو پاؤں دھونے کے بجائے موزوں کے صرف **اوپری حصے** پر گیلا ہاتھ ایک بار گزارا جاتا ہے، نہ کہ نیچے یا ارد گرد۔",
                "یہاں مسح کا نعم البدل موزوں کا اتارنا نہیں، بلکہ پاؤں کو دھونا ہے، اس لیے موزوں پر مسح کرنے سے پاؤں دھونے کا فرض ادا ہو جاتا ہے۔",
                "اگرچہ یہ حدیث **خفین (چمڑے کے موزوں)** کے بارے میں ہے، لیکن جمہور علماء کے نزدیک یہ حکم عام موٹے موزوں پر بھی لاگو ہوتا ہے۔"
              ],
              "english": [
                "When wiping is permitted, a wet hand is passed once over the **upper surface** of the socks, not the bottom or around the sides.",
                "Wiping over the socks serves as a substitute for washing the feet, thus fulfilling the obligatory washing component of Wudu for the feet.",
                "Although this Hadith specifically mentions *Khuffayn* (leather socks), the consensus of scholars permits wiping over thick, modern socks as well, given certain conditions."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح کی مدت",
              "english": "Duration of Wiping"
            },
            "content": {
              "urdu": [
                "مسح کی یہ رخصت ایک محدود مدت کے لیے ہے؛ مقیم شخص کے لیے **ایک دن اور ایک رات** اور مسافر کے لیے **تین دن اور تین راتیں**۔",
                "مسح کی مدت کا آغاز پہلے وضو ٹوٹنے کے بعد ہوتا ہے، اس وقت سے جب موزے پہننے کے بعد پہلی بار وضو ٹوٹے۔",
                "مدت ختم ہونے کے بعد، موزوں کو اتار کر پاؤں دھونا اور نیا وضو کرنا ضروری ہے تاکہ طہارت کی تجدید ہو سکے۔"
              ],
              "english": [
                "This concession for wiping is limited in duration: **one day and one night** for a resident, and **three days and three nights** for a traveler.",
                "The period for wiping begins after the first event that invalidates Wudu occurs while wearing the socks, not from the time they were put on.",
                "Upon the expiry of this period, it becomes necessary to remove the socks, wash the feet, and perform a fresh Wudu to renew the state of purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور حدیث کی اہمیت",
        "english": "The Narrator and Importance of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغیرہ بن شعبہؓ کا عمل",
              "english": "Mughīrah ibn Shuʿbah's Action"
            },
            "content": {
              "urdu": [
                "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ کا نبی ﷺ کے موزے اتارنے کیلئے جھکنا اس بات کی دلیل ہے کہ صحابہ کرام وضو کے لیے پاؤں دھونے کو ہی اصل حکم سمجھتے تھے۔",
                "نبی ﷺ نے ان کے اس ارادے کو روک کر **مسح علی الخفین** کی تعلیم دی، جو وضو میں آسانی اور رخصت کی شرعی حیثیت کو واضح کرتا ہے۔",
                "یہ واقعہ اس بات کو بھی واضح کرتا ہے کہ وضو کو سنت کے مطابق سکھانے کے لیے نبی ﷺ نے عملی مظاہرہ اور تصحیح کا طریقہ اپنایا۔"
              ],
              "english": [
                "Sayyiduna Mughīrah ibn Shuʿbah (RA) bending down to remove the Prophet's socks shows that the Companions understood washing the feet was the default, original command for Wudu.",
                "The Prophet's (ﷺ) correction taught them the concession of **wiping over the Khuffayn**, clarifying its legal status as an ease in Wudu.",
                "This incident also highlights that the Prophet (ﷺ) used practical demonstration and correction to teach the Sunnah of Wudu perfectly."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحیح سند اور فقہی دلیل",
              "english": "Authentic Chain and Legal Proof"
            },
            "content": {
              "urdu": [
                "چونکہ یہ حدیث بخاری اور مسلم دونوں میں موجود ہے، اس لیے یہ **مسح علی الخفین** کے جواز پر سب سے زیادہ قوی اور قطعی دلیل ہے۔",
                "اس رخصت کی مشروعیت پر اہل سنت والجماعت کے تمام فقہی مسالک (حنفی، مالکی، شافعی، حنبلی) کا **اجماع** ہے، حالانکہ اس کی شرائط میں اختلاف ہے۔",
                "موزوں پر مسح کا جواز ثابت کرتا ہے کہ شریعت میں طہارت کے دوران بھی سہولت اور آسانی کی گنجائش موجود ہے تاکہ عمل میں تسلسل رہے۔"
              ],
              "english": [
                "Since this Hadith is found in both Bukhari and Muslim (Muttafaqun 'Alayh), it serves as the strongest and most conclusive proof for the permissibility of **Masḥ alā al-Khuffayn**.",
                "There is a **consensus (Ijmāʿ)** among all four major schools of thought (Hanafi, Maliki, Shafi'i, Hanbali) regarding the validity of this concession, despite minor differences in conditions.",
                "The permissibility of wiping over the socks proves that Islamic Law provides room for ease and facilitation even during purification to ensure continuity in worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور جسمانی فوائد",
        "english": "Spiritual and Physical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت میں سہولت",
              "english": "Facilitation in Purity"
            },
            "content": {
              "urdu": [
                "موزوں پر مسح کی اجازت سے مسلمانوں کو بغیر کسی مشقت کے اپنے پاؤں کو گرم اور خشک رکھنے کی سہولت میسر آتی ہے، خاص طور پر ٹھنڈے علاقوں میں۔",
                "یہ آسانی مومن کو دن میں پانچ بار وضو کرنے کی ترغیب دیتی ہے، جس سے وہ ہمیشہ طہارت اور اللہ کی عبادت کے لیے تیار رہتا ہے۔",
                "مسلمان کو اس رخصت کو غنیمت جاننا چاہیے اور اس پر عمل کرتے ہوئے اللہ کا شکر ادا کرنا چاہیے کہ اس نے آسانی والا دین دیا۔"
              ],
              "english": [
                "The permission to wipe over the socks allows Muslims to keep their feet warm and dry without undue difficulty, especially in cold climates or during winter.",
                "This ease encourages the believer to perform Wudu five times a day, maintaining a constant state of ritual purity for worship.",
                "A Muslim should value this concession and thank Allah for granting a religion that is easy and free from hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "تسلسل عبادت",
              "english": "Continuity of Worship"
            },
            "content": {
              "urdu": [
                "موزوں پر مسح کی سہولت نماز اور طہارت کے عمل میں **تسلسل** برقرار رکھنے میں مدد دیتی ہے، جو مسلسل عبادت کے لیے ضروری ہے۔",
                "اس کے ذریعے مسلمان آسانی سے اپنا وضو جاری رکھ سکتا ہے اور بار بار موزے اتار کر پاؤں دھونے کی مشقت سے بچ سکتا ہے۔",
                "یہ اصول اس بات کی دلیل ہے کہ شریعت کا مقصد عمل کو مشکل بنانا نہیں بلکہ اسے آسان بنانا ہے تاکہ ایمان میں اضافہ ہو۔"
              ],
              "english": [
                "The facility of wiping over the socks helps maintain the **continuity** of prayer and purification, which is essential for constant devotion.",
                "Through this method, a Muslim can easily maintain their state of Wudu and avoid the hardship of repeatedly removing socks and washing the feet.",
                "This principle proves that the objective of the Sharia is not to make actions difficult but to facilitate them, thereby increasing faith and commitment."
              ]
            }
          }
        ]
      }
    }
  ]
}
