{
  "hadithId": 1080,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/1"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1910) في كتاب الإمارة، باب ذم من مات ولم يغز ولم يحدث نفسه بالغزو.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام مسلم نے اپنی صحیح (1910) میں روایت کیا ہے۔ یہ روایت جہاد کی نیت اور ارادے کی اہمیت کو واضح کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (1910) in the Book of Leadership, Chapter: Condemnation of one who dies without having fought or intended to fight."
  },
  "importantWords": [
    {
      "arabic": "يَغْزُ",
      "english": "Fought/Fights",
      "urdu": "جہاد کیا"
    },
    {
      "arabic": "يُحَدِّثْ نَفْسَهُ",
      "english": "Intended within himself",
      "urdu": "اپنے دل میں ارادہ کیا"
    },
    {
      "arabic": "شُعْبَةٍ",
      "english": "Branch/Type",
      "urdu": "شاخ/حصہ"
    },
    {
      "arabic": "نِفَاقٍ",
      "english": "Hypocrisy",
      "urdu": "منافقت"
    },
    {
      "arabic": "مَاتَ",
      "english": "Died",
      "urdu": "مر گیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مقصد مسلمانوں میں اللہ کی راہ میں قربانی کا جذبہ پیدا کرنا ہے۔ جہاد کا عمل یا کم از کم اس کی سچی نیت ایمان کی علامت اور نفاق سے دوری کا ذریعہ ہے۔",
    "english": "The Hadith aims to instill a spirit of sacrifice in Muslims. Participating in Jihad or at least having a sincere intention for it is a sign of faith and a shield against hypocrisy."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1910)",
      "english": "Sahih Muslim (1910)"
    },
    {
      "arabic": "سنن أبي داود (2502)",
      "english": "Sunan Abi Dawud (2502)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جہاد اور نیت کی اہمیت",
        "english": "Importance of Jihad and Intent"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیت کی طاقت",
              "english": "The Power of Intent"
            },
            "content": {
              "urdu": [
                "اعمال کا دارومدار نیتوں پر ہے، اس لیے جہاد کی نیت رکھنا فرض ہے۔",
                "اگر انسان عملی طور پر جہاد نہ کر سکے تو سچی نیت اسے اجر دلاتی ہے۔",
                "اللہ تعالیٰ بندے کے دل کے اخلاص کو دیکھتا ہے نہ کہ صرف ظاہری عمل کو۔"
              ],
              "english": [
                "Actions are judged by intentions, so having the intent for Jihad is obligatory.",
                "If a person cannot physically participate, a sincere intent secures the reward.",
                "Allah looks at the sincerity of the heart rather than just the outward deed."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفاق سے بچاؤ",
              "english": "Avoiding Hypocrisy"
            },
            "content": {
              "urdu": [
                "منافقین جہاد سے جی چراتے تھے اور اس کا ارادہ بھی نہیں رکھتے تھے۔",
                "جہاد کی نیت نہ رکھنا منافقوں کی صفت ہے جس سے بچنا ضروری ہے۔",
                "مومن ہمیشہ اللہ کے دین کی سر بلندی کے لیے تڑپ اور فکر رکھتا ہے۔"
              ],
              "english": [
                "Hypocrites used to avoid Jihad and never even intended to participate.",
                "Lacking the intent for Jihad is a trait of hypocrisy that must be avoided.",
                "A believer always possesses a concern for the supremacy of Allah's religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نفاق کے شعبے کی وضاحت",
        "english": "Clarifying the Branch of Hypocrisy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عملی نفاق بمقابلہ اعتقادی نفاق",
              "english": "Practical vs. Creedal Hypocrisy"
            },
            "content": {
              "urdu": [
                "حدیث میں 'شعبہ نفاق' سے مراد عملی نفاق ہے جو کفر کے برابر نہیں ہے۔",
                "اس کا مطلب یہ ہے کہ اس شخص میں منافقوں جیسی ایک خصلت موجود ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی تمام عادات کو نفاق کی آمیزش سے پاک کرے۔"
              ],
              "english": [
                "The 'branch of hypocrisy' refers to practical hypocrisy, not disbelief.",
                "It means the person possesses a specific characteristic similar to hypocrites.",
                "A Muslim must purify all their habits from any traces of hypocrisy."
              ]
            }
          },
          {
            "title": {
              "urdu": "جہاد کے مختلف درجات",
              "english": "Different Levels of Jihad"
            },
            "content": {
              "urdu": [
                "جہاد صرف میدانِ جنگ تک محدود نہیں بلکہ نفس اور شیطان سے بھی ہے۔",
                "دین کی تبلیغ اور شر کے خلاف آواز اٹھانا بھی جہاد کی اقسام ہیں۔",
                "ہر مسلمان کو کسی نہ کسی سطح پر اعلائے کلمۃ اللہ میں شریک ہونا چاہیے۔"
              ],
              "english": [
                "Jihad is not limited to the battlefield; it includes fighting the self and Satan.",
                "Preaching religion and speaking against evil are also forms of Jihad.",
                "Every Muslim should participate in elevating Allah's word at some level."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور ایمانی اثرات",
        "english": "Social and Faith Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امت میں جذبہء ایثار",
              "english": "Spirit of Sacrifice in the Ummah"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسلمانوں کو ہر وقت قربانی کے لیے تیار رہنے کا سبق دیتی ہے۔",
                "جذبہء جہاد امت کی حفاظت اور وقار کا ضامن ہے جس سے دشمن مرعوب رہتا ہے۔",
                "اسلامی ریاست کے دفاع کے لیے ہر شہری کا ذہنی طور پر تیار ہونا ضروری ہے۔"
              ],
              "english": [
                "This Hadith teaches Muslims to be ready for sacrifice at all times.",
                "The spirit of Jihad ensures the Ummah's protection and honor against enemies.",
                "Every citizen must be mentally prepared for the defense of the Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان کی تکمیل",
              "english": "Completion of Faith"
            },
            "content": {
              "urdu": [
                "ایمان تب مکمل ہوتا ہے جب انسان اپنی جان و مال اللہ کے سپرد کر دے۔",
                "خوفِ خدا اور شوقِ شہادت مومن کے کردار کے لازمی اجزاء ہیں۔",
                "دنیا کی محبت میں غرق ہو کر جہاد کو بھول جانا ایمان کی کمزوری ہے۔"
              ],
              "english": [
                "Faith is complete when a person submits their life and wealth to Allah.",
                "Fear of Allah and a desire for martyrdom are essential traits of a believer.",
                "Forgetting Jihad due to excessive love for the world weakens one's faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزانہ کی نیت",
              "english": "Daily Intentions"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو چاہیے کہ وہ روزانہ دین کی خدمت کا پختہ ارادہ کرے۔",
                "مشکل وقت میں حق کی حمایت کرنا بھی اسی حدیث کے حکم میں شامل ہے۔",
                "اپنے بچوں میں بھی دین کے دفاع کا شعور اور جذبہ پیدا کرنا چاہیے۔"
              ],
              "english": [
                "Every Muslim should make a firm daily intention to serve the religion.",
                "Supporting the truth during difficult times falls under this Hadith's command.",
                "Awareness and spirit for defending the faith should be instilled in children."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کا محاسبہ",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "ہمیں مسلسل اپنا جائزہ لینا چاہیے کہ کہیں ہم میں نفاق کی علامات تو نہیں۔",
                "جہاد کی تمنا دل کو زندہ رکھتی ہے اور دنیا کی بے ثباتی کا احساس دلاتی ہے۔",
                "اللہ سے سچی شہادت کی دعا مانگنا سنتِ صحابہ کرام رضوان اللہ علیہم ہے۔"
              ],
              "english": [
                "We must constantly check ourselves for any signs or traits of hypocrisy.",
                "The desire for Jihad keeps the heart alive and reminds us of worldly transience.",
                "Praying for sincere martyrdom is the Sunnah of the noble Companions."
              ]
            }
          }
        ]
      }
    }
  ]
}