{
  "hadithId": 918,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/918", "nasai:3401"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
  
  "takhreej": {
    "arabic": "رواه النسائي (3401). قال الحافظ ابن حجر: رواته موثقون، لكنه مرسل أو فيه انقطاع بين مخرمة وأبيه.",
    "urdu": "اسے امام نسائی (3401) نے روایت کیا ہے۔ حافظ ابن حجر کے مطابق اس کے راوی ثقہ ہیں، تاہم مخرمہ اور ان کے والد کے درمیان انقطاع کی وجہ سے اسے ضعیف یا مرسل کہا گیا ہے۔",
    "english": "Reported by An-Nasa'i (3401). Al-Hafiz Ibn Hajar stated that its narrators are reliable, but there is a disconnection between Makhramah and his father, making it Munqati' or Mursal."
  },
  "importantWords": [
    {
      "arabic": "ثَلَاثَ",
      "english": "Three",
      "urdu": "تین"
    },
    {
      "arabic": "جَمِيعًا",
      "english": "At once / Altogether",
      "urdu": "اکٹھی / ایک ساتھ"
    },
    {
      "arabic": "غَضْبَانَ",
      "english": "Angry",
      "urdu": "غصے میں"
    },
    {
      "arabic": "أَيُلْعَبُ",
      "english": "Is it played with?",
      "urdu": "کیا کھیلا جا رہا ہے؟"
    },
    {
      "arabic": "أَقْتُلُهُ",
      "english": "Should I kill him?",
      "urdu": "کیا میں اسے قتل کر دوں؟"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ایک ساتھ تین طلاقیں دینے پر نبی کریم ﷺ کے شدید غصے کا ذکر ہے، جس سے اس عمل کی سنگینی اور ممانعت واضح ہوتی ہے۔",
    "english": "This Hadith highlights the Prophet's (ﷺ) severe anger regarding giving three divorces at once, illustrating the gravity and prohibition of this act."
  },
  "references": [
    {
      "arabic": "رواه النسائي (3401)",
      "english": "Reported by An-Nasa'i (3401)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "محمود بن لبيد الأنصاري",
        "english": "Mahmud bin Labid Al-Ansari"
      },
      "slug": "mahmud-bin-labid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "ضعيف (بسبب الانقطاع)",
    "english": "Da'if (Due to disconnection)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اکٹھی تین طلاق کی ممانعت",
        "english": "Prohibition of Three Divorces at Once"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کتاب اللہ سے کھلواڑ",
              "english": "Mockery of Allah's Book"
            },
            "content": {
              "urdu": [
                "ایک ساتھ تین طلاقیں دینا اللہ کے مقرر کردہ ضابطوں کا مذاق اڑانا ہے۔",
                "قرآن مجید میں طلاق کو مرحلہ وار اور صلح کی گنجائش کے ساتھ رکھا گیا ہے۔",
                "نبی ﷺ نے اسے دین کے ساتھ مذاق قرار دے کر سخت ناپسند فرمایا۔"
              ],
              "english": [
                "Giving three divorces at once is a mockery of the rules prescribed by Allah.",
                "The Quran structures divorce in stages to allow for reconciliation attempts.",
                "The Prophet (ﷺ) explicitly disliked it, calling it a joke with religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "غصہِ نبوی کی وجہ",
              "english": "Reason for Prophetic Anger"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا غصہ اس بات پر تھا کہ لوگوں نے شریعت کی سہولت کو بگاڑ دیا۔",
                "بلا سوچے سمجھے طلاق دینا خاندانوں کی تباہی اور سماجی بگاڑ کا سبب ہے۔",
                "آپ ﷺ نے اپنی موجودگی میں ایسی بدعت پر شدید ردعمل کا اظہار فرمایا۔"
              ],
              "english": [
                "His anger was due to people distorting the ease provided by Shariah.",
                "Reckless divorce leads to the destruction of families and social corruption.",
                "The Prophet (ﷺ) reacted strongly against such innovations in his presence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طلاقِ سنت کا طریقہ",
        "english": "The Sunnah Method of Divorce"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرحلہ وار علیحدگی",
              "english": "Gradual Separation"
            },
            "content": {
              "urdu": [
                "سنت یہ ہے کہ ہر طہر کے دوران صرف ایک طلاق دی جائے۔",
                "اس طریقے سے شوہر کو رجوع کرنے اور سوچنے کا پورا موقع ملتا ہے۔",
                "ایک ساتھ تین طلاقیں دینے سے رجوع کا شرعی راستہ بند ہو جاتا ہے۔"
              ],
              "english": [
                "The Sunnah is to pronounce only one divorce during a period of purity.",
                "This method gives the husband full opportunity to rethink and reconcile.",
                "Pronouncing three at once closes the legal path for revocation."
              ]
            }
          },
          {
            "title": {
              "urdu": "شریعت کا منشا",
              "english": "Intent of Shariah"
            },
            "content": {
              "urdu": [
                "اسلام کا مقصد نکاح کو برقرار رکھنا ہے، اسے توڑنا پسندیدہ نہیں ہے۔",
                "طلاق کو آخری حل کے طور پر انتہائی ناگزیر حالات میں رکھا گیا ہے۔",
                "شرعی ضوابط غصے میں کیے گئے جذباتی فیصلوں کی روک تھام کرتے ہیں۔"
              ],
              "english": [
                "The goal of Islam is to preserve marriage; breaking it is disliked.",
                "Divorce is placed as a last resort in absolutely unavoidable situations.",
                "Shariah regulations prevent emotional decisions made in fits of rage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جرم اور سزا کا تصور",
        "english": "Concept of Crime and Punishment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قتل کی درخواست کی حکمت",
              "english": "Wisdom Behind Request to Kill"
            },
            "content": {
              "urdu": [
                "ایک صحابی کا اسے قتل کرنے کی اجازت مانگنا جرم کی سنگینی کو ظاہر کرتا ہے۔",
                "یہ اس بات کی دلیل ہے کہ حدود اللہ کو پامال کرنا کتنا بڑا گناہ ہے۔",
                "تاہم، طلاق دینا اگرچہ ناپسندیدہ ہے، مگر یہ قتل کا موجب نہیں ہے۔"
              ],
              "english": [
                "A companion asking for permission to kill him shows the gravity of the sin.",
                "It serves as evidence of how serious it is to violate Allah's boundaries.",
                "However, while disliked, giving a divorce does not warrant execution."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی بائیکاٹ اور تنبیہ",
              "english": "Social Admonition and Warning"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کے غصے نے اس عمل کے خلاف ایک سماجی نفرت پیدا کر دی۔",
                "لوگوں کو سبق ملا کہ خاندانی معاملات میں شریعت کی پابندی لازمی ہے۔",
                "دین میں اپنی مرضی شامل کرنا گمراہی اور بے برکتی کا باعث ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) anger created social abhorrence against this act.",
                "People learned that following Shariah in family matters is mandatory.",
                "Adding personal whims into religion leads to misguidance and lack of barakah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جذبات پر قابو پانا",
              "english": "Controlling Emotions"
            },
            "content": {
              "urdu": [
                "طلاق جیسے حساس فیصلے غصے یا جذباتی کیفیت میں نہیں کرنے چاہئیں۔",
                "مسلمان کو ہر حال میں عقل اور شریعت کو جذبات پر ترجیح دینی چاہیے۔",
                "غصے میں دی گئی طلاق اکثر پچھتاوے کا باعث بنتی ہے۔"
              ],
              "english": [
                "Sensitive decisions like divorce should not be made in anger.",
                "A Muslim must prioritize logic and Shariah over emotions at all times.",
                "Divorce given in anger often results in long-term regret."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم کی ضرورت",
              "english": "Requirement of Knowledge"
            },
            "content": {
              "urdu": [
                "نکاح و طلاق کے مسائل سے لاعلمی گھروں کی بربادی کی بڑی وجہ ہے۔",
                "ہر مرد پر لازم ہے کہ وہ ازدواجی زندگی کے شرعی حقوق و فرائض سیکھے۔",
                "علماء سے رہنمائی لینا ہی فتنوں سے بچنے کا بہترین راستہ ہے۔"
              ],
              "english": [
                "Ignorance of marriage and divorce rulings is a major cause of home ruin.",
                "Every man must learn the Shariah rights and duties of marital life.",
                "Seeking guidance from scholars is the best way to avoid fitnah."
              ]
            }
          }
        ]
      }
    }
  ]
}