{
  "hadithId": 723,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:2512"
    ],
    "kitabId": 7,
    "inKitabBab": 5,
    "arabicBook": "كتاب البيوع",
    "babId": 46
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2512). وأخرجه أيضاً أبو داود (3526) والترمذي (1254).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری نے اسے اپنی صحیح (2512) میں 'کتاب الرہن' کے تحت روایت کیا ہے۔ یہ حدیث رہن (Pledge) کے مال سے فائدہ اٹھانے کے ضوابط بیان کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2512). Also reported by Abu Dawud (3526) and At-Tirmidhi (1254)."
  },
  "importantWords": [
    {
      "arabic": "الظَّهْرُ",
      "english": "Back (animal's back)",
      "urdu": "پیٹھ / پشت (سواری والا جانور)"
    },
    {
      "arabic": "مَرْهُونًا",
      "english": "Mortgaged / Pledged",
      "urdu": "رہن رکھا ہوا"
    },
    {
      "arabic": "لَبَنُ اَلدَّرِّ",
      "english": "Milk of milch animal",
      "urdu": "دودھ دینے والے جانور کا دودھ"
    },
    {
      "arabic": "النَّفَقَةُ",
      "english": "Expenses / Maintenance",
      "urdu": "خرچہ / مصارف"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ اگر کوئی جانور بطورِ رہن (Security) کسی کے پاس ہو، تو وہ شخص اس کے چارے اور دیکھ بھال کے بدلے اس سے سواری یا دودھ کا فائدہ اٹھا سکتا ہے۔",
    "english": "This Hadith clarifies that a person holding a pledged animal as security can benefit from its riding or milk in exchange for providing its fodder and maintenance."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2512)",
      "english": "Sahih al-Bukhari (2512)"
    },
    {
      "arabic": "جامع الترمذي (1254)",
      "english": "Jami' At-Tirmidhi (1254)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0O5vXJ4Xm4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رہن کے بنیادی احکام",
        "english": "Foundational Rulings of Rahn (Pledge)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رہن کا مفہوم",
              "english": "Meaning of Rahn"
            },
            "content": {
              "urdu": [
                "رہن سے مراد وہ چیز ہے جو قرض کے بدلے بطورِ ضمانت (Security) رکھی جائے تاکہ ادائیگی نہ ہونے پر اس سے حق وصول کیا جا سکے۔",
                "رہن رکھی ہوئی چیز کی ملکیت اصل مالک (قرض لینے والے) کی ہی رہتی ہے۔",
                "مرتہن (جس کے پاس چیز رکھی گئی ہے) صرف اس کا محافظ ہوتا ہے۔"
              ],
              "english": [
                "Rahn refers to an item kept as security for a loan so that the debt can be recovered if the borrower defaults.",
                "The ownership of the pledged item remains with the original owner (the borrower).",
                "The pledgee (creditor) is merely a custodian of the item."
              ]
            }
          },
          {
            "title": {
              "urdu": "مصارف کے بدلے فائدہ",
              "english": "Benefit in Exchange for Maintenance"
            },
            "content": {
              "urdu": [
                "اگر رہن رکھی ہوئی چیز ایسی ہو جس پر خرچہ آتا ہے (جیسے جانور کا چارہ)، تو مرتہن اسے کھلا سکتا ہے۔",
                "چارے اور دیکھ بھال کے بدلے میں وہ جانور سے اتنا کام لے سکتا ہے یا دودھ پی سکتا ہے جو اس کے خرچے کے برابر ہو۔",
                "یہ اصول عدل پر مبنی ہے تاکہ نہ مالک پر بوجھ پڑے اور نہ سنبھالنے والے کا نقصان ہو۔"
              ],
              "english": [
                "If the pledged item requires maintenance costs (like animal fodder), the creditor can provide it.",
                "In exchange for maintenance, he may utilize the animal's riding or milk proportional to his expenses.",
                "This principle ensures justice so that neither the owner is burdened nor the custodian suffers loss."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Opinions of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام احمد اور امام اسحاق کا موقف",
              "english": "Position of Imams Ahmad and Ishaq"
            },
            "content": {
              "urdu": [
                "ان ائمہ کے نزدیک یہ حدیث صریح ہے کہ مرتہن (قرض دینے والا) جانور کا دودھ پی سکتا ہے اور سواری کر سکتا ہے بشرطیکہ وہ خرچہ اٹھائے۔",
                "اس کے لیے اصل مالک کی اجازت ضروری نہیں کیونکہ حدیث میں عام اجازت دی گئی ہے۔",
                "تاہم فائدہ اٹھانے کی مقدار خرچے سے زیادہ نہیں ہونی چاہیے۔"
              ],
              "english": [
                "According to these Imams, the Hadith explicitly allows the pledgee to use the animal if they bear the costs.",
                "Permission from the owner is not strictly required as the Hadith provides a general ruling.",
                "However, the benefit derived should not exceed the actual expenses incurred."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور فقہاء (احناف، شوافع، مالکیہ) کا موقف",
              "english": "Position of the Majority (Hanafi, Shafi'i, Maliki)"
            },
            "content": {
              "urdu": [
                "جمہور کے نزدیک رہن سے فائدہ اٹھانے کا اصل حق مالک کا ہے، کیونکہ وہ اس کی ملکیت ہے۔",
                "اگر مرتہن فائدہ اٹھاتا ہے تو یہ مالک کی اجازت سے ہونا چاہیے، ورنہ یہ 'ربا' (سود) کے زمرے میں آ سکتا ہے۔",
                "وہ اس حدیث کو ایسی صورت پر محمول کرتے ہیں جہاں مالک خرچہ دینے سے عاجز ہو یا غائب ہو۔"
              ],
              "english": [
                "The majority holds that the right to benefit from the pledge belongs to the owner, as it is his property.",
                "If the creditor benefits, it should be with the owner's consent; otherwise, it might resemble Riba (interest).",
                "They interpret this Hadith for cases where the owner is unable or unavailable to provide maintenance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سود (ربا) سے بچاؤ",
        "english": "Avoiding Usury (Riba)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغیر عوض فائدے کی ممانعت",
              "english": "Prohibition of Benefit Without Compensation"
            },
            "content": {
              "urdu": [
                "اسلامی قاعدہ ہے: 'ہر وہ قرض جو نفع کھینچ لائے وہ سود ہے'۔",
                "اگر قرض دینے والا رہن رکھی چیز سے مفت میں فائدہ اٹھائے تو یہ سود بن جائے گا۔",
                "اسی لیے حدیث میں 'بنفقتہ' (خرچے کے بدلے) کی شرط لگائی گئی ہے تاکہ نفع کے بدلے محنت یا مال موجود ہو۔"
              ],
              "english": [
                "The Islamic legal maxim states: 'Every loan that attracts a benefit is Riba'.",
                "If a creditor benefits from a pledged item for free, it becomes usury.",
                "Hence, the Hadith specifies 'in return for expenses' so that there is a valid counter-value (maintenance)."
              ]
            }
          },
          {
            "title": {
              "urdu": "گھر یا جائیداد کا رہن",
              "english": "Mortgage of House or Property"
            },
            "content": {
              "urdu": [
                "اگر کوئی گھر رہن رکھے اور قرض دینے والا اس میں مفت رہے، تو یہ حرام اور سود ہے۔",
                "گھر جانور کی طرح نہیں ہے کیونکہ گھر میں رہنے کے لیے مسلسل خرچہ (چارہ وغیرہ) نہیں کرنا پڑتا۔",
                "ایسی صورت میں رہنے والے کو مارکیٹ کے مطابق کرایہ دینا ہوگا جو قرض میں منہا کیا جا سکتا ہے۔"
              ],
              "english": [
                "If a house is pledged and the creditor lives in it for free, it is Haram and usurious.",
                "A house differs from an animal because it doesn't require constant daily maintenance like fodder.",
                "In such cases, the occupant must pay market rent, which can be deducted from the debt."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ اور عملی نصیحت",
        "english": "Summary and Practical Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانتداری کی اہمیت",
              "english": "Importance of Trust"
            },
            "content": {
              "urdu": [
                "مرتہن (قرض دینے والا) کے پاس رہن کی چیز امانت ہوتی ہے، اسے اس کی حفاظت کرنی چاہیے۔",
                "اگر اس کی غفلت سے چیز ضائع ہو جائے تو وہ اس کا ضامن (ذمہ دار) ہوگا۔",
                "اسلامی معاشرے میں مالی معاملات کی بنیاد سچائی اور امانت پر ہونی چاہیے۔"
              ],
              "english": [
                "The creditor holds the pledged item as a trust (Amanah) and must protect it.",
                "If the item is lost due to his negligence, he is liable for the loss.",
                "In an Islamic society, financial dealings should be rooted in truth and integrity."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف",
              "english": "Fairness and Justice"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ اسلام کسی کا حق مارنے کی اجازت نہیں دیتا۔",
                "اگر آپ کسی کا کام کر رہے ہیں یا خرچہ اٹھا رہے ہیں تو اس کا جائز معاوضہ آپ کا حق ہے۔",
                "معاشی معاملات میں شرعی حدود کی پابندی ہی برکت کا راستہ ہے۔"
              ],
              "english": [
                "This Hadith proves that Islam does not allow usurping anyone's rights.",
                "If you are maintaining someone's property or bearing costs, you are entitled to fair compensation.",
                "Adhering to Sharia limits in economic matters is the path to divine blessing."
              ]
            }
          }
        ]
      }
    }
  ]
}