{
  "hadithId": 1167,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/45"],
    "kitabId": 12,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأضحية",
    "babId": 94
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1318). وأخرجه أبو داود (2809)، والترمذي (1502)، والنسائي (4392)، وابن ماجه (3132).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1318) نے اسے روایت کیا ہے۔ یہ روایت بڑے جانور میں شراکت کے جواز پر نصِ صریح ہے۔",
    "english": "Sahih. Reported by Muslim (1318). Also recorded by Abu Dawud (2809), At-Tirmidhi (1502), and An-Nasa'i (4392)."
  },
  "importantWords": [
    {
      "arabic": "نَحَرْنَا",
      "english": "We sacrificed",
      "urdu": "ہم نے نحر کیا / ذبح کیا"
    },
    {
      "arabic": "عَامَ اَلْحُدَيْبِيَةِ",
      "english": "Year of Al-Hudaibiya",
      "urdu": "حدیبیہ کا سال"
    },
    {
      "arabic": "اَلْبَدَنَةَ",
      "english": "Camel",
      "urdu": "اونٹ"
    },
    {
      "arabic": "اَلْبَقَرَةَ",
      "english": "Cow",
      "urdu": "گائے"
    },
    {
      "arabic": "سَبْعَةٍ",
      "english": "Seven (persons)",
      "urdu": "سات افراد"
    }
  ],
  "summary": {
    "urdu": "قربانی میں گائے اور اونٹ کے اندر سات افراد شریک ہو سکتے ہیں، جیسا کہ صحابہ کرام نے نبی ﷺ کی موجودگی میں کیا۔",
    "english": "It is permissible for up to seven people to share in the sacrifice of a single camel or cow, as practiced by the Companions."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1318)",
      "english": "Sahih Muslim (1318)"
    },
    {
      "arabic": "سنن النسائي (4392)",
      "english": "Sunan an-Nasa'i (4392)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=5UeW-qB7C4Y",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بڑے جانور میں شراکت کا حکم",
        "english": "Ruling on Sharing Large Animals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سات حصوں کی اجازت",
              "english": "Permission for Seven Shares"
            },
            "content": {
              "urdu": [
                "اس حدیث سے واضح ہوتا ہے کہ ایک اونٹ یا گائے سات افراد کی طرف سے کافی ہے۔",
                "یہ حکم نفلی اور واجب دونوں طرح کی قربانیوں کے لیے یکساں ہے۔",
                "شریعت نے مسلمانوں کے لیے مالی آسانی پیدا کرنے کے لیے یہ رخصت دی ہے۔"
              ],
              "english": [
                "This Hadith clarifies that one camel or cow is sufficient for seven individuals.",
                "This ruling applies equally to both voluntary and obligatory sacrifices.",
                "Shariah provided this concession to create financial ease for the Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "شراکت کی شرائط",
              "english": "Conditions for Partnership"
            },
            "content": {
              "urdu": [
                "تمام شرکاء کی نیت اللہ کا قرب حاصل کرنا اور قربانی کرنا ہونی چاہیے۔",
                "اگر ایک شریک کی نیت بھی صرف گوشت حاصل کرنا ہو تو کسی کی قربانی نہیں ہوگی۔",
                "حصص کی تقسیم عدل و انصاف کے ساتھ وزن کر کے ہونی چاہیے۔"
              ],
              "english": [
                "The intention of all partners must be to seek closeness to Allah through sacrifice.",
                "If even one partner intends only to get meat, the sacrifice of none will be valid.",
                "The distribution of shares must be done justly through accurate weighing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تاریخی پس منظر: صلح حدیبیہ",
        "english": "Historical Context: Hudaibiya"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سفر میں قربانی",
              "english": "Sacrifice During Travel"
            },
            "content": {
              "urdu": [
                "صلح حدیبیہ کے سال صحابہ کرام احرام کی حالت میں تھے اور عمرہ نہ کر سکے۔",
                "آپ ﷺ کے حکم پر صحابہ نے وہیں اپنے جانور ذبح کر کے احرام کھولے۔",
                "اس واقعے سے ثابت ہوا کہ سفر اور خاص حالات میں شراکت جائز ہے۔"
              ],
              "english": [
                "During the year of Hudaibiya, the Companions were in Ihram but could not perform Umrah.",
                "Upon the Prophet's (ﷺ) order, they slaughtered their animals there and exited Ihram.",
                "This incident proves that sharing is permissible during travel and special circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا عمل",
              "english": "Practice of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے رسول اللہ ﷺ کی نگرانی میں یہ اجتماعی قربانی انجام دی۔",
                "سیدنا جابر کی روایت اس عمل کی مستند ترین گواہی فراہم کرتی ہے۔",
                "یہ سنت آج بھی مسلمانوں کے لیے قربانی کے ایام میں مشعلِ راہ ہے۔"
              ],
              "english": [
                "The Companions performed this collective sacrifice under the supervision of the Prophet (ﷺ).",
                "Jabir's (RA) narration provides the most authentic testimony of this practice.",
                "This Sunnah continues to serve as a guide for Muslims during the days of Eid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اونٹ اور گائے کی فضیلت",
        "english": "Excellence of Camels and Cows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بڑے جانور کی اہمیت",
              "english": "Importance of Large Animals"
            },
            "content": {
              "urdu": [
                "بڑے جانور کی قربانی میں گوشت کی مقدار زیادہ ہوتی ہے جو مساکین کے لیے بہتر ہے۔",
                "اونٹ کی قربانی کو 'نحر' کہا جاتا ہے جو سنتِ ابراہیمی کی یادگار ہے۔",
                "گائے کی قربانی بھی اسی درجے میں آتی ہے اور سات افراد کے لیے کافی ہے۔"
              ],
              "english": [
                "Sacrificing large animals yields more meat, which is beneficial for the poor.",
                "The camel sacrifice is called 'Nahr', a memorial of the Abrahamic tradition.",
                "The cow sacrifice falls under the same category and suffices for seven people."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی عبادت کا تصور",
              "english": "Concept of Collective Worship"
            },
            "content": {
              "urdu": [
                "شراکت داری مسلمانوں کے درمیان اتحاد اور باہمی تعاون کو فروغ دیتی ہے۔",
                "کم آمدنی والے افراد بھی بڑے جانور کی قربانی میں شامل ہو سکتے ہیں۔",
                "یہ عمل اسلامی معاشرت میں مساوات اور بھائی چارے کی علامت ہے۔"
              ],
              "english": [
                "Partnership promotes unity and mutual cooperation among Muslims.",
                "Individuals with lower income can also participate in sacrificing large animals.",
                "This act symbolizes equality and brotherhood within the Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و عملی سبق",
        "english": "Ethical and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیت کی درستگی",
              "english": "Correction of Intention"
            },
            "content": {
              "urdu": [
                "قربانی کا ہر حصہ صرف اللہ کے نام اور اس کی رضا کے لیے ہونا چاہیے۔",
                "شرکاء کو چاہیے کہ وہ ایک دوسرے کے مال اور نیت پر اعتماد کریں۔",
                "دکھاوے اور ریاکاری سے بچنا ہی قربانی کی قبولیت کی بنیادی شرط ہے۔"
              ],
              "english": [
                "Every share of the sacrifice must be solely in Allah's name and for His pleasure.",
                "Partners should maintain trust in each other's wealth and intentions.",
                "Avoiding show-off and hypocrisy is the primary condition for acceptance."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "اسلام ایک آسان دین ہے جو اپنی عبادات میں وسعت فراہم کرتا ہے۔",
                "شراکت کی اجازت تنگیِ رزق کے دور میں ایک بڑی نعمت ہے۔",
                "ہمیں اللہ کے احکامات کی پیروی کرنی چاہیے تاکہ برکات حاصل ہوں۔"
              ],
              "english": [
                "Islam is an easy religion that provides flexibility in its acts of worship.",
                "The permission for partnership is a great blessing during economic hardship.",
                "We must follow Allah's commands to attain divine blessings."
              ]
            }
          }
        ]
      }
    }
  ]
}