{
  "hadithId": 825,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/2"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5063)، ومسلم (1401) عن أنس بن مالك رضي الله عنه.",
    "urdu": "صحیح۔ اسے بخاری (5063) اور مسلم (1401) نے انس بن مالک رضی اللہ عنہ سے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5063) and Muslim (1401) on the authority of Anas bin Malik (RA)."
  },
  "importantWords": [
    {
      "arabic": "حَمِدَ",
      "english": "Praised",
      "urdu": "تعریف کی"
    },
    {
      "arabic": "أثْنَى",
      "english": "Extolled / Commended",
      "urdu": "ثنا بیان کی"
    },
    {
      "arabic": "أُفْطِرُ",
      "english": "Break fast",
      "urdu": "افطار کرتا ہوں"
    },
    {
      "arabic": "أَتَزَوَّجُ",
      "english": "I marry",
      "urdu": "میں نکاح کرتا ہوں"
    },
    {
      "arabic": "رَغِبَ عَنْ",
      "english": "Turned away from",
      "urdu": "منہ پھیرا / بے رغبتی کی"
    },
    {
      "arabic": "سُنَّتِي",
      "english": "My Way / Tradition",
      "urdu": "میرا طریقہ"
    }
  ],
  "summary": {
    "urdu": "اسلام رہبانیت (دنیا چھوڑنے) کی نفی کرتا ہے اور اعتدال کے ساتھ سنتِ نبوی پر عمل کرنے کی تلقین کرتا ہے۔",
    "english": "Islam rejects monasticism and commands following the Prophet's balanced lifestyle of worship and worldly responsibilities."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5063)",
      "english": "Sahih al-Bukhari (5063)"
    },
    {
      "arabic": "صحيح مسلم (1401)",
      "english": "Sahih Muslim (1401)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=XWp7eW8q7rY",
  "grade": {
    "arabic": "صحيح (متفق عليه)",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اعتدال اور توازن",
        "english": "Moderation and Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں میانہ روی",
              "english": "Moderation in Worship"
            },
            "content": {
              "urdu": [
                "نبی کریم صلی اللہ علیہ وسلم نے پوری رات جاگنے کے بجائے سونے اور نماز دونوں کو اہمیت دی۔",
                "آپ صلی اللہ علیہ وسلم ہمیشہ روزے نہیں رکھتے تھے بلکہ ناغہ بھی فرماتے تھے۔",
                "یہ طرزِ عمل امت کو سکھاتا ہے کہ جسم کا بھی انسان پر حق ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) emphasized both prayer and sleep instead of staying awake all night.",
                "He did not fast every single day, showing that periodic rest is necessary.",
                "This practice teaches the Ummah that the body has rights over the individual."
              ]
            }
          },
          {
            "title": {
              "urdu": "رہبانیت کی نفی",
              "english": "Rejection of Monasticism"
            },
            "content": {
              "urdu": [
                "اسلام میں عیسائیت کی طرح دنیا کو بالکل چھوڑ دینے کا کوئی تصور نہیں ہے۔",
                "نکاح کرنا انبیاء کی سنت ہے اور اسے ترک کرنا دینداری نہیں ہے۔",
                "دین اور دنیا کی ضروریات میں توازن قائم کرنا ہی اصل بندگی ہے۔"
              ],
              "english": [
                "Islam does not support the total abandonment of the world like Christian monasticism.",
                "Marriage is a Sunnah of the Prophets and avoiding it is not a sign of piety.",
                "True servitude lies in balancing religious duties with worldly needs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت کی اہمیت",
        "english": "Importance of Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت سے انحراف کا انجام",
              "english": "Consequence of Shunning Sunnah"
            },
            "content": {
              "urdu": [
                "جو شخص یہ سمجھے کہ اس کا خود ساختہ طریقہ سنت سے بہتر ہے، وہ گمراہ ہے۔",
                "سنت نبوی سے منہ پھیرنے والا نبی کریم صلی اللہ علیہ وسلم کی نسبت سے محروم ہو جاتا ہے۔",
                "دین میں غلو یا زیادتی کرنا انسان کو حق کے راستے سے دور کر دیتا ہے۔"
              ],
              "english": [
                "One who believes their self-invented method is better than the Sunnah is misguided.",
                "Whoever turns away from the Sunnah loses their spiritual connection with the Prophet (ﷺ).",
                "Exaggeration or over-strictness in religion leads a person away from the truth."
              ]
            }
          },
          {
            "title": {
              "urdu": "کامل نمونہ",
              "english": "The Perfect Example"
            },
            "content": {
              "urdu": [
                "رسول اللہ صلی اللہ علیہ وسلم کی زندگی ہر شعبہ ہائے زندگی کے لیے کامل ترین نمونہ ہے۔",
                "تقویٰ کا مطلب یہ نہیں کہ انسان حلال چیزوں کو خود پر حرام کر لے۔",
                "آپ صلی اللہ علیہ وسلم اللہ سے سب سے زیادہ ڈرنے والے تھے پھر بھی نکاح فرماتے تھے۔"
              ],
              "english": [
                "The life of the Messenger (ﷺ) is the most perfect example for all aspects of life.",
                "Piety does not mean that a person forbids lawful things for themselves.",
                "The Prophet (ﷺ) feared Allah the most, yet he participated in family life through marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اثرات",
        "english": "Social Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کی اہمیت",
              "english": "Significance of Marriage"
            },
            "content": {
              "urdu": [
                "نکاح معاشرے میں اخلاقی اقدار کے تحفظ کا بہترین ذریعہ ہے۔",
                "یہ سنت خاندانی نظام کو مضبوط کرتی ہے اور پاکدامنی فراہم کرتی ہے۔",
                "نبی کریم صلی اللہ علیہ وسلم نے نکاح کو اپنی سنت قرار دے کر اس کی حوصلہ افزائی کی۔"
              ],
              "english": [
                "Marriage is the best means of protecting moral values within a society.",
                "This Sunnah strengthens the family system and ensures chastity.",
                "By declaring marriage as his Sunnah, the Prophet (ﷺ) encouraged social stability."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد",
              "english": "Rights of People"
            },
            "content": {
              "urdu": [
                "خاندان اور بیوی بچوں کے حقوق ادا کرنا بھی عبادت کا حصہ ہے۔",
                "صرف حقوق اللہ میں مشغول ہو کر حقوق العباد کو بھولنا غلط ہے۔",
                "اسلام ایک ایسا دین ہے جو فرد کو معاشرے کے ساتھ جوڑ کر رکھتا ہے۔"
              ],
              "english": [
                "Fulfilling the rights of family and children is considered a form of worship.",
                "It is wrong to neglect the rights of people while being solely occupied with the rights of Allah.",
                "Islam is a religion that keeps the individual integrated within the community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلو فی الدین سے ممانعت",
              "english": "Prohibition of Extremism"
            },
            "content": {
              "urdu": [
                "نیک اعمال میں بھی حد سے زیادہ سختی کرنا ناپسندیدہ عمل ہے۔",
                "صحابہ کرام کو بھی آپ صلی اللہ علیہ وسلم نے شدت پسندی سے روکا۔",
                "دین کو آسان سمجھ کر اس پر استقامت اختیار کرنا ہی کامیابی ہے۔"
              ],
              "english": [
                "Excessive strictness, even in good deeds, is a disliked action in Islam.",
                "The Prophet (ﷺ) explicitly warned the Companions against religious extremism.",
                "Success lies in understanding religion as easy and remaining steadfast upon it."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلاحِ احوال",
              "english": "Self-Correction"
            },
            "content": {
              "urdu": [
                "انسان کو اپنی نیتوں اور اعمال کا سنت کی روشنی میں جائزہ لینا چاہیے۔",
                "اگر کوئی عمل بظاہر نیکی ہو مگر سنت کے خلاف ہو تو وہ مردود ہے۔",
                "ہمیں اپنے روزمرہ کے معمولات کو سنتِ نبوی کے مطابق ڈھالنا چاہیے۔"
              ],
              "english": [
                "A person must evaluate their intentions and deeds in the light of the Sunnah.",
                "If an act appears pious but contradicts the Sunnah, it is rejected.",
                "We must mold our daily routines according to the lifestyle of the Prophet (ﷺ)."
              ]
            }
          }
        ]
      }
    }
  ]
}