{
  "hadithId": 1024,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1174"],
    "kitabId": 9,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام",
    "babId": 82
  },
 
  "takhreej": {
    "arabic": "صحيح رواه مسلم (2916). وأخرجه البخاري (447) من حديث أبي سعيد الخدري بلفظ: ويح عمار تقتله الفئة الباغية، يدعوهم إلى الجنة، ويدعونه إلى النار.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے (2916) پر روایت کیا ہے۔ اس کی اصل صحیح بخاری میں بھی موجود ہے جہاں الفاظ ہیں: ’افسوس عمار پر! اسے ایک باغی گروہ قتل کرے گا، وہ انہیں جنت کی طرف بلائے گا اور وہ اسے آگ کی طرف بلائیں گے۔‘",
    "english": "Sahih (Authentic). Reported by Muslim (2916). Al-Bukhari also reported it (447) from Abu Sa'id al-Khudri with the addition: 'Ammar will be calling them to Paradise and they will be calling him to Hellfire.'"
  },
  "importantWords": [
    {
      "arabic": "تَقْتُلُ",
      "english": "Will kill",
      "urdu": "قتل کرے گا"
    },
    {
      "arabic": "عَمَّارًا",
      "english": "Ammar (bin Yasir)",
      "urdu": "عمار بن یاسر (صحابی)"
    },
    {
      "arabic": "اَلْفِئَةُ",
      "english": "The group / Party",
      "urdu": "گروہ / جماعت"
    },
    {
      "arabic": "اَلْبَاغِيَةُ",
      "english": "Rebellious / Oppressive",
      "urdu": "بغاوت کرنے والا / ظالم"
    },
    {
      "arabic": "وَيْح",
      "english": "Alas / Pity",
      "urdu": "افسوس / کلمہ تاسف"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی کریم ﷺ کی ایک عظیم پیشگوئی ہے جس میں آپ ﷺ نے سیدنا عمار بن یاسر کی شہادت اور قاتل گروہ کے 'باغی' ہونے کی خبر پہلے ہی دے دی تھی۔",
    "english": "This Hadith is a major prophecy of the Prophet ﷺ wherein he foretold the martyrdom of Ammar bin Yasir and characterized his killers as a 'rebellious group'."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2916)",
      "english": "Sahih Muslim (2916)"
    },
    {
      "arabic": "صحيح البخاري (447)",
      "english": "Sahih al-Bukhari (447)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة هند بنت أبي أمية",
        "english": "Umm Salama Hind bint Abi Umayya"
      },
      "slug": "umm-salama"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عمار بن ياسر",
        "english": "Ammar bin Yasir"
      },
      "slug": "ammar-bin-yasir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R0uW4K_7V9M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پیشگوئی کی صداقت",
        "english": "Authenticity of the Prophecy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستقبل کی خبر",
              "english": "News of the Future"
            },
            "content": {
              "urdu": [
                "یہ حدیث نبی کریم ﷺ کے سچا رسول ہونے کی ایک بڑی نشانی اور معجزہ ہے۔",
                "آپ ﷺ نے اپنی وفات سے کئی سال پہلے عمار بن یاسر کی شہادت کی خبر دی۔",
                "تاریخ نے ثابت کیا کہ سیدنا عمار جنگِ صفین میں حضرت علی کے ساتھ لڑتے ہوئے شہید ہوئے۔"
              ],
              "english": [
                "This Hadith is a great sign and miracle proving the truth of the Prophet ﷺ.",
                "He foretold the martyrdom of Ammar bin Yasir many years before his own passing.",
                "History confirmed that Ammar was martyred during the Battle of Siffin while fighting alongside Ali (RA)."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدنا عمار کا مقام",
              "english": "Status of Ammar (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عمار بن یاسر اسلام کے ابتدائی جانثاروں اور السابقون الاولون میں سے تھے۔",
                "نبی ﷺ نے ان کے بارے میں فرمایا تھا کہ عمار ایمان سے لبریز ہیں۔",
                "ان کی شہادت حق اور باطل کے درمیان امتیاز کی ایک علامت بن گئی۔"
              ],
              "english": [
                "Ammar bin Yasir was among the earliest converts and the foremost in Islam.",
                "The Prophet ﷺ once described him as being filled with faith to his very marrow.",
                "His martyrdom became a symbolic criterion to distinguish truth from falsehood."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "’فئہ باغیہ‘ کی تشریح",
        "english": "Explanation of 'Rebellious Group'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظ باغی کا مفہوم",
              "english": "Meaning of the word 'Baghia'"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک اس کا مطلب وہ گروہ ہے جو برحق امام کی اطاعت سے نکل جائے۔",
                "سیدنا عمار کو شہید کرنے والا گروہ حضرت معاویہ کا لشکر تھا جن سے خطا ہوئی۔",
                "اہلِ سنت کا موقف ہے کہ یہ گروہ باغی تھا مگر وہ کافر یا ملت سے خارج نہیں تھے۔"
              ],
              "english": [
                "According to jurists, it refers to a group that diverges from the rightful leader.",
                "The group that killed Ammar was Muawiyah's army, who made a juristic error.",
                "The Sunni stance is that they were 'rebellious' but not disbelievers or out of the fold of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "حق کا معیار",
              "english": "Standard of Truth"
            },
            "content": {
              "urdu": [
                "اس حدیث سے ثابت ہوتا ہے کہ اس وقت حق سیدنا علی بن ابی طالب کے ساتھ تھا۔",
                "صحابہ کرام اس حدیث کی بنیاد پر حقدار گروہ کی پہچان کیا کرتے تھے۔",
                "یہ حدیث سیاسی اختلافات میں شرعی رہنمائی کا ایک اہم ذریعہ بنی۔"
              ],
              "english": [
                "This Hadith proves that at the time of the conflict, the truth was with Ali bin Abi Talib.",
                "The Companions used this prophecy as a criterion to identify the rightful party.",
                "The Hadith serves as an essential Shariah guide during political disputes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اہلِ سنت کا متوازن موقف",
        "english": "Balanced Stance of Ahl al-Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کے باہمی اختلافات",
              "english": "Differences among Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کے درمیان ہونے والی جنگیں ان کی اجتہادی خطاؤں کا نتیجہ تھیں۔",
                "ہمیں ان کے اختلافات میں خاموشی اختیار کرنی چاہیے اور سب کا احترام کرنا چاہیے۔",
                "خطا کار گروہ کے لیے بھی اللہ سے مغفرت کی دعا کرنی چاہیے کیونکہ وہ صاحبِ ایمان تھے۔"
              ],
              "english": [
                "The wars between Companions were the result of errors in personal judgment (Ijtihad).",
                "We must remain silent regarding their disputes and respect all of them.",
                "One should pray for forgiveness even for the mistaken party, as they were believers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتہاد اور ثواب",
              "english": "Ijtihad and Reward"
            },
            "content": {
              "urdu": [
                "اگر مجتہد سے حق تک پہنچنے میں غلطی ہو جائے تو بھی اسے ایک ثواب ملتا ہے۔",
                "باغی گروہ نے اپنے گمان میں حق کی حمایت کی تھی، اگرچہ وہ حق پر نہیں تھے۔",
                "اسلامی تاریخ کے ان نازک پہلوؤں کو صرف مستند نصوص کی روشنی میں دیکھنا چاہیے۔"
              ],
              "english": [
                "If a mujtahid errs in reaching the truth, he still receives one reward.",
                "The rebellious group supported what they perceived as truth, though they were mistaken.",
                "These sensitive aspects of Islamic history must only be viewed through authentic texts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و اخلاقی اسباق",
        "english": "Practical and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق پر استقامت",
              "english": "Steadfastness on Truth"
            },
            "content": {
              "urdu": [
                "سیدنا عمار نے آخری سانس تک حق کا ساتھ دیا اور بوڑھے ہونے کے باوجود پیچھے نہ ہٹے۔",
                "مومن کو چاہیے کہ فتنوں کے دور میں حق کی پہچان کرے اور اس پر ڈٹ جائے۔",
                "شہادت کی تمنا اور اللہ کی راہ میں جان دینا ایک عظیم سعادت ہے۔"
              ],
              "english": [
                "Ammar (RA) stood with the truth until his last breath, despite his old age.",
                "A believer should identify the truth during times of fitna and remain steadfast.",
                "Desiring martyrdom and giving one's life for Allah's sake is a great honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "فتنہ گری سے بچاؤ",
              "english": "Avoiding Incitement"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو آپس میں لڑانے والے گروہ ہمیشہ فتنہ و فساد کا باعث بنتے ہیں۔",
                "بغاوت اور انتشار معاشرے کی بنیادیں کھوکھلی کر دیتا ہے۔",
                "اتحادِ امت کی کوشش کرنا ہر مسلمان کا فرضِ منصبی ہے۔"
              ],
              "english": [
                "Groups that cause Muslims to fight each other are always sources of mischief.",
                "Rebellion and disunity hollow out the foundations of society.",
                "Striving for the unity of the Ummah is a primary duty for every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}