{
  "hadithId": 634,
  "hadithNo": 28,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh-al-maram/6/54"
    ],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه أبو داود (1985)، والدارقطني (2/272)، والبيهقي (5/134). وحسنه ابن حجر في بلوغ المرام وقواه غير واحد من الأئمة.",
    "urdu": "صحیح (شواہد کی بنا پر)۔ اسے ابوداؤد (1985)، دارقطنی اور بیہقی نے روایت کیا ہے۔ حافظ ابن حجر نے اسے حسن قرار دیا ہے اور دیگر روایات اس کی تائید کرتی ہیں۔",
    "english": "Sahih through corroborating evidences. Reported by Abu Dawud (1985), ad-Daraqutni, and al-Baihaqi. Ibn Hajar graded it as 'Hasan' in Bulugh al-Maram."
  },
  "importantWords": [
    {
      "arabic": "حَلْقٌ",
      "english": "Shaving",
      "urdu": "منڈوانا / استرا پھیرنا"
    },
    {
      "arabic": "يُقَصِّرْنَ",
      "english": "They shorten",
      "urdu": "وہ کتروائیں / چھوٹا کریں"
    },
    {
      "arabic": "النِّسَاءِ",
      "english": "Women",
      "urdu": "عورتیں"
    }
  ],
  "summary": {
    "urdu": "حج یا عمرہ کے بعد احرام سے نکلنے کے لیے عورتوں کے لیے سر منڈوانا جائز نہیں، ان کے لیے صرف بالوں کو تھوڑا سا کاٹنا (قصر) لازم ہے۔",
    "english": "For exiting Ihram after Hajj or Umrah, women are forbidden from shaving their heads; they are only required to clip or shorten a small portion of their hair."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1985)",
      "english": "Sunan Abi Dawud (1985)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "حَسَن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواتین کے لیے حلق اور قصر کا حکم",
        "english": "Ruling of Halq and Qasr for Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلق کی ممانعت",
              "english": "Prohibition of Shaving"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے سر منڈوانا (حلق) افضل ہے، لیکن خواتین کے لیے یہ منع ہے۔",
                "عورت کے سر کے بال اس کی زینت اور فطری حسن کا حصہ ہیں، اسلام نے ان کی حفاظت کا حکم دیا ہے۔",
                "بلا ضرورت سر منڈوانا عورت کے لیے مثلہ (شکل بگاڑنا) کے زمرے میں آتا ہے جو شرعاً ناپسندیدہ ہے۔"
              ],
              "english": [
                "While shaving the head (Halq) is superior for men, it is prohibited for women.",
                "A woman's hair is part of her natural beauty and adornment, which Islam protects.",
                "Shaving a woman's head without a medical necessity is considered a form of disfigurement (Muthla) and is legally disliked."
              ]
            }
          },
          {
            "title": {
              "urdu": "قصر کی مقدار",
              "english": "Amount to Shorten"
            },
            "content": {
              "urdu": [
                "خواتین کو چاہیے کہ وہ اپنے بالوں کی چٹیا یا مینڈھی کے سرے سے انگلی کے ایک جوڑ (ایک پور) کے برابر بال کاٹیں۔",
                "اگر بال لٹکے ہوئے نہ ہوں تو سر کے بالوں کے کسی بھی حصے سے اتنی مقدار کاٹنا کافی ہے۔",
                "اتنا کرنے سے احرام کی تمام پابندیاں ختم ہو جاتی ہیں۔"
              ],
              "english": [
                "Women should cut an amount equal to a fingertip (about an inch) from the ends of their braids or ponytail.",
                "If the hair is not long enough to be gathered, clipping that amount from any part of the hair is sufficient.",
                "Performing this act officially ends all the restrictions of the state of Ihram."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی تعلیمات میں عورت کی نزاکت کا لحاظ",
        "english": "Consideration of Female Sensitivity in Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطرت کی پاسداری",
              "english": "Upholding Human Nature"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ دینِ اسلام انسانی فطرت اور صنفی نزاکتوں کا مکمل پاسبان ہے۔",
                "جہاں مردوں کو عاجزی کے اظہار کے لیے بال قربان کرنے کی ترغیب دی گئی، وہیں عورت کو اس کی زینت برقرار رکھنے کی رعایت دی گئی۔",
                "شریعت کے احکامات عقل اور مصلحت پر مبنی ہیں۔"
              ],
              "english": [
                "This Hadith highlights how Islam respects human nature and gender differences.",
                "While men are encouraged to sacrifice their hair as a sign of humility, women are granted an exception to maintain their adornment.",
                "Sharia rulings are always based on wisdom and the best interests of the believers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو",
        "english": "Juristic Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجماعِ امت",
              "english": "Consensus of the Ummah"
            },
            "content": {
              "urdu": [
                "تمام فقہاء اس بات پر متفق ہیں کہ عورت پر حلق نہیں ہے بلکہ قصر واجب ہے۔",
                "اگر کوئی عورت لاعلمی میں سر منڈوا لے تو وہ گناہگار ہوگی مگر اس کا حج مکمل مانا جائے گا۔",
                "حج کے مسائل میں مرد و عورت کے درمیان چند مخصوص مقامات پر یہ فرق موجود ہے۔"
              ],
              "english": [
                "There is a consensus (Ijma') among scholars that shaving is not for women; only shortening is required.",
                "If a woman shaves her head out of ignorance, she is sinful, though her Hajj is technically valid.",
                "This is one of the specific points in Hajj where the rulings for men and women differ."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علمِ دین کی اہمیت",
              "english": "Importance of Religious Knowledge"
            },
            "content": {
              "urdu": [
                "خواتین کو چاہیے کہ وہ حج پر جانے سے پہلے اپنے مخصوص مسائل کا مطالعہ کریں۔",
                "عبادت کی درستگی کے لیے سنتِ نبوی کے مطابق عمل کرنا لازمی ہے۔",
                "اللہ کی بندگی اس کے احکامات کی حدود میں رہ کر ہی قبول ہوتی ہے۔"
              ],
              "english": [
                "Women should study the specific issues related to them before embarking on Hajj.",
                "Correctness of worship depends on following the Prophetic Sunnah.",
                "Submission to Allah is only accepted when performed within the boundaries of His commands."
              ]
            }
          }
        ]
      }
    }
  ]
}