{
  "hadithId": 894,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/84"],
    "kitabId": 8,
    "inKitabBab": 5,
    "arabicBook": "كتاب النكاح",
    "babId": 68
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (1432). وأخرجه البخاري (5177) بنحوه موقوفاً على أبي هريرة وله حكم الرفع. والحديث يحذر من التمييز الطبقي في دعوات الطعام.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1432) نے اسے روایت کیا ہے۔ امام بخاری نے اسے ابوہریرہ رضی اللہ عنہ پر موقوفاً روایت کیا ہے لیکن حکماً یہ مرفوع ہی ہے۔ اس میں دعوتوں میں غریبوں کو نظر انداز کرنے کی مذمت کی گئی ہے۔",
    "english": "Sahih. Reported by Muslim (1432). Al-Bukhari (5177) recorded it as a statement of Abu Hurairah, but it carries the ruling of being a Prophetic saying. It warns against class discrimination in food invitations."
  },
  "importantWords": [
    {
      "arabic": "شَرُّ",
      "english": "The worst",
      "urdu": "بدترین"
    },
    {
      "arabic": "يُمْنَعُهَا",
      "english": "Prevented from it",
      "urdu": "اس سے روک دیا جاتا ہے"
    },
    {
      "arabic": "يَأْبَاهَا",
      "english": "Refuses it",
      "urdu": "اس سے انکار کرتا ہے"
    },
    {
      "arabic": "لَمْ يُجِبِ",
      "english": "Did not respond / accept",
      "urdu": "جواب نہ دیا / قبول نہ کی"
    },
    {
      "arabic": "عَصَى",
      "english": "Disobeyed",
      "urdu": "نافرمانی کی"
    }
  ],
  "summary": {
    "urdu": "ولیمہ کی وہ دعوت بدترین ہے جس میں صرف امیروں کو بلایا جائے اور غریبوں کو محروم رکھا جائے۔ نیز، بلا عذر شرعی دعوتِ ولیمہ کو رد کرنا گناہ ہے۔",
    "english": "The worst Walima is one where the poor are excluded in favor of the rich. Additionally, declining a Walima invitation without a valid Sharia excuse is an act of disobedience."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤٣٢",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1432"
    },
    {
      "arabic": "صحيح البخاري، كتاب النكاح، رقم الحديث ٥١٧٧",
      "english": "Sahih Bukhari, Book of Marriage, Hadith No. 5177"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqGjI2Y8HLo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعوتِ ولیمہ میں طبقاتی فرق کی مذمت",
        "english": "Condemnation of Classism in Walima"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امیر اور غریب کا توازن",
              "english": "Balance Between Rich and Poor"
            },
            "content": {
              "urdu": [
                "ولیمہ ایک بابرکت عبادت ہے، لیکن جب اس میں صرف دنیاوی جاہ و جلال کے لیے امیروں کو بلایا جائے تو اس کی برکت ختم ہو جاتی ہے۔",
                "غریبوں کو دعوت سے محروم کرنا تکبر کی علامت ہے جسے اللہ تعالیٰ سخت ناپسند فرماتا ہے۔",
                "بہترین ولیمہ وہ ہے جس میں معاشرے کے ہر طبقے، خصوصاً ضرورت مندوں کا خیال رکھا جائے۔"
              ],
              "english": [
                "Walima is a blessed act, but when it is used to show off status by only inviting the wealthy, its blessing is lost.",
                "Excluding the poor from such gatherings is a sign of arrogance, which Allah intensely dislikes.",
                "The best Walima is one that includes all social classes, especially the needy."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھانے کی تاثیر اور نیت",
              "english": "The Impact of Food and Intention"
            },
            "content": {
              "urdu": [
                "جس کھانے میں مساکین کی بددعائیں شامل ہوں وہ 'بدترین کھانا' قرار دیا گیا ہے۔",
                "نبی ﷺ نے ہمیں سکھایا کہ ہم اپنی خوشیوں میں ان لوگوں کو شریک کریں جو واقعی بھوکے اور مستحق ہیں۔",
                "نمود و نمائش کی نیت سے کیا گیا ولیمہ ثواب کے بجائے بوجھ بن جاتا ہے۔"
              ],
              "english": [
                "Food that carries the silent grievances of the neglected poor is labeled as the 'worst food'.",
                "The Prophet (ﷺ) taught us to share our joys with those who are truly hungry and deserving.",
                "A Walima performed for the sake of showing off becomes a spiritual burden rather than a reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعوت قبول کرنے کا شرعی حکم",
        "english": "Legal Obligation of Accepting an Invitation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعوتِ ولیمہ کی اہمیت",
              "english": "Significance of the Invitation"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک ولیمہ کی دعوت قبول کرنا واجب یا سنتِ مؤکدہ ہے۔",
                "بغیر کسی شرعی عذر (جیسے بیماری یا سفر) کے دعوت کو ٹھکرانا آپ ﷺ کی نافرمانی شمار ہوتا ہے۔",
                "دعوت قبول کرنے سے مسلمانوں کے درمیان باہمی محبت، اتحاد اور بھائی چارے کو فروغ ملتا ہے۔"
              ],
              "english": [
                "Accepting a Walima invitation is considered obligatory (Wajib) or a strong Sunnah by most jurists.",
                "Declining without a valid Sharia excuse (like illness or travel) is regarded as disobedience to the Prophet (ﷺ).",
                "Responding to invitations fosters mutual love, unity, and brotherhood among Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی عذر اور استثناء",
              "english": "Sharia Excuses and Exceptions"
            },
            "content": {
              "urdu": [
                "اگر دعوت والی جگہ پر شراب، موسیقی یا کوئی غیر شرعی کام ہو رہا ہو، تو وہاں جانا ضروری نہیں بلکہ بچنا بہتر ہے۔",
                "اگر کسی شخص کا روزہ ہو، تب بھی اسے چاہیے کہ وہ مجلس میں شریک ہو کر برکت کی دعا دے۔",
                "اگر ایک ہی وقت میں دو دعوتیں ہوں، تو جو پہلے بلائے یا جو زیادہ قریبی رشتہ دار ہو اسے ترجیح دی جائے۔"
              ],
              "english": [
                "If the gathering involves alcohol, prohibited music, or un-Islamic activities, attendance is not required and should be avoided.",
                "Even if a person is fasting, they should still attend to offer prayers for the couple's blessing.",
                "If two invitations occur simultaneously, priority should be given to the first one or the closer relative."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح اور اسلامی اخلاق",
        "english": "Social Reform and Islamic Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی اور تواضع",
              "english": "Simplicity and Humility"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرت کی بنیاد سادگی اور عجز پر ہے، نہ کہ فضول خرچی اور مقابلے بازی پر۔",
                "ولیمہ کا مقصد خوشی کا اعلان اور شکر گزاری ہے، نہ کہ لوگوں پر اپنی دولت کا رعب ڈالنا۔",
                "نبی ﷺ نے معمولی اشیاء سے بھی ولیمہ کر کے سادگی کا بہترین نمونہ پیش فرمایا۔"
              ],
              "english": [
                "Islamic society is based on simplicity and humility, not on extravagance and social competition.",
                "The purpose of Walima is publicizing the joy and expressing gratitude, not impressing people with wealth.",
                "The Prophet (ﷺ) set an example by performing Walima even with very simple food items."
              ]
            }
          },
          {
            "title": {
              "urdu": "محروم طبقات کی دلجوئی",
              "english": "Consoling the Underprivileged"
            },
            "content": {
              "urdu": [
                "اس حدیث کا بنیادی پیغام یہ ہے کہ معاشرے کے کمزور لوگوں کو کبھی نظر انداز نہ کیا جائے۔",
                "خوشی کے مواقع پر غریبوں کو یاد رکھنا ان کے احساسِ محرومی کو کم کرنے کا ذریعہ بنتا ہے۔",
                "اسلام ایک ایسا نظام چاہتا ہے جہاں امیر اور غریب ایک ہی دسترخوان پر بیٹھ کر بھائی چارے کا ثبوت دیں۔"
              ],
              "english": [
                "The core message of this Hadith is never to ignore the vulnerable members of society.",
                "Remembering the poor during celebrations helps reduce their sense of deprivation.",
                "Islam aims for a system where the rich and poor can sit at the same table, demonstrating true brotherhood."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میزبان کے لیے نصیحت",
              "english": "Advice for the Host"
            },
            "content": {
              "urdu": [
                "اپنی دعوتوں کی فہرست بناتے وقت مخلص دوستوں اور غریب رشتہ داروں کو ترجیح دیں۔",
                "اسراف اور دکھاوے سے بچیں تاکہ آپ کا عمل اللہ کی بارگاہ میں مقبول ہو سکے۔",
                "آپ کی نیت صرف سنت کی پیروی اور اللہ کی رضا ہونی چاہیے۔"
              ],
              "english": [
                "When drafting your guest list, prioritize sincere friends and needy relatives.",
                "Avoid waste and vanity so that your actions may be accepted by Allah.",
                "Your intention should strictly be to follow the Sunnah and seek Allah's pleasure."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہمان کے لیے نصیحت",
              "english": "Advice for the Guest"
            },
            "content": {
              "urdu": [
                "کسی کی دعوت کو حقیر نہ سمجھیں اور محبت کے ساتھ اس میں شرکت کریں۔",
                "آپ کی شرکت میزبان کی دلجوئی اور حوصلہ افزائی کا باعث بنتی ہے۔",
                "نبی ﷺ کے حکم کی پاسداری کرتے ہوئے ہر مسلمان کی خوشی میں مخلصانہ شرکت کریں۔"
              ],
              "english": [
                "Do not look down upon anyone's invitation; attend it with love and grace.",
                "Your presence provides comfort and encouragement to the host.",
                "In obedience to the Prophet's (ﷺ) command, participate sincerely in the joy of every fellow Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}