{
  "hadithId": 791,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/791"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
 
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري ( 2585 )‏.‏ وأخرجه أبو داود (3536) والترمذي (1953) وأحمد (24278).",
    "urdu": "صحیح۔ اسے امام بخاری (2585) نے روایت کیا ہے۔ اس کے علاوہ ابوداؤد، ترمذی اور احمد نے بھی اسے اپنی کتب میں درج کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2585). Also reported by Abu Dawud, At-Tirmidhi, and Ahmad."
  },
  "importantWords": [
    {
      "arabic": "يَقْبَلُ",
      "english": "Accepts",
      "urdu": "قبول فرماتے"
    },
    {
      "arabic": "الْهَدِيَّةَ",
      "english": "Gift",
      "urdu": "تحفہ / ہدیہ"
    },
    {
      "arabic": "يُثِيبُ",
      "english": "Gives a reward / recompense",
      "urdu": "بدلہ دیتے / ثواب (عنایت) دیتے"
    },
    {
      "arabic": "عَلَيْهَا",
      "english": "For it",
      "urdu": "اس پر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ کا یہ اسوہ حسنہ بیان ہوا ہے کہ آپ ﷺ تحفہ قبول کر کے دینے والے کی حوصلہ افزائی فرماتے اور بدلے میں خود بھی تحفہ دے کر باہمی محبت کو فروغ دیتے۔",
    "english": "This Hadith describes the Prophetic practice of accepting gifts to encourage the giver and reciprocating with a gift to foster mutual love and social bonds."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2585)",
      "english": "Reported by Al-Bukhari (2585)"
    },
    {
      "arabic": "سنن أبي داود (3536)",
      "english": "Sunan Abi Dawud (3536)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہدیہ قبول کرنے کی سنت",
        "english": "The Sunnah of Accepting Gifts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوش اخلاقی اور انکساری",
              "english": "Character and Humility"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا تحفہ قبول کرنا آپ کی عاجزی اور تواضع کی دلیل ہے۔",
                "تحفہ قبول کرنے سے دینے والے کے دل میں خوشی پیدا ہوتی ہے اور اسے عزت کا احساس ہوتا ہے۔",
                "اگر تحفہ معمولی بھی ہو تو اسے حقیر سمجھ کر رد نہیں کرنا چاہیے بلکہ خوشدلی سے لینا چاہیے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) acceptance of gifts is evidence of his great humility.",
                "Accepting a gift brings joy to the giver and makes them feel respected.",
                "Even if a gift is small, it should not be rejected or belittled, but accepted warmly."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ اور ہدیہ میں فرق",
              "english": "Difference between Sadaqah and Hadya"
            },
            "content": {
              "urdu": [
                "آپ ﷺ صدقہ قبول نہیں فرماتے تھے لیکن ہدیہ (تحفہ) بخوشی قبول فرماتے تھے۔",
                "ہدیہ محبت کی علامت ہے جبکہ صدقہ ضرورت مندوں کی امداد اور مال کا میل کچیل سمجھا جاتا ہے۔",
                "نبی ﷺ نے اپنی ذات کے لیے صدقہ کو حرام قرار دیا تھا تاکہ نبوت کا مقام محفوظ رہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) would not accept Sadaqah (charity) but would gladly accept a Hadya (gift).",
                "A gift is a sign of affection, whereas charity is aid for the needy and considered the 'dirt' of wealth.",
                "The Prophet (ﷺ) forbade Sadaqah for himself to preserve the dignity of the Prophetic office."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہدیہ کا بدلہ دینا (مکافات)",
        "english": "Reciprocating a Gift"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احسان کا بدلہ احسان",
              "english": "Repaying Kindness with Kindness"
            },
            "content": {
              "urdu": [
                "سنتِ نبوی یہ ہے کہ جب کوئی آپ کو تحفہ دے تو اسے بدلہ دیا جائے۔",
                "بدلہ دینے سے دینے والے پر بوجھ نہیں رہتا اور لینے والے کی برتری کا احساس ختم ہوتا ہے۔",
                "اگر بدلہ دینے کی استطاعت نہ ہو تو کم از کم زبان سے 'جزاک اللہ خیراً' کہنا چاہیے۔"
              ],
              "english": [
                "The Prophetic Sunnah is to give something in return when someone gives you a gift.",
                "Reciprocation ensures the giver doesn't feel burdened and removes any sense of superiority from the receiver.",
                "If one lacks the means to reciprocate, they should at least say 'Jazak Allahu Khairan'."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی محبت کا فروغ",
              "english": "Promoting Mutual Love"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے فرمایا: 'تحفہ دیا کرو، اس سے آپس میں محبت بڑھے گی'۔",
                "لین دین کا یہ سلسلہ معاشرتی تعلقات کو مضبوط کرتا ہے اور کینہ و حسد کو دور کرتا ہے۔",
                "ہدیہ کا تبادلہ انسانی قلوب کو ایک دوسرے کے قریب لانے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said: 'Give gifts to one another, for it will increase love between you.'",
                "This cycle of giving and receiving strengthens social ties and removes malice and jealousy.",
                "Exchanging gifts is a powerful way to bring hearts closer together."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور انتظامی ابحاث",
        "english": "Juristic and Administrative Analysis"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمرانوں اور ججز کے لیے ہدیہ",
              "english": "Gifts for Rulers and Judges"
            },
            "content": {
              "urdu": [
                "عام لوگوں کا ہدیہ سنت ہے، لیکن حکام اور ججز کے لیے ہدیہ لینا 'خیانت' اور رشوت کے زمرے میں آسکتا ہے۔",
                "نبی ﷺ نے ان لوگوں کو تنبیہ فرمائی جو سرکاری عہدوں پر ہوتے ہوئے تحائف وصول کرتے تھے۔",
                "ہدیہ اس وقت جائز ہے جب اس کے پیچھے کوئی دنیاوی غرض یا فیصلہ حاصل کرنے کی نیت نہ ہو۔"
              ],
              "english": [
                "Gifts among common people are Sunnah, but for officials and judges, they can be categorized as 'Ghulu' (misappropriation) or bribery.",
                "The Prophet (ﷺ) warned those who received gifts while holding public office.",
                "A gift is only permissible when there is no ulterior motive or intent to influence a decision."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہدیہ کی واپسی (رجوع)",
              "english": "Revoking a Gift"
            },
            "content": {
              "urdu": [
                "جب بدلہ (ثواب) دے دیا جائے تو ہدیہ دینے والا اپنا تحفہ واپس مانگنے کا حق کھو دیتا ہے۔",
                "اسلام میں دی ہوئی چیز واپس لینا کتے کی قے چاٹنے سے تشبیہ دی گئی ہے جو نہایت برا عمل ہے۔",
                "ہدیہ کا مقصد ملکیت کی مستقل منتقلی اور خیر سگالی کا اظہار ہے۔"
              ],
              "english": [
                "Once a gift is reciprocated, the original giver loses the right to request it back.",
                "In Islam, taking back a gift is compared to a dog eating its vomit, a highly condemned act.",
                "The purpose of a gift is the permanent transfer of ownership and expression of goodwill."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فیاضی کی عادت",
              "english": "The Habit of Generosity"
            },
            "content": {
              "urdu": [
                "اپنی زندگی میں 'دینے' کا مزاج پیدا کریں نہ کہ صرف 'لینے' کا۔",
                "چھوٹی چھوٹی چیزوں کا تحفہ بھی رشتوں میں مٹھاس پیدا کر دیتا ہے۔",
                "نبی ﷺ کی زندگی ہمیں ایک سخی اور متوازن انسان بننے کا درس دیتی ہے۔"
              ],
              "english": [
                "Develop a temperament of 'giving' in life rather than just 'receiving'.",
                "Even small gifts can sweeten relationships significantly.",
                "The Prophet's (ﷺ) life teaches us to be generous and balanced individuals."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسروں کی قدر دانی",
              "english": "Appreciating Others"
            },
            "content": {
              "urdu": [
                "جب کوئی آپ کے لیے کچھ کرے، تو اس کی محنت کی قدر کریں اور شکریہ ادا کریں۔",
                "ہدیہ کا بدلہ دینا اس کی محبت کا عملی اعتراف ہے۔",
                "معاشرتی ہم آہنگی کے لیے ایک دوسرے کے جذبات کا احترام کرنا ضروری ہے۔"
              ],
              "english": [
                "When someone does something for you, appreciate their effort and express gratitude.",
                "Reciprocating a gift is a practical acknowledgement of their affection.",
                "Respecting each other's feelings is essential for social harmony."
              ]
            }
          }
        ]
      }
    }
  ]
}