{
  "hadithId": 125,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["1:125"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "صحيح.  رواه البخاري (304) ، وهو بتمامه: عن أبي سعيد الخدري، قال: خرج رسول الله صلى الله عليه وسلم في أضحى أو فطر إلى المصلى، فمر على النساء فقال: \"يا معشر النساء تصدقن، فإني أريتكن أكثر أهل النار\" فقلن: وبم يا رسول الله؟ قال: \"تكثرن اللعن، وتكفرن العشير، ما رأيت من ناقصات عقل ودين وأذهب للب الرجل الحازم من إحداكن\" قلن: وما نقصان ديننا وعقلنا يا رسول الله؟ قال: \"أليس شهادة المرأة مثل نصف شهادة الرجل؟\" قلن: بلى.  قال: \"فذلك من نقصان عقلها\".  \"أليس إذا حاضت لم تصل ولم تصم\" قلن: بلى.  قال: \"فذلك من نقصان دينها\".  وأما مسلم فقد ساق سنده برقم (80)  ولم يسق لفظه، وأعاده (889)  بلفظ آخر ليس فيه محل الشاهد، ولذلك يدخل هذا الحديث في أوهام الحافظ رحمه الله. ",
    "urdu": "صحیح (درست) روایت۔ اسے بخاری (304) نے روایت کیا ہے، اور یہ پوری روایت یوں ہے: ابوسعید خدری رضی اللہ عنہ سے روایت ہے، فرمایا: رسول اللہ ﷺ عید الاضحی یا عید الفطر کے موقع پر نماز کی جگہ (مُصلّٰی) کی طرف نکلے، تو آپ کا گزر عورتوں کے پاس سے ہوا، تو آپ نے فرمایا: \"اے عورتوں کی جماعت! صدقہ کرو، کیونکہ مجھے دکھایا گیا ہے کہ تم دوزخ میں زیادہ ہو۔\" انہوں نے عرض کیا: کس وجہ سے یا رسول اللہ؟ فرمایا: \"تم لعن طعن زیادہ کرتی ہو اور خاوند کی ناشکری کرتی ہو، میں نے تمہاری نسبت عقل اور دین میں کم کسی کو نہیں دیکھا جو ایک سمجھ دار مرد کی عقل کو بھی زائل کر دے۔\" انہوں نے عرض کیا: ہمارے دین اور عقل کا نقصان کیا ہے یا رسول اللہ؟ فرمایا: \"کیا عورت کی گواہی مرد کی گواہی کے نصف کے برابر نہیں؟\" انہوں نے کہا: کیوں نہیں! فرمایا: \"یہ اس کی عقل کا نقصان ہے۔\" \"کیا جب اسے حیض آتا ہے تو وہ نماز اور روزہ چھوڑ نہیں دیتی؟\" انہوں نے کہا: کیوں نہیں! فرمایا: \"یہ اس کے دین کا نقصان ہے۔\" جبکہ مسلم نے اپنی سند رقم (80) سے ذکر کی اور الفاظ نہیں لائے، اور (889) میں دوسرے لفظ سے لائے جس میں محل شاہد نہیں ہے، اس لیے حافظ ابن حجر کی یہ روایت مسلم میں موجود ہونے کے باوجود مسلم کے اصل الفاظ میں نہیں ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (304). The full narration is: Narrated Abu Sa'id Al-Khudri: The Messenger of Allah (PBUH) went out to the Musalla (prayer area) on Eid al-Adha or Eid al-Fitr. He passed by the women and said, 'O company of women, give charity, for I saw you as the majority of the inhabitants of Hellfire.' They said, 'Why is that, O Messenger of Allah?' He said, 'You frequently curse and you are ungrateful to your husbands. I have not seen anyone more deficient in intellect and religion than you, who can even overcome the cautious, wise man.' They asked, 'What is the deficiency in our religion and intellect, O Messenger of Allah?' He said, 'Is not the testimony of a woman half the testimony of a man?' They said, 'Yes.' He said, 'That is the deficiency in her intellect.' 'Is it not the case that when she menstruates, she neither prays nor fasts?' They said, 'Yes.' He said, 'That is the deficiency in her religion.' Muslim reported the chain (80) but not the full text and repeated a similar Hadith (889) without this specific phrase."
  },
  "importantWords": [
    {
      "arabic": "حَاضَتْ",
      "english": "She menstruates",
      "urdu": "اسے حیض آئے"
    },
    {
      "arabic": "لَمْ تُصَلِّ",
      "english": "She does not pray",
      "urdu": "وہ نماز نہیں پڑھتی"
    },
    {
      "arabic": "وَلَمْ تَصُمْ",
      "english": "Nor does she fast",
      "urdu": "اور نہ روزہ رکھتی"
    },
    {
      "arabic": "نُقْصَانِ دِينِهَا",
      "english": "Deficiency in her religion",
      "urdu": "اس کے دین کا نقصان"
    },
    {
      "arabic": "يُصَلِّ",
      "english": "She prays",
      "urdu": "وہ نماز پڑھے"
    },
    {
      "arabic": "يَصُمْ",
      "english": "She fasts",
      "urdu": "وہ روزہ رکھے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ایک لمبی روایت کا حصہ ہے جس میں نبی اکرم ﷺ نے واضح فرمایا کہ حیض کی حالت میں عورت کا نماز اور روزہ چھوڑ دینا اس کے دین میں ایک شرعی نقصان ہے، جس کا مطلب یہ نہیں کہ اس پر کوئی گناہ ہے، بلکہ یہ اس وقت کی عبادات میں کمی کو ظاہر کرتا ہے جو اللہ کے حکم سے ہے۔",
    "english": "This excerpt, part of a longer Hadith, clarifies that a woman's abstention from prayer and fasting during menses constitutes a 'deficiency' in her religion from a legal standpoint. This does not imply sinfulness, but rather a temporary reduction in acts of worship due to Allah's command."
  },
  "references": [
    {
      "arabic": "رواه البخاري (304)",
      "english": "Reported by Al-Bukhari (304)"
    }
  ],
  "narrators": [
    {
      "id": 12501,
      "name": {
        "arabic": "أَبُو سَعِيدٍ اَلْخُدْرِيِّ",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیض اور عبادات میں رخصت",
        "english": "Menses and Concessions in Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز اور روزہ چھوڑنا",
              "english": "Abandoning Prayer and Fasting"
            },
            "content": {
              "urdu": [
                "حیض کی حالت میں عورت پر نماز پڑھنا اور روزہ رکھنا حرام ہے اور یہ اللہ کا حکم ہے۔",
                "نبی ﷺ کے فرمان کا مقصد یہ بتانا تھا کہ حیض کی وجہ سے عملاً کچھ عبادات میں کمی واقع ہو جاتی ہے۔",
                "عورت کو حیض کی نمازیں قضا نہیں کرنی پڑتیں، البتہ رمضان کے روزے بعد میں قضا کرنے ہوتے ہیں۔"
              ],
              "english": [
                "It is prohibited for a woman to pray or fast while menstruating, and this is a Divine command.",
                "The Prophet's statement intended to show that, practically, some acts of worship are temporarily missed due to menses.",
                "The woman is not required to make up the missed prayers, but she must make up the missed fasts of Ramadan later."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقصانِ دین کا مفہوم",
              "english": "Meaning of Deficiency in Religion"
            },
            "content": {
              "urdu": [
                "دین میں نقصان سے مراد اخلاقی یا روحانی کمی نہیں بلکہ عمل کے طور پر وقتی کمی ہے۔",
                "یہ کمی عورت کی مرضی سے نہیں بلکہ اللہ کے حکم اور طبعی عذر کی بنا پر ہے، اس لیے گناہ نہیں ہے۔",
                "عورت اس نقصان پر بھی اجر کی مستحق ہے، کیونکہ وہ اللہ کے حکم کی تعمیل میں عبادت سے رکی ہے۔"
              ],
              "english": [
                "Deficiency in religion here refers to a practical, temporary lack of performance, not a moral or spiritual flaw.",
                "This reduction is due to Allah's command and a natural excuse, not her choice, so there is no sin involved.",
                "The woman is rewarded for this deficiency because she stops worship in obedience to Allah's command."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی احکام کی حکمت",
        "english": "Wisdom of Legal Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گواہی میں فرق کی حکمت",
              "english": "Wisdom of Difference in Testimony"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے عقل میں نقصان کی دلیل عورت کی گواہی کے نصف ہونے سے دی۔",
                "یہ اس بات کی طرف اشارہ ہے کہ عورتیں جذبات اور طبیعت کی نزاکت کی وجہ سے عارضی طور پر فراموشی کا شکار ہو سکتی ہیں۔",
                "یہ حکم عورت کے حق کو نقصان نہیں پہنچاتا، بلکہ عدالتی معاملات میں احتیاط کے لیے ہے۔"
              ],
              "english": [
                "The Prophet ﷺ substantiated the deficiency in intellect by citing the woman's half-testimony.",
                "This indicates that women might be temporarily prone to forgetfulness due to emotional and natural sensitivity.",
                "This ruling does not diminish a woman's worth but is a precaution in judicial matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیض میں آسانی",
              "english": "Ease During Menses"
            },
            "content": {
              "urdu": [
                "نماز چھوڑنے کی رخصت حیض کے دوران عورت کی راحت اور آسانی کے لیے دی گئی ہے۔",
                "اللہ تعالیٰ نے عورتوں کو یہ عبادات مشقت کی حالت میں نہ کرنے کا حکم دے کر ان پر رحمت فرمائی ہے۔",
                "یہ حکم اس اصول کی تائید کرتا ہے کہ 'اللہ دین میں تم پر کوئی تنگی نہیں چاہتا'۔"
              ],
              "english": [
                "The concession to skip prayer is granted for the woman's comfort and ease during menstruation.",
                "Allah has shown mercy by commanding women not to perform these acts of worship while in this state of hardship.",
                "This ruling confirms the principle that 'Allah does not desire hardship for you in religion' (Al-Baqarah 2:185)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر اور مساوات",
        "english": "Reward and Equality"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ثواب کی مساوات",
              "english": "Equality of Reward"
            },
            "content": {
              "urdu": [
                "جو عورت حیض کی وجہ سے عبادت سے رکی رہتی ہے، اسے صحت کی حالت میں ادا کی جانے والی عبادت کا ثواب ملتا رہتا ہے۔",
                "کیونکہ یہ کمی عورت کی خواہش یا کوتاہی سے نہیں بلکہ شرعی عذر اور اللہ کے حکم سے ہے، اس لیے وہ اجرت سے محروم نہیں۔",
                "یہ اصول یہ واضح کرتا ہے کہ اخروی اجر میں مرد و عورت کے درمیان کوئی فرق نہیں ہے۔"
              ],
              "english": [
                "A woman who abstains from worship due to menses continues to receive the reward of worship performed during her healthy days.",
                "Since this cessation is due to a legal excuse and Allah's command, not her negligence, she is not deprived of reward.",
                "This principle clarifies that there is no distinction between men and women regarding eternal reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "لمبی حدیث کے اجزاء",
              "english": "Components of the Longer Hadith"
            },
            "content": {
              "urdu": [
                "یہ حصہ ایک طویل حدیث کا جزو ہے جس میں نبی ﷺ نے عورتوں کو نصیحت فرمائی تھی۔",
                "اس میں عورتوں کو صدقہ کرنے اور خاوندوں کی ناشکری سے بچنے کی خاص طور پر تلقین کی گئی ہے۔",
                "یہ تعلیمات عورتوں کی اصلاح اور ان کی آخرت کی بہتری کے لیے دی گئی تھیں۔"
              ],
              "english": [
                "This excerpt is a component of a lengthy Hadith where the Prophet ﷺ advised women.",
                "It specifically urged women to give charity and avoid ungratefulness towards their husbands.",
                "These teachings were given for the moral reform of women and their welfare in the afterlife."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اطاعت اور عمل",
        "english": "Obedience and Practice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کے حکم پر عمل",
              "english": "Acting on Allah's Command"
            },
            "content": {
              "urdu": [
                "حیض میں عبادت چھوڑنا بھی درحقیقت اللہ کے حکم کی اطاعت اور عبادت ہی ہے۔",
                "جس طرح وضو کر کے نماز پڑھنا فرض ہے، اسی طرح حیض میں نماز چھوڑنا بھی فرض ہے۔",
                "یہ حکم عورت کے لیے مشکل حالات میں بھی دین پر آسانی سے عمل پیرا ہونے کا موقع فراہم کرتا ہے۔"
              ],
              "english": [
                "Stopping worship during menses is, in reality, obedience to Allah's command and is an act of worship itself.",
                "Just as praying after Wudu is obligatory, so is abstaining from prayer during menses.",
                "This ruling provides women with the opportunity to follow the religion with ease even in difficult circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی رہنمائی",
              "english": "Collective Guidance"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک بنیادی اصول وضع کرتی ہے کہ شرعی عذر کی وجہ سے ترکِ عبادت گناہ نہیں ہے۔",
                "ہر مسلمان کو دین کے احکام کو صحیح تناظر میں سمجھنا چاہیے تاکہ غلط فہمی نہ ہو۔",
                "حیض کا مسئلہ طہارت کے اہم مسائل میں سے ہے اور اس کے احکام کو جاننا ہر مسلمان پر فرض ہے۔"
              ],
              "english": [
                "This Hadith establishes a fundamental principle: abandoning worship due to a legal excuse is not sinful.",
                "Every Muslim should understand the religious rulings in their proper context to avoid misunderstanding.",
                "The issue of menses is among the critical rulings of purity, and knowing its laws is obligatory upon every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}
