{
  "hadithId": 986,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/986"],
    "kitabId": 8,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 77
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (5139)، والترمذي (1897)، وقال: حديث حسن. وأخرجه أحمد (5/3) والنسائي في الكبرى.",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابوداؤد (5139) اور ترمذی (1897) نے روایت کیا ہے، اور امام ترمذی نے اسے حسن قرار دیا ہے۔ امام احمد اور نسائی نے بھی اسے روایت کیا ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (5139) and At-Tirmidhi (1897), and At-Tirmidhi classified it as Hasan. Also reported by Ahmad and An-Nasa'i."
  },
  "importantWords": [
    {
      "arabic": "أَبَرُّ",
      "english": "Show goodness / Bestow kindness",
      "urdu": "نیکی کروں / حسن سلوک کروں"
    },
    {
      "arabic": "أُمَّكَ",
      "english": "Your mother",
      "urdu": "تمہاری ماں"
    },
    {
      "arabic": "أَبَاكَ",
      "english": "Your father",
      "urdu": "تمہارا باپ"
    },
    {
      "arabic": "الأَقْرَبَ",
      "english": "The closest / Nearest",
      "urdu": "قریب ترین"
    },
    {
      "arabic": "حَسَّنَهُ",
      "english": "Classified it as Hasan",
      "urdu": "اسے حسن قرار دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں والدین بالخصوص والدہ کے ساتھ حسن سلوک کی اہمیت بیان کی گئی ہے اور رشتہ داروں کے حقوق کی ترتیب واضح کی گئی ہے۔",
    "english": "This Hadith emphasizes the paramount importance of kindness toward parents, especially the mother, and outlines the hierarchy of maintaining family ties."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (5139)",
      "english": "Sunan Abu Dawud (5139)"
    },
    {
      "arabic": "سنن الترمذي (1897)",
      "english": "Sunan At-Tirmidhi (1897)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاوية بن حيدة القشيري",
        "english": "Mu'awiyah bin Haidah Al-Qushayri"
      },
      "slug": "muawiyah-bin-haidah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F3zWofWq64k",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "والدہ کا بلند مقام",
        "english": "The High Status of Mother"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین گنا زیادہ حق",
              "english": "Threefold Right"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے والدہ کا ذکر تین بار فرما کر ان کے عظیم حق کو واضح کیا۔",
                "والدہ حمل، وضع حمل اور رضاعت کی تکالیف تنہا برداشت کرتی ہے۔",
                "ان خدمات کے عوض اولاد پر ان کی خدمت تین گنا زیادہ واجب ہے۔"
              ],
              "english": [
                "The Prophet ﷺ mentioned the mother three times to highlight her immense rights.",
                "A mother alone endures the hardships of pregnancy, childbirth, and breastfeeding.",
                "In return for these services, serving her is threefold more obligatory upon children."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسن سلوک کی ترجیح",
              "english": "Priority in Kindness"
            },
            "content": {
              "urdu": [
                "والدہ اپنی فطری کمزوری کی وجہ سے زیادہ توجہ اور خدمت کی مستحق ہوتی ہے۔",
                "دین اسلام میں والدین کی نافرمانی کو کبیرہ گناہ قرار دیا گیا ہے۔",
                "والدہ کی خوشنودی اللہ رب العزت کی خوشنودی کا ذریعہ بنتی ہے۔"
              ],
              "english": [
                "The mother deserves more attention and service due to her natural physical weakness.",
                "In Islam, disobedience to parents is classified as a major sin (Kabirah).",
                "The pleasure of the mother leads to the pleasure of Allah the Almighty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "والد اور دیگر رشتہ دار",
        "english": "Father and Other Relatives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "والد کا احترام و خدمت",
              "english": "Respect and Service for Father"
            },
            "content": {
              "urdu": [
                "والدہ کے بعد حسن سلوک کا سب سے پہلا حق والد کا ہے۔",
                "والد گھر کا سربراہ اور اولاد کی تربیت و کفالت کا ذمہ دار ہوتا ہے۔",
                "والد کی اطاعت (معروف میں) جنت کے دروازوں میں سے ایک ہے۔"
              ],
              "english": [
                "After the mother, the primary right of kindness belongs to the father.",
                "The father is the head of the house and responsible for upbringing and support.",
                "Obedience to the father (in good deeds) is one of the gates of Paradise."
              ]
            }
          },
          {
            "title": {
              "urdu": "صلہ رحمی کی ترتیب",
              "english": "Hierarchy of Family Ties"
            },
            "content": {
              "urdu": [
                "والدین کے بعد قریبی رشتہ داروں (بھائی، بہن وغیرہ) کا حق آتا ہے۔",
                "اسلام میں صلہ رحمی کی ترتیب 'قریب سے بعید' کی طرف رکھی گئی ہے۔",
                "اپنے قریبی رشتہ داروں کی معاشی اور اخلاقی مدد کرنا بہترین صدقہ ہے۔"
              ],
              "english": [
                "After parents comes the right of close relatives like siblings and others.",
                "The order of maintaining ties in Islam moves from nearest to furthest.",
                "Helping close relatives financially and morally is considered the best charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Social Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کی مضبوطی",
              "english": "Strength of Family System"
            },
            "content": {
              "urdu": [
                "والدین کے حقوق کی ادائیگی سے ایک مضبوط اور پرامن خاندان بنتا ہے۔",
                "جب بچے اپنے بڑوں کا احترام کرتے ہیں تو معاشرہ مستحکم ہوتا ہے۔",
                "حقوق کی یہ تقسیم خاندانی تنازعات کو ختم کرنے میں مددگار ہے۔"
              ],
              "english": [
                "Fulfilling parents' rights builds a strong and peaceful family unit.",
                "When children respect their elders, the entire society becomes stable.",
                "This distribution of rights helps in resolving many family disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "بڑھاپے کا سہارا",
              "english": "Support in Old Age"
            },
            "content": {
              "urdu": [
                "والدین کو بڑھاپے میں اولاد کی محبت اور وقت کی سب سے زیادہ ضرورت ہوتی ہے۔",
                "ان کے ساتھ نرمی سے بات کرنا اور ان کی ضروریات پوری کرنا فرض ہے۔",
                "یہ حدیث اولاد کو ان کے اخلاقی فرائض کی یاد دہانی کرواتی ہے۔"
              ],
              "english": [
                "In old age, parents need their children's love and time the most.",
                "Speaking kindly to them and fulfilling their needs is an obligation.",
                "This Hadith reminds children of their profound moral responsibilities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت",
        "english": "Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بات چیت کا انداز",
              "english": "Manner of Communication"
            },
            "content": {
              "urdu": [
                "والدین کے سامنے اپنی آواز کو پست رکھنا حسن سلوک کا حصہ ہے۔",
                "ان کی رائے کو اہمیت دینا اور ان سے مشورہ کرنا باعث برکت ہے۔",
                "قرآن و حدیث میں انہیں 'اُف' تک کہنے سے منع کیا گیا ہے۔"
              ],
              "english": [
                "Keeping one's voice low before parents is part of being kind.",
                "Valuing their opinion and consulting them brings blessings to life.",
                "Quran and Hadith prohibit even saying a word of disrespect like 'uff'."
              ]
            }
          },
          {
            "title": {
              "urdu": "اولاد کے لیے سبق",
              "english": "Lesson for the Offspring"
            },
            "content": {
              "urdu": [
                "ہر شخص کو اپنے عمل کا جائزہ لینا چاہیے کہ وہ والدین کا کتنا فرمانبردار ہے۔",
                "دنیا اور آخرت کی کامیابی والدین کی دعاوں میں پوشیدہ ہے۔",
                "نیکی کا آغاز اپنے گھر سے کرنا ہی حقیقی اسلامی تعلیم ہے۔"
              ],
              "english": [
                "Everyone should evaluate their own conduct regarding their parents.",
                "Success in this world and the hereafter lies in the prayers of parents.",
                "Starting good deeds from one's own home is the true Islamic teaching."
              ]
            }
          }
        ]
      }
    }
  ]
}