{
  "hadithId": 1267,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:6435"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "كتاب الرقاق",
    "babId": 104
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2887 و 6435).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری نے اپنی صحیح میں دو مقامات پر روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2887 and 6435)."
  },
  "importantWords": [
    {
      "arabic": "تَعِسَ",
      "english": "Wretched / Perished",
      "urdu": "برباد ہو گیا / ہلاک ہو گیا"
    },
    {
      "arabic": "عَبْدُ",
      "english": "Slave / Servant",
      "urdu": "بندہ / غلام"
    },
    {
      "arabic": "الْقَطِيفَةِ",
      "english": "Plush / Velvet garment",
      "urdu": "مخملی کپڑا / خلعت"
    },
    {
      "arabic": "رَضِيَ",
      "english": "He is pleased",
      "urdu": "وہ راضی ہو گیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان لوگوں کی مذمت کی گئی ہے جن کی زندگی کا مقصد صرف مال و دولت اور دنیاوی آسائشیں جمع کرنا ہے، یہاں تک کہ ان کی خوشی اور غصہ بھی صرف دنیا کی خاطر ہو۔",
    "english": "This Hadith condemns those whose sole purpose in life is the accumulation of wealth and worldly luxuries, to the extent that their happiness and anger depend entirely on material gains."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6435)",
      "english": "Reported by Al-Bukhari (6435)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9K8Z2o3T4Y",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مال کی غلامی کا مفہوم",
        "english": "Meaning of Slavery to Wealth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بندگیِ دنیا کی حقیقت",
              "english": "The Reality of Worldly Worship"
            },
            "content": {
              "urdu": [
                "مال کا 'بندہ' ہونے کا مطلب یہ ہے کہ انسان کا دل اللہ کے بجائے مال کی محبت میں لگ جائے۔",
                "ایسا شخص ہر کام مال حاصل کرنے کے لیے کرتا ہے اور اسی کو اپنی زندگی کا محور بنا لیتا ہے۔",
                "یہ ایک قسم کا معنوی شرک ہے جہاں انسان کا معبود اس کی خواہشات اور دولت بن جاتی ہے۔"
              ],
              "english": [
                "Being a 'slave' to wealth means one's heart is attached to money instead of Allah.",
                "Such a person performs every action for material gain, making it the pivot of their life.",
                "This is a form of spiritual polytheism where desires and wealth become the objects of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشی اور ناراضگی کا معیار",
              "english": "The Standard of Pleasure and Anger"
            },
            "content": {
              "urdu": [
                "ایمان کا تقاضا ہے کہ انسان اللہ کی رضا پر خوش ہو اور اس کی نافرمانی پر ناراض۔",
                "دنیا کا بندہ صرف اس وقت خوش ہوتا ہے جب اسے مادی فائدہ ملے، چاہے وہ حرام سے ہی کیوں نہ ہو۔",
                "اگر دنیاوی مفاد پورا نہ ہو تو وہ تقدیر کا شکوہ کرتا ہے اور اللہ سے ناراض ہو جاتا ہے۔"
              ],
              "english": [
                "Faith requires being pleased with Allah's decree and angry at His disobedience.",
                "A slave of the world is only happy when receiving material benefits, even from forbidden sources.",
                "If worldly interests are not met, they complain against destiny and become resentful toward Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دنیا پرستی کے نقصانات",
        "english": "Consequences of Materialism"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذہنی اور روحانی ہلاکت",
              "english": "Mental and Spiritual Ruin"
            },
            "content": {
              "urdu": [
                "لفظ 'تعس' (برباد ہوا) اس ہلاکت کی طرف اشارہ ہے جو دنیا پرستی کا نتیجہ ہے۔",
                "زیادہ مال کی ہوس انسان کو کبھی سکون نہیں لینے دیتی اور وہ ہمیشہ بے چین رہتا ہے۔",
                "ایسا شخص دنیا میں بھی ذلیل ہوتا ہے اور آخرت کے بڑے اجر سے بھی محروم رہ جاتا ہے۔"
              ],
              "english": [
                "The word 'Ta'isa' (wretched/perished) refers to the ruin resulting from materialism.",
                "The greed for more wealth never allows a person to find peace, leaving them perpetually restless.",
                "Such an individual faces humiliation in this world and loses the great rewards of the Hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "متوازن طرزِ زندگی",
        "english": "A Balanced Way of Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال بطور خادم، نہ کہ مخدوم",
              "english": "Wealth as a Servant, Not a Master"
            },
            "content": {
              "urdu": [
                "اسلام مال کمانے سے منع نہیں کرتا بلکہ مال کی محبت کو دل میں بسانے سے روکتا ہے۔",
                "مال کو ہاتھ میں رکھیں تاکہ وہ آپ کی خدمت کرے، اسے دل میں نہ رکھیں کہ آپ اس کے غلام بن جائیں۔",
                "بہترین مال وہ ہے جو حلال طریقے سے کمایا جائے اور اللہ کی راہ میں خرچ کیا جائے۔"
              ],
              "english": [
                "Islam does not forbid earning wealth but prohibits letting the love of wealth dominate the heart.",
                "Keep wealth in your hand so it serves you; do not keep it in your heart so you become its slave.",
                "The best wealth is that which is earned lawfully and spent in the cause of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قناعت اور شکر",
              "english": "Contentment and Gratitude"
            },
            "content": {
              "urdu": [
                "جو اللہ نے دیا ہے اس پر راضی رہنا سیکھیں، یہی حقیقی امیری ہے۔",
                "اپنی خوشیوں کو بینک بیلنس کے بجائے اللہ کے ذکر اور نیکیوں سے جوڑیں۔",
                "نعمتوں کے چھن جانے پر صبر کریں اور اللہ سے اجر کی امید رکھیں۔"
              ],
              "english": [
                "Learn to be satisfied with what Allah has provided; this is true richness.",
                "Link your happiness to the remembrance of Allah and good deeds rather than bank balances.",
                "Be patient when blessings are withheld and hope for reward from Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}