{
  "hadithId": 203,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري في كتاب الصلاة، باب أصحاب الحراب في المسجد (454) وفي العيدين (950)، ومسلم في كتاب صلاة العيدين (892).",
    "urdu": "صحیح متفق علیہ۔ اسے بخاری نے کتاب الصلاة، باب أصحاب الحراب فی المسجد (454) اور کتاب العیدین (950) میں روایت کیا ہے، اور مسلم نے کتاب صلاة العیدین (892) میں روایت کیا ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). Reported by Al-Bukhari in the Book of Prayer, Chapter: Owners of spears in the mosque (454) and in the Book of Eid Prayers (950), and by Muslim in the Book of Eid Prayers (892)."
  },
  "importantWords": [
    {
      "arabic": "يسترني",
      "english": "Shielding/Covering me",
      "urdu": "مجھے پردہ دے رہے تھے"
    },
    {
      "arabic": "أنظر",
      "english": "I was watching/looking",
      "urdu": "میں دیکھ رہی تھی"
    },
    {
      "arabic": "الحبشة",
      "english": "The Abyssinians/Ethiopians",
      "urdu": "حبشی/ایتھوپیا کے لوگ"
    },
    {
      "arabic": "يلعبون",
      "english": "They were playing/performing",
      "urdu": "وہ کھیل رہے تھے"
    },
    {
      "arabic": "المسجد",
      "english": "The Mosque",
      "urdu": "مسجد میں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسجد کے کثیر المقاصد استعمال کو واضح کرتی ہے کہ مسجد میں مباح (جائز) کھیل اور تفریحی سرگرمیاں بھی انجام دی جا سکتی ہیں، خصوصاً وہ جو دینی مقاصد یا جسمانی تربیت سے جڑی ہوں۔ نبی صلی اللہ علیہ وسلم نے صحابہ (حبشیوں) کو مسجد میں نیزوں کا کھیل کھیلنے کی اجازت دی اور خود بھی سیدہ عائشہ رضی اللہ عنہا کو پردے میں رکھ کر یہ کھیل دکھایا۔",
    "english": "This Hadith clarifies the multi-purpose use of the mosque, showing that permissible games and recreational activities, especially those linked to religious purposes or physical training, can be performed inside. The Prophet (PBUH) allowed the Companions (Abyssinians) to play with spears in the mosque and personally shielded 'Aishah (RA) while she watched the performance."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب أصحاب الحراب في المسجد (454)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: Owners of spears in the mosque (454)"
    },
    {
      "arabic": "صحيح مسلم، كتاب صلاة العيدين، باب الرخصة في اللعب الذي لا معصية فيه في أيام الأعياد (892)",
      "english": "Sahih Muslim, Book of Eid Prayers, Chapter: Permission for play that involves no sin during Eid days (892)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGvQk0X9o",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسجد اور مباح کھیل",
        "english": "The Mosque and Permissible Play"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہتھیاروں سے کھیلنے کا جواز",
              "english": "Permissibility of Playing with Weapons"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے حبشیوں کو مسجد کے صحن میں نیزوں سے کھیلنے کی اجازت دی، جو جہاد کی تیاری کا حصہ تھا۔",
                "اس سے ثابت ہوتا ہے کہ مسجد میں ہر وہ کھیل اور مشق جائز ہے جو دینی مقاصد یا جسمانی طاقت کے لیے ہو۔",
                "البتہ ایسا کھیل یا حرکت ممنوع ہے جو مسجد کی طہارت کو خراب کرے یا عبادت میں خلل ڈالے۔"
              ],
              "english": [
                "The Prophet (PBUH) allowed the Abyssinians to play with spears in the mosque courtyard, which was part of preparation for Jihad.",
                "This proves that any game or exercise is permissible in the mosque that serves religious purposes or physical strength.",
                "However, any play or movement that spoils the mosque's purity or disrupts worship is prohibited."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی کا عورتوں کا پردہ کرنا",
              "english": "The Prophet's Shielding of Women"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے سیدہ عائشہ رضی اللہ عنہا کو اپنے پیچھے چھپا کر کھیل دکھایا تاکہ ان کی پردہ داری رہے۔",
                "یہ عمل اس بات پر دلالت کرتا ہے کہ مسجد میں بھی خواتین کے لیے مناسب پردے اور حیاء کا اہتمام ضروری ہے۔",
                "اس سے تفریحی سرگرمیوں میں بھی اسلامی اخلاق اور آداب کو ملحوظ خاطر رکھنے کی تعلیم ملتی ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) shielded 'Aishah (RA) while she watched the game to maintain her privacy and modesty.",
                "This action indicates the necessity of providing proper seclusion and modesty for women, even within the mosque.",
                "It teaches us to observe Islamic ethics and manners even during recreational activities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلام میں تفریح کا مقام",
        "english": "The Role of Recreation in Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جائز تفریح کا اصول",
              "english": "Principle of Permissible Recreation"
            },
            "content": {
              "urdu": [
                "اسلام تفریح کو یکسر منع نہیں کرتا بلکہ اس کی حدود اور مقاصد کو درست کرتا ہے۔",
                "یہ کھیل چونکہ عید کے موقع پر تھے، اس لیے خوشی کا اظہار کرنا بھی شریعت کا تقاضا ہے۔",
                "ہر وہ تفریح جائز ہے جو کسی گناہ یا اخلاقی بگاڑ کا سبب نہ بنے۔"
              ],
              "english": [
                "Islam does not completely prohibit recreation but rather sets its boundaries and correct objectives.",
                "Since this game occurred during Eid, expressing joy is also a requirement of the Shari'ah.",
                "Any recreation is permissible that does not lead to sin or moral corruption."
              ]
            }
          },
          {
            "title": {
              "urdu": "عیدین کی وسعت",
              "english": "Broadness of Eid Days"
            },
            "content": {
              "urdu": [
                "عید کے دنوں میں بعض مباح کاموں میں گنجائش زیادہ ہوتی ہے جو عام دنوں میں نہ ہو۔",
                "یہ وقت مسلمانوں کے لیے خوشی اور مسرت کے اظہار کا ایک مشروع ذریعہ ہے۔",
                "لیکن یہ وسعت بھی مسجد کے عمومی تقدس کو متاثر نہیں کرنی چاہیے۔"
              ],
              "english": [
                "During Eid days, there is more allowance for certain permissible acts that might not be suitable on regular days.",
                "This time serves as a legitimate means for Muslims to express happiness and joy.",
                "However, this allowance must not compromise the general sanctity of the mosque."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی نکات",
        "english": "Juristic and Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواتین کی تعلیم و تفریح",
              "english": "Education and Recreation for Women"
            },
            "content": {
              "urdu": [
                "حضرت عائشہ کا کھیل دیکھنا اس بات کی دلیل ہے کہ خواتین بھی جائز کھیلوں اور فنون سے لطف اندوز ہو سکتی ہیں۔",
                "نبی صلی اللہ علیہ وسلم نے انہیں خود یہ موقع فراہم کیا جو تعلیم و تربیت کا بہترین طریقہ ہے۔",
                "یہ واقعہ میاں بیوی کے درمیان تفریحی تعلقات اور خوشگوار ماحول کی اہمیت کو بھی ظاہر کرتا ہے۔"
              ],
              "english": [
                "'Aishah's watching the game proves that women can also enjoy permissible games and arts.",
                "The Prophet (PBUH) personally facilitated this opportunity, which is an excellent method of education and training.",
                "This incident also shows the importance of recreational activities and a pleasant atmosphere in a marital relationship."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی تربیت کا جواز",
              "english": "Permissibility of Physical Training"
            },
            "content": {
              "urdu": [
                "مسجد کو ایسے کاموں کے لیے استعمال کیا جا سکتا ہے جو جہاد کی تیاری اور دفاعی مہارت سے متعلق ہوں۔",
                "نیزہ بازی کا کھیل جسمانی قوت اور مہارت کو بڑھاتا تھا جو اسلامی ریاست کے لیے ضروری تھا۔",
                "مسجد کو فوجی، سماجی، اور روحانی تربیت کے ایک متوازن مرکز کے طور پر دیکھنا چاہیے۔"
              ],
              "english": [
                "The mosque can be used for activities related to preparation for Jihad and defensive skills.",
                "Spear play enhanced physical strength and skills, which was essential for the Islamic state.",
                "The mosque should be viewed as a balanced center for military, social, and spiritual training."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں پیغام",
        "english": "Message for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توازن کی اہمیت",
              "english": "Importance of Balance"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں زندگی کے تمام پہلوؤں میں دین اور دنیا کے درمیان توازن سکھاتی ہے۔",
                "دینی اداروں میں روحانیت کے ساتھ ساتھ صحت مند تفریح اور فلاحی کاموں کی بھی گنجائش ہونی چاہیے۔",
                "مسجد کے منتظمین کو چاہیے کہ وہ مسجد کے ماحول کو جامع اور پرکشش بنائیں۔"
              ],
              "english": [
                "This Hadith teaches us to maintain a balance between the spiritual and worldly aspects of life.",
                "Religious institutions should accommodate healthy recreation and welfare work alongside spirituality.",
                "Mosque administrators should strive to make the mosque environment comprehensive and appealing."
              ]
            }
          },
          {
            "title": {
              "urdu": "نرمی اور شفقت",
              "english": "Gentleness and Compassion"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کا سیدہ عائشہ کے لیے پردہ بننا ان کی بے پناہ شفقت کو ظاہر کرتا ہے۔",
                "یہ واقعہ ازدواجی زندگی میں باہمی محبت اور خوشی کو مقدم رکھنے کا درس دیتا ہے۔",
                "اگر نیت پاکیزہ ہو تو معمولی تفریح بھی عبادت کے ماحول میں نقصان دہ نہیں ہوتی۔"
              ],
              "english": [
                "The Prophet's act of shielding 'Aishah demonstrates his immense compassion and kindness.",
                "This incident teaches us to prioritize mutual love and happiness in married life.",
                "If the intention is pure, minor recreation is not detrimental in the environment of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
