{
  "hadithId": 1136,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/12/2"],
    "kitabId": 12,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأطعمة",
    "babId": 92
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (4219)، ومسلم (1941). والنهي هنا للتحريم القطعي.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (4219) اور امام مسلم (1941) نے اپنی صحیح میں روایت کیا ہے۔ یہ واقعہ فتح خیبر کے موقع پر پیش آیا۔",
    "english": "Sahih. Reported by al-Bukhari (4219) and Muslim (1941). The prohibition mentioned here is for absolute unlawfulness (Haram)."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "الْحُمُرِ اَلْأَهْلِيَّةِ",
      "english": "Domestic donkeys",
      "urdu": "گھریلو گدھے"
    },
    {
      "arabic": "لُحُومِ اَلْخَيْلِ",
      "english": "Horse flesh",
      "urdu": "گھوڑوں کا گوشت"
    },
    {
      "arabic": "رَخَّصَ",
      "english": "Licensed / Permitted",
      "urdu": "رخصت دی / رعایت دی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں دو اہم شرعی احکام بیان ہوئے ہیں: پہلا یہ کہ گھریلو گدھا حرام ہے، اور دوسرا یہ کہ گھوڑے کا گوشت کھانا جائز ہے۔",
    "english": "This Hadith clarifies two major dietary laws: the meat of domestic donkeys is forbidden (Haram), while the meat of horses is permissible (Halal)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (4219)",
      "english": "Sahih al-Bukhari (4219)"
    },
    {
      "arabic": "صحيح مسلم (1941)",
      "english": "Sahih Muslim (1941)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "گھریلو گدھے کی حرمت",
        "english": "Prohibition of Domestic Donkeys"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرمت کی وجہ",
              "english": "Reason for Prohibition"
            },
            "content": {
              "urdu": [
                "خیبر کے موقع پر صحابہ نے بھوک کی وجہ سے گدھے ذبح کیے تھے، جس پر آپ ﷺ نے ہنڈیا الٹنے کا حکم دیا۔",
                "نبی ﷺ نے گھریلو گدھے کو 'رجس' یعنی ناپاک قرار دیا۔",
                "یہ ممانعت ابدی ہے اور تمام ائمہ فقہ کے نزدیک گھریلو گدھا حرام ہے۔"
              ],
              "english": [
                "During Khaibar, some companions slaughtered donkeys due to hunger, but the Prophet (ﷺ) ordered the pots to be overturned.",
                "The Prophet (ﷺ) described domestic donkeys as 'Rijs' (impure).",
                "This prohibition is eternal, and domestic donkeys are considered Haram by all major schools of Fiqh."
              ]
            }
          },
          {
            "title": {
              "urdu": "گھریلو اور جنگلی گدھے میں فرق",
              "english": "Domestic vs. Wild Donkeys"
            },
            "content": {
              "urdu": [
                "حرمت صرف گھریلو (پالتو) گدھے کے لیے ہے جو بوجھ ڈھونے کے کام آتا ہے۔",
                "جنگلی گدھا (گور خر) حلال ہے اور اس کا گوشت کھانا جائز ہے۔",
                "شریعت نے پالتو جانوروں کی صفائی اور ان کی غذا کے اثرات کی بنا پر یہ فرق رکھا ہے۔"
              ],
              "english": [
                "The prohibition only applies to domestic donkeys used for carrying loads.",
                "Wild donkeys (onagers/zebras) are Halal and permissible to eat.",
                "Shariah maintains this distinction based on the animal's habits and dietary effects."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گھوڑے کے گوشت کا حکم",
        "english": "Ruling on Horse Meat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جواز کی دلیل",
              "english": "Evidence for Permissibility"
            },
            "content": {
              "urdu": [
                "اس حدیث سے صراحت کے ساتھ گھوڑے کے گوشت کا حلال ہونا ثابت ہوتا ہے۔",
                "امام شافعی، امام احمد اور صاحبین (امام ابویوسف و محمد) کے نزدیک یہ حلال ہے۔",
                "نبی ﷺ نے خود اس کی اجازت دی، جو اس کی اباحت کی قطعی دلیل ہے۔"
              ],
              "english": [
                "This Hadith explicitly proves the permissibility of horse meat.",
                "It is considered Halal by Imam Shafi'i, Imam Ahmad, and the senior students of Imam Abu Hanifa.",
                "The Prophet (ﷺ) personally granted permission, which is definitive proof of its lawfulness."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف کی وضاحت",
              "english": "Clarifying Juristic Differences"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ کے نزدیک گھوڑے کا گوشت کھانا 'مکروہ تنزیہی' ہے کیونکہ یہ جنگی ضرورت کا جانور ہے۔",
                "متاخرین احناف نے بھی احادیث کی روشنی میں اس کے جواز یا کراہتِ خفیفہ کا فتویٰ دیا ہے۔",
                "کراہت کی بنیاد جانور کی توہین نہیں بلکہ اس کی عسکری اہمیت کا تحفظ تھا۔"
              ],
              "english": [
                "Imam Abu Hanifa considered horse meat 'Makruh Tanzihi' (disliked but not sinful) because it was vital for military use.",
                "Later Hanafi scholars issued fatwas on its permissibility in light of authentic traditions.",
                "The rationale for dislike was the preservation of military assets, not the impurity of the animal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور اخلاقی پہلو",
        "english": "Medical and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طیب اور خبیث کا تصور",
              "english": "Concept of Pure and Impure"
            },
            "content": {
              "urdu": [
                "اسلام صرف وہی چیزیں حلال کرتا ہے جو 'طیب' (پاکیزہ اور مفید) ہوں۔",
                "گدھے کے گوشت میں موجود جراثیم یا اس کی فطرت انسانی اخلاق پر اثر انداز ہو سکتی ہے۔",
                "شریعت کے احکامات انسانی صحت اور روحانیت کی حفاظت کے ضامن ہیں۔"
              ],
              "english": [
                "Islam only permits things that are 'Tayyib' (pure and beneficial).",
                "The nature or pathogens in donkey meat can negatively affect human health or character.",
                "Shariah rulings ensure the protection of both human physical health and spiritual well-being."
              ]
            }
          },
          {
            "title": {
              "urdu": "جانوروں کی افادیت کا لحاظ",
              "english": "Considering Animal Utility"
            },
            "content": {
              "urdu": [
                "گھوڑا ایک معزز اور وفادار جانور ہے جسے اللہ نے زینت اور سواری کے لیے پیدا کیا۔",
                "گدھا انسانی خدمت اور باربرداری کے لیے ایک اہم ذریعہ ہے۔",
                "ان احکامات سے معاشرے میں معاشی اور دفاعی توازن برقرار رہتا ہے۔"
              ],
              "english": [
                "The horse is a noble and loyal animal created by Allah for ornament and riding.",
                "The donkey is an essential means for human service and transportation.",
                "These rulings help maintain economic and defensive balance within the community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال و حرام کی تمیز",
              "english": "Distinguishing Halal and Haram"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی غذا کے معاملے میں انتہائی محتاط رہنا چاہیے اور صرف حلال پر اکتفا کرنا چاہیے۔",
                "سنتِ نبوی ﷺ ہی ہمیں زندگی کے ہر شعبے میں صحیح راستہ دکھاتی ہے۔",
                "مشکوک چیزوں سے بچنا ایمان کی سلامتی کے لیے ضروری ہے۔"
              ],
              "english": [
                "A Muslim must be extremely cautious regarding their diet and stick strictly to Halal.",
                "The Sunnah of the Prophet (ﷺ) shows us the correct path in every aspect of life.",
                "Avoiding doubtful matters is essential for the safety of one's faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "اطاعتِ رسول ﷺ",
              "english": "Obedience to the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "صحابہ نے بھوک کے باوجود آپ ﷺ کے حکم پر پکی ہوئی ہنڈیاں الٹ دیں، یہ کامل اطاعت ہے۔",
                "جب اللہ اور اس کا رسول کسی بات کا فیصلہ کر دیں تو مومن کو اعتراض کا حق نہیں رہتا۔",
                "دین کی بنیاد عقل پر نہیں بلکہ وحی اور اتباعِ رسول پر ہے۔"
              ],
              "english": [
                "The Sahaba overturned cooked pots upon the Prophet's (ﷺ) command despite their hunger; this is perfect obedience.",
                "When Allah and His Messenger decide a matter, a believer has no room for objection.",
                "Religion is based on revelation and following the Prophet (ﷺ), not mere human intellect."
              ]
            }
          }
        ]
      }
    }
  ]
}