{
  "hadithId": 551,
  "hadithNo": 25,
  "hadithReferences": {
    "sunnah.com": ["bulugh/551"],
    "kitabId": 5,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 33
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1952) ومسلم (1147). وهو محمول عند بعض العلماء على صوم النذر.",
    "urdu": "صحیح۔ اسے بخاری (1952) اور مسلم (1147) نے روایت کیا ہے۔ بعض اہل علم کے نزدیک اس سے مراد نذر (مانے ہوئے) کے روزے ہیں۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1952) and Muslim (1147). Some scholars interpret this specifically as fasting for a vow (Nadhr)."
  },
  "importantWords": [
    {
      "arabic": "مَاتَ",
      "english": "Died",
      "urdu": "فوت ہو گیا"
    },
    {
      "arabic": "عَلَيْهِ",
      "english": "Upon him / Due",
      "urdu": "اس کے ذمے"
    },
    {
      "arabic": "صِيَامٌ",
      "english": "Fasting",
      "urdu": "روزہ"
    },
    {
      "arabic": "وَلِيُّهُ",
      "english": "His heir / Guardian",
      "urdu": "اس کا وارث / ولی"
    },
    {
      "arabic": "صَامَ",
      "english": "He fasted",
      "urdu": "اس نے روزہ رکھا"
    }
  ],
  "summary": {
    "urdu": "اگر کوئی شخص ذمے واجب روزے چھوڑ کر فوت ہو جائے، تو اس کے ورثاء اس کی طرف سے روزے رکھ سکتے ہیں تاکہ اس کا ذمہ فارغ ہو جائے۔",
    "english": "If a person dies with obligatory fasts due upon them, their heirs may fast on their behalf to fulfill their religious debt."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1952)",
      "english": "Reported by Al-Bukhari (1952)"
    },
    {
      "arabic": "رواه مسلم (1147)",
      "english": "Reported by Muslim (1147)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=OpxK5W8L7j0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فوت شدہ کی طرف سے روزہ",
        "english": "Fasting for the Deceased"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولی کی ذمہ داری",
              "english": "Responsibility of the Heir"
            },
            "content": {
              "urdu": [
                "حدیث میں 'ولی' سے مراد میت کا قریب ترین رشتہ دار یا وارث ہے۔",
                "اگر میت پر روزے واجب تھے تو وارث کا روزہ رکھنا میت کے لیے نفع بخش ہے۔",
                "یہ عمل میت کے ساتھ حسن سلوک اور وفاداری کی ایک صورت ہے۔"
              ],
              "english": [
                "The 'Wali' in the Hadith refers to the closest relative or heir of the deceased.",
                "If fasts were due upon the deceased, the heir's fasting benefits them.",
                "This act is a form of kindness and loyalty towards the deceased loved one."
              ]
            }
          },
          {
            "title": {
              "urdu": "روزوں کی نوعیت",
              "english": "Nature of the Fasts"
            },
            "content": {
              "urdu": [
                "اکثر اہل علم کے نزدیک اس سے مراد نذر (منت) کے روزے ہیں۔",
                "رمضان کے قضا روزوں کے بارے میں بعض فقہاء فدیہ (کھانا کھلانے) کو ترجیح دیتے ہیں۔",
                "تاہم حدیث کا عموم تمام واجب روزوں کو شامل کرنے کی گنجائش رکھتا ہے۔"
              ],
              "english": [
                "Most scholars apply this specifically to fasts due to a vow (Nadhr).",
                "Regarding missed Ramadan fasts, some jurists prefer giving Fidyah (feeding the poor).",
                "However, the general wording of the Hadith can encompass all obligatory fasts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات اور آراء",
        "english": "Juristic Differences and Opinions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احناف اور مالکیہ کا موقف",
              "english": "Position of Hanafis and Malikis"
            },
            "content": {
              "urdu": [
                "ان کے نزدیک کوئی شخص دوسرے کی طرف سے روزہ نہیں رکھ سکتا۔",
                "وہ اس حدیث کی تاویل کرتے ہیں کہ ولی میت کی طرف سے کھانا کھلائے (فدیہ دے)۔",
                "ان کی دلیل یہ ہے کہ بدنی عبادت میں نیابت (بدل) اصل نہیں ہے۔"
              ],
              "english": [
                "According to them, one person cannot fast on behalf of another person.",
                "They interpret the Hadith to mean the heir should feed the poor (Fidyah) on their behalf.",
                "Their logic is that physical worship generally does not allow for proxy performance."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہل حدیث اور شافعیہ کا موقف",
              "english": "Position of Ahl al-Hadith and Shafi'is"
            },
            "content": {
              "urdu": [
                "وہ حدیث کے ظاہری الفاظ پر عمل کرتے ہوئے ولی کے روزہ رکھنے کو جائز مانتے ہیں۔",
                "اگر ولی خود روزہ نہ رکھ سکے تو وہ کسی اور سے بھی رکھوا سکتا ہے۔",
                "یہ موقف حدیث کے واضح الفاظ کے زیادہ قریب معلوم ہوتا ہے۔"
              ],
              "english": [
                "They follow the literal wording and permit the heir to fast for the deceased.",
                "If the heir cannot fast personally, they can authorize someone else to do so.",
                "This position aligns more closely with the explicit text of the Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فدیہ یا روزہ: ترجیح",
        "english": "Fidyah vs. Fasting: Preference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فدیہ دینے کی صورت",
              "english": "Scenario for Fidyah"
            },
            "content": {
              "urdu": [
                "اگر میت نے وصیت کی ہو تو مال سے فدیہ دینا واجب ہو جاتا ہے۔",
                "فی روزہ ایک مسکین کو دو وقت کا کھانا کھلانا فدیہ کہلاتا ہے۔",
                "ایسے مریض کے لیے جو تندرست ہونے سے پہلے فوت ہو گیا، اس پر کچھ لازم نہیں ہوتا۔"
              ],
              "english": [
                "If the deceased left a will, giving Fidyah from the estate becomes obligatory.",
                "Fidyah consists of feeding a poor person two meals for every missed day.",
                "A sick person who died before recovering owes no makeup or Fidyah for missed days."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی روزے",
              "english": "Collective Fasting"
            },
            "content": {
              "urdu": [
                "اگر میت پر زیادہ روزے ہوں تو کئی وارث مل کر ایک ہی دن میں وہ تعداد پوری کر سکتے ہیں۔",
                "یہ طریقہ کار ذمہ داری کو جلدی ختم کرنے میں مددگار ہوتا ہے۔",
                "شریعت نے اس معاملے میں وسعت اور آسانی رکھی ہے۔"
              ],
              "english": [
                "If many fasts are due, multiple heirs can fast on the same day to complete the count.",
                "This method helps in fulfilling the deceased's obligation more quickly.",
                "Shariah provides flexibility and ease in this regard for the family."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فرائض کی جلد ادائیگی",
              "english": "Prompt Fulfillment of Obligations"
            },
            "content": {
              "urdu": [
                "انسان کو چاہیے کہ زندگی میں ہی اپنے واجبات اور روزے پورے کر لے۔",
                "موت کا وقت معلوم نہیں، اس لیے نیکی کے کاموں میں تاخیر نہیں کرنی چاہیے۔",
                "اپنے ذمے واجب روزوں کا ریکارڈ رکھنا ایک اچھی عادت ہے۔"
              ],
              "english": [
                "One should strive to complete their obligatory fasts during their lifetime.",
                "The time of death is unknown, so one must not delay righteous deeds.",
                "Keeping a record of missed obligatory fasts is a beneficial habit."
              ]
            }
          },
          {
            "title": {
              "urdu": "والدین کے ساتھ بھلائی",
              "english": "Goodness Towards Parents"
            },
            "content": {
              "urdu": [
                "والدین کی طرف سے روزے رکھنا ان کے ساتھ نیکی (برّ) کی بہترین مثال ہے۔",
                "اولاد کے نیک اعمال کا ثواب فوت شدہ والدین کو پہنچتا ہے۔",
                "یہ حدیث خاندانی ہمدردی اور روحانی تعلق کو مضبوط کرتی ہے۔"
              ],
              "english": [
                "Fasting on behalf of parents is a supreme example of filial piety (Birr).",
                "The righteous deeds of children provide rewards to their deceased parents.",
                "This Hadith strengthens family bonds and spiritual connections beyond death."
              ]
            }
          }
        ]
      }
    }
  ]
}