{
  "hadithId": 1319,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bukhari:24", "muslim:36"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "كتاب الإيمان",
    "babId": 106
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (24)‏، ومسلم (36)‏، والترمذي (2615)، والنسائي (5004)، وأبو داود (4795)، وابن ماجه (58).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری اور امام مسلم دونوں نے روایت کیا ہے۔ یہ ایک مشہور حدیث ہے جو ایمان کی شاخوں سے متعلق ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (24) and Muslim (36). It is also reported by At-Tirmidhi, An-Nasa'i, Abu Dawud, and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "الْحَيَاءُ",
      "english": "Modesty / Shyness",
      "urdu": "حیا / شرم"
    },
    {
      "arabic": "الإِيمَانِ",
      "english": "Faith",
      "urdu": "ایمان"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ حیا محض ایک اخلاقی صفت نہیں بلکہ ایمان کی ایک لازمی شاخ ہے جو انسان کو برائیوں سے روکتی ہے اور نیکیوں پر ابھارتی ہے۔",
    "english": "This Hadith highlights that modesty is not just a moral trait but an essential branch of faith that restrains a person from evil and encourages righteousness."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (24)",
      "english": "Sahih al-Bukhari (24)"
    },
    {
      "arabic": "صحيح مسلم (36)",
      "english": "Sahih Muslim (36)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah ibn Umar ibn al-Khattab"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیا اور ایمان کا گہرا تعلق",
        "english": "The Deep Connection Between Modesty and Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کی شاخ",
              "english": "A Branch of Faith"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ایمان کی ساٹھ یا ستر سے زائد شاخیں بتائی ہیں جن میں حیا ایک اہم شاخ ہے۔",
                "جب ایمان دل میں گھر کرتا ہے تو حیا خود بخود انسان کے اخلاق کا حصہ بن جاتی ہے۔",
                "اگر انسان سے حیا چھن جائے تو اس کا ایمان بھی خطرے میں پڑ جاتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) mentioned that faith has over sixty or seventy branches, and modesty is a key one.",
                "When faith takes root in the heart, modesty naturally becomes part of one's character.",
                "If a person loses modesty, their faith also becomes vulnerable."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا کا اخلاقی کردار",
              "english": "The Moral Role of Modesty"
            },
            "content": {
              "urdu": [
                "حیا انسان کو ان کاموں سے روکتی ہے جو اللہ کی نظر میں ناپسندیدہ ہیں۔",
                "یہ وہ داخلی ڈھال ہے جو انسان کو گناہوں کی طرف مائل ہونے سے بچاتی ہے۔",
                "جس شخص میں حیا نہیں ہوتی وہ بلا جھجھک ہر قسم کی برائی کا ارتکاب کر سکتا ہے۔"
              ],
              "english": [
                "Modesty prevents a person from doing things that are displeasing to Allah.",
                "It is an internal shield that protects an individual from falling into sin.",
                "A person without modesty can commit any evil without hesitation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حیا کی اقسام",
        "english": "Types of Modesty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ سے حیا",
              "english": "Modesty Before Allah"
            },
            "content": {
              "urdu": [
                "حقیقی حیا یہ ہے کہ انسان تنہائی میں بھی اللہ سے شرم کرے اور گناہ نہ کرے۔",
                "اس کا مطلب اپنے حواس، خیالات اور پیٹ کی حفاظت کرنا ہے۔",
                "اللہ کو ہر وقت حاضر و ناظر جاننا حیا کا سب سے بلند درجہ ہے۔"
              ],
              "english": [
                "True modesty means feeling shy before Allah even in solitude and avoiding sin.",
                "It involves guarding one's senses, thoughts, and what one consumes.",
                "Recognizing Allah as ever-present is the highest level of modesty."
              ]
            }
          },
          {
            "title": {
              "urdu": "مخلوق سے حیا",
              "english": "Modesty Before People"
            },
            "content": {
              "urdu": [
                "لوگوں کے سامنے برے اخلاق اور بے شرمی سے بچنا بھی حیا کا حصہ ہے۔",
                "یہ معاشرے میں نظم و ضبط اور پاکیزگی قائم رکھنے میں مدد دیتی ہے۔",
                "نبی ﷺ اپنی حیا میں پردہ نشین کنواری لڑکی سے بھی زیادہ شرم والے تھے۔"
              ],
              "english": [
                "Avoiding bad character and indecency in front of people is also part of modesty.",
                "It helps maintain discipline and purity within society.",
                "The Prophet (ﷺ) was more modest than a virgin girl in her seclusion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حیا کے ثمرات",
        "english": "Fruits of Modesty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیر ہی خیر",
              "english": "Only Goodness"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا: 'حیا خیر ہی لاتی ہے'۔",
                "حیا دار انسان دوسروں کی عزت کرتا ہے اور خود بھی عزت پاتا ہے۔",
                "یہ صفت انسان کو وقار، سنجیدگی اور پاک دامنی عطا کرتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said: 'Modesty brings nothing but good.'",
                "A modest person respects others and is respected in return.",
                "This trait grants an individual dignity, seriousness, and chastity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیا کی آبیاری",
              "english": "Cultivating Modesty"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے لباس، گفتگو اور نظروں میں حیا کو ملحوظ رکھنا چاہیے۔",
                "بے حیائی پھیلانے والے ذرائع اور صحبت سے بچنا ضروری ہے۔",
                "اپنے بچوں میں بچپن سے ہی شرم و حیا کی اقدار پیدا کرنی چاہئیں۔"
              ],
              "english": [
                "We must maintain modesty in our dress, speech, and gaze.",
                "It is essential to avoid sources and company that spread indecency.",
                "We should instill values of modesty and shyness in our children from a young age."
              ]
            }
          }
        ]
      }
    }
  ]
}