{
  "hadithId": 619,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/619"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1659)، ومسلم (1285). زاد مسلم في رواية: 'أن محمداً بن أبي بكر الثقفي سأل أنساً وهما غاديان من منى إلى عرفة'.",
    "urdu": "صحیح۔ اسے بخاری (1659) اور مسلم (1285) نے روایت کیا ہے۔ یہ واقعہ عرفات کی طرف جاتے ہوئے پیش آیا جب صحابہ اپنی پسند کے ذکر میں مشغول تھے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1659) and Muslim (1285). Muslim's version adds that Muhammad bin Abi Bakr asked Anas about this while they were going from Mina to Arafat."
  },
  "importantWords": [
    {
      "arabic": "يُهِلُّ",
      "english": "Reciting Talbiyah / Raising voice",
      "urdu": "لبیک پکارنا"
    },
    {
      "arabic": "يُكَبِّرُ",
      "english": "Saying Allahu Akbar",
      "urdu": "تکبیر کہنا"
    },
    {
      "arabic": "لَا يُنْكِرُ",
      "english": "No objection / No disapproval",
      "urdu": "اعتراض نہیں کیا جاتا / برا نہیں مانا جاتا"
    },
    {
      "arabic": "اَلْمُهِلُّ",
      "english": "The one reciting Labbayk",
      "urdu": "تلبیہ کہنے والا"
    }
  ],
  "summary": {
    "urdu": "حج کے سفر میں تلبیہ کے ساتھ ساتھ اللہ کی تکبیر و تہلیل کرنا بھی جائز ہے اور اس میں وسعت موجود ہے، صحابہ اپنی اپنی طبیعت کے مطابق ذکر کرتے تھے۔",
    "english": "During the Hajj journey, it is permissible to recite both the Talbiyah and Takbir. There is flexibility in Dhikr, as the Companions chose what suited them."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1659)",
      "english": "Reported by Al-Bukhari (1659)"
    },
    {
      "arabic": "رواه مسلم (1285)",
      "english": "Reported by Muslim (1285)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ذکر و اذکار میں تنوع اور وسعت",
        "english": "Diversity and Flexibility in Dhikr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تلبیہ اور تکبیر کا اکٹھا ہونا",
              "english": "Combining Talbiyah and Takbir"
            },
            "content": {
              "urdu": [
                "حج کا اصل شعار تلبیہ (لبیک) ہے، لیکن اس کے ساتھ تکبیر (اللہ اکبر) کہنا بھی سنت سے ثابت ہے۔",
                "صحابہ کرام عرفات جاتے ہوئے مختلف اذکار کرتے تھے اور نبی ﷺ نے کسی کو منع نہیں فرمایا۔",
                "یہ اس بات کی دلیل ہے کہ نیکی کے مختلف راستے ایک ہی مقصد یعنی اللہ کی یاد کی طرف جاتے ہیں۔"
              ],
              "english": [
                "The primary slogan of Hajj is Talbiyah, but reciting Takbir alongside it is also proven by Sunnah.",
                "While heading to Arafat, the Companions performed various forms of Dhikr, and the Prophet (ﷺ) did not stop any of them.",
                "This proves that different paths of goodness lead to the same goal: the remembrance of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی خاموشی (تقریر)",
              "english": "The Prophet's (ﷺ) Tacit Approval"
            },
            "content": {
              "urdu": [
                "کسی عمل پر نبی ﷺ کی خاموشی اس کے جائز ہونے کی سب سے بڑی دلیل ہوتی ہے۔",
                "آپ ﷺ نے صحابہ کو اپنی پسند کے مطابق اللہ کا نام لینے کی آزادی دے رکھی تھی۔",
                "دین میں جہاں وسعت دی گئی ہو وہاں اپنی طرف سے سختی پیدا کرنا درست نہیں ہے۔"
              ],
              "english": [
                "The silence of the Prophet (ﷺ) regarding an act is a strong evidence of its permissibility (Taqrir).",
                "He allowed the Companions the freedom to remember Allah in ways that resonated with them.",
                "Where religion has provided ease, creating unnecessary rigidity is incorrect."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عرفات کی طرف روانگی کے آداب",
        "english": "Etiquettes of Heading to Arafat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منیٰ سے عرفات کا سفر",
              "english": "Journey from Mina to Arafat"
            },
            "content": {
              "urdu": [
                "9 ذوالحجہ کا دن حج کا سب سے اہم دن ہے، جس کا آغاز اللہ کے ذکر سے ہونا چاہیے۔",
                "صحابہ کا یہ طرزِ عمل ظاہر کرتا ہے کہ سفر کے دوران غفلت کے بجائے زبانیں تر ہونی چاہئیں۔",
                "تکبیر اور تلبیہ دونوں ہی اللہ کی بڑائی اور بندگی کے اعتراف پر مشتمل ہیں۔"
              ],
              "english": [
                "The 9th of Dhul-Hijjah is the most important day of Hajj, which should begin with Allah's remembrance.",
                "The practice of the Companions shows that during travel, one should remain focused on Dhikr rather than negligence.",
                "Both Takbir and Talbiyah embody the glorification of Allah and the admission of servitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذکر کی آواز بلند کرنا",
              "english": "Raising the Voice in Dhikr"
            },
            "content": {
              "urdu": [
                "حج کے دوران مردوں کے لیے تلبیہ اور تکبیر بلند آواز سے پکارنا مسنون ہے۔",
                "اس سے حج کے ماحول میں ایک روحانی جوش اور ایمانی کیفیت پیدا ہوتی ہے۔",
                "نبی ﷺ نے فرمایا کہ جبرائیل (ع) نے آکر مجھے تلبیہ میں آواز بلند کرنے کا حکم دیا۔"
              ],
              "english": [
                "During Hajj, it is Sunnah for men to raise their voices while reciting Talbiyah and Takbir.",
                "This creates a spiritual fervor and an atmosphere of faith throughout the pilgrimage.",
                "The Prophet (ﷺ) said that Gabriel (AS) came and commanded him to raise the voice in Talbiyah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فرد اور گروہ کے درمیان توازن",
        "english": "Balance between Individual and Group"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انفرادی عمل کا احترام",
              "english": "Respecting Individual Action"
            },
            "content": {
              "urdu": [
                "حدیث سے معلوم ہوتا ہے کہ ضروری نہیں کہ پورا قافلہ ایک ہی لفظ پکارے۔",
                "اگر ایک گروہ ایک ذکر کر رہا ہے اور دوسرا دوسرا، تو اس میں کوئی شرعی تضاد نہیں ہے۔",
                "اسلام میں انفرادی ذوق اور عبادتی کیفیت کا مکمل احترام کیا گیا ہے۔"
              ],
              "english": [
                "The Hadith shows that it is not necessary for the entire caravan to chant the exact same words in unison.",
                "If one group performs one type of Dhikr and another chooses another, there is no religious conflict.",
                "Islam fully respects individual spiritual inclinations and states of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی رواداری",
              "english": "Mutual Tolerance"
            },
            "content": {
              "urdu": [
                "صحابہ ایک دوسرے پر اعتراض نہیں کرتے تھے (لا ينكر علیہ) جو کہ کمالِ اخلاق ہے۔",
                "فروعی مسائل یا اذکار کے طریقوں پر آپس میں لڑنا یا تنقید کرنا سنت کے خلاف ہے۔",
                "اصل مقصد اللہ کی رضا ہے، چاہے وہ کسی بھی مسنون کلمے کے ذریعے حاصل ہو۔"
              ],
              "english": [
                "The Companions did not object to each other (la yunkaru 'alayhi), which is a sign of superior character.",
                "Fighting or criticizing one another over secondary matters or methods of Dhikr is against the Sunnah.",
                "The ultimate goal is Allah's pleasure, attained through any of the prescribed words."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی قدر",
              "english": "Valuing Time"
            },
            "content": {
              "urdu": [
                "سفر کے فارغ لمحات کو لایعنی گفتگو کے بجائے اللہ کی یاد میں گزارنا چاہیے۔",
                "مومن کا ہر لمحہ قیمتی ہے، خاص طور پر حج جیسے عظیم الشان موقع پر۔",
                "ذکرِ الہی دلوں کو سکون اور ارادوں کو مضبوطی عطا کرتا ہے۔"
              ],
              "english": [
                "Spare moments during travel should be spent in Allah's remembrance rather than idle talk.",
                "Every moment of a believer is precious, especially during momentous occasions like Hajj.",
                "The remembrance of Allah brings peace to hearts and strength to intentions."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی وسعت کو سمجھنا",
              "english": "Understanding the Breadth of Sunnah"
            },
            "content": {
              "urdu": [
                "سنت میں موجود تنوع کو اللہ کی رحمت سمجھنا چاہیے نہ کہ اختلاف کا ذریعہ۔",
                "نبی ﷺ کے صحابہ سے ہمیں دین کی صحیح تشریح اور اس کا اعتدال ملتا ہے۔",
                "ہمیں دوسروں کے نیک اعمال کی حوصلہ افزائی کرنی چاہیے نہ کہ ان میں کیڑے نکالنے چاہئیں۔"
              ],
              "english": [
                "The diversity within the Sunnah should be seen as Allah's mercy, not a cause for division.",
                "From the Prophet's (ﷺ) Companions, we derive the correct and balanced interpretation of religion.",
                "We should encourage others' good deeds rather than looking for flaws in them."
              ]
            }
          }
        ]
      }
    }
  ]
}