{
  "hadithId": 181,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["1:5:2"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
  
  "takhreej": {
    "arabic": " صحيح .‏ رواه مسلم (500)‏ ، ووقع في \"الأصل\" : \"ستر\" بدل : \"سترة\" .‏ و \"مؤخرة الرحل\" : هي الخشبة التي يستند إليها الراكب .‏",
    "urdu": "صحیح۔ اسے مسلم (500) نے روایت کیا ہے۔ اور (حافظ ابن حجر کی کتاب کے) اصل نسخے میں 'ستر' کی جگہ 'سترة' ہے۔ اور 'مؤخرة الرحل' سے مراد وہ لکڑی ہے جس پر سوار شخص ٹیک لگاتا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (500). 'Mu'khirat ar-Raḥl' is the wooden post at the back of a camel's saddle that a rider leans against.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "سُئِلَ",
      "english": "He was asked",
      "urdu": "آپ سے پوچھا گیا"
    },
    {
      "arabic": "سُتْرَةِ اَلْمُصَلِّي",
      "english": "The Sutrah (barrier) for the praying person",
      "urdu": "نمازی کے لیے سترہ"
    },
    {
      "arabic": "غَزْوَةِ تَبُوكَ",
      "english": "The Battle of Tabūk",
      "urdu": "غزوہ تبوک"
    },
    {
      "arabic": "مِثْلُ مُؤْخِرَةِ اَلرَّحْلِ",
      "english": "Like the back of the saddle",
      "urdu": "اونٹ کے پالان کے پچھلے حصے کی طرح"
    },
    {
      "arabic": "مُؤْخِرَةُ اَلرَّحْلِ",
      "english": "Back of the saddle (wooden post)",
      "urdu": "پالان کا پچھلا حصہ (لکڑی)"
    },
    {
      "arabic": "اَلْخَشَبَةُ",
      "english": "The wood/wooden post",
      "urdu": "لکڑی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں سترہ (رکاوٹ) کی کم از کم لمبائی بیان کرتی ہے، جو اونٹ کے پالان کے پچھلے حصے (مؤخرۃ الرحل) کی اونچائی کے برابر ہونی چاہیے۔ یہ تعین تقریباً ایک ہاتھ (ذراع) یا اس سے زیادہ اونچائی کی ضرورت کو ظاہر کرتا ہے تاکہ یہ نمازی کے آگے سے گزرنے والے سے حفاظت کا کام کر سکے۔",
    "english": "This Hadith specifies the minimum height required for the Sutrah (barrier) in prayer, which should be equal to the height of the back of a camel's saddle (Mu'khirat ar-Raḥl). This establishes the need for a barrier that is approximately one forearm (Dhirā') or more in height to serve its purpose of protection against passersby.",
    "english_alternative": ""
  },
  "references": [
    {
      "arabic": "رواه مسلم (500)",
      "english": "Reported by Muslim (500)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سترہ کا شرعی حکم اور اس کی مقدار",
        "english": "The Legal Ruling and Size of the Sutrah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سترہ کی مشروعیت",
              "english": "Legislation of the Sutrah"
            },
            "content": {
              "urdu": [
                "نمازی کے لیے سترہ کا اہتمام سنتِ مؤکدہ ہے، تاکہ وہ شیطان اور انسانوں کے گزرنے سے محفوظ رہے۔",
                "نبی اکرم ﷺ نے سفر (غزوہ تبوک) میں بھی اس کی اہمیت واضح کی، جو اس کی عمومی ضرورت کو ظاہر کرتا ہے۔",
                "سترہ نمازی کی پرائیویسی کو یقینی بناتا ہے اور اس کے خشوع کو برقرار رکھنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "Setting up a Sutrah is an emphasized Sunnah for the worshipper to protect themselves from Satan and people passing by.",
                "The Prophet (ﷺ) highlighted its importance even during travel (Battle of Tabūk), showing its general necessity.",
                "The Sutrah ensures the worshipper's privacy and helps maintain their reverence (Khushu')."
              ]
            }
          },
          {
            "title": {
              "urdu": "سترہ کی کم از کم لمبائی",
              "english": "Minimum Height of the Sutrah"
            },
            "content": {
              "urdu": [
                "سترہ کی کم از کم لمبائی «مؤخرة الرحل» (اونٹ کے پالان کے پچھلے حصے) کے برابر ہونی چاہیے، جو تقریباً ایک ہاتھ (ذراع) ہے۔",
                "اگر سترہ اس سے چھوٹا ہو (جیسے زمین پر کھینچی ہوئی لکیر)، تو وہ گزرنے والے کو روکنے میں مؤثر نہیں ہوتا اور سنت کے خلاف ہے۔",
                "فقہاء نے اس لمبائی کو بنیادی معیار مانا ہے، جیسے دیوار، کرسی، یا لکڑی کا استعمال کیا جا سکتا ہے۔"
              ],
              "english": [
                "The minimum height of the Sutrah should be like the 'back of the saddle,' which is approximately one forearm (Dhirā').",
                "If the Sutrah is shorter than this (like a line drawn on the ground), it is ineffective in deterring passersby and contrary to the Sunnah.",
                "Jurists consider this height as the basic standard; a wall, chair, or staff can be used as a Sutrah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سترہ کا فائدہ اور حدود",
        "english": "Benefit and Boundaries of the Sutrah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گزرنے والے سے تحفظ",
              "english": "Protection from Passersby"
            },
            "content": {
              "urdu": [
                "سترہ کی موجودگی میں، گزرنے والا اگر اس کے آگے سے گزرے تو وہ گناہ گار ہو گا، لیکن نمازی کو کوئی نقصان نہیں۔",
                "پہلی حدیث (180) کی سخت وعید کو سترہ کی حدود کے اندر سے گزرنے پر ہی محمول کیا گیا ہے۔",
                "سترہ نمازی اور گزرنے والے کے درمیان ایک واضح حد قائم کرتا ہے۔"
              ],
              "english": [
                "With a Sutrah in place, if someone passes in front of it, they commit a sin, but the worshipper's prayer is protected.",
                "The severe warning in the first Hadith (180) is applied specifically to passing between the worshipper and the Sutrah.",
                "The Sutrah establishes a clear boundary between the worshipper and the passerby."
              ]
            }
          },
          {
            "title": {
              "urdu": "سترہ سے فاصلہ",
              "english": "Distance from the Sutrah"
            },
            "content": {
              "urdu": [
                "سترہ کو نمازی سے اتنے قریب رکھنا چاہیے کہ سجدہ اس کے قریب ہو جائے، جیسا کہ نبی ﷺ کا عمل تھا۔",
                "نبی ﷺ کے سجدہ اور دیوار کے درمیان صرف بکری کے گزرنے کی جگہ ہوتی تھی، جو تقریباً تین ہاتھ ہے۔",
                "سترہ کو زیادہ دور رکھنے سے اس کا مقصد فوت ہو جاتا ہے۔"
              ],
              "english": [
                "The Sutrah should be placed close enough to the worshipper so that the place of prostration is near it, as was the Prophet's practice.",
                "There was only space for a sheep to pass between the Prophet's place of prostration and the wall, which is approximately three forearms.",
                "Placing the Sutrah too far defeats its purpose."
              ]
            }
          }
        ]
      }
    }
  ]
}
