{
  "hadithId": 463,
  "hadithNo": 39,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1278",
      "https://sunnah.com/muslim:938"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1278)، ومسلم (938). والحديث يوضح كراهة اتباع النساء للجنائز دون التحريم القاطع.",
    "urdu": "یہ حدیث صحیح ہے اور اسے بخاری (1278) اور مسلم (938) نے روایت کیا ہے۔ یہ حدیث خواتین کے لیے جنازوں کے پیچھے جانے کی کراہت کو بیان کرتی ہے، لیکن اسے مکمل طور پر حرام قرار نہیں دیا گیا۔",
    "english": "Authentic. Reported by Al-Bukhari (1278) and Muslim (938). The Hadith clarifies that following funeral processions is discouraged (Makruh) for women, but not strictly prohibited (Haram)."
  },
  "importantWords": [
    {
      "arabic": "نُهِينَا",
      "english": "We were forbidden",
      "urdu": "ہمیں روکا گیا"
    },
    {
      "arabic": "اتِّبَاعِ",
      "english": "Following",
      "urdu": "پیچھے چلنا"
    },
    {
      "arabic": "الْجَنَائِزِ",
      "english": "Funerals",
      "urdu": "جنازے"
    },
    {
      "arabic": "يُعْزَمْ",
      "english": "Made absolute",
      "urdu": "سختی سے تاکید کی"
    },
    {
      "arabic": "عَلَيْنَا",
      "english": "Upon us",
      "urdu": "ہم پر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ خواتین کو جنازوں کے ساتھ قبرستان جانے سے روکا گیا ہے، تاہم یہ ممانعت کراہت کے درجے میں ہے، تحریم کے درجے میں نہیں۔",
    "english": "This Hadith indicates that women are discouraged from following funeral processions, but the prohibition is not strictly binding as a total ban."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1278)",
      "english": "Sahih al-Bukhari (1278)"
    },
    {
      "arabic": "صحيح مسلم (938)",
      "english": "Sahih Muslim (938)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم عطية الأنصارية",
        "english": "Umm 'Atiyyah al-Ansariyyah"
      },
      "slug": "umm-atiyyah-al-ansariyyah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خواتین اور جنازہ کے احکام",
        "english": "Women and Funeral Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممانعت کی نوعیت",
              "english": "Nature of Prohibition"
            },
            "content": {
              "urdu": [
                "خواتین کو جنازوں کے پیچھے چلنے سے روکنا کراہتِ تنزیہی پر مبنی ہے۔",
                "ام عطیہ کے الفاظ 'ہم پر سختی نہیں کی گئی' اس کے عدمِ تحریم کی دلیل ہے۔",
                "اس ممانعت کا مقصد خواتین کو مشقت اور غیر ضروری اختلاط سے بچانا ہے۔"
              ],
              "english": [
                "Disuading women from following funerals is considered discouraged (Makruh Tanzihi).",
                "Umm 'Atiyyah's words 'not made absolute' prove it is not strictly forbidden.",
                "The purpose is to protect women from hardship and unnecessary intermingling."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی حکمت",
              "english": "Wisdom Behind the Prohibition"
            },
            "content": {
              "urdu": [
                "خواتین طبعی طور پر نرم دل ہوتی ہیں اور جزیع و فزیع کا اندیشہ ہوتا ہے۔",
                "جنازے کے پیچھے چلنے میں مردوں کا اژدھام ہوتا ہے جو فتنے کا سبب بن سکتا ہے۔",
                "اسلام نے خواتین کی عزت و وقار کے لیے انہیں گھروں میں رہنے کی ترغیب دی ہے۔"
              ],
              "english": [
                "Women are naturally soft-hearted, and there is concern they may lose composure.",
                "Following funerals involves large crowds of men, which may lead to social fitna.",
                "Islam encourages women to remain at home to preserve their honor and dignity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی آراء",
        "english": "Views of Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جواز اور عدمِ جواز",
              "english": "Permissibility vs. Restriction"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک خواتین کا جنازے کے پیچھے چلنا مکروہ ہے۔",
                "اگر پردے کا مکمل اہتمام ہو تو بعض علماء جنازہ گاہ تک جانے کی اجازت دیتے ہیں۔",
                "قبرستان کے اندر جانا جہاں میت کی تدفین ہو رہی ہو، خواتین کے لیے ناپسندیدہ ہے۔"
              ],
              "english": [
                "The majority of jurists consider it discouraged for women to follow funerals.",
                "If full modesty is maintained, some scholars allow going to the prayer area.",
                "Entering the graveyard during burial is highly disliked for women."
              ]
            }
          },
          {
            "title": {
              "urdu": "نمازِ جنازہ میں شرکت",
              "english": "Participation in Janazah Prayer"
            },
            "content": {
              "urdu": [
                "اگر نمازِ جنازہ مسجد میں ہو رہی ہو تو خواتین اس میں شریک ہو سکتی ہیں۔",
                "مسجد کے اندر جنازہ پڑھنے میں وہ ممانعت نہیں جو جنازے کے پیچھے چلنے میں ہے۔",
                "خواتین کے لیے میت کے گھر پر بیٹھ کر دعا کرنا زیادہ افضل اور مناسب ہے۔"
              ],
              "english": [
                "If the Janazah prayer is held in a mosque, women may participate in it.",
                "Praying inside a mosque does not carry the same discouragement as following a procession.",
                "It is more virtuous for women to remain at the deceased's home and offer prayers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کرام کا فہم",
        "english": "Understanding of the Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ام عطیہ رضی اللہ عنہا کی فقاہت",
              "english": "The Jurisprudence of Umm 'Atiyyah"
            },
            "content": {
              "urdu": [
                "ام عطیہ نے نبی ﷺ کے اس حکم کو 'کراہت' کے معنی میں سمجھا۔",
                "وہ جانتی تھیں کہ 'نہی' (روکنا) ہمیشہ 'حرام' کے لیے نہیں ہوتا۔",
                "صحابہ کرام احکامِ نبوی کی باریکیوں اور ان کے درجات کو خوب سمجھتے تھے۔"
              ],
              "english": [
                "Umm 'Atiyyah understood the Prophet's (ﷺ) command as discouragement, not a ban.",
                "She knew that a 'prohibition' in text does not always equate to 'Haram'.",
                "The companions deeply understood the nuances and levels of Prophetic commands."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملِ صحابہ",
              "english": "Practice of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے اس بات کا اہتمام کیا کہ خواتین جنازوں میں نہ آئیں۔",
                "خواتین صحابیات نے بھی اس حکم کی لاج رکھی اور گھروں تک محدود رہیں۔",
                "یہ طرزِ عمل اسلامی معاشرے میں نظم و ضبط اور شرم و حیا کی عکاسی کرتا ہے۔"
              ],
              "english": [
                "The companions ensured that women did not frequent funeral processions.",
                "The female companions respected this and largely remained in their homes.",
                "This conduct reflects the discipline and modesty of the Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صبر و استقامت",
              "english": "Patience and Fortitude"
            },
            "content": {
              "urdu": [
                "موت کے موقع پر بین کرنے اور چیخنے چلانے سے سختی سے بچنا چاہیے۔",
                "خواتین کو چاہیے کہ وہ میت کے گھر پر رہ کر صبر اور دعا کا دامن تھامیں۔",
                "اسلام ہمیں غم کی حالت میں بھی اعتدال اور وقار سکھاتا ہے۔"
              ],
              "english": [
                "Wailing and screaming at the time of death must be strictly avoided.",
                "Women should remain at home, holding onto patience and sincere supplication.",
                "Islam teaches us moderation and dignity even during times of intense grief."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی اہمیت",
              "english": "Importance of Order"
            },
            "content": {
              "urdu": [
                "جنازے کے موقع پر ہجوم میں نظم و ضبط برقرار رکھنا ضروری ہے۔",
                "مردوں کو چاہیے کہ وہ جنازہ کی ذمہ داری پوری کریں اور خواتین پردہ کریں۔",
                "شریعت کے ہر حکم میں انسانیت کے لیے کوئی نہ کوئی خیر چھپی ہوتی ہے۔"
              ],
              "english": [
                "Maintaining order in crowds during funeral processions is essential.",
                "Men should fulfill the duty of burial while women maintain their privacy.",
                "Every command of Shariah contains hidden goodness for humanity."
              ]
            }
          }
        ]
      }
    }
  ]
}