{
  "hadithId": 816,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/816"],
    "kitabId": 7,
    "inKitabBab": 20,
    "arabicBook": "بلوغ المرام",
    "babId": 61
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه الشافعي (1232)، وابن حبان (4929)، والحاكم (4/231). وقد أعلّه البيهقي بالاضطراب، والحديث الصحيح في هذا الباب هو حديث عائشة رضي الله عنها.",
    "urdu": "یہ روایت سندا ضعیف ہے اور اس میں اضطراب پایا جاتا ہے۔ اسے امام شافعی، حاکم اور ابن حبان نے روایت کیا ہے، لیکن امام بیہقی نے اسے معلول قرار دیا ہے۔ اس باب میں اصل صحیح حدیث سیدہ عائشہ رضی اللہ عنہا کی ہے جس کے الفاظ مختلف ہیں۔",
    "english": "Weak. Reported by Ash-Shafi'i (1232), Ibn Hibban (4929), and Al-Hakim (4/231). Al-Bayhaqi pointed out its defects (idhtirab). The authentic core of this topic is found in the Hadith of 'Aishah (RA)."
  },
  "importantWords": [
    {
      "arabic": "اَلْوَلَاءُ",
      "english": "The right of clientage",
      "urdu": "ولاء (آزاد کردہ غلام کی وراثت کا حق)"
    },
    {
      "arabic": "لُحْمَةٌ",
      "english": "Bond / Link",
      "urdu": "تعلق / جوڑ"
    },
    {
      "arabic": "النَّسَبِ",
      "english": "Lineage / Ancestry",
      "urdu": "نسب / خاندان"
    },
    {
      "arabic": "لَا يُبَاعُ",
      "english": "Cannot be sold",
      "urdu": "بیچا نہیں جا سکتا"
    },
    {
      "arabic": "لَا يُوهَبُ",
      "english": "Cannot be gifted",
      "urdu": "ہبہ نہیں کیا جا سکتا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ غلام کو آزاد کرنے کے نتیجے میں پیدا ہونے والا وراثت کا حق (ولاء) خون کے رشتے کی طرح مضبوط ہے، اسے کسی اور کو منتقل یا فروخت نہیں کیا جا سکتا۔",
    "english": "This Hadith states that the right of inheritance resulting from freeing a slave (Wala') is as firm as a blood relation; it is non-transferable and cannot be sold or gifted."
  },
  "references": [
    {
      "arabic": "مستدرك الحاكم (4/231)",
      "english": "Mustadrak Al-Hakim (4/231)"
    },
    {
      "arabic": "صحيح ابن حبان (4929)",
      "english": "Sahih Ibn Hibban (4929)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar bin al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ولاء کی حقیقت اور شرعی مقام",
        "english": "The Reality and Status of Wala'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولاء کا مفہوم",
              "english": "The Meaning of Wala'"
            },
            "content": {
              "urdu": [
                "ولاء وہ شرعی تعلق ہے جو غلام کو آزاد کرنے والے اور آزاد ہونے والے کے درمیان قائم ہوتا ہے۔",
                "یہ تعلق وراثت کا حق پیدا کرتا ہے اگر آزاد شدہ غلام کا کوئی خونی وارث نہ ہو۔",
                "اسلام نے اسے ایک مضبوط سماجی اور قانونی بندھن کے طور پر تسلیم کیا ہے۔"
              ],
              "english": [
                "Wala' is the legal bond established between the manumitter and the freed slave.",
                "This relationship creates a right of inheritance if the freed person has no blood heirs.",
                "Islam recognizes it as a strong social and legal bond within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسب کے ساتھ مماثلت",
              "english": "Similarity to Lineage"
            },
            "content": {
              "urdu": [
                "حدیث میں ولاء کو نسب (خونی رشتے) کی طرح ایک پکا جوڑ قرار دیا گیا ہے۔",
                "جس طرح انسان اپنا نسب تبدیل نہیں کر سکتا، ویسے ہی ولاء بھی تبدیل نہیں ہو سکتی۔",
                "یہ مماثلت اس حق کی مستقل مزاجی اور اہمیت کو واضح کرنے کے لیے دی گئی ہے۔"
              ],
              "english": [
                "The Hadith describes Wala' as a firm link, much like lineage or blood relations.",
                "Just as a person cannot change their lineage, the right of Wala' cannot be altered.",
                "This comparison is made to highlight the permanence and importance of this right."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی ممانعت اور حکمت",
        "english": "Legal Prohibitions and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فروخت اور ہبہ کی ممانعت",
              "english": "Prohibition of Sale and Gift"
            },
            "content": {
              "urdu": [
                "ولاء کا حق کسی دوسرے شخص کے ہاتھ بیچا نہیں جا سکتا۔",
                "اس حق کو کسی دوسرے کو بطور تحفہ (ہبہ) دینا بھی شرعاً جائز نہیں ہے۔",
                "یہ ممانعت اس لیے ہے تاکہ وراثت کے فطری اور قانونی نظام میں کوئی گڑبڑ نہ ہو۔"
              ],
              "english": [
                "The right of Wala' cannot be sold to another individual for monetary gain.",
                "Gifting this right (Hiba) to someone else is also legally impermissible in Shariah.",
                "This prohibition prevents interference in the natural and legal order of inheritance."
              ]
            }
          },
          {
            "title": {
              "urdu": "وراثت کا تحفظ",
              "english": "Protection of Inheritance"
            },
            "content": {
              "urdu": [
                "یہ قانون اس بات کو یقینی بناتا ہے کہ وراثت کا حق صرف اصل حقدار کو ملے۔",
                "آزاد کرنے والے کا یہ حق اس کی موت کے بعد اس کے قریبی مرد رشتہ داروں کو جاتا ہے۔",
                "اسلامی قانون میں مالی مفادات کو اخلاقی اور قانونی ضوابط کے پابند رکھا گیا ہے۔"
              ],
              "english": [
                "This law ensures that inheritance rights remain with the original rightful party.",
                "Upon the manumitter's death, this right passes to his closest male agnates ('Asabah).",
                "Islamic law binds financial interests to ethical and legal frameworks."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و سندی مباحث",
        "english": "Juristic and Chain Discussions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کی اسنادی کمزوری",
              "english": "Weakness of the Narration"
            },
            "content": {
              "urdu": [
                "اگرچہ اس روایت کی سند میں کمزوری ہے، مگر اس کا معنی دیگر صحیح روایات سے تائید یافتہ ہے۔",
                "محدثین نے اس کی سند میں موجود اضطراب کی وجہ سے اسے معلول (عیب دار) کہا ہے۔",
                "تاہم، فقہاء کے ہاں ولاء کی وراثت کا تصور متفقہ طور پر رائج ہے۔"
              ],
              "english": [
                "While the chain of this narration is weak, its meaning is supported by other authentic texts.",
                "Hadith scholars labeled it 'Ma'lul' (defective) due to inconsistencies in its transmission.",
                "Nonetheless, the concept of inheritance via Wala' is unanimously accepted among jurists."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدنا ابوبکر اور عمر رضی اللہ عنہما کا عمل",
              "english": "Practice of Abu Bakr and Umar (RA)"
            },
            "content": {
              "urdu": [
                "خلفائے راشدین نے بھی ولاء کو نسب کے برابر قرار دے کر اس کی خرید و فروخت سے روکا۔",
                "صحابہ کرام کا عمل اس حدیث کے مفہوم کی عملی تشریح پیش کرتا ہے۔",
                "اسلامی تاریخ میں وراثت کے ان اصولوں پر سختی سے عمل کیا گیا ہے۔"
              ],
              "english": [
                "The Rightly Guided Caliphs treated Wala' like lineage and forbade its trade.",
                "The practice of the Sahaba provides a practical interpretation of this Hadith's meaning.",
                "Throughout Islamic history, these principles of inheritance were strictly upheld."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وراثت کی تقسیم میں دیانت",
              "english": "Integrity in Distribution"
            },
            "content": {
              "urdu": [
                "وراثت کے حقوق کو اپنی مرضی سے تبدیل کرنا یا بیچنا جائز نہیں ہے۔",
                "اللہ کے مقرر کردہ حصوں اور ضابطوں کی پابندی ہی اصل تقویٰ ہے۔",
                "معاشی معاملات میں شرعی حدود کا خیال رکھنا معاشرتی انصاف کے لیے ضروری ہے۔"
              ],
              "english": [
                "It is not permissible to change or sell inheritance rights according to personal whims.",
                "True piety lies in adhering to the shares and regulations established by Allah.",
                "Respecting Shariah limits in financial matters is essential for social justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "رشتوں کا احترام",
              "english": "Respecting Relationships"
            },
            "content": {
              "urdu": [
                "اسلام نے قانونی رشتوں کو بھی اخلاقی بنیادوں پر استوار کیا ہے۔",
                "حقوق العباد کی ادائیگی میں سچائی اور امانت داری کو مقدم رکھنا چاہیے۔",
                "یہ حدیث ہمیں انسانی تعلقات کی حرمت اور ان کے قانونی تقاضوں کا درس دیتی ہے۔"
              ],
              "english": [
                "Islam has built legal relationships upon strong ethical foundations.",
                "Truth and honesty must be prioritized in fulfilling the rights of others.",
                "This Hadith teaches the sanctity of human relations and their legal requirements."
              ]
            }
          }
        ]
      }
    }
  ]
}