{
  "hadithId": 407,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-407"],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام",
    "babId": 26
  },
 
  "takhreej": {
    "arabic": "حسن.‏ رواه أبو داود (1173)‏، وصححه ابن حبان (2860)‏. وقصة التحويل في الصحيح من حديث عبد الله بن زيد البخاري (1024) ومسلم (894).",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے ابوداؤد (1173) نے روایت کیا اور ابن حبان (2860) نے اسے صحیح قرار دیا ہے۔ چادر پلٹنے کا قصہ صحیح بخاری (1024) اور مسلم (894) میں عبداللہ بن زید رضی اللہ عنہ کی روایت سے بھی ثابت ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (1173) and authenticated by Ibn Hibban (2860). The incident of inverting the cloak is also recorded in Sahih al-Bukhari (1024) and Muslim (894) from the narration of Abdullah bin Zaid."
  },
  "importantWords": [
    {
      "arabic": "قُحُوطَ",
      "english": "Drought / Lack of rain",
      "urdu": "بارش کا نہ ہونا / خشک سالی"
    },
    {
      "arabic": "الْغَيْثَ",
      "english": "Helpful Rain",
      "urdu": "بارانِ رحمت"
    },
    {
      "arabic": "حَاجِبُ اَلشَّمْسِ",
      "english": "Rim of the sun",
      "urdu": "سورج کا کنارہ"
    },
    {
      "arabic": "قَلَبَ رِدَاءَهُ",
      "english": "Inverted his cloak",
      "urdu": "اپنی چادر پلٹ دی"
    },
    {
      "arabic": "بَلَاغًا",
      "english": "Satisfaction / Sufficiency",
      "urdu": "کفایت / پہنچنا"
    }
  ],
  "summary": {
    "urdu": "بارش نہ ہونے پر رسول اللہ ﷺ نے صحابہ کے ساتھ عید گاہ جا کر عاجزی سے دعا فرمائی، اپنی چادر پلٹی اور دو رکعت نماز پڑھائی، جس کے نتیجے میں اللہ نے بارش عطا فرمائی۔",
    "english": "During a drought, the Prophet (ﷺ) went out to the Musalla, delivered a sermon, supplicated intensely with raised hands, inverted his cloak, and led two rak'ahs, after which rain fell."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1173)",
      "english": "Sunan Abu Dawud (1173)"
    },
    {
      "arabic": "صحيح ابن حبان (2860)",
      "english": "Sahih Ibn Hibban (2860)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_0e_C7R_l8",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازِ استسقاء کا طریقہ",
        "english": "Method of Istisqa Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتماعی دعا اور نماز",
              "english": "Collective Supplication and Prayer"
            },
            "content": {
              "urdu": [
                "استسقاء کے لیے باقاعدہ دن مقرر کر کے عید گاہ جانا سنت ہے۔",
                "پہلے خطبہ اور کثرت سے دعا کرنا اور پھر دو رکعت پڑھنا ثابت ہے۔",
                "نبی ﷺ نے سورج نکلتے وقت اس عمل کا آغاز فرمایا۔"
              ],
              "english": [
                "It is Sunnah to appoint a day and go to the Musalla for Istisqa.",
                "Delivering a sermon and supplicating before two rak'ahs is established.",
                "The Prophet (ﷺ) started this practice when the sun began to rise."
              ]
            }
          },
          {
            "title": {
              "urdu": "بلند آواز سے قرآت",
              "english": "Reciting Aloud"
            },
            "content": {
              "urdu": [
                "نمازِ استسقاء کی دونوں رکعتوں میں قرآت بلند آواز سے کی جاتی ہے۔",
                "یہ نماز عید کی نماز کی طرح دو رکعت پر مشتمل ہوتی ہے۔",
                "اس میں توبہ و استغفار اور عاجزی کا پہلو نمایاں ہونا چاہیے۔"
              ],
              "english": [
                "The recitation in both rak'ahs of Istisqa is done aloud (Jahri).",
                "This prayer consists of two rak'ahs similar to the Eid prayer.",
                "Elements of repentance, seeking forgiveness, and humility must be prominent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کی عاجزی اور چادر پلٹنا",
        "english": "Humility in Supplication and Inverting the Cloak"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہاتھ اٹھانے میں مبالغہ",
              "english": "Exaggeration in Raising Hands"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے دعا کے وقت ہاتھ اتنے بلند کیے کہ بغل نظر آنے لگی۔",
                "یہ اللہ کے حضور انتہائی محتاجی اور بے بسی کا اظہار تھا۔",
                "سخت ضرورت کے وقت ہاتھ بلند کر کے گریہ و زاری کرنا مستحب ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) raised his hands so high that his armpits were visible.",
                "This expressed extreme neediness and helplessness before Allah.",
                "It is recommended to weep and raise hands high during times of dire need."
              ]
            }
          },
          {
            "title": {
              "urdu": "چادر پلٹنے کی حکمت",
              "english": "Wisdom of Inverting the Cloak"
            },
            "content": {
              "urdu": [
                "دعا کے دوران چادر پلٹنا نیک شگون اور حالات کی تبدیلی کی علامت ہے۔",
                "یہ اس امید کا اظہار ہے کہ اللہ قحط کو بارش میں بدل دے گا۔",
                "امام کو قبلہ رخ ہو کر چادر کا اوپر والا حصہ نیچے اور دائیں بائیں کرنا چاہیے۔"
              ],
              "english": [
                "Inverting the cloak during supplication is a good omen for change.",
                "It expresses the hope that Allah will change the drought into rain.",
                "The Imam should face the Qibla and flip his cloak's top to bottom/sides."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کی حمد اور غنا",
        "english": "Praising Allah and His Self-Sufficiency"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی وحدانیت کا اقرار",
              "english": "Acknowledgment of Allah's Oneness"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے دعا کا آغاز سورہ فاتحہ اور اللہ کی حمد سے فرمایا۔",
                "یہ تسلیم کیا گیا کہ اللہ ہی غنی ہے اور تمام انسان فقیر ہیں۔",
                "اللہ کی تعریف اور اس کی قدرت کا ذکر دعا کی قبولیت کا سبب ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) began the supplication with Surah Al-Fatihah and Praise.",
                "It was acknowledged that Allah is the Rich and all humans are poor.",
                "Praising Allah and mentioning His power leads to the acceptance of Dua."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی قبولیت کا یقین",
              "english": "Certainty in Acceptance"
            },
            "content": {
              "urdu": [
                "اللہ نے بندوں کو دعا کا حکم دیا اور اسے قبول کرنے کا وعدہ کیا ہے۔",
                "مومن کو مشکل میں مایوس ہونے کے بجائے اللہ سے امید رکھنی چاہیے۔",
                "بارش کے لیے دعا مانگنا بندگی کا ایک اہم تقاضا اور عبادت ہے۔"
              ],
              "english": [
                "Allah commanded His servants to pray and promised to respond.",
                "A believer should maintain hope in Allah rather than despairing in hardship.",
                "Praying for rain is a vital requirement of servitude and an act of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بارانِ رحمت اور برکت",
        "english": "Merciful Rain and Blessing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بارش کے لیے جامع دعا",
              "english": "Comprehensive Prayer for Rain"
            },
            "content": {
              "urdu": [
                "ایسی بارش کی دعا مانگی گئی جو طاقت اور نفع کا باعث بنے۔",
                "بارش کا مقصد صرف زمین سیراب کرنا نہیں بلکہ رزق کی فراہمی ہے۔",
                "ایسی بارش سے پناہ مانگی گئی جو تباہی یا عذاب کا سبب بنے۔"
              ],
              "english": [
                "A prayer was made for rain that brings strength and benefit.",
                "The goal of rain is not just soaking the earth but providing sustenance.",
                "Refuge was sought from rain that causes destruction or punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "معجزانہ قبولیت",
              "english": "Miraculous Acceptance"
            },
            "content": {
              "urdu": [
                "دعا اور نماز کے فوراً بعد بادلوں کا آنا اور بارش ہونا ایک معجزہ ہے۔",
                "یہ رسول اللہ ﷺ کی صداقت اور اللہ سے ان کے تعلق کی دلیل ہے۔",
                "اجتماعی استغفار اور توبہ اللہ کی رحمت کو کھینچنے کا بہترین نسخہ ہے۔"
              ],
              "english": [
                "The immediate appearance of clouds and rain after prayer is a miracle.",
                "This is proof of the Prophet's (ﷺ) truthfulness and bond with Allah.",
                "Collective seeking of forgiveness is the best way to attract Allah's mercy."
              ]
            }
          }
        ]
      }
    }
  ]
}
