{
  "hadithId": 242,
  "hadithNo": 33,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/33"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه ابن خزيمة في صحيحه (620) والحاكم (1/225) وصححه على شرط الشيخين ووافقه الذهبي.",
    "urdu": "یہ روایت صحیح ہے۔ اسے ابن خزیمہ (620) اور حاکم نے روایت کیا ہے، امام حاکم اور امام ذہبی نے اسے بخاری و مسلم کی شرط پر صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ibn Khuzaimah (620) and Al-Hakim (1/225). Al-Hakim and Adh-Dhahabi graded it authentic according to the conditions of Al-Bukhari and Muslim."
  },
  "importantWords": [
    {
      "arabic": "لا يَقْنُتُ",
      "english": "Did not perform Qunut",
      "urdu": "قنوت نہیں پڑھتے تھے"
    },
    {
      "arabic": "إِلَّا",
      "english": "Except",
      "urdu": "سوائے / مگر"
    },
    {
      "arabic": "دَعَا لِقَوْمٍ",
      "english": "Prayed for a people",
      "urdu": "کسی قوم کے لیے دعا کی"
    },
    {
      "arabic": "دَعَا عَلَى",
      "english": "Prayed against",
      "urdu": "کسی کے خلاف بددعا کی"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "Graded it authentic",
      "urdu": "اسے صحیح قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ نبی کریم ﷺ نماز میں قنوتِ نازلہ صرف کسی خاص ضرورت، خیر کی دعا یا شر سے بچاؤ کی بددعا کے وقت ہی مانگتے تھے۔",
    "english": "This Hadith clarifies that the Prophet (PBUH) only performed Qunut in prayers for specific needs, such as praying for someone's welfare or against an oppressor."
  },
  "references": [
    {
      "arabic": "صحيح ابن خزيمة (620)",
      "english": "Sahih Ibn Khuzaimah (620)"
    },
    {
      "arabic": "المستدرك للحاكم (1/225)",
      "english": "Al-Mustadrak al-Hakim (1/225)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=qunut+e+nazila+ka+tarika+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قنوتِ نازلہ کی حقیقت",
        "english": "Reality of Qunut al-Nazila"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قنوت کا عارضی ہونا",
              "english": "Temporal Nature of Qunut"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا معمول دائمی طور پر قنوت پڑھنے کا نہیں تھا۔",
                "آپ ﷺ صرف خاص حالات یا فتنوں کے وقت قنوت پڑھتے تھے۔",
                "یہ اس بات کی دلیل ہے کہ قنوت نماز کا مستقل حصہ نہیں ہے۔"
              ],
              "english": [
                "The Prophet's (PBUH) routine was not to perform Qunut permanently.",
                "He only performed Qunut during specific circumstances or tribulations.",
                "This serves as evidence that Qunut is not a permanent part of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعائیہ پہلو",
              "english": "Supplicatory Aspect"
            },
            "content": {
              "urdu": [
                "قنوت کا مقصد مسلمانوں کی خیر یا دشمنوں کی شر سے بچنا ہے۔",
                "اس میں خیر کی دعا اور دشمن کے لیے بددعا دونوں شامل ہیں۔",
                "دعا کی قبولیت کے لیے حالات کے مطابق الفاظ کا انتخاب بہتر ہے۔"
              ],
              "english": [
                "The purpose of Qunut is to seek good for Muslims or protection from enemies.",
                "It includes both prayers for welfare and invocations against oppressors.",
                "Selecting words according to the situation is better for the acceptance of prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قنوت کب واجب ہے؟",
              "english": "When is Qunut Necessary?"
            },
            "content": {
              "urdu": [
                "شدید مصیبت یا جنگی حالات میں امام کو قنوت پڑھنی چاہیے۔",
                "عام حالات میں قنوتِ نازلہ کو ترک کرنا ہی سنت سے ثابت ہے۔",
                "یہ عمل مسلمانوں کی اجتماعی پریشانیوں کے حل کے لیے ہے۔"
              ],
              "english": [
                "The Imam should perform Qunut during severe calamities or war situations.",
                "Leaving Qunut al-Nazila during normal times is established from the Sunnah.",
                "This practice is intended for resolving the collective distress of Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی ہیئت",
              "english": "Structure of Prayer"
            },
            "content": {
              "urdu": [
                "قنوت کو نماز کا لازمی جزو سمجھنا شرعی طور پر درست نہیں۔",
                "اس حدیث سے ان لوگوں کی تردید ہوتی ہے جو اسے فرض سمجھتے ہیں۔",
                "نماز کی اصل ہیئت کو برقرار رکھنا ہر مسلمان پر لازم ہے۔"
              ],
              "english": [
                "It is not legally correct to consider Qunut an obligatory part of prayer.",
                "This Hadith refutes those who consider it an absolute obligation.",
                "Maintaining the original structure of the prayer is mandatory for every Muslim."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال پسندی",
              "english": "Moderation"
            },
            "content": {
              "urdu": [
                "دین میں غلو سے بچنا اور سنت کے مطابق عمل کرنا ضروری ہے۔",
                "آپ ﷺ کا عمل ہمیں ہر کام میں اعتدال کی تعلیم دیتا ہے۔",
                "عبادات میں اضافے کے بجائے اتباعِ سنت پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "It is essential to avoid extremism in religion and act according to Sunnah.",
                "The Prophet's action teaches us moderation in every matter.",
                "Focus should be on following the Sunnah rather than adding to worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "روایات کی اہمیت",
              "english": "Importance of Narrations"
            },
            "content": {
              "urdu": [
                "ابن خزیمہ جیسے ائمہ کی تصحیح حدیث کی قوت کو ظاہر کرتی ہے۔",
                "علمِ حدیث میں سند اور متن کی صحت کا بنیادی کردار ہے۔",
                "صحیح علم ہی انسان کو صحیح عمل کی طرف راغب کرتا ہے۔"
              ],
              "english": [
                "Validation by Imams like Ibn Khuzaimah shows the strength of the Hadith.",
                "Authenticity of chain and text plays a fundamental role in Hadith science.",
                "Correct knowledge leads a person toward correct righteous actions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی پر اثر",
        "english": "Impact on Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتماعی دعا",
              "english": "Collective Supplication"
            },
            "content": {
              "urdu": [
                "امت کے مسائل پر مل کر اللہ سے رجوع کرنا چاہیے۔",
                "قنوتِ نازلہ مسلمانوں کے درمیان ہمدردی کا اظہار ہے۔",
                "مشکل وقت میں اللہ کی طرف رجوع کرنا ہی اصل کامیابی ہے۔"
              ],
              "english": [
                "One should turn to Allah collectively regarding the Ummah's issues.",
                "Qunut al-Nazila is an expression of sympathy among Muslims.",
                "Turning towards Allah during difficult times is the true success."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم کے خلاف آواز",
              "english": "Voice Against Oppression"
            },
            "content": {
              "urdu": [
                "نماز میں ظالموں کے خلاف دعا کرنا مظلوم کی حمایت ہے۔",
                "یہ حدیث ہمیں ناانصافی کے خلاف روحانی مزاحمت سکھاتی ہے۔",
                "مظلوم کی دعا اور اللہ کے درمیان کوئی پردہ نہیں ہوتا۔"
              ],
              "english": [
                "Praying against oppressors in prayer is a form of supporting the oppressed.",
                "This Hadith teaches us spiritual resistance against injustice.",
                "There is no veil between the prayer of the oppressed and Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
