{
  "hadithId": 1197,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:4425"],
    "kitabId": 14,
    "inKitabBab": 1,
    "arabicBook": "كتاب الفتن",
    "babId": 97
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (4425)، والترمذي (2262)، والنسائي (5388)، وأحمد (20400).",
    "urdu": "یہ صحیح حدیث ہے۔ اسے امام بخاری (4425)، ترمذی (2262)، نسائی (5388) اور احمد (20400) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (4425), At-Tirmidhi (2262), An-Nasa'i (5388), and Ahmad (20400)."
  },
  "importantWords": [
    {
      "arabic": "يُفْلِحَ",
      "english": "Succeed",
      "urdu": "کامیاب ہونا"
    },
    {
      "arabic": "قَوْمٌ",
      "english": "Nation",
      "urdu": "قوم"
    },
    {
      "arabic": "وَلَّوْا",
      "english": "Appoint/Entrust",
      "urdu": "سپرد کرنا"
    },
    {
      "arabic": "أَمْرَهُمْ",
      "english": "Their affairs/Authority",
      "urdu": "اپنے معاملات"
    },
    {
      "arabic": "اِمْرَأَةً",
      "english": "A woman",
      "urdu": "عورت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ریاست کی سربراہی اور امورِ مملکت کی کلی ذمہ داری عورت کے سپرد کرنے سے متعلق شرعی حکم بیان کیا گیا ہے۔",
    "english": "This Hadith provides guidance on the supreme leadership of a nation and the Islamic perspective on entrusting state affairs to a woman."
  },
  "references": [
    {
      "arabic": "رواه البخاري (4425)",
      "english": "Reported by Al-Bukhari (4425)"
    },
    {
      "arabic": "رواه الترمذي (2262)",
      "english": "Reported by At-Tirmidhi (2262)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو بكرة الثقفي",
        "english": "Abu Bakra Al-Thaqafi"
      },
      "slug": "abu-bakra-al-thaqafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر",
        "english": "Background of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایرانی سلطنت کا واقعہ",
              "english": "Event of the Persian Empire"
            },
            "content": {
              "urdu": [
                "یہ فرمان اس وقت صادر ہوا جب اہل فارس نے کسریٰ کی بیٹی کو حکمران بنایا۔",
                "سیدنا ابوبکرہ رضی اللہ عنہ نے جنگ جمل کے موقع پر اس حدیث سے رہنمائی لی۔",
                "نبی کریم ﷺ نے وحی کی بنیاد پر اس قوم کے عدمِ فلاح کی خبر دی تھی۔"
              ],
              "english": [
                "This statement was made when Persians appointed Chosroes' daughter as ruler.",
                "Abu Bakra (RA) recalled this Hadith during the Battle of the Camel.",
                "The Prophet (ﷺ) foretold the lack of success based on divine revelation."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقصودِ کلام",
              "english": "Purpose of the Statement"
            },
            "content": {
              "urdu": [
                "اس سے مراد ریاست کی 'امامتِ کبریٰ' یا اعلیٰ ترین سیاسی منصب ہے۔",
                "یہ کسی فرد کی ذاتی توہین نہیں بلکہ انتظامی تقسیم کا بیان ہے۔",
                "اسلامی نظامِ سیاست میں سربراہی کی کچھ مخصوص شرائط اور ذمہ داریاں ہیں۔"
              ],
              "english": [
                "It refers to 'Al-Imamah al-Kubra' or the supreme political office.",
                "This is not a personal insult but a statement on administrative roles.",
                "Islamic political systems have specific criteria and duties for leadership."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و شرعی احکام",
        "english": "Juristic and Sharia Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور علماء کا موقف",
              "english": "Position of Majority Scholars"
            },
            "content": {
              "urdu": [
                "ائمہ اربعہ کے نزدیک عورت ریاست کی سربراہ (خلیفہ) نہیں بن سکتی۔",
                "اعلیٰ قیادت میں جسمانی اور بیرونی اسفار کی بہت زیادہ ضرورت ہوتی ہے۔",
                "عورت کے لیے پردہ اور عفت کے احکامات سربراہی کے تقاضوں سے مختلف ہیں۔"
              ],
              "english": [
                "According to the four Imams, a woman cannot be the head of state.",
                "Supreme leadership requires extensive physical presence and travel.",
                "Rules of hijab and modesty for women differ from leadership demands."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر مناصب پر تقرری",
              "english": "Appointment to Other Offices"
            },
            "content": {
              "urdu": [
                "بعض فقہاء نے محدود دائرے میں عورت کی قضا (جج) کو جائز قرار دیا ہے۔",
                "مشاورتی مجالس اور انتظامی امور میں عورت کی رائے لی جا سکتی ہے۔",
                "سیدہ شفاء بنت عبداللہ کو حضرت عمر رضی اللہ عنہ نے مارکیٹ نگران بنایا تھا۔"
              ],
              "english": [
                "Some jurists allow women to serve as judges in specific limited areas.",
                "A woman's counsel can be sought in consultative and administrative matters.",
                "Umar (RA) appointed Shifa bint Abdullah as a market supervisor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور مصلحت",
        "english": "Wisdom and Rationale"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری تفاوت",
              "english": "Natural Differences"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے مرد اور عورت کے دائرہ کار مختلف متعین کیے ہیں۔",
                "عورت کی اصل توجہ گھر اور نسلِ نو کی تربیت پر ہونی چاہیے۔",
                "ریاست کا بوجھ اٹھانا ایک نہایت کٹھن اور اعصاب شکن کام ہے۔"
              ],
              "english": [
                "Allah has designated different spheres of work for men and women.",
                "A woman's primary focus should be the home and raising the youth.",
                "Bearing the burden of a state is an extremely grueling and taxing task."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظامِ کائنات میں توازن",
              "english": "Balance in the Universe"
            },
            "content": {
              "urdu": [
                "ہر فرد کو وہی کام سونپا گیا ہے جس کے لیے وہ فطری طور پر موزوں ہے۔",
                "مرد کو قوام بنایا گیا ہے تاکہ وہ بیرونی معاملات کی حفاظت کرے۔",
                "اسلامی معاشرت میں ذمہ داریوں کی تقسیم عدل پر مبنی ہے۔"
              ],
              "english": [
                "Each individual is assigned tasks for which they are naturally suited.",
                "The male is designated as the maintainer for external affairs.",
                "The division of responsibilities in Islamic society is based on equity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عصرِ حاضر اور اطلاق",
        "english": "Modern Era and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جدید سیاسی نظریات",
              "english": "Modern Political Theories"
            },
            "content": {
              "urdu": [
                "جدید جمہوریت میں اس حدیث کے اطلاق پر مختلف آراء پائی جاتی ہیں۔",
                "علماء کے مطابق وحی کی رہنمائی ہر زمانے کے لیے حرفِ آخر ہے۔",
                "کامیابی کے معیار دنیاوی ترقی نہیں بلکہ اللہ کے احکام کی تابعداری ہے۔"
              ],
              "english": [
                "There are various opinions on applying this Hadith in modern democracy.",
                "According to scholars, divine guidance remains final for all eras.",
                "The standard of success is obedience to Allah, not just worldly progress."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کا احترام",
              "english": "Respect for Women"
            },
            "content": {
              "urdu": [
                "سربراہی کی ممانعت کا مطلب عورت کی تحقیر ہرگز نہیں ہے۔",
                "اسلام نے ماں، بیٹی اور بیوی کے روپ میں عورت کو بلند مقام دیا۔",
                "حقیقی فلاح ان حدود کے اندر ہے جو خالقِ کائنات نے مقرر کی ہیں۔"
              ],
              "english": [
                "Prohibition of leadership does not mean belittling women at all.",
                "Islam grants women high status as mothers, daughters, and wives.",
                "True success lies within the boundaries set by the Creator."
              ]
            }
          }
        ]
      }
    }
  ]
}