{
  "hadithId": 699,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:1588a"],
    "kitabId": 7,
    "inKitabBab": 3,
    "arabicBook": "كتاب البيوع",
    "babId": 44
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1588). وأخرجه أحمد (2/232) والبيهقي (5/280).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اپنی صحیح (1588) میں اسے روایت کیا ہے۔ یہ روایت ربا الفضل کی حرمت پر بنیادی نص ہے۔",
    "english": "Sahih. Reported by Muslim (1588), Ahmad (2/232), and Al-Baqhaqi (5/280)."
  },
  "importantWords": [
    {
      "arabic": "وَزْناً",
      "english": "Weight",
      "urdu": "وزن"
    },
    {
      "arabic": "مِثْلًا بِمِثْلٍ",
      "english": "Like for like / Equal",
      "urdu": "برابر برابر"
    },
    {
      "arabic": "زَادَ",
      "english": "Added / Increased",
      "urdu": "زیادہ دیا"
    },
    {
      "arabic": "اِسْتَزَادَ",
      "english": "Demanded addition",
      "urdu": "زیادتی کا مطالبہ کیا"
    },
    {
      "arabic": "رِبًا",
      "english": "Usury / Interest",
      "urdu": "سود"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ربا الفضل کی تعریف اور حرمت بیان ہوئی ہے کہ سونے اور چاندی کے ہم جنس تبادلے میں وزن میں معمولی فرق بھی سود کہلاتا ہے۔",
    "english": "This Hadith defines and prohibits Riba al-Fadl, stating that any weight disparity during the exchange of gold for gold or silver for silver is usury."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1588)",
      "english": "Reported by Muslim (1588)"
    },
    {
      "arabic": "المنتقى شرح الموطأ",
      "english": "Al-Muntaqa Sharh al-Muwatta"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0O5vXJ4Xm4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ربا الفضل کی حقیقت",
        "english": "The Reality of Riba al-Fadl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہم جنس اشیاء کا تبادلہ",
              "english": "Exchange of Homogeneous Items"
            },
            "content": {
              "urdu": [
                "جب ایک ہی جنس کی چیز جیسے سونا یا چاندی ہو، تو برابری شرط ہے۔",
                "قدیم اور جدید سونے کے معیار میں فرق کی وجہ سے وزن بدلنا ناجائز ہے۔",
                "شریعت نے مقدار کی مساوات کو سود سے بچنے کا واحد راستہ قرار دیا ہے۔"
              ],
              "english": [
                "Equality is a mandatory condition when exchanging items of the same genus.",
                "Weight disparity due to differences in quality (old vs new gold) is prohibited.",
                "Sharia identifies quantitative equality as the only way to avoid usury in such deals."
              ]
            }
          },
          {
            "title": {
              "urdu": "سود کی وعید",
              "english": "Warning Against Usury"
            },
            "content": {
              "urdu": [
                "اضافہ دینے والا اور مانگنے والا دونوں گناہ میں برابر کے شریک ہیں۔",
                "نبی کریم ﷺ نے اس عمل کو صریحاً سود قرار دے کر اس سے بچنے کا حکم دیا۔",
                "سود کے ذریعے حاصل ہونے والا ذرہ برابر نفع بھی مال کو حرام کر دیتا ہے۔"
              ],
              "english": [
                "Both the giver of the increase and the requester share the burden of sin.",
                "The Prophet (PBUH) explicitly labeled this practice as usury and forbade it.",
                "Even a tiny profit gained through usury renders the entire transaction unlawful."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی انصاف اور برکت",
        "english": "Economic Justice and Blessing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استحصال کا خاتمہ",
              "english": "End of Exploitation"
            },
            "content": {
              "urdu": [
                "وزن میں کمی بیشی سے ہمیشہ ایک فریق کا معاشی نقصان ہوتا ہے۔",
                "اسلامی معاشیات کا مقصد کسی کی مجبوری کا فائدہ اٹھانے سے روکنا ہے۔",
                "برابر کے تبادلے سے بازار میں شفافیت اور دیانتداری کو فروغ ملتا ہے۔"
              ],
              "english": [
                "Weight disparity invariably leads to the economic loss of one party.",
                "Islamic economics aims to prevent exploitation based on personal necessity.",
                "Equal exchange promotes transparency and integrity within the marketplace."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزق میں برکت کے اصول",
              "english": "Principles of Blessed Provision"
            },
            "content": {
              "urdu": [
                "سود سے بظاہر مال بڑھتا ہے مگر اس کی روحانی برکت ختم ہو جاتی ہے۔",
                "حلال طریقے سے کی گئی تجارت ہی دنیا اور آخرت میں نفع بخش ہے۔",
                "مومن کو چاہیے کہ وہ مشتبہ منافع کے بجائے قلیل حلال پر راضی رہے۔"
              ],
              "english": [
                "Usury may increase wealth outwardly, but it destroys spiritual blessings.",
                "Only trade conducted through Halal means is profitable in both worlds.",
                "A believer should prioritize minimal Halal income over doubtful massive gains."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صرف (کرنسی) کا قانون",
              "english": "Law of Currency Exchange"
            },
            "content": {
              "urdu": [
                "سونا اور چاندی اس وقت کی بنیادی کرنسی (ثمن) کی حیثیت رکھتے تھے۔",
                "کرنسی کے تبادلے میں قبضہ اسی مجلس میں ہونا بھی لازمی شرط ہے۔",
                "اگر جنس بدلے (سونا چاندی سے) تو کمی بیشی جائز ہے مگر نقد ہونا شرط ہے۔"
              ],
              "english": [
                "Gold and silver served as the primary legal tender at that time.",
                "Spot delivery (same session possession) is mandatory in currency exchange.",
                "If the genus changes (gold for silver), weight disparity is allowed but must be cash."
              ]
            }
          },
          {
            "title": {
              "urdu": "عیب دار مال کا حکم",
              "english": "Ruling on Defective Assets"
            },
            "content": {
              "urdu": [
                "ٹوٹا ہوا سونا اور سالم سونا بھی وزن میں برابر ہی بدلے جائیں گے۔",
                "کوالٹی کی بنیاد پر وزن میں فرق کرنا ربا الفضل ہی کہلائے گا۔",
                "اگر کسی کو بہتر کوالٹی چاہیے تو وہ اپنا مال بیچ کر رقم سے دوسرا خرید لے۔"
              ],
              "english": [
                "Broken gold and intact gold must still be exchanged equally in weight.",
                "Differing weights based on quality is categorized strictly as Riba al-Fadl.",
                "If better quality is desired, one should sell their gold and buy the other for cash."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور میں اطلاق",
        "english": "Modern Day Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کرنسی اور ڈیجیٹل اثاثے",
              "english": "Currency and Digital Assets"
            },
            "content": {
              "urdu": [
                "جدید کاغذی کرنسی پر بھی ربا کے یہ بنیادی قوانین لاگو ہوتے ہیں۔",
                "ایک ہی ملک کے نوٹوں کا تبادلہ برابر کی بنیاد پر ہونا ضروری ہے۔",
                "سود کی ہر وہ صورت جو مال میں زیادتی پیدا کرے، اس حدیث سے ممنوع ہے۔"
              ],
              "english": [
                "Fundamental usury laws apply even to modern paper and fiat currencies.",
                "Exchanging currency of the same country must be done on a one-to-one basis.",
                "Any form of usury that yields a generic increase is prohibited by this Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط اور تقویٰ",
              "english": "Caution and Piety"
            },
            "content": {
              "urdu": [
                "مالی معاملات میں احتیاط برتنا ایمان کی حفاظت کے لیے ضروری ہے۔",
                "سود کے 70 سے زائد دروازے ہیں، جن میں سے ادنیٰ بھی ہلاکت خیز ہے۔",
                "علمِ دین سیکھنا تاکہ خرید و فروخت میں سود سے بچا جا سکے، ہر تاجر پر فرض ہے۔"
              ],
              "english": [
                "Exercise caution in financial dealings is vital for preserving one's faith.",
                "Usury has over 70 gates; even the lowest is spiritually destructive.",
                "Learning religious laws to avoid usury in trade is obligatory for every merchant."
              ]
            }
          }
        ]
      }
    }
  ]
}