{
  "hadithId": 1262,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/27"],
    "kitabId": 16,
    "inKitabBab": 2,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 103
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2625). وفي رواية له: 'يا أبا ذر، إذا طبخت مرقة فأكثر ماءها وتعاهد جيرانك'.",
    "urdu": "صحیح۔ اسے امام مسلم (2625) نے روایت کیا ہے۔ اس کے الفاظ یہ ہیں کہ ”اے ابوذر! جب تم شوربہ پکاؤ تو اس میں پانی زیادہ کر لیا کرو۔“",
    "english": "Sahih. Reported by Muslim (2625). Another narration in Muslim begins with 'O Abu Dharr...'"
  },
  "importantWords": [
    {
      "arabic": "مَرَقَةً",
      "english": "Broth / Soup",
      "urdu": "شوربہ"
    },
    {
      "arabic": "فَأَكْثِرْ",
      "english": "Increase / Make plenty",
      "urdu": "پس زیادہ کر لو"
    },
    {
      "arabic": "تَعَاهَدْ",
      "english": "Be mindful / Look after",
      "urdu": "خبر گیری کرو / خیال رکھو"
    },
    {
      "arabic": "جِيرَانَكَ",
      "english": "Your neighbors",
      "urdu": "اپنے پڑوسی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث پڑوسیوں کے حقوق اور سماجی ہمدردی کی اہمیت کو واضح کرتی ہے کہ معمولی چیز میں بھی دوسروں کو شریک کرنا باعثِ برکت اور سنت ہے۔",
    "english": "This Hadith emphasizes the rights of neighbors and social empathy, showing that even sharing simple food is a virtuous and recommended act."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب البر والصلة، باب الوصية بالجار، رقم 2625",
      "english": "Sahih Muslim, Book of Virtue, No. 2625"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو ذر الغفاري",
        "english": "Abu Dharr al-Ghifari"
      },
      "slug": "abu-dharr-al-ghifari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پڑوسی کے حقوق اور اسلام",
        "english": "Rights of Neighbors in Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہمدردی کا جذبہ",
              "english": "Spirit of Compassion"
            },
            "content": {
              "urdu": [
                "اسلام میں پڑوسی کے حقوق پر بہت زیادہ زور دیا گیا ہے، یہاں تک کہ اسے ایمان کی علامت قرار دیا گیا۔",
                "شوربے میں پانی بڑھانے کی ہدایت کا مقصد یہ ہے کہ تھوڑی چیز میں بھی برکت پیدا کر کے دوسروں کا بھلا کیا جائے۔",
                "یہ عمل معاشرے میں باہمی محبت اور اپنائیت کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Islam places immense emphasis on the rights of neighbors, making it a hallmark of faith.",
                "Increasing water in the broth signifies creating abundance in simple means to help others.",
                "This act fosters mutual love and a sense of belonging within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "عزتِ نفس کا تحفظ",
              "english": "Preserving Dignity"
            },
            "content": {
              "urdu": [
                "کھانے کی خوشبو پڑوسی کے گھر تک پہنچتی ہے، جس سے اس کے دل میں خواہش پیدا ہو سکتی ہے۔",
                "اگر ہم اسے کھانے میں شریک نہیں کرتے تو یہ اخلاقی طور پر نامناسب ہے۔",
                "ہدیہ بھیجنا خواہ وہ معمولی ہی کیوں نہ ہو، دلوں سے کینہ ختم کرتا ہے۔"
              ],
              "english": [
                "The aroma of food reaches the neighbor's house, which may trigger a desire for it.",
                "It is morally inappropriate not to share food when its fragrance is shared.",
                "Sending a gift, no matter how small, helps remove grudges from hearts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اثرات اور فوائد",
        "english": "Social Impact and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غربت کا احساس کم کرنا",
              "english": "Reducing the Sense of Poverty"
            },
            "content": {
              "urdu": [
                "یہ حدیث سکھاتی ہے کہ نیکی کے لیے بہت زیادہ مالدار ہونا ضروری نہیں ہے۔",
                "اپنے سادہ سے کھانے میں دوسروں کو یاد رکھنا سچی سخاوت ہے۔",
                "اس سے معاشرے کے غریب طبقے کو تنہائی اور محرومی کا احساس نہیں ہوتا۔"
              ],
              "english": [
                "This Hadith teaches that being wealthy is not a prerequisite for doing good.",
                "Remembering others in your simple meal is true generosity.",
                "This prevents the less fortunate members of society from feeling isolated or deprived."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی تعلقات میں بہتری",
              "english": "Improving Mutual Relations"
            },
            "content": {
              "urdu": [
                "روزانہ کی بنیاد پر ایک دوسرے کا خیال رکھنا دشمنیوں کو ختم کرتا ہے۔",
                "چھوٹی چھوٹی اشیاء کا تبادلہ بڑے سماجی جھگڑوں کا سدِ باب بنتا ہے۔",
                "نبی کریم ﷺ نے فرمایا: 'ہدیہ دیا کرو، اس سے محبت بڑھتی ہے۔'"
              ],
              "english": [
                "Looking after one another on a daily basis helps end animosities.",
                "Exchanging small items prevents larger social conflicts.",
                "The Prophet (ﷺ) said: 'Give gifts to each other, as it increases love.'"
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمتِ نبوی کا حسن",
        "english": "The Beauty of Prophetic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سہولت اور نیکی کا امتزاج",
              "english": "Combining Ease and Virtue"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے یہ نہیں فرمایا کہ گوشت زیادہ خریدو، بلکہ فرمایا کہ پانی بڑھا دو۔",
                "یہ اس بات کی دلیل ہے کہ اسلام بوجھ نہیں ڈالتا بلکہ نیت اور عمل کی ترغیب دیتا ہے۔",
                "پانی بڑھانے سے مقدار بڑھ جاتی ہے جس سے پڑوسی کی بھوک مٹائی جا سکتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) didn't say buy more meat; he said increase the water.",
                "This proves that Islam does not impose burdens but encourages intent and action.",
                "Increasing the quantity allows one to satisfy the neighbor's hunger without extra cost."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آج کے دور میں اطلاق",
              "english": "Modern Day Application"
            },
            "content": {
              "urdu": [
                "موجودہ دور میں جہاں ہم اپنی پرسکون زندگیوں میں مگن ہیں، پڑوسیوں کی خبر گیری ناگزیر ہے۔",
                "ہمیں معلوم ہونا چاہیے کہ کیا ہمارا پڑوسی بھوکا تو نہیں سو رہا؟",
                "نبی ﷺ نے فرمایا کہ وہ شخص مومن نہیں جو خود پیٹ بھر کر سوئے اور اس کا پڑوسی بھوکا ہو۔"
              ],
              "english": [
                "In an era where we are absorbed in our own lives, checking on neighbors is essential.",
                "We must know if our neighbor is going to bed hungry.",
                "The Prophet (ﷺ) said that he is not a believer who eats his fill while his neighbor is hungry."
              ]
            }
          }
        ]
      }
    }
  ]
}