{
  "hadithId": 414,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:896"],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "كتاب صلاة الاستسقاء",
    "babId": 26
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (896)‏، وأبو داود (1171)، والنسائي (1517)، وأحمد (12024).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام مسلم (896) نے روایت کیا ہے۔ اس کے علاوہ ابو داؤد، نسائی اور مسند احمد میں بھی یہ روایت موجود ہے جو کہ استسقاء میں ہاتھ اٹھانے کے خاص طریقے کو بیان کرتی ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim (896), Abu Dawud (1171), An-Nasa'i (1517), and Ahmad (12024)."
  },
  "importantWords": [
    {
      "arabic": "اسْتَسْقَى",
      "english": "Prayed for rain",
      "urdu": "بارش کی دعا کی"
    },
    {
      "arabic": "أَشَارَ",
      "english": "Pointed / Indicated",
      "urdu": "اشارہ کیا"
    },
    {
      "arabic": "بِظَهْرِ",
      "english": "With the back",
      "urdu": "پشت کے ساتھ"
    },
    {
      "arabic": "كَفَّيْهِ",
      "english": "His palms / hands",
      "urdu": "اپنی ہتھیلیاں"
    },
    {
      "arabic": "اَلسَّمَاءِ",
      "english": "The sky",
      "urdu": "آسمان"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نمازِ استسقاء کے دوران دعا کرنے کا ایک خاص طریقہ بتایا گیا ہے کہ مصیبت کو ٹالنے کے لیے ہاتھوں کی پشت آسمان کی طرف کی جائے۔",
    "english": "This Hadith describes a specific manner of supplication during the rain prayer, where the backs of the hands are turned toward the sky to signify the seeking of relief from calamity."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (896)",
      "english": "Sahih Muslim (896)"
    },
    {
      "arabic": "سنن أبي داود (1171)",
      "english": "Sunan Abu Dawud (1171)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik Al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Aof-r666X30",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا میں ہاتھوں کی کیفیت",
        "english": "Position of Hands in Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہتھیلیوں کی پشت اوپر کرنا",
              "english": "Back of Hands Upward"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے استسقاء کی دعا کے وقت ہاتھوں کی پشت آسمان کی طرف رکھی۔",
                "فقہاء کے نزدیک یہ طریقہ کسی بلا یا مصیبت کو ٹالنے کی دعا کے لیے مخصوص ہے۔",
                "عام خیر کی دعاؤں میں ہتھیلیاں آسمان کی طرف رکھنا سنت ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) kept the back of his hands toward the sky during Istisqa.",
                "Jurists state this manner is specific to seeking protection from calamities.",
                "In general supplications for goodness, keeping the palms upward is the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "عاجزی کا انتہا",
              "english": "Extreme Humility"
            },
            "content": {
              "urdu": [
                "اس طرح ہاتھ اٹھانا اللہ کے سامنے انتہائی محتاجی اور عاجزی کو ظاہر کرتا ہے۔",
                "نبی ﷺ اپنے ہاتھ اس قدر بلند کرتے کہ بغلوں کی سفیدی نظر آتی تھی۔",
                "یہ کیفیت اس بات کی علامت ہے کہ بندہ مکمل طور پر رب کا محتاج ہے۔"
              ],
              "english": [
                "Raising hands in this manner shows extreme dependency and humility before Allah.",
                "The Prophet (PBUH) raised his hands so high that his armpits became visible.",
                "This state signifies that the servant is completely dependent on his Lord."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کی تشریح",
        "english": "Juristic Interpretations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام شافعی اور اہل علم کی رائے",
              "english": "Opinion of Imam Shafi'i and Scholars"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک مصیبت کے وقت ہاتھوں کی پشت اوپر کرنا سنت ہے۔",
                "دیگر علماء کے نزدیک یہ بلند ہاتھوں کی اونچائی کی وجہ سے ایسا محسوس ہوا۔",
                "صحیح قول یہی ہے کہ یہ استسقاء کے باب میں ایک مستند مسنون طریقہ ہے۔"
              ],
              "english": [
                "Imam Shafi'i considers turning the back of the hands upward a Sunnah during distress.",
                "Other scholars argue it appeared so due to the extreme height of his hands.",
                "The correct view is that this is an authentic Sunnah method in the context of Istisqa."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسمان کی طرف اشارہ",
              "english": "Pointing Toward the Sky"
            },
            "content": {
              "urdu": [
                "آسمان کی طرف اشارہ کرنا اللہ تعالیٰ کی بلندی اور عظمت کا اعتراف ہے۔",
                "یہ قبلہِ دعا ہے جہاں سے رحمتوں اور بارش کا نزول ہوتا ہے۔",
                "مومن کا یقین ہے کہ تمام فیصلے آسمانوں سے ہی صادر ہوتے ہیں۔"
              ],
              "english": [
                "Pointing toward the sky acknowledges the loftiness and greatness of Allah.",
                "The sky is the Qiblah of supplication from where mercy and rain descend.",
                "A believer believes that all decrees are issued from the Heavens."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا استسقاء کی اہمیت",
        "english": "Importance of Istisqa Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قحط سالی کا خاتمہ",
              "english": "Ending the Drought"
            },
            "content": {
              "urdu": [
                "نمازِ استسقاء کا مقصد اجتماعی طور پر بارش کی دعا کرنا ہے۔",
                "نبی ﷺ کی سنت پر عمل کرنے سے ہی برکات کا حصول ممکن ہے۔",
                "جب زمین خشک ہو جائے تو رب کی طرف رجوع کرنا ہی واحد راستہ ہے۔"
              ],
              "english": [
                "The purpose of Istisqa is to collectively pray for the descent of rain.",
                "Obtaining blessings is only possible through following the Prophet's (PBUH) Sunnah.",
                "When the earth becomes parched, turning to the Lord is the only way out."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ اور گریہ و زاری",
              "english": "Repentance and Weeping"
            },
            "content": {
              "urdu": [
                "اس طرح کی دعا میں دل کی تڑپ اور گریہ و زاری مطلوب ہے۔",
                "ہاتھوں کی یہ خاص کیفیت گناہوں سے توبہ کی بھی علامت ہے۔",
                "اللہ تعالیٰ اپنے بندوں کی عاجزانہ پکار کو کبھی رد نہیں فرماتا۔"
              ],
              "english": [
                "In such supplications, a longing heart and sincere weeping are required.",
                "This specific hand position also symbolizes repentance from sins.",
                "Allah the Almighty never rejects the humble call of His servants."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشکل میں سنت کا سہارا",
              "english": "Sunnah as Support in Crisis"
            },
            "content": {
              "urdu": [
                "ہمیں ہر مشکل گھڑی میں مسنون دعاؤں اور طریقوں کو اپنانا چاہیے۔",
                "سنت کے مطابق کی گئی دعا جلد قبولیت کا درجہ پاتی ہے۔",
                "صحابہ کرام ہر عمل میں نبی ﷺ کی باریکیوں کی اتباع کرتے تھے۔"
              ],
              "english": [
                "We should adopt Sunnah supplications and methods in every hour of difficulty.",
                "A prayer performed according to the Sunnah reaches the status of acceptance faster.",
                "The Sahaba followed the subtle details of the Prophet's (PBUH) actions in everything."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان کی پختگی",
              "english": "Firmness of Faith"
            },
            "content": {
              "urdu": [
                "قدرتی آفات کو محض اتفاق نہ سمجھیں بلکہ اللہ کی یاد کا ذریعہ بنائیں۔",
                "اپنے بچوں کو ان مسنون طریقوں اور آدابِ دعا سے روشناس کرائیں۔",
                "اللہ کی رحمت سے کبھی مایوس نہیں ہونا چاہیے چاہے حالات کتنے ہی کٹھن ہوں۔"
              ],
              "english": [
                "Do not view natural disasters as coincidences; make them a means of remembering Allah.",
                "Introduce your children to these Sunnah methods and etiquettes of prayer.",
                "Never despair of Allah's mercy, no matter how difficult the circumstances."
              ]
            }
          }
        ]
      }
    }
  ]
}
