{
  "hadithId": 841,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/18"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (2469) ، وأبو داود (2096) ، وابن ماجه (1875) . والطرق يقوي بعضها بعضاً كما قال الحافظ ابن حجر في الفتح.",
    "urdu": "صحیح۔ اسے احمد (2469)، ابوداؤد (2096) اور ابن ماجہ (1875) نے روایت کیا ہے۔ اگرچہ بعض نے اسے مرسل کہا ہے، لیکن اس کے شواہد اسے تقویت دیتے ہیں جیسا کہ حافظ ابن حجر نے فتح الباری میں صراحت کی ہے۔",
    "english": "Sahih. Reported by Ahmad (2469), Abu Dawud (2096), and Ibn Majah (1875). Although some scholars mentioned a defect (Irsal), Ibn Hajar and others confirmed that its various chains strengthen one another."
  },
  "importantWords": [
    {
      "arabic": "جَارِيَةً",
      "english": "Girl / Young woman",
      "urdu": "لڑکی"
    },
    {
      "arabic": "بِكْرًا",
      "english": "Virgin",
      "urdu": "کنواری"
    },
    {
      "arabic": "كَارِهَةٌ",
      "english": "Unwilling / Disliking",
      "urdu": "ناپسند کرنے والی"
    },
    {
      "arabic": "فَخَيَّرَهَا",
      "english": "Gave her the choice",
      "urdu": "اسے اختیار دے دیا"
    },
    {
      "arabic": "زَوَّجَهَا",
      "english": "Married her off",
      "urdu": "اس کا نکاح کر دیا"
    }
  ],
  "summary": {
    "urdu": "اسلام میں ولی کو یہ حق حاصل نہیں کہ وہ کسی بالغ لڑکی کا نکاح اس کی مرضی کے خلاف زبردستی کرے۔ ایسی صورت میں لڑکی کو نکاح فسخ کرنے کا حق حاصل ہے۔",
    "english": "In Islam, a guardian does not have the right to force an adult girl into marriage against her will. If forced, she has the legal right to annul the marriage."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2096)",
      "english": "Sunan Abi Dawud (2096)"
    },
    {
      "arabic": "سنن ابن ماجه (1875)",
      "english": "Sunan Ibn Majah (1875)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R6u_D7uLz_E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رضامندی کی اہمیت",
        "english": "Importance of Consent"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبردستی کے نکاح کی ممانعت",
              "english": "Prohibition of Forced Marriage"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے اس لڑکی کو اختیار دے کر واضح کیا کہ جبر کا نکاح غیر شرعی ہے۔",
                "باپ کو بھی یہ حق حاصل نہیں کہ وہ بیٹی کی مرضی کو کچل کر رشتہ طے کرے۔",
                "نکاح کے لیے دل کا راضی ہونا اور باہمی پسندیدگی اسلامی قانون کی بنیاد ہے۔"
              ],
              "english": [
                "By giving the girl a choice, the Prophet (ﷺ) showed that forced marriage is un-Islamic.",
                "Even a father does not have the right to ignore his daughter's will in marriage.",
                "Mutual consent and individual satisfaction are the foundations of Islamic marriage law."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کے قانونی حقوق",
              "english": "Legal Rights of Women"
            },
            "content": {
              "urdu": [
                "اسلام نے عورت کو وہ مقام دیا ہے کہ وہ اپنے حق کے لیے اعلیٰ ترین عدالت سے رجوع کر سکتی ہے۔",
                "اگر نکاح زبردستی ہوا ہو تو اسے قائم رکھنا یا ختم کرنا خالصتاً لڑکی کا فیصلہ ہے۔",
                "یہ حدیث دورِ جاہلیت کے ان مظالم کا خاتمہ کرتی ہے جہاں عورتوں کو بھیڑ بکریوں کی طرح بیاہا جاتا تھا۔"
              ],
              "english": [
                "Islam empowers women to seek justice from the highest authorities regarding their rights.",
                "In cases of forced marriage, the final decision to stay or leave belongs solely to the girl.",
                "This Hadith abolished pre-Islamic injustices where women were married off like property."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ولی کی حدود",
        "english": "Boundaries for the Guardian"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولی کی ذمہ داری",
              "english": "Responsibility of the Wali"
            },
            "content": {
              "urdu": [
                "ولی کا کام لڑکی کا خیر خواہ بن کر اس کی زندگی کے لیے بہترین انتخاب میں مدد کرنا ہے۔",
                "سرپرست کو چاہیے کہ وہ اپنی اتھارٹی کو ظلم اور زیادتی کے لیے استعمال نہ کرے۔",
                "لڑکی کی ناپسندیدگی کے باوجود نکاح کرنا باپ کے منصب کے خلاف ہے۔"
              ],
              "english": [
                "The guardian's role is to act as a well-wisher and help select the best partner for her.",
                "A protector must not use his authority as a means of oppression or coercion.",
                "Proceeding with a marriage despite her clear dislike violates the guardian's duty."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشاورت کا حکم",
              "english": "Command for Consultation"
            },
            "content": {
              "urdu": [
                "والدین کو چاہیے کہ وہ بچوں کے رشتے طے کرتے وقت ان سے کھلم کھلا بات کریں۔",
                "صرف سماجی دباؤ یا برادری کی خاطر بچوں پر اپنی مرضی مسلط نہیں کرنی چاہیے۔",
                "مشاورت کے نتیجے میں ہونے والا نکاح ہی پائیدار اور بابرکت ثابت ہوتا ہے۔"
              ],
              "english": [
                "Parents should communicate openly with their children when discussing marriage proposals.",
                "One should not impose their will on children merely due to social or tribal pressures.",
                "A marriage resulting from mutual consultation is more likely to be lasting and blessed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فسخِ نکاح کا حق",
        "english": "Right to Annulment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کا ٹوٹ جانا",
              "english": "Invalidation of the Contract"
            },
            "content": {
              "urdu": [
                "جب لڑکی نے ناپسندیدگی ظاہر کی تو آپ ﷺ نے اسے نکاح ختم کرنے کا قانونی اختیار دیا۔",
                "ایسی صورت میں نکاح خود بخود باطل نہیں ہوتا بلکہ لڑکی کے اختیار (خیار) پر منحصر ہے۔",
                "اگر لڑکی خاموشی سے اسے قبول کر لے تو وہ نافذ ہو جاتا ہے، ورنہ ختم ہو جاتا ہے۔"
              ],
              "english": [
                "When the girl expressed dislike, the Prophet (ﷺ) gave her the legal right to dissolve it.",
                "Such a marriage is not automatically void but depends on the girl's choice (Khiyar).",
                "If the girl later accepts it silently, it proceeds; otherwise, it is annulled."
              ]
            }
          },
          {
            "title": {
              "urdu": "انصاف کی فراہمی",
              "english": "Provision of Justice"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس لڑکی کی فریاد سن کر معاشرے کو ایک بہت بڑا عملی سبق دیا۔",
                "حکمرانوں اور قاضیوں کی ذمہ داری ہے کہ وہ ایسے معاملات میں لڑکی کی حمایت کریں۔",
                "ظلم کے خلاف کھڑا ہونا اور مظلوم کی داد رسی کرنا عین سنتِ نبوی ہے۔"
              ],
              "english": [
                "By hearing the girl's plea, the Prophet (ﷺ) gave a profound practical lesson to society.",
                "It is the duty of leaders and judges to support the girl's rights in such cases.",
                "Standing against oppression and helping the aggrieved is the true essence of the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیٹیوں کی تعلیم و تربیت",
              "english": "Upbringing of Daughters"
            },
            "content": {
              "urdu": [
                "بیٹیوں کو ان کے شرعی حقوق سے آگاہ کرنا والدین کی ذمہ داری ہے۔",
                "نکاح جیسے حساس معاملے میں لڑکی کی خاموشی کو ہمیشہ ہاں نہیں سمجھنا چاہیے۔",
                "والدین کو بچوں کے ساتھ ایسا تعلق رکھنا چاہیے کہ وہ اپنی بات بلا جھجھک کہہ سکیں۔"
              ],
              "english": [
                "It is the responsibility of parents to educate daughters about their Sharia rights.",
                "In the sensitive matter of marriage, a girl's silence should not always be taken as consent.",
                "Parents must maintain a relationship where children can speak their minds without fear."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی معاشرے کی پہچان",
              "english": "Hallmark of Islamic Society"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرہ وہ ہے جہاں کسی پر جبر نہ کیا جائے، خاص کر گھریلو معاملات میں۔",
                "سنتِ نبوی ﷺ پر عمل کرنے سے ہی خاندانوں میں سکون اور محبت قائم ہوتی ہے۔",
                "ہمیں فرسودہ رسومات کو چھوڑ کر نبی کریم ﷺ کے روشن فیصلوں کو اپنانا چاہیے۔"
              ],
              "english": [
                "An Islamic society is one where no one is coerced, especially in domestic affairs.",
                "Following the Sunnah of the Prophet (ﷺ) brings peace and love to families.",
                "We must discard obsolete traditions and adopt the enlightened rulings of the Messenger (ﷺ)."
              ]
            }
          }
        ]
      }
    }
  ]
}