{
  "hadithId": 559,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/559"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1141). وأخرجه أحمد (20722)، وأبو داود (2418) بنحوه.",
    "urdu": "صحیح۔ اسے مسلم (1141) نے روایت کیا ہے۔ اس میں اللہ کے ذکر کے ساتھ کھانے پینے کی رخصت بیان کی گئی ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (1141). Also reported by Ahmad and Abu Dawud with similar wordings."
  },
  "importantWords": [
    {
      "arabic": "أَيَّامُ اَلتَّشْرِيقِ",
      "english": "Days of Tashriq",
      "urdu": "ایامِ تشریق"
    },
    {
      "arabic": "أَكْلٍ",
      "english": "Eating",
      "urdu": "کھانا"
    },
    {
      "arabic": "شُرْبٍ",
      "english": "Drinking",
      "urdu": "پینا"
    },
    {
      "arabic": "ذِكْرٍ",
      "english": "Remembrance",
      "urdu": "ذکر / یاد الٰہی"
    },
    {
      "arabic": "عَزَّ وَجَلَّ",
      "english": "Mighty and Majestic",
      "urdu": "غالب اور بزرگ"
    }
  ],
  "summary": {
    "urdu": "عید الاضحیٰ کے بعد کے تین دن (11، 12، 13 ذوالحجہ) خوشی منانے، کھانے پینے اور کثرت سے اللہ کا ذکر کرنے کے دن ہیں، ان میں روزہ رکھنا منع ہے۔",
    "english": "The three days following Eid al-Adha are for celebration, eating, drinking, and remembering Allah; fasting is prohibited during these days."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1141)",
      "english": "Reported by Muslim (1141)"
    },
    {
      "arabic": "رواه أحمد (20722)",
      "english": "Reported by Ahmad (20722)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "نبيشة الهذلي",
        "english": "Nubaishah al-Hudhali"
      },
      "slug": "nubaishah-al-hudhali"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYI7H7_nO6o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایامِ تشریق کی تعریف اور اہمیت",
        "english": "Definition and Importance of Tashriq Days"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایامِ تشریق سے کیا مراد ہے؟",
              "english": "What are the days of Tashriq?"
            },
            "content": {
              "urdu": [
                "ذوالحجہ کی گیارہ، بارہ اور تیرہ تاریخ کو ایامِ تشریق کہا جاتا ہے۔",
                "لفظ 'تشریق' کا مطلب گوشت کو دھوپ میں خشک کرنا ہے، کیونکہ پرانے زمانے میں ان دنوں میں قربانی کا گوشت خشک کیا جاتا تھا۔",
                "یہ دن حج کے مناسک اور قربانی کی خوشیوں کے تسلسل کا حصہ ہیں۔"
              ],
              "english": [
                "The 11th, 12th, and 13th of Dhul-Hijjah are known as the days of Tashriq.",
                "The word 'Tashriq' refers to drying meat in the sun, a practice common during these days in ancient times.",
                "These days are an extension of the Hajj rituals and the joys of sacrifice."
              ]
            }
          },
          {
            "title": {
              "urdu": "روزے کی ممانعت",
              "english": "Prohibition of Fasting"
            },
            "content": {
              "urdu": [
                "ان ایام میں روزہ رکھنا حرام ہے کیونکہ یہ اللہ کی طرف سے ضیافت کے دن ہیں۔",
                "نبی ﷺ نے ان دنوں میں روزہ رکھنے سے سختی سے منع فرمایا ہے۔",
                "صرف ان حاجیوں کو رخصت ہے جن کے پاس قربانی میسر نہ ہو اور وہ حجِ تمتع یا قران کر رہے ہوں۔"
              ],
              "english": [
                "Fasting is forbidden during these days as they are days of hospitality from Allah.",
                "The Prophet (ﷺ) strictly prohibited fasting during this specific period.",
                "An exception is only for pilgrims who cannot find a sacrificial animal while performing Hajj Tamattu' or Qiran."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور جسمانی توازن",
        "english": "Spiritual and Physical Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے پینے کا مقصد",
              "english": "Purpose of Eating and Drinking"
            },
            "content": {
              "urdu": [
                "اسلام میں جائز خوشی اور طیب رزق سے لطف اندوز ہونا عبادت کا حصہ ہے۔",
                "کھانے پینے کا مقصد جسم کو توانائی فراہم کرنا ہے تاکہ اللہ کی بہتر بندگی کی جا سکے۔",
                "یہ دن عید کی خوشیوں کو بانٹنے اور رشتہ داروں کی پزیرائی کے لیے مختص ہیں۔"
              ],
              "english": [
                "Enjoying permissible joy and pure sustenance is part of worship in Islam.",
                "The purpose of eating and drinking is to energize the body for better service to Allah.",
                "These days are dedicated to sharing Eid joys and hosting relatives."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذکرِ الٰہی کی اہمیت",
              "english": "Importance of Remembering Allah"
            },
            "content": {
              "urdu": [
                "خوشی کے لمحات میں اللہ کو یاد رکھنا غفلت سے بچاتا ہے۔",
                "ان دنوں میں تکبیراتِ تشریق پڑھنا اور نمازوں کے بعد اللہ کی بڑائی بیان کرنا مسنون ہے۔",
                "یہ اس بات کی تربیت ہے کہ مومن خوشی اور غم دونوں حال میں اللہ کو نہیں بھولتا۔"
              ],
              "english": [
                "Remembering Allah during moments of joy prevents heedlessness.",
                "Reciting the Takbirat of Tashriq after prayers is a Sunnah during these days.",
                "It trains the believer to never forget Allah in both happiness and sorrow."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور مسائل",
        "english": "Juristic Rulings and Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکبیراتِ تشریق کا وقت",
              "english": "Timing of Takbirat al-Tashriq"
            },
            "content": {
              "urdu": [
                "9 ذوالحجہ کی فجر سے 13 ذوالحجہ کی عصر تک تکبیرات پڑھنا واجب ہے۔",
                "ہر فرض نماز کے بعد بلند آواز سے اللہ کی توحید و بڑائی بیان کرنی چاہیے۔",
                "یہ عمل امتِ مسلمہ کی وحدت اور شعائرِ اسلام کی تعظیم کا مظہر ہے۔"
              ],
              "english": [
                "Reciting Takbirat is mandatory from the Fajr of 9th Dhul-Hijjah to the Asr of 13th.",
                "Allah's Oneness and Greatness should be proclaimed loudly after every obligatory prayer.",
                "This act reflects the unity of the Ummah and respect for the symbols of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "قربانی کے ایام",
              "english": "Days of Sacrifice"
            },
            "content": {
              "urdu": [
                "ایامِ تشریق کے آخری دن یعنی 13 ذوالحجہ کے غروبِ آفتاب تک قربانی کی جا سکتی ہے۔",
                "یہ ان لوگوں کے لیے وسعت ہے جو عید کے پہلے یا دوسرے دن قربانی نہیں کر سکے۔",
                "اسلامی شریعت نے عبادات کی ادائیگی میں وقت کی گنجائش فراہم کی ہے۔"
              ],
              "english": [
                "Sacrifice can be performed until sunset on the last day of Tashriq (13th Dhul-Hijjah).",
                "This provides flexibility for those unable to sacrifice on the first or second day of Eid.",
                "Islamic Shariah offers a window of time for the performance of major acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال اور شکر گزاری",
              "english": "Moderation and Gratitude"
            },
            "content": {
              "urdu": [
                "کھانے پینے میں اسراف اور فضول خرچی سے بچنا چاہیے۔",
                "نعمتوں کا شکر زبان سے ذکر اور عمل سے اطاعت کے ذریعے کرنا چاہیے۔",
                "غریبوں اور مسکینوں کو اپنی خوشیوں میں شامل کرنا بہترین ذکر ہے۔"
              ],
              "english": [
                "Avoid extravagance and waste while eating and drinking.",
                "Gratitude for blessings should be expressed through verbal remembrance and physical obedience.",
                "Including the poor and needy in your celebrations is the best form of remembrance."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی ہمدردی",
              "english": "Social Empathy"
            },
            "content": {
              "urdu": [
                "ان ایام میں گوشت کی تقسیم سے معاشرے میں محبت اور بھائی چارہ بڑھتا ہے۔",
                "ایک دوسرے کی دعوت کرنا اور خوشیاں بانٹنا سنتِ نبوی ہے۔",
                "دینِ اسلام صرف انفرادی نہیں بلکہ اجتماعی فلاح کا دین ہے۔"
              ],
              "english": [
                "Distributing meat during these days increases love and brotherhood in society.",
                "Inviting one another and sharing joy is a Prophetic Sunnah.",
                "Islam is a religion of collective welfare, not just individual piety."
              ]
            }
          }
        ]
      }
    }
  ]
}