{
  "hadithId": 1346,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/116"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "حسن. رواه الترمذي (484)، وابن حبان (911). وقال الترمذي: هذا حديث حسن غريب. وصححه الألباني لغيره في صحيح الترغيب (1668).",
    "urdu": "حسن۔ اسے امام ترمذی (484) اور ابن حبان (911) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن غریب کہا ہے، اور علامہ البانی نے دیگر شواہد کی بنا پر اسے صحیح لغیرہ قرار دیا ہے۔",
    "english": "Hasan. Reported by At-Tirmidhi (484) and Ibn Hibban (911). At-Tirmidhi graded it Hasan Gharib. It was graded Sahih lighairihi by Al-Albani in Sahih at-Targhib (1668)."
  },
  "importantWords": [
    {
      "arabic": "أَوْلَى",
      "english": "Closest / Worthiest",
      "urdu": "سب سے زیادہ قریب / سب سے زیادہ حقدار"
    },
    {
      "arabic": "أَكْثَرُهُمْ",
      "english": "Most of them / One who does most",
      "urdu": "ان میں سے سب سے زیادہ"
    },
    {
      "arabic": "صَلَاةً",
      "english": "Blessings / Prayers",
      "urdu": "درود / رحمت کی دعا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث درود شریف کی غیر معمولی فضیلت بیان کرتی ہے کہ کثرت سے درود پڑھنا قیامت کی ہولناکیوں میں نبی کریم ﷺ کی قربت اور شفاعت حاصل کرنے کا بہترین ذریعہ ہے۔",
    "english": "This Hadith highlights the extraordinary merit of sending blessings upon the Prophet (ﷺ), stating that frequent recitation is the best way to attain his proximity and intercession on the Day of Judgment."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب الوتر، باب ما جاء في فضل الصلاة على النبي، رقم 484",
      "english": "Sunan at-Tirmidhi, Book of Witr, No. 484"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کی قربت کا معیار",
        "english": "Standard of Proximity to the Prophet (ﷺ)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قربت سے کیا مراد ہے؟",
              "english": "What is meant by Proximity?"
            },
            "content": {
              "urdu": [
                "قیامت کے دن کی قربت سے مراد مقامِ محمود پر آپ ﷺ کے ساتھ ہونا، آپ کی شفاعت کا مستحق بننا اور جنت میں آپ کی رفاقت پانا ہے۔",
                "یہ قربت صرف حسب و نسب سے نہیں بلکہ نبی ﷺ کے ساتھ تعلق اور آپ کی تعلیمات سے محبت کے نتیجے میں ملتی ہے۔",
                "درود شریف اس محبت کا اظہار اور تعلق کو مضبوط کرنے کا وظیفہ ہے۔"
              ],
              "english": [
                "Proximity on the Day of Resurrection means being with the Prophet (ﷺ) at the Praiseworthy Station (Maqam al-Mahmud), deserving his intercession, and attaining his companionship in Paradise.",
                "This closeness is not based on lineage but on one's bond with the Prophet (ﷺ) and love for his teachings.",
                "Sending blessings is an expression of that love and a means to strengthen that bond."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "درود شریف کے فضائل و برکات",
        "english": "Virtues and Blessings of sending Salat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کثرتِ درود کے فوائد",
              "english": "Benefits of Frequent Blessings"
            },
            "content": {
              "urdu": [
                "ایک بار درود پڑھنے پر اللہ تعالیٰ بندے پر دس رحمتیں نازل فرماتا ہے اور اس کے دس گناہ مٹاتا ہے۔",
                "درود شریف دعاؤں کی قبولیت کا ذریعہ ہے؛ جو دعا درود کے ساتھ مانگی جائے وہ رد نہیں ہوتی۔",
                "یہ عمل انسان کی پریشانیوں کو ختم کرتا ہے اور گناہوں کی بخشش کا باعث بنتا ہے۔"
              ],
              "english": [
                "For every single blessing sent, Allah sends ten mercies upon the servant and erases ten of their sins.",
                "Salat upon the Prophet is a means for the acceptance of supplications; a Dua wrapped in blessings is not rejected.",
                "This practice removes anxieties and serves as a cause for the forgiveness of sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محدثین اور علماء کا ذوق",
        "english": "The Passion of Scholars and Muhaddithin"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ حدیث کا خاص مقام",
              "english": "Special Rank of the People of Hadith"
            },
            "content": {
              "urdu": [
                "علماء کا کہنا ہے کہ اس حدیث کے سب سے زیادہ مصداق وہ محدثین ہیں جو دن رات حدیثیں لکھتے اور پڑھتے وقت نبی ﷺ پر درود بھیجتے ہیں۔",
                "ایک طالبِ علم جب حدیث پڑھتا ہے تو وہ بار بار آپ ﷺ کا نام لیتا ہے اور درود پڑھتا ہے، جو اسے اس فضیلت کا حقدار بناتا ہے۔",
                "عام مسلمانوں کو بھی چاہیے کہ وہ اٹھتے بیٹھتے درود کو اپنا وظیفہ بنائیں۔"
              ],
              "english": [
                "Scholars state that this Hadith most aptly applies to the Muhaddithin (scholars of Hadith) who send blessings upon the Prophet (ﷺ) day and night while writing and studying.",
                "A student of knowledge repeatedly mentions and blesses the Prophet (ﷺ) while reading Hadith, making them worthy of this virtue.",
                "Common Muslims should also strive to make sending blessings a constant part of their daily routine."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محبت کا عملی ثبوت",
              "english": "Practical Proof of Love"
            },
            "content": {
              "urdu": [
                "درود پڑھنا نبی ﷺ سے سچی محبت کی علامت ہے، اور جس سے محبت ہوتی ہے اس کا ذکر کثرت سے کیا جاتا ہے۔",
                "خصوصاً جمعہ کے دن اور رات میں کثرت سے درود پڑھنے کی تاکید کی گئی ہے۔",
                "حقیقی کامیابی یہ ہے کہ انسان کا نام ان لوگوں کی فہرست میں شامل ہو جائے جن سے نبی ﷺ قیامت کے دن خوش ہوں گے۔"
              ],
              "english": [
                "Reciting Salat is a sign of true love for the Prophet (ﷺ); one naturally mentions the one they love frequently.",
                "Special emphasis is placed on sending blessings abundantly on Friday and its preceding night.",
                "True success is having one's name included in the list of those with whom the Prophet (ﷺ) will be pleased on the Day of Judgment."
              ]
            }
          }
        ]
      }
    }
  ]
}