{
  "hadithId": 762,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/762"],
    "kitabId": 7,
    "inKitabBab": 13,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 54
  },
 
  "takhreej": {
    "arabic": "ضعيف.‏ رواه النسائي في الكبرى، وأبو داود (3517)، والترمذي (1368) من طريق قتادة عن الحسن عن سمرة. والعلة في إسناده عنعنة قتادة والحسن البصري، وكلاهما مدلسان.",
    "urdu": "ضعیف۔ اسے نسائی، ابو داؤد (3517) اور ترمذی (1368) نے روایت کیا ہے۔ ابن حبان نے اسے صحیح کہا، مگر محققین کے نزدیک اس میں 'علت' (کمزوری) ہے کیونکہ قتادہ اور حسن بصری دونوں مدلس ہیں اور سماع کی تصریح نہیں ہے۔",
    "english": "Da'if (Weak). Reported by An-Nasa'i, Abu Dawud (3517), and At-Tirmidhi (1368). Although Ibn Hibban graded it Sahih, it has a defect because Qatadah and Al-Hasan Al-Basri did not explicitly state they heard it directly (Tadlis)."
  },
  "importantWords": [
    {
      "arabic": "جَارُ",
      "english": "Neighbor",
      "urdu": "ہمسایہ"
    },
    {
      "arabic": "اَلدَّارِ",
      "english": "The House",
      "urdu": "گھر / مکان"
    },
    {
      "arabic": "أَحَقُّ",
      "english": "More deserving",
      "urdu": "زیادہ حقدار"
    },
    {
      "arabic": "عِلَّةٌ",
      "english": "Hidden defect",
      "urdu": "خفیہ کمزوری"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "Authenticated it",
      "urdu": "اسے صحیح قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث پڑوسی کے حقِ شفعہ کو بیان کرتی ہے، جس کا مطلب ہے کہ گھر فروخت کرتے وقت قریبی پڑوسی کو خریداری میں فوقیت دینی چاہیے، اگرچہ اس کی سند میں علمی بحث موجود ہے۔",
    "english": "This Hadith emphasizes the right of pre-emption for the neighbor of a house, suggesting they have priority in purchasing it, despite scholarly discussions on the chain's strength."
  },
  "references": [
    {
      "arabic": "رواه النسائي (3267)",
      "english": "Reported by An-Nasa'i (3267)"
    },
    {
      "arabic": "رواه ابن حبان (1153)",
      "english": "Reported by Ibn Hibban (1153)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی قانونی حیثیت",
        "english": "Legal Standing of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفعہ برائے پڑوسی",
              "english": "Pre-emption for the Neighbor"
            },
            "content": {
              "urdu": [
                "اس حدیث سے استدلال کیا جاتا ہے کہ پڑوسی کو شفعہ کا حق حاصل ہے۔",
                "احناف کے نزدیک یہ حدیث اس بات کی دلیل ہے کہ محض پڑوسی ہونا بھی شفعہ کے لیے کافی ہے۔",
                "دیگر ائمہ کے نزدیک یہ حق صرف مشترکہ جائیداد کے شریک کے لیے محدود ہے۔"
              ],
              "english": [
                "This Hadith is used to argue that a neighbor possesses the right of pre-emption.",
                "In the Hanafi school, this serves as evidence that being a neighbor is sufficient for Shuf'a.",
                "Other Imams restrict this right only to actual co-owners of the property."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث کی سند میں 'علت'",
              "english": "The Defect in the Chain"
            },
            "content": {
              "urdu": [
                "امام ابن حجر نے اشارہ کیا کہ اس حدیث میں فنی اعتبار سے کمزوری ہے۔",
                "قتادہ اور حسن بصری کے درمیان سماع کا مسئلہ اسے ضعیف بنا دیتا ہے۔",
                "تاہم اس کے مفہوم کی تائید دیگر صحیح احادیث سے ہوتی ہے۔"
              ],
              "english": [
                "Ibn Hajar pointed out that there is a technical weakness in this narration.",
                "The disconnection between Qatadah and Hasan Al-Basri leads to its classification as Da'if.",
                "However, the general meaning is supported by other authentic narrations on neighborly rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پڑوسی کو ترجیح دینے کی حکمت",
        "english": "Wisdom of Prioritizing Neighbors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجنبی سے تحفظ",
              "english": "Protection from Strangers"
            },
            "content": {
              "urdu": [
                "پڑوسی کو ترجیح دینے سے جائیداد کی تقسیم میں آسانی رہتی ہے۔",
                "اس سے نامناسب افراد کے پڑوس میں آنے کا خطرہ کم ہو جاتا ہے۔",
                "اسلامی معاشرت میں پڑوسی کا سکون جائیداد کی قدر سے زیادہ اہم ہے۔"
              ],
              "english": [
                "Prioritizing the neighbor makes property management and transition easier.",
                "It reduces the risk of unsuitable individuals moving into the neighborhood.",
                "In Islamic society, a neighbor's peace is more valued than the property's market price."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی خیر خواہی",
              "english": "Mutual Goodwill"
            },
            "content": {
              "urdu": [
                "پڑوسی کو فروخت کی پیشکش کرنا حسنِ سلوک کی اعلیٰ مثال ہے۔",
                "یہ عمل لڑائی جھگڑوں اور قانونی تنازعات کے دروازے بند کرتا ہے۔",
                "حقِ شفعہ دراصل پڑوسی کے حقوق کی ایک قانونی شکل ہے۔"
              ],
              "english": [
                "Offering the property to a neighbor first is a sign of excellent character.",
                "This practice closes the door to disputes and legal conflicts.",
                "The right of pre-emption is effectively a legal manifestation of neighborly rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اطلاق اور مروجہ عمل",
        "english": "Juristic Application and Custom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفعہ کب ختم ہوتا ہے؟",
              "english": "When does Shuf'a End?"
            },
            "content": {
              "urdu": [
                "اگر پڑوسی خریداری سے معذرت کر لے تو یہ حق ختم ہو جاتا ہے۔",
                "پڑوسی کو ایک مناسب وقت دیا جاتا ہے تاکہ وہ فیصلہ کر سکے۔",
                "تقسیم مکمل ہونے اور حدود واضح ہونے کے بعد اکثر فقہاء اسے ختم مانتے ہیں۔"
              ],
              "english": [
                "The right of pre-emption ends if the neighbor declines the purchase.",
                "The neighbor is usually given a reasonable amount of time to make a decision.",
                "Most jurists agree the right ends once boundaries are clearly fixed and separated."
              ]
            }
          },
          {
            "title": {
              "urdu": "پڑوسی کی رضا مندی",
              "english": "Consent of the Neighbor"
            },
            "content": {
              "urdu": [
                "بیچنے والے کو چاہیے کہ وہ پڑوسی کو اعتماد میں لے کر فروخت کرے۔",
                "خفیہ فروخت سے پڑوسیوں کے درمیان تلخی پیدا ہوتی ہے۔",
                "اسلامی شریعت میں معاشرتی اتحاد کو انفرادی منافع پر فوقیت حاصل ہے۔"
              ],
              "english": [
                "The seller should take the neighbor into confidence before proceeding with the sale.",
                "Secret sales often lead to bitterness and broken ties between neighbors.",
                "In Islamic Law, social unity takes precedence over individual profit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاملات میں نرمی",
              "english": "Leniency in Transactions"
            },
            "content": {
              "urdu": [
                "لین دین میں پڑوسی کا خیال رکھنا تقویٰ کی علامت ہے۔",
                "کم قیمت پر بھی پڑوسی کو دینا بڑی برکت کا باعث بنتا ہے۔",
                "رسول اللہ ﷺ نے معاملات میں نرمی برتنے والوں کے لیے دعا فرمائی ہے۔"
              ],
              "english": [
                "Considering a neighbor's situation during transactions is a sign of piety.",
                "Selling to a neighbor even at a slightly lower price brings great blessings.",
                "The Messenger of Allah (ﷺ) prayed for those who are lenient in their dealings."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہمسایہ داری کی اہمیت",
              "english": "Significance of Neighborliness"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں یاد دلاتی ہے کہ پڑوسی کے حقوق صرف اخلاقی نہیں بلکہ قانونی بھی ہیں۔",
                "پڑوسی کے ساتھ حسنِ سلوک ایمان کا حصہ ہے۔",
                "جائیداد کے معاملات میں دیانتداری سے برکت پیدا ہوتی ہے۔"
              ],
              "english": [
                "This Hadith reminds us that neighborly rights are legal as well as moral.",
                "Treating neighbors with excellence is fundamentally a part of faith.",
                "Honesty in property dealings is a source of divine blessing in one's wealth."
              ]
            }
          }
        ]
      }
    }
  ]
}