{
  "hadithId": 1352,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/120"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "حسن.‏ رواه أبو داود (5068)‏، والترمذي (3391)‏، والنسائي في عمل اليوم والليلة (564)‏، وابن ماجه (3868).‏ وصححه الألباني.",
    "urdu": "صحیح۔ اسے اصحابِ سنن اربعہ نے روایت کیا ہے۔ امام ترمذی نے اسے حسن کہا ہے جبکہ علامہ البانی نے اسے صحیح قرار دیا ہے۔ یہ صبح و شام کے مسنون اذکار میں سے ایک اہم دعا ہے۔",
    "english": "Hasan/Sahih. Reported by the four (Abu Dawud, At-Tirmidhi, An-Nasa'i, and Ibn Majah). Graded Sahih by Al-Albani. It is one of the essential prescribed morning and evening supplications."
  },
  "importantWords": [
    {
      "arabic": "بِكَ",
      "english": "By You / Through Your help",
      "urdu": "تیرے ذریعے / تیرے حکم سے"
    },
    {
      "arabic": "أَصْبَحْنَا",
      "english": "We entered the morning",
      "urdu": "ہم نے صبح کی"
    },
    {
      "arabic": "اَلنُّشُورُ",
      "english": "The Resurrection",
      "urdu": "دوبارہ جی اٹھنا"
    },
    {
      "arabic": "اَلْمَصِيرُ",
      "english": "Final return / Destination",
      "urdu": "لوٹ کر جانا / ٹھکانا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ نے صبح اور شام کے اوقات میں اللہ تعالیٰ کی ربوبیت کے اقرار اور زندگی و موت کے اللہ کے قبضے میں ہونے کی دعا سکھائی ہے، جو بندے کے توکل کو مضبوط کرتی ہے۔",
    "english": "In this Hadith, the Prophet (ﷺ) taught a supplication for mornings and evenings to acknowledge Allah's Lordship and that life, death, and the final return are all in His hands, strengthening a believer's trust in Him."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب الدعوات، رقم 3391",
      "english": "Sunan at-Tirmidhi, Book of Supplications, No. 3391"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اللہ کی قدرت کا اعتراف",
        "english": "Acknowledging Allah's Power"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی تبدیلی اور ربوبیت",
              "english": "Change of Time and Lordship"
            },
            "content": {
              "urdu": [
                "صبح اور شام کا ہونا اللہ کی نشانیوں میں سے ہے؛ اس دعا کے ذریعے بندہ اعتراف کرتا ہے کہ یہ اوقات اللہ کی مشیت ہی سے بدلتے ہیں۔",
                "یہ الفاظ انسان کو یاد دلاتے ہیں کہ ہر نیا دن اور ہر نئی رات اللہ کی طرف سے عطا کردہ مہلت ہے۔",
                "مسلمان اپنے دن کا آغاز اور اختتام اللہ کے نام اور اس پر بھروسے کے ساتھ کرتا ہے۔"
              ],
              "english": [
                "The arrival of morning and evening are signs of Allah; through this Dua, a servant acknowledges that these times change only by Allah's will.",
                "These words remind a person that every new day and night is a respite granted by Allah.",
                "A Muslim begins and ends their day with Allah's name and trust in Him."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زندگی اور موت کا تصور",
        "english": "The Concept of Life and Death"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بندگی کا اظہار",
              "english": "Expression of Servitude"
            },
            "content": {
              "urdu": [
                "'تیرے ہی ذریعے جیتے اور مرتے ہیں' کا مطلب یہ ہے کہ حیات و موت کے تمام اسباب اللہ ہی کے قبضے میں ہیں۔",
                "یہ دعا بندے کے دل میں اللہ کی عظمت بٹھاتی ہے کہ وہ لمحہ بھر کے لیے بھی اپنے رب سے بے نیاز نہیں ہو سکتا۔",
                "نیند کو 'چھوٹی موت' کہا جاتا ہے، لہذا جاگنے پر صبح کی دعا اور سونے سے پہلے شام کی دعا اس حقیقت کی یاد دہانی ہے۔"
              ],
              "english": [
                "'By You we live and die' means all causes of life and death are under Allah's control.",
                "This supplication instills Allah's greatness in the heart, showing that a servant cannot be independent of their Lord for even a moment.",
                "Sleep is called the 'lesser death,' so the morning prayer upon waking and the evening prayer before sleeping remind us of this reality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نشور اور مصیر میں فرق",
        "english": "Difference between Nushur and Masir"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظی اور معنوی حکمت",
              "english": "Linguistic and Spiritual Wisdom"
            },
            "content": {
              "urdu": [
                "صبح کے وقت 'النشور' (دوبارہ اٹھنا) کا لفظ استعمال ہوا کیونکہ نیند سے بیدار ہونا قبروں سے جی اٹھنے کے مشابہ ہے۔",
                "شام کے وقت 'المصیر' (ٹھکانا/پلٹنا) کا لفظ استعمال ہوا کیونکہ دن بھر کے کاموں کے بعد انسان اپنے گھر پلٹتا ہے، جو آخرت کی واپسی کی یاد دلاتا ہے۔",
                "یہ الفاظ انسان کو ہر وقت آخرت کے احتساب کے لیے تیار رہنے کی ترغیب دیتے ہیں۔"
              ],
              "english": [
                "In the morning, 'al-Nushur' (resurrection) is used because waking from sleep resembles rising from the grave.",
                "In the evening, 'al-Masir' (return/destination) is used because after the day's work, one returns home, reminding us of the final return to the Hereafter.",
                "These words encourage a person to be constantly prepared for accountability in the afterlife."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذکار کی پابندی",
              "english": "Adherence to Adhkar"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ ان کلمات کو کبھی ترک نہیں فرماتے تھے، جو ان کی اہمیت پر دلالت کرتا ہے۔",
                "صبح و شام کے اذکار انسان کے گرد ایک حفاظتی ڈھال کا کام کرتے ہیں۔",
                "یہ دعائیں پڑھنے سے انسان سارا دن اور ساری رات اللہ کی امان اور پناہ میں رہتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) never abandoned these words, which indicates their great significance.",
                "Morning and evening remembrances act as a protective shield around a person.",
                "By reciting these prayers, a person remains in Allah's security and protection throughout the day and night."
              ]
            }
          }
        ]
      }
    }
  ]
}