{
  "hadithId": 827,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/4"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5090)، ومسلم (1466)، وأبو داود (2047)، والنسائي (6/68)، وابن ماجه (1858)، وأحمد (2/428).",
    "urdu": "صحیح۔ اسے بخاری (5090) اور مسلم (1466) نے روایت کیا ہے۔ امام ترمذی کے علاوہ باقی تمام کتب ستہ کے مؤلفین نے اسے نقل کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5090) and Muslim (1466). It is also reported by Abu Dawud, An-Nasa'i, Ibn Majah, and Ahmad."
  },
  "importantWords": [
    {
      "arabic": "تُنْكَحُ",
      "english": "Is married",
      "urdu": "نکاح کیا جاتا ہے"
    },
    {
      "arabic": "لِحَسَبِهَا",
      "english": "For her lineage",
      "urdu": "اس کے خاندان/نسب کی وجہ سے"
    },
    {
      "arabic": "فَاظْفَرْ",
      "english": "So achieve/attain",
      "urdu": "پس تو حاصل کر/کامیاب ہو"
    },
    {
      "arabic": "بِذَاتِ اَلدِّينِ",
      "english": "The religious one",
      "urdu": "دیندار والی"
    },
    {
      "arabic": "تَرِبَتْ يَدَاكَ",
      "english": "May your hands be dusty",
      "urdu": "تیرے ہاتھ خاک آلود ہوں"
    },
    {
      "arabic": "أَرْبَعٍ",
      "english": "Four (reasons)",
      "urdu": "چار چیزیں"
    }
  ],
  "summary": {
    "urdu": "نبی کریم صلی اللہ علیہ وسلم نے نکاح کے لیے شریک حیات کے انتخاب میں دینداری کو سب سے بنیادی اور اہم معیار قرار دیا ہے۔",
    "english": "The Prophet (ﷺ) identified common reasons for marriage but commanded Muslims to prioritize religious commitment as the ultimate criterion for success."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5090)",
      "english": "Sahih al-Bukhari (5090)"
    },
    {
      "arabic": "صحيح مسلم (1466)",
      "english": "Sahih Muslim (1466)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3L0f6LpB3M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انتخابِ رشتہ کے معیارات",
        "english": "Criteria for Selecting a Spouse"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی ترجیحات کا ذکر",
              "english": "Mention of Human Preferences"
            },
            "content": {
              "urdu": [
                "حدیث میں ان چار خوبیوں کا ذکر کیا گیا ہے جن کی بنیاد پر عموماً لوگ رشتہ تلاش کرتے ہیں۔",
                "مال، حسب نسب، اور حسن و جمال دنیاوی اعتبار سے پرکشش صفات ہیں۔",
                "آپ صلی اللہ علیہ وسلم نے ان کا ذکر کر کے انسانی فطرت کی نشاندہی فرمائی ہے۔"
              ],
              "english": [
                "The Hadith mentions four qualities that people typically look for in a spouse.",
                "Wealth, lineage, and beauty are worldly traits that hold natural attraction.",
                "The Prophet (ﷺ) mentioned these to acknowledge common social practices."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین کو فوقیت دینا",
              "english": "Prioritizing Religion"
            },
            "content": {
              "urdu": [
                "تمام صفات میں سب سے زیادہ وزن دینداری اور تقویٰ کو دیا گیا ہے۔",
                "دیندار شریک حیات دنیا اور آخرت دونوں میں سکون کا باعث بنتا ہے۔",
                "اگر باقی صفات نہ بھی ہوں تو صرف دینداری ہی کامیابی کے لیے کافی ہے۔"
              ],
              "english": [
                "Among all qualities, religious commitment and piety are given the most weight.",
                "A religious spouse brings peace and blessing in both this life and the hereafter.",
                "If other traits are lacking, religiousness alone is sufficient for a successful marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کامیاب ازدواجی زندگی",
        "english": "Successful Married Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کی مضبوطی",
              "english": "Strength of the Family System"
            },
            "content": {
              "urdu": [
                "دیندار عورت گھر کی تربیت اور بچوں کی پرورش اسلامی اصولوں پر کرتی ہے۔",
                "مال اور حسن وقت کے ساتھ ختم ہو سکتے ہیں مگر دین ہمیشہ قائم رہتا ہے۔",
                "خاندانی استحکام کے لیے تقویٰ سے بہتر کوئی بنیاد نہیں ہے۔"
              ],
              "english": [
                "A religious woman raises children and manages the home according to Islamic values.",
                "Wealth and beauty may fade over time, but religious character remains constant.",
                "There is no foundation better than piety for the long-term stability of a family."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظفر اور کامیابی کا مفہوم",
              "english": "The Meaning of Success (Zafar)"
            },
            "content": {
              "urdu": [
                "’فاظفر‘ کا مطلب یہ ہے کہ ایسی عورت کو حاصل کرنے کی بھرپور کوشش کرو۔",
                "نبی کریم صلی اللہ علیہ وسلم نے دیندار بیوی کو دنیا کی بہترین پونجی قرار دیا ہے۔",
                "حقیقی کامیابی یہ ہے کہ انسان کو ایک نیک اور وفادار ساتھی مل جائے۔"
              ],
              "english": [
                "The term 'Fa-zfar' implies making a dedicated effort to find such a spouse.",
                "The Prophet (ﷺ) regarded a righteous wife as the best treasure of this world.",
                "True success is found when an individual is blessed with a pious and loyal partner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کے خاص الفاظ کی حکمت",
        "english": "Wisdom Behind Specific Phrases"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "’تَرِبَتْ يَدَاكَ‘ کی وضاحت",
              "english": "Explanation of 'Taribat Yadak'"
            },
            "content": {
              "urdu": [
                "یہ ایک عربی محاورہ ہے جس کا لفظی مطلب 'تمہارے ہاتھ خاک آلود ہوں' ہے۔",
                "یہاں اس کا مقصد بددعا دینا نہیں بلکہ نصیحت پر زور دینا اور ترغیب دلانا ہے۔",
                "اس کا مفہوم یہ ہے کہ اگر تم نے دین کو نہ چنا تو تم نقصان اٹھاؤ گے۔"
              ],
              "english": [
                "This is an Arabic idiom literally meaning 'may your hands be rubbed with dust'.",
                "The intent here is not a curse, but rather to emphasize the importance of the advice.",
                "It implies that if you do not choose based on religion, you will face loss and regret."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسب اور نسب کا فرق",
              "english": "Lineage and Status"
            },
            "content": {
              "urdu": [
                "حسب سے مراد انسان کے آباؤ اجداد کے اچھے کارنامے اور سماجی مقام ہے۔",
                "اسلام نے حسب و نسب کو جائز رکھا ہے مگر اسے تفاخر کا ذریعہ بنانے سے روکا ہے۔",
                "اعلیٰ نسب پر دینداری کو ترجیح دینا ہی اسلامی معاشرے کی خوبصورتی ہے۔"
              ],
              "english": [
                "Lineage refers to the noble deeds of ancestors and their social standing.",
                "Islam acknowledges lineage but prohibits using it as a means of arrogance.",
                "Prioritizing religion over high status is the core beauty of an Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردوں کے لیے نصیحت",
              "english": "Advice for Men"
            },
            "content": {
              "urdu": [
                "یہ حدیث خاص طور پر مردوں کو مخاطب کر کے بہترین راہنمائی فراہم کرتی ہے۔",
                "صرف ظاہری خوبصورتی کے پیچھے بھاگنا ازدواجی زندگی میں ناکامی کا سبب بن سکتا ہے۔",
                "نیک عورت مرد کے آدھے ایمان کی حفاظت کرنے میں مددگار ہوتی ہے۔"
              ],
              "english": [
                "This Hadith specifically guides men towards making the wisest marital choice.",
                "Chasing only outward beauty can lead to failure and misery in married life.",
                "A righteous woman helps a man protect and complete half of his faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "متوازن انتخاب",
              "english": "Balanced Selection"
            },
            "content": {
              "urdu": [
                "اسلام حسن یا مال کی نفی نہیں کرتا بلکہ اسے دین کے تابع دیکھنے کا حکم دیتا ہے۔",
                "اگر دینداری کے ساتھ حسن بھی ہو تو یہ اللہ کا فضل اور نور علیٰ نور ہے۔",
                "بنیادی شرط ہمیشہ تقویٰ اور اللہ کا خوف ہی رہنی چاہیے۔"
              ],
              "english": [
                "Islam does not forbid beauty or wealth but commands placing them under religion.",
                "If beauty accompanies religiousness, it is a blessing and light upon light.",
                "The primary condition must always remain piety and the fear of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}