{
  "hadithId": 615,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/615"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1269)، والبخاري (1609). واللفظ لمسلم، والمراد بالركنين اليمانيين: الحجر الأسود والركن اليماني.",
    "urdu": "صحیح۔ اسے مسلم (1269) اور بخاری (1602) نے روایت کیا ہے۔ 'یمانی رکنوں' سے مراد حجرِ اسود والا کونا اور اس سے پہلے والا 'رکنِ یمانی' ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (1269) and Al-Bukhari (1609). The 'two Yemeni corners' refer to the Black Stone and the corner preceding it, known as Ar-Rukn al-Yamani."
  },
  "importantWords": [
    {
      "arabic": "يَسْتَلِمُ",
      "english": "Touching / Kissing",
      "urdu": "ہاتھ لگانا / بوسہ دینا / چھونا"
    },
    {
      "arabic": "الرُّكْنَيْنِ",
      "english": "The Two Corners",
      "urdu": "دو کونے"
    },
    {
      "arabic": "الْيَمَانِيَيْنِ",
      "english": "The two Yemeni",
      "urdu": "یمن کی طرف والے"
    },
    {
      "arabic": "الْبَيْتِ",
      "english": "The House (Ka'bah)",
      "urdu": "بیت اللہ / کعبہ"
    }
  ],
  "summary": {
    "urdu": "طواف کے دوران صرف حجرِ اسود اور رکنِ یمانی کو چھونا یا چومنا سنت ہے، باقی دو کونوں (شامی اور عراقی) کے لیے ایسا کوئی حکم نہیں ہے۔",
    "english": "During Tawaf, it is only Sunnah to touch or kiss the Black Stone and the Yemeni Corner; the other two corners (Shami and Iraqi) are not touched."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1269)",
      "english": "Reported by Muslim (1269)"
    },
    {
      "arabic": "رواه البخاري (1609)",
      "english": "Reported by Al-Bukhari (1609)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کعبہ کے چار ارکان اور استلام کا حکم",
        "english": "The Four Corners of Ka'bah and the Ruling on Touching"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکنین یمانیین کی پہچان",
              "english": "Identifying the Two Yemeni Corners"
            },
            "content": {
              "urdu": [
                "بیت اللہ کے چار کونے ہیں: حجرِ اسود، رکنِ یمانی، رکنِ شامی اور رکنِ عراقی۔",
                "حدیث میں 'یمانیین' تغلیب کے طور پر حجرِ اسود اور رکنِ یمانی دونوں کو کہا گیا ہے۔",
                "صرف انہی دو کونوں کو چھونے کی فضیلت احادیث میں وارد ہوئی ہے۔"
              ],
              "english": [
                "The Ka'bah has four corners: Al-Hajar al-Aswad, Ar-Rukn al-Yamani, Ar-Rukn al-Shami, and Ar-Rukn al-Iraqi.",
                "In the Hadith, 'the two Yemeni corners' refers to the Black Stone and the Yemeni Corner collectively.",
                "The virtue of touching is specifically mentioned in Hadith for only these two corners."
              ]
            }
          },
          {
            "title": {
              "urdu": "باقی دو کونوں کو کیوں نہیں چھوا جاتا؟",
              "english": "Why the Other Two Corners are not Touched"
            },
            "content": {
              "urdu": [
                "رکنِ شامی اور رکنِ عراقی حضرت ابراہیم علیہ السلام کی اصل بنیادوں پر نہیں ہیں۔",
                "قریش نے جب کعبہ کی تعمیر کی تو حطیم کا حصہ باہر چھوڑ دیا تھا، اس لیے یہ دو کونے ناقص رہ گئے۔",
                "نبی ﷺ نے اسی لیے ان کا استلام نہیں فرمایا کیونکہ وہ ابراہیمی بنیادوں سے ہٹ کر بنے تھے۔"
              ],
              "english": [
                "The Shami and Iraqi corners are not on the original foundations laid by Prophet Ibrahim (AS).",
                "When Quraysh rebuilt the Ka'bah, they left the Hijr (Hatim) portion outside, making these corners incomplete.",
                "The Prophet (ﷺ) did not touch them because they were not aligned with the original Abrahamic foundations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استلام کا مسنون طریقہ",
        "english": "The Sunnah Method of Touching (Istilam)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حجرِ اسود کا استلام",
              "english": "Istilam of the Black Stone"
            },
            "content": {
              "urdu": [
                "حجرِ اسود کو چومنا، یا ہاتھ لگا کر ہاتھ کو چومنا، یا دور سے اشارہ کرنا سنت ہے۔",
                "اشارہ کرتے وقت 'اللہ اکبر' کہنا چاہیے اور ہجوم میں دوسروں کو تکلیف نہیں دینی چاہیے۔",
                "یہ گناہوں کو جھاڑنے اور ایمان کی گواہی کا ذریعہ ہے۔"
              ],
              "english": [
                "Kissing the Black Stone, touching it then kissing the hand, or pointing from afar are all Sunnah.",
                "One should say 'Allahu Akbar' when pointing and avoid harming others in the crowd.",
                "It serves as a means for shedding sins and a testimony of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "رکنِ یمانی کا استلام",
              "english": "Istilam of the Yemeni Corner"
            },
            "content": {
              "urdu": [
                "رکنِ یمانی کو صرف ہاتھ سے چھوا جاتا ہے، اسے چومنا یا اس کی طرف اشارہ کرنا سنت سے ثابت نہیں ہے۔",
                "اگر ہجوم کی وجہ سے ہاتھ لگانا ممکن نہ ہو تو بغیر اشارہ کیے گزر جانا چاہیے۔",
                "یہ کونا یمن کی طرف رخ ہونے کی وجہ سے رکنِ یمانی کہلاتا ہے۔"
              ],
              "english": [
                "The Yemeni Corner is only touched with the hand; kissing it or pointing toward it is not proven from Sunnah.",
                "If it cannot be touched due to crowding, one should pass by without pointing.",
                "It is named the Yemeni Corner because it faces the direction of Yemen."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اتباعِ سنت اور بدعت سے بچاؤ",
        "english": "Following Sunnah and Avoiding Innovation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محبت بمقابلہ اتباع",
              "english": "Love vs. Adherence"
            },
            "content": {
              "urdu": [
                "بہت سے لوگ جذبات میں آکر کعبہ کی دیواروں، غلاف یا دیگر کونوں کو رگڑتے ہیں، جو سنت کے خلاف ہے۔",
                "عبادت کا معیار سنتِ نبوی ہے، نہ کہ انسانی جذبات یا پسند و ناپسند۔",
                "سیدنا ابن عمر کی یہ گواہی ہمیں دین میں حد سے بڑھنے سے روکتی ہے۔"
              ],
              "english": [
                "Many people emotionally rub the walls, cover, or other corners of the Ka'bah, which contradicts the Sunnah.",
                "The standard of worship is the Prophetic Sunnah, not human emotions or personal preferences.",
                "Ibn 'Umar's testimony prevents us from exceeding the bounds in religious practices."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں مضبوطی",
              "english": "Firmness in Religion"
            },
            "content": {
              "urdu": [
                "جس چیز کو نبی ﷺ نے نہیں چھوا، اسے متبرک سمجھ کر چھونا 'بدعت' کی طرف لے جا سکتا ہے۔",
                "اتباع اس کا نام ہے کہ جہاں اللہ کے رسول ﷺ رک گئے، ہم بھی وہیں رک جائیں۔",
                "دین میں اصل خیر اتباع میں ہے، ایجاد میں نہیں۔"
              ],
              "english": [
                "Touching something as sacred which the Prophet (ﷺ) did not touch can lead to 'Bid'ah' (innovation).",
                "True adherence means stopping where the Messenger of Allah (ﷺ) stopped.",
                "The ultimate goodness in religion lies in following, not in inventing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور سبق",
        "english": "Practical Training and Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشاہدے کی اہمیت",
              "english": "Importance of Observation"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نبی ﷺ کے ایک ایک عمل کو غور سے دیکھتے تھے تاکہ اسے بعینہ نقل کر سکیں۔",
                "ہمیں بھی سنتوں کو سیکھنے کے لیے مستند احادیث کا مطالعہ کرنا چاہیے۔",
                "علمِ نافع وہی ہے جو عمل میں نظر آئے۔"
              ],
              "english": [
                "The Sahaba observed every act of the Prophet (ﷺ) closely to replicate it exactly.",
                "We must study authentic Hadiths to learn the correct Sunnah practices.",
                "Beneficial knowledge is that which is reflected in one's actions."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کا خیال",
              "english": "Respecting Rights of Others"
            },
            "content": {
              "urdu": [
                "استلام سنت ہے لیکن مسلمانوں کو تکلیف نہ دینا واجب ہے۔",
                "سنت کی ادائیگی کے لیے کسی کو دھکا دینا یا اذیت دینا نیکی کو برباد کر سکتا ہے۔",
                "ایک حاجی کو وقار اور سکون کا نمونہ ہونا چاہیے۔"
              ],
              "english": [
                "Istilam is a Sunnah, but not harming fellow Muslims is an obligation (Wajib).",
                "Pushing or hurting others to fulfill a Sunnah can negate the reward of the deed.",
                "A pilgrim should be a model of dignity and tranquility."
              ]
            }
          }
        ]
      }
    }
  ]
}