{
  "hadithId": 720,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/88"],
    "kitabId": 7,
    "inKitabBab": 5,
    "arabicBook": "كتاب البيوع",
    "babId": 46
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2244، 2245). وأخرجه أبو داود (3463) والنسائي في الكبرى (6190).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری نے اپنی صحیح (2244، 2245) میں روایت کیا ہے۔ یہ بیع سلم کے جواز اور اس کی شرائط پر اہم دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2244, 2245). Also reported by Abu Dawud (3463) and An-Nasa'i in Al-Kubra (6190)."
  },
  "importantWords": [
    {
      "arabic": "أَنْبَاطٌ",
      "english": "Nabataeans",
      "urdu": "نبطی (شام کے کاشتکار)"
    },
    {
      "arabic": "نُسْلِفُهُمْ",
      "english": "We paid them in advance",
      "urdu": "ہم انہیں پیشگی رقم دیتے تھے (بیع سلم)"
    },
    {
      "arabic": "أَجَلٍ مُسَمًّى",
      "english": "Fixed period",
      "urdu": "مقررہ مدت"
    },
    {
      "arabic": "الزَّبِيبِ",
      "english": "Raisins",
      "urdu": "منقیٰ یا خشک انگور"
    },
    {
      "arabic": "الزَّيْتِ",
      "english": "Oil",
      "urdu": "زیتون کا تیل"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ بیع سلم (پیشگی ادائیگی) کے لیے یہ شرط نہیں کہ بیچنے والے کے پاس سودے کے وقت وہ چیز اپنی ملکیت یا کھیت میں موجود ہو، بلکہ صرف یہ اطمینان کافی ہے کہ وہ مقررہ وقت پر فراہم کر سکے گا۔",
    "english": "This Hadith establishes that for a Salam contract (advance payment), it is not a condition for the seller to own the crops or land at the time of the deal, as long as they can deliver the goods at the agreed time."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب السلم",
      "english": "Sahih al-Bukhari, Book of Salam"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن أبي أوفى",
        "english": "Abdullah bin Abi Awfa"
      },
      "slug": "abdullah-bin-abi-awfa"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الرحمن بن أبزى",
        "english": "Abdur-Rahman bin Abza"
      },
      "slug": "abdur-rahman-bin-abza"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0S1_WvX-oI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیع سلم کے بنیادی اصول",
        "english": "Fundamental Principles of Bay' al-Salam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیشگی ادائیگی کی حقیقت",
              "english": "The Essence of Advance Payment"
            },
            "content": {
              "urdu": [
                "بیع سلم میں قیمت نقد ادا کی جاتی ہے جبکہ سامان مستقبل میں ایک طے شدہ وقت پر ملتا ہے۔",
                "یہ عام بیع سے مختلف ہے جہاں معدوم (غیر موجود) چیز کی بیع منع ہے، مگر سلم کو ضرورت کے تحت رخصت دی گئی۔",
                "اس سے کسانوں اور تاجروں کو اپنی مالی ضروریات پوری کرنے میں آسانی ہوتی ہے۔"
              ],
              "english": [
                "In Bay' al-Salam, the price is paid upfront while the goods are delivered at a fixed future date.",
                "It is an exception to the general rule forbidding the sale of non-existent items, allowed due to necessity.",
                "This facilitates farmers and traders in meeting their financial needs before harvest."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملکیت کی شرط کا نہ ہونا",
              "english": "Absence of Ownership Requirement"
            },
            "content": {
              "urdu": [
                "سودا کرتے وقت بیچنے والے کے پاس کھیت یا باغ ہونا لازمی نہیں ہے۔",
                "صحابہ کرام نے ان نبطیوں سے کبھی نہیں پوچھا کہ تمہاری اپنی زمینیں ہیں یا نہیں۔",
                "بیچنے والے کے ذمہ صرف یہ ہے کہ وہ طے شدہ معیار کا سامان وقت پر فراہم کرے۔"
              ],
              "english": [
                "It is not mandatory for the seller to own the farm or orchard at the time of the contract.",
                "The Companions never inquired whether the Nabataeans owned the land themselves.",
                "The seller's primary obligation is to deliver goods matching the agreed specifications on time."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں اور شرائط",
        "english": "Juristic Nuances and Conditions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مدت اور معیار کا تعین",
              "english": "Defining Time and Quality"
            },
            "content": {
              "urdu": [
                "سلم کے صحیح ہونے کے لیے 'اجل مسمی' (مقررہ مدت) کا ہونا ضروری ہے۔",
                "سامان کی مقدار اور کوالٹی بالکل واضح ہونی چاہیے تاکہ بعد میں جھگڑا نہ ہو۔",
                "قیمت کی ادائیگی مجلسِ عقد میں (اسی وقت) ہونا لازمی ہے۔"
              ],
              "english": [
                "For Salam to be valid, a specific 'fixed period' (Ajal Musamma) must be stipulated.",
                "The quantity and quality of the goods must be clearly defined to prevent future disputes.",
                "The payment must be made in full at the time the contract is signed."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجناس کی وسعت",
              "english": "Diversity of Commodities"
            },
            "content": {
              "urdu": [
                "حدیث میں گندم، جو، منقیٰ اور زیتون کا ذکر ہے، جو کہ بنیادی اشیائے ضرورت تھیں۔",
                "فقہاء کے نزدیک ہر وہ چیز جس کا معیار واضح طور پر طے ہو سکے، اس میں سلم جائز ہے۔",
                "ایسی چیزیں جن کا معیار (Quality) طے نہ ہو سکے، ان میں سلم منع ہے۔"
              ],
              "english": [
                "The Hadith mentions wheat, barley, raisins, and oil—all staple necessities of the time.",
                "Jurists agree that Salam is permissible for any commodity whose specifications can be accurately fixed.",
                "Items whose quality cannot be precisely defined are ineligible for Salam contracts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی فوائد",
        "english": "Economic Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سرمایہ کاری کا ذریعہ",
              "english": "A Means of Investment"
            },
            "content": {
              "urdu": [
                "بیع سلم غریب کاشتکاروں کے لیے قرض کے متبادل کے طور پر کام کرتی ہے۔",
                "تاجر کو مال سستا مل جاتا ہے اور کسان کو فصل اگانے کے لیے نقد رقم مل جاتی ہے۔",
                "یہ اسلامی معیشت میں پیداواری عمل کو تیز کرنے کا ایک جائز ذریعہ ہے۔"
              ],
              "english": [
                "Bay' al-Salam serves as an alternative to interest-based loans for poor farmers.",
                "The trader gets goods at a potentially lower price, and the farmer gets cash to fund production.",
                "It is a legitimate tool for boosting productivity within an Islamic economic framework."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہدوں میں صفائی",
              "english": "Clarity in Agreements"
            },
            "content": {
              "urdu": [
                "کاروباری لین دین میں تاریخ اور معیار کو تحریر میں لانا سنت کی روح ہے۔",
                "غیر ضروری سوالات (جیسے زمین اپنی ہے یا نہیں) سے بچنا چاہیے اگر سودے کی تکمیل یقینی ہو۔",
                "اعتماد اور شفافیت ہی اسلامی تجارت کی اصل پہچان ہے۔"
              ],
              "english": [
                "Documenting dates and quality in business deals aligns with the spirit of the Sunnah.",
                "Avoid unnecessary inquiries if the fulfillment of the contract is reasonably assured.",
                "Trust and transparency are the hallmarks of Islamic commerce."
              ]
            }
          }
        ]
      }
    }
  ]
}