{
  "hadithId": 868,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/58"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه الترمذي (1165) والنسائي في الكبرى (9006) وابن حبان (4417). قال الترمذي: حسن غريب. ورجحه بعض الأئمة موقوفاً على ابن عباس، ولكن له شواهد مرفوعة كثيرة تقويه.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے امام ترمذی، نسائی اور ابن حبان نے روایت کیا ہے۔ اگرچہ بعض نے اسے ابن عباس پر موقوف کہا ہے، لیکن دیگر مرفوع احادیث اس کے معنی کی تائید کرتی ہیں۔",
    "english": "Sahih through supporting evidences. Reported by At-Tirmidhi (1165), An-Nasa'i (9006), and Ibn Hibban (4417). While some scholars prefer the Mauquf chain (attributed to the companion), numerous Marfu' (Prophetic) supports validate its status."
  },
  "importantWords": [
    {
      "arabic": "لَا يَنْظُرُ",
      "english": "Will not look",
      "urdu": "نہیں دیکھے گا"
    },
    {
      "arabic": "أَتَى",
      "english": "Approached / Committed (intercourse)",
      "urdu": "آیا / فعل کیا"
    },
    {
      "arabic": "رَجُلاً",
      "english": "A man",
      "urdu": "مرد"
    },
    {
      "arabic": "دُبُرِهَا",
      "english": "Her back / rectum",
      "urdu": "اس کی دبر / پاخانہ کا راستہ"
    },
    {
      "arabic": "أُعِلَّ",
      "english": "Declared defective",
      "urdu": "علت بتائی گئی / معلول قرار دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ہم جنس پرستی (لواطت) اور بیوی کے ساتھ غیر فطری طریقے سے جنسی تعلق قائم کرنے کی شدید مذمت اور ممانعت بیان کی گئی ہے۔",
    "english": "This Hadith strongly condemns and prohibits sodomy (homosexuality) and non-natural sexual intercourse with one's wife."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب الرضاع، رقم الحديث ١١٦٥",
      "english": "Jami` at-Tirmidhi, Book of Suckling, Hadith No. 1165"
    },
    {
      "arabic": "صحيح ابن حبان، كتاب النكاح، رقم الحديث ٤٤١٧",
      "english": "Sahih Ibn Hibban, Book of Marriage, Hadith No. 4417"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic through support)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیر فطری افعال کی ممانعت",
        "english": "Prohibition of Unnatural Acts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہم جنس پرستی کی مذمت",
              "english": "Condemnation of Homosexuality"
            },
            "content": {
              "urdu": [
                "مرد کا مرد کے ساتھ جنسی تعلق (لواطت) اسلام میں انتہائی قبیح گناہ اور حرام فعل ہے۔",
                "یہ عمل انسانی فطرت کے خلاف ہے اور معاشرے میں بگاڑ اور بیماریوں کا سبب بنتا ہے۔",
                "قومِ لوط پر اسی بدفعلی کی وجہ سے اللہ تعالیٰ کا شدید عذاب نازل ہوا تھا۔"
              ],
              "english": [
                "Sexual acts between men (sodomy) are considered a grave sin and strictly forbidden in Islam.",
                "This behavior contradicts human nature and leads to social decay and various diseases.",
                "The nation of Lut was destroyed by Allah's severe punishment due to this specific transgression."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی نظرِ رحمت سے محرومی",
              "english": "Deprivation of Allah's Mercy"
            },
            "content": {
              "urdu": [
                "حدیث میں تذکرہ ہے کہ ایسے فعل کرنے والوں کی طرف اللہ رحمت کی نظر نہیں فرمائے گا۔",
                "یہ وعید اس گناہ کی سنگینی اور ہولناکی کو ظاہر کرنے کے لیے کافی ہے۔",
                "قیامت کے دن اللہ کی رحمت سے محرومی انسان کے لیے سب سے بڑی ناکامی ہے۔"
              ],
              "english": [
                "The Hadith mentions that Allah will not look at such individuals with mercy on the Day of Judgment.",
                "This warning is sufficient to demonstrate the gravity and horror of this particular sin.",
                "Being deprived of Allah's mercy is the ultimate failure for a human being in the hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بیوی کے ساتھ غیر فطری تعلق",
        "english": "Unnatural Intercourse with Wife"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دبر میں وطی کی حرمت",
              "english": "Prohibition of Anal Intercourse"
            },
            "content": {
              "urdu": [
                "اگرچہ بیوی حلال ہے، مگر اس کے ساتھ پاخانہ کے راستے (دبر) سے جماع کرنا حرام ہے۔",
                "قرآن مجید نے عورتوں کو کھیتی قرار دے کر 'حيث شئتم' (جہاں سے چاہو) میں صرف مقامِ ولادت مراد لیا ہے۔",
                "یہ فعل طبی اعتبار سے بھی انتہائی نقصان دہ اور غلیظ ترین عمل شمار ہوتا ہے۔"
              ],
              "english": [
                "Although a wife is lawful, anal intercourse with her is strictly prohibited in Sharia.",
                "The Quran describes wives as 'tilth', and the permission to approach applies only to the reproductive organ.",
                "This act is medically harmful and considered one of the most repulsive physical behaviors."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی حدود کی پاسداری",
              "english": "Respecting Shariah Boundaries"
            },
            "content": {
              "urdu": [
                "ایک مومن اپنی جنسی خواہشات کی تسکین میں بھی اللہ کے مقرر کردہ ضابطوں کا پابند ہے۔",
                "نکاح کا مقصد پاکیزگی ہے، نہ کہ حیوانیت اور گندگی میں ملوث ہونا۔",
                "بیوی کے حقوق میں یہ بھی شامل ہے کہ اسے تکلیف دہ اور حرام افعال پر مجبور نہ کیا جائے۔"
              ],
              "english": [
                "A believer is bound by Allah's regulations even in the fulfillment of sexual desires.",
                "The purpose of marriage is purity, not indulgence in animality and filth.",
                "A wife's rights include not being forced into painful and forbidden sexual practices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور اخلاقی پہلو",
        "english": "Medical and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیماریوں کا پھیلاؤ",
              "english": "Spread of Diseases"
            },
            "content": {
              "urdu": [
                "غیر فطری جنسی تعلقات ایڈز اور دیگر متعدی بیماریوں کے پھیلاؤ کا سب سے بڑا ذریعہ ہیں۔",
                "اللہ کے احکامات میں ہمیشہ انسان کی جسمانی اور نفسیاتی صحت کا تحفظ پوشیدہ ہوتا ہے۔",
                "جو معاشرے ان برائیوں کو آزادی دیتے ہیں، وہ اخلاقی اور جسمانی طور پر تباہ ہو جاتے ہیں۔"
              ],
              "english": [
                "Unnatural sexual relations are the primary drivers for the spread of AIDS and other infections.",
                "Allah's commands always contain protection for human physical and psychological health.",
                "Societies that normalize these vices eventually collapse morally and biologically."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور انسانی وقار",
              "english": "Modesty and Human Dignity"
            },
            "content": {
              "urdu": [
                "یہ افعال انسان کے اندر سے حیا کا مادہ ختم کر دیتے ہیں اور اسے جانوروں سے بدتر بنا دیتے ہیں۔",
                "اسلام انسانی وقار کو برقرار رکھنے کے لیے پاکیزہ ازدواجی زندگی کی تعلیم دیتا ہے۔",
                "معاشرتی پاکیزگی کے لیے ان قبیح افعال کے خلاف شعور بیدار کرنا ضروری ہے۔"
              ],
              "english": [
                "These acts erode the sense of modesty and reduce a human being to a level below animals.",
                "Islam teaches a pure marital life to maintain human dignity and honor.",
                "Raising awareness against these loathsome acts is essential for social purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توبہ اور اصلاح",
        "english": "Repentance and Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچی توبہ کا دروازہ",
              "english": "Door of Sincere Repentance"
            },
            "content": {
              "urdu": [
                "جو لوگ نادانی میں ان گناہوں میں ملوث رہے، انہیں اللہ سے سچی توبہ کرنی چاہیے۔",
                "اللہ تعالیٰ غفور و رحیم ہے اور سچی توبہ کرنے والے کے گناہ معاف فرما دیتا ہے۔",
                "توبہ کا مطلب گناہ کو چھوڑنا، شرمندگی کا احساس اور دوبارہ نہ کرنے کا عہد ہے۔"
              ],
              "english": [
                "Those who have fallen into these sins out of ignorance must seek sincere repentance from Allah.",
                "Allah is All-Forgiving and Merciful, and He forgives those who turn back to Him truthfully.",
                "Repentance involves leaving the sin, feeling remorse, and vowing never to return to it."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرے کی ذمہ داری",
              "english": "Responsibility of Society"
            },
            "content": {
              "urdu": [
                "علماء اور والدین کو چاہیے کہ وہ نوجوان نسل کی صحیح تربیت اور رہنمائی کریں۔",
                "برائی کو روکنا اور اچھائی کو پھیلانا ہر مسلمان کا مذہبی اور اخلاقی فریضہ ہے۔",
                "اسلامی تعلیمات پر عمل کر کے ہی ہم دنیا اور آخرت کی رسوائی سے بچ سکتے ہیں۔"
              ],
              "english": [
                "Scholars and parents should prioritize the correct upbringing and guidance of the younger generation.",
                "Stopping evil and spreading goodness is the religious and moral duty of every Muslim.",
                "Only by adhering to Islamic teachings can we avoid disgrace in this world and the next."
              ]
            }
          }
        ]
      }
    }
  ]
}