{
  "hadithId": 526,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/526"],
    "kitabId": 4,
    "inKitabBab": 4,
    "arabicBook": "كتاب الزكاة",
    "babId": 32
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1045)، والبخاري (1473). ومعنى 'غير مشرف': أي غير متطلع إليه ولا طامع فيه.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام مسلم (1045) اور امام بخاری (1474) نے روایت کیا ہے۔ 'غیر مشرف' کا مطلب ہے کہ بغیر لالچ اور انتظار کے ملے ہونا۔",
    "english": "Sahih. Reported by Muslim (1045) and Bukhari (1473). 'Ghayra Mushrif' means without looking forward to it or having greed for it."
  },
  "importantWords": [
    {
      "arabic": "اَلْعَطَاءَ",
      "english": "Gift / Allowance",
      "urdu": "عطیہ / انعام"
    },
    {
      "arabic": "فَتَمَوَّلْهُ",
      "english": "Make it your property",
      "urdu": "اسے اپنا مال بنا لو"
    },
    {
      "arabic": "مُشْرِفٍ",
      "english": "Greedy / Aspiring",
      "urdu": "طمع کرنے والا / للچانے والا"
    },
    {
      "arabic": "سَائِلٍ",
      "english": "Beggar / Asker",
      "urdu": "مانگنے والا / سائل"
    },
    {
      "arabic": "تُتْبِعْهُ",
      "english": "Follow it / Pursue it",
      "urdu": "اس کے پیچھے لگاؤ"
    },
    {
      "arabic": "أَفْقَرَ",
      "english": "Poorer",
      "urdu": "زیادہ محتاج"
    }
  ],
  "summary": {
    "urdu": "اگر کوئی مال یا ہدیہ بغیر مانگے اور بغیر کسی طمع کے ملے تو اسے قبول کر لینا چاہیے، لیکن جو مال خود بخود نہ ملے اس کے لیے دل میں حرص پیدا کرنا اور اس کے پیچھے پڑنا درست نہیں۔",
    "english": "Accept wealth that comes to you without begging or greed, as it is a provision from Allah, but do not pursue or hanker after what is not destined for you in that manner."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1045)",
      "english": "Sahih Muslim (1045)"
    },
    {
      "arabic": "صحيح البخاري (1473)",
      "english": "Sahih al-Bukhari (1473)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سالم بن عبد الله بن عمر",
        "english": "Salim bin Abdullah bin Umar"
      },
      "slug": "salim-bin-abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عطیہ قبول کرنے کا اصول",
        "english": "Principle of Accepting Gifts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رزقِ من جانب اللہ",
              "english": "Provision from Allah"
            },
            "content": {
              "urdu": [
                "جو مال بغیر مانگے اور بغیر انتظار کے ملے وہ اللہ کا رزق سمجھ کر قبول کر لیں۔",
                "ایسے عطیے کو رد کرنا بعض اوقات اللہ کی دی ہوئی نعمت کی ناقدری شمار ہوتا ہے۔",
                "نبی ﷺ نے حضرت عمرؓ کو سکھایا کہ یہ مال ان کی اپنی ضرورت یا صدقے کے لیے بہتر ہے۔"
              ],
              "english": [
                "Wealth received without asking or expectation should be accepted as a gift from Allah.",
                "Refusing such an allowance can sometimes be seen as ingratitude towards Allah's bounty.",
                "The Prophet (ﷺ) taught 'Umar (RA) that this wealth is beneficial for his use or for charity."
              ]
            }
          },
          {
            "title": {
              "urdu": "طمع سے پاک ہونا",
              "english": "Freedom from Greed"
            },
            "content": {
              "urdu": [
                "قبولیت کی بنیادی شرط یہ ہے کہ انسان کا دل اس مال کے لیے للچایا ہوا نہ ہو۔",
                "اگر انسان پہلے سے اس مال کا منتظر ہو تو اس میں وہ برکت نہیں رہتی۔",
                "اسلام بندے کو نفسیاتی طور پر دوسروں سے بے نیاز اور خوددار بنانا چاہتا ہے۔"
              ],
              "english": [
                "The core condition for acceptance is that the heart should not be craving the wealth.",
                "If a person is already anticipating the gift, the spiritual blessing in it diminishes.",
                "Islam aims to make a servant psychologically independent and self-respecting."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بے نیازی اور استغناء",
        "english": "Contentment and Self-Sufficiency"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کے پیچھے نہ بھاگنا",
              "english": "Not Pursuing Wealth"
            },
            "content": {
              "urdu": [
                "جو مال میسر نہ ہو اس کے لیے پریشان ہونا اور خواہش پالنا منع ہے۔",
                "نفس کو دنیاوی مال و دولت کا غلام بنانے سے بچانا کمالِ ایمان ہے۔",
                "حقیقی مالداری دل کا غنی ہونا ہے، نہ کہ دنیاوی ساز و سامان کا ڈھیر لگانا۔"
              ],
              "english": [
                "It is forbidden to worry or harbor desires for wealth that is not available to you.",
                "Protecting the soul from becoming a slave to worldly riches is a sign of faith.",
                "True wealth lies in the contentment of the heart, not in amassing worldly goods."
              ]
            }
          },
          {
            "title": {
              "urdu": "حضرت عمرؓ کا ایثار",
              "english": "The Sacrifice of 'Umar (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عمرؓ کا مال لینے سے ہچکچانا ان کے زہد اور کمالِ تقویٰ کی دلیل ہے۔",
                "وہ ہمیشہ دوسروں کو اپنی ذات پر ترجیح دینے کا جذبہ رکھتے تھے۔",
                "نبی ﷺ نے انہیں اعتدال کی راہ دکھا کر عملی زندگی گزارنے کا طریقہ سکھایا۔"
              ],
              "english": [
                "Umar's (RA) hesitation to take the allowance proves his asceticism and piety.",
                "He always possessed the spirit of preferring others over his own self.",
                "The Prophet (ﷺ) showed him the path of moderation and practical living."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمتِ نبوی ﷺ",
        "english": "Prophetic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کے دو بہترین استعمال",
              "english": "Two Best Uses of Wealth"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ یا تو اسے اپنا مال بنا لو یا اسے آگے اللہ کی راہ میں دو۔",
                "حلال طریقے سے مال کا حصول اور ملکیت بنانا دین میں ناپسندیدہ نہیں ہے۔",
                "یہ طرزِ عمل معاشی مضبوطی اور فلاحی کاموں کی بنیاد فراہم کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said either keep it as property or give it away in Allah's cause.",
                "Acquiring and owning wealth through lawful means is not disliked in religion.",
                "This conduct provides a foundation for economic strength and welfare activities."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کی تربیت",
              "english": "Training of the Soul"
            },
            "content": {
              "urdu": [
                "حدیث ہمیں ذہنی دباؤ اور حرص سے بچنے کی عملی تدبیر بتاتی ہے۔",
                "جو اللہ نے مقدر میں نہیں لکھا، اس کی فکر میں وقت ضائع نہیں کرنا چاہیے۔",
                "نصیب پر راضی رہنا انسان کو سکونِ قلب جیسی عظیم دولت عطا کرتا ہے۔"
              ],
              "english": [
                "The Hadith gives a practical strategy to avoid mental stress and greed.",
                "One should not waste time worrying about what Allah has not destined for them.",
                "Being satisfied with one's lot grants the great treasure of peace of mind."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سماجی تحائف کی قبولیت",
              "english": "Accepting Social Gifts"
            },
            "content": {
              "urdu": [
                "اپنے دوستوں یا حکومت کی طرف سے ملنے والے جائز فوائد کو رد نہیں کرنا چاہیے۔",
                "اگر آپ خود ضرورت مند نہیں ہیں تو لے کر کسی غریب کی مدد کر دیں۔",
                "اس سے معاشرے میں محبت بڑھتی ہے اور رزق کی تقسیم کا عمل تیز ہوتا ہے۔"
              ],
              "english": [
                "Legal benefits from friends or the state should not be unnecessarily rejected.",
                "If you are not in need yourself, take it and use it to help someone poor.",
                "This increases social affection and accelerates the distribution of provision."
              ]
            }
          },
          {
            "title": {
              "urdu": "خودداری کا معیار",
              "english": "Standard of Self-Respect"
            },
            "content": {
              "urdu": [
                "مانگنا ذلت ہے، مگر اللہ کی طرف سے آئے ہوئے بن مانگے رزق کو لینا عزت ہے۔",
                "مومن کو مالداروں کی طرف للچائی ہوئی نظروں سے دیکھنے سے بچنا چاہیے۔",
                "اپنی محنت پر بھروسہ اور تقدیر پر ایمان ہی اصل خودداری ہے۔"
              ],
              "english": [
                "Begging is humiliation, but accepting unasked provision from Allah is honor.",
                "A believer must avoid looking at the wealthy with envious or greedy eyes.",
                "Reliance on hard work and faith in destiny is the essence of self-respect."
              ]
            }
          }
        ]
      }
    }
  ]
}