{
  "hadithId": 439,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3878",
      "https://sunnah.com/tirmidhi:994"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (3426) ، وأبو داود (4061) ، والترمذي (994) ، وابن ماجه (3566) ، وصححه الحاكم والبيهقي. والحديث دليل على استحباب الثياب البيض حيا وميتا.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد (3426)، ابوداؤد (4061)، ترمذی (994) اور ابن ماجہ (3566) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے۔ یہ حدیث زندگی اور موت دونوں میں سفید لباس کی فضیلت پر دلالت کرتی ہے۔",
    "english": "Sahih. Reported by Ahmad (3426), Abu Dawud (4061), at-Tirmidhi (994), and Ibn Majah (3566). Graded Sahih by at-Tirmidhi and al-Hakim. It proves the recommendation of white clothing for both the living and the deceased."
  },
  "importantWords": [
    {
      "arabic": "الْبَسُوا",
      "english": "Wear",
      "urdu": "تم پہنو"
    },
    {
      "arabic": "الْبَيَاضَ",
      "english": "White",
      "urdu": "سفید"
    },
    {
      "arabic": "خَيْرِ",
      "english": "Best / Better",
      "urdu": "بہترین / عمدہ"
    },
    {
      "arabic": "كَفِّنُوا",
      "english": "Shroud / Wrap",
      "urdu": "کفن دو"
    },
    {
      "arabic": "مَوْتَاكُمْ",
      "english": "Your dead",
      "urdu": "تمہارے مردے"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے سفید لباس کو زندگی میں پہننے اور موت کے بعد کفن کے لیے بہترین قرار دیا ہے کیونکہ یہ پاکیزگی اور سادگی کی علامت ہے۔",
    "english": "The Prophet (ﷺ) designated white clothing as the best to wear during life and for shrouding after death due to its symbolism of purity and simplicity."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (994)",
      "english": "Sunan at-Tirmidhi (994)"
    },
    {
      "arabic": "سنن أبي داود (4061)",
      "english": "Sunan Abu Dawud (4061)"
    },
    {
      "arabic": "سنن ابن ماجه (3566)",
      "english": "Sunan Ibn Majah (3566)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0y_6DqU_N4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سفید لباس کی فضیلت",
        "english": "The Excellence of White Clothing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بہترین لباس",
              "english": "The Best Attire"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے سفید لباس کو تمام رنگوں میں بہترین قرار دیا ہے۔",
                "سفید کپڑا صفائی اور ستھرائی کو واضح طور پر ظاہر کرتا ہے۔",
                "یہ رنگ وقار، عاجزی اور سادگی کی علامت سمجھا جاتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) described white as the best among all colors for clothing.",
                "White cloth clearly highlights cleanliness and hygiene for the wearer.",
                "This color is considered a symbol of dignity, humility, and simplicity."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت کا اظہار",
              "english": "Expression of Purity"
            },
            "content": {
              "urdu": [
                "سفید کپڑے پر معمولی سی گندگی بھی فوراً نظر آ جاتی ہے۔",
                "یہ پہننے والے کو اپنی صفائی کا زیادہ خیال رکھنے پر ابھارتا ہے۔",
                "اسلام میں طہارت کو نصف ایمان قرار دیا گیا ہے، سفید لباس اس کا عکاس ہے۔"
              ],
              "english": [
                "Even minor dirt is immediately visible on white cloth, prompting care.",
                "It encourages the wearer to maintain a high standard of personal hygiene.",
                "In Islam, purity is half of faith, and white clothing reflects this principle."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کفن کے لیے انتخاب",
        "english": "Choice for the Shroud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میت کی تکریم",
              "english": "Honoring the Deceased"
            },
            "content": {
              "urdu": [
                "مرنے کے بعد سفید کفن دینا سنتِ مؤکدہ اور مستحب عمل ہے۔",
                "سفید کفن میت کی پردہ پوشی اور وقار کے لیے موزوں ترین ہے۔",
                "نبی ﷺ نے حکم دیا کہ اپنے مردوں کو اسی رنگ میں کفناؤ۔"
              ],
              "english": [
                "Providing a white shroud after death is a stressed and recommended Sunnah.",
                "The white shroud is most suitable for the privacy and dignity of the dead.",
                "The Prophet (ﷺ) explicitly commanded to shroud the deceased in this color."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی یکسانیت",
              "english": "Uniformity for the Hereafter"
            },
            "content": {
              "urdu": [
                "کفن میں سفید رنگ کا انتخاب انسانوں کی برابری کو ظاہر کرتا ہے۔",
                "امیر ہو یا غریب، سب ایک ہی سادہ سفید لباس میں رخصت ہوتے ہیں۔",
                "یہ دنیا کی فانی حیثیت اور رنگینیوں کے خاتمے کا پیغام دیتا ہے۔"
              ],
              "english": [
                "The choice of white for the shroud demonstrates the equality of all humans.",
                "Rich or poor, everyone departs in the same simple white garment.",
                "It sends a message of the fleeting nature of worldly colors and status."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Juristic and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیگر رنگوں کا حکم",
              "english": "Ruling on Other Colors"
            },
            "content": {
              "urdu": [
                "سفید لباس افضل ہے، لیکن دیگر جائز رنگ پہننا بھی مباح ہے۔",
                "کفن کے لیے اگر سفید نہ ملے تو دوسرا کپڑا استعمال ہو سکتا ہے۔",
                "مقصد سنت کی فضیلت کو ظاہر کرنا ہے نہ کہ دوسروں کو حرام کرنا۔"
              ],
              "english": [
                "White is superior, yet wearing other permissible colors is allowed in Islam.",
                "If white cloth is unavailable for a shroud, other fabrics may be used.",
                "The intent is to show the virtue of Sunnah, not to forbid other colors."
              ]
            }
          },
          {
            "title": {
              "urdu": "سادگی کی ترغیب",
              "english": "Encouragement of Simplicity"
            },
            "content": {
              "urdu": [
                "سفید لباس انسان کو فخر اور تکبر سے دور رکھنے میں مدد دیتا ہے۔",
                "یہ اللہ کے سامنے عاجزی اختیار کرنے کا ایک ظاہری طریقہ ہے۔",
                "مسلمان کو اپنی زندگی کے ہر شعبے میں سادگی اپنانی چاہیے۔"
              ],
              "english": [
                "White clothing helps in keeping a person away from pride and arrogance.",
                "It is an outward way of adopting humility before Allah the Almighty.",
                "A Muslim should embrace simplicity in every aspect of their daily life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباعِ سنت کا شوق",
              "english": "Desire to Follow Sunnah"
            },
            "content": {
              "urdu": [
                "نیک کاموں میں سنت کو ترجیح دینا ایمان کی نشانی ہے۔",
                "سفید لباس پہن کر ہم نبی ﷺ کی اس سنت کو زندہ کر سکتے ہیں۔",
                "سنت پر عمل کرنے سے زندگی میں برکت اور نور پیدا ہوتا ہے۔"
              ],
              "english": [
                "Prioritizing the Sunnah in good deeds is a sign of true faith.",
                "By wearing white, we can revive this particular Sunnah of the Prophet (ﷺ).",
                "Acting upon the Sunnah brings blessings and light into a person's life."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کی تیاری",
              "english": "Preparation for Death"
            },
            "content": {
              "urdu": [
                "سفید کفن کی یاد ہمیں اپنی موت کی یاد دلاتی رہتی ہے۔",
                "یہ ہمیں بتاتا ہے کہ اصل لباس وہی ہے جو آخرت میں کام آئے۔",
                "انسان کو ہر وقت اپنے اعمال کی اصلاح کی فکر کرنی چاہیے۔"
              ],
              "english": [
                "The thought of the white shroud reminds us constantly of our own death.",
                "It teaches us that the real attire is the one useful in the Hereafter.",
                "One should always be concerned about reforming their own deeds."
              ]
            }
          }
        ]
      }
    }
  ]
}