{
  "hadithId": 1063,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1258"],
    "kitabId": 10,
    "inKitabBab": 3,
    "arabicBook": "بلوغ المرام - كتاب الحدود",
    "babId": 86
  },
 
  "takhreej": {
    "arabic": "ضعيف جدا ومُنكر. أخرجه أبو داود (4410)، والنسائي (4980) من طريق مصعب بن ثابت وهو ضعيف، والحديث أنكره النسائي وابن عدي وغيرهم.",
    "urdu": "یہ روایت سخت ضعیف اور منکر ہے۔ اسے امام ابوداؤد (4410) اور نسائی (4980) نے مصعب بن ثابت کے واسطے سے روایت کیا ہے جنہیں ائمہ جرح و تعدیل نے ضعیف قرار دیا ہے۔",
    "english": "Very weak and Munkar (Rejected). Reported by Abu Dawud (4410) and an-Nasa'i (4980) via Mus'ab bin Thabit, who is a weak narrator. An-Nasa'i specifically rejected this chain."
  },
  "importantWords": [
    {
      "arabic": "سَارِق",
      "english": "Thief",
      "urdu": "چور"
    },
    {
      "arabic": "اُقْتُلُوهُ",
      "english": "Kill him",
      "urdu": "اسے قتل کر دو"
    },
    {
      "arabic": "اِقْطَعُوهُ",
      "english": "Cut it off",
      "urdu": "اسے کاٹ دو"
    },
    {
      "arabic": "مَنْسُوخٌ",
      "english": "Abrogated",
      "urdu": "منسوخ (ختم شدہ)"
    },
    {
      "arabic": "مُنكر",
      "english": "Rejected/Munkar",
      "urdu": "ناقابل قبول روایت"
    },
    {
      "arabic": "سَرَقَ",
      "english": "Stole",
      "urdu": "چوری کی"
    }
  ],
  "summary": {
    "urdu": "اس روایت میں بار بار چوری کرنے والے کے لیے قتل کی سزا کا ذکر ہے، لیکن ائمہ حدیث نے اسے ضعیف قرار دیا ہے اور امام شافعی کے نزدیک یہ حکم منسوخ ہے۔",
    "english": "This narration mentions the death penalty for a habitual thief, but Hadith scholars have graded it as weak and Imam Shafi'i noted it as abrogated."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4410)",
      "english": "Sunan Abu Dawud (4410)"
    },
    {
      "arabic": "سنن النسائي (4980)",
      "english": "Sunan an-Nasa'i (4980)"
    },
    {
      "arabic": "بلوغ المرام (1258)",
      "english": "Bulugh al-Maram (1258)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A7XjG6u_E_M",
  "grade": {
    "arabic": "ضعيف جدا / منكر",
    "english": "Very Weak / Rejected"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کی اسنادی حیثیت",
        "english": "Status of the Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راوی کا ضعف",
              "english": "Weakness of the Narrator"
            },
            "content": {
              "urdu": [
                "اس حدیث کا راوی مصعب بن ثابت ائمہ کے نزدیک غیر معتبر ہے۔",
                "امام نسائی نے صراحت کے ساتھ اسے منکر حدیث قرار دیا ہے۔",
                "ایسی روایات جن کے راوی ضعیف ہوں، شرعی احکام میں حجت نہیں ہوتیں۔"
              ],
              "english": [
                "The narrator Mus'ab bin Thabit is considered unreliable by major scholars.",
                "Imam an-Nasa'i explicitly classified this specific narration as 'Munkar'.",
                "Narrations with weak links cannot be used to establish legal rulings."
              ]
            }
          },
          {
            "title": {
              "urdu": "منکر روایت کا مفہوم",
              "english": "Meaning of Munkar"
            },
            "content": {
              "urdu": [
                "منکر وہ روایت ہے جو ثقہ راویوں کی روایات کے خلاف ہو۔",
                "چوری کی سزا قرآن میں صرف ہاتھ کاٹنا بیان ہوئی ہے۔",
                "یہ روایت قرآن کے واضح حکم کے خلاف ہونے کی وجہ سے رد کی گئی۔"
              ],
              "english": [
                "A Munkar report is one that contradicts more reliable narrations.",
                "The Quran defines the punishment for theft solely as cutting the hand.",
                "This report is rejected because it contradicts clear Quranic injunctions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نسخ کا مسئلہ",
        "english": "Issue of Abrogation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام شافعی کا موقف",
              "english": "Position of Imam Shafi'i"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک اگر یہ ثابت بھی ہو تو منسوخ ہے۔",
                "اسلامی قانون میں ارتقائی مراحل کے دوران کچھ احکام بدلے گئے۔",
                "اب چوری پر قتل کی سزا کسی صورت نافذ نہیں کی جا سکتی۔"
              ],
              "english": [
                "Imam Shafi'i noted that even if authentic, the ruling is abrogated.",
                "Certain rulings evolved during the early stages of Islamic legislation.",
                "The death penalty for theft is no longer valid in Islamic law."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور علماء کی رائے",
              "english": "Opinion of Majority Scholars"
            },
            "content": {
              "urdu": [
                "تمام بڑے ائمہ اس بات پر متفق ہیں کہ چور قتل نہیں کیا جائے گا۔",
                "تعزیری سزا کے طور پر بھی چور کا قتل جائز نہیں سمجھا گیا۔",
                "یہ رائے امت کے اجماع اور صحیح احادیث کے مطابق ہے۔"
              ],
              "english": [
                "All major imams agree that a thief is not to be executed.",
                "Execution is not permitted even as a discretionary punishment for theft.",
                "This consensus aligns with the majority of authentic traditions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "چوری کی شرعی سزا",
        "english": "Shariah Punishment for Theft"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حد کا نفاذ",
              "english": "Implementation of Hadd"
            },
            "content": {
              "urdu": [
                "چوری کی بنیادی سزا ہاتھ کاٹنا ہے جو قرآن سے ثابت ہے۔",
                "یہ سزا مخصوص شرائط اور نصاب کے پورا ہونے پر دی جاتی ہے۔",
                "انسانی جان کی حرمت اسلام میں بہت زیادہ اہمیت رکھتی ہے۔"
              ],
              "english": [
                "The primary punishment for theft is cutting the hand, per the Quran.",
                "This is applied only when specific conditions and values are met.",
                "The sanctity of human life is of paramount importance in Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "توبہ کی گنجائش",
              "english": "Room for Repentance"
            },
            "content": {
              "urdu": [
                "اسلام گناہ گار کو توبہ اور اصلاح کا موقع فراہم کرتا ہے۔",
                "قتل کی سزا اصلاح کا دروازہ بند کر دیتی ہے جو یہاں مقصود نہیں۔",
                "حدود کا مقصد معاشرے کی اصلاح اور جرم کا خاتمہ ہے۔"
              ],
              "english": [
                "Islam provides the sinner with a chance for repentance and reform.",
                "Execution closes the door to reform, which is not the goal here.",
                "Hudud aim to reform society and eliminate criminal behavior."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علمی و تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی اہمیت",
              "english": "Importance of Research"
            },
            "content": {
              "urdu": [
                "ہر سنی سنائی بات یا حدیث کو بغیر تحقیق کے عام نہ کریں۔",
                "علماء اور محدثین کی جرح و تعدیل پر اعتماد کرنا ضروری ہے۔",
                "دین کے معاملے میں مستند ذرائع ہی اصل بنیاد ہونے چاہئیں۔"
              ],
              "english": [
                "Do not spread narrations without verifying their authenticity.",
                "It is essential to rely on the critical analysis of Hadith scholars.",
                "Authentic sources must be the foundation of religious knowledge."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال پسندی",
              "english": "Moderation in Law"
            },
            "content": {
              "urdu": [
                "اسلامی سزائیں انصاف اور اعتدال پر مبنی ہوتی ہیں۔",
                "سزا جرم کی نوعیت کے مطابق ہونی چاہیے، اس سے زیادہ نہیں۔",
                "عدل و انصاف کا قیام ہی اسلامی معاشرے کا خاصہ ہے۔"
              ],
              "english": [
                "Islamic punishments are built on justice and moderation.",
                "The penalty must fit the crime without exceeding proper limits.",
                "Establishing justice is the hallmark of an Islamic society."
              ]
            }
          }
        ]
      }
    }
  ]
}
