{
  "hadithId": 374,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/321"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (1101)‏، وأصله في مسلم (866) بلفظ: كانت صلاته قصدا، وخطبته قصدا؛ يقرأ آيات من القرآن، ويذكر الناس.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (1101) نے روایت کیا اور اس کی اصل صحیح مسلم (866) میں موجود ہے، جس میں ذکر ہے کہ آپ ﷺ کی نماز اور خطبہ دونوں میانہ رو (متوسط) ہوتے تھے۔",
    "english": "Sahih. Reported by Abu Dawud (1101) and its origin is in Sahih Muslim (866). The wording indicates that his prayer and sermon were of moderate length."
  },
  "importantWords": [
    {
      "arabic": "الْخُطْبَةِ",
      "english": "The Sermon",
      "urdu": "خطبہ"
    },
    {
      "arabic": "يَقْرَأُ",
      "english": "He used to recite",
      "urdu": "وہ تلاوت کرتے تھے"
    },
    {
      "arabic": "آيَاتٍ",
      "english": "Verses",
      "urdu": "آیات"
    },
    {
      "arabic": "يُذَكِّرُ",
      "english": "He reminds / exhorts",
      "urdu": "وہ نصیحت کرتے تھے"
    },
    {
      "arabic": "قَصْدًا",
      "english": "Moderate / Medium length",
      "urdu": "میانہ روی / درمیانہ"
    }
  ],
  "summary": {
    "urdu": "خطبہ جمعہ میں قرآن مجید کی آیات کی تلاوت کرنا اور لوگوں کو اللہ کے احکامات کے ذریعے نصیحت کرنا سنتِ نبوی ﷺ ہے۔",
    "english": "It is the Sunnah of the Prophet (ﷺ) to recite verses from the Holy Qur'an during the Friday sermon and to provide spiritual admonition to the people."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1101)",
      "english": "Sunan Abi Dawud (1101)"
    },
    {
      "arabic": "صحيح مسلم (866)",
      "english": "Sahih Muslim (866)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن سمرة",
        "english": "Jabir bin Samurah"
      },
      "slug": "jabir-bin-samurah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9MszK2Bny4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خطبہ جمعہ کا مسنون طریقہ",
        "english": "The Sunnah Method of the Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن کی تلاوت",
              "english": "Recitation of the Qur'an"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا خطبہ صرف انسانی الفاظ پر مبنی نہیں تھا بلکہ اس میں کلام اللہ شامل ہوتا تھا۔",
                "قرآن کی آیات خطبہ میں برکت اور ہدایت کا اصل ذریعہ ہیں۔",
                "امام کو چاہیے کہ خطبے میں قرآن کی ایسی آیات پڑھے جو موقع کی مناسبت سے ہوں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) sermon was not based solely on human speech but included the Word of Allah.",
                "Reciting Qur'anic verses during the sermon is a source of blessing and primary guidance.",
                "The Imam should select verses that are relevant to the occasion and the audience's needs."
              ]
            }
          },
          {
            "title": {
              "urdu": "وعظ اور نصیحت",
              "english": "Admonition and Reminder"
            },
            "content": {
              "urdu": [
                "خطبے کا اصل مقصد لوگوں کے ایمان کو تازہ کرنا اور انہیں نصیحت کرنا ہے۔",
                "نصیحت میں اللہ کا ڈر (تقویٰ) اور آخرت کی یاد دلانا شامل ہونا چاہیے۔",
                "مؤثر وعظ وہ ہے جو لوگوں کے دلوں پر اثر کرے اور ان کی اصلاح کرے۔"
              ],
              "english": [
                "The main purpose of the sermon is to refresh the faith of the people and provide counsel.",
                "Reminders should include the fear of Allah (Taqwa) and thoughts of the Hereafter.",
                "An effective sermon is one that touches the hearts and leads to the self-reform of the listeners."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خطبے کی طوالت اور میانہ روی",
        "english": "Length and Moderation of the Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میانہ روی (قصدا)",
              "english": "Moderation (Qasd)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا خطبہ نہ بہت طویل ہوتا تھا اور نہ ہی بہت مختصر۔",
                "بہت طویل خطبہ لوگوں کے لیے اکتاہٹ کا باعث بن سکتا ہے جس سے توجہ کم ہو جاتی ہے۔",
                "سنت یہ ہے کہ نماز طویل اور خطبہ اس کی نسبت مختصر رکھا جائے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) sermon was neither excessively long nor overly brief.",
                "A very long sermon can cause boredom, leading the audience to lose focus.",
                "The Sunnah is to make the prayer relatively long and the sermon comparatively short."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقتدیوں کا خیال",
              "english": "Considering the Congregation"
            },
            "content": {
              "urdu": [
                "خطیب کو چاہیے کہ مجمع کی حالت اور وقت کا خیال رکھے۔",
                "جامع کلمات کہنا اور ضروری مسائل بیان کرنا طویل تقریروں سے بہتر ہے۔",
                "آپ ﷺ کے خطبات ہمیشہ بامقصد اور جامع ہوا کرتے تھے۔"
              ],
              "english": [
                "The speaker must consider the condition of the audience and the constraints of time.",
                "Using concise speech and addressing essential issues is better than long speeches.",
                "The Prophet's (ﷺ) sermons were always purposeful and comprehensive."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آیت کی تلاوت کا حکم",
              "english": "Ruling on Reciting a Verse"
            },
            "content": {
              "urdu": [
                "بعض فقہاء کے نزدیک خطبہ میں کم از کم ایک مکمل آیت کا پڑھنا واجب ہے۔",
                "بغیر قرآن کے خطبہ مکمل سنت کے مطابق نہیں کہلائے گا۔",
                "قرآن کے بغیر وعظ محض ایک تقریر بن کر رہ جاتا ہے۔"
              ],
              "english": [
                "Some jurists consider it obligatory to recite at least one complete verse during the sermon.",
                "A sermon without the Qur'an is not considered fully in accordance with the Sunnah.",
                "Without the Qur'an, the admonition remains merely a regular speech."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذکر اللہ کی اہمیت",
              "english": "Importance of Dhikr"
            },
            "content": {
              "urdu": [
                "خطبہ بنیادی طور پر اللہ کے ذکر کے لیے مقرر کیا گیا ہے۔",
                "اس میں اللہ کی حمد و ثناء اور درود و سلام بھی ضروری اجزاء ہیں۔",
                "یہ اجتماعی ذکر مسلمانوں کے لیے اتحاد اور روحانیت کا باعث ہے۔"
              ],
              "english": [
                "The sermon is primarily established for the remembrance (Dhikr) of Allah.",
                "Praising Allah and sending blessings upon the Prophet are essential components.",
                "This collective remembrance fosters unity and spirituality among Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور اصلاح",
        "english": "Practical Training and Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن سے رہنمائی",
              "english": "Guidance from the Qur'an"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو اپنی زندگی کے تمام مسائل کا حل قرآن میں تلاش کرنا چاہیے۔",
                "خطبہ جمعہ ہفتہ وار تربیتی کورس کی حیثیت رکھتا ہے۔",
                "قرآنی آیات کے ذریعے معاشرتی برائیوں کی نشاندہی کرنی چاہیے۔"
              ],
              "english": [
                "Muslims should seek solutions to all their life's problems in the Qur'an.",
                "The Friday sermon serves as a weekly spiritual training course.",
                "Social evils should be highlighted and addressed through Qur'anic verses."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطیب کی ذمہ داری",
              "english": "Responsibility of the Speaker"
            },
            "content": {
              "urdu": [
                "خطیب کا فرض ہے کہ وہ لوگوں کو دین کے قریب لانے کی کوشش کرے۔",
                "سخت کلامی کے بجائے نرمی اور حکمت سے نصیحت کرنی چاہیے۔",
                "اسوہِ حسنہ کی پیروی ہی تبلیغ میں کامیابی کی چابی ہے۔"
              ],
              "english": [
                "The speaker's duty is to bring people closer to the religion.",
                "Counsel should be given with wisdom and gentleness rather than harshness.",
                "Following the Prophetic example is the key to success in preaching."
              ]
            }
          }
        ]
      }
    }
  ]
}