{
  "hadithId": 1119,
  "hadithNo": 40,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/40"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2904)، ومسلم (1757) في كتاب الجهاد والسير، باب حكم الفيء.‏",
    "urdu": "صحیح۔ اسے امام بخاری (2904) اور امام مسلم (1757) نے روایت کیا ہے۔ یہ حدیث مالِ فے کے احکام اور نبی ﷺ کے مالیاتی نظام کی وضاحت کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2904) and Muslim (1757) in the Book of Jihad and Expeditions, Chapter on the Rulings of Fai'."
  },
  "importantWords": [
    {
      "arabic": "أَفَاءَ",
      "english": "Bestowed / Returned (Fai')",
      "urdu": "پلٹا دیا / عطا کیا (بطور فے)"
    },
    {
      "arabic": "لَمْ يُوجِفْ",
      "english": "Did not rouse / Did not gallop",
      "urdu": "نہ دوڑائے (بغیر لڑائی کے حاصل ہونا)"
    },
    {
      "arabic": "خَاصَّةً",
      "english": "Exclusively",
      "urdu": "خاص طور پر"
    },
    {
      "arabic": "نَفَقَةَ",
      "english": "Subsistence / Maintenance",
      "urdu": "خرچہ / نان نفقہ"
    },
    {
      "arabic": "اَلْكُرَاعِ",
      "english": "Horses / War animals",
      "urdu": "جنگی گھوڑے / جانور"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'مالِ فے' (وہ مال جو بغیر جنگ کے حاصل ہو) کا حکم بیان ہوا ہے کہ وہ حاکمِ وقت کے اختیار میں ہے کہ وہ اسے اپنی ضروریات اور دفاعِ وطن کے لیے استعمال کرے۔",
    "english": "This Hadith explains the ruling of 'Fai'' (spoils obtained without fighting), stating it is under the ruler's authority to use for his sustenance and national defense."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2904)",
      "english": "Narrated by Al-Bukhari (2904)"
    },
    {
      "arabic": "رواه مسلم (1757)",
      "english": "Narrated by Muslim (1757)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9U0O7zE73U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غنیمت اور فے میں فرق",
        "english": "Difference Between Ghanimah and Fai'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالِ غنیمت کا حکم",
              "english": "Ruling on Ghanimah"
            },
            "content": {
              "urdu": [
                "مالِ غنیمت وہ ہے جو دشمن کے ساتھ قتال اور جنگ کے نتیجے میں حاصل ہو۔",
                "اس میں سے چار حصے مجاہدین میں تقسیم ہوتے ہیں اور ایک حصہ (خمس) ریاست کا ہوتا ہے۔",
                "بنو نضیر کا مال اس زمرے میں نہیں آتا تھا کیونکہ وہ بغیر جنگ کے حاصل ہوا۔"
              ],
              "english": [
                "Ghanimah is booty obtained through direct combat and fighting.",
                "Four-fifths are divided among soldiers, while one-fifth (Khums) goes to the state.",
                "The properties of Banu al-Nadir were not Ghanimah because they were gained without a battle."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالِ فے کی تعریف",
              "english": "Definition of Fai'"
            },
            "content": {
              "urdu": [
                "فے وہ مال ہے جو دشمن کے رعب سے یا صلح کے نتیجے میں بغیر جنگ کے مل جائے۔",
                "یہ مال خالصتاً اللہ کے رسول اور بعد میں آنے والے مسلمان حکمرانوں کے اختیار میں ہوتا ہے۔",
                "اس مال کو عوامی فلاح، دفاعی تیاری اور حکومتی اخراجات کے لیے استعمال کیا جاتا ہے۔"
              ],
              "english": [
                "Fai' is wealth obtained from the enemy without actual fighting, such as through peace treaties.",
                "This wealth is exclusively under the authority of the Prophet (ﷺ) and subsequent Muslim rulers.",
                "It is used for public welfare, military preparedness, and administrative expenses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا مالیاتی نظم و ضبط",
        "english": "Financial Discipline of the Prophet (ﷺ)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ خانہ کی کفالت",
              "english": "Support for the Family"
            },
            "content": {
              "urdu": [
                "آپ ﷺ اس مال سے اپنی ازواجِ مطہرات کا سال بھر کا خرچہ الگ فرما لیتے۔",
                "یہ اس بات کی دلیل ہے کہ حکمران اپنی اور اپنے زیرِ کفالت افراد کی جائز ضروریات سرکاری اموال سے پوری کر سکتا ہے۔",
                "آپ ﷺ کی زندگی زہد و قناعت کا اعلیٰ نمونہ تھی، ذخیرہ اندوزی آپ کا شیوہ نہ تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) would set aside a year's maintenance for his wives from this wealth.",
                "This proves that a ruler may fulfill his and his dependents' legitimate needs from state assets.",
                "The Prophet's (ﷺ) life was a pinnacle of asceticism; he never practiced hoarding."
              ]
            }
          },
          {
            "title": {
              "urdu": "دفاعی استحکام کو ترجیح",
              "english": "Prioritizing Defensive Strength"
            },
            "content": {
              "urdu": [
                "اہلِ خانہ کی ضروریات کے بعد بچ جانے والا تمام مال دفاعی مقاصد کے لیے وقف ہوتا۔",
                "آپ ﷺ اس سے جنگی گھوڑے اور اسلحہ (عدہ) خریدتے تاکہ دشمن کا مقابلہ کیا جا سکے۔",
                "ایک اسلامی ریاست کے لیے اپنی دفاعی طاقت کو مضبوط رکھنا شرعی فریضہ ہے۔"
              ],
              "english": [
                "All remaining funds after family needs were dedicated to defensive purposes.",
                "The Prophet (ﷺ) purchased war horses and weapons to ensure readiness against enemies.",
                "Strengthening defensive capabilities is a Sharia obligation for an Islamic state."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سیاسی پہلو",
        "english": "Juristic and Political Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیت المال کا تصور",
              "english": "Concept of the Public Treasury"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلامی معاشیات میں 'بیت المال' کے منظم استعمال کی بنیاد فراہم کرتی ہے۔",
                "حکمران مالِ فے کو ذاتی ملکیت سمجھنے کے بجائے اسے اللہ کی امانت سمجھ کر خرچ کرے۔",
                "مال کی تقسیم میں ترجیحات کا تعین (پہلے ضرورت، پھر دفاع) ایک حکیمانہ پالیسی ہے۔"
              ],
              "english": [
                "This Hadith lays the foundation for the organized use of the 'Public Treasury' in Islamic economics.",
                "The ruler should treat Fai' as a trust from Allah rather than personal property.",
                "Determining priorities in wealth distribution (needs first, then defense) is a wise policy."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستقبل کی منصوبہ بندی",
              "english": "Planning for the Future"
            },
            "content": {
              "urdu": [
                "سال بھر کا خرچہ الگ کرنا مستقبل کی منصوبہ بندی اور معاشی استحکام کی علامت ہے۔",
                "اسلام مسلمانوں کو نظم و ضبط اور دور اندیشی کی تعلیم دیتا ہے۔",
                "ریاست کو چاہیے کہ وہ ہنگامی حالات کے لیے وسائل کو محفوظ (ریزرو) رکھے۔"
              ],
              "english": [
                "Setting aside a year's maintenance signifies future planning and economic stability.",
                "Islam teaches Muslims discipline and long-term foresight.",
                "The state must keep resources in reserve for emergency situations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانت اور دیانت",
              "english": "Trust and Integrity"
            },
            "content": {
              "urdu": [
                "سیدنا عمر نے یہ حدیث وراثت کے ایک تنازع کے حل کے لیے بطور دلیل پیش فرمائی تھی۔",
                "انبیاء کا ترکہ وراثت میں تقسیم نہیں ہوتا بلکہ وہ صدقہ اور عوامی مفاد کے لیے ہوتا ہے۔",
                "حکمرانوں کو چاہیے کہ وہ عوامی اموال کے معاملے میں انتہائی شفافیت اختیار کریں۔"
              ],
              "english": [
                "Umar (RA) cited this Hadith as evidence to resolve a dispute regarding inheritance.",
                "The legacy of Prophets is not inherited by kin but remains as charity for public benefit.",
                "Rulers must maintain extreme transparency regarding public funds."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کا جامع نظام",
              "english": "The Comprehensive System of Islam"
            },
            "content": {
              "urdu": [
                "اسلام صرف عبادات کا نام نہیں بلکہ یہ معیشت اور سیاست کا مکمل ضابطہ ہے۔",
                "دین اور دنیا کے امور کو ساتھ لے کر چلنا ہی نبوی طریقہ کار ہے۔",
                "امن اور جنگ، دونوں حالتوں کے لیے اسلام نے واضح ہدایات دی ہیں۔"
              ],
              "english": [
                "Islam is not just about rituals; it is a complete code for economics and politics.",
                "Managing both religious and worldly affairs is the Prophetic methodology.",
                "Islam provides clear guidance for both states of peace and war."
              ]
            }
          }
        ]
      }
    }
  ]
}