{
  "hadithId": 537,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/537"],
    "kitabId": 5,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصيام",
    "babId": 33
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1965)، ومسلم (1103).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (1965) اور امام مسلم (1103) نے اسے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1965) and Muslim (1103)."
  },
  "importantWords": [
    {
      "arabic": "اَلْوِصَالِ",
      "english": "Continuous fasting (Wisal)",
      "urdu": "وصال (بغیر افطار مسلسل روزہ رکھنا)"
    },
    {
      "arabic": "أَبِيتُ",
      "english": "I spend the night",
      "urdu": "میں رات گزارتا ہوں"
    },
    {
      "arabic": "يُطْعِمُنِي",
      "english": "Feeds me",
      "urdu": "وہ مجھے کھلاتا ہے"
    },
    {
      "arabic": "كَالْمُنَكِّلِ",
      "english": "As an exemplary punishment",
      "urdu": "بطورِ تنبیہ یا سزا"
    },
    {
      "arabic": "أَبَوْا",
      "english": "They refused",
      "urdu": "انہوں نے انکار کیا"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے امت کو صومِ وصال (مسلسل بغیر افطار روزہ رکھنا) سے منع فرمایا ہے کیونکہ یہ جسمانی طور پر سخت ہے، جبکہ آپ ﷺ کے لیے یہ عمل اللہ کی خاص نصرت کی وجہ سے مخصوص تھا۔",
    "english": "The Prophet (ﷺ) prohibited the Ummah from continuous fasting (Wisal) to avoid undue hardship, clarifying that his ability to do so was a unique spiritual sustenance from Allah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1965)",
      "english": "Sahih al-Bukhari (1965)"
    },
    {
      "arabic": "صحيح مسلم (1103)",
      "english": "Sahih Muslim (1103)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صومِ وصال کی ممانعت",
        "english": "Prohibition of Al-Wisal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وصال کا مفہوم اور حکم",
              "english": "Meaning and Ruling of Wisal"
            },
            "content": {
              "urdu": [
                "صومِ وصال کا مطلب ہے کہ مغرب کے وقت افطار نہ کیا جائے اور اگلے دن کا روزہ بھی ساتھ ملا لیا جائے۔",
                "نبی ﷺ نے امت پر شفقت کرتے ہوئے اس سے منع فرمایا تاکہ لوگ کمزوری اور اکتاہٹ کا شکار نہ ہوں۔",
                "یہ ممانعت اس بات کی دلیل ہے کہ اسلام میں عبادت میں غلو اور حد سے زیادہ مشقت ناپسندیدہ ہے۔"
              ],
              "english": [
                "Al-Wisal refers to fasting for two or more days consecutively without breaking the fast at sunset.",
                "The Prophet (ﷺ) forbade it out of mercy for the Ummah to prevent physical weakness and spiritual exhaustion.",
                "This prohibition proves that extremism and undue hardship in worship are disliked in Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی خصوصیت",
              "english": "The Uniqueness of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے واضح فرمایا کہ ان کی روحانی کیفیت عام انسانوں جیسی نہیں ہے۔",
                "اللہ تعالیٰ آپ ﷺ کو خاص قوت اور غذا (روحانی یا جسمانی) عطا فرماتا تھا جس سے بھوک کا احساس نہیں ہوتا تھا۔",
                "یہ مقام صرف انبیاء کے لیے مخصوص ہے، اس میں امت کے لیے آپ ﷺ کی تقلید جائز نہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that his spiritual state was not like that of ordinary humans.",
                "Allah granted him special strength and sustenance (spiritual or physical) that warded off hunger.",
                "This status is exclusive to Prophets, and the Ummah is not permitted to imitate him in this specific regard."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کی تربیت کا انداز",
        "english": "The Method of Training the Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عملی تجربہ اور تنبیہ",
              "english": "Practical Experience and Warning"
            },
            "content": {
              "urdu": [
                "جب صحابہ نے شوقِ عبادت میں رکنے سے انکار کیا تو آپ ﷺ نے انہیں عملی طور پر اس کی مشقت دکھائی۔",
                "آپ ﷺ کا ان کے ساتھ وصال کرنا درحقیقت انہیں یہ سکھانا تھا کہ وہ اس بوجھ کو نہیں اٹھا سکتے۔",
                "’لو تأخر الهلال لزدتكم‘ کے الفاظ سے ان کی غلطی پر پیار بھری تنبیہ مقصود تھی۔"
              ],
              "english": [
                "When the Companions refused to stop out of desire for worship, the Prophet (ﷺ) showed them the hardship practically.",
                "By fasting with them, he intended to prove that they could not bear such a burden long-term.",
                "The phrase 'If the crescent had been delayed, I would have increased it' was a loving yet stern warning."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال کی تعلیم",
              "english": "Teaching Moderation"
            },
            "content": {
              "urdu": [
                "اسلام بندے کو اپنی جسمانی طاقت کے مطابق عبادت کرنے کا حکم دیتا ہے۔",
                "ایسی عبادت جو انسان کو دیگر فرائض (مثلاً حقوق العباد) سے معذور کر دے، وہ پسندیدہ نہیں ہے۔",
                "سنتِ نبوی کی پیروی ہی اصل نیکی ہے، اپنی مرضی سے سختیاں پیدا کرنا نہیں۔"
              ],
              "english": [
                "Islam commands the servant to worship according to their physical capacity.",
                "Any worship that renders a person incapable of fulfilling other duties (like rights of people) is not preferred.",
                "Following the Sunnah is true righteousness, not creating self-imposed hardships."
              ]
            }
          }
        ]
      }
    }
  ]
}