{
  "hadithId": 1108,
  "hadithNo": 29,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/29"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح. أخرجه مسلم في صحيحه (1456)، وأبو داود (2155)، والترمذي (1132)، والنسائي (6/110)، وأحمد (3/72).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام مسلم (1456)، ابوداؤد (2155)، ترمذی (1132) اور نسائی نے روایت کیا ہے۔ یہ آیت سورہ نساء کی آیت نمبر 24 ہے۔",
    "english": "Sahih. Reported by Muslim (1456), Abu Dawud (2155), At-Tirmidhi (1132), and An-Nasa'i. This refers to Surah An-Nisa, Verse 24."
  },
  "importantWords": [
    {
      "arabic": "سَبَايَا",
      "english": "Female Captives",
      "urdu": "جنگی قیدی عورتیں"
    },
    {
      "arabic": "أَوْطَاسٍ",
      "english": "Awtas",
      "urdu": "اوطاس (حنین کے قریب ایک وادی)"
    },
    {
      "arabic": "تَحَرَّجُوا",
      "english": "Felt hesitant/Sinned",
      "urdu": "حرج محسوس کیا/گناہ سمجھا"
    },
    {
      "arabic": "الْمُحْصَنَاتُ",
      "english": "Married women",
      "urdu": "پاکدامن/شوہر والی عورتیں"
    },
    {
      "arabic": "مَلَكَتْ أَيْمَانُكُمْ",
      "english": "What your right hands possess",
      "urdu": "تمہاری ملکیت (لونڈیاں)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں یہ شرعی اصول بیان کیا گیا ہے کہ دار الحرب سے قید ہو کر آنے والی شادی شدہ عورتوں کا نکاح ان کے کافر شوہروں سے ختم ہو جاتا ہے اور وہ عدت کے بعد اپنے مالک کے لیے حلال ہو جاتی ہیں۔",
    "english": "This Hadith clarifies that when non-Muslim married women are captured in war and brought to Islamic territory, their previous marriage is annulled, making them permissible for their masters after completing the waiting period."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1456)",
      "english": "Sahih Muslim (1456)"
    },
    {
      "arabic": "سنن أبي داود (2155)",
      "english": "Sunan Abi Dawud (2155)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آیت کا پس منظر",
        "english": "Background of the Verse"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا تقویٰ",
              "english": "Piety of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے قیدی عورتوں کے مشرک شوہروں کی موجودگی میں ان سے تعلق کو ناپسند کیا۔",
                "یہ ان کے اعلیٰ اخلاقی معیار اور خوفِ خدا کی علامت تھی کہ وہ بغیر دلیل قدم نہیں اٹھاتے تھے۔",
                "اللہ تعالیٰ نے ان کی الجھن دور کرنے کے لیے قرآنِ مجید کی آیت نازل فرمائی۔"
              ],
              "english": [
                "The Companions hesitated to have relations with captives whose husbands were still in enemy lands.",
                "This reflected their high moral standards and fear of Allah, seeking divine guidance before acting.",
                "Allah revealed a Quranic verse specifically to clarify this legal dilemma for them."
              ]
            }
          },
          {
            "title": {
              "urdu": "اوطاس کا معرکہ",
              "english": "The Battle of Awtas"
            },
            "content": {
              "urdu": [
                "اوطاس کی وادی میں ہوازن اور ثقیف کے قبائل سے مسلمانوں کا مقابلہ ہوا تھا۔",
                "اس جنگ میں مشرکین اپنی عورتوں اور بچوں کو بھی میدان میں لے آئے تھے۔",
                "فتح کے بعد یہ عورتیں اسلامی قانون کے تحت قیدی (لونڈیاں) بن گئیں۔"
              ],
              "english": [
                "The Battle of Awtas involved a clash with the tribes of Hawazin and Thaqif near Hunain.",
                "The polytheists had brought their families to the battlefield to ensure they fought to the end.",
                "After the victory, these women became captives under the prevailing laws of warfare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نکاح کی تنسیخ کا حکم",
        "english": "Ruling on Annulment of Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کا خاتمہ",
              "english": "Termination of Marriage"
            },
            "content": {
              "urdu": [
                "جب کوئی شادی شدہ عورت قید ہو کر دار الاسلام آ جائے تو اس کا سابقہ نکاح ختم ہو جاتا ہے۔",
                "مشرک شوہر سے جدائی اور قید ہونا نکاح ٹوٹنے کی شرعی وجہ بن جاتی ہے۔",
                "یہ حکم اس لیے ہے تاکہ قیدی عورتوں کی سماجی حیثیت متعین کی جا سکے۔"
              ],
              "english": [
                "When a married woman is captured and brought to Islamic territory, her previous marriage ends.",
                "Captivity and physical separation from the non-Muslim husband serve as grounds for annulment.",
                "This ruling was established to define the social and legal status of female captives."
              ]
            }
          },
          {
            "title": {
              "urdu": "استبراءِ رحم کی شرط",
              "english": "Condition of Istibra"
            },
            "content": {
              "urdu": [
                "لونڈی سے تعلق قائم کرنے سے پہلے ایک مرتبہ حیض آنا ضروری ہے تاکہ رحم پاک ہو جائے۔",
                "اگر عورت حاملہ ہو تو وضع حمل (بچے کی پیدائش) تک انتظار کرنا واجب ہے۔",
                "اسلام نے نسب کی حفاظت کے لیے یہ سخت ضابطہ مقرر کیا ہے۔"
              ],
              "english": [
                "One menstrual cycle (Istibra) is mandatory before relations to ensure the womb is empty.",
                "If the captive woman is pregnant, the master must wait until she gives birth.",
                "Islam instituted these strict regulations to protect the integrity of lineage and ancestry."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لونڈیوں کے حقوق",
              "english": "Rights of Female Servants"
            },
            "content": {
              "urdu": [
                "اسلام نے غلامی کے دور میں لونڈیوں کو تحفظ فراہم کیا اور ان کے استحصال کو روکا۔",
                "اگر لونڈی سے بچہ پیدا ہو جائے تو وہ 'ام ولد' بن جاتی ہے اور مالک اسے بیچ نہیں سکتا۔",
                "مالک کی وفات کے بعد ایسی عورت خود بخود آزاد ہو جاتی ہے۔"
              ],
              "english": [
                "Islam provided protection to female captives and prevented their exploitation during that era.",
                "If a captive bears a child for her master, she becomes 'Umm al-Walad' and cannot be sold.",
                "Such a woman is automatically granted her freedom upon the death of her master."
              ]
            }
          },
          {
            "title": {
              "urdu": "عصری تناظر",
              "english": "Modern Context"
            },
            "content": {
              "urdu": [
                "موجودہ دور میں بین الاقوامی معاہدوں کے تحت غلامی کا خاتمہ ہو چکا ہے۔",
                "مسلمان ان معاہدوں کی پاسداری کے پابند ہیں، لہذا اب یہ عمل رائج نہیں ہے۔",
                "یہ احکامات اس دور کے حالات اور عالمی رواج کے مطابق دیے گئے تھے۔"
              ],
              "english": [
                "In the modern era, slavery has been abolished through global international treaties.",
                "Muslims are bound to respect these agreements; therefore, these practices are no longer in effect.",
                "These rulings were specific to the social structures and global norms of that historical period."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شبہات کا ازالہ",
              "english": "Removing Doubts"
            },
            "content": {
              "urdu": [
                "دین کے کسی معاملے میں شک ہو تو اہل علم یا قرآن و سنت سے رجوع کرنا چاہیے۔",
                "صحابہ کا عمل بتاتا ہے کہ مشکوک کام سے بچنا ہی اصل تقویٰ ہے۔",
                "اللہ تعالیٰ نے زندگی کے ہر شعبے میں ہماری رہنمائی کے لیے اصول وضع فرمائے ہیں۔"
              ],
              "english": [
                "In case of doubt regarding religious matters, one must consult scholars or the Quran and Sunnah.",
                "The conduct of the Sahaba teaches that avoiding doubtful matters is the essence of piety.",
                "Allah has established principles to guide us in every single aspect of our lives."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسب کی حفاظت",
              "english": "Preservation of Lineage"
            },
            "content": {
              "urdu": [
                "اسلام میں خاندانی نظام اور حلال و حرام کی تمیز کو بہت اہمیت دی گئی ہے۔",
                "کسی کے نسب میں آمیزش کرنا بہت بڑا گناہ ہے۔",
                "پاکیزہ معاشرے کی بنیاد شرعی حدود کی پاسداری پر رکھی گئی ہے۔"
              ],
              "english": [
                "Islam places immense importance on the family system and distinguishing Halal from Haram.",
                "Confusing or corrupting lineage and ancestry is considered a severe sin in the faith.",
                "The foundation of a pure society is built upon the strict observance of Shariah limits."
              ]
            }
          }
        ]
      }
    }
  ]
}