{
  "hadithId": 494,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/muslim:980a",
      "https://sunnah.com/bukhari:1447"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (980) من حديث جابر. ورواه البخاري (1447) ومسلم (979) من حديث أبي سعيد الخدري. والحديث يحدد نصاب الفضة والإبل وزكاة الزراعة.",
    "urdu": "یہ حدیث صحیح ہے۔ جابر رضی اللہ عنہ کی روایت مسلم (980) میں ہے، جبکہ ابوسعید خدری رضی اللہ عنہ کی روایت بخاری (1447) اور مسلم (979) دونوں میں موجود ہے۔ یہ حدیث چاندی، اونٹ اور زرعی پیداوار کے نصاب کا تعین کرتی ہے۔",
    "english": "Authentic. Jabir's narration is in Muslim (980), while Abu Sa'id's version is in both Bukhari (1447) and Muslim (979). The Hadith defines the minimum threshold (Nisab) for silver, camels, and agricultural produce."
  },
  "importantWords": [
    {
      "arabic": "أَوَاقٍ",
      "english": "Uqiyah (singular of Awaki)",
      "urdu": "اوقیہ (ایک وزن)"
    },
    {
      "arabic": "الْوَرِقِ",
      "english": "Silver",
      "urdu": "چاندی"
    },
    {
      "arabic": "ذَوْدٍ",
      "english": "Camels (usually 3 to 10)",
      "urdu": "اونٹ"
    },
    {
      "arabic": "أَوْسُقٍ",
      "english": "Wasqs (measure of volume)",
      "urdu": "وسق (ایک پیمانہ)"
    },
    {
      "arabic": "حَبٍّ",
      "english": "Grains",
      "urdu": "غلہ / اناج"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تین اہم اشیاء کا نصاب بیان کیا گیا ہے: چاندی (5 اوقیہ)، اونٹ (5 عدد) اور زرعی پیداوار (5 وسق)۔ اس سے کم مقدار پر زکوٰۃ فرض نہیں ہوتی۔",
    "english": "This Hadith specifies the Nisab (minimum thresholds) for three categories: Silver (5 Uqiyah), Camels (5 in number), and Agricultural produce (5 Wasqs)."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (980)",
      "english": "Sahih Muslim (980)"
    },
    {
      "arabic": "صحيح البخاري (1447)",
      "english": "Sahih al-Bukhari (1447)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin 'Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_R_AAnM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "چاندی کا نصاب",
        "english": "Nisab for Silver"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانچ اوقیہ کی مقدار",
              "english": "Quantity of Five Uqiyah"
            },
            "content": {
              "urdu": [
                "ایک اوقیہ 40 درہم کا ہوتا ہے، لہٰذا پانچ اوقیہ 200 درہم کے برابر ہیں۔",
                "جدید اوزان کے مطابق یہ تقریباً 612 گرام چاندی بنتی ہے۔",
                "اگر کسی کے پاس اس سے کم چاندی ہو تو اس پر زکوٰۃ واجب نہیں ہے۔"
              ],
              "english": [
                "One Uqiyah equals 40 Dirhams, so five Uqiyah total 200 Dirhams.",
                "In modern units, this is approximately 612 grams of silver.",
                "No Zakat is mandatory if the amount of silver owned is less than this."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرح زکوٰۃ",
              "english": "Zakat Rate"
            },
            "content": {
              "urdu": [
                "نصاب پورا ہونے پر کل مال کا 2.5 فیصد (چالیسواں حصہ) زکوٰۃ دینا لازم ہے۔",
                "زکوٰۃ تب فرض ہوتی ہے جب نصاب پر ایک اسلامی سال گزر جائے۔",
                "یہ اصول نقدی (Cash) پر بھی لاگو ہوتا ہے جو چاندی کے نصاب کے برابر ہو۔"
              ],
              "english": [
                "Once the Nisab is reached, 2.5% (one-fortieth) of the total wealth is due.",
                "Zakat becomes obligatory after one lunar year passes over the Nisab.",
                "This principle also applies to cash holdings equivalent to the silver Nisab."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اونٹوں اور غلے کا نصاب",
        "english": "Nisab for Camels and Grains"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اونٹوں کا نصاب",
              "english": "Threshold for Camels"
            },
            "content": {
              "urdu": [
                "اگر اونٹوں کی تعداد 5 سے کم ہو تو ان میں زکوٰۃ نہیں ہے۔",
                "5 اونٹوں پر زکوٰۃ میں ایک بکری دی جاتی ہے۔",
                "یہ حکم ان اونٹوں کے لیے ہے جو جنگل میں چرنے والے (سائمہ) ہوں۔"
              ],
              "english": [
                "If the number of camels is fewer than 5, no Zakat is due.",
                "For 5 camels, the Zakat due is one sheep/goat.",
                "This ruling applies to camels that are freely pastured (Sa'imah)."
              ]
            }
          },
          {
            "title": {
              "urdu": "زرعی پیداوار (وسق)",
              "english": "Agricultural Produce (Wasq)"
            },
            "content": {
              "urdu": [
                "ایک وسق 60 صاع کا ہوتا ہے، لہٰذا پانچ وسق 300 صاع بنتے ہیں۔",
                "جدید پیمائش کے مطابق یہ تقریباً 653 کلوگرام یا 16 من کے برابر ہے۔",
                "اناج اور پھلوں کی زکوٰۃ (عشر) فصل کٹنے کے وقت ادا کی جاتی ہے۔"
              ],
              "english": [
                "One Wasq is 60 Sa', making five Wasqs equal to 300 Sa'.",
                "In modern units, this is roughly 653 kilograms.",
                "The Zakat on crops (Ushr) is paid at the time of harvest."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ میں معافی اور گنجائش",
        "english": "Exemptions and Flexibility in Zakat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کم مال پر رعایت",
              "english": "Concession for Small Assets"
            },
            "content": {
              "urdu": [
                "اسلام نے غریب اور متوسط طبقے کو زکوٰۃ کے بوجھ سے آزاد رکھا ہے۔",
                "نصاب کا تعین اس بات کی علامت ہے کہ زکوٰۃ صرف صاحبِ ثروت پر ہے۔",
                "اگر نصاب سے ایک تولہ یا ایک کلو بھی کم ہو تو زکوٰۃ فرض نہیں ہوگی۔"
              ],
              "english": [
                "Islam exempts the poor and middle class from the burden of Zakat.",
                "Setting a Nisab ensures Zakat is only taken from the wealthy.",
                "Even a small amount below the Nisab waives the obligatory status."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوش دلی سے صدقہ",
              "english": "Voluntary Charity"
            },
            "content": {
              "urdu": [
                "اگر نصاب سے کم مال ہو تو زکوٰۃ نہیں، مگر نفلی صدقہ کیا جا سکتا ہے۔",
                "اللہ تعالیٰ تھوڑے مال میں سے خرچ کرنے والوں کو بہت پسند فرماتا ہے۔",
                "فرض کی ادائیگی کے بعد بھی غریبوں کا خیال رکھنا مستحب ہے۔"
              ],
              "english": [
                "Zakat isn't due below Nisab, but voluntary charity is encouraged.",
                "Allah loves those who spend out of their small means.",
                "Caring for the needy beyond the obligatory Zakat is highly recommended."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل و انصاف کا قیام",
              "english": "Establishment of Justice"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کا نظام معاشی عدم توازن کو ختم کرنے کے لیے بنایا گیا ہے۔",
                "واضح نصاب کی موجودگی کسی بھی قسم کی زیادتی یا ناانصافی کو روکتی ہے۔",
                "مستحقین تک ان کا حق پہنچانا معاشرتی امن کی ضمانت ہے۔"
              ],
              "english": [
                "The Zakat system is designed to eliminate economic imbalance.",
                "A clear Nisab prevents any form of excess or injustice by collectors.",
                "Delivering rights to the needy guarantees social peace."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی درستی کی اہمیت",
              "english": "Importance of Correct Knowledge"
            },
            "content": {
              "urdu": [
                "عبادات کی قبولیت کے لیے ان کے شرعی پیمانوں کا جاننا ضروری ہے۔",
                "زکوٰۃ کے حساب میں ذرا سی غلطی غریب کا حق مارنے کا باعث بن سکتی ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی آمدنی اور اموال کے نصاب کا علم رکھے۔"
              ],
              "english": [
                "Knowing Shariah metrics is essential for the acceptance of worship.",
                "Small errors in calculation can result in depriving the poor of their rights.",
                "A Muslim must be knowledgeable about the thresholds of their income and assets."
              ]
            }
          }
        ]
      }
    }
  ]
}