{
  "hadithId": 1149,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1149"],
    "kitabId": 12,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيد والذبائح",
    "babId": 93
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5476)، ومسلم (1929). والمعراض: سهم بلا ريش ولا نصل يصيب بحدته تارة وبعرضه تارة أخرى. فما أصاب بحدته فهو مذكى، وما أصاب بعرضه فهو وقيد.",
    "urdu": "صحیح بخاری (5476) اور صحیح مسلم (1929) میں یہ روایت موجود ہے۔ معراض سے مراد وہ لکڑی یا تیر ہے جس کے پر نہ ہوں، اگر وہ نوک سے لگے تو حلال ہے اور اگر چوڑائی سے لگ کر جانور کو ہلاک کر دے تو وہ چوٹ سے مرا ہوا (موقوذ) شمار ہوگا۔",
    "english": "Sahih. Reported by Al-Bukhari (5476) and Muslim (1929). Al-Mi'rad is a heavy stick or a featherless arrow; if it pierces with its sharp point, the animal is lawful, but if it kills by its weight or broad side, it is considered 'Waqidh' and is unlawful."
  },
  "importantWords": [
    {
      "arabic": "المِعْرَاضِ",
      "english": "Heavy/Featherless arrow",
      "urdu": "بغیر پھل والا تیر"
    },
    {
      "arabic": "بِحَدِّهِ",
      "english": "With its sharp edge",
      "urdu": "اس کی دھار سے"
    },
    {
      "arabic": "بِعَرْضِهِ",
      "english": "With its broad side",
      "urdu": "اس کی چوڑائی سے"
    },
    {
      "arabic": "وَقِيذٌ",
      "english": "Killed by a blow",
      "urdu": "چوٹ سے مرا ہوا"
    },
    {
      "arabic": "فَلَا تَأْكُلْ",
      "english": "Do not eat",
      "urdu": "پس نہ کھاؤ"
    }
  ],
  "summary": {
    "urdu": "شکار کی حلت کے لیے شرط یہ ہے کہ آلہ شکار جانور کو زخمی کرے اور خون بہائے۔ اگر جانور صرف چوٹ کی شدت سے مر جائے تو وہ حرام ہے۔",
    "english": "For hunted game to be lawful, the weapon must pierce the skin and cause bleeding; if it kills by impact or force without piercing, it is unlawful."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5476)",
      "english": "Reported by Al-Bukhari (5476)"
    },
    {
      "arabic": "رواه مسلم (1929)",
      "english": "Reported by Muslim (1929)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عدي بن حاتم الطائي",
        "english": "Adi bin Hatim al-Ta'i"
      },
      "slug": "adi-bin-hatim"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F03vD8X6mO0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شکار کے حلال ہونے کی شرائط",
        "english": "Conditions for Lawful Hunting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون بہنا اور زخم لگنا",
              "english": "Bleeding and Piercing"
            },
            "content": {
              "urdu": [
                "شکار تب حلال ہوتا ہے جب وہ آلے کی نوک سے زخمی ہو کر مرے۔",
                "اگر لکڑی یا تیر کی چوڑائی جانور کو لگتی ہے تو وہ چوٹ بن جاتی ہے۔",
                "اسلامی ذبیحہ کے لیے خون کا بہنا ایک لازمی شرعی تقاضا ہے۔"
              ],
              "english": [
                "Game is lawful only if it is killed by the sharp point of the weapon.",
                "If the broad side of the wood hits the animal, it is a blunt force blow.",
                "Flowing of blood is a necessary Sharia requirement for animal slaughter."
              ]
            }
          },
          {
            "title": {
              "urdu": "موقوذہ کی حرمت",
              "english": "Prohibition of Waqidh"
            },
            "content": {
              "urdu": [
                "چوٹ سے مرنے والے جانور کو قرآن میں 'موقوذہ' کہہ کر حرام کیا گیا ہے۔",
                "ایسا جانور مردار کے حکم میں آتا ہے کیونکہ اس کا خون اندر رک جاتا ہے۔",
                "نبی کریم ﷺ نے صریح طور پر ایسے شکار کو کھانے سے منع فرمایا۔"
              ],
              "english": [
                "An animal killed by a blow is termed 'Waqidh' and forbidden in the Quran.",
                "Such an animal is considered carrion because the blood is trapped inside.",
                "The Prophet (SAW) explicitly forbade eating game killed in this manner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آلہ شکار کی اقسام",
        "english": "Types of Hunting Tools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معراض کی تعریف",
              "english": "Definition of Mi'rad"
            },
            "content": {
              "urdu": [
                "معراض ایک ایسی لکڑی ہے جو دونوں طرف سے پتلی اور درمیان سے موٹی ہو۔",
                "اسے پھینک کر مارا جاتا ہے، اس میں پر یا لوہے کی نوک نہیں ہوتی۔",
                "اگر یہ اپنی تیزی سے کھال پھاڑ دے تو شکار حلال مانا جائے گا۔"
              ],
              "english": [
                "A Mi'rad is a piece of wood thin at the ends and thick in the middle.",
                "It is thrown at game and does not traditionally have feathers or iron tips.",
                "If it tears the skin due to its sharpness, the game is considered Halal."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید آلات اور بندوق",
              "english": "Modern Tools and Guns"
            },
            "content": {
              "urdu": [
                "فقہاء نے گولی کے شکار پر اس حدیث کی روشنی میں بحث کی ہے۔",
                "گولی اگر جسم کو پھاڑ دے اور خون بہائے تو وہ حلال ہے۔",
                "اگر آلہ صرف بوجھ یا کرنٹ سے مارے تو وہ حلال نہیں ہوگا۔"
              ],
              "english": [
                "Jurists discuss hunting with bullets in light of this specific Hadith.",
                "If a bullet pierces the body and causes blood to flow, it is Halal.",
                "If a tool kills only by weight or electric shock, it is not permissible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و علمی نکات",
        "english": "Juristic and Scholarly Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیب اور بسم اللہ",
              "english": "Intention and Tasmiyah"
            },
            "content": {
              "urdu": [
                "آلہ چلاتے وقت اللہ کا نام لینا شکار کی حلت کے لیے ضروری ہے۔",
                "اگر بسم اللہ بھول جائے تو معاف ہے مگر جان بوجھ کر چھوڑنا درست نہیں۔",
                "یہ حدیث شکار کے باب میں ایک بنیادی فقہی قاعدہ فراہم کرتی ہے۔"
              ],
              "english": [
                "Mentioning Allah's name while launching the tool is essential for Halal status.",
                "Forgetting the Tasmiyah is excused, but intentionally omitting it is not.",
                "This Hadith provides a fundamental juristic rule in the chapter of hunting."
              ]
            }
          },
          {
            "title": {
              "urdu": "شکار کی تذکیہ",
              "english": "Slaughtering the Game"
            },
            "content": {
              "urdu": [
                "اگر شکار زندہ ملے تو اسے شرعی طریقے سے ذبح کرنا واجب ہے۔",
                "اگر وہ آلے کے زخم سے مر چکا ہو تو وہی اس کا ذبیحہ ہے۔",
                "شریعت نے کھانے پینے کے معاملات میں انتہائی پاکیزگی کا حکم دیا ہے۔"
              ],
              "english": [
                "If the hunted animal is found alive, it must be slaughtered Islamically.",
                "If it dies from the wound of the tool, that hit serves as its slaughter.",
                "Sharia commands extreme purity and hygiene in matters of food and drink."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال و حرام کی تمیز",
              "english": "Distinguishing Halal and Haram"
            },
            "content": {
              "urdu": [
                "مسلمان کو اپنی خوراک کے معاملے میں ہمیشہ محتاط رہنا چاہیے۔",
                "صرف وہی چیز کھانی چاہیے جس کے حلال ہونے پر پختہ یقین ہو۔",
                "شک کی صورت میں ایسی چیز سے بچنا تقویٰ کی علامت ہے۔"
              ],
              "english": [
                "A Muslim must always be careful regarding their source of food.",
                "One should only consume what is firmly believed to be Halal.",
                "In cases of doubt, avoiding such items is a sign of true piety."
              ]
            }
          },
          {
            "title": {
              "urdu": "جانوروں پر رحم",
              "english": "Mercy to Animals"
            },
            "content": {
              "urdu": [
                "شکار کے دوران بھی جانور کو کم سے کم تکلیف دینے کا حکم ہے۔",
                "تیز دھار والا آلہ استعمال کرنا چاہیے تاکہ جانور جلد ہلاک ہو جائے۔",
                "بے مقصد چوٹ مار کر جانور کو تڑپانا اسلامی تعلیمات کے خلاف ہے۔"
              ],
              "english": [
                "Even during hunting, there is a command to minimize animal suffering.",
                "Sharp tools should be used so the animal dies quickly and painlessly.",
                "Torturing an animal with blunt blows is against Islamic teachings."
              ]
            }
          }
        ]
      }
    }
  ]
}