{
  "hadithId": 848,
  "hadithNo": 25,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/25"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (1405)، وأخرجه البخاري مختصراً، وأحمد (4/47). وأوطاس وادٍ في ديار هوازن وقعت فيه الوقعة بعد حنين.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح (1405) میں روایت کیا ہے۔ اوطاس طائف کے قریب ایک وادی ہے جہاں فتح مکہ کے بعد جنگ ہوئی تھی۔",
    "english": "Sahih. Reported by Muslim (1405). Also found in brief in Bukhari and Ahmad. Autas is a valley where a battle occurred following the Conquest of Makkah."
  },
  "importantWords": [
    {
      "arabic": "رَخَّصَ",
      "english": "Permitted / Allowed",
      "urdu": "رخصت دی / اجازت دی"
    },
    {
      "arabic": "اَلْمُتْعَةِ",
      "english": "Temporary Marriage",
      "urdu": "نکاحِ متعہ"
    },
    {
      "arabic": "أَوْطَاسٍ",
      "english": "Autas (Place name)",
      "urdu": "اوطاس (مقام کا نام)"
    },
    {
      "arabic": "نَهَى",
      "english": "Forbade / Prohibited",
      "urdu": "منع کر دیا"
    },
    {
      "arabic": "ثَلَاثَةَ أَيَّامٍ",
      "english": "Three days",
      "urdu": "تین دن"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے جنگی حالات اور ضرورت کے تحت عارضی طور پر نکاحِ متعہ کی اجازت دی تھی، لیکن جلد ہی اسے قیامت تک کے لیے حرام قرار دے دیا گیا۔",
    "english": "The Prophet (ﷺ) temporarily allowed Mut'ah marriage due to extreme battlefield conditions, but shortly thereafter, he prohibited it forever."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤٠٥",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1405"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سلمة بن الأكوع",
        "english": "Salama bin al-Akwa'"
      },
      "slug": "salama-bin-al-akwa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاحِ متعہ کی حقیقت اور ممانعت",
        "english": "Reality and Prohibition of Mut'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاحِ متعہ کی تعریف",
              "english": "Definition of Mut'ah Marriage"
            },
            "content": {
              "urdu": [
                "متعہ سے مراد وہ نکاح ہے جو کسی خاص مدت (مثلاً چند دن یا مہینے) کے لیے کیا جائے۔",
                "اسلام کے ابتدائی دور میں جنگی حالات کی وجہ سے اس کی عارضی اجازت دی گئی تھی۔",
                "نکاح کا اصل مقصد مستقل رفاقت اور خاندان کی تشکیل ہے جو متعہ میں مفقود ہے۔"
              ],
              "english": [
                "Mut'ah refers to a marriage contracted for a specific limited duration.",
                "In the early days of Islam, it was temporarily permitted due to wartime hardships.",
                "The primary goal of marriage is lifelong companionship, which is absent in Mut'ah."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرمتِ ابدی کا حکم",
              "english": "Ruling on Eternal Prohibition"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے واضح فرمایا کہ اب یہ نکاح قیامت تک کے لیے حرام ہے۔",
                "اہلِ سنت والجماعت کے نزدیک متعہ زنا کے حکم میں ہے اور قطعی ناجائز ہے۔",
                "نبی ﷺ کے آخری احکامات نے پچھلی تمام عارضی اجازتوں کو منسوخ کر دیا تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that this type of marriage is now forbidden until Resurrection.",
                "Ahl al-Sunnah regard Mut'ah as effectively being adultery and strictly prohibited.",
                "The Prophet's final commands superseded and abrogated all previous temporary permissions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجازت کی حکمت اور منسوخی",
        "english": "Wisdom of Permission and Abrogation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عارضی اجازت کی وجہ",
              "english": "Reason for Temporary Allowance"
            },
            "content": {
              "urdu": [
                "صحابہ کرام طویل عرصے تک گھروں سے دور جنگی مہمات پر رہتے تھے۔",
                "شدید ضرورت اور فتنہ زنا سے بچنے کے لیے اسے ایک 'رخصت' کے طور پر دیا گیا تھا۔",
                "یہ بالکل ویسے ہی تھا جیسے مضطرب کے لیے مردار کھانا حلال ہو جاتا ہے۔"
              ],
              "english": [
                "Companions remained away from home for long periods during military campaigns.",
                "It was granted as a concession (Rukhsa) to avoid the trial of fornication.",
                "It was similar to the necessity that makes eating carrion lawful for the starving."
              ]
            }
          },
          {
            "title": {
              "urdu": "تدریجی احکام",
              "english": "Gradual Legislation"
            },
            "content": {
              "urdu": [
                "شراب کی طرح نکاحِ متعہ کی حرمت بھی تدریجی طور پر مکمل ہوئی تھی۔",
                "پہلے خیبر کے موقع پر اور پھر فتح مکہ پر اس کی قطعی ممانعت کر دی گئی۔",
                "اسلام نے انسانی سوسائٹی کو پاکیزہ بنانے کے لیے اس غیر فطری عمل کو جڑ سے کاٹ دیا۔"
              ],
              "english": [
                "Like alcohol, the prohibition of Mut'ah was implemented in gradual stages.",
                "Final prohibition occurred at Khaybar and was reinforced during the Conquest of Makkah.",
                "Islam uprooted this unnatural practice to purify and safeguard human society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاندانی نظام کا تحفظ",
        "english": "Preserving the Family System"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اولاد کے حقوق",
              "english": "Rights of Children"
            },
            "content": {
              "urdu": [
                "متعہ میں پیدا ہونے والی اولاد کے نسب اور پرورش کا کوئی مستقل انتظام نہیں ہوتا۔",
                "اسلامی نکاح اولاد کے حقوق اور وراثت کی ضمانت فراہم کرتا ہے۔",
                "عارضی نکاح معاشرتی خلفشار اور بچوں کی بربادی کا سبب بنتا ہے۔"
              ],
              "english": [
                "Mut'ah provides no stable framework for the lineage or upbringing of children.",
                "Islamic marriage guarantees the rights, identity, and inheritance of offspring.",
                "Temporary unions lead to social chaos and the neglect of children's welfare."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کا وقار",
              "english": "Dignity of Women"
            },
            "content": {
              "urdu": [
                "متعہ عورت کو ایک کرائے کی چیز بنا دیتا ہے جو اس کی تذلیل ہے۔",
                "نکاحِ شرعی عورت کو گھر کی ملکہ اور قانونی حقوق یافتہ شریکِ حیات بناتا ہے۔",
                "اسلام نے عورت کو 'استعمال' ہونے سے بچا کر اسے معزز مقام عطا کیا ہے۔"
              ],
              "english": [
                "Mut'ah treats a woman like a hired object, which is a humiliation to her.",
                "Legal marriage establishes her as the queen of the house with full legal rights.",
                "Islam protected women from being 'used' and granted them an honorable status."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجماعِ امت اور عملی سبق",
        "english": "Consensus and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ اور ائمہ کا اتفاق",
              "english": "Agreement of Companions and Imams"
            },
            "content": {
              "urdu": [
                "خلفائے راشدین اور تمام بڑے صحابہ اس کی حرمت پر متفق تھے۔",
                "جو روایات اباحت (اجازت) کی ملتی ہیں وہ سب منسوخ شدہ دور کی ہیں۔",
                "دین کے معاملے میں منسوخ اور ناسخ احکام کا علم ہونا انتہائی ضروری ہے۔"
              ],
              "english": [
                "The Rightly Guided Caliphs and major companions agreed on its prohibition.",
                "Any narrations suggesting permission belong to the period that was later abrogated.",
                "Knowledge of abrogating and abrogated rulings is vital in religious understanding."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور صبر",
              "english": "Piety and Patience"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ سخت حالات میں بھی اللہ کے حدود کی پابندی لازم ہے۔",
                "شہوت پر قابو پانے کے لیے روزہ رکھنا مسنون علاج ہے، نہ کہ عارضی نکاح۔",
                "ایمان کا تقاضا ہے کہ ہم وقتی لذت پر اللہ کے احکام کو ترجیح دیں۔"
              ],
              "english": [
                "This Hadith teaches that Allah's boundaries must be kept even in hard times.",
                "Fasting is the Sunnah remedy for controlling desire, not temporary marriage.",
                "Faith requires prioritizing Allah's commands over momentary physical pleasure."
              ]
            }
          }
        ]
      }
    }
  ]
}