{
  "hadithId": 103,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 103"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": " صحيح.  رواه مسلم (308) .  مستدرك الحاكم (152)  وهي زيادة صحيحة أيضا.",
    "urdu": "صحیح (درست) روایت۔ اسے مسلم (308) نے روایت کیا ہے۔ اور اس کا اضافہ مستدرک الحاکم (152) میں ہے، اور یہ اضافہ بھی صحیح ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (308). The addition is in Mustadrak Al-Hakim (152) and is also an authentic addition."
  },
  "importantWords": [
    {
      "arabic": "أَتَى أَهْلَهُ",
      "english": "He had intercourse with his wife",
      "urdu": "بیوی کے پاس گیا (جماع کیا)"
    },
    {
      "arabic": "يَعُودَ",
      "english": "To return/repeat",
      "urdu": "دوبارہ کرنا"
    },
    {
      "arabic": "فَلْيَتَوَضَّأْ",
      "english": "Let him perform Wudu'",
      "urdu": "وہ وضو کر لے"
    },
    {
      "arabic": "بَيْنَهُمَا",
      "english": "Between the two (acts)",
      "urdu": "دونوں کے درمیان"
    },
    {
      "arabic": "أَنْشَطُ",
      "english": "More revitalizing/energizing",
      "urdu": "زیادہ باعث نشاط"
    },
    {
      "arabic": "اَلْغُسْل",
      "english": "Ghusl (major bath)",
      "urdu": "غسل"
    },
    {
      "arabic": "اَلطَّهَارَة",
      "english": "Purity/cleansing",
      "urdu": "طہارت"
    },
    {
      "arabic": "زَادَ",
      "english": "He added (in narration)",
      "urdu": "اضافہ کیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس سنت کو بیان کرتی ہے کہ اگر کوئی شخص ایک ہی غسل سے پہلے اپنی بیوی سے دوبارہ مباشرت کرنا چاہے، تو دونوں کے درمیان وضو کر لینا مستحب ہے، تاکہ جسم میں تازگی اور نشاط پیدا ہو۔",
    "english": "This Hadith describes the Sunnah of performing Wudu' between two separate acts of intercourse before performing Ghusl, which is recommended to restore energy and freshness for the second attempt."
  },
  "references": [
    {
      "arabic": "رواه مسلم (308)",
      "english": "Reported by Muslim (308)"
    },
    {
      "arabic": "زَادَ اَلْحَاكِمُ (152)",
      "english": "Added by Al-Hakim (152)"
    },
    {
      "arabic": "صحيح الإسناد",
      "english": "Authentic Chain (for both the main text and the addition)"
    }
  ],
  "narrators": [
    {
      "id": 10301,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وضو کا حکم اور وجوب",
        "english": "The Ruling and Status of Wudu'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضو کا درجہ",
              "english": "The Status of Wudu'"
            },
            "content": {
              "urdu": [
                "اس حدیث میں وضو کا حکم وجوب کے لیے نہیں، بلکہ **استحباب** (پسندیدہ عمل) کے لیے استعمال ہوا ہے۔",
                "نبی ﷺ کے حکم کو وجوب کے بجائے سنت پر محمول کیا جائے گا، کیونکہ آپ نے دوسرے عمل کو صرف باعث نشاط قرار دیا۔",
                "اگر کوئی وضو کیے بغیر دوبارہ مباشرت کرنا چاہے تو اسے گناہ نہیں ہو گا، لیکن وہ ثواب سے محروم رہے گا۔"
              ],
              "english": [
                "The command for Wudu' in this Hadith is used for **Istihbab** (recommendation), not for obligation (Wujub).",
                "The Prophet's command is interpreted as Sunnah, as he described the action merely as being 'more revitalizing'.",
                "If a person wishes to resume intercourse without performing Wudu', they commit no sin, but they miss out on the reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل افضل ہے",
              "english": "Ghusl is Superior"
            },
            "content": {
              "urdu": [
                "یہ حکم اس صورت میں ہے جب دونوں مباشرتوں کے درمیان غسل نہ کیا جائے، لیکن دونوں کے درمیان **غسل کر لینا وضو سے بھی افضل ہے**۔",
                "غسل کرنے سے مکمل طہارت حاصل ہوتی ہے، اور دوبارہ مباشرت کے بعد ایک ہی غسل میں دونوں کی طہارت ہو جائے گی۔",
                "مسلمانوں کو چاہیے کہ وہ ہر حال میں فضیلت والے عمل (غسل) کی طرف رجوع کریں، بصورت دیگر وضو سے اکتفا کریں۔"
              ],
              "english": [
                "This ruling applies when Ghusl is not performed between the two acts; however, **performing Ghusl between them is superior to Wudu'**.",
                "Performing Ghusl ensures complete ritual purification, and the subsequent act will be covered by a single final Ghusl.",
                "Muslims should always strive for the superior act (Ghusl) if possible, otherwise, they may suffice with Wudu'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نشاط اور طبی حکمت",
        "english": "Revitalization and Medical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تازگی کا سبب",
              "english": "Source of Freshness"
            },
            "content": {
              "urdu": [
                "حاکم کا اضافہ کہ 'یہ دوبارہ مباشرت کیلئے زیادہ باعث نشاط ہے' اس حکم کی حکمت کو بیان کرتا ہے۔",
                "وضو کرنے سے جسم کے اہم اعضاء پر پانی لگتا ہے جو خون کی گردش کو تیز کرتا ہے اور تھکن کو دور کرتا ہے۔",
                "یہ سنت ہمیں سکھاتی ہے کہ اگر ہم دوبارہ مباشرت کرنا چاہیں تو طہارت اور جسمانی راحت کا اہتمام کریں۔"
              ],
              "english": [
                "Al-Hakim's addition, 'it is more revitalizing for the second time', explains the wisdom behind this ruling.",
                "Performing Wudu' involves applying water to key body parts, which stimulates circulation and helps remove fatigue.",
                "This Sunnah teaches us that if we intend to repeat intercourse, we should prioritize cleanliness and physical comfort."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی صفائی",
              "english": "Physical Cleanliness"
            },
            "content": {
              "urdu": [
                "وضو کے ذریعے شرمگاہ کے ارد گرد کی نجاستیں اور رطوبتیں دھل جاتی ہیں، جس سے دونوں ساتھیوں کو صفائی کا احساس ہوتا ہے۔",
                "یہ ایک بہترین عملی طریقہ ہے جس سے میاں بیوی کے تعلقات میں طہارت، محبت اور فرحت برقرار رہتی ہے۔",
                "یہ حکم طہارت کی اہمیت کو ازدواجی زندگی کے ہر پہلو میں شامل کرنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Wudu' ensures that the impurities and fluids around the private parts are washed away, giving both partners a sense of cleanliness.",
                "It is an excellent practical method that helps maintain purity, affection, and revitalization in the marital relationship.",
                "This ruling encourages integrating the importance of purification into every aspect of marital life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دیگر متعلقہ احکام",
        "english": "Other Related Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنابت کی حالت میں سونا",
              "english": "Sleeping in the State of Janabah"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ رضی اللہ عنہا کی دوسری روایت کے مطابق، نبی ﷺ حالت جنابت میں بغیر پانی کو ہاتھ لگائے سو جاتے تھے، جو معلول (ضعیف) ہے۔",
                "صحیح احادیث ثابت کرتی ہیں کہ نبی ﷺ سونے سے پہلے ہاتھ اور منہ دھو لیا کرتے تھے یا وضو کر لیا کرتے تھے، یہ مستحب عمل ہے۔",
                "سونے سے پہلے غسل کر لینا افضل ترین عمل ہے، لیکن کم از کم وضو کر لینا مستحب ہے۔"
              ],
              "english": [
                "The other narration of 'A'ishah (RA) mentioned in the Urdu text, stating the Prophet ﷺ used to sleep in Janabah without touching water, is considered 'Ma'lul' (defective/weak).",
                "Authentic Hadiths establish that the Prophet ﷺ used to wash his hands and face or perform Wudu' before sleeping, making this the recommended practice.",
                "The most virtuous act is to perform Ghusl before sleeping, but Wudu' at the very least is recommended."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو کا استعمال",
              "english": "The Use of Wudu'"
            },
            "content": {
              "urdu": [
                "وضو، جیسا کہ یہاں استعمال ہوا ہے، ایک مختصر اور آسانی والا عمل ہے جسے غسل سے پہلے کیا جا سکتا ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی طہارت کو مکمل رکھنے کے لیے ہر ایسے موقع پر وضو کرے جہاں طہارت ٹوٹنے کا احتمال ہو۔",
                "یہ حکم اس بات کی بھی وضاحت کرتا ہے کہ اسلام میں طہارت کو آسان بنایا گیا ہے تاکہ لوگ مشقت میں نہ پڑیں۔"
              ],
              "english": [
                "Wudu', as used here, is a quick and easy practice that can be performed prior to the full Ghusl.",
                "A Muslim should perform Wudu' on any occasion where ritual purity might be broken, in order to maintain cleanliness.",
                "This ruling also demonstrates that purity has been made easy in Islam so that people are not placed under hardship."
              ]
            }
          }
        ]
      }
    }
  ]
}
