{
  "hadithId": 396,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-396"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (891)‏، وأبو داود (1154)، والترمذي (534)، والنسائي (3/184)، وابن ماجه (1282).",
    "urdu": "یہ حدیث صحیح ہے اور صحیح مسلم (891) میں مروی ہے۔ دیگر کتبِ سنن (ابوداؤد، ترمذی، نسائی اور ابن ماجہ) میں بھی اس کے شواہد موجود ہیں۔",
    "english": "Sahih. Reported by Muslim (891), Abu Dawud (1154), At-Tirmidhi (534), An-Nasa'i (3/184), and Ibn Majah (1282)."
  },
  "importantWords": [
    {
      "arabic": "يَقْرَأُ",
      "english": "Recites",
      "urdu": "تلاوت فرماتے"
    },
    {
      "arabic": "اَلْأَضْحَى",
      "english": "Eid-ul-Adha",
      "urdu": "عید الاضحی"
    },
    {
      "arabic": "اَلْفِطْرِ",
      "english": "Eid-ul-Fitr",
      "urdu": "عید الفطر"
    },
    {
      "arabic": "ق",
      "english": "Surah Qaf",
      "urdu": "سورہ ق"
    },
    {
      "arabic": "اقْتَرَبَتْ",
      "english": "Surah al-Qamar",
      "urdu": "سورہ القمر"
    }
  ],
  "summary": {
    "urdu": "عیدین کی نماز میں سورہ ق اور سورہ القمر کی تلاوت کرنا مسنون عمل ہے، جو نبی کریم ﷺ کا مستقل معمول تھا۔",
    "english": "It is Sunnah to recite Surah Qaf and Surah al-Qamar during the Eid prayers, as it was the regular practice of the Prophet (ﷺ)."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (891)",
      "english": "Sahih Muslim (891)"
    },
    {
      "arabic": "سنن النسائي (184/3)",
      "english": "Sunan An-Nasa'i (3/184)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو واقد الليثي",
        "english": "Abu Waqid al-Laythi"
      },
      "slug": "abu-waqid-al-laythi"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=sunnah+surahs+for+eid+prayer+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تلاوتِ قرآن کی سنت",
        "english": "Sunnah of Quranic Recitation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مخصوص سورتوں کا انتخاب",
              "english": "Selection of Specific Surahs"
            },
            "content": {
              "urdu": [
                "نبی ﷺ عیدین کے بڑے اجتماعات میں سورہ ق اور سورہ القمر تلاوت فرماتے تھے۔",
                "ان سورتوں کا انتخاب ان کے عظیم معانی اور تذکیر کی وجہ سے کیا گیا تھا۔",
                "امام کے لیے ان سورتوں کی تلاوت کرنا مستحب اور باعثِ اجر ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) recited Surah Qaf and Surah al-Qamar in large Eid gatherings.",
                "These surahs were chosen for their profound meanings and powerful reminders.",
                "It is recommended and rewarding for the Imam to recite these specific surahs."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسرا مسنون طریقہ",
              "english": "Alternative Sunnah Method"
            },
            "content": {
              "urdu": [
                "دیگر روایات میں عیدین میں سورہ الاعلیٰ اور سورہ الغاشیہ کا ذکر بھی آتا ہے۔",
                "نبی ﷺ کبھی ان سورتوں کی تلاوت فرماتے اور کبھی سورہ ق اور القمر کی۔",
                "تنوع برقرار رکھنے کے لیے امام کو دونوں طریقوں پر عمل کرنا چاہیے۔"
              ],
              "english": [
                "Other narrations mention Surah al-A'la and Surah al-Ghashiyah for Eids.",
                "The Prophet (ﷺ) sometimes recited those and sometimes Qaf and al-Qamar.",
                "To maintain variety, the Imam should alternate between both Sunnah methods."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ان سورتوں کی حکمت",
        "english": "Wisdom of These Surahs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عقیدہ آخرت کی یاددہانی",
              "english": "Reminding of the Hereafter"
            },
            "content": {
              "urdu": [
                "سورہ ق اور سورہ القمر میں قیامت، حشر اور جزا و سزا کا تذکرہ ہے۔",
                "خوشی کے موقع پر آخرت کو یاد رکھنا انسان کو اعتدال میں رکھتا ہے۔",
                "یہ سورتیں انسان کو اللہ کی قدرت اور سابقہ اقوام کے انجام سے ڈراتی ہیں۔"
              ],
              "english": [
                "Surah Qaf and al-Qamar discuss Resurrection, the Gathering, and Recompense.",
                "Remembering the Hereafter during joy keeps a human in a state of moderation.",
                "These surahs warn of Allah's power and the fate of previous nations."
              ]
            }
          },
          {
            "title": {
              "urdu": "توحید اور رسالت کا اثبات",
              "english": "Affirming Monotheism and Prophethood"
            },
            "content": {
              "urdu": [
                "ان سورتوں میں توحید کے دلائل اور رسالت کی حقانیت بیان کی گئی ہے۔",
                "بڑے اجتماعات میں ان بنیادی عقائد کی تبلیغ کرنا نبوی حکمت عملی تھی۔",
                "یہ تلاوت دلوں میں ایمان کو تازہ کرنے اور یقین کو پختہ کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "These surahs detail proofs of Monotheism and the truth of Prophethood.",
                "Preaching these core beliefs in large gatherings was a Prophetic strategy.",
                "This recitation serves as a means to refresh faith and strengthen certainty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازِ عید کی انفرادیت",
        "english": "Uniqueness of Eid Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طویل تلاوت کی رعایت",
              "english": "Allowance for Longer Recitation"
            },
            "content": {
              "urdu": [
                "سورہ ق اور القمر نسبتاً طویل سورتیں ہیں جو عید کی اہمیت ظاہر کرتی ہیں۔",
                "عید کے دن لوگ خوشی اور اطمینان کے ساتھ طویل عبادت کے لیے تیار ہوتے ہیں۔",
                "امام کو مقتدیوں کی سہولت کا خیال رکھتے ہوئے مسنون سورتیں پڑھنی چاہئیں۔"
              ],
              "english": [
                "Surah Qaf and al-Qamar are relatively long, showing the importance of Eid.",
                "On Eid, people are prepared for longer worship with joy and tranquility.",
                "The Imam should recite Sunnah surahs while considering the followers' ease."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن سے تعلق",
              "english": "Connection with the Quran"
            },
            "content": {
              "urdu": [
                "عید کا دن اللہ کی کتاب سے اپنا تعلق مضبوط کرنے کا بہترین موقع ہے۔",
                "مسنون سورتوں کی تلاوت سے عید کی نماز میں روحانیت پیدا ہوتی ہے۔",
                "یہ عمل ہمیں بتاتا ہے کہ ہر خوشی کا مرکز اللہ کا کلام ہونا چاہیے۔"
              ],
              "english": [
                "Eid is an ideal opportunity to strengthen one's bond with the Book of Allah.",
                "Reciting Sunnah surahs brings spirituality into the Eid prayer.",
                "This practice teaches us that every celebration should center on Allah's Word."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کے مطابق عمل",
              "english": "Acting According to Sunnah"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ ہم عیدین کی نماز میں سنتِ نبوی کا اہتمام کریں۔",
                "ائمہ کرام کو ان سورتوں کو حفظ کرنا اور تلاوت کرنا چاہیے۔",
                "سنت پر عمل پیرا ہونا ہی اللہ کی محبت اور رضا پانے کا راستہ ہے۔"
              ],
              "english": [
                "We should ensure we implement the Prophetic Sunnah in Eid prayers.",
                "Imams should strive to memorize and recite these specific surahs.",
                "Following the Sunnah is the path to attaining Allah's love and pleasure."
              ]
            }
          },
          {
            "title": {
              "urdu": "غور و فکر کی دعوت",
              "english": "Invitation to Reflection"
            },
            "content": {
              "urdu": [
                "تلاوت سنتے وقت ان کے معانی اور مفاہیم پر غور کرنا چاہیے۔",
                "قرآن کی نصیحتوں کو اپنی عملی زندگی میں نافذ کرنے کی نیت کریں۔",
                "عید کا اصل مقصد بندگی کی روح کو تازہ کرنا اور تقویٰ حاصل کرنا ہے۔"
              ],
              "english": [
                "While listening to the recitation, one should reflect on its meanings.",
                "Intend to implement the Quranic admonitions in your daily practical life.",
                "The true purpose of Eid is to refresh the spirit of worship and gain piety."
              ]
            }
          }
        ]
      }
    }
  ]
}
