{
  "hadithId": 590,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/12"],
    "kitabId": 6,
    "inKitabBab": 2,
    "arabicBook": "كتاب الحج",
    "babId": 37
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1524)، ومسلم (1181). وهذا الحديث هو الأصل في تحديد المواقيت المكانية للحج والعمرة.",
    "urdu": "صحیح۔ اسے امام بخاری (1524) اور امام مسلم (1181) نے روایت کیا ہے۔ یہ حدیث حج اور عمرہ کے لیے میقات (حدود) کے تعین میں بنیادی نص ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1524) and Muslim (1181). This Hadith serves as the primary authority for defining the geographic boundaries (Mawaqit) for Hajj and Umrah."
  },
  "importantWords": [
    {
      "arabic": "وَقَّتَ",
      "english": "Fixed / Prescribed",
      "urdu": "مقرر کیا"
    },
    {
      "arabic": "مِيْقَات",
      "english": "Station / Limit",
      "urdu": "میقات / حد"
    },
    {
      "arabic": "أَنْشَأَ",
      "english": "Started / Settled",
      "urdu": "آغاز کیا"
    },
    {
      "arabic": "دُونَ ذَلِكَ",
      "english": "Within that",
      "urdu": "اس کے اندر / ورے"
    },
    {
      "arabic": "أَهْلُ مَكَّةَ",
      "english": "People of Makkah",
      "urdu": "اہلِ مکہ"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے مختلف علاقوں کے لیے حج و عمرہ کی میقاتیں مقرر فرمائیں جنہیں پار کرنے سے پہلے احرام باندھنا ضروری ہے۔",
    "english": "The Prophet (ﷺ) established specific stations (Mawaqit) for people from different regions to enter the state of Ihram before performing Hajj or Umrah."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1524)",
      "english": "Reported by Al-Bukhari (1524)"
    },
    {
      "arabic": "رواه مسلم (1181)",
      "english": "Reported by Muslim (1181)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fI7Y5E-u0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "میقاتوں کا تعین اور اہمیت",
        "english": "Fixing the Mawaqit and its Importance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی حدود کی پابندی",
              "english": "Adherence to Sharia Limits"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے مکہ کے اطراف میں پانچ میقاتیں مقرر فرمائیں جن کا ذکر حدیث میں ہے۔",
                "کسی بھی شخص کے لیے جو حج یا عمرہ کا ارادہ رکھتا ہو، ان حدود کو بغیر احرام پار کرنا منع ہے۔",
                "یہ حدود حرم کی تعظیم اور عبادت کی تیاری کا ایک اہم مرحلہ ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) established five stations around Makkah, as mentioned in the Hadith.",
                "Anyone intending Hajj or Umrah is forbidden from crossing these limits without entering Ihram.",
                "These boundaries serve as a mark of respect for the Haram and a preparation for worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "علاقائی میقاتیں",
              "english": "Regional Stations"
            },
            "content": {
              "urdu": [
                "مدینہ والوں کے لیے ذوالحلیفہ (آبار علی)، شام کے لیے جحفہ، نجد کے لیے قرن منازل ہیں۔",
                "یمن والوں کے لیے یلملم ہے، جبکہ دیگر علاقوں کے مسافر اپنے راستے میں آنے والی میقات سے احرام باندھیں۔",
                "اگر کوئی ہوائی جہاز میں ہو تو اسے میقات کی سیدھ میں آنے سے پہلے نیت کرنی چاہیے۔"
              ],
              "english": [
                "Dhul-Hulaifah is for Madinah, al-Juhfah for Sham, and Qarn al-Manazil for Najd.",
                "Yalamlam is for Yemen, while travelers from other regions use the station they pass by first.",
                "Travelers by air must declare their intention before reaching the parallel of their respective Miqat."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "میقات کے اندر رہنے والوں کا حکم",
        "english": "Ruling for those within the Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھر سے احرام باندھنا",
              "english": "Starting Ihram from Home"
            },
            "content": {
              "urdu": [
                "جو لوگ میقات اور مکہ کے درمیان رہتے ہیں، ان کی میقات ان کا اپنا گھر یا بستی ہے۔",
                "انہیں حج یا عمرہ کے لیے دور میقات پر جانے کی ضرورت نہیں ہے۔",
                "یہ شریعت کی دی ہوئی ایک بڑی آسانی ہے تاکہ مقامی لوگوں کو تنگی نہ ہو۔"
              ],
              "english": [
                "For those residing between the Miqat and Makkah, their station is their own home or town.",
                "They are not required to travel back to the distant regional Miqat for Hajj or Umrah.",
                "This is a major concession in Sharia to avoid unnecessary hardship for local residents."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلِ مکہ کا خصوصی حکم",
              "english": "Specific Ruling for Makkah Residents"
            },
            "content": {
              "urdu": [
                "اہلِ مکہ حج کے لیے مکہ سے ہی احرام باندھیں گے (مثلاً اپنے گھر یا مسجدِ حرام سے)۔",
                "تاہم، عمرہ کے لیے اہل مکہ کو حدودِ حرم سے باہر (مثلاً مسجدِ عائشہ) جانا ضروری ہے۔",
                "حج اور عمرہ کے احکامات میں اس باریک فرق کو سمجھنا بہت اہم ہے۔"
              ],
              "english": [
                "Residents of Makkah enter Ihram for Hajj from within Makkah (e.g., from home or the Haram).",
                "However, for Umrah, Makkans must go outside the Haram boundary (e.g., Masjid 'Aishah).",
                "It is vital to understand this subtle distinction between Hajj and Umrah regulations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور ابحاث",
        "english": "Juristic Issues and Discussions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "میقات سے پہلے احرام",
              "english": "Ihram Before the Miqat"
            },
            "content": {
              "urdu": [
                "میقات سے کچھ پہلے احرام باندھ لینا جائز ہے، خاص طور پر ہوائی سفر میں احتیاطاً ایسا کیا جاتا ہے۔",
                "تاہم، میقات کے گزرنے کے بعد بغیر احرام کے جانا گناہ ہے اور اس پر دم (قربانی) واجب ہوتا ہے۔",
                "نبی ﷺ کا وقت مقرر کرنا اس بات کی دلیل ہے کہ ان حدود کی بے حرمتی نہ کی جائے۔"
              ],
              "english": [
                "It is permissible to enter Ihram before the Miqat, often done as a precaution during air travel.",
                "However, crossing the Miqat without Ihram is a sin and necessitates an expiation (Dam).",
                "The Prophet's (ﷺ) fixing of limits proves that these boundaries must be strictly respected."
              ]
            }
          },
          {
            "title": {
              "urdu": "ارادہ نہ ہونے کی صورت",
              "english": "Case of No Intention"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص حج یا عمرہ کے ارادہ کے بغیر مکہ جائے تو اس پر احرام واجب نہیں۔",
                "میقات کا تعلق 'ارادہِ حج و عمرہ' سے ہے، محض سفر سے نہیں ہے۔",
                "تجارت یا ملازمت کے لیے جانے والوں کے لیے اس میں وسعت موجود ہے۔"
              ],
              "english": [
                "If a person enters Makkah without the intention of Hajj or Umrah, Ihram is not mandatory.",
                "The Miqat is linked to the 'intention' of pilgrimage, not just the physical travel itself.",
                "There is flexibility for those entering for trade, employment, or other personal needs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی تعلیم",
              "english": "Teaching Discipline"
            },
            "content": {
              "urdu": [
                "میقاتوں کا تعین ہمیں اسلامی عبادات میں نظم و ضبط سکھاتا ہے۔",
                "عبادت کا ایک وقت، ایک طریقہ اور ایک جگہ متعین ہونا اتحادِ امت کا مظہر ہے۔",
                "مومن کو چاہیے کہ وہ اللہ کے مقرر کردہ ضابطوں کی مکمل اطاعت کرے۔"
              ],
              "english": [
                "Fixing Mawaqit teaches us discipline in Islamic acts of worship.",
                "Having fixed times, methods, and places for worship manifests the unity of the Ummah.",
                "A believer must completely submit to the regulations established by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمِ دین کی اہمیت",
              "english": "Importance of Religious Knowledge"
            },
            "content": {
              "urdu": [
                "حج پر جانے سے پہلے ان جغرافیائی حدود کا علم ہونا ضروری ہے۔",
                "غلطی سے بچنے کے لیے علماء سے رہنمائی حاصل کرنا عبادت کا حصہ ہے۔",
                "دین کی سمجھ بوجھ اللہ کی طرف سے خیر کی نشانی ہے۔"
              ],
              "english": [
                "Knowledge of these geographic boundaries is essential before embarking on Hajj.",
                "Seeking guidance from scholars to avoid errors is itself a part of worship.",
                "Understanding the religion is a sign of goodness granted by Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}