{
  "hadithId": 531,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/531"],
    "kitabId": 5,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصيام",
    "babId": 33
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (2340)، والترمذي (691)، والنسائي (2112)، وابن ماجه (1652). سماك بن حرب اضطرب فيه، ورجح النسائي وغيره إرساله، لكن معناه صحيح تشهد له أحاديث أخرى.",
    "urdu": "یہ روایت سنداً ضعیف ہے، اسے ابوداؤد (2340)، ترمذی (691) اور نسائی (2112) نے روایت کیا ہے۔ امام نسائی نے اس کے مرسل ہونے کو ترجیح دی ہے، البتہ دیگر احادیث اس کے معنی کی تائید کرتی ہیں۔",
    "english": "Weak chain. Reported by Abu Dawud (2340), At-Tirmidhi (691), and An-Nasa'i (2112). Sammak bin Harb had inconsistencies in this narration, and An-Nasa'i preferred its Mursal form. However, its meaning is supported by other Sahih texts."
  },
  "importantWords": [
    {
      "arabic": "أَعْرَابِيًّا",
      "english": "Bedouin/Desert Arab",
      "urdu": "دیہاتی / بدو"
    },
    {
      "arabic": "أَتَشْهَدُ",
      "english": "Do you bear witness",
      "urdu": "کیا تم گواہی دیتے ہو"
    },
    {
      "arabic": "فَأَذِّنْ",
      "english": "So announce/Call out",
      "urdu": "پس منادی کر دو / پکارو"
    },
    {
      "arabic": "غَدًا",
      "english": "Tomorrow",
      "urdu": "کل / آنے والا کل"
    },
    {
      "arabic": "الْهِلَالَ",
      "english": "Crescent moon",
      "urdu": "پہلی کا چاند"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے ایک دیہاتی کے ایمان کی تصدیق کے بعد اس کی چاند دیکھنے کی خبر کو قبول فرمایا، جو اس بات کی دلیل ہے کہ رمضان کے لیے ایک معتبر مسلمان کی گواہی کافی ہے۔",
    "english": "The Prophet (ﷺ) accepted the moon sighting report of a Bedouin after confirming his faith, proving that a single reliable Muslim's testimony is sufficient for starting Ramadan."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2340)",
      "english": "Sunan Abi Dawud (2340)"
    },
    {
      "arabic": "سنن الترمذي (691)",
      "english": "Sunan At-Tirmidhi (691)"
    },
    {
      "arabic": "سنن النسائي (2112)",
      "english": "Sunan An-Nasa'i (2112)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A8vNfB2u3qM",
  "grade": {
    "arabic": "ضعيف (بمعنى صحيح)",
    "english": "Weak (with correct meaning)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "گواہ کی معتبریت کی شرط",
        "english": "Condition of Witness Credibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کی بنیادی شرط",
              "english": "The Basic Condition of Faith"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے چاند کی خبر لینے سے پہلے اعرابی سے اس کے ایمان کے بارے میں سوال کیا۔",
                "شرعی معاملات میں صرف اسی کی گواہی مقبول ہے جو اللہ اور اس کے رسول پر یقین رکھتا ہو۔",
                "ایک مسلمان کی بات پر اعتماد کرنا اسلامی معاشرت کا ایک اہم ستون ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) inquired about the Bedouin's faith before accepting his report.",
                "In Shariah matters, testimony is only accepted from one who believes in Allah and His Messenger.",
                "Trusting the word of a fellow Muslim is a foundational pillar of Islamic social conduct."
              ]
            }
          },
          {
            "title": {
              "urdu": "خبرِ واحد کی اہمیت",
              "english": "Importance of a Single Report"
            },
            "content": {
              "urdu": [
                "رمضان کے آغاز کے لیے ایک سچے مسلمان کی گواہی کو کافی سمجھا گیا ہے۔",
                "یہ امت کے لیے آسانی پیدا کرنے کا ایک ذریعہ ہے تاکہ کسی کا روزہ ضائع نہ ہو۔",
                "نبی ﷺ نے دیہاتی ہونے کے باوجود اس کی سچائی پر بھروسہ کرتے ہوئے حکم جاری فرمایا۔"
              ],
              "english": [
                "A single truthful Muslim's testimony is deemed sufficient for the start of Ramadan.",
                "This serves as a means of ease for the Ummah so that no obligatory fast is missed.",
                "The Prophet (ﷺ) trusted the man's truthfulness despite him being a simple Bedouin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اعلانات اور اجتماعی نظم",
        "english": "Announcements and Collective Order"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سرکاری منادی کا طریقہ",
              "english": "Method of Official Announcement"
            },
            "content": {
              "urdu": [
                "حضرت بلالؓ کو منادی کا حکم دینا ظاہر کرتا ہے کہ چاند کا اعلان سرکاری سطح پر ہونا چاہیے۔",
                "اجتماعی عبادات میں نظم و ضبط برقرار رکھنے کے لیے ایک مرکزی اعلان ضروری ہے۔",
                "لوگوں تک صحیح وقت پر معلومات پہنچانا انتظامیہ کی ذمہ داری ہے۔"
              ],
              "english": [
                "Ordering Bilal (RA) to announce shows that moon sighting should be declared officially.",
                "A central announcement is necessary to maintain discipline in collective acts of worship.",
                "It is the responsibility of the authorities to convey accurate information to the public on time."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظمِ جماعت کی اطاعت",
              "english": "Obedience to Communal Order"
            },
            "content": {
              "urdu": [
                "اعلانِ نبوی کے بعد تمام مسلمانوں پر کل کا روزہ رکھنا لازم ہو گیا۔",
                "انفرادی رائے کے بجائے اجتماعی فیصلے کی پیروی کرنا تفرقہ بازی سے بچاتا ہے۔",
                "اسلامی ریاست میں عبادت کے اوقات کا تعین حاکمِ وقت کی ذمہ داری ہے۔"
              ],
              "english": [
                "After the prophetic announcement, fasting the next day became mandatory for all Muslims.",
                "Following the collective decision instead of individual opinions prevents sectarian division.",
                "In an Islamic state, determining the timings of worship is the responsibility of the ruler."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعرابی کی گواہی",
              "english": "Testimony of a Bedouin"
            },
            "content": {
              "urdu": [
                "اعرابی (دیہاتی) کی گواہی قبول کرنا ثابت کرتا ہے کہ علم و فضل کے بجائے صرف سچائی معیار ہے۔",
                "دین میں دیہاتی اور شہری کے درمیان حقوق و فرائض میں کوئی فرق نہیں ہے۔",
                "اگر گواہ عادل اور سچا ہے تو اس کا پس منظر اہمیت نہیں رکھتا۔"
              ],
              "english": [
                "Accepting a Bedouin's testimony proves that truthfulness is the criterion, not status or education.",
                "In religion, there is no difference between a villager and a city dweller in rights and duties.",
                "If a witness is upright and truthful, their social background does not matter."
              ]
            }
          },
          {
            "title": {
              "urdu": "شک کی گنجائش ختم کرنا",
              "english": "Eliminating Scope for Doubt"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے گواہ کے کلمہ پڑھنے سے اس کے قول کی سچائی پر مہر ثبت فرمائی۔",
                "ایمان کے اقرار کے بعد کسی مسلمان کی بات کو بلاوجہ رد کرنا درست نہیں۔",
                "یہ حدیث شک کے دنوں کو یقین میں بدلنے کا بہترین طریقہ سکھاتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) validated the man's words by confirming his declaration of faith.",
                "It is incorrect to reject a Muslim's statement without reason after their profession of faith.",
                "This Hadith teaches the best way to transform days of doubt into days of certainty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانت داری کی اہمیت",
              "english": "Importance of Honesty"
            },
            "content": {
              "urdu": [
                "ایک شخص کی سچائی پوری قوم کے لیے عبادت کی راہ ہموار کر سکتی ہے۔",
                "ہمیں اپنی گفتگو اور گواہی میں انتہائی دیانت داری سے کام لینا چاہیے۔",
                "سچی گواہی دینا اللہ کے ہاں بہت بڑا اجر و ثواب رکھتا ہے۔"
              ],
              "english": [
                "The truthfulness of one individual can pave the way for an entire nation's worship.",
                "We must exercise extreme honesty in our speech and in giving testimony.",
                "Bearing truthful witness carries an immense reward with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی شعور اور بیداری",
              "english": "Religious Awareness and Vigilance"
            },
            "content": {
              "urdu": [
                "چاند دیکھنے کی کوشش کرنا اور دوسروں کو بتانا دینی ذمہ داری کا احساس دلاتا ہے۔",
                "نیکی کے کاموں میں ایک دوسرے کا تعاون کرنا معاشرتی بہتری لاتا ہے۔",
                "اسلامی احکامات پر بروقت عمل کرنا ہی اصل کامیابی ہے۔"
              ],
              "english": [
                "Striving to sight the moon and informing others instills a sense of religious duty.",
                "Cooperating with each other in virtuous deeds leads to social improvement.",
                "Timely compliance with Islamic commands is the essence of true success."
              ]
            }
          }
        ]
      }
    }
  ]
}