{
  "hadithId": 329,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["abudawud:667", "nasai:815"],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب الصلاة",
    "babId": 20
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (667)، والنسائي (815)، وابن حبان (2166). وزادوا جميعا: \"فوالذي نفسي بيده إني لأرى الشيطان يدخل من خلل الصف كأنها الحذف\".",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (667) اور نسائی (815) نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔ اس روایت کے آخر میں یہ اضافہ بھی ہے کہ نبی ﷺ نے فرمایا: ”اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! میں شیطان کو دیکھتا ہوں کہ وہ صفوں کے خلا سے اس طرح داخل ہوتا ہے جیسے بکری کا چھوٹا بچہ۔“",
    "english": "Sahih (Authentic). Reported by Abu Dawud (667), An-Nasa'i (815), and Ibn Hibban (2166). They all added the Prophet's (ﷺ) statement: 'By Him in Whose Hand is my soul, I see the devil entering through the gaps in the row like a small black sheep (hadhaf).'"
  },
  "importantWords": [
    {
      "arabic": "رُصُّوا",
      "english": "Stand close together / Align firmly",
      "urdu": "مضبوطی سے ملاؤ / پیوست کرو"
    },
    {
      "arabic": "قَارِبُوا",
      "english": "Keep them near / Reduce distance",
      "urdu": "قریب قریب رکھو / فاصلہ کم کرو"
    },
    {
      "arabic": "حَاذُوا",
      "english": "Align / Be parallel",
      "urdu": "برابر رکھو / محاذ میں رہو"
    },
    {
      "arabic": "الْحَذَف",
      "english": "Small black sheep",
      "urdu": "بکری کا چھوٹا بچہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز باجماعت میں صفوں کو درست کرنے، کندھے سے کندھا ملانے اور صفوں کے درمیان غیر ضروری خلا کو ختم کرنے کی اہمیت پر زور دیتی ہے۔",
    "english": "This Hadith emphasizes the importance of straightening the rows in congregational prayer, standing close together, and eliminating gaps between worshipers."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (667)",
      "english": "Sunan Abu Dawud (667)"
    },
    {
      "arabic": "سنن النسائي (815)",
      "english": "Sunan an-Nasa'i (815)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صفوں کی درستگی کی اہمیت",
        "english": "Importance of Straightening Rows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کا کمال",
              "english": "Perfection of Prayer"
            },
            "content": {
              "urdu": [
                "صفوں کو سیدھا اور برابر رکھنا نماز کے کمال اور اس کی خوبصورتی کا حصہ ہے۔",
                "نبی کریم ﷺ نماز شروع کرنے سے پہلے خود صفوں کو برابر کرواتے تھے اور مقتدیوں کو اس کی تاکید فرماتے تھے۔",
                "صفوں کا ٹیڑھا پن دلوں میں اختلاف اور دوری پیدا کرنے کا سبب بنتا ہے۔"
              ],
              "english": [
                "Keeping the rows straight and equal is part of the perfection and beauty of the prayer.",
                "The Prophet (ﷺ) used to personally ensure the rows were aligned before starting the prayer.",
                "Crookedness in rows can lead to discord and emotional distance between hearts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صفوں میں ملاوٹ اور قربت",
        "english": "Closeness in the Rows"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خلا کو پر کرنا",
              "english": "Filling the Gaps"
            },
            "content": {
              "urdu": [
                "مقتدیوں کو چاہیے کہ وہ ایک دوسرے کے ساتھ جڑ کر کھڑے ہوں تاکہ شیطان کے لیے جگہ نہ رہے۔",
                "صفوں کے درمیان اتنا فاصلہ نہیں ہونا چاہیے کہ ایک اور صف کی جگہ بن جائے، بلکہ صفیں قریب قریب ہونی چاہئیں۔",
                "گردنوں، کندھوں اور ٹخنوں کو ایک دوسرے کے برابر رکھنا صف کی برابری کے لیے ضروری ہے۔"
              ],
              "english": [
                "Worshipers should stand close together to leave no room for Satan.",
                "There should not be enough space between rows for another row; rows must be near each other.",
                "Aligning necks, shoulders, and ankles is necessary for a perfectly straight row."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شیطان کا عمل اور خلل",
        "english": "Satanic Interference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان کے وسوسے",
              "english": "Satan's Whispers"
            },
            "content": {
              "urdu": [
                "حدیث میں واضح کیا گیا کہ صفوں کا خلا شیطان کو داخل ہونے کا موقع دیتا ہے تاکہ وہ نمازیوں کے خشوع میں خلل ڈالے۔",
                "باہمی پیوستگی مسلمانوں کی قوت اور اتحاد کی علامت ہے جسے توڑنا شیطان کا ہدف ہوتا ہے۔",
                "امام کو چاہیے کہ جب تک صفیں درست نہ ہوں، تکبیرِ تحریمہ نہ کہے۔"
              ],
              "english": [
                "The Hadith clarifies that gaps in the row allow Satan to enter and disrupt the focus of the worshipers.",
                "Standing together firmly is a symbol of Muslim unity, which Satan aims to break.",
                "The Imam should not start the prayer until the rows are properly aligned."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتحاد اور نظم و ضبط",
              "english": "Unity and Discipline"
            },
            "content": {
              "urdu": [
                "مسجد کی صفیں ہمیں عملی طور پر نظم و ضبط اور مساوات کا سبق دیتی ہیں۔",
                "نماز میں جڑ کر کھڑے ہونا ہمیں سماجی زندگی میں بھی متحد رہنے کی ترغیب دیتا ہے۔",
                "ہمیں چاہیے کہ مسجد میں داخل ہوتے ہی پہلی صف کو مکمل کریں اور خلا کو پر کرنے میں پہل کریں۔"
              ],
              "english": [
                "Mosque rows practically teach us discipline and equality.",
                "Standing together in prayer encourages us to remain united in social life.",
                "Upon entering the mosque, we should prioritize completing the first row and filling any gaps."
              ]
            }
          }
        ]
      }
    }
  ]
}