{
  "hadithId": 629,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["bulugh/629"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1751). والحديث يصف جمرة أيام التشريق الثلاثة.",
    "urdu": "صحیح۔ اسے امام بخاری (1751) نے روایت کیا ہے۔ یہ حدیث ایامِ تشریق (11، 12، 13 ذوالحجہ) کی رمی اور اس کے بعد دعا کے مسنون طریقے کو بیان کرتی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1751). This Hadith describes the stoning procedure during the three days of Tashriq."
  },
  "importantWords": [
    {
      "arabic": "الْجَمْرَةَ اَلدُّنْيَا",
      "english": "The nearest/first pillar",
      "urdu": "پہلا جمرہ (جو مسجد خیف کے قریب ہے)"
    },
    {
      "arabic": "يُسْهِلُ",
      "english": "To reach a flat area",
      "urdu": "ہموار جگہ پر آنا"
    },
    {
      "arabic": "يَسْتَقْبِلُ اَلْقِبْلَةَ",
      "english": "Facing the Qiblah",
      "urdu": "قبلہ رخ ہونا"
    },
    {
      "arabic": "يَرْفَعُ يَدَيْهِ",
      "english": "Raising his hands",
      "urdu": "اپنے دونوں ہاتھ اٹھانا"
    },
    {
      "arabic": "لَا يَقِفُ عِنْدَهَا",
      "english": "He did not stand by it",
      "urdu": "اس کے پاس نہ ٹھہرتے"
    }
  ],
  "summary": {
    "urdu": "ایامِ تشریق میں تینوں جمرات کی رمی ترتیب سے کرنا سنت ہے؛ پہلے اور دوسرے جمرہ کے بعد قبلہ رخ ہو کر لمبی دعا مانگنی چاہیے، جبکہ تیسرے جمرہ کے بعد نہیں رکنا چاہیے۔",
    "english": "During the days of Tashriq, stoning the three pillars in order is Sunnah. Supplication facing the Qiblah should follow the first and second pillars, but one should depart immediately after the third."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1751)",
      "english": "Reported by Al-Bukhari (1751)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایامِ تشریق کی رمی کی ترتیب",
        "english": "Order of Ramy during Tashriq Days"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تینوں جمرات کی ترتیب",
              "english": "Sequence of the Three Pillars"
            },
            "content": {
              "urdu": [
                "11، 12 اور 13 ذوالحجہ کو زوالِ آفتاب کے بعد تینوں جمرات کی رمی واجب ہے۔",
                "ترتیب یہ ہے کہ پہلے جمرہ اولیٰ (چھوٹا)، پھر جمرہ وسطیٰ (درمیانہ) اور آخر میں جمرہ عقبہ (بڑا) کو کنکریاں ماری جائیں۔",
                "اگر ترتیب بدل دی جائے تو جمہور فقہاء کے نزدیک وہ رمی درست نہیں ہوگی اور اسے دہرانا پڑے گا۔"
              ],
              "english": [
                "On the 11th, 12th, and 13th of Dhul-Hijjah, stoning all three pillars after zenith is mandatory.",
                "The sequence is: the Small Pillar (al-Sughra), then the Middle Pillar (al-Wusta), and finally the Large Pillar (al-Aqaba).",
                "According to the majority of jurists, if this order is violated, the stoning is invalid and must be repeated."
              ]
            }
          },
          {
            "title": {
              "urdu": "کنکریوں کی تعداد اور تکبیر",
              "english": "Number of Pebbles and Takbir"
            },
            "content": {
              "urdu": [
                "ہر جمرہ کو سات سات کنکریاں ماری جاتی ہیں، یعنی ایک دن میں کل 21 کنکریاں۔",
                "ہر کنکری پھینکتے وقت 'اللہ اکبر' کہنا سنتِ نبوی ہے۔",
                "یہ کنکریاں مارنا دراصل شیطان کی تحقیر اور اللہ کی یاد کو قائم کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Seven pebbles are thrown at each pillar, totaling 21 pebbles per day.",
                "Saying 'Allahu Akbar' with each throw is a Prophetic Sunnah.",
                "This ritual symbolizes the humiliation of Satan and the establishment of Allah's remembrance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رمی کے بعد دعا کا مسنون طریقہ",
        "english": "Sunnah Method of Supplication After Ramy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کے مقامات",
              "english": "Locations for Supplication"
            },
            "content": {
              "urdu": [
                "پہلے اور دوسرے جمرہ کی رمی کے بعد تھوڑا آگے بڑھ کر راستہ چھوڑ کر کھڑے ہونا اور دعا کرنا سنت ہے۔",
                "تیسرے جمرہ (عقبہ) کے بعد دعا کے لیے رکنا ثابت نہیں ہے، وہاں سے فوراً نکل جانا چاہیے۔",
                "فقہاء فرماتے ہیں کہ جہاں اس کے بعد کوئی اور رمی باقی ہو وہاں دعا ہے، جہاں عمل ختم ہو جائے وہاں دعا نہیں۔"
              ],
              "english": [
                "After the first and second pillars, it is Sunnah to move slightly forward, away from the path, and supplicate.",
                "Standing for prayer after the third pillar (al-Aqaba) is not established; one should depart immediately.",
                "Jurists note that supplication occurs when another stoning follows, but not after the final stoning of the day."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی ہیئت اور طوالت",
              "english": "Posture and Length of Supplication"
            },
            "content": {
              "urdu": [
                "دعا کے وقت قبلہ رخ ہونا اور ہاتھ اٹھانا سنت ہے۔",
                "نبی ﷺ ان مقامات پر اتنی دیر رکتے تھے جتنی دیر میں سورہ بقرہ پڑھی جا سکے (بہت لمبی دعا)۔",
                "یہ وقت قبولیتِ دعا کا بہترین وقت ہے، حاجی کو چاہیے کہ یہاں گریہ و زاری کے ساتھ دعا کرے۔"
              ],
              "english": [
                "Facing the Qiblah and raising one's hands during this supplication is Sunnah.",
                "The Prophet (ﷺ) would stand at these spots for as long as it takes to recite Surah al-Baqarah (a very long time).",
                "This is a prime time for the acceptance of prayers; pilgrims should supplicate with humility and earnestness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور انتظامی باریکیاں",
        "english": "Juristic and Administrative Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وادی کے نشیب سے رمی",
              "english": "Stoning from the Valley Floor"
            },
            "content": {
              "urdu": [
                "جمرہ عقبہ کی رمی کے لیے سنت یہ ہے کہ وادی کے اندر کھڑے ہو کر اسے مارا جائے۔",
                "پہلے دو جمرات کے لیے قبلہ رخ ہو کر کھڑے ہونا ممکن ہے، لیکن جمرہ عقبہ کے وقت مکہ بائیں طرف ہوتا ہے۔",
                "اب پلوں کی تعمیر کے بعد کسی بھی طرف سے مارنا جائز ہے، بشرطیکہ کنکری حوض میں گرے۔"
              ],
              "english": [
                "The Sunnah for Jamrat al-Aqaba is to stone it while standing within the valley floor.",
                "For the first two, one can face the Qiblah, but for the third, Makkah is traditionally on the left.",
                "With modern structures, stoning from any side is valid as long as the pebble lands in the basin."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہجوم میں دعا کا حکم",
              "english": "Supplication in Crowds"
            },
            "content": {
              "urdu": [
                "اگر ہجوم بہت زیادہ ہو اور رکنے سے دوسروں کو تکلیف ہو، تو چلتے ہوئے دعا کر لینی چاہیے۔",
                "دوسروں کو اذیت دینا حرام ہے، جبکہ مخصوص جگہ کھڑے ہو کر دعا کرنا سنت ہے۔",
                "اسلامی شریعت میں دوسروں کی سہولت کا خیال رکھنا عبادت کی روح ہے۔"
              ],
              "english": [
                "If crowds are dense and standing causes harm to others, one should supplicate while moving.",
                "Harming others is forbidden (Haram), while standing at a specific spot for prayer is Sunnah.",
                "In Sharia, considering the convenience of others is the essence of true worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباعِ سنت کا کمال",
              "english": "Perfection in Following Sunnah"
            },
            "content": {
              "urdu": [
                "سیدنا ابن عمر کا یہ فرمانا 'میں نے نبی ﷺ کو ایسے کرتے دیکھا' ظاہر کرتا ہے کہ دین مشاہدے اور اتباع کا نام ہے۔",
                "عبادات میں اپنی طرف سے تبدیلیاں کرنا درست نہیں، بلکہ نبوی نمونے پر عمل ہی کامیابی ہے۔",
                "صحابہ کرام نے حج کے ایک ایک لمحے کو امت کے لیے محفوظ کیا۔"
              ],
              "english": [
                "Ibn 'Umar's (RA) statement \"I saw the Prophet doing it\" shows that religion is based on observation and imitation.",
                "One should not introduce personal changes into rituals; success lies in following the Prophetic model.",
                "The Sahaba preserved every moment of Hajj for the guidance of the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی اہمیت",
              "english": "Importance of Dua"
            },
            "content": {
              "urdu": [
                "رمی جیسی مشقت والی عبادت کے فوراً بعد لمبی دعا کرنا سکھاتا ہے کہ نیکی کے بعد اللہ سے رجوع کرنا چاہیے۔",
                "ہاتھ اٹھا کر قبلہ رخ ہونا دعا کے آداب میں سے ہے جو اثر کو بڑھاتا ہے۔",
                "حج کے ایام خالص ذکر اور دعا کے ایام ہیں، انہیں ضائع نہیں کرنا چاہیے۔"
              ],
              "english": [
                "Long supplications immediately after a strenuous ritual like Ramy teach us to turn to Allah after every good deed.",
                "Raising hands and facing the Qiblah are etiquettes of Dua that enhance its impact.",
                "The days of Hajj are days of pure remembrance and prayer; they must not be wasted."
              ]
            }
          }
        ]
      }
    }
  ]
}