{
  "hadithId": 819,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/819"],
    "kitabId": 7,
    "inKitabBab": 21,
    "arabicBook": "بلوغ المرام",
    "babId": 62
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1295)، ومسلم (1628).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری اور امام مسلم دونوں نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1295) and Muslim (1628)."
  },
  "importantWords": [
    {
      "arabic": "ذُو مَالٍ",
      "english": "Wealthy / Possessor of wealth",
      "urdu": "مالدار"
    },
    {
      "arabic": "بِشَطْرِهِ",
      "english": "With half of it",
      "urdu": "آدھے مال کے ساتھ"
    },
    {
      "arabic": "بِثُلُثِهِ",
      "english": "With one-third of it",
      "urdu": "تہائی مال کے ساتھ"
    },
    {
      "arabic": "عَالَةً",
      "english": "Poor / Dependents",
      "urdu": "محتاج / فقیر"
    },
    {
      "arabic": "يَتَكَفَّفُونَ",
      "english": "Begging / Stretching hands",
      "urdu": "ہاتھ پھیلاتے ہوئے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں وصیت کی حد بیان کی گئی ہے کہ کوئی شخص اپنے کل مال کے ایک تہائی سے زیادہ کی وصیت نہیں کر سکتا تاکہ اس کے وارث محتاج نہ ہوں۔",
    "english": "This Hadith sets the legal limit for a will at one-third of the estate, emphasizing the financial security of the heirs over excessive external charity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1295)",
      "english": "Sahih al-Bukhari (1295)"
    },
    {
      "arabic": "صحيح مسلم (1628)",
      "english": "Sahih Muslim (1628)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعد بن أبي وقاص",
        "english": "Sa'd bin Abi Waqqas"
      },
      "slug": "sad-bin-abi-waqqas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9j6Q3bU_I8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وصیت کی شرعی حد",
        "english": "Shariah Limit of a Will"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک تہائی (1/3) کا ضابطہ",
              "english": "The One-Third Rule"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں مرنے والا اپنے کل مال کے صرف ایک تہائی حصے تک وصیت کر سکتا ہے۔",
                "ایک تہائی سے زائد کی وصیت وارثوں کی اجازت کے بغیر نافذ نہیں ہوتی۔",
                "آپ ﷺ نے ایک تہائی کو بھی 'بہت زیادہ' قرار دے کر اعتدال کی ترغیب دی۔"
              ],
              "english": [
                "Under Islamic law, a person can only bequeath up to one-third of their total estate.",
                "Any will exceeding one-third is not enforceable without the consent of the legal heirs.",
                "The Prophet (ﷺ) described one-third as 'much,' encouraging moderation in bequests."
              ]
            }
          },
          {
            "title": {
              "urdu": "وارثین کا معاشی تحفظ",
              "english": "Economic Security of Heirs"
            },
            "content": {
              "urdu": [
                "اپنے اہل و عیال کو مالی طور پر مستحکم چھوڑنا کارِ ثواب اور صدقہ ہے۔",
                "نیکی کے کاموں میں مال خرچ کرنے سے پہلے اپنے وارثوں کے حقوق کا خیال رکھنا ضروری ہے۔",
                "اسلام کسی شخص کو اس بات کی اجازت نہیں دیتا کہ وہ اپنے بچوں کو فقیر بنا کر سارا مال باہر بانٹ دے۔"
              ],
              "english": [
                "Leaving one's family financially stable is considered a rewardable act and a form of charity.",
                "It is necessary to consider the rights of heirs before spending wealth on external noble causes.",
                "Islam does not permit an individual to leave their children in poverty by donating the entire estate."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گھریلو اخراجات کی فضیلت",
        "english": "Virtue of Domestic Spending"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیوی بچوں پر خرچ کرنا صدقہ ہے",
              "english": "Spending on Family is Charity"
            },
            "content": {
              "urdu": [
                "انسان جو لقمہ اپنی بیوی کے منہ میں ڈالتا ہے، اس پر بھی اسے ثواب ملتا ہے۔",
                "گھریلو ضروریات پوری کرنا محض دنیا داری نہیں بلکہ دینی فریضہ ہے۔",
                "نیت کی درستی کے ساتھ اہل خانہ پر خرچ کرنا عظیم ترین عبادت ہے۔"
              ],
              "english": [
                "A person is rewarded even for the morsel of food they put into their spouse's mouth.",
                "Meeting domestic needs is not just a worldly matter but a religious obligation.",
                "Spending on the family with the right intention is among the greatest forms of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "سعد بن ابی وقاص کی زندگی",
              "english": "The Life of Sa'd bin Abi Waqqas"
            },
            "content": {
              "urdu": [
                "سیدنا سعدؓ اس وقت سخت بیمار تھے اور سمجھ رہے تھے کہ شاید وہ فوت ہو جائیں گے۔",
                "آپ ﷺ نے انہیں بشارت دی کہ وہ ابھی طویل عمر پائیں گے اور اسلام کو نفع پہنچائیں گے۔",
                "چنانچہ وہ طویل عرصہ زندہ رہے، ایران فتح کیا اور ان کے کئی اور بچے بھی پیدا ہوئے۔"
              ],
              "english": [
                "Sa'd (RA) was severely ill at the time and believed he might pass away.",
                "The Prophet (ﷺ) gave him glad tidings that he would live long and benefit Islam.",
                "Indeed, he lived many years, conquered Persia, and had several more children."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و سماجی حکمت",
        "english": "Juristic and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل و انصاف کی فراہمی",
              "english": "Provision of Justice"
            },
            "content": {
              "urdu": [
                "وراثت کے قوانین خاندان کے اندر دولت کی منصفانہ تقسیم کو یقینی بناتے ہیں۔",
                "وصیت کی حد مقرر کرنا کسی ایک وارث یا غیر کو ترجیح دے کر دوسروں کی حق تلفی سے بچاتا ہے۔",
                "یہ نظام معاشرے میں گداگری اور مالی عدم استحکام کو روکنے میں مددگار ہے۔"
              ],
              "english": [
                "Inheritance laws ensure the fair distribution of wealth within the family unit.",
                "Limiting bequests prevents the unfair treatment of heirs by favoring outsiders.",
                "This system helps prevent beggary and financial instability within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیٹیوں کے حقوق کا تحفظ",
              "english": "Protection of Daughters' Rights"
            },
            "content": {
              "urdu": [
                "سیدنا سعدؓ کی اس وقت صرف ایک بیٹی تھی، جس کے لیے وہ فکر مند تھے۔",
                "آپ ﷺ نے بیٹی کے حق کو محفوظ رکھنے کے لیے زائد صدقہ سے منع فرمایا۔",
                "یہ بیٹیوں کی اہمیت اور ان کے وراثت میں مکمل حق کی بہترین دلیل ہے۔"
              ],
              "english": [
                "Sa'd (RA) had only one daughter at the time and was concerned for her future.",
                "The Prophet (ﷺ) forbade excessive charity to safeguard the daughter's rightful share.",
                "This serves as a strong evidence for the importance and rights of daughters in inheritance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال کی روش",
              "english": "The Path of Moderation"
            },
            "content": {
              "urdu": [
                "نیکی کے کاموں میں بھی جذبات کے بجائے شرعی حدود کا لحاظ رکھیں۔",
                "اپنی اولاد کے مستقبل کو داؤ پر لگا کر باہر سخاوت کرنا دانشمندی نہیں ہے۔",
                "اسلام زندگی کے ہر معاملے میں توازن اور میانہ روی کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "In noble deeds, observe Shariah limits rather than being driven solely by emotions.",
                "It is not wise to jeopardize your children's future for the sake of external generosity.",
                "Islam teaches balance and moderation in every aspect of human life."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیماری میں وصیت کرنا",
              "english": "Making a Will during Illness"
            },
            "content": {
              "urdu": [
                "بیماری کی حالت میں کیے گئے مالی فیصلے شرعی طور پر 'مرض الموت' کے احکام میں آتے ہیں۔",
                "ایسی حالت میں وصیت کا نفاذ صرف ایک تہائی مال میں ہی ممکن ہے۔",
                "یہ حدیث وصیت کے قانونی اور اخلاقی پہلوؤں کی بہترین رہنمائی کرتی ہے۔"
              ],
              "english": [
                "Financial decisions made during severe illness fall under the rulings of 'Marad al-Mawt.'",
                "In such a state, the execution of a will is only applicable to one-third of the estate.",
                "This Hadith provides excellent guidance on the legal and ethical aspects of a will."
              ]
            }
          }
        ]
      }
    }
  ]
}