{
  "hadithId": 1008,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1158"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (4504)‏، والترمذي (1406)‏ والنسائي في الكبرى (6909) وأصله في البخاري (6880) ومسلم (1355).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (4504) اور ترمذی (1406) نے روایت کیا ہے۔ اس کی اصل صحیح بخاری (6880) اور صحیح مسلم (1355) میں موجود ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (4504), At-Tirmidhi (1406), and An-Nasa'i in Al-Kubra (6909). Its origin is found in Sahih al-Bukhari (6880) and Sahih Muslim (1355)."
  },
  "importantWords": [
    {
      "arabic": "مَقَالَتِي",
      "english": "My speech / My statement",
      "urdu": "میرا قول / میری بات"
    },
    {
      "arabic": "خِيَرَتَيْنِ",
      "english": "Two choices / Options",
      "urdu": "دو اختیارات"
    },
    {
      "arabic": "اَلْعَقْلِ",
      "english": "Blood-money (Diyat)",
      "urdu": "دیت / خون بہا"
    },
    {
      "arabic": "يَقْتُلُوا",
      "english": "They kill (Retaliation)",
      "urdu": "وہ قتل کریں (قصاص)"
    },
    {
      "arabic": "أَهْلُهُ",
      "english": "His family / Heirs",
      "urdu": "اس کے گھر والے / وارث"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قتلِ عمد (جان بوجھ کر قتل) کی صورت میں مقتول کے ورثاء کے قانونی حقوق کو واضح کرتی ہے کہ وہ قصاص یا دیت میں سے کسی ایک کا انتخاب کر سکتے ہیں۔",
    "english": "This Hadith clarifies the legal rights of a victim's heirs in cases of intentional murder, allowing them to choose between retaliation (Qisas) or blood-money (Diyat)."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4504)",
      "english": "Sunan Abu Dawud (4504)"
    },
    {
      "arabic": "صحيح البخاري (6880)",
      "english": "Sahih al-Bukhari (6880)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو شريح الخزاعي",
        "english": "Abu Shuraih Al-Khuza'i"
      },
      "slug": "abu-shuraih-al-khuza-i"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ورثاء کے اختیارات",
        "english": "Rights of the Heirs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قصاص کا حق",
              "english": "Right of Retaliation"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں مقتول کے وارثوں کو یہ حق حاصل ہے کہ وہ قاتل سے بدلہ (قصاص) لیں۔",
                "یہ حق معاشرے میں انصاف کی فراہمی اور مجرموں کے لیے عبرت کا نشان بنتا ہے۔",
                "قصاص کی سزا صرف عدالت اور ریاست کے ذریعے ہی نافذ کی جا سکتی ہے۔"
              ],
              "english": [
                "In Islamic law, the heirs of the victim have the right to seek retaliation (Qisas) from the murderer.",
                "This right ensures justice and serves as a deterrent for potential criminals.",
                "The punishment of Qisas can only be implemented through the court and state authority."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیت کا انتخاب",
              "english": "Option of Blood-money"
            },
            "content": {
              "urdu": [
                "اگر ورثاء چاہیں تو وہ خون بہا (دیت) لے کر قاتل کو معاف کر سکتے ہیں۔",
                "دیت کا نظام مقتول کے خاندان کی مالی مدد اور دشمنی ختم کرنے کا ایک ذریعہ ہے۔",
                "یہ اختیار ورثاء کی مرضی پر منحصر ہے، ریاست انہیں مجبور نہیں کر سکتی۔"
              ],
              "english": [
                "If the heirs wish, they can accept blood-money (Diyat) and pardon the murderer.",
                "The system of Diyat supports the victim's family financially and helps end feuds.",
                "This choice rests solely with the heirs; the state cannot compel them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدل و رحمت کا توازن",
        "english": "Balance of Justice and Mercy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عفو و درگزر کی ترغیب",
              "english": "Encouragement for Forgiveness"
            },
            "content": {
              "urdu": [
                "اگرچہ قصاص عدل ہے، مگر قرآن و حدیث میں معاف کرنے کو افضل قرار دیا گیا ہے۔",
                "معاف کر دینا دلوں سے نفرت ختم کرنے اور معاشرتی امن کے لیے بہترین ہے۔",
                "اللہ تعالیٰ معاف کرنے والوں کو آخرت میں بڑے اجر کا وعدہ فرماتا ہے۔"
              ],
              "english": [
                "While Qisas is justice, the Quran and Hadith consider forgiveness superior.",
                "Forgiveness is best for removing hatred from hearts and maintaining social peace.",
                "Allah promises a great reward in the Hereafter for those who forgive."
              ]
            }
          },
          {
            "title": {
              "urdu": "تیسرا اختیار: مکمل معافی",
              "english": "Third Option: Full Pardon"
            },
            "content": {
              "urdu": [
                "ورثاء بغیر دیت لیے بھی فی سبیل اللہ قاتل کو معاف کرنے کا حق رکھتے ہیں۔",
                "یہ عمل احسان کے درجے میں آتا ہے جو تقویٰ کی علامت ہے۔",
                "اسلام انتقام کے بجائے انسانی اصلاح اور توبہ کے مواقع فراہم کرتا ہے۔"
              ],
              "english": [
                "The heirs also have the right to pardon the killer for the sake of Allah without taking Diyat.",
                "This act falls under the category of 'Ihsan' (excellence) and is a sign of piety.",
                "Islam prioritizes human reform and opportunities for repentance over mere revenge."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی ضابطے",
        "english": "Legal Regulations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ثبوت اور گواہی",
              "english": "Evidence and Testimony"
            },
            "content": {
              "urdu": [
                "قصاص کا فیصلہ صرف ٹھوس ثبوتوں اور معتبر گواہیوں کی بنیاد پر ہوتا ہے۔",
                "اگر قتل میں ذرہ برابر بھی شبہ ہو تو قصاص کے بجائے دیت کی طرف رجوع کیا جاتا ہے۔",
                "اسلامی عدالت شک کا فائدہ ہمیشہ ملزم کو دینے کی قائل ہے۔"
              ],
              "english": [
                "The verdict of Qisas is only based on solid evidence and reliable testimonies.",
                "If there is any doubt in the nature of the murder, Diyat is preferred over Qisas.",
                "The Islamic court believes in giving the benefit of the doubt to the accused."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاست کی ذمہ داری",
              "english": "Role of the State"
            },
            "content": {
              "urdu": [
                "ورثاء کو خود قانون ہاتھ میں لینے کی اجازت نہیں، سزا ریاست دے گی۔",
                "ریاست کا کام ورثاء کو ان کے حقوق دلانا اور فیصلے پر عمل درآمد کرنا ہے۔",
                "نجی سطح پر بدلہ لینا معاشرے میں انارکی اور مزید خون ریزی کا سبب بنتا ہے۔"
              ],
              "english": [
                "Heirs are not allowed to take the law into their own hands; the state executes the sentence.",
                "The state's job is to ensure heirs get their rights and to implement the verdict.",
                "Private revenge leads to anarchy and further bloodshed in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انتقامی جنگوں کا خاتمہ",
              "english": "Ending Revenge Wars"
            },
            "content": {
              "urdu": [
                "اسلام سے قبل عرب میں ایک قتل کے بدلے نسلوں تک جنگیں چلتی تھیں۔",
                "اس قانون نے انتقام کو قانونی حدود میں لا کر قبائلی فسادات کا خاتمہ کیا۔",
                "حقوقِ ورثاء کے تحفظ سے مظلوم خاندان کو ذہنی سکون ملتا ہے۔"
              ],
              "english": [
                "Before Islam, a single murder in Arabia would spark wars lasting generations.",
                "This law ended tribal feuds by bringing revenge within legal boundaries.",
                "Protecting the rights of heirs provides mental peace to the victim's family."
              ]
            }
          },
          {
            "title": {
              "urdu": "جان کی قدر و قیمت",
              "english": "Value of Human Life"
            },
            "content": {
              "urdu": [
                "قصاص کے قانون سے لوگوں کے دلوں میں انسانی جان کی حرمت بیٹھ جاتی ہے۔",
                "جب سزا یقینی ہو تو جرائم کی شرح میں نمایاں کمی آتی ہے۔",
                "اسلامی نظامِ عدل ایک پرامن اور محفوظ معاشرے کی بنیاد ہے۔"
              ],
              "english": [
                "The law of Qisas instills the sanctity of human life in the hearts of people.",
                "When punishment is certain, crime rates significantly decrease.",
                "The Islamic system of justice is the foundation of a peaceful and secure society."
              ]
            }
          }
        ]
      }
    }
  ]
}