{
  "hadithId": 728,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/7/96"
    ],
    "kitabId": 7,
    "inKitabBab": 6,
    "arabicBook": "كتاب البيوع",
    "babId": 47
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (3628)، والنسائي (4689)، وابن ماجه (2427). وعلقه البخاري بصيغة الجزم في كتاب الاستقراض. وصححه ابن حبان (1164) والحاكم وغيرهم.",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام ابوداؤد، نسائی اور ابن ماجہ نے روایت کیا ہے، جبکہ امام بخاری نے اسے اپنی صحیح میں تعلیقاً (بغیر پوری سند کے) ذکر کیا ہے۔ ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan. Reported by Abu Dawud (3628), an-Nasa'i (4689), and Ibn Majah (2427). Al-Bukhari recorded it in his Sahih as a Mu'allaq narration. It was graded Sahih by Ibn Hibban (1164) and al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "لَيُّ",
      "english": "Procrastination / Delay",
      "urdu": "ٹال مٹول کرنا"
    },
    {
      "arabic": "الْوَاجِدِ",
      "english": "One who has the means / Rich",
      "urdu": "صاحبِ ثروت / مالدار"
    },
    {
      "arabic": "عِرْضَهُ",
      "english": "His honor",
      "urdu": "اس کی آبرو / عزت"
    },
    {
      "arabic": "عُقُوبَتَهُ",
      "english": "His punishment",
      "urdu": "اس کی سزا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان لوگوں کو تنبیہ کی گئی ہے جو ادائیگی کی قدرت رکھنے کے باوجود قرض کی واپسی میں تاخیر کرتے ہیں۔ ایسے لوگوں کی شکایت کرنا اور انہیں قانونی سزا (جیسے قید) دینا شرعاً جائز ہے۔",
    "english": "This Hadith warns individuals who have the means to repay debts but delay doing so. It establishes that it is lawful to complain about such people and for authorities to punish them (e.g., imprisonment)."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الأقضية",
      "english": "Sunan Abi Dawud, Book of Judgments"
    },
    {
      "arabic": "صحيح البخاري، كتاب في الاستقراض",
      "english": "Sahih al-Bukhari, Book of Loans"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "الشريد بن سويد",
        "english": "Ash-Sharid bin Suwaid"
      },
      "slug": "ash-sharid-bin-suwaid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Authentic/Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ٹال مٹول کی شرعی حیثیت",
        "english": "The Sharia Ruling on Procrastination"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرض کی ادائیگی میں تاخیر",
              "english": "Delaying Debt Repayment"
            },
            "content": {
              "urdu": [
                "اگر کسی کے پاس مال موجود ہو تو قرض کی واپسی میں ایک لمحے کی تاخیر بھی ظلم ہے۔",
                "نبی ﷺ نے دوسری حدیث میں فرمایا: 'مالدار کا ٹال مٹول کرنا ظلم ہے'۔",
                "یہ عمل اخلاقی گناہ کے ساتھ ساتھ قانونی طور پر قابلِ گرفت جرم بھی ہے۔"
              ],
              "english": [
                "If someone has the wealth, delaying the repayment of a debt even for a moment is an act of injustice.",
                "The Prophet (ﷺ) stated in another Hadith: 'Procrastination by a rich person is injustice'.",
                "This act is both a moral sin and a legally punishable offense."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم کا نتیجہ",
              "english": "Consequence of Injustice"
            },
            "content": {
              "urdu": [
                "ناحق تاخیر کرنے والا اپنی اس حرکت سے اپنی عزت اور آزادی کا تحفظ کھو دیتا ہے۔",
                "قرض خواہ کو یہ حق مل جاتا ہے کہ وہ قاضی یا عدالت میں اس کی شکایت کرے۔",
                "اسلامی معیشت میں حقوق العباد کی حفاظت کو اولین ترجیح دی گئی ہے۔"
              ],
              "english": [
                "One who delays without justification loses the protection of their honor and freedom.",
                "The creditor gains the right to complain about them to a judge or a court.",
                "In the Islamic economy, protecting the rights of individuals is a top priority."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بے عزتی اور سزا کی وضاحت",
        "english": "Explanation of Dishonor and Punishment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزت حلال ہونے کا مطلب",
              "english": "Meaning of Making Honor Lawful"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ اب اس کی شکایت کرنا غیبت کے زمرے میں نہیں آئے گا۔",
                "قرض خواہ کہہ سکتا ہے کہ 'فلاں شخص نے میرا حق مارا ہے' یا 'وہ ٹال مٹول کر رہا ہے'۔",
                "عدالت میں اس کی بددیانتی کو ظاہر کرنا شرعاً جائز قرار دیا گیا ہے۔"
              ],
              "english": [
                "This means complaining about them is no longer considered forbidden backbiting.",
                "The creditor can say, 'So-and-so has deprived me of my right' or 'He is procrastinating'.",
                "Exposing their dishonesty in court is religiously permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزا (عقوبت) کی نوعیت",
              "english": "Nature of Punishment"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک اس سزا سے مراد 'قید' (حبس) ہے۔",
                "قاضی ایسے شخص کو اس وقت تک جیل میں رکھ سکتا ہے جب تک وہ قرض ادا نہ کرے۔",
                "یہ سزا اس لیے ہے تاکہ دوسروں کو سبق ملے اور معاشی لین دین میں دیانتداری رہے۔"
              ],
              "english": [
                "According to jurists, this punishment primarily refers to 'imprisonment'.",
                "A judge can keep such a person in jail until the debt is repaid.",
                "This serves as a deterrent to others and ensures integrity in economic dealings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدل و انصاف کے تقاضے",
        "english": "Requirements of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقیقی ضرورت مند کی رعایت",
              "english": "Concession for the Truly Needy"
            },
            "content": {
              "urdu": [
                "یہ حکم صرف ان کے لیے ہے جو ادائیگی کی قدرت رکھتے ہوں (الواجد)۔",
                "اگر کوئی واقعی غریب ہے اور ادائیگی سے قاصر ہے، تو اسے مہلت دینا واجب ہے۔",
                "قرآن کا حکم ہے: 'اور اگر کوئی تنگی والا ہو تو اسے کشادگی تک مہلت دو'۔"
              ],
              "english": [
                "This ruling applies only to those who have the means to pay (al-Wajid).",
                "If someone is truly poor and unable to pay, granting them a respite is mandatory.",
                "The Quran commands: 'And if someone is in hardship, then let there be postponement until a time of ease'."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی توازن",
              "english": "Social Balance"
            },
            "content": {
              "urdu": [
                "یہ قانون سرمایہ داروں کو غریبوں کا مال ہڑپ کرنے سے روکتا ہے۔",
                "اس سے لوگوں کا ایک دوسرے پر اعتماد بحال ہوتا ہے اور قرضِ حسنہ کا رواج بڑھتا ہے۔",
                "معاشرتی امن کے لیے مالی وعدوں کی پاسداری ناگزیر ہے۔"
              ],
              "english": [
                "This law prevents capitalists from misappropriating the wealth of others.",
                "It restores mutual trust, encouraging the practice of interest-free loans.",
                "Adhering to financial promises is essential for social peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی پابندی",
              "english": "Punctuality in Payment"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ وعدے کے مطابق وقت پر قرض واپس کرے۔",
                "اگر گنجائش ہو تو مقررہ وقت سے پہلے بھی ادائیگی کر دینا بہتر ہے۔",
                "قرض کی فکر انسان کے ایمان کی پختگی کی علامت ہے۔"
              ],
              "english": [
                "A Muslim should repay their debts on time as promised.",
                "It is better to repay even before the deadline if funds are available.",
                "Being concerned about one's debts is a sign of mature faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیبت سے بچنا",
              "english": "Avoiding Backbiting"
            },
            "content": {
              "urdu": [
                "کسی کی شکایت صرف حق لینے کے لیے جائز ہے، عداوت نکالنے کے لیے نہیں۔",
                "اپنی زبان کو محفوظ رکھیں اور صرف ضرورت کے تحت ہی معاملہ اعلیٰ حکام تک لے جائیں۔",
                "اسلام ہر قدم پر اعتدال اور احتیاط کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Complaining about someone is only allowed to recover a right, not to settle a personal vendetta.",
                "Guard your tongue and only escalate matters to authorities when necessary.",
                "Islam teaches moderation and caution at every step."
              ]
            }
          }
        ]
      }
    }
  ]
}