{
  "hadithId": 94,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 94"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الغسل",
    "babId": 8
  },

  "takhreej": {
    "arabic": "صحيح.  رواه مسلم (343) ، عن أبي سعيد الخدري قال: خرجت مع رسول الله صلى الله عليه وسلم يوم الاثنين إلى قباء، حتى إذا كنا في بني سالم، وقف رسول الله صلى الله عليه وسلم على باب عتبان.  فصرخ به، فخرج يجر إزاره، فقال رسول الله صلى الله عليه وسلم: \"أعجلنا الرجل\" فقال عتبان: يا رسول الله.  أرأيت الرجل يعجل عن امرأته ولم يمن ماذا عليه ؟ قال رسول الله صلى الله عليه وسلم: \"إنما الماء من الماء\".  البخاري (180) ، ولفظه: \"إذا أعجلت  -أو قحطت - فعليك الوضوء\" وهو رواية لمسلم.",
    "urdu": "صحیح (درست) روایت۔ اسے مسلم (343) نے ابوسعید خدری رضی اللہ عنہ سے روایت کیا ہے۔ یہ حدیث عتبان رضی اللہ عنہ کے سوال کے جواب میں دی گئی، جب انہوں نے پوچھا کہ جو شخص جلدی فارغ ہو جائے اور اسے انزال (منی کا خروج) نہ ہو تو اس پر کیا واجب ہے؟ نبی ﷺ نے فرمایا: ”پانی کا استعمال خروج پانی سے ہے۔“ بخاری (180) میں بھی اس کی اصل موجود ہے، جس کا لفظ یہ ہے: \"اگر تم جلدی فارغ ہو جاؤ - یا انزال نہ ہو - تو تم پر وضو ہے\"۔ یہ مسلم کی بھی ایک روایت ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (343), from Abu Sa'id Al-Khudri, who said: The Prophet ﷺ replied to 'Itban, who asked about a man who withdraws early from his wife without semen discharge: \"Water is from water.\" Al-Bukhari (180) reports a supporting wording: \"If you withdraw early – or you do not discharge – then Wudu' (ablution) is upon you,\" which is also a narration in Muslim."
  },
  "importantWords": [
    {
      "arabic": "الْمَاءُ",
      "english": "Water (referring to Ghusl)",
      "urdu": "پانی (غسل)"
    },
    {
      "arabic": "مِنْ",
      "english": "From (conditional upon)",
      "urdu": "کی وجہ سے"
    },
    {
      "arabic": "الْخُرُوج",
      "english": "Discharge/emission",
      "urdu": "خروج"
    },
    {
      "arabic": "يَمْنِ",
      "english": "He discharges semen",
      "urdu": "منی خارج ہو"
    },
    {
      "arabic": "الْغُسْل",
      "english": "Major ritual bathing (Ghusl)",
      "urdu": "غسل"
    },
    {
      "arabic": "الْوُضُوء",
      "english": "Minor ritual ablution (Wudu')",
      "urdu": "وضو"
    },
    {
      "arabic": "أَعْجَلَ",
      "english": "He withdrew early",
      "urdu": "جلدی فارغ ہو جانا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غسل واجب ہونے کے لیے اصل شرط کو واضح کرتی ہے کہ غسل تب ہی واجب ہوتا ہے جب منی کا خروج (انزال) ہو، محض مباشرت یا انتشار سے غسل واجب نہیں ہوتا۔",
    "english": "This Hadith clarifies the original condition for the obligation of Ghusl (major ritual bath): Ghusl is only required upon the emission (discharge) of semen, not merely due to intercourse or arousal."
  },
  "references": [
    {
      "arabic": "رواه مسلم (343)",
      "english": "Reported by Muslim (343)"
    },
    {
      "arabic": "أصله في البخاري (180)",
      "english": "Basis in Al-Bukhari (180)"
    },
    {
      "arabic": "لفظ البخاري: إذا أعجلت فعليك الوضوء",
      "english": "Al-Bukhari's wording: If you withdraw early, Wudu' is upon you"
    }
  ],
  "narrators": [
    {
      "id": 9401,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا حکم اور منسوخی",
        "english": "The Ruling and its Abrogation (Naskh)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابتدائی حکم",
              "english": "The Initial Ruling"
            },
            "content": {
              "urdu": [
                "اس حدیث میں موجود حکم \"پانی کا استعمال خروج پانی سے ہے\" اسلام کے ابتدائی دور میں نافذ تھا۔",
                "اس کا مطلب یہ تھا کہ اگر کوئی شخص بیوی سے قربت کرے لیکن انزال نہ ہو تو اس پر صرف وضو واجب ہوتا تھا، غسل نہیں۔",
                "یہ رعایت عتبان رضی اللہ عنہ جیسے ان لوگوں کے لیے تھی جو جلدی فارغ ہو جاتے تھے اور انزال سے پہلے ہی رک جاتے تھے۔"
              ],
              "english": [
                "The ruling found in this Hadith, 'Water is from water', was implemented in the early period of Islam.",
                "It meant that if a person had intimacy with his wife but did not have an emission (ejaculation), only Wudu' was obligatory, not Ghusl.",
                "This concession was granted for those, like 'Itban (RA), who withdrew early and stopped before discharging semen."
              ]
            }
          },
          {
            "title": {
              "urdu": "منسوخ شدہ حکم",
              "english": "The Abrogated Ruling"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کا اس بات پر اتفاق ہے کہ یہ حکم بعد میں ایک دوسرے حکم سے منسوخ (Naskh) ہو گیا۔",
                "منسوخ کرنے والا حکم وہ ہے جس میں دخول (اندام نہانی میں دخول) سے ہی غسل واجب ہو جاتا ہے، چاہے انزال ہو یا نہ ہو۔",
                "یہ حکم اس بات کو یقینی بناتا ہے کہ طہارت میں کوئی کمی نہ رہے اور معاملات میں احتیاط رہے۔"
              ],
              "english": [
                "The majority of jurists agree that this ruling was later **abrogated** (Naskh) by another command.",
                "The abrogating ruling mandates Ghusl upon the mere act of penetration, whether or not ejaculation occurs.",
                "This later ruling ensures that purity is fully achieved and caution is maintained in such matters."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نئے حکم کی وضاحت",
        "english": "Clarification of the New Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دخول سے غسل کا وجوب",
              "english": "Ghusl Obligatory Upon Penetration"
            },
            "content": {
              "urdu": [
                "صحیح اور آخری حکم جو حضرت عائشہ اور دیگر صحابہ سے مروی ہے، یہ ہے کہ صرف دخول سے ہی غسل واجب ہو جاتا ہے۔",
                "نبی اکرم ﷺ نے فرمایا: \"جب ایک مرد اپنی بیوی کی چار شاخوں کے درمیان بیٹھ کر اسے چھوئے تو غسل واجب ہو گیا، خواہ انزال نہ ہو۔\"",
                "اس آخری حکم پر تمام مذاہب فقہاء کا اتفاق ہے اور یہ آج تک معمول ہے۔"
              ],
              "english": [
                "The authentic and final ruling, narrated by 'A'ishah and other companions, is that Ghusl becomes obligatory upon **mere penetration**.",
                "The Prophet ﷺ said: 'When a man sits between the four parts of his wife (i.e., penetrates) and the two circumcised parts meet, Ghusl is obligatory, whether he ejaculates or not.'",
                "This final ruling is agreed upon by all schools of jurisprudence and is the practice today."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل واجب ہونے کی شرائط",
              "english": "Conditions for Obligatory Ghusl"
            },
            "content": {
              "urdu": [
                "لہٰذا، غسل واجب ہونے کی دو بنیادی شرائط ہیں: **اولاً**، منی کا کسی بھی طریقے سے خروج ہونا۔",
                "**ثانیاً**، جنسی ملاپ میں دخول کا وقوع پذیر ہونا، خواہ منی کا خروج نہ ہو۔",
                "یہ دونوں حالتیں ناپاکی (جنابت) کی حالت کو یقینی بناتی ہیں اور طہارت کے لیے غسل لازم کر دیتی ہیں۔"
              ],
              "english": [
                "Therefore, there are two primary conditions for Ghusl to be obligatory: **First**, the emission of semen through any means.",
                "**Second**, the occurrence of penetration during sexual intercourse, even if semen is not discharged.",
                "Both these states establish the condition of major ritual impurity (Janabah) and necessitate Ghusl for purification."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا طرز عمل",
        "english": "The Prophet's Methodology"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سہولت اور احتیاط",
              "english": "Ease and Caution"
            },
            "content": {
              "urdu": [
                "یہ حدیث ظاہر کرتی ہے کہ اسلامی شریعت میں احکام بتدریج (Gradually) نازل ہوئے ہیں، پہلے آسانی دی گئی اور پھر مکمل حکم۔",
                "پہلا حکم (پانی سے پانی) کمزوروں کے لیے رعایت تھی، لیکن بعد میں حتمی حکم احتیاط اور کمال طہارت کے لیے نازل ہوا۔",
                "شریعت میں ابتداً سادگی اختیار کرنا اور بعد میں کامل حکم کی طرف جانا ایک بنیادی طریقہ رہا ہے۔"
              ],
              "english": [
                "This Hadith shows that Islamic rulings were revealed gradually: first providing ease, then the final, complete command.",
                "The initial ruling ('water is from water') was a concession for the vulnerable, but the final ruling emphasized caution and perfect purification.",
                "Adopting simplicity initially and then progressing to the complete ruling has been a fundamental approach in Shari'ah."
              ]
            }
          },
          {
            "title": {
              "urdu": "احادیث میں ناسخ و منسوخ",
              "english": "Abrogating and Abrogated in Hadith"
            },
            "content": {
              "urdu": [
                "یہ واقعہ علم حدیث میں ناسخ (Abrogating) اور منسوخ (Abrogated) کے اصول کو سمجھنے کی کلید ہے۔",
                "جب دو صحیح احادیث میں ظاہری تضاد ہو تو متأخر (بعد میں نازل شدہ) حدیث کو ناسخ مانا جاتا ہے۔",
                "فقہاء نے غسل کے وجوب کو انزال اور دخول، دونوں صورتوں میں قرار دیا ہے۔"
              ],
              "english": [
                "This incident is key to understanding the principle of Nasikh (Abrogating) and Mansukh (Abrogated) in Hadith science.",
                "When two authentic Hadiths appear contradictory, the one revealed later is considered the abrogating ruling.",
                "Jurists have therefore established the obligation of Ghusl in both cases: seminal emission and penetration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتماعی اور انفرادی پاکیزگی",
        "english": "Collective and Individual Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مکمل طہارت کا فلسفہ",
              "english": "Philosophy of Complete Purity"
            },
            "content": {
              "urdu": [
                "غسل صرف جسمانی پاکیزگی نہیں بلکہ روحانی طہارت بھی ہے، جو انسان کو اللہ کے سامنے کھڑے ہونے کے قابل بناتی ہے۔",
                "جنابت (ناپاکی) کی حالت میں ذکرِ الٰہی کے علاوہ تمام عبادات ممنوع ہوتی ہیں۔",
                "غسل کا حکم اس بات کو یقینی بناتا ہے کہ جسم کا ہر حصہ پاک ہو کر روحانی سکون حاصل کرے۔"
              ],
              "english": [
                "Ghusl is not just physical cleansing but also spiritual purification, enabling one to stand before Allah.",
                "All acts of worship, except for the remembrance of Allah, are prohibited in the state of Janabah (major impurity).",
                "The command for Ghusl ensures that every part of the body is cleansed, leading to spiritual tranquility."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور ستر کا تعلق",
              "english": "Connection to Modesty and Covering"
            },
            "content": {
              "urdu": [
                "جنسی تعلق کے بعد فوری غسل کا حکم حیا اور شرم و حیا کے اسلامی اصولوں سے بھی جڑا ہوا ہے۔",
                "یہ حکم مسلمان کو اس بات کی ترغیب دیتا ہے کہ وہ پاکیزگی کو ہر حال میں مقدم رکھے اور نجاست سے دور رہے۔",
                "غسل کے بعد ہی بیوی اور شوہر کی طرف سے طہارت اور جسمانی راحت کا احساس مکمل ہوتا ہے۔"
              ],
              "english": [
                "The command for immediate Ghusl after sexual activity is also linked to the Islamic principles of modesty (Haya) and chastity.",
                "This ruling encourages a Muslim to prioritize cleanliness at all times and keep away from ritual impurity.",
                "Only after Ghusl is completed does the feeling of purity and physical ease become complete for both husband and wife."
              ]
            }
          }
        ]
      }
    }
  ]
}
