{
  "hadithId": 876,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/66"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5940)، ومسلم (2124)، وأخرجه أبو داود (4168)، والنسائي (5252)، وابن ماجه (1987).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (5940) اور امام مسلم (2124) نے روایت کیا ہے۔ اس کے علاوہ سنن اربعہ میں بھی یہ روایت مختلف اسناد سے موجود ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5940) and Muslim (2124). Also recorded by Abu Dawud (4168), An-Nasa'i (5252), and Ibn Majah (1987)."
  },
  "importantWords": [
    {
      "arabic": "لَعَنَ",
      "english": "Cursed",
      "urdu": "لعنت فرمائی"
    },
    {
      "arabic": "الْوَاصِلَةَ",
      "english": "Hair joiner",
      "urdu": "بال جوڑنے والی"
    },
    {
      "arabic": "الْمُسْتَوْصِلَةَ",
      "english": "Hair extension seeker",
      "urdu": "بال جڑوانے کی خواہش مند"
    },
    {
      "arabic": "الْوَاشِمَةَ",
      "english": "Tattooer",
      "urdu": "گودنے والی"
    },
    {
      "arabic": "الْمُسْتَوْشِمَةَ",
      "english": "Tattoo seeker",
      "urdu": "ٹیٹو بنوانے کی خواہش مند"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مصنوعی بال لگانے اور جسم پر ٹیٹو بنوانے کی سخت ممانعت بیان کی گئی ہے، اور ان افعال کو اللہ کی تخلیق میں مداخلت اور دھوکہ دہی قرار دیا گیا ہے۔",
    "english": "This Hadith strictly prohibits hair extensions and tattoos, declaring these acts as changing Allah's creation and forms of deception."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب اللباس، رقم الحديث ٥٩٤٠",
      "english": "Sahih Bukhari, Book of Dress, Hadith No. 5940"
    },
    {
      "arabic": "صحيح مسلم، كتاب اللباس والزينة، رقم الحديث ٢١٢٤",
      "english": "Sahih Muslim, Book of Dress and Adornment, Hadith No. 2124"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0p_L4D8K2I",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مصنوعی بال لگانے کی ممانعت",
        "english": "Prohibition of Hair Extensions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تلبیس اور دھوکہ دہی",
              "english": "Deception and Disguise"
            },
            "content": {
              "urdu": [
                "اپنے بالوں میں دوسرے انسان یا مصنوعی بالوں کا جوڑ لگانا 'وصل' کہلاتا ہے۔",
                "اسلام اس عمل کو منع کرتا ہے کیونکہ اس میں دھوکہ دہی اور ظاہری فریب پایا جاتا ہے۔",
                "خاص طور پر شادی کے رشتوں میں اسے استعمال کرنا دوسروں کو غلط تاثر دینے کے مترادف ہے۔"
              ],
              "english": [
                "Adding human or synthetic hair extensions to one's own hair is called 'Wasl'.",
                "Islam prohibits this practice because it involves deception and false appearances.",
                "Using extensions in marriage proposals is particularly condemned as it misleads others."
              ]
            }
          },
          {
            "title": {
              "urdu": "فطری حسن کی اہمیت",
              "english": "Importance of Natural Beauty"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے انسان کو جس حال میں پیدا کیا ہے اس پر راضی رہنا ایمان کا حصہ ہے۔",
                "مصنوعی طریقوں سے حسن میں ایسا اضافہ جو فطرت کے خلاف ہو، ناپسندیدہ ہے۔",
                "شریعت ان تمام زینتوں سے روکتی ہے جو انسانی شخصیت میں تصنع اور بناوٹ پیدا کریں۔"
              ],
              "english": [
                "Being content with one's natural appearance created by Allah is part of faith.",
                "Enhancing beauty through artificial means that contradict nature is discouraged.",
                "Shariah forbids adornments that introduce affectation and artificiality into personality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گودنے (ٹیٹو) کی حرمت",
        "english": "Prohibition of Tattoos"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تخلیقِ خداوندی میں تبدیلی",
              "english": "Changing Allah's Creation"
            },
            "content": {
              "urdu": [
                "جسم پر سوئی سے سوراخ کر کے رنگ بھرنا (ٹیٹو بنوانا) اللہ کی تخلیق کو بدلنا ہے۔",
                "قرآن کے مطابق شیطان نے عہد کیا تھا کہ وہ انسانوں کو اللہ کی بنائی ہوئی صورت بدلنے پر اکسائے گا۔",
                "ٹیٹو بنوانا شیطانی عمل کی پیروی ہے، اسی لیے اس پر لعنت کی گئی ہے۔"
              ],
              "english": [
                "Piercing the skin and injecting ink (tattooing) is seen as altering Allah's creation.",
                "According to the Quran, Satan vowed to incite humans to change Allah's creation.",
                "Tattooing is following a satanic path, which is why it carries a divine curse."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی نقصان اور نجاست",
              "english": "Physical Harm and Impurity"
            },
            "content": {
              "urdu": [
                "ٹیٹو بنوانے کا عمل تکلیف دہ ہوتا ہے اور اس سے جلد کی بیماریاں پیدا ہو سکتی ہیں۔",
                "قدیم طریقے میں خون اور رنگ کا ملاپ اسے مستقل نجاست بنا دیتا تھا۔",
                "اسلام انسانی جسم کو اللہ کی امانت قرار دیتا ہے اور اس کے بلاوجہ بگاڑ سے روکتا ہے۔"
              ],
              "english": [
                "The process of tattooing is painful and carries risks of skin infections.",
                "Traditional methods involving blood and ink made the site permanently impure.",
                "Islam views the body as a trust from Allah and forbids unnecessary mutilation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لعنت کا مفہوم اور سنگینی",
        "english": "Meaning and Severity of the Curse"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی رحمت سے دوری",
              "english": "Exclusion from Allah's Mercy"
            },
            "content": {
              "urdu": [
                "لفظ 'لعنت' کا مطلب اللہ کی رحمت سے دوری اور محرومی ہے۔",
                "جس فعل پر اللہ اور اس کے رسول ﷺ لعنت فرمائیں وہ گناہِ کبیرہ بن جاتا ہے۔",
                "یہ وعید اس بات کی دلیل ہے کہ یہ افعال محض ناپسندیدہ نہیں بلکہ سخت حرام ہیں۔"
              ],
              "english": [
                "The term 'La'nat' (curse) signifies distance and deprivation from Allah's mercy.",
                "An act cursed by Allah and His Messenger (ﷺ) is categorized as a major sin.",
                "This warning proves these acts are strictly forbidden (Haram), not just disliked."
              ]
            }
          },
          {
            "title": {
              "urdu": "کرنے والے اور کروانے والے برابر",
              "english": "Equal Accountability"
            },
            "content": {
              "urdu": [
                "حدیث میں کام کرنے والے اور فرمائش کرنے والے دونوں کو برابر کا مجرم قرار دیا گیا ہے۔",
                "گناہ میں تعاون کرنا بھی گناہ ہے، چاہے وہ پیشہ ورانہ کام ہو یا ذاتی ضرورت۔",
                "یہ حکم مسلمانوں کو ایک پاکیزہ اور سچے معاشرے کی تشکیل کی دعوت دیتا ہے۔"
              ],
              "english": [
                "The Hadith holds both the practitioner and the client equally accountable.",
                "Assisting in a sin is itself a sin, whether as a profession or a personal request.",
                "This ruling invites Muslims to form a society based on purity and truthfulness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید کاسمیٹک سرجری اور زینت",
        "english": "Modern Cosmetic Procedures and Adornment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جائز اور ناجائز زینت",
              "english": "Permissible vs. Prohibited Adornment"
            },
            "content": {
              "urdu": [
                "اگر زینت کا مقصد کسی پیدائشی عیب یا حادثاتی زخم کو چھپانا ہو تو وہ جائز ہے۔",
                "محض فیشن اور اللہ کی بنائی ہوئی صورت کو بدلنے کے لیے سرجری کروانا منع ہے۔",
                "علماء کے مطابق بالوں کے علاج (ٹرانسپلانٹ) اور وِگ (Wig) کے احکامات میں تفصیل موجود ہے۔"
              ],
              "english": [
                "Adornment intended to hide a birth defect or accidental scar is permissible.",
                "Surgeries performed solely for fashion or to change Allah's creation are forbidden.",
                "Scholars provide detailed rulings regarding hair transplants and the use of wigs."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کے لیے نصیحت",
              "english": "Advice for Women"
            },
            "content": {
              "urdu": [
                "خواتین کو چاہیے کہ وہ اپنی زیب و زینت میں شرعی حدود کا مکمل خیال رکھیں۔",
                "وقتی فیشن کی خاطر اللہ کی ناراضگی اور لعنت مول لینا کسی صورت عقلمندی نہیں۔",
                "حقیقی حسن حیا اور اخلاق میں پوشیدہ ہے جو اللہ کی نظر میں معتبر ہے۔"
              ],
              "english": [
                "Women should strictly observe Shariah boundaries in their beautification.",
                "It is unwise to invite Allah's displeasure and curse for the sake of temporary fashion.",
                "True beauty lies in modesty and character, which are valued in the sight of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}