{
  "hadithId": 161,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["1:4:2"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (ستر العورة)",
    "babId": 13
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ وإن أعله بعضهم بما لا يقدح .‏ ورواه أبو داود (641)‏ ، والترمذي (377)‏ ، وابن ماجه (655)‏ ، وأحمد (6/150 و 218 و 259)‏ ، وابن خزيمة (775)‏.‏ ",
    "urdu": "صحیح۔ اگرچہ بعض نے اس میں ایسی علتیں بیان کیں جو قدح کا باعث نہیں ہیں۔ اسے ابو داؤد (641)، ترمذی (377)، ابن ماجہ (655)، احمد (6/150، 218، 259)، اور ابن خزیمہ (775) نے روایت کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Although some scholars mentioned defects, they are not detrimental. Reported by Abu Dawud (641), At-Tirmidhī (377), Ibn Mājah (655), Ahmad (6/150, 218, 259), and Ibn Khuzaymah (775).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَا يَقْبَلُ اَللَّهُ",
      "english": "Allah does not accept",
      "urdu": "اللہ قبول نہیں کرتا"
    },
    {
      "arabic": "صَلَاةَ حَائِضٍ",
      "english": "The prayer of a Ḥā'iḍ (post-pubescent woman)",
      "urdu": "حائضہ (بالغہ) کی نماز"
    },
    {
      "arabic": "إِلَّا بِخِمَارٍ",
      "english": "Except with a Khimar (head covering)",
      "urdu": "سوائے اوڑھنی (دوپٹہ) کے"
    },
    {
      "arabic": "بِالْغَة",
      "english": "Reached puberty",
      "urdu": "بالغہ"
    },
    {
      "arabic": "سَتْرُ اَلْعَوْرَةِ",
      "english": "Covering the 'Awrah",
      "urdu": "ستر کو چھپانا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ عورت کی نماز تب تک قبول نہیں ہوتی جب تک وہ بالغہ نہ ہو اور اپنے سر کو خمار (اوڑھنی) سے نہ ڈھانپے۔ یہ حکم نماز کی صحت کے لیے لباس کے شرعی تقاضوں کو بیان کرتا ہے اور اس بات کی تاکید ہے کہ عورت نماز میں مکمل شرعی پردے کے ساتھ کھڑی ہو۔",
    "english": "This Hadith states that a woman's prayer is not accepted unless she has reached puberty and covers her head with a Khimar (head covering). This ruling defines the legal dress requirements for the validity of prayer, emphasizing that a woman must stand before Allah with complete legal covering."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (641)",
      "english": "Reported by Abu Dawud (641)"
    },
    {
      "arabic": "رواه الترمذي (377)",
      "english": "Reported by At-Tirmidhī (377)"
    },
    {
      "arabic": "صححه ابن خزيمة (775)",
      "english": "Authenticated by Ibn Khuzaymah (775)"
    },
    {
      "arabic": "رواه أحمد (6/259)",
      "english": "Reported by Ahmad (6/259)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ستر عورت اور نماز کی شرطیں",
        "english": "Covering the 'Awrah and Conditions of Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بالغہ عورت کا ستر",
              "english": "'Awrah of a Post-pubescent Woman"
            },
            "content": {
              "urdu": [
                "حدیث میں 'حائض' سے مراد وہ عورت ہے جو حیض کی عمر کو پہنچ گئی ہو، یعنی بالغہ ہو، خواہ اس وقت حالتِ حیض میں نہ ہو۔",
                "بالغہ عورت کا نماز میں پورا جسم ستر ہے، سوائے چہرے اور ہتھیلیوں کے (جمہور فقہاء کے نزدیک)۔",
                "خمار (سر ڈھانپنا) اس ستر کا لازمی حصہ ہے، جس کے بغیر نماز قبول نہیں ہوتی۔"
              ],
              "english": [
                "The term 'Ḥā'iḍ' refers to a woman who has reached the age of menstruation, meaning puberty, whether she is currently menstruating or not.",
                "The entire body of a post-pubescent woman is 'Awrah (to be covered) during prayer, except for the face and palms (according to the majority of jurists).",
                "The Khimar (head covering) is an essential part of this 'Awrah, without which the prayer is not accepted."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبولیت اور صحت کا معیار",
              "english": "Standard for Acceptance and Validity"
            },
            "content": {
              "urdu": [
                "«لَا يَقْبَلُ اَللَّهُ صَلَاةَ» کا مطلب ہے کہ نماز شرعی طور پر صحیح نہیں ہوگی، اگرچہ ظاہری ارکان پورے کیے جائیں۔",
                "ستر عورت نماز کی صحت کے لیے ایک بنیادی شرط ہے، طہارت اور وقت کی طرح۔",
                "یہ حکم اس بات کی تاکید ہے کہ اللہ کے سامنے مکمل وقار اور شرعی آداب کے ساتھ کھڑا ہونا چاہیے۔"
              ],
              "english": [
                "'Allah does not accept the prayer' means the prayer will not be legally valid, even if the outward pillars are completed.",
                "'Awrah covering is a fundamental condition for the validity of prayer, just like purification and timing.",
                "This ruling emphasizes the need to stand before Allah with complete dignity and adherence to legal manners."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خمار (اوڑھنی) اور لباس کا حکم",
        "english": "Ruling of Khimar (Head Covering) and Dress"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خمار کی ضرورت",
              "english": "Necessity of the Khimar"
            },
            "content": {
              "urdu": [
                "خمار سے مراد وہ اوڑھنی ہے جو سر، بال اور گردن کو ڈھانپ لے، جیسا کہ سورہ نور میں اس کا حکم ہے۔",
                "عورت کو نماز کے لیے ایک ایسے کپڑے (جیسے درع) کی بھی ضرورت ہے جو پاؤں سمیت جسم کے بقیہ حصے کو ڈھانپے۔",
                "صحیح حکم یہ ہے کہ نماز میں عورت کے تمام اعضاء کا ڈھانپنا ضروری ہے، سوائے مستثنیٰ اعضاء کے۔"
              ],
              "english": [
                "Khimar refers to the head covering that covers the head, hair, and neck, as commanded in Sūrat An-Nūr.",
                "A woman also requires a garment (like a Dir') during prayer that covers the rest of her body, including her feet.",
                "The correct ruling is that all of a woman's body parts must be covered in prayer, except for the exempted areas."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کے لیے خمار",
              "english": "Khimar for Children"
            },
            "content": {
              "urdu": [
                "حدیث میں 'حائض' کا لفظ اس بات کی دلیل ہے کہ نابالغ بچیوں کے لیے نماز میں پردہ لازم نہیں ہے۔",
                "تاہم، اگرچہ واجب نہیں، لیکن نابالغ بچیوں کو بھی نماز کے لیے پردے کی عادت ڈالنا مستحسن ہے۔",
                "فقہاء نے نابالغ بچیوں کے نماز میں پردے کی شرط کے بارے میں اختلاف کیا ہے، لیکن بالغہ کے لیے اجماعی حکم ہے۔"
              ],
              "english": [
                "The term 'Ḥā'iḍ' indicates that covering is not obligatory for pre-pubescent girls in prayer.",
                "However, although not obligatory, it is recommended to train young girls to cover themselves for prayer as a good habit.",
                "Jurists have differed on the condition of covering for non-pubescent girls, but the ruling is unanimous for the post-pubescent woman."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحت حدیث اور فقہی عمل",
        "english": "Authenticity of Hadith and Juristic Practice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کی صحت پر اتفاق",
              "english": "Agreement on Hadith Authenticity"
            },
            "content": {
              "urdu": [
                "ابن خزیمہ اور دیگر محدثین نے اس حدیث کو صحیح قرار دیا ہے، اور اس پر فقہاء کا عمل ہے۔",
                "جو علماء اس حدیث میں علت بیان کرتے ہیں، ان کی رائے کے مقابلے میں اس حدیث کی صحت کو ترجیح دی جاتی ہے۔",
                "یہ حدیث اس بات کو ثابت کرتی ہے کہ نماز میں عورتوں کے لیے خاص لباس اور پردے کے احکام ہیں۔"
              ],
              "english": [
                "Ibn Khuzaymah and other Hadith scholars authenticated this Hadith, and jurists rely on it for rulings.",
                "The authenticity of this Hadith is preferred over the opinions of those scholars who mention defects in its chain.",
                "This Hadith proves that there are specific dress and covering requirements for women in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسائی کا عدم اخراج",
              "english": "Non-inclusion by An-Nasā'ī"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر کا یہ کہنا کہ اسے نسائی کے سوا پانچوں نے روایت کیا ہے، اس بات کی طرف اشارہ کرتا ہے کہ نسائی نے شاید کسی سند کی علت کی وجہ سے اسے روایت نہ کیا ہو۔",
                "تاہم، دیگر کتبِ ستہ میں اس کی موجودگی اور تصحیح اس کے فقہی حکم کو متاثر نہیں کرتی۔",
                "محدثین کی تحقیق کا مقصد ہر روایت کو اس کے صحیح مقام پر رکھنا ہے۔"
              ],
              "english": [
                "Al-Ḥāfiz Ibn Ḥajar's note that the five compilers except An-Nasā'ī reported it suggests that An-Nasā'ī might have excluded it due to a defect in one of the chains he examined.",
                "However, its inclusion in other canonical collections and its authentication do not affect its legal status.",
                "The purpose of Hadith criticism is to place every narration in its correct rank."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی درس",
        "english": "Training and Ethical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کے سامنے آداب",
              "english": "Manners Before Allah"
            },
            "content": {
              "urdu": [
                "نماز اللہ کے سامنے کھڑے ہونے کا موقع ہے، لہٰذا عورت کو بہترین اور مکمل لباس میں ہونا چاہیے۔",
                "جیسے دنیاوی بادشاہ کے سامنے اچھے لباس میں جایا جاتا ہے، اسی طرح اللہ کے سامنے بھی آداب کا خیال رکھنا چاہیے۔",
                "یہ حکم مسلمان عورت کو ہر وقت باحیا اور پردہ دار رہنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Prayer is the occasion to stand before Allah, so a woman should be in the best and most complete attire.",
                "Just as one appears before a worldly king in good clothing, attention must be paid to manners before Allah.",
                "This ruling encourages the Muslim woman to maintain modesty and covering at all times."
              ]
            }
          },
          {
            "title": {
              "urdu": "سہولت اور شرعی پردہ",
              "english": "Ease and Legal Covering"
            },
            "content": {
              "urdu": [
                "عورت کے لیے نماز کا لباس جسم کو مکمل ڈھانپنے والا اور گاڑھا ہونا چاہیے تاکہ اس کا ستر ظاہر نہ ہو۔",
                "اسلام نے پردے اور حیا کو عبادت کی روح کا حصہ بنایا ہے، جو نماز میں بھی جھلکتا ہے۔",
                "یہ حکم ان تمام خواتین کے لیے لازمی ہے جو نماز کو صحیح طور پر ادا کرنا چاہتی ہیں۔"
              ],
              "english": [
                "A woman's prayer attire must be opaque and completely cover the body so that her 'Awrah is not exposed.",
                "Islam has made modesty and covering part of the spirit of worship, which is reflected in prayer.",
                "This ruling is mandatory for all women who wish to perform their prayers correctly."
              ]
            }
          }
        ]
      }
    }
  ]
}
