{
  "hadithId": 390,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-390"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (963)‏، ومسلم (888). وهو أصل في تقديم الصلاة على الخطبة في العيدين.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (963) اور امام مسلم (888) نے روایت کیا ہے۔ یہ عیدین میں خطبہ پر نماز کو مقدم رکھنے کی مستند دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (963) and Muslim (888). It serves as a primary evidence for performing the prayer before the sermon in both Eids."
  },
  "importantWords": [
    {
      "arabic": "الْعِيدَيْنِ",
      "english": "The two Eids",
      "urdu": "دونوں عیدیں"
    },
    {
      "arabic": "قَبْلَ",
      "english": "Before",
      "urdu": "پہلے"
    },
    {
      "arabic": "اَلْخُطْبَةِ",
      "english": "The sermon",
      "urdu": "خطبہ"
    },
    {
      "arabic": "يُصَلُّونَ",
      "english": "They pray",
      "urdu": "وہ نماز پڑھتے تھے"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    }
  ],
  "summary": {
    "urdu": "سنتِ نبوی اور سنتِ خلفائے راشدین یہ ہے کہ عیدین میں پہلے نماز ادا کی جائے اور اس کے بعد خطبہ دیا جائے۔",
    "english": "The Sunnah of the Prophet (ﷺ) and the Rightly Guided Caliphs is to perform the Eid prayer first, followed by the sermon."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (963)",
      "english": "Sahih al-Bukhari (963)"
    },
    {
      "arabic": "صحيح مسلم (888)",
      "english": "Sahih Muslim (888)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=eid+prayer+before+khutbah+sunnah+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز اور خطبے کی ترتیب",
        "english": "Sequence of Prayer and Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ نبوی کی پیروی",
              "english": "Following the Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "عیدین کی نماز میں پہلے دو رکعت نماز ادا کرنا مسنون طریقہ ہے۔",
                "اس کے بعد امام منبر پر (یا زمین پر) کھڑے ہو کر خطبہ دیتا ہے۔",
                "یہ ترتیب جمعہ کی نماز کے برعکس ہے جہاں خطبہ پہلے ہوتا ہے۔"
              ],
              "english": [
                "Performing the two-rak'ah prayer first is the prescribed Sunnah for the Eids.",
                "After the prayer, the Imam stands to deliver the sermon to the congregation.",
                "This sequence is opposite to Jumu'ah prayer, where the sermon comes first."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلفائے راشدین کا عمل",
              "english": "Practice of the Caliphs"
            },
            "content": {
              "urdu": [
                "حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما نے بھی اسی ترتیب کو برقرار رکھا۔",
                "صحابہ کرام کا اس پر عمل کرنا اس کی اہمیت اور ثبوت کو مزید پختہ کرتا ہے۔",
                "سنتِ خلفائے راشدین کی پیروی کرنا بھی مسلمانوں پر لازم قرار دیا گیا ہے۔"
              ],
              "english": [
                "Abu Bakr and 'Umar (RA) maintained this sequence throughout their leadership.",
                "The practice of the Sahaba reinforces the validity and importance of this order.",
                "Following the Sunnah of the Rightly Guided Caliphs is also mandated for Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام و حکمت",
        "english": "Juristic Rulings and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خطبہ سننے کا حکم",
              "english": "Ruling on Listening to the Sermon"
            },
            "content": {
              "urdu": [
                "عید کی نماز واجب ہے جبکہ خطبہ سننا سنت اور مستحب عمل ہے۔",
                "اگر کوئی شخص نماز کے بعد خطبہ سنے بغیر چلا جائے تو گناہ گار نہیں ہوگا۔",
                "تاہم مکمل اجر و ثواب حاصل کرنے کے لیے خطبہ سننا نہایت ضروری ہے۔"
              ],
              "english": [
                "The Eid prayer is obligatory/waajib, while listening to the sermon is Sunnah.",
                "If someone leaves after the prayer without listening to the sermon, they are not sinful.",
                "However, to attain the full reward of the day, staying for the sermon is vital."
              ]
            }
          },
          {
            "title": {
              "urdu": "تبدیلی کی ممانعت",
              "english": "Prohibition of Innovation"
            },
            "content": {
              "urdu": [
                "بعد کے ادوار میں بعض امراء نے خطبہ پہلے شروع کیا تاکہ لوگ رکیں۔",
                "علماء نے اس عمل کو سنت کے خلاف قرار دے کر اس کی مذمت کی ہے۔",
                "عبادات کی اصل روح ان کی منقولہ ترتیب میں ہی پوشیدہ ہے۔"
              ],
              "english": [
                "In later periods, some rulers moved the sermon first to ensure people stayed.",
                "Scholars condemned this practice as an innovation against the established Sunnah.",
                "The true spirit of worship lies in following the transmitted sequence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتماعی فوائد",
        "english": "Collective Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتحاد اور یکجہتی",
              "english": "Unity and Solidarity"
            },
            "content": {
              "urdu": [
                "نماز کو مقدم رکھنا اس بات کی دلیل ہے کہ بندگی کا حق سب سے پہلے ہے۔",
                "مسلمانوں کا ایک ہی امام کے پیچھے نماز پڑھنا ان کی وحدت کو ظاہر کرتا ہے۔",
                "خطبہ مسلمانوں کی تربیت اور ان کو درپیش مسائل سے آگاہی کا ذریعہ ہے۔"
              ],
              "english": [
                "Prioritizing the prayer proves that the right of worship comes first.",
                "Muslims praying behind a single Imam showcases their collective unity.",
                "The sermon serves to educate Muslims and keep them aware of their issues."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی شعور کی بیداری",
              "english": "Awakening Religious Consciousness"
            },
            "content": {
              "urdu": [
                "عید کا دن صرف کھیل کود کا نہیں بلکہ ذکر و فکر کا دن ہے۔",
                "نماز اور خطبے کی یہ ترتیب روح اور جسم دونوں کی بالیدگی کا سبب ہے۔",
                "اجتماعی دعا اللہ کی رحمتوں کو سمیٹنے کا بہترین موقع فراہم کرتی ہے۔"
              ],
              "english": [
                "Eid is not just a day of play, but a day of remembrance and reflection.",
                "This sequence of prayer and sermon nurtures both the soul and the mind.",
                "Collective supplication provides an ideal chance to seek Allah's blessings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی پابندی",
              "english": "Adherence to Discipline"
            },
            "content": {
              "urdu": [
                "دین اسلام ہمیں زندگی کے ہر شعبے میں نظم و ضبط سکھاتا ہے۔",
                "عبادات کی مخصوص ترتیب پر عمل کرنا مومن کے لیے باعثِ فخر ہے۔",
                "سنت کی پابندی ہی ہمیں گمراہی اور بے راہ روی سے بچاتی ہے۔"
              ],
              "english": [
                "Islam teaches us discipline in every aspect of our lives.",
                "Adhering to the specific order of worship is a matter of pride for a believer.",
                "Following the Sunnah is what protects us from misguidance and confusion."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء سے رہنمائی",
              "english": "Guidance from Scholars"
            },
            "content": {
              "urdu": [
                "ہمیں عبادات کے مسائل میں مستند احادیث اور فقہاء کی طرف رجوع کرنا چاہیے۔",
                "عیدین کے احکام کو سمجھنا ہر مسلمان کی ذمہ داری ہے۔",
                "صحیح علم ہی ہمیں صحیح عمل کی طرف راغب کرتا ہے۔"
              ],
              "english": [
                "We must refer to authentic Hadiths and jurists regarding matters of worship.",
                "Understanding the rulings of the two Eids is a responsibility for every Muslim.",
                "Correct knowledge is what leads us toward correct actions."
              ]
            }
          }
        ]
      }
    }
  ]
}
