{
  "hadithId": 583,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/583"],
    "kitabId": 6,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 36
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1336)، وأبو داود (1736)، والنسائي (2648)، وأحمد (1/219). والروحاء: مكان بين مكة والمدينة على نحو ستة وثلاثين ميلاً من المدينة.",
    "urdu": "صحیح۔ اسے مسلم (1336)، ابوداؤد (1736) اور نسائی (2648) نے روایت کیا ہے۔ روحاء مدینہ سے مکہ کے راستے میں تقریباً 36 میل کے فاصلے پر ایک مقام کا نام ہے۔",
    "english": "Sahih. Reported by Muslim (1336), Abu Dawud (1736), and An-Nasa'i (2648). Ar-Rauha is a place located about 36 miles from Medina on the way to Mecca."
  },
  "importantWords": [
    {
      "arabic": "رَكْبًا",
      "english": "Riders / Caravan",
      "urdu": "سوار / قافلہ"
    },
    {
      "arabic": "الرَّوْحَاءِ",
      "english": "Ar-Rauha (Place name)",
      "urdu": "روحاء (ایک مقام)"
    },
    {
      "arabic": "رَفَعَتْ",
      "english": "Lifted up",
      "urdu": "اٹھایا / بلند کیا"
    },
    {
      "arabic": "صَبِيًّا",
      "english": "Child / Infant",
      "urdu": "بچہ"
    },
    {
      "arabic": "أَجْرٌ",
      "english": "Reward",
      "urdu": "ثواب / اجر"
    }
  ],
  "summary": {
    "urdu": "نابالغ بچوں کا حج شرعاً درست ہے اور اس کا ثواب بچے اور اس کے والدین دونوں کو ملتا ہے، تاہم یہ حج بچے کے ذمے سے فرض حج کو ساقط نہیں کرتا۔",
    "english": "The Hajj of a minor child is valid in Shariah and brings reward to both the child and the parents, though it does not fulfill the child's lifetime obligation once they reach adulthood."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1336)",
      "english": "Sahih Muslim (1336)"
    },
    {
      "arabic": "سنن النسائي (2648)",
      "english": "Sunan an-Nasa'i (2648)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S-H9X8A0V5s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بچوں کے حج کا حکم",
        "english": "Ruling on Children performing Hajj"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حج کی صحت اور ثواب",
              "english": "Validity and Reward"
            },
            "content": {
              "urdu": [
                "نابالغ بچے کا حج کرنا شرعاً جائز اور درست ہے جیسا کہ نبی ﷺ نے اس کی تصدیق فرمائی۔",
                "اس حج کا اجر و ثواب بچے کے نامہ اعمال میں لکھا جاتا ہے اور والدین کو بھی تربیت پر اجر ملتا ہے۔",
                "یہ حدیث اس بات کی دلیل ہے کہ نیکی کے کاموں میں عمر کی کوئی کم از کم قید نہیں ہے۔"
              ],
              "english": [
                "Hajj performed by a minor is legally valid and correct, as confirmed by the Prophet (ﷺ).",
                "The reward for this Hajj is recorded for the child, and parents are rewarded for their effort and guidance.",
                "This Hadith proves that there is no minimum age requirement for earning spiritual rewards in good deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرضیت کا مسئلہ",
              "english": "The Issue of Obligation"
            },
            "content": {
              "urdu": [
                "بچپن میں کیا گیا حج نفلی ہوتا ہے اور اس سے زندگی کا فرض حج ادا نہیں ہوتا۔",
                "جب بچہ بالغ ہو جائے اور استطاعت رکھتا ہو تو اسے دوبارہ حج کرنا فرض ہوگا۔",
                "جمہور فقہاء کا اسی پر اتفاق ہے کہ بلوغت کے بعد فرض حج اپنی جگہ باقی رہتا ہے۔"
              ],
              "english": [
                "A Hajj performed during childhood is considered voluntary (Nafl) and does not replace the obligatory Hajj.",
                "Once the child reaches adulthood and has the means, they must perform Hajj again as a religious obligation.",
                "The majority of jurists agree that the lifetime obligation remains due even if one performed Hajj as a child."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "والدین کی محنت اور اجر",
        "english": "Parental Effort and Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماں کے لیے اجر کی بشارت",
              "english": "Glad Tidings for the Mother"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ اس حج کی وجہ سے 'تمہارے لیے اجر ہے' کیونکہ مشقت والدین اٹھاتے ہیں۔",
                "بچوں کو حج کروانا ایک مشکل کام ہے جس پر اللہ تعالیٰ والدین کو خصوصی ثواب عطا کرتا ہے۔",
                "یہ دینِ اسلام کی وسعت ہے کہ وہ محنت کرنے والے کے اجر کو ضائع نہیں کرتا۔"
              ],
              "english": [
                "The Prophet (ﷺ) said 'there is a reward for you' because the parents bear the physical and logistical burden.",
                "Taking children for Hajj is a strenuous task for which Allah grants special rewards to the parents.",
                "It reflects the vastness of Islam that the effort of the caregiver is never overlooked or unrewarded."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچوں کی دینی تربیت",
              "english": "Religious Training of Children"
            },
            "content": {
              "urdu": [
                "بچپن میں حج کروانے کا ایک بڑا مقصد بچوں کو شعائرِ اسلام سے مانوس کرنا ہے۔",
                "ایسے تجربات بچوں کے ذہنوں پر گہرے نقوش چھوڑتے ہیں اور ان میں اللہ کی محبت پیدا ہوتی ہے۔",
                "والدین کو چاہیے کہ وہ بچوں کو نیک کاموں کی عادت ڈالیں تاکہ وہ صالح انسان بن سکیں۔"
              ],
              "english": [
                "A major purpose of performing Hajj with children is to familiarize them with Islamic symbols.",
                "Such experiences leave lasting impressions on young minds and foster a deep love for Allah.",
                "Parents should instill habits of righteousness in children to ensure they grow into pious individuals."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی طریقہ کار",
        "english": "Juristic Procedures"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے کا احرام اور ارکان",
              "english": "Child's Ihram and Rituals"
            },
            "content": {
              "urdu": [
                "بچہ اگر سمجھدار ہے تو خود نیت کرے گا، ورنہ اس کا ولی اس کی طرف سے نیت اور تلبیہ پڑھے گا۔",
                "بچے کے جسم سے سلے ہوئے کپڑے اتار کر اسے احرام کی چادریں پہنائی جائیں گی۔",
                "جو ارکان بچہ خود نہیں کر سکتا (جیسے رمی) وہ اس کا ولی اس کی طرف سے ادا کرے گا۔"
              ],
              "english": [
                "If the child is discerning, they make the intention; otherwise, the guardian makes it and recites Talbiyah on their behalf.",
                "Stitched clothes are removed from the child and they are dressed in the sheets of Ihram.",
                "Rituals that the child cannot perform personally (like stoning the pillars) are performed by the guardian on their behalf."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممنوعات سے بچاؤ",
              "english": "Avoiding Prohibitions"
            },
            "content": {
              "urdu": [
                "ولی کی ذمہ داری ہے کہ وہ بچے کو احرام کی پابندیوں (خوشبو، سر ڈھانپنا وغیرہ) سے بچائے۔",
                "اگر بچہ نادانی میں کوئی غلطی کر دے تو اکثر فقہاء کے نزدیک اس پر دم (قربانی) واجب نہیں ہوتا۔",
                "بچے کے حج میں آسانی اور سہولت کا پہلو نمایاں رکھا گیا ہے۔"
              ],
              "english": [
                "The guardian must ensure the child adheres to Ihram restrictions like avoiding perfume or covering the head.",
                "If the child commits a violation out of ignorance, most jurists hold that no penalty (Damm) is required.",
                "The aspect of ease and facilitation is highly prominent in the rulings regarding a child's Hajj."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی اخلاق اور معاشرت",
        "english": "Prophetic Ethics and Society"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی تواضع",
              "english": "Humility of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا راستے میں مسافروں سے حال احوال پوچھنا آپ ﷺ کی عاجزی اور شفقت کو ظاہر کرتا ہے۔",
                "آپ ﷺ نے ایک عام عورت کے سوال کا نہایت محبت اور واضح انداز میں جواب دیا۔",
                "یہ رویہ حکمرانوں اور علماء کے لیے سبق ہے کہ وہ عوام کے لیے قابلِ رسائی رہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of greeting and conversing with travelers shows his immense humility and compassion.",
                "He answered the query of an ordinary woman with great kindness and clarity.",
                "This behavior is a lesson for leaders and scholars to remain accessible to the common people."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی بھائی چارہ",
              "english": "Islamic Brotherhood"
            },
            "content": {
              "urdu": [
                "مسافروں کا یہ کہنا کہ 'ہم مسلمان ہیں' ان کی اصل پہچان اور فخر کو ظاہر کرتا ہے۔",
                "اسلامی معاشرے میں ایمان ہی سب سے بڑا رشتہ اور تعارف ہے۔",
                "یہ حدیث مسلمانوں کے آپسی تعلقات اور خیر خواہی کی بہترین مثال پیش کرتی ہے۔"
              ],
              "english": [
                "The travelers' response 'We are Muslims' highlights their true identity and source of pride.",
                "In an Islamic society, faith is the greatest bond and the primary introduction.",
                "This Hadith provides an excellent example of mutual relations and well-wishing among Muslims."
              ]
            }
          }
        ]
      }
    }
  ]
}