{
  "hadithId": 468,
  "hadithNo": 44,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/44", "muslim/966", "muslim/970"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (966) و (970). ورواية رفع القبر قدر شبر رواها البيهقي (3/407) وصححها ابن حبان (6601).",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح (966 اور 970) میں روایت کیا ہے۔ قبر کو بالشت بھر اونچا کرنے والی زیادتی بیہقی اور ابن حبان میں موجود ہے جو کہ صحیح ہے۔",
    "english": "Sahih. Reported by Muslim (966 and 970). The addition regarding raising the grave by a hand span was reported by Al-Bayhaqi (3/407) and authenticated by Ibn Hibban (6601)."
  },
  "importantWords": [
    {
      "arabic": "أَلْحَدُوا",
      "english": "Make a Lahd (niche)",
      "urdu": "لحد (بغلی قبر) بناؤ"
    },
    {
      "arabic": "اللَّبِنَ",
      "english": "Unburnt bricks",
      "urdu": "کچی اینٹیں"
    },
    {
      "arabic": "شِبْرٍ",
      "english": "Hand span",
      "urdu": "بالشت (ہاتھ کی ایک ناپ)"
    },
    {
      "arabic": "يُجَصَّصَ",
      "english": "Plastered / Cemented",
      "urdu": "پختہ کرنا / چونا گچ کرنا"
    },
    {
      "arabic": "يُبْنَى",
      "english": "Built upon",
      "urdu": "عمارت بنانا"
    }
  ],
  "summary": {
    "urdu": "قبر سنت کے مطابق کچی، لحد والی اور زمین سے معمولی بلند ہونی چاہیے؛ اسے پختہ کرنا یا اس پر عمارت بنانا شرعاً ممنوع ہے۔",
    "english": "According to Sunnah, graves should be simple, have a niche (Lahd), and be slightly raised; plastering or building structures over them is forbidden."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الجنائز، رقم 966",
      "english": "Sahih Muslim, Book of Funerals, Hadith 966"
    },
    {
      "arabic": "صحيح مسلم، كتاب الجنائز، رقم 970",
      "english": "Sahih Muslim, Book of Funerals, Hadith 970"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعد بن أبي وقاص",
        "english": "Sa'd bin Abi Waqqas"
      },
      "slug": "sad-bin-abi-waqqas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبر کی بناوٹ اور لحد کی فضیلت",
        "english": "Structure of the Grave and Virtue of Lahd"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لحد (بغلی قبر) کی اہمیت",
              "english": "Importance of Lahd (The Niche)"
            },
            "content": {
              "urdu": [
                "لحد وہ قبر ہے جس میں میت کو قبلہ رخ ایک طرف بنی ہوئی کھوہ میں رکھا جاتا ہے۔",
                "نبی کریم ﷺ کے لیے لحد والی قبر ہی بنائی گئی تھی، جو کہ سنتِ نبوی ہے۔",
                "سیدنا سعد بن ابی وقاص رض نے اپنی وفات پر اسی سنت کو اپنانے کی وصیت فرمائی۔"
              ],
              "english": [
                "A Lahd is a grave where a niche is dug on the Qibla side to place the body.",
                "The grave of the Prophet (ﷺ) was a Lahd, making it the preferred Sunnah practice.",
                "Sa'd bin Abi Waqqas (RA) requested this specifically to follow the Prophet's example."
              ]
            }
          },
          {
            "title": {
              "urdu": "کچی اینٹوں کا استعمال",
              "english": "Using Unburnt Bricks"
            },
            "content": {
              "urdu": [
                "میت کو لحد میں رکھنے کے بعد اسے کچی اینٹوں (لبن) سے ڈھانپنا مسنون ہے۔",
                "آگ میں پکی ہوئی اینٹوں کے بجائے کچی مٹی کی اینٹیں استعمال کرنا سنت کے قریب ہے۔",
                "یہ طریقہ میت کے وقار اور قبر کی مضبوطی کے لیے بہترین ثابت ہوتا ہے۔"
              ],
              "english": [
                "It is Sunnah to cover the niche with unburnt bricks (Labin) after placing the body.",
                "Using raw mud bricks instead of fire-baked ones aligns more closely with the Sunnah.",
                "This method is ideal for maintaining the dignity of the deceased and the grave's integrity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبر کو پختہ کرنے کی ممانعت",
        "english": "Prohibition of Plastering Graves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پختہ قبروں سے اجتناب",
              "english": "Avoiding Plastered Graves"
            },
            "content": {
              "urdu": [
                "قبروں کو چونا گچ کرنا یا سیمنٹ سے پختہ بنانا نبی ﷺ نے سختی سے منع فرمایا ہے۔",
                "یہ عمل اسراف (فضول خرچی) اور قبروں کی بے جا تقدیس کی طرف لے جاتا ہے۔",
                "سادہ کچی قبریں ہی اسلامی سادگی اور فنائیتِ دنیا کی اصل علامت ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) strictly forbade plastering or cementing graves with gypsum.",
                "Such practices lead to extravagance and improper sanctification of burial sites.",
                "Simple, unadorned graves are the true symbols of Islamic simplicity and mortality."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمارت اور گنبد بنانا",
              "english": "Building Structures and Domes"
            },
            "content": {
              "urdu": [
                "قبروں پر کمرے، مزارات یا گنبد تعمیر کرنا شرعی طور پر ناجائز اور ممنوع ہے۔",
                "ایسی تعمیرات بالآخر شرک اور قبر پرستی جیسے فتنوں کا سبب بنتی ہیں۔",
                "اسلامی احکامات کا مقصد قبرستانوں کو عبادت گاہوں میں تبدیل ہونے سے بچانا ہے۔"
              ],
              "english": [
                "Building rooms, shrines, or domes over graves is religiously impermissible and forbidden.",
                "Such constructions eventually lead to trials like Shirk and grave worship.",
                "Islamic rulings aim to prevent graveyards from being turned into places of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبر کا احترام اور بلندی",
        "english": "Respect and Elevation of the Grave"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبر کی بلندی کتنی ہو؟",
              "english": "How High Should a Grave Be?"
            },
            "content": {
              "urdu": [
                "قبر کو زمین سے صرف ایک بالشت (تقریباً 9 انچ) اونچا رکھنا سنت سے ثابت ہے۔",
                "اتنی بلندی اس لیے ہے تاکہ معلوم ہو سکے کہ یہاں کسی مسلمان کی قبر ہے۔",
                "قبروں کو بہت زیادہ اونچا کرنا یا پہاڑ نما بنانا سنتِ مطہرہ کے خلاف ہے۔"
              ],
              "english": [
                "Raising the grave about one hand span (9 inches) from the ground is established Sunnah.",
                "This slight elevation is meant to identify the spot as a grave for respect.",
                "Raising graves excessively high or like mountains contradicts the purified Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبر پر بیٹھنے کی ممانعت",
              "english": "Prohibition of Sitting on Graves"
            },
            "content": {
              "urdu": [
                "قبر پر بیٹھنا یا اس پر پاؤں رکھ کر چلنا میت کی توہین اور گناہ کا کام ہے۔",
                "آپ ﷺ نے قبروں کی بے حرمتی سے روکا ہے تاکہ مردوں کا احترام برقرار رہے۔",
                "مومن کی حرمت وفات کے بعد بھی اتنی ہی ہے جتنی اس کی زندگی میں تھی۔"
              ],
              "english": [
                "Sitting on a grave or walking over it is an act of disrespect and a sin.",
                "The Prophet (ﷺ) forbade desecrating graves to maintain the honor of the dead.",
                "A believer's sanctity after death is as important as it was during their lifetime."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و تربیتی اسباق",
        "english": "Practical and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ نبوی کی عالمگیریت",
              "english": "Universality of the Sunnah"
            },
            "content": {
              "urdu": [
                "تدفین کے معاملات میں بھی ہمیں مکمل طور پر سنتِ نبوی کی اتباع کرنی چاہیے۔",
                "رسم و رواج اور خاندانی نام و نمود کو چھوڑ کر شرعی طریقہ اپنانا ہی بہتر ہے۔",
                "صحابہ کرام اپنی آخری سانس تک سنت کی پیروی کے لیے فکر مند رہتے تھے۔"
              ],
              "english": [
                "We must fully follow the Prophetic Sunnah even in burial and funeral matters.",
                "It is better to abandon customs and family pride in favor of the Sharia method.",
                "The Companions remained anxious to follow the Sunnah until their very last breath."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبرستان کی زیارت کے آداب",
              "english": "Etiquettes of Visiting Graveyards"
            },
            "content": {
              "urdu": [
                "قبرستان جاتے وقت سادہ اور کچی قبریں دیکھ کر انسان کو اپنی فنائیت یاد آتی ہے۔",
                "قبروں پر میلے ٹھیلے لگانا یا وہاں غیر شرعی افعال کرنا دین میں بدعت ہے۔",
                "ہمارا کام میت کے لیے صرف دعا کرنا اور اپنی آخرت کی فکر کرنا ہونا چاہیے۔"
              ],
              "english": [
                "Seeing simple, unadorned graves reminds a person of their own eventual mortality.",
                "Organizing festivals or performing un-Islamic acts at graves is an innovation (Bid'ah).",
                "Our role should be strictly praying for the dead and worrying about our own Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}