{
  "hadithId": 119,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["1:119"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "حسن.  رواه أبو داود (287) ، والترمذي (128) ، وابن ماجه (627) ، وأحمد (6 /439) .  وقد حسنه البخاري، وصححه الترمذي، وهو ما رجحه الكثير من المحققين. ",
    "urdu": "حسن (اچھا) روایت۔ اسے ابو داؤد (287)، ترمذی (128)، ابن ماجہ (627)، اور احمد (6/439) نے روایت کیا ہے۔ اسے بخاری نے حسن اور ترمذی نے صحیح قرار دیا ہے، اور یہی وہ رائے ہے جسے محققین کی بڑی تعداد نے ترجیح دی ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (287), At-Tirmidhi (128), Ibn Majah (627), and Ahmad (6/439). It was graded Hasan by Al-Bukhari and Sahih by At-Tirmidhi, which is the view preferred by many verification scholars."
  },
  "importantWords": [
    {
      "arabic": "حَيْضَةً كَبِيرَةً شَدِيدَةً",
      "english": "Excessive and severe menses",
      "urdu": "زیادہ اور شدید حیض"
    },
    {
      "arabic": "رَكْضَةٌ مِنَ اَلشَّيْطَانِ",
      "english": "Kick from the Satan",
      "urdu": "شیطان کی طرف سے ایک ضرب"
    },
    {
      "arabic": "فَتَحَيَّضِي",
      "english": "So count your menses",
      "urdu": "تم حیض شمار کرو"
    },
    {
      "arabic": "اِغْتَسِلِي",
      "english": "Perform Ghusl",
      "urdu": "غسل کرو"
    },
    {
      "arabic": "اسْتَنْقَأْتِ",
      "english": "You have purified yourself",
      "urdu": "تم پاکیزگی حاصل کر لو"
    },
    {
      "arabic": "تَجْمَعِينَ",
      "english": "You combine/join",
      "urdu": "تم جمع کرو"
    },
    {
      "arabic": "أَعْجَبُ اَلْأَمْرَيْنِ",
      "english": "The more astonishing/better of two matters",
      "urdu": "دونوں حکموں میں زیادہ پسندیدہ"
    },
    {
      "arabic": "يُجْزِئُكَ",
      "english": "Suffices you",
      "urdu": "تمہیں کافی ہو گا"
    }
  ],
  "summary": {
    "urdu": "سیدہ حمنہ بنت جحش کو شدید استحاضہ کی شکایت پر نبی اکرم ﷺ نے انہیں دو آپشنز دیئے: اول، اپنی عادت کے مطابق 6 یا 7 دن حیض شمار کر کے باقی دنوں میں وضو کر کے نماز پڑھیں؛ دوم، زیادہ مشقت والی صورت میں ظہر و عصر، اور مغرب و عشاء کو ایک ایک غسل کے ساتھ جمع کر کے پڑھیں۔ آپ ﷺ نے جمع کرنے والی صورت کو زیادہ پسند فرمایا۔",
    "english": "Due to severe Istihadah, Hamnah bint Jahsh was given two options by the Prophet ﷺ: firstly, count 6 or 7 days as menses according to her habit, and pray after performing Wudu on the remaining days; secondly, combine Dhuhr/Asr and Maghrib/Isha with one Ghusl each, plus a Ghusl for Fajr. The Prophet ﷺ stated that the combination method was preferable to him."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (287)",
      "english": "Reported by Abu Dawud (287)"
    },
    {
      "arabic": "رواه الترمذي (128)",
      "english": "Reported by At-Tirmidhi (128)"
    },
    {
      "arabic": "حسنه البخاري",
      "english": "Graded Hasan by Al-Bukhari"
    }
  ],
  "narrators": [
    {
      "id": 11901,
      "name": {
        "arabic": "حَمْنَةَ بِنْتِ جَحْشٍ",
        "english": "Hamnah bint Jahsh"
      },
      "slug": "hamnah-bint-jahsh"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "حسن",
    "english": "Good (Hasan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استحاضہ کا علاج اور وقت کا تعین",
        "english": "Remedy and Time Determination for Istihadah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان کی طرف سے تکلیف",
              "english": "Affliction from Satan"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے استحاضہ کو 'شیطان کی ضرب' قرار دیا، جس کا مطلب ہے کہ یہ ایک غیر فطری بیماری ہے۔",
                "یہ اس بات کی نشاندہی کرتا ہے کہ استحاضہ حیض کے شرعی احکام کے تحت نہیں آتا۔",
                "اس حالت میں عورت کو عبادت ترک نہیں کرنی چاہیے بلکہ رخصت پر عمل کرنا چاہیے۔"
              ],
              "english": [
                "The Prophet ﷺ termed Istihadah a 'kick from Satan,' indicating it is an unnatural sickness.",
                "This signifies that Istihadah is not governed by the religious rulings of menstruation (Hayd).",
                "In this state, a woman should not abandon worship but should follow the available concession."
              ]
            }
          },
          {
            "title": {
              "urdu": "عادت کے مطابق حیض",
              "english": "Menstruation According to Habit"
            },
            "content": {
              "urdu": [
                "جس عورت کی حیض کی کوئی مقررہ عادت نہ ہو، اسے عام عورتوں کی عادت (6 یا 7 دن) پر عمل کرنا چاہیے۔",
                "یہ تعین استحاضہ کے خون کے تسلسل کے باوجود، حیض کی مدت پوری کرنے کے لیے ہے۔",
                "اس کے بعد غسل کر کے باقی دنوں کو پاکی کے دن سمجھا جائے گا۔"
              ],
              "english": [
                "A woman without a fixed menstrual habit should follow the common practice of women (6 or 7 days) as her menses.",
                "This determination is made to complete the menstrual period despite the continuous flow of Istihadah blood.",
                "After performing Ghusl, the remaining days are considered days of purity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت کے دو اختیارات",
        "english": "Two Options for Purification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزانہ وضو کا اختیار",
              "english": "Option of Daily Wudu"
            },
            "content": {
              "urdu": [
                "پہلا اور آسان حکم یہ ہے کہ مقررہ حیض کے بعد ہر نماز کے وقت نیا وضو کر کے نماز ادا کرے۔",
                "اس حکم میں کوئی مشقت نہیں ہے، اور عورت نماز، روزہ اور دیگر عبادات جاری رکھ سکتی ہے۔",
                "نبی ﷺ نے فرمایا کہ یہ عمل اس کے لیے کافی ہے اور عام عورتوں کی طرح کرے گی۔"
              ],
              "english": [
                "The first and easier ruling is to perform Wudu for every prayer after the estimated menstrual days and then pray.",
                "This ruling does not involve undue hardship, allowing the woman to continue praying, fasting, and other acts of worship.",
                "The Prophet ﷺ stated that this action would suffice her and that she should act like other women."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمع صلوات اور غسل کا اختیار",
              "english": "Option of Combining Prayers and Ghusl"
            },
            "content": {
              "urdu": [
                "دوسرا اختیار ظہر و عصر، اور مغرب و عشاء کو غسل کے ساتھ جمع کر کے پڑھنا ہے۔",
                "غسل کی تعداد ایک دن میں تین ہو جاتی ہے، جو ظہر/عصر، مغرب/عشاء، اور فجر کے لیے ہے۔",
                "نبی ﷺ نے اس اختیار کو زیادہ پسندیدہ (اعجب الامرین) قرار دیا، جو زیادہ احتیاط اور فضیلت کی نشاندہی ہے۔"
              ],
              "english": [
                "The second option is to combine Dhuhr/Asr and Maghrib/Isha with a Ghusl for each combined set.",
                "The number of Ghusls becomes three per day: one for Dhuhr/Asr, one for Maghrib/Isha, and one for Fajr.",
                "The Prophet ﷺ termed this option 'more astonishing/better,' indicating greater precaution and virtue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی حکمت",
        "english": "Juristic and Educational Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شریعت میں آسانی اور شدت",
              "english": "Ease and Strictness in Sharia"
            },
            "content": {
              "urdu": [
                "اس حدیث میں آسانی (صرف وضو) اور زیادہ احتیاط (غسل کے ساتھ جمع) دونوں کی اجازت ہے۔",
                "یہ شریعت کی لچک کو ظاہر کرتا ہے تاکہ ہر عورت اپنی طاقت اور طبیعت کے مطابق عمل کرے۔",
                "جس عورت میں طاقت ہو، وہ غسل کے ساتھ جمع کر کے زیادہ احتیاط حاصل کر سکتی ہے۔"
              ],
              "english": [
                "This Hadith permits both ease (Wudu only) and greater caution (combining with Ghusl).",
                "It shows the flexibility of Sharia, allowing every woman to act according to her strength and circumstances.",
                "A woman who has the strength can attain greater precaution by combining prayers with Ghusl."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز جمع کرنے کا جواز",
              "english": "Permissibility of Combining Prayers"
            },
            "content": {
              "urdu": [
                "اس حدیث سے بیماری کی وجہ سے نمازوں کو جمع کرنے کا جواز بھی ثابت ہوتا ہے۔",
                "ظہر کو مؤخر کر کے عصر کے وقت اور مغرب کو مؤخر کر کے عشاء کے وقت پڑھنا 'جمع صوری' کہلاتا ہے۔",
                "نبی ﷺ کا اس عمل کو پسند کرنا اس بات کی دلیل ہے کہ حالت عذر میں یہ افضل ہو سکتا ہے۔"
              ],
              "english": [
                "This Hadith also proves the permissibility of combining prayers due to sickness.",
                "Delaying Dhuhr to the time of Asr and Maghrib to the time of Isha is known as 'Souree Jam' (formal combination).",
                "The Prophet's preference for this act suggests that it might be superior in a state of excuse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتہاد اور حکم کی نفاذ",
        "english": "Ijtihad and Implementation of the Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستحاضہ کے درجات",
              "english": "Categories of Mustahadah"
            },
            "content": {
              "urdu": [
                "فقہاء نے استحاضہ کی عورتوں کو تین درجات (عادت والی، ممیزہ، متحیرہ) میں تقسیم کیا ہے۔",
                "حمنہ بنت جحش 'متحیرہ' (Confused) تھیں جن کی نہ عادت مقرر تھی نہ خون کی پہچان واضح تھی۔",
                "ایسی صورت میں نبی ﷺ نے انہیں احتیاطاً عام عورتوں کے حیض کے دنوں کا پابند کیا۔"
              ],
              "english": [
                "Jurists divided women with Istihadah into three categories (Habitual, Discerning, Confused).",
                "Hamnah bint Jahsh was categorized as 'Mutahayyirah' (Confused), having neither a fixed habit nor clear blood distinction.",
                "In such a case, the Prophet ﷺ bound her to the usual number of menstrual days for caution."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمل کا تسلسل",
              "english": "Continuity of Action"
            },
            "content": {
              "urdu": [
                "استحاضہ کی عورت کو ایک بار غسل کرنے کے بعد اپنی عبادات جاری رکھنی چاہییں۔",
                "ہر نماز کے لیے وضو کر کے خون کے بہاؤ کو نظر انداز کرنا ضروری ہے کیونکہ یہ معاف ہے۔",
                "یہ حکم اللہ کے دین میں مشقت کے باوجود عبادت میں استقامت کی اہمیت کو اجاگر کرتا ہے۔"
              ],
              "english": [
                "A woman with Istihadah should continue her acts of worship after performing the initial Ghusl.",
                "It is necessary to ignore the blood flow by performing Wudu for each prayer, as it is excused.",
                "This ruling emphasizes the importance of steadfastness in worship despite the hardship in Allah's religion."
              ]
            }
          }
        ]
      }
    }
  ]
}
