{
  "hadithId": 1308,
  "hadithNo": 32,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/78"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "الجامع - باب الترهيب من مساوئ الأخلاق",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "ضعيف.‏ رواه أحمد (6 / 85) وسنده ضعيف، وله طرق أخرى عند الطبراني في الأوسط وغيره وكلها ضعيفة. ومع ذلك، معناه صحيح من حيث الواقع والشرع.",
    "urdu": "ضعیف۔ اسے امام احمد (6/85) نے روایت کیا ہے اور اس کی سند میں ضعف ہے۔ اگرچہ دیگر ذرائع سے بھی مروی ہے لیکن وہ بھی ضعیف ہیں، تاہم اس کا مفہوم شرعی طور پر درست ہے کہ برے اخلاق برکت کو ختم کر دیتے ہیں۔",
    "english": "Da'if (Weak). Reported by Ahmad (6/85). Its chain of narrators is weak. It has other chains in At-Tabarani, but they are all weak. However, its meaning is supported by other Islamic principles regarding the consequences of bad character."
  },
  "importantWords": [
    {
      "arabic": "اَلشُّؤْمُ",
      "english": "Evil omen / Misfortune",
      "urdu": "نحوست / بدقسمتی"
    },
    {
      "arabic": "سُوءُ اَلْخُلُقِ",
      "english": "Bad character / Ill-nature",
      "urdu": "بد خلقی / برا اخلاق"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ انسان کے برے اخلاق ہی اس کی زندگی میں بے برکتی اور نحوست کا باعث بنتے ہیں۔ سچی نحوست ستاروں یا دنوں میں نہیں بلکہ انسان کے اپنے برے عمل اور رویوں میں ہے۔",
    "english": "This Hadith points out that bad character is the true source of misfortune in life. True 'unluckiness' lies not in celestial objects or days, but in one's own ill-conduct and behavior."
  },
  "references": [
    {
      "arabic": "مسند أحمد بن حنبل، رقم 24564",
      "english": "Musnad Ahmad bin Hanbal, No. 24564"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بدخلقی کی حقیقت",
        "english": "The Reality of Bad Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نحوست کا صحیح تصور",
              "english": "The Correct Concept of Misfortune"
            },
            "content": {
              "urdu": [
                "اسلام جاہلیت کے توہمات (جیسے کالی بلی یا کسی دن کو منحوس سمجھنا) کی نفی کرتا ہے۔",
                "حقیقی نحوست وہ ہے جو انسان کو اللہ کی رحمت سے دور کر دے اور لوگوں کے دلوں میں اس کی نفرت پیدا کر دے۔",
                "بد اخلاق شخص اپنی تلخ کلامی اور برے رویے کی وجہ سے برکتوں سے محروم ہو جاتا ہے۔"
              ],
              "english": [
                "Islam negates pre-Islamic superstitions like unlucky days or animals.",
                "True misfortune is that which distances a person from Allah's mercy and breeds hatred in people's hearts.",
                "An ill-natured person is deprived of blessings due to their harsh speech and bad conduct."
              ]
            }
          },
          {
            "title": {
              "urdu": "برے اخلاق کے اثرات",
              "english": "Impact of Bad Character"
            },
            "content": {
              "urdu": [
                "بد اخلاقی سے گھر کا سکون برباد ہو جاتا ہے اور معاشرتی تعلقات ختم ہو جاتے ہیں۔",
                "نبی کریم ﷺ نے فرمایا کہ بد اخلاقی نیکی کو اس طرح خراب کر دیتی ہے جیسے سرکہ شہد کو۔",
                "جس کے اخلاق برے ہوں، اس کے رزق اور زندگی سے برکت اٹھا لی جاتی ہے۔"
              ],
              "english": [
                "Bad character ruins the peace of a home and destroys social relationships.",
                "The Prophet (ﷺ) said that bad character spoils good deeds just as vinegar spoils honey.",
                "Blessings are removed from the sustenance and life of one who possesses poor manners."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی اخلاقیات کی اہمیت",
        "english": "Importance of Islamic Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسنِ خلق کا تضاد",
              "english": "Contrast with Good Character"
            },
            "content": {
              "urdu": [
                "اگر بد خلقی نحوست ہے تو حسنِ اخلاق برکت اور خیر کا باعث ہے۔",
                "قیامت کے دن میزان میں سب سے وزنی چیز 'حسنِ اخلاق' ہی ہوگی۔",
                "بد خلقی ایمان کی کمزوری کی علامت ہے جبکہ اچھا اخلاق ایمان کی تکمیل ہے۔"
              ],
              "english": [
                "If bad character is a misfortune, then good character is a source of blessing and goodness.",
                "On the Day of Judgment, the heaviest thing on the scales will be good character.",
                "Ill-nature is a sign of weak faith, while good character is its perfection."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی اور نفسیاتی پہلو",
        "english": "Social and Psychological Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنہائی اور رسوائی",
              "english": "Isolation and Disgrace"
            },
            "content": {
              "urdu": [
                "بد اخلاق شخص کو لوگ ناپسند کرتے ہیں اور اس سے دور بھاگتے ہیں۔",
                "ایسا شخص اکثر ذہنی تناؤ اور غصے کی وجہ سے خود بھی پریشان رہتا ہے۔",
                "معاشرتی بائیکاٹ اور لوگوں کی بد دعائیں انسان کے لیے بڑی نحوست ہیں۔"
              ],
              "english": [
                "People dislike and distance themselves from an ill-mannered individual.",
                "Such a person is often personally distressed due to chronic stress and anger.",
                "Social boycotts and the grievances of others are significant misfortunes for a person."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اصلاح",
        "english": "Practical Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خود احتسابی",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "ہمیں ہر وقت اپنے رویوں کا جائزہ لینا چاہیے کہ کہیں ہم اپنی بد اخلاقی سے دوسروں کو دکھ تو نہیں پہنچا رہے۔",
                "غصے پر قابو پانا اور عفو و درگزر سے کام لینا بد خلقی کا بہترین علاج ہے۔",
                "نبی کریم ﷺ سے اچھے اخلاق کی دعا مانگنا مسنون ہے: 'اے اللہ! جیسے تو نے میری خلقت اچھی کی، میرے اخلاق بھی اچھے کر دے۔'"
              ],
              "english": [
                "We must constantly review our behaviors to see if we are hurting others with ill-nature.",
                "Controlling anger and practicing forgiveness is the best cure for bad character.",
                "It is Sunnah to pray for good character: 'O Allah, as You have made my physical form good, make my character good.'"
              ]
            }
          }
        ]
      }
    }
  ]
}