{
  "hadithId": 1033,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/42"],
    "kitabId": 9,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام",
    "babId": 83
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (4361)، والنسائي (4070). ورجاله ثقات.",
    "urdu": "یہ حدیث صحیح ہے، اسے ابوداؤد اور نسائی نے روایت کیا ہے۔ اس کے تمام راوی ثقہ ہیں اور یہ گستاخِ رسول کی شرعی سزا کے حوالے سے ایک بنیادی دلیل ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (4361) and An-Nasa'i (4070). Its narrators are reliable (thiqat)."
  },
  "importantWords": [
    {
      "arabic": "تَشْتُمُ",
      "english": "Insults / Abuses",
      "urdu": "گالی دیتی تھی"
    },
    {
      "arabic": "تَقَعُ فِيهِ",
      "english": "Disparages / Defames him",
      "urdu": "عیب جوئی کرتی تھی"
    },
    {
      "arabic": "اَلْمِعْوَلَ",
      "english": "Pickaxe / Small Dagger",
      "urdu": "کدال / چھوٹا خنجر"
    },
    {
      "arabic": "هَدَرٌ",
      "english": "Vain / Lawful to shed",
      "urdu": "رائیگاں / مباح"
    },
    {
      "arabic": "ام ولد",
      "english": "Slave mother of child",
      "urdu": "وہ لونڈی جس سے مالک کی اولاد ہو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ نبی کریم ﷺ کی شان میں گستاخی کرنے والے کا خون مباح ہے، بشرطیکہ وہ تنبیہ کے باوجود باز نہ آئے۔",
    "english": "This Hadith establishes that insulting the Prophet (ﷺ) is a capital offense, and the blood of a persistent offender is not protected by law."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (4361)",
      "english": "Reported by Abu Dawud (4361)"
    },
    {
      "arabic": "رواه النسائي (4070)",
      "english": "Reported by An-Nasa'i (4070)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF6fV8G9s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرمتِ رسول ﷺ",
        "english": "Sanctity of the Prophet (ﷺ)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گستاخی کی شرعی سزا",
              "english": "Legal Penalty for Blasphemy"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ کی توہین کرنا کفرِ بواح اور واجب القتل جرم ہے۔",
                "نابینا صحابی نے غیرتِ ایمانی کی بنیاد پر اپنی لونڈی کو قتل کیا۔",
                "نبی ﷺ نے ان کے فعل کی توثیق فرما کر اسے جائز قرار دیا۔"
              ],
              "english": [
                "Insulting the Messenger of Allah (ﷺ) is a clear act of disbelief and a capital crime.",
                "The blind companion killed his slave out of protective jealousy for the faith.",
                "The Prophet (ﷺ) validated his action and declared it lawful under Shariah."
              ]
            }
          },
          {
            "title": {
              "urdu": "تنبیہ اور مہلت",
              "english": "Warning and Respite"
            },
            "content": {
              "urdu": [
                "صحابی نے اسے بارہا منع کیا لیکن وہ باز نہ آئی اور گستاخی کرتی رہی۔",
                "سزا سے پہلے فہمائش اور توبہ کی دعوت دینا اسلامی نظام کا حصہ ہے۔",
                "جب سرکشی حد سے بڑھ جائے تو پھر قانون حرکت میں آتا ہے۔"
              ],
              "english": [
                "The Companion warned her repeatedly, but she persisted in her insults.",
                "Advising and inviting toward repentance before punishment is part of Islamic order.",
                "When rebellion exceeds limits, the law must be executed to protect the sacred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دمِ ہدر کا مفہوم",
        "english": "Meaning of Shed Blood (Hadar)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قصاص اور دیت کی نفی",
              "english": "Exemption from Qisas and Diyyah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے فرمان کا مطلب ہے کہ قاتل پر کوئی بدلہ یا جرمانہ نہیں۔",
                "گستاخِ رسول کا خون شرعی طور پر اپنی عصمت (حفاظت) کھو دیتا ہے۔",
                "یہ حکم اس جرم کی سنگینی کو ظاہر کرنے کے لیے کافی ہے۔"
              ],
              "english": [
                "The Prophet's decree means the killer owes neither retaliation nor blood money.",
                "One who insults the Prophet (ﷺ) forfeits their legal protection under Shariah.",
                "This ruling is sufficient to demonstrate the absolute gravity of the offense."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاست اور قانون",
              "english": "State and the Law"
            },
            "content": {
              "urdu": [
                "عام حالات میں حدود کا نفاذ صرف اسلامی ریاست کی ذمہ داری ہے۔",
                "اس واقعے میں خاص حالات اور گواہی کی بنیاد پر فیصلہ ہوا تھا۔",
                "مسلمانوں کو انفرادی طور پر قانون ہاتھ میں لینے سے گریز کرنا چاہیے۔"
              ],
              "english": [
                "In general circumstances, executing Hudud is solely the state's responsibility.",
                "In this incident, the judgment was based on specific context and testimony.",
                "Muslims should generally avoid taking the law into their own individual hands."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابی کی غیرتِ ایمانی",
        "english": "The Companion's Protective Zeal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نابینا صحابی کا کردار",
              "english": "The Blind Companion's Role"
            },
            "content": {
              "urdu": [
                "نابینا ہونے کے باوجود انہوں نے رسول اللہ ﷺ کی عزت کا دفاع کیا۔",
                "یہ واقعہ صحابہ کرام کی نبی ﷺ سے والہانہ محبت کی دلیل ہے۔",
                "ایمان کا تقاضا ہے کہ اللہ کے رسول ﷺ کی محبت ہر چیز پر مقدم ہو۔"
              ],
              "english": [
                "Despite being blind, he actively defended the honor of the Prophet (ﷺ).",
                "This incident illustrates the Sahabah's profound and selfless love for him.",
                "Faith requires that love for the Messenger of Allah (ﷺ) takes precedence over all."
              ]
            }
          },
          {
            "title": {
              "urdu": "درگزر کی حد",
              "english": "The Limit of Forbearance"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنی ذات کے لیے کبھی بدلہ نہیں لیا مگر دین کے لیے لیا۔",
                "جب شعائرِ اسلام اور رسالت پر حملہ ہو تو خاموشی جائز نہیں ہے۔",
                "اسلامی معاشرے میں توہینِ رسالت کو کبھی برداشت نہیں کیا گیا۔"
              ],
              "english": [
                "The Prophet (ﷺ) never took revenge for himself, but did for the religion.",
                "Silence is not permissible when Islamic symbols or the Messengership is attacked.",
                "Blasphemy against the Messenger has never been tolerated in Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادبِ رسول ﷺ",
              "english": "Etiquette Regarding the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "مسلمان کے لیے نبی ﷺ کا ادب ایمان کی بنیاد اور شرط ہے۔",
                "نبی ﷺ کی گستاخی تمام نیک اعمال کو ضائع کر دیتی ہے۔",
                "ہمیں اپنی زبانوں کو گستاخی اور بے ادبی سے پاک رکھنا چاہیے۔"
              ],
              "english": [
                "Respect for the Prophet (ﷺ) is the foundation and condition of a Muslim's faith.",
                "Disrespect toward the Prophet (ﷺ) renders all good deeds null and void.",
                "We must purify our tongues from any form of insolence or disrespect."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی امن",
              "english": "Social Peace"
            },
            "content": {
              "urdu": [
                "توہینِ رسالت معاشرے میں شدید اشتعال اور بے امنی کا باعث بنتی ہے۔",
                "اسلامی قوانین کا مقصد ایسے فتنوں کو جڑ سے ختم کرنا ہے۔",
                "مقدسات کا احترام ہی عالمی امن اور مذہبی رواداری کی بنیاد ہے۔"
              ],
              "english": [
                "Blasphemy leads to extreme provocation and unrest within the society.",
                "The aim of Islamic laws is to uproot such triggers of communal discord.",
                "Respect for the sacred is the basis of global peace and religious tolerance."
              ]
            }
          }
        ]
      }
    }
  ]
}