{
  "hadithId": 836,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/13"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },

  "takhreej": {
    "arabic": "حسن . رواه أبو داود (2083)، والترمذي (1102)، وابن ماجه (1879)، وابن حبان (4074). وقال الترمذي: هذا حديث حسن.",
    "urdu": "یہ حدیث حسن ہے۔ اسے ابو داؤد (2083)، ترمذی (1102) اور ابن ماجہ (1879) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن کہا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan. Recorded by Abu Dawud (2083), At-Tirmidhi (1102), and Ibn Majah (1879). At-Tirmidhi graded it Hasan and it was authenticated by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "أَيُّمَا",
      "english": "Whichever / Any",
      "urdu": "جو کوئی بھی"
    },
    {
      "arabic": "وَلِيِّهَا",
      "english": "Her Guardian",
      "urdu": "اس کا سرپرست / ولی"
    },
    {
      "arabic": "بَاطِلٌ",
      "english": "Void / Invalid",
      "urdu": "کالعدم / باطل"
    },
    {
      "arabic": "اِسْتَحَلَّ",
      "english": "Made lawful",
      "urdu": "حلال کیا"
    },
    {
      "arabic": "اشْتَجَرُوا",
      "english": "They disputed",
      "urdu": "انہوں نے جھگڑا کیا"
    },
    {
      "arabic": "السُّلْطَانُ",
      "english": "The Ruler / Authority",
      "urdu": "حاکمِ وقت / سلطان"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نکاح کے لیے ولی (سرپرست) کی شرط بیان کی گئی ہے، اور ولی کے بغیر نکاح کو باطل قرار دیا گیا ہے، ساتھ ہی مہر کی ادائیگی اور ولی نہ ہونے کی صورت میں حاکم کی ذمہ داری واضح کی گئی ہے۔",
    "english": "This Hadith establishes the necessity of a guardian (Wali) for a valid marriage, declaring marriage without consent void, while addressing the right to Mahr and the role of the state in the absence of a guardian."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب النكاح، رقم الحديث ٢٠٨٣",
      "english": "Sunan Abi Dawud, Book of Marriage, Hadith No. 2083"
    },
    {
      "arabic": "جامع الترمذي، كتاب النكاح، رقم الحديث ١١٠٢",
      "english": "Jami` at-Tirmidhi, Book of Marriage, Hadith No. 1102"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح / حسن",
    "english": "Sahih / Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح میں ولی کی شرط",
        "english": "Requirement of a Guardian in Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولی کے بغیر نکاح کی حیثیت",
              "english": "Status of Marriage Without a Wali"
            },
            "content": {
              "urdu": [
                "جمہور ائمہ کے نزدیک ولی کی اجازت کے بغیر عورت کا نکاح منعقد نہیں ہوتا۔",
                "نبی کریم ﷺ نے اس عمل کو 'باطل' قرار دے کر اس کی سنگینی واضح فرمائی ہے۔",
                "نکاح کے لیے ولی کی شرط عورت کی حفاظت اور خاندانی وقار کے لیے رکھی گئی ہے۔"
              ],
              "english": [
                "According to the majority of scholars, a marriage is invalid without the guardian's consent.",
                "The Prophet (ﷺ) declared such a contract 'void,' emphasizing its legal nullity.",
                "The requirement of a Wali serves to protect the woman and preserve family honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہر کا حق اور شرعی حیثیت",
              "english": "The Right to Mahr and Legal Standing"
            },
            "content": {
              "urdu": [
                "اگر نکاح باطل ہو مگر مباشرت ہو چکی ہو، تو عورت مہر کی حقدار ہے۔",
                "یہ مہر شرمگاہ کے استعمال کے عوض ہے تاکہ عورت کا حق ضائع نہ ہو۔",
                "باطل نکاح کے باوجود مباشرت کی صورت میں مہر کی ادائیگی لازمی قرار دی گئی ہے۔"
              ],
              "english": [
                "If the marriage is void but consummated, the woman is still entitled to her dower (Mahr).",
                "This payment compensates for sexual access so that the woman's rights are not exploited.",
                "Even in a void contract, the act of cohabitation necessitates the financial settlement."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اختلاف اور حاکم کا کردار",
        "english": "Disputes and the Role of Authority"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اولیاء کا اختلاف اور حل",
              "english": "Disputes Among Guardians"
            },
            "content": {
              "urdu": [
                "اگر اولیاء کسی رشتہ کے معاملے میں جھگڑا کریں، تو معاملہ قاضی یا حاکم کے پاس جائے گا۔",
                "ولی کا بلاوجہ لڑکی کو نکاح سے روکنا (عضل) شرعی طور پر ناپسندیدہ ہے۔",
                "حاکمِ وقت انصاف کی بنیاد پر فیصلہ کر کے نکاح کی راہ ہموار کرے گا۔"
              ],
              "english": [
                "If guardians conflict over a marriage proposal, the matter is referred to a judge.",
                "Unjustly preventing a woman from marrying (Adhl) is religiously condemned.",
                "The ruler or judge will facilitate the marriage based on justice and social welfare."
              ]
            }
          },
          {
            "title": {
              "urdu": "جس کا کوئی ولی نہ ہو",
              "english": "For Those Without a Guardian"
            },
            "content": {
              "urdu": [
                "ایسی خواتین جن کا کوئی قریبی رشتہ دار یا ولی نہ ہو، حکومت ان کی سرپرست ہے۔",
                "اسلامی ریاست کی ذمہ داری ہے کہ وہ لاوارث خواتین کے حقوق کا تحفظ کرے۔",
                "سلطان یا قاضی ایسی صورت میں ولی بن کر نکاح کے فرائض سرانجام دیتا ہے۔"
              ],
              "english": [
                "For women with no male relatives, the government acts as their ultimate guardian.",
                "It is the duty of the Islamic state to protect the rights of women without kin.",
                "The ruler or judge assumes the role of the Wali to finalize the marriage contract."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خاندانی نظام کا تحفظ",
        "english": "Protection of the Family System"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی فوائد",
              "english": "Social Benefits"
            },
            "content": {
              "urdu": [
                "ولی کی موجودگی سے نکاح میں پختگی اور سماجی منظوری حاصل ہوتی ہے۔",
                "یہ طریقہ کار خفیہ شادیوں اور اس سے پیدا ہونے والے فتنوں کا سدِ باب کرتا ہے۔",
                "خاندانوں کے مابین تعلقات میں مضبوطی اور شفافیت پیدا ہوتی ہے۔"
              ],
              "english": [
                "The presence of a Wali ensures stability and social acceptance of the marriage.",
                "This mechanism prevents secret marriages and the resulting social discord.",
                "It fosters stronger and more transparent relationships between families."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کا احترام اور تحفظ",
              "english": "Respect and Protection of Women"
            },
            "content": {
              "urdu": [
                "ولی کی شرط عورت کو تنہا چھوڑنے کے بجائے اسے مردوں کی سرپرستی فراہم کرتی ہے۔",
                "یہ اسے دھوکہ دہی اور غیر مستحکم رشتوں سے بچانے کا ایک حفاظتی حصار ہے۔",
                "اسلام عورت کو ایک باعزت طریقے سے نئے گھر میں منتقل کرنے کا حامی ہے۔"
              ],
              "english": [
                "The Wali requirement provides women with male support rather than leaving them isolated.",
                "It acts as a shield against deception and unstable marital commitments.",
                "Islam supports the honorable transition of a woman into her new household."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمتیں",
        "english": "Jurisprudential Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باقاعدہ قانونی معاہدہ",
              "english": "Formal Legal Contract"
            },
            "content": {
              "urdu": [
                "نکاح محض جذباتی تعلق نہیں بلکہ ایک سنجیدہ قانونی اور مذہبی معاہدہ ہے۔",
                "اس معاہدے میں ولی کا ہونا گواہی اور توثیق کا درجہ رکھتا ہے۔",
                "شریعت نے نکاح کے عمل کو ایک مکمل ضابطے کے تحت رکھا ہے۔"
              ],
              "english": [
                "Marriage is not just an emotional bond but a serious legal and religious contract.",
                "In this contract, the Wali represents a form of testimony and validation.",
                "Shari'ah has placed the process of marriage under a complete regulatory framework."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان اور عمل کا تعلق",
              "english": "Connection Between Faith and Action"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ کی اطاعت ہی ایمان کا تقاضا ہے، چاہے وہ نکاح کے احکامات ہوں۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی زندگی کے اہم فیصلے سنت کے مطابق کریں۔",
                "حلال و حرام کی تمیز ہی اسلامی معاشرے کی بنیاد ہے۔"
              ],
              "english": [
                "Obedience to the Prophet (ﷺ) is a requirement of faith, including marriage laws.",
                "Muslims must ensure their major life decisions align with the Sunnah.",
                "The distinction between Halal and Haram is the foundation of Islamic society."
              ]
            }
          }
        ]
      }
    }
  ]
}