{
  "hadithId": 326,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/186"],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب الصلاة - باب الإمامة",
    "babId": 20
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (4302)‏، وأبو داود (585)، والنسائي (2/80‏-81).‏",
    "urdu": "صحیح۔ اسے امام بخاری نے (4302)، ابوداؤد نے (585) اور نسائی نے (2/80) میں روایت کیا ہے۔",
    "english": "Sahih. Narrated by al-Bukhari (4302), Abu Dawud (585), and an-Nasa'i (2/80-81)."
  },
  "importantWords": [
    {
      "arabic": "أَكْثَرُكُمْ قُرْآنًا",
      "english": "The one among you who knows the most Qur'an",
      "urdu": "جو تم میں قرآن کا سب سے زیادہ حافظ ہو"
    },
    {
      "arabic": "فَقَدَّمُونِي",
      "english": "So they put me forward",
      "urdu": "پس انہوں نے مجھے آگے کر دیا (امام بنا دیا)"
    },
    {
      "arabic": "سِتٍّ أَوْ سَبْعِ سِنِينَ",
      "english": "Six or seven years",
      "urdu": "چھ یا سات سال"
    }
  ],
  "summary": {
    "urdu": "نماز کی امامت کے لیے سب سے پہلا استحقاق اس شخص کا ہے جو قرآن کریم کا سب سے زیادہ علم اور حفظ رکھتا ہو۔ اس حدیث سے یہ بھی ثابت ہوتا ہے کہ سمجھدار بچہ (ممیز) فرض نمازوں کی امامت کروا سکتا ہے۔",
    "english": "The first priority for leading the prayer is the one who has the most knowledge and memorization of the Qur'an. This Hadith also indicates that a discerning child can lead the obligatory prayers."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب المغازي، رقم 4302",
      "english": "Sahih al-Bukhari, Book of Military Expeditions, No. 4302"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن سلمة",
        "english": "Amr bin Salamah"
      },
      "slug": "amr-bin-salamah"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "امامت کا معیار",
        "english": "Criteria for Leadership in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن کا علم اور حفظ",
              "english": "Knowledge and Memorization of Qur'an"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے امامت کے لیے سب سے پہلا معیار 'اکثرھم قرآنا' (جو قرآن زیادہ جانتا ہو) مقرر فرمایا۔",
                "اس سے مراد وہ شخص ہے جسے قرآن زیادہ حفظ ہو اور وہ اس کے احکام سے واقف ہو۔",
                "اگر ایک سے زیادہ افراد حفظ میں برابر ہوں تو پھر سنت کے زیادہ جاننے والے کو ترجیح دی جائے گی۔"
              ],
              "english": [
                "The Prophet (ﷺ) set 'the one who knows the most Qur'an' as the primary criterion for leading prayer.",
                "This refers to the person who has memorized more and understands its rulings.",
                "If multiple people are equal in memorization, then the one with more knowledge of the Sunnah is preferred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نابالغ بچے کی امامت",
        "english": "Imamate of a Minor Child"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممیز بچے کی امامت کا جواز",
              "english": "Permissibility for a Discerning Child"
            },
            "content": {
              "urdu": [
                "سیدنا عمرو بن سلمہ رضی اللہ عنہ نے 6 یا 7 سال کی عمر میں امامت کروائی کیونکہ وہ سب سے زیادہ صاحبِ قرآن تھے۔",
                "امام شافعیؒ اور اکثر محدثین کے نزدیک اگر بچہ سمجھدار (ممیز) ہو اور نماز کے ارکان جانتا ہو تو اس کی امامت جائز ہے۔",
                "اس واقعے کی خبر نبی کریم ﷺ تک پہنچی اور آپ ﷺ نے اس پر اعتراض نہیں فرمایا، جو اس کے جواز کی دلیل ہے۔"
              ],
              "english": [
                "Amr bin Salamah (RA) led the prayer at the age of 6 or 7 because he had the most knowledge of the Qur'an.",
                "According to Imam Shafi'i and many scholars of Hadith, if a child is discerning and knows the pillars of prayer, his leading is valid.",
                "The news of this incident reached the Prophet (ﷺ) and he did not object, which serves as evidence for its permissibility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قوم کی ذمہ داری",
        "english": "Responsibility of the Community"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ علم کی قدر",
              "english": "Valuing People of Knowledge"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے ایک چھوٹے بچے کو محض اس کے علم کی وجہ سے اپنا امام تسلیم کیا، یہ علم کی عظمت کی دلیل ہے۔",
                "اسلام میں خاندانی وجاہت یا عمر کے مقابلے میں تقویٰ اور دینی علم کو برتری حاصل ہے۔",
                "نماز کے وقت اذان دینا اور موزوں امام کا انتخاب کرنا باجماعت نماز کے اہم آداب میں سے ہے۔"
              ],
              "english": [
                "The companions accepted a young child as their Imam solely because of his knowledge, proving the greatness of knowledge.",
                "In Islam, piety and religious knowledge take precedence over family status or age.",
                "Calling the Adhan and selecting a suitable Imam are important etiquettes of congregational prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}