{
  "hadithId": 331,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["bukhari:726", "muslim:763"],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب الأذان",
    "babId": 20
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (726)، ومسلم (763). وفي رواية للبخاري: 'فأخذ بأذني'.",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (726) اور امام مسلم (763) نے روایت کیا ہے۔ بخاری کی ایک روایت میں 'سر پکڑنے' کی جگہ 'کان پکڑنے' کے الفاظ بھی آئے ہیں۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (726) and Muslim (763). In another version by Al-Bukhari, it is mentioned that he (ﷺ) took hold of his ear."
  },
  "importantWords": [
    {
      "arabic": "يَسَارِهِ",
      "english": "His left side",
      "urdu": "آپ ﷺ کی بائیں جانب"
    },
    {
      "arabic": "يَمِينِهِ",
      "english": "His right side",
      "urdu": "آپ ﷺ کی دائیں جانب"
    },
    {
      "arabic": "وَرَائِي",
      "english": "Behind me",
      "urdu": "میرے پیچھے سے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ اگر امام کے ساتھ صرف ایک مقتدی ہو، تو اسے امام کی دائیں جانب کھڑا ہونا چاہیے، اور غلطی کی صورت میں امام مقتدی کی جگہ درست کر سکتا ہے۔",
    "english": "This Hadith clarifies that if there is only one follower with the Imam, he should stand on the Imam's right side. It also shows that the Imam can correct the follower's position during prayer."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (726)",
      "english": "Sahih al-Bukhari (726)"
    },
    {
      "arabic": "صحيح مسلم (763)",
      "english": "Sahih Muslim (763)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مقتدی کے کھڑے ہونے کی جگہ",
        "english": "Position of the Follower"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اکیلا مقتدی کہاں کھڑا ہو؟",
              "english": "Where should a single follower stand?"
            },
            "content": {
              "urdu": [
                "سنت نبوی ﷺ کے مطابق اگر امام کے ساتھ صرف ایک مرد مقتدی ہو، تو اسے امام کی دائیں جانب کھڑا ہونا چاہیے۔",
                "بائیں جانب کھڑا ہونا سنت کے خلاف ہے، جیسا کہ ابن عباس رضی اللہ عنہما کی پوزیشن کو آپ ﷺ نے تبدیل فرمایا۔",
                "اکیلا مقتدی امام کے پیچھے کھڑا نہیں ہوگا بلکہ برابر میں دائیں طرف کھڑا ہوگا۔"
              ],
              "english": [
                "According to the Sunnah, if there is only one male follower, he must stand on the right side of the Imam.",
                "Standing on the left side is contrary to the Sunnah, which is why the Prophet (ﷺ) moved Ibn Abbas.",
                "A single follower should not stand behind the Imam but beside him on the right."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دورانِ نماز حرکت اور اصلاح",
        "english": "Movement and Correction during Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معمولی حرکت کی اجازت",
              "english": "Permission for minor movement"
            },
            "content": {
              "urdu": [
                "نماز کی مصلحت اور درستی کے لیے دورانِ نماز معمولی حرکت کرنے سے نماز باطل نہیں ہوتی۔",
                "امام مقتدی کی غلطی کو ہاتھ کے اشارے یا اسے پکڑ کر درست کر سکتا ہے۔",
                "نبی ﷺ نے ابن عباس کو پیچھے سے گھما کر دائیں طرف کیا، جس سے معلوم ہوا کہ ایسی حرکت جائز ہے۔"
              ],
              "english": [
                "Minor movements intended to correct the prayer or align rows do not invalidate the Salah.",
                "The Imam can correct the follower's mistake by gesture or physical movement.",
                "The Prophet (ﷺ) moved Ibn Abbas from behind him to the right, showing such actions are permissible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بچوں کی امامت اور تربیت",
        "english": "Leading Children and Education"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچوں کو نماز سکھانا",
              "english": "Teaching children Salah"
            },
            "content": {
              "urdu": [
                "ابن عباس رضی اللہ عنہما اس وقت کم عمر تھے، اس واقعے سے بچوں کو باجماعت نماز میں شامل کرنے کی ترغیب ملتی ہے۔",
                "بڑوں کو چاہیے کہ وہ بچوں کو پیار اور شفقت سے نماز کے آداب سکھائیں، جیسے آپ ﷺ نے سر پکڑ کر رہنمائی فرمائی۔",
                "یہ واقعہ اس بات کی بھی دلیل ہے کہ بچہ بالغ امام کے ساتھ صف میں کھڑا ہو سکتا ہے۔"
              ],
              "english": [
                "Ibn Abbas was young at the time; this event encourages involving children in congregational prayer.",
                "Adults should teach children the etiquettes of prayer with kindness, just as the Prophet (ﷺ) guided him.",
                "This also proves that a child can stand in the row with an adult Imam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Adherence to Sunnah"
            },
            "content": {
              "urdu": [
                "ہمیں نماز کے ان باریک آداب کو سیکھنا چاہیے تاکہ ہماری عبادات سنت کے مطابق ہوں۔",
                "اگر ہم کسی کو غلطی کرتے دیکھیں تو حکمت اور نرمی سے اس کی اصلاح کریں۔",
                "نفل نمازوں میں بچوں کو ساتھ بٹھانا یا کھڑا کرنا ان کی دینی تربیت کے لیے بہترین ہے۔"
              ],
              "english": [
                "We should learn the fine details of prayer etiquettes to ensure our worship aligns with the Sunnah.",
                "If we see someone making a mistake, we should correct them with wisdom and gentleness.",
                "Involving children in voluntary (Nafl) prayers is excellent for their religious upbringing."
              ]
            }
          }
        ]
      }
    }
  ]
}