{
  "hadithId": 1168,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/48"],
    "kitabId": 12,
    "inKitabBab": 4,
    "arabicBook": "كتاب العقيقة",
    "babId": 95
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (2841)، وابن الجارود (911)، وابن خزيمة، وابن حبان (1061). وصححه الأئمة المذكورون.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (2841)، ابن الجارود اور ابن حبان نے روایت کیا ہے۔ کثرتِ طرق کی وجہ سے اس کی اصل ثابت ہے۔",
    "english": "Sahih. Reported by Abu Dawud (2841), Ibn al-Jarud (911), and Ibn Hibban (1061). The multiple chains of narration strengthen its authenticity."
  },
  "importantWords": [
    {
      "arabic": "عَقَّ",
      "english": "Offered Aqiqa",
      "urdu": "عقیقہ کیا"
    },
    {
      "arabic": "كَبْشًا",
      "english": "Ram",
      "urdu": "مینڈھا"
    },
    {
      "arabic": "رَجَّحَ",
      "english": "Preferred",
      "urdu": "ترجیح دی"
    },
    {
      "arabic": "إِرْسَالَهُ",
      "english": "Being Mursal",
      "urdu": "اس کا مرسل ہونا"
    },
    {
      "arabic": "نَحْوَهُ",
      "english": "Similar to it",
      "urdu": "اسی طرح"
    }
  ],
  "summary": {
    "urdu": "رسول اللہ ﷺ نے اپنے نواسوں حسن و حسین کے لیے عقیقہ کیا، جس سے عقیقہ کی سنت اور لڑکوں کے لیے قربانی کا ثبوت ملتا ہے۔",
    "english": "The Messenger of Allah (ﷺ) performed Aqiqa for his grandsons, proving it as a Sunnah and establishing the practice for newborn boys."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2841)",
      "english": "Sunan Abi Dawud (2841)"
    },
    {
      "arabic": "صحيح ابن حبان (1061)",
      "english": "Sahih Ibn Hibban (1061)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R2rXGvR_2E8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عقیقہ کی شرعی حیثیت",
        "english": "Legal Status of Aqiqa"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ مؤکدہ",
              "english": "Emphasized Sunnah"
            },
            "content": {
              "urdu": [
                "عقیقہ کرنا رسول اللہ ﷺ کی مستقل اور پسندیدہ سنت ہے۔",
                "نبی ﷺ نے خود اپنے نواسوں کا عقیقہ کر کے امت کو ترغیب دی۔",
                "یہ بچہ کی پیدائش پر اللہ کا شکر ادا کرنے کا بہترین طریقہ ہے۔"
              ],
              "english": [
                "Performing Aqiqa is a continuous and beloved Sunnah of the Prophet (ﷺ).",
                "The Prophet (ﷺ) encouraged the Ummah by performing it for his grandsons.",
                "It is the best way to thank Allah for the blessing of a newborn child."
              ]
            }
          },
          {
            "title": {
              "urdu": "جانوروں کی تعداد",
              "english": "Number of Animals"
            },
            "content": {
              "urdu": [
                "اس روایت میں لڑکے کے لیے ایک ایک مینڈھے کا ذکر ہے۔",
                "دیگر روایات میں لڑکے کے لیے دو اور لڑکی کے لیے ایک کا ذکر ہے۔",
                "ایک جانور سے بھی عقیقہ کی اصل سنت ادا ہو جاتی ہے۔"
              ],
              "english": [
                "This narration mentions one ram each for the newborn boys.",
                "Other narrations mention two animals for a boy and one for a girl.",
                "The basic Sunnah of Aqiqa is fulfilled even with a single animal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقیقہ کے فوائد و ثمرات",
        "english": "Benefits of Aqiqa"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے کا تحفظ",
              "english": "Protection of the Child"
            },
            "content": {
              "urdu": [
                "عقیقہ بچے کی سلامتی اور آفات سے بچاؤ کا ذریعہ بنتا ہے۔",
                "حدیث کے مطابق ہر بچہ اپنے عقیقہ کے عوض رہن ہوتا ہے۔",
                "یہ قربانی بچے کی طرف سے فدیہ اور شکرانہ تصور کی جاتی ہے۔"
              ],
              "english": [
                "Aqiqa serves as a means of safety and protection for the child.",
                "According to Hadith, every child is pledged (Rahn) by his Aqiqa.",
                "This sacrifice is considered a ransom and gratitude on behalf of the child."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی خوشی",
              "english": "Social Joy"
            },
            "content": {
              "urdu": [
                "عقیقہ کے ذریعے رشتہ داروں اور غریبوں کو کھانا کھلایا جاتا ہے۔",
                "اس سے خاندان میں محبت اور معاشرتی تعلقات مضبوط ہوتے ہیں۔",
                "اسلامی معاشرت میں خوشی کے مواقع پر سخاوت کا درس ملتا ہے۔"
              ],
              "english": [
                "Through Aqiqa, food is shared with relatives and the needy.",
                "It strengthens love within the family and solidifies social ties.",
                "It teaches generosity during happy occasions in an Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقیقہ کا وقت اور طریقہ",
        "english": "Timing and Method of Aqiqa"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ساتواں دن",
              "english": "The Seventh Day"
            },
            "content": {
              "urdu": [
                "عقیقہ کے لیے سب سے افضل وقت پیدائش کا ساتواں دن ہے۔",
                "اگر ساتویں دن ممکن نہ ہو تو چودھویں یا اکیسویں دن کیا جائے۔",
                "وقت کی پابندی سنت کی پیروی کا حصہ اور باعثِ برکت ہے۔"
              ],
              "english": [
                "The most preferred time for Aqiqa is the seventh day after birth.",
                "If not possible on the 7th, it may be done on the 14th or 21st day.",
                "Adhering to the timing is part of following Sunnah and brings blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر مسنون اعمال",
              "english": "Other Sunnah Acts"
            },
            "content": {
              "urdu": [
                "عقیقہ کے دن بچے کے سر کے بال مونڈنا بھی سنت ہے۔",
                "بالوں کے وزن کے برابر چاندی صدقہ کرنا مستحب ہے۔",
                "اسی دن بچے کا اچھا اسلامی نام رکھنا بھی پسندیدہ عمل ہے۔"
              ],
              "english": [
                "Shaving the newborn's head on the day of Aqiqa is also Sunnah.",
                "It is recommended to give charity in silver equal to the hair's weight.",
                "Giving the child a good Islamic name on this day is also preferred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ابحاث اور ترجیحات",
        "english": "Juristic Discussions and Preferences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحتِ حدیث کی بحث",
              "english": "Discussion on Authenticity"
            },
            "content": {
              "urdu": [
                "ائمہ نے اس حدیث کے موصول اور مرسل ہونے پر کلام کیا ہے۔",
                "جمہور محدثین نے اسے صحیح اور قابلِ عمل تسلیم کیا ہے۔",
                "ابن حبان کی تائیدی روایت اس کے ثبوت کو مزید پختہ کرتی ہے۔"
              ],
              "english": [
                "Imams discussed whether this Hadith is connected (Mawsul) or disconnected.",
                "The majority of Hadith scholars accepted it as Sahih and actionable.",
                "Ibn Hibban's corroborating narration further solidifies its evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "والدین کی ذمہ داری",
              "english": "Responsibility of Parents"
            },
            "content": {
              "urdu": [
                "عقیقہ کرنا بنیادی طور پر والد یا سرپرست کی ذمہ داری ہے۔",
                "اگر استطاعت نہ ہو تو عقیقہ ساقط ہو جاتا ہے، تنگی لازم نہیں۔",
                "دین میں آسانی ہے، لیکن استطاعت پر سنت کو نہیں چھوڑنا چاہیے۔"
              ],
              "english": [
                "Performing Aqiqa is primarily the responsibility of the father or guardian.",
                "If there is no financial capacity, the obligation is lifted without hardship.",
                "There is ease in religion, but Sunnah should not be ignored if capable."
              ]
            }
          }
        ]
      }
    }
  ]
}