{
  "hadithId": 955,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1096"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مالك في الموطأ (2/576)، والبيهقي في السنن الكبرى (7/415)، والشافعي في المسند (1/256). وهو قول عائشة وابن عمر وزيد بن ثابت رضي الله عنهم.",
    "urdu": "صحیح۔ اسے امام مالک نے موطأ (2/576) میں روایت کیا ہے۔ یہ روایت سیدہ عائشہ رضی اللہ عنہا کا قول (موقوف) ہے اور یہی موقف حضرت ابن عمر اور زید بن ثابت رضی اللہ عنہم کا بھی ہے کہ عدت کے تین قرء سے مراد حیض نہیں بلکہ طہر ہیں۔",
    "english": "Sahih. Reported by Malik in Al-Muwatta (2/576), Al-Bayhaqi (7/415), and Ash-Shafi'i. This is the established view of Aisha, Ibn 'Umar, and Zaid bin Thabit (RA) regarding the interpretation of 'Quru' in the Quran."
  },
  "importantWords": [
    {
      "arabic": "أَقْرَاءُ",
      "english": "Periods / Quru",
      "urdu": "قرء کی جمع / مدتیں"
    },
    {
      "arabic": "أَطْهَارُ",
      "english": "Purification / Purity",
      "urdu": "پاکی کی حالت"
    },
    {
      "arabic": "إِنَّمَا",
      "english": "Only / Indeed",
      "urdu": "صرف / ہی"
    },
    {
      "arabic": "قِصَّةٍ",
      "english": "Narrative / Story",
      "urdu": "واقعہ / قصہ"
    },
    {
      "arabic": "بِسَنَدٍ صَحِيحٍ",
      "english": "With a Sahih chain",
      "urdu": "صحیح سند کے ساتھ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں لفظ 'قرء' کی تشریح بیان کی گئی ہے۔ سیدہ عائشہ کے نزدیک طلاق یافتہ عورت کی عدت حیض کے بجائے طہر (پاکی کے ایام) سے شمار کی جائے گی۔",
    "english": "This narration clarifies the term 'Quru'. According to Aisha (RA), the waiting period (Iddah) for a divorced woman is measured by periods of purity rather than menstruation."
  },
  "references": [
    {
      "arabic": "موطأ الإمام مالك (2/576)",
      "english": "Muwatta Imam Malik (2/576)"
    },
    {
      "arabic": "سنن النسائي الكبرى (3511)",
      "english": "Sunan an-Nasa'i al-Kubra (3511)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح موقوف",
    "english": "Sahih Mauquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لفظ 'قرء' کی لغوی اور شرعی بحث",
        "english": "Linguistic and Shariah Debate on 'Quru'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لغوی وسعت",
              "english": "Linguistic Scope"
            },
            "content": {
              "urdu": [
                "عربی زبان میں 'قرء' ایک ایسا لفظ ہے جس کے دو متضاد معنی ہیں: حیض اور طہر۔",
                "سیدہ عائشہ رضی اللہ عنہا نے اپنی فصاحت اور علم کی بنیاد پر اسے طہر قرار دیا۔",
                "لغت کے ماہرین کے مطابق اس کا تعلق کسی چیز کے جمع ہونے یا لوٹنے سے ہے۔"
              ],
              "english": [
                "In Arabic, 'Quru' is a contranym (Adhdad) meaning both menstruation and purity.",
                "Aisha (RA), based on her linguistic expertise and knowledge, defined it as purity.",
                "Linguists state the word relates to the accumulation or the return of a state."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدہ عائشہ کا استدلال",
              "english": "Aisha's (RA) Reasoning"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ فرماتی تھیں کہ اگر عورت کو طہر میں طلاق دی جائے تو وہ پہلا قرء شمار ہوگا۔",
                "ان کے نزدیک عدت کی گنتی حیض سے شروع ہونے کے بجائے طہر سے ہونی چاہیے۔",
                "یہ موقف حجازی فقہاء اور امام مالک و امام شافعی کا بنیادی ستون ہے۔"
              ],
              "english": [
                "Aisha (RA) held that if a woman is divorced during purity, that period counts as the first Quru.",
                "According to her, the count of Iddah should start from the purity state, not menses.",
                "This position is a cornerstone for Hijazi jurists like Imam Malik and Imam Shafi'i."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کا اختلاف",
        "english": "Differences Between Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شوافع اور مالکیہ کی رائے",
              "english": "Shafi'i and Maliki View"
            },
            "content": {
              "urdu": [
                "ان ائمہ کے نزدیک عدت کے تین 'قروء' سے مراد تین طہر (پاکی کے ادوار) ہیں۔",
                "جیسے ہی تیسرا حیض شروع ہوتا ہے، ان کے نزدیک عدت مکمل ہو جاتی ہے۔",
                "وہ سیدہ عائشہ اور حضرت زید بن ثابت رضی اللہ عنہما کے اقوال کو دلیل بناتے ہیں۔"
              ],
              "english": [
                "These Imams believe 'three Quru' refers to three periods of purity (Athar).",
                "As soon as the third menstruation begins, they consider the Iddah complete.",
                "They rely on the narrations of Aisha and Zaid bin Thabit (RA) as evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "احناف اور حنابلہ کا موقف",
              "english": "Hanafi and Hanbali Position"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ اور امام احمد کے نزدیک 'قرء' سے مراد حیض (ماہواری) ہے۔",
                "وہ دلیل دیتے ہیں کہ عدت کا مقصد رحم کی صفائی کا یقین ہے جو حیض سے ہوتا ہے۔",
                "ان کے نزدیک عدت اس وقت ختم ہوگی جب تیسرا حیض مکمل ہو جائے۔"
              ],
              "english": [
                "Imams Abu Hanifa and Ahmad interpret 'Quru' as menstruation (Hayd).",
                "They argue the purpose of Iddah is to ensure the womb is clear, which menses proves.",
                "For them, the Iddah concludes only when the third menstrual cycle is finished."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدت کے احکام میں خواتین کا مقام",
        "english": "Role of Women in Iddah Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امہات المومنین کی فقاہت",
              "english": "Jurisprudence of the Mothers of Believers"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ نے عدت جیسے نازک مسائل کی خود وضاحت فرمائی تاکہ امت میں ابہام نہ رہے۔",
                "خواتین کے مخصوص مسائل میں ان کا قول سند اور حجت کی حیثیت رکھتا ہے۔",
                "نبی ﷺ کے گھرانے سے حاصل ہونے والا علم ہی شرعی باریکیوں کو سمجھنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Aisha (RA) clarified delicate issues like Iddah to remove ambiguity for the Ummah.",
                "Her rulings regarding women's specific issues are authoritative and foundational.",
                "Knowledge from the Prophetic household is the key to understanding legal nuances."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدالت اور گواہی",
              "english": "Justice and Testimony"
            },
            "content": {
              "urdu": [
                "عدت کی تکمیل کا معاملہ عورت کی دیانت اور اس کی گواہی پر منحصر ہوتا ہے۔",
                "اسلام نے عورت کے اس بیان کو معتبر مانا ہے کہ اس کی عدت مکمل ہو چکی ہے۔",
                "یہ حکم عورت کے وقار اور اس پر شریعت کے بھروسے کی علامت ہے۔"
              ],
              "english": [
                "The completion of Iddah depends on the woman's honesty and her testimony.",
                "Islam considers a woman's statement that her Iddah is over as legally valid.",
                "This ruling signifies the dignity of women and the trust Shariah places in them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور احتیاط",
        "english": "Practical Lesson and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کے تعین میں اہمیت",
              "english": "Importance in Timing"
            },
            "content": {
              "urdu": [
                "عدت کا صحیح حساب رکھنا دوسرے نکاح کی حلالیت کے لیے نہایت ضروری ہے۔",
                "اگر عدت کے شمار میں غلطی ہو جائے تو نسب اور نکاح میں پیچیدگی پیدا ہوتی ہے۔",
                "میاں بیوی کو علیحدگی کے وقت تاریخوں اور ادوار کا محتاط ریکارڈ رکھنا چاہیے۔"
              ],
              "english": [
                "Accurate calculation of Iddah is vital for the legality of a subsequent marriage.",
                "Errors in counting Iddah lead to serious complications in lineage and marriage.",
                "Couples should maintain a careful record of dates and periods during separation."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم سیکھنے کی ترغیب",
              "english": "Encouragement to Seek Knowledge"
            },
            "content": {
              "urdu": [
                "نکاح و طلاق کے مسائل سیکھنا ہر مسلمان مرد و عورت پر انفرادی طور پر لازم ہے۔",
                "سیدہ عائشہ کی طرح تحقیق اور دلائل کے ساتھ بات کرنا ایک مومن کا شیوہ ہے۔",
                "بغیر علم کے فتوے دینا یا عمل کرنا انسان کو گناہ میں مبتلا کر سکتا ہے۔"
              ],
              "english": [
                "Learning the rulings of marriage and divorce is an individual duty for every Muslim.",
                "Speaking with research and evidence, like Aisha (RA), is the trait of a believer.",
                "Issuing rulings or acting without knowledge can lead a person into grave sin."
              ]
            }
          }
        ]
      }
    }
  ]
}