{
  "hadithId": 1065,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/10/94"],
    "kitabId": 10,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحدود",
    "babId": 87
  },

  "takhreej": {
    "arabic": "صحيح. رواه أحمد (16906)، وأبو داود (4482)، والترمذي (1444)، والنسائي في الكبرى (5240)، وابن ماجه (2573). والقتل منسوخ عند جماهير العلماء.",
    "urdu": "صحیح۔ اسے احمد (16906)، ابوداؤد (4482)، ترمذی (1444)، نسائی اور ابن ماجہ (2573) نے روایت کیا ہے۔ جمہور علماء کے نزدیک قتل کا حکم منسوخ ہے۔",
    "english": "Sahih. Reported by Ahmad (16906), Abu Dawud (4482), At-Tirmidhi (1444), An-Nasa'i in al-Kubra (5240), and Ibn Majah (2573). The ruling of execution is considered abrogated by the majority of scholars."
  },
  "importantWords": [
    {
      "arabic": "شَارِبِ",
      "english": "Drinker",
      "urdu": "پینے والا"
    },
    {
      "arabic": "فَاجْلِدُوهُ",
      "english": "Flog him",
      "urdu": "اسے کوڑے مارو"
    },
    {
      "arabic": "الثَّالِثَةِ",
      "english": "Third",
      "urdu": "تیسری"
    },
    {
      "arabic": "الرَّابِعَةِ",
      "english": "Fourth",
      "urdu": "چوتھی"
    },
    {
      "arabic": "عُنُقَهُ",
      "english": "His neck",
      "urdu": "اس کی گردن"
    },
    {
      "arabic": "مَنْسُوخٌ",
      "english": "Abrogated",
      "urdu": "منسوخ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں شراب نوشی پر ابتدائی طور پر کوڑوں کی سزا اور بار بار جرم دہرانے پر قتل کا ذکر ہے، مگر محدثین کے مطابق قتل کا حکم بعد میں منسوخ کر دیا گیا تھا۔",
    "english": "This Hadith mentions flogging for drinking alcohol and execution for the fourth offense, but scholars clarify that the execution part was later abrogated."
  },
  "references": [
    {
      "arabic": "رواه أحمد (16906)",
      "english": "Reported by Ahmad (16906)"
    },
    {
      "arabic": "رواه الترمذي (1444)",
      "english": "Reported by At-Tirmidhi (1444)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاوية بن أبي سفيان",
        "english": "Mu'awiyah bin Abi Sufyan"
      },
      "slug": "muawiyah-bin-abi-sufyan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=DInN8XoG08U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شراب نوشی کی شرعی سزا",
        "english": "Legal Penalty for Drinking"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کوڑوں کی سزا",
              "english": "Punishment of Flogging"
            },
            "content": {
              "urdu": [
                "شراب نوشی اسلام میں ایک سنگین جرم اور ام الخبائث قرار دی گئی ہے۔",
                "پہلی تین مرتبہ شراب پینے پر مجرم کو کوڑے مارنے کی سزا مقرر ہے۔",
                "اس سزا کا مقصد مجرم کی تنبیہ اور معاشرے کو اس برائی سے پاک رکھنا ہے۔"
              ],
              "english": [
                "Drinking alcohol is a serious crime in Islam and called the 'mother of evils'.",
                "For the first three offenses, the offender is prescribed the punishment of flogging.",
                "The purpose of this penalty is to warn the offender and protect society from evil."
              ]
            }
          },
          {
            "title": {
              "urdu": "جرم کی تکرار",
              "english": "Repetition of the Crime"
            },
            "content": {
              "urdu": [
                "بار بار شراب پینا اس بات کی دلیل ہے کہ مجرم قانون کا احترام نہیں کر رہا۔",
                "اسلامی نظامِ عدل میں بار بار جرم کرنے والے کے لیے سخت رویہ اپنایا جاتا ہے۔",
                "سزا کی تکرار مجرم کو اس کی اصلاح اور توبہ کی طرف مائل کرنے کے لیے ہے۔"
              ],
              "english": [
                "Repeated drinking indicates that the offender does not respect the law.",
                "The Islamic justice system adopts a stricter stance towards habitual offenders.",
                "Repeating the penalty is meant to incline the offender towards reform and repentance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قتل کے حکم کی حقیقت",
        "english": "Reality of the Execution Order"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمِ قتل کا نسخ",
              "english": "Abrogation of Execution"
            },
            "content": {
              "urdu": [
                "ابتدائے اسلام میں شراب کی عادت چھڑوانے کے لیے سخت ترین حکم دیا گیا تھا۔",
                "بعد ازاں رسول اللہ ﷺ نے قتل کی اس سزا کو منسوخ فرما دیا تھا۔",
                "جمہور فقہاء کے نزدیک اب چوتھی بار بھی صرف کوڑے ہی مارے جائیں گے۔"
              ],
              "english": [
                "In the early days of Islam, a severe ruling was given to break the habit of drinking.",
                "Later, the Messenger of Allah (ﷺ) abrogated this specific penalty of execution.",
                "According to most jurists, even the fourth offense now only results in flogging."
              ]
            }
          },
          {
            "title": {
              "urdu": "محدثین کی تحقیق",
              "english": "Research of Hadith Scholars"
            },
            "content": {
              "urdu": [
                "امام ترمذی اور امام زہری نے صراحت کی ہے کہ یہ حکم اب باقی نہیں رہا۔",
                "صحابہ کرام کے عمل سے بھی ثابت ہے کہ انہوں نے چوتھی بار پر قتل نہیں کیا۔",
                "شرعی احکام میں نسخ کا علم ہونا صحیح فقہی نتیجے تک پہنچنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "Imam At-Tirmidhi and Az-Zuhri explicitly stated that this ruling is no longer active.",
                "The practice of the Companions also confirms they did not execute for a fourth offense.",
                "Knowledge of abrogation in Sharia is essential to reach correct juristic conclusions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمتیں",
        "english": "Juristic Wisdoms"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعزیری قتل کی بحث",
              "english": "Discretionary Capital Punishment"
            },
            "content": {
              "urdu": [
                "بعض علماء کے نزدیک اگر شرابی معاشرے کے لیے ناسور بن جائے تو حاکم قتل کر سکتا ہے۔",
                "لیکن یہ قتل بطور 'حد' نہیں بلکہ بطور 'تعزیر' اور فساد فی الارض روکنے کے لیے ہوگا۔",
                "زیادہ تر علماء اس رائے سے اختلاف کرتے ہوئے صرف کوڑوں پر اکتفا کرتے ہیں۔"
              ],
              "english": [
                "Some scholars hold that if a drinker becomes a cancer to society, the ruler may execute.",
                "However, this would be a discretionary punishment (Ta'zir), not a fixed 'Hadd'.",
                "Most scholars disagree with this view and limit the punishment to flogging only."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی جان کی حفاظت",
              "english": "Protection of Human Life"
            },
            "content": {
              "urdu": [
                "اسلام کسی بھی انسان کی جان لینے میں انتہائی احتیاط برتنے کا حکم دیتا ہے۔",
                "صرف شراب پینے پر جان لینا اسلامی عدل کے عمومی مزاج کے منافی معلوم ہوتا ہے۔",
                "سزا کا مقصد مجرم کو ختم کرنا نہیں بلکہ اسے ایک اچھا انسان بنانا ہے۔"
              ],
              "english": [
                "Islam commands extreme caution regarding taking any human life.",
                "Taking a life solely for drinking seems contrary to the general spirit of Islamic justice.",
                "The objective of punishment is not to end the criminal but to make them a better person."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصلاحی اور تربیتی سبق",
        "english": "Reformative and Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برائی کا تدریجی خاتمہ",
              "english": "Gradual Elimination of Evil"
            },
            "content": {
              "urdu": [
                "یہ حدیث ظاہر کرتی ہے کہ اسلام نے معاشرتی برائیوں کو ختم کرنے کے لیے مرحلہ وار نظام اپنایا۔",
                "سختی کا مقصد لوگوں کو گناہ کی سنگینی کا احساس دلانا تھا۔",
                "جب معاشرے میں تقویٰ راسخ ہو گیا تو سزاؤں میں نرمی پیدا کی گئی۔"
              ],
              "english": [
                "This Hadith shows that Islam adopted a phased system to eliminate social evils.",
                "The severity was intended to make people realize the gravity of the sin.",
                "Once piety was established in society, the punishments were made more lenient."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم کی اہمیت",
              "english": "Importance of Knowledge"
            },
            "content": {
              "urdu": [
                "بغیر تحقیق کے صرف ایک حدیث کو دیکھ کر فتویٰ جاری کرنا خطرناک ہو سکتا ہے۔",
                "ناسخ اور منسوخ احادیث کا علم ہر طالب علم اور مفتی کے لیے لازمی ہے۔",
                "دین کو سمجھنے کے لیے راسخ فی العلم علماء کی رہنمائی حاصل کرنی چاہیے۔"
              ],
              "english": [
                "Issuing a ruling based on one Hadith without research can be dangerous.",
                "Knowledge of abrogating and abrogated Hadiths is mandatory for every student and Mufti.",
                "To understand religion, one should seek guidance from scholars firmly grounded in knowledge."
              ]
            }
          }
        ]
      }
    }
  ]
}