{
  "hadithId": 932,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/932"],
    "kitabId": 8,
    "inKitabBab": 10,
    "arabicBook": "كتاب الإيلاء والظهار والكفارة",
    "babId": 73
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه الشافعي في المسند (2/42) رقم (139)، والترمذي (1196) واللفظ له، والبيهقي في الكبرى (15383).",
    "urdu": "یہ روایت صحیح ہے۔ اسے امام شافعی نے مسند (139) میں اور امام ترمذی (1196) نے روایت کیا ہے۔ یہ صحابہ کرام کے اجماعی عمل کی عکاسی کرتی ہے۔",
    "english": "Sahih. Reported by Ash-Shafi'i in Al-Musnad (139) and At-Tirmidhi (1186). This reflects the collective practice of the Companions regarding the rules of Ila'."
  },
  "importantWords": [
    {
      "arabic": "أَدْرَكْتُ",
      "english": "I met / I reached",
      "urdu": "میں نے پایا / ملاقات کی"
    },
    {
      "arabic": "بِضْعَةَ عَشَرَ",
      "english": "Between thirteen to nineteen",
      "urdu": "دس سے زائد (تیرہ سے انیس کے درمیان)"
    },
    {
      "arabic": "أَصْحَابِ",
      "english": "Companions",
      "urdu": "صحابہ"
    },
    {
      "arabic": "يَقِفُونَ",
      "english": "They stop / make stand",
      "urdu": "وہ ٹھہراتے تھے / روکتے تھے"
    },
    {
      "arabic": "الْمُؤْلِي",
      "english": "One who takes oath of Ila'",
      "urdu": "ایلاء کرنے والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ ایلاء کی مدت (چار ماہ) گزرنے کے بعد شوہر کو خود بخود طلاق نہیں ہوتی، بلکہ اسے مجبور کیا جاتا ہے کہ وہ یا تو رجوع کرے یا طلاق دے۔",
    "english": "This Hadith proves that after the four-month period of Ila', divorce does not occur automatically; rather, the husband is compelled to either reconcile or divorce."
  },
  "references": [
    {
      "arabic": "رواه الشافعي في المسند (139)",
      "english": "Reported by Ash-Shafi'i in Al-Musnad (139)"
    },
    {
      "arabic": "أخرجه الترمذي (1186)",
      "english": "Reported by At-Tirmidhi (1186)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سليمان بن يسار",
        "english": "Sulaiman bin Yasar"
      },
      "slug": "sulaiman-bin-yasar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایلاء کی مدت اور فیصلہ",
        "english": "Duration of Ila' and Decision"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار ماہ کی مہلت",
              "english": "The Four-Month Respite"
            },
            "content": {
              "urdu": [
                "شریعت نے ایلاء (بیوی سے الگ رہنے کی قسم) کی آخری حد چار ماہ رکھی ہے۔",
                "یہ مدت اس لیے ہے تاکہ عورت پر طویل عرصے تک ظلم نہ کیا جائے۔",
                "چار ماہ گزرنے کے بعد شوہر کو عدالت یا معاشرے کے سامنے جوابدہ ہونا پڑتا ہے۔"
              ],
              "english": [
                "Shariah has set a maximum limit of four months for Ila' (oath of abstinence).",
                "This period exists to prevent prolonged oppression against the wife.",
                "After four months, the husband becomes accountable to the court or society."
              ]
            }
          },
          {
            "title": {
              "urdu": "فیصلہ کن مقام",
              "english": "Point of Decision"
            },
            "content": {
              "urdu": [
                "مدت ختم ہونے پر شوہر کو دو میں سے ایک راستہ اختیار کرنا پڑتا ہے۔",
                "پہلا راستہ یہ ہے کہ وہ رجوع کرے اور ازدواجی تعلقات بحال کرے۔",
                "دوسرا راستہ یہ ہے کہ وہ باقاعدہ طلاق دے کر عورت کو آزاد کر دے۔"
              ],
              "english": [
                "When the period ends, the husband must choose one of two paths.",
                "The first path is to reconcile and restore marital relations.",
                "The second path is to formally divorce and set the woman free."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کرام کا اجماعی عمل",
        "english": "Collective Practice of the Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آثارِ صحابہ کی اہمیت",
              "english": "Significance of Companions' Precedents"
            },
            "content": {
              "urdu": [
                "سلیمان بن یسار نے دس سے زائد صحابہ کا یہ متفقہ عمل نقل کیا ہے۔",
                "صحابہ کا یہ عمل قرآن کی آیت 'للذین یؤلون من نسائہم' کی تفسیر ہے۔",
                "ان کے نزدیک وقت گزرنے پر طلاق خود بخود واقع نہیں ہوتی تھی۔"
              ],
              "english": [
                "Sulaiman bin Yasar reported this unanimous practice from over ten companions.",
                "This practice explains the Quranic verse regarding those who take oaths of Ila'.",
                "In their view, divorce did not occur automatically just by the lapse of time."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف کا قیام",
              "english": "Establishing Justice and Equity"
            },
            "content": {
              "urdu": [
                "صحابہ ایلاء کرنے والے کو 'ٹھہراتے' تھے تاکہ وہ عورت کا حق ادا کرے۔",
                "اس کا مقصد عورت کو معلق (لٹکی ہوئی) حالت سے نجات دلانا تھا۔",
                "یہ طرزِ عمل اسلامی معاشرے میں عورت کے حقوق کے تحفظ کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The companions would 'stop' the husband to ensure he fulfills the wife's rights.",
                "The aim was to rescue the woman from being left in a state of suspense.",
                "This conduct demonstrates the protection of women's rights in Islamic society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات اور ترجیح",
        "english": "Juristic Differences and Preference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف فقہی آراء",
              "english": "Various Juristic Opinions"
            },
            "content": {
              "urdu": [
                "امام شافعی اور امام مالک کے نزدیک مدت کے بعد مطالبہ ضروری ہے۔",
                "امام ابوحنیفہ کے نزدیک چار ماہ گزرتے ہی ایک طلاقِ بائن ہو جاتی ہے۔",
                "صحابہ کا یہ اثر امام شافعی کے موقف کی مضبوط دلیل فراہم کرتا ہے۔"
              ],
              "english": [
                "Imams Shafi'i and Malik hold that a demand is necessary after the period.",
                "Imam Abu Hanifa states that one irrevocable divorce occurs after four months.",
                "This report from the companions provides strong evidence for Shafi'i's view."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقِ زوجیت کی بحالی",
              "english": "Restoration of Marital Rights"
            },
            "content": {
              "urdu": [
                "رجوع کی صورت میں شوہر کو اپنی قسم کا کفارہ ادا کرنا ہوگا۔",
                "اگر وہ رجوع سے انکار کرے تو حاکم اسے طلاق پر مجبور کرے گا۔",
                "یہ نظام خاندان کو ٹوٹنے سے بچانے کی ایک حکیمانہ کوشش ہے۔"
              ],
              "english": [
                "In case of reconciliation, the husband must pay expiation for his oath.",
                "If he refuses to reconcile, the ruler/judge will compel him to divorce.",
                "This system is a wise effort to prevent the family from collapsing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی و معاشرتی اسباق",
        "english": "Educational and Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت پر ظلم کا سدِ باب",
              "english": "Preventing Oppression of Women"
            },
            "content": {
              "urdu": [
                "بیوی کو جنسی اور جذباتی طور پر محروم رکھنا ظلمِ عظیم ہے۔",
                "اسلام نے مرد کی قسم کو عورت کے استحصال کا ذریعہ نہیں بننے دیا۔",
                "معاشرے کو ایسے معاملات میں مداخلت کر کے انصاف دلانا چاہیے۔"
              ],
              "english": [
                "Depriving a wife sexually and emotionally is a great oppression.",
                "Islam did not allow a man's oath to become a tool for exploitation.",
                "Society should intervene in such matters to ensure justice is served."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانون کی بالادستی",
              "english": "Supremacy of the Law"
            },
            "content": {
              "urdu": [
                "گھریلو معاملات بھی شرعی قوانین کے تابع ہونے چاہئیں۔",
                "مومن کو اپنی قسموں اور وعدوں میں حدودِ الہی کا خیال رکھنا چاہیے۔",
                "صحابہ کے نقشِ قدم پر چلنا ہی ہدایت اور کامیابی کا راستہ ہے۔"
              ],
              "english": [
                "Domestic affairs must also be subject to Shariah laws and regulations.",
                "A believer must respect Divine limits in their oaths and promises.",
                "Following the footsteps of the companions is the path to guidance."
              ]
            }
          }
        ]
      }
    }
  ]
}