{
  "hadithId": 924,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/924", "bukhari/5254"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5254) في كتاب الطلاق، باب من طلق وهل يواجه الرجل امرأته بالطلاق.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری نے اپنی صحیح (5254) میں کتاب الطلاق کے تحت روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5254) in the Book of Divorce, regarding confronting the wife with divorce."
  },
  "importantWords": [
    {
      "arabic": "دَنَا",
      "english": "Went close / Approached",
      "urdu": "قریب ہوئے"
    },
    {
      "arabic": "أَعُوذُ",
      "english": "I seek refuge",
      "urdu": "میں پناہ مانگتی ہوں"
    },
    {
      "arabic": "عُذْتِ",
      "english": "You sought refuge",
      "urdu": "تم نے پناہ لی"
    },
    {
      "arabic": "بِعَظِيمٍ",
      "english": "In the Great/Almighty",
      "urdu": "عظیم ہستی کی"
    },
    {
      "arabic": "اِلْحَقِي",
      "english": "Go back / Join",
      "urdu": "جا ملو / چلی جاؤ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی کریم ﷺ کے اخلاقِ عالیہ اور اللہ کے نام کی حرمت کو بیان کیا گیا ہے کہ جب ایک عورت نے آپ ﷺ سے اللہ کی پناہ مانگی تو آپ ﷺ نے فوری اسے علیحدہ کر دیا۔",
    "english": "This Hadith illustrates the noble character of the Prophet (ﷺ) and the sanctity of Allah's name; when a woman sought refuge in Allah from him, he immediately released her."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5254)",
      "english": "Reported by Al-Bukhari (5254)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اللہ کے نام کی تعظیم",
        "english": "Reverence for Allah's Name"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استعاذہ کی لاج",
              "english": "Honoring the Seeking of Refuge"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے اللہ کے نام کی عظمت کا اس قدر لحاظ فرمایا کہ اپنی خواہش قربت چھوڑ دی۔",
                "جب کسی نے اللہ کی پناہ مانگی، تو آپ ﷺ نے اسے سب سے بڑی جائے پناہ قرار دیا۔",
                "یہ عمل سکھاتا ہے کہ مومن کے نزدیک اللہ کا نام ہر رشتے اور تعلق سے مقدم ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) revered Allah's name so much that he abandoned his desire for closeness.",
                "When someone sought refuge in Allah, he acknowledged it as the greatest sanctuary.",
                "This act teaches that for a believer, Allah's name precedes every relationship and tie."
              ]
            }
          },
          {
            "title": {
              "urdu": "عظیم ہستی کی پناہ",
              "english": "Refuge in the Almighty"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا فرمان 'تم نے عظیم کی پناہ لی' ظاہر کرتا ہے کہ اللہ کی پناہ حتمی ہے۔",
                "اس ہستی کی پناہ لینے والے کو کسی انسان کی طرف سے کوئی نقصان نہیں پہنچ سکتا۔",
                "یہ توحید اور اللہ پر کامل بھروسے کی ایک عملی اور بہترین مثال ہے۔"
              ],
              "english": [
                "His statement 'You sought refuge in the Almighty' shows that Allah's protection is final.",
                "One who seeks refuge in Him cannot be harmed or forced by any human being.",
                "This is a practical and excellent example of Tawheed and complete trust in Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا بے مثال اخلاق",
        "english": "Unmatched Character of the Prophet (ﷺ)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبردستی سے گریز",
              "english": "Avoidance of Compulsion"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس خاتون کے ناپسندیدہ رویے کے باوجود اس پر سختی نہیں فرمائی۔",
                "اگرچہ وہ نکاح میں تھی، مگر آپ ﷺ نے اس کے دل کی آواز کو اہمیت دی۔",
                "یہ واقعہ ثابت کرتا ہے کہ آپ ﷺ نے کبھی کسی پر اپنی مرضی مسلط نہیں کی۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not treat the woman harshly despite her unwelcome behavior.",
                "Even though she was in wedlock, he gave weight to her personal feelings and heart.",
                "This incident proves that he (ﷺ) never imposed his will upon anyone."
              ]
            }
          },
          {
            "title": {
              "urdu": "فوری علیحدگی اور حلم",
              "english": "Immediate Release and Forbearance"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے بغیر کسی طویل بحث کے اسے اپنے گھر والوں سے جا ملنے کا کہہ دیا۔",
                "یہ آپ ﷺ کی کمال عاجزی اور حلم کی علامت ہے کہ آپ ﷺ نے برا نہ مانا۔",
                "ایک عظیم رہنما اور شوہر کی حیثیت سے آپ ﷺ کا رویہ مثالی اور قابلِ تقلید ہے۔"
              ],
              "english": [
                "He told her to join her family immediately without engaging in any long debate.",
                "This signifies his immense humility and forbearance in not taking offense.",
                "His conduct as a great leader and husband remains exemplary and worth following."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور کنایہ طلاق",
        "english": "Juristic Aspect and Metaphoric Divorce"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الفاظِ کنایہ سے طلاق",
              "english": "Divorce through Metaphors"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک 'اپنے گھر والوں سے جا ملو' طلاق کے کنایہ الفاظ میں سے ہے۔",
                "اگر ان الفاظ سے طلاق کی نیت ہو تو طلاق واقع ہو جاتی ہے۔",
                "نبی کریم ﷺ نے یہاں ان الفاظ کو علیحدگی کے حتمی فیصلے کے طور پر استعمال فرمایا۔"
              ],
              "english": [
                "According to jurists, 'join your family' is among the metaphorical terms for divorce.",
                "If these words are uttered with the intent of divorce, the separation takes effect.",
                "The Prophet (ﷺ) used these words here as a final decision for separation."
              ]
            }
          },
          {
            "title": {
              "urdu": "نکاح کی حیثیت",
              "english": "Status of the Marriage"
            },
            "content": {
              "urdu": [
                "اس خاتون کا نکاح درست تھا، مگر اس کی طبیعت میں موافقت نہیں تھی۔",
                "نبی ﷺ نے اسے مجبور کرنے کے بجائے متبادل راستہ یعنی علیحدگی اختیار فرمائی۔",
                "یہ عمل ظاہر کرتا ہے کہ اسلام میں رشتے زبردستی نہیں بلکہ خوشدلی سے چلتے ہیں۔"
              ],
              "english": [
                "The marriage of this woman was valid, but there was no compatibility in her nature.",
                "Instead of forcing her, the Prophet (ﷺ) chose the alternative path of separation.",
                "This act shows that in Islam, relationships run on goodwill, not on compulsion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی سبق اور رہنمائی",
        "english": "Social Lesson and Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کے جذبات کا احترام",
              "english": "Respect for Woman's Feelings"
            },
            "content": {
              "urdu": [
                "شوہر کو چاہیے کہ وہ بیوی کے جذبات اور اس کی پسند ناپسند کا خیال رکھے۔",
                "اگر عورت کسی وجہ سے رشتہ نہیں نبھانا چاہتی تو اسے مجبور کرنا مناسب نہیں۔",
                "نبی ﷺ کا اسوہ ہمیں گھروں میں محبت اور نرمی کی فضا قائم کرنا سکھاتا ہے۔"
              ],
              "english": [
                "A husband should be mindful of his wife's feelings and her likes or dislikes.",
                "If a woman cannot continue a relationship for any reason, forcing her is inappropriate.",
                "The Prophet's example teaches us to establish an atmosphere of love and gentleness."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ کا تقاضا",
              "english": "Requirement of Taqwa"
            },
            "content": {
              "urdu": [
                "حقیقی متقی وہ ہے جو غصے یا قدرت کے باوجود اللہ سے ڈر کر فیصلہ کرے۔",
                "اللہ کی پناہ مانگنے والے کو پناہ دینا تقویٰ کی ایک بلند درجہ علامت ہے۔",
                "خاندانی مسائل میں انا کے بجائے اللہ کے احکامات کو سامنے رکھنا کامیابی ہے۔"
              ],
              "english": [
                "A truly pious person is one who decides in fear of Allah despite having power.",
                "Providing refuge to one who seeks it in Allah's name is a sign of high-level piety.",
                "Prioritizing Allah's commands over ego in family issues is the key to success."
              ]
            }
          }
        ]
      }
    }
  ]
}