{
  "hadithId": 599,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/599"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 39
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1824)، ومسلم (1196).‏",
    "urdu": "صحیح۔ اسے امام بخاری (1824) اور امام مسلم (1196) نے روایت کیا ہے۔ یہ حدیث شکار اور احرام کے احکام میں ایک بنیادی ضابطہ فراہم کرتی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1824) and Muslim (1196). This Hadith establishes a fundamental principle regarding hunting and the state of Ihram."
  },
  "importantWords": [
    {
      "arabic": "حِمَارَ اَلْوَحْشِيَّ",
      "english": "Wild Ass / Zebra",
      "urdu": "جنگلی گدھا (گور خر)"
    },
    {
      "arabic": "غَيْرُ مُحْرِمٍ",
      "english": "Not in state of Ihram",
      "urdu": "جس نے احرام نہ باندھا ہو"
    },
    {
      "arabic": "أَشَارَ",
      "english": "Pointed out / Indicated",
      "urdu": "اشارہ کیا"
    },
    {
      "arabic": "مُحْرِمِينَ",
      "english": "Those in Ihram",
      "urdu": "احرام والے لوگ"
    },
    {
      "arabic": "فَكُلُوا",
      "english": "Then eat",
      "urdu": "پس تم کھاؤ"
    }
  ],
  "summary": {
    "urdu": "احرام والی حالت میں شکار کرنا یا شکار میں مدد کرنا حرام ہے، لیکن اگر کوئی غیر محرم شخص اپنی مرضی سے شکار کرے تو اس کا گوشت محرم (احرام والا) کھا سکتا ہے۔",
    "english": "Hunting or assisting in it is forbidden for a person in Ihram. However, if a person not in Ihram hunts independently, those in Ihram may eat the meat."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1824)",
      "english": "Reported by Al-Bukhari (1824)"
    },
    {
      "arabic": "رواه مسلم (1196)",
      "english": "Reported by Muslim (1196)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abu Qatadah al-Ansari"
      },
      "slug": "abu-qatadah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دورانِ احرام شکار کا حکم",
        "english": "Hunting While in Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآنی ممانعت",
              "english": "Quranic Prohibition"
            },
            "content": {
              "urdu": [
                "قرآن مجید میں واضح حکم ہے کہ جب تم احرام کی حالت میں ہو تو خشکی کا شکار تمہارے لیے حرام ہے۔",
                "یہ حکم اللہ کی حرمت والے گھر کی تعظیم اور اس کی حدود میں امن و امان برقرار رکھنے کے لیے ہے۔",
                "شکار کی ممانعت صرف خشکی کے جانوروں کے لیے ہے، سمندری شکار جائز ہے۔"
              ],
              "english": [
                "The Quran explicitly forbids hunting land animals while in the state of Ihram (5:95).",
                "This ruling is to honor the sanctity of Allah's House and maintain peace within its boundaries.",
                "The prohibition only applies to land animals; sea hunting remains permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "شکار میں معاونت کی ممانعت",
              "english": "Prohibition of Assisting in Hunting"
            },
            "content": {
              "urdu": [
                "صرف خود شکار کرنا ہی منع نہیں بلکہ شکار کی طرف اشارہ کرنا یا شکاری کی مدد کرنا بھی حرام ہے۔",
                "نبی ﷺ نے اسی لیے صحابہ سے پوچھا کہ کیا کسی نے اشارہ کیا تھا یا حکم دیا تھا۔",
                "اگر محرم شخص اشارہ کر دے تو وہ شکار اس کے لیے اور دیگر ساتھیوں کے لیے حرام ہو جاتا ہے۔"
              ],
              "english": [
                "It is not only hunting itself that is forbidden, but also pointing out the prey or assisting the hunter.",
                "This is why the Prophet (ﷺ) asked if anyone had pointed it out or commanded the hunt.",
                "If a person in Ihram points out the game, the meat becomes forbidden for them and their companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غیر محرم کے شکار کا گوشت",
        "english": "Meat Hunted by Someone Not in Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال ہونے کی شرائط",
              "english": "Conditions for Permissibility"
            },
            "content": {
              "urdu": [
                "اگر شکار کرنے والا خود احرام میں نہ ہو اور اس نے محرم کی مدد کے بغیر شکار کیا ہو تو وہ گوشت حلال ہے۔",
                "دوسری شرط یہ ہے کہ شکاری نے خاص طور پر احرام والوں کی ضیافت کے لیے شکار نہ کیا ہو۔",
                "سیدنا ابوقتادہ نے اپنی ضرورت کے لیے شکار کیا تھا، اس لیے آپ ﷺ نے اسے جائز قرار دیا۔"
              ],
              "english": [
                "If the hunter is not in Ihram and acted without assistance from someone in Ihram, the meat is Halal.",
                "Another condition is that the hunter should not have hunted specifically for the sake of those in Ihram.",
                "Abu Qatadah (RA) hunted for his own needs, which is why the Prophet (ﷺ) permitted eating it."
              ]
            }
          },
          {
            "title": {
              "urdu": "شک اور یقین کا فرق",
              "english": "Doubt vs. Certainty"
            },
            "content": {
              "urdu": [
                "صحابہ کرام گوشت کھانے کے بارے میں شک میں تھے، آپ ﷺ نے ان کا شک دور فرمایا۔",
                "نبی ﷺ کا سوالات پوچھنا اس بات کی دلیل ہے کہ کسی چیز کے حلال یا حرام ہونے کا فیصلہ حقائق کی بنیاد پر ہونا چاہیے۔",
                "جب یہ ثابت ہو گیا کہ شکار میں کوئی شرعی خرابی نہیں، تو اسے کھانا جائز ہو گیا۔"
              ],
              "english": [
                "The Companions were in doubt about eating the meat, and the Prophet (ﷺ) cleared their confusion.",
                "His line of questioning proves that decisions on Halal and Haram should be based on investigated facts.",
                "Once it was established there was no legal flaw in the hunt, it became permissible to consume."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Juristic and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنگلی گدھے کا گوشت",
              "english": "Meat of Wild Ass"
            },
            "content": {
              "urdu": [
                "گھریلو گدھا حرام ہے، لیکن جنگلی گدھا (گور خر) حلال جانوروں میں شمار ہوتا ہے۔",
                "نبی ﷺ کا اس گوشت کو کھانے کی اجازت دینا اس کی حلت کی صریح دلیل ہے۔",
                "یہ حدیث حلال اور حرام جانوروں کے درمیان فرق کو واضح کرتی ہے۔"
              ],
              "english": [
                "The domestic donkey is forbidden, but the wild ass (zebra/onager) is considered Halal.",
                "The Prophet's (ﷺ) permission to eat this meat is a clear proof of its lawfulness.",
                "This Hadith clarifies the distinction between similar-looking Halal and Haram animals."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور احتیاط",
              "english": "Piety and Caution"
            },
            "content": {
              "urdu": [
                "صحابہ کرام کا گوشت سے رکنا ان کے کمالِ تقویٰ اور حلال و حرام کے معاملے میں حساسیت کی علامت ہے۔",
                "وہ مشتبہ چیزوں سے بچنے کے لیے نبی ﷺ سے رجوع کرتے تھے۔",
                "ایک مومن کو چاہیے کہ وہ اپنی عبادات میں ہر قسم کے شائبہ سے بچنے کی کوشش کرے۔"
              ],
              "english": [
                "The Companions' hesitation to eat reflects their profound piety and sensitivity toward Halal and Haram.",
                "They referred back to the Prophet (ﷺ) to avoid falling into doubtful matters.",
                "A believer should strive to avoid any ambiguity or suspicion in their acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی ضرورت",
              "english": "Need for Investigation"
            },
            "content": {
              "urdu": [
                "کسی بھی معاملے میں فتویٰ دینے یا فیصلہ کرنے سے پہلے مکمل تحقیق کرنا سنتِ نبوی ہے۔",
                "سرسری معلومات پر حلال کو حرام یا حرام کو حلال قرار دینا درست نہیں۔",
                "درست معلومات ہی صحیح عمل کی بنیاد بنتی ہیں۔"
              ],
              "english": [
                "Thorough investigation before issuing a ruling or decision is a Prophetic Sunnah.",
                "Declaring something Halal or Haram based on superficial information is incorrect.",
                "Accurate information forms the foundation of correct religious practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے صحابہ کو تنگی میں نہیں ڈالا بلکہ شرعی گنجائش کی بنیاد پر انہیں کھانے کی رخصت دی۔",
                "اسلام بندوں کے لیے تنگی نہیں بلکہ آسانی چاہتا ہے۔",
                "جہاں شرعی رکاوٹ نہ ہو، وہاں نعمتوں سے فائدہ اٹھانا اللہ کی شکر گزاری ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not cause hardship for his Companions but gave them permission based on legal allowance.",
                "Islam intends ease for people, not hardship.",
                "Utilizing blessings where there is no Shariah-based restriction is a form of gratitude to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}