{
  "hadithId": 173,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["1:4:14"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (حكم الكلام في الصلاة)",
    "babId": 13
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (1200)‏ ، ومسلم (539)‏ ، إلى أن مسلما لم يسق من الآية إلى قوله تعالى : (وقوموا لله قانتين)‏ .",
    "urdu": "صحیح۔ اسے بخاری (1200) اور مسلم (539) نے روایت کیا ہے، البتہ مسلم نے آیت کو «وقوموا لله قانتين» تک مکمل نہیں ذکر کیا۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (1200) and Muslim (539), although Muslim did not quote the verse fully, omitting the last part: 'wa qūmū lillāhi qānitīn.'",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَنَتَكَلَّمُ فِي اَلصَّلَاةِ",
      "english": "We used to talk during the prayer",
      "urdu": "ہم نماز میں بات کر لیا کرتے تھے"
    },
    {
      "arabic": "عَهْدِ اَلنَّبِيِّ",
      "english": "In the time/era of the Prophet",
      "urdu": "نبی کے زمانے میں"
    },
    {
      "arabic": "بِحَاجَتِهِ",
      "english": "About his need",
      "urdu": "اپنی ضرورت کے بارے میں"
    },
    {
      "arabic": "حَافِظُوا عَلَى اَلصَّلَوَاتِ",
      "english": "Guard strictly the prayers",
      "urdu": "نمازوں کی حفاظت کرو"
    },
    {
      "arabic": "قَانِتِينَ",
      "english": "Obedient and submissive (silent)",
      "urdu": "اطاعت گزار اور خاموش"
    },
    {
      "arabic": "فَأُمِرْنَا بِالسُّكُوتِ",
      "english": "So we were commanded to be silent",
      "urdu": "تو ہمیں خاموش رہنے کا حکم دیا گیا"
    },
    {
      "arabic": "نُهِينَا عَنْ اَلْكَلَامِ",
      "english": "And we were forbidden from speaking",
      "urdu": "اور ہمیں کلام کرنے سے منع کر دیا گیا"
    }
  ],
  "summary": {
    "urdu": "سیدنا زید بن ارقم رضی اللہ عنہ کی یہ حدیث واضح کرتی ہے کہ اسلام کے ابتدائی دور میں نماز میں بات چیت کی اجازت تھی، لیکن جب سورہ بقرہ کی آیت 238 نازل ہوئی جس میں 'قنوت' (اطاعت اور خاموشی) کے ساتھ نماز میں کھڑے ہونے کا حکم دیا گیا، تو اس کے بعد دورانِ نماز ہر قسم کی انسانی گفتگو کو حرام قرار دے دیا گیا اور خاموشی لازم کر دی گئی۔",
    "english": "This Hadith clarifies that speaking during prayer was initially permissible in early Islam. However, after the revelation of Qur'ān 2:238, which commands believers to stand before Allah 'Qānitīn' (with obedience and silence), all ordinary human speech during prayer was strictly forbidden, and silence became mandatory."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1200)",
      "english": "Reported by Al-Bukhārī (1200)"
    },
    {
      "arabic": "رواه مسلم (539)",
      "english": "Reported by Muslim (539)"
    },
    {
      "arabic": "القرآن الكريم، سورة البقرة، آية 238",
      "english": "The Holy Qur'ān, Surah Al-Baqarah, Verse 238"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "زيد بن أرقم",
        "english": "Zayd ibn Arqam"
      },
      "slug": "zayd-ibn-arqam"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-t1yM-l1hI",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں گفتگو کا نسخ",
        "english": "Abrogation of Speech in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابتدائی حکم اور آخری حکم",
              "english": "Initial and Final Ruling"
            },
            "content": {
              "urdu": [
                "زید بن ارقمؓ کی روایت یہ بتاتی ہے کہ نماز میں گفتگو کی اجازت ابتدائی طور پر تھی، تاکہ لوگ اپنی ضرورت بتا سکیں۔",
                "یہ حکم بعد میں نازل ہونے والی قرآنی آیت اور نبی ﷺ کے حکم سے منسوخ (منسوخ) ہو گیا۔",
                "یہ حدیث نماز کے اندر تمام انسانی کلام کو باطل کرنے کے لیے قوی ترین دلیل ہے۔"
              ],
              "english": [
                "Zayd ibn Arqam's narration confirms that speaking during prayer was initially allowed so people could state their needs.",
                "This ruling was later abrogated (Mansūkh) by the Qur'ānic verse and the Prophet's (ﷺ) subsequent command.",
                "This Hadith provides the strongest evidence for the nullification of all ordinary human speech during prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "آیت کی دلالت",
              "english": "Implication of the Verse"
            },
            "content": {
              "urdu": [
                "آیت کریمہ میں «وَقُومُوا لِلَّهِ قَانِتِينَ» (اللہ کے لیے اطاعت گزار ہو کر کھڑے ہو جاؤ) کا حکم نازل ہوا۔",
                "«قنوت» (Qunūt) کا ایک معنی اطاعت اور دوسرا معنی نماز میں خاموشی اختیار کرنا ہے۔",
                "صحابہ کرامؓ نے اس آیت کے نازل ہوتے ہی سمجھ لیا کہ اب خاموش رہنا اور بات چیت نہ کرنا فرض ہو گیا ہے۔"
              ],
              "english": [
                "The verse commands: 'wa qūmū lillāhi qānitīn' (and stand up before Allah with obedience and submissiveness).",
                "The word 'Qunūt' carries the meanings of both obedience and maintaining silence during prayer.",
                "Upon the revelation of this verse, the Companions understood that silence and refraining from speech became mandatory."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اصول اور عملی اطلاق",
        "english": "Juristic Principle and Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کلامِ ناس کا حکم",
              "english": "The Ruling on Ordinary Speech"
            },
            "content": {
              "urdu": [
                "نماز میں معمولی بات چیت بھی، اگر جان بوجھ کر ہو، تو نماز کو باطل کر دیتی ہے، یہی جمہور فقہاء کا موقف ہے۔",
                "اگر بھول کر یا غلطی سے کوئی بات کر لی جائے تو نماز باطل نہیں ہوتی، بلکہ سجدہ سہو واجب ہو جاتا ہے۔",
                "شرعی حکم کی تبدیلی (نسخ) علمائے اصول فقہ کا ایک بنیادی موضوع ہے۔"
              ],
              "english": [
                "Even minor speech during prayer, if done intentionally, nullifies the prayer, which is the position of the majority of jurists.",
                "If speech occurs due to forgetfulness or mistake, the prayer is not invalidated, but Sujūd As-Sahw (prostration of forgetfulness) becomes due.",
                "The change in legal rulings (Naskh/Abrogation) is a fundamental topic in the principles of jurisprudence ('Uṣūl al-Fiqh)."
              ]
            }
          },
          {
            "title": {
              "urdu": "الصلاة الوسطىٰ کی اہمیت",
              "english": "The Importance of Aṣ-Ṣalāt al-Wusṭā"
            },
            "content": {
              "urdu": [
                "یہ آیت تمام نمازوں کی حفاظت کا حکم دیتی ہے، خاص طور پر 'الصلاة الوسطىٰ' (درمیانی نماز) کی۔",
                "احادیث کی روشنی میں، الصلاة الوسطىٰ سے مراد نماز عصر ہے، جس کی حفاظت پر خصوصی تاکید ہے۔",
                "نماز میں گفتگو سے ممانعت کا حکم اس نماز کی اہمیت کو مزید بڑھاتا ہے۔"
              ],
              "english": [
                "The verse commands strictly guarding all prayers, particularly 'Aṣ-Ṣalāt al-Wusṭā' (the middle prayer).",
                "In light of Ahadith, Aṣ-Ṣalāt al-Wusṭā refers to the 'Aṣr prayer, emphasizing its protection.",
                "The prohibition of speech in prayer further highlights the sanctity of this particular prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی پہلو",
        "english": "Training and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاموشی کی برکت",
              "english": "The Blessing of Silence"
            },
            "content": {
              "urdu": [
                "نماز میں خاموشی اللہ تعالیٰ کے حضور مکمل توجہ اور خشوع کے لیے ضروری ہے۔",
                "جب بندہ نماز میں اللہ سے بات کرتا ہے، تو درمیان میں دنیاوی بات کرنا ادب کے خلاف ہے۔",
                "مسلمانوں کو چاہیے کہ وہ نماز کو دنیا سے کاٹ کر، اللہ کی طرف مکمل یکسوئی سے ادا کریں۔"
              ],
              "english": [
                "Silence in prayer is essential for complete attention and reverence (Khushu') before Allah.",
                "When a servant is conversing with Allah in prayer, interjecting with worldly speech is against the proper etiquette.",
                "Muslims should treat prayer as a break from the world, performing it with full devotion to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظمِ شریعت",
              "english": "Order in Sharia"
            },
            "content": {
              "urdu": [
                "شریعتِ اسلامیہ کے احکام تدریجی طور پر نازل ہوئے، جو لوگوں کی تربیت اور آسانی کا بہترین منہج ہے۔",
                "ابتداء میں اجازت دینا اور پھر واضح ممانعت (نسخ) کرنا، قانون سازی کے عمل کی حکمت کو ظاہر کرتا ہے۔",
                "مسلمان کو چاہیے کہ وہ نبی ﷺ کے ہر حکم پر فوراً عمل کرے۔"
              ],
              "english": [
                "The rulings of the Islamic Sharī'ah were revealed gradually, which is the best method for training people and providing ease.",
                "The initial permission followed by a clear prohibition (Naskh) demonstrates the wisdom of the legislative process.",
                "A Muslim should immediately comply with every command of the Prophet (ﷺ)."
              ]
            }
          }
        ]
      }
    }
  ]
}
