{
  "hadithId": 962,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/962",
      "abudawud/2157"
    ],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (2157)‏، والحاكم (2/194)‏، والدارقطني (3/258). وله شواهد تقويه من حديث رويفع بن ثابت عند الترمذي.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (2157)، حاکم اور دارقطنی نے روایت کیا ہے۔ اس کے دیگر شواہد بھی موجود ہیں جو اس کے معنی کی تقویت کرتے ہیں، جیسے رويفع بن ثابت کی روایت۔",
    "english": "Sahih. Reported by Abu Dawud (2157), Al-Hakim (2/194), and Ad-Daraqutni (3/258). It is supported by other narrations, such as the one from Ruwaifi' bin Thabit in At-Tirmidhi."
  },
  "importantWords": [
    {
      "arabic": "سَبَايَا",
      "english": "Captives / Prisoners of war",
      "urdu": "قیدی عورتیں / لونڈیاں"
    },
    {
      "arabic": "لَا تُوطَأُ",
      "english": "Not to have intercourse with",
      "urdu": "جماع / وطی نہ کی جائے"
    },
    {
      "arabic": "حَتَّى تَضَعَ",
      "english": "Until she gives birth",
      "urdu": "یہاں تک کہ وہ بچہ جن دے"
    },
    {
      "arabic": "تَحِيضَ حَيْضَةً",
      "english": "She menstruates once",
      "urdu": "اسے ایک حیض آ جائے"
    },
    {
      "arabic": "اسْتِبْرَاء",
      "english": "Ensuring the womb is empty",
      "urdu": "استبراء (رحم کی صفائی کا اطمینان)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'استبراء' کا حکم بیان ہوا ہے، یعنی کسی بھی نئی حاصل شدہ لونڈی یا قیدی عورت سے قربت سے پہلے یہ اطمینان کرنا ضروری ہے کہ وہ حاملہ نہیں ہے، تاکہ نسب خلط ملط نہ ہو۔",
    "english": "This Hadith establishes the ruling of 'Istibra' (ensuring the womb is clear), prohibiting intimacy with a new captive or slave-woman until her pregnancy status is confirmed to protect lineage."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2157)",
      "english": "Reported by Abu Dawud (2157)"
    },
    {
      "arabic": "رواه الحاكم (2/194)",
      "english": "Reported by Al-Hakim (2/194)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-sa-id-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9U0K07_z0U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استبراءِ رحم کی اہمیت",
        "english": "Importance of Istibra (Womb Clearing)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نسب کی حفاظت",
              "english": "Protection of Lineage"
            },
            "content": {
              "urdu": [
                "اسلام میں نسب کی حفاظت کو بنیادی اہمیت حاصل ہے۔",
                "قیدی عورتوں (سبایا) سے قربت سے پہلے انتظار کا حکم اس لیے ہے تاکہ معلوم ہو سکے کہ وہ پہلے سے حاملہ تو نہیں۔",
                "اگر بغیر انتظار کے قربت کی جائے تو پیدا ہونے والے بچے کے نسب میں شک پیدا ہو سکتا ہے۔"
              ],
              "english": [
                "Preserving lineage is of fundamental importance in Islam.",
                "The command to wait before intimacy with captives is to ensure they are not already pregnant.",
                "Intercourse without waiting could lead to confusion and doubt regarding the child's paternity."
              ]
            }
          },
          {
            "title": {
              "urdu": "حمل کی صورت میں حکم",
              "english": "Ruling in Case of Pregnancy"
            },
            "content": {
              "urdu": [
                "اگر عورت حاملہ ہو تو وضع حمل (بچے کی پیدائش) تک انتظار واجب ہے۔",
                "نبی ﷺ نے فرمایا کہ کسی کے لیے حلال نہیں کہ وہ دوسرے کی کھیتی کو اپنے پانی سے سیراب کرے۔",
                "یہ حکم دوسرے مرد (سابقہ شوہر) کے حق کی رعایت اور بچے کے تحفظ کے لیے ہے۔"
              ],
              "english": [
                "If the woman is pregnant, waiting until delivery is obligatory.",
                "The Prophet (ﷺ) said it is not permissible for one to irrigate another's crop with his own water.",
                "This ruling respects the rights of the previous husband and ensures the child's safety."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غیر حاملہ کی عدت / استبراء",
        "english": "Istibra for a Non-Pregnant Woman"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک حیض کی حکمت",
              "english": "Wisdom of One Menstrual Cycle"
            },
            "content": {
              "urdu": [
                "غیر حاملہ عورت کے لیے صرف ایک حیض گزارنا کافی قرار دیا گیا ہے۔",
                "ایک حیض کا آنا اس بات کی طبی اور شرعی علامت ہے کہ رحم حمل سے خالی ہے۔",
                "اسے شرعی اصطلاح میں 'استبراء' کہا جاتا ہے جو لونڈیوں اور قیدی عورتوں کے لیے مخصوص ہے۔"
              ],
              "english": [
                "For a non-pregnant woman, observing one menstrual cycle is sufficient.",
                "The occurrence of one menses is a medical and legal sign that the womb is empty.",
                "In Shariah, this is called 'Istibra', specifically required for slave-women and captives."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی نظم و ضبط",
              "english": "Social Discipline"
            },
            "content": {
              "urdu": [
                "یہ حکم جنگی حالات میں بھی اخلاقی ضوابط اور انسانی وقار کی پاسداری سکھاتا ہے۔",
                "اسلام نے قیدیوں کے معاملے میں بھی ایسے قوانین بنائے جو شہوت پرستی کے بجائے نظم و ضبط پر مبنی ہیں۔",
                "یہ اصول آج کے دور میں بھی متبنیٰ (گود لیے ہوئے) یا دیگر نسبی پیچیدگیوں کو سمجھنے میں رہنمائی دیتا ہے۔"
              ],
              "english": [
                "This command teaches ethical standards and human dignity even in war scenarios.",
                "Islam established laws for captives based on discipline rather than mere lust.",
                "This principle provides guidance even today in understanding adoption or lineage complexities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور وسعت",
        "english": "Juristic Aspects and Scope"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خرید و فروخت میں استبراء",
              "english": "Istibra in Trade/Ownership"
            },
            "content": {
              "urdu": [
                "یہی حکم اس وقت بھی لاگو ہوتا ہے جب کوئی لونڈی خریدی جائے یا کسی کو ہبہ (گفٹ) کی جائے۔",
                "مالک بدلنے کی صورت میں ہر بار استبراء واجب ہوتا ہے تاکہ شکوک و شبہات ختم ہوں۔",
                "یہ اسلامی قانونِ وراثت اور خاندانی نظام کی مضبوطی کا ایک اہم ستون ہے۔"
              ],
              "english": [
                "The same ruling applies when a slave-woman is purchased or gifted.",
                "Every time ownership changes, Istibra is mandatory to eliminate doubts.",
                "This is a key pillar in the strength of the Islamic law of inheritance and family system."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدت اور استبراء کا فرق",
              "english": "Difference between Iddah and Istibra"
            },
            "content": {
              "urdu": [
                "عدت طلاق یا وفات کے بعد نکاح کے لیے ہوتی ہے، جبکہ استبراء ملکیت کے بعد وطی کے لیے۔",
                "عدت کی مدت طویل (3 حیض یا 4 ماہ 10 دن) ہے، جبکہ استبراء عموماً صرف ایک حیض ہے۔",
                "دونوں کا مقصد رحم کی صفائی ہے، مگر عدت میں عبادت اور سوگ کا پہلو بھی شامل ہے۔"
              ],
              "english": [
                "Iddah is for marriage after divorce/death, while Istibra is for intimacy after ownership.",
                "Iddah is longer (3 cycles or 4 months 10 days), whereas Istibra is usually just one cycle.",
                "Both aim to clear the womb, but Iddah also involves worship and mourning elements."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی سبق",
        "english": "Educational and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صبر اور ضبطِ نفس",
              "english": "Patience and Self-Control"
            },
            "content": {
              "urdu": [
                "شریعت کا یہ حکم انسان کو اپنی خواہشات پر قابو پانے اور صبر کی تربیت دیتا ہے۔",
                "کسی چیز کا جائز ہونا اسے فوری طور پر استعمال کرنے کا لائسنس نہیں دیتا بلکہ شرائط کا لحاظ رکھنا ہوتا ہے۔",
                "مومن وہی ہے جو حلال کاموں میں بھی اللہ کی حدود کو تلاش کرے۔"
              ],
              "english": [
                "This Shariah command trains individuals in self-control and patience.",
                "Permission for an act doesn't mean an immediate license; conditions must be respected.",
                "A true believer is one who seeks Allah's limits even in permissible matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی بصیرت",
              "english": "The Prophet's (ﷺ) Insight"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے جنگی قیدیوں کے معاملے میں بھی ایسے باریک مسائل کی وضاحت فرمائی۔",
                "یہ دینِ اسلام کی کاملیت اور ہر شعبہ زندگی میں رہنمائی کی دلیل ہے۔",
                "سنتِ نبوی کی اتباع ہی معاشرے کو اخلاقی پستی سے بچاتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified even these detailed issues regarding war captives.",
                "This proves the perfection of Islam and its guidance in every walk of life.",
                "Following the Sunnah is what saves society from moral degradation."
              ]
            }
          }
        ]
      }
    }
  ]
}