{
  "hadithId": 874,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/64"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (6388)، ومسلم (1434)، وأخرجه أيضاً أبو داود (2161)، والترمذي (1092)، والنسائي في عمل اليوم والليلة (608).",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (6388) اور امام مسلم (1434) نے روایت کیا ہے۔ اس کے علاوہ ابوداؤد، ترمذی اور نسائی نے بھی اسے اپنی کتب میں درج کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6388) and Muslim (1434). Also recorded by Abu Dawud (2161), At-Tirmidhi (1092), and An-Nasa'i in 'Amal al-Yawm wal-Laylah."
  },
  "importantWords": [
    {
      "arabic": "يَأْتِيَ أَهْلَهُ",
      "english": "Approaches his family (wife)",
      "urdu": "بیوی کے پاس جائے (جماع کرے)"
    },
    {
      "arabic": "جَنِّبْنَا",
      "english": "Keep us away / Protect us",
      "urdu": "ہمیں بچا / دور رکھ"
    },
    {
      "arabic": "رَزَقْتَنَا",
      "english": "You provided for us",
      "urdu": "تو ہمیں عطا فرمائے (رزق/اولاد)"
    },
    {
      "arabic": "يُقَدَّرْ",
      "english": "It is ordained / decreed",
      "urdu": "مقدر ہو جائے"
    },
    {
      "arabic": "لَمْ يَضُرَّهُ",
      "english": "Will not harm him",
      "urdu": "اسے نقصان نہیں پہنچائے گا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ازدواجی تعلق سے قبل اللہ کا نام لینے اور مسنون دعا پڑھنے کی تاکید کی گئی ہے، جس کی برکت سے پیدا ہونے والی اولاد شیطان کے شر سے محفوظ رہتی ہے۔",
    "english": "This Hadith emphasizes seeking Allah's protection through a specific supplication before marital intimacy, ensuring the safety of future offspring from Satanic harm."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الدعوات، رقم الحديث ٦٣٨٨",
      "english": "Sahih Bukhari, Book of Supplications, Hadith No. 6388"
    },
    {
      "arabic": "صحيح مسلم، كتاب النكاح، رقم الحديث ١٤٣٤",
      "english": "Sahih Muslim, Book of Marriage, Hadith No. 1434"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ازدواجی تعلق میں ذکرِ الہی",
        "english": "Remembrance of Allah in Intimacy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تسمیہ (بسم اللہ) کی برکت",
              "english": "Blessings of Basmalah"
            },
            "content": {
              "urdu": [
                "ہر اہم کام شروع کرنے سے پہلے اللہ کا نام لینا برکت اور خیر کا باعث بنتا ہے۔",
                "بیوی کے ساتھ خلوت کے وقت بسم اللہ پڑھنا سنتِ نبوی اور ایک مبارک عمل ہے۔",
                "یہ عمل اس بات کی گواہی ہے کہ مومن اپنی لذت میں بھی اللہ کو نہیں بھولتا۔"
              ],
              "english": [
                "Starting any significant task with Allah's name brings divine blessing and goodness.",
                "Reciting Basmalah during intimacy with one's spouse is a blessed Prophetic Sunnah.",
                "This act signifies that a believer remembers Allah even during physical pleasure."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی اہمیت",
              "english": "Importance of the Supplication"
            },
            "content": {
              "urdu": [
                "اس دعا میں انسان اللہ سے اپنی اور اپنی ہونے والی اولاد کی حفاظت کی طلب کرتا ہے۔",
                "شیطان انسانی زندگی کے ہر مرحلے پر حملہ آور ہوتا ہے، اس لیے یہاں بھی پناہ ضروری ہے۔",
                "نبی ﷺ کی سکھائی ہوئی دعائیں دنیا اور آخرت کے تمام شرور سے بچاؤ کا قلعہ ہیں۔"
              ],
              "english": [
                "In this supplication, one asks Allah for protection for themselves and their future child.",
                "Satan attempts to interfere at every stage of life, making divine protection vital here too.",
                "The prayers taught by the Prophet (ﷺ) are fortresses against all worldly and spiritual evils."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اولاد کی شیطانی اثرات سے حفاظت",
        "english": "Protecting Children from Satanic Effects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان نہ پہنچانے کا مفہوم",
              "english": "Meaning of 'Not Harming'"
            },
            "content": {
              "urdu": [
                "محدثین کے مطابق اس کا مطلب ہے کہ شیطان اس بچے کو کفر یا بڑے گناہ پر مجبور نہیں کر سکے گا۔",
                "اس برکت کی وجہ سے بچہ دینِ فطرت پر قائم رہتا ہے اور شیطانی وسوسوں سے بچتا ہے۔",
                "بعض نے اسے جسمانی نقصان سے بھی تعبیر کیا ہے جو پیدائش کے وقت شیطان پہنچاتا ہے۔"
              ],
              "english": [
                "Scholars suggest this means Satan will not be able to force the child into disbelief or major sins.",
                "Due to this blessing, the child remains on the natural faith and resists devilish whispers.",
                "Some interpret it as protection from physical harm that Satan might inflict at birth."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیک اولاد کی بنیاد",
              "english": "Foundation of Righteous Offspring"
            },
            "content": {
              "urdu": [
                "نیک اولاد کی تربیت کا آغاز دراصل پیدائش سے بھی پہلے اس مسنون دعا سے ہوتا ہے۔",
                "جس رشتے کی بنیاد اللہ کے نام پر ہو، اللہ اس میں پاکیزگی اور برکت عطا فرماتا ہے۔",
                "اولاد کو نیک بنانے کے لیے والدین کو شرعی آداب کی پابندی کرنی چاہیے۔"
              ],
              "english": [
                "The upbringing of righteous children actually begins with this Sunnah prayer before birth.",
                "A union founded upon Allah's name is granted purity and blessing by Allah.",
                "Parents must adhere to Sharia etiquettes to ensure the spiritual well-being of their children."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آدابِ مباشرت",
              "english": "Etiquettes of Intercourse"
            },
            "content": {
              "urdu": [
                "اسلام نے انسانی زندگی کے ہر گوشے، یہاں تک کہ نجی لمحات کے لیے بھی آداب بتائے ہیں۔",
                "ان آداب پر عمل کرنا ثواب کا باعث ہے اور انسان کو حیوانیت سے دور کرتا ہے۔",
                "شریعت نے جنسی تعلق کو صرف لذت نہیں بلکہ ایک باقاعدہ ذمہ داری اور عبادت بنایا ہے۔"
              ],
              "english": [
                "Islam provides etiquettes for every part of human life, including the most private moments.",
                "Following these etiquettes earns reward and distinguishes human behavior from animality.",
                "Sharia treats sexual relations not just as pleasure, but as a responsibility and act of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان اور تقویٰ کا مظاہرہ",
              "english": "Manifestation of Faith and Piety"
            },
            "content": {
              "urdu": [
                "خلوت میں اللہ کو یاد کرنا تقویٰ کے اعلیٰ درجے کی علامت ہے۔",
                "یہ دعا ثابت کرتی ہے کہ ایک مومن کا ہر سانس اللہ کی مرضی کے تابع ہوتا ہے۔",
                "مسلمانوں کو چاہیے کہ وہ ان مختصر مگر جامع کلمات کو حفظ کریں اور عمل میں لائیں۔"
              ],
              "english": [
                "Remembering Allah in complete privacy is a sign of high-level piety (Taqwa).",
                "This prayer proves that every breath of a believer is submitted to Allah's will.",
                "Muslims should memorize and practice these brief yet comprehensive Prophetic words."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور روحانی اثرات",
        "english": "Social and Spiritual Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان کی مایوسی",
              "english": "Despair of Satan"
            },
            "content": {
              "urdu": [
                "شیطان انسان کو گمراہ کرنے کی ہر کوشش کرتا ہے، مگر ذکرِ الہی اسے دور بھگا دیتا ہے۔",
                "اس سنت پر عمل کرنے سے گھر میں سکون اور اولاد میں فرمانببرداری پیدا ہوتی ہے۔",
                "ذکرِ خدا سے شیطان کی تمام چالیں اور وار ناکام ہو جاتے ہیں۔"
              ],
              "english": [
                "Satan strives to mislead humans, but the remembrance of Allah drives him away.",
                "Practicing this Sunnah brings peace to the home and obedience in children.",
                "Through the mention of Allah, all of Satan's plots and attacks are rendered ineffective."
              ]
            }
          },
          {
            "title": {
              "urdu": "نسلِ نو کی اصلاح",
              "english": "Reform of the New Generation"
            },
            "content": {
              "urdu": [
                "اگر معاشرہ ان روحانی بنیادوں پر قائم ہو تو جرائم اور بے حیائی میں کمی آ سکتی ہے۔",
                "پاکیزہ عمل سے پیدا ہونے والی نسل معاشرے کے لیے خیر کا باعث بنتی ہے۔",
                "دین پر عمل پیرا ہونا ہی دنیا اور آخرت کی تمام کامیابیوں کی کلید ہے۔"
              ],
              "english": [
                "If a society is built on these spiritual foundations, crime and immorality can decrease.",
                "A generation born from pure actions becomes a source of goodness for the community.",
                "Adhering to the religion is the key to all success in this world and the hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}