{
  "hadithId": 191,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["2", "5"],
    "kitabId": 2,
    "inKitabBab": 5,
    "arabicBook": "كتاب الصلاة",
    "babId": 15
  },
  
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري (405، 413، 1214، وغيره)، ومسلم (551).",
    "urdu": "صحیح اور متفق علیہ روایت ہے۔ اسے بخاری (405، 413، 1214 اور دیگر) اور مسلم (551) نے روایت کیا ہے۔",
    "english": "Authentic (Sahih), Agreed upon (Muttafaq 'Alayh). Reported by Al-Bukhari (405, 413, 1214, and others) and Muslim (551)."
  },
  "importantWords": [
    {
      "arabic": "يناجي",
      "english": "Converses privately",
      "urdu": "سرگوشی کرتا ہے/راز کہتا ہے"
    },
    {
      "arabic": "ربه",
      "english": "His Lord",
      "urdu": "اپنے رب کو"
    },
    {
      "arabic": "فلا يبزقن",
      "english": "Let him not spit",
      "urdu": "پس وہ ہرگز نہ تھوکے"
    },
    {
      "arabic": "بين يديه",
      "english": "In front of him",
      "urdu": "اپنے سامنے"
    },
    {
      "arabic": "عن يمينه",
      "english": "To his right",
      "urdu": "اپنی دائیں جانب"
    },
    {
      "arabic": "عن شماله",
      "english": "To his left",
      "urdu": "اپنی بائیں جانب"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ نماز اللہ کے ساتھ راز و نیاز اور مناجات کی حالت ہے، اس لیے اس کے احترام میں نمازی کو اپنے سامنے یا دائیں جانب تھوکنے سے منع کیا گیا ہے، کیونکہ سامنے اللہ کی طرف توجہ ہوتی ہے اور دائیں جانب فرشتہ ہوتا ہے۔ البتہ، ضرورت پڑنے پر بائیں جانب یا بائیں پاؤں کے نیچے تھوکا جا سکتا ہے۔",
    "english": "This Hadith states that prayer is a state of intimate conversation with Allah (Munajah), and due to this respect, the worshipper is prohibited from spitting in front of him or to his right. This is because he is facing Allah (Qiblah is forward) and the recording angel is on his right. Spitting is permitted to the left or under the left foot if needed."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب حك البزاق بالرجل من المسجد (413)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: Scraping the Spittle with the Foot from the Masjid (413)"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساجد ومواضع الصلاة، باب النهي عن البزاق في المسجد في القبلة (551)",
      "english": "Sahih Muslim, Book of Masajid and Places of Prayer, Chapter: Prohibition of spitting in the Masjid towards the Qiblah (551)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Malik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=M9-pPj12qHw",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں مناجات کا تصور",
        "english": "Concept of Munajah (Intimate Conversation) in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی خاصیت",
              "english": "The Nature of Prayer"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے واضح فرمایا کہ نماز بندے اور اللہ کے درمیان راز و نیاز کا ذریعہ ہے۔",
                "جب بندہ نماز میں ہوتا ہے تو وہ گویا اللہ کے سامنے کھڑا ہو کر اس سے ہم کلام ہوتا ہے۔",
                "اس خاص تعلق کا تقاضا ہے کہ نمازی نہایت ادب اور پاکیزگی کا خیال رکھے۔"
              ],
              "english": [
                "The Prophet (PBUH) clarified that prayer is a means of intimate conversation between the servant and Allah.",
                "When a servant is in prayer, it is as if they are standing before Allah and speaking to Him.",
                "This special relationship requires the worshipper to maintain high standards of respect and cleanliness."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائیں اور سامنے کی ممانعت کی وجہ",
              "english": "Reason for Prohibition on the Right and Front"
            },
            "content": {
              "urdu": [
                "سامنے کی سمت دراصل قبلہ اور اللہ کی طرف متوجہ ہونے کی جگہ ہے، لہذا وہاں تھوکنا بے ادبی ہے۔",
                "دائیں جانب وہ فرشتہ موجود ہوتا ہے جو نیکیاں لکھتا ہے، اس لیے اس طرف بھی تھوکنا منع ہے۔",
                "یہ ممانعت دراصل مسجد اور عمومی عبادت کی جگہ کی حرمت کے لیے ہے۔"
              ],
              "english": [
                "The forward direction is the Qiblah, where one faces Allah, so spitting there is disrespectful.",
                "The recording angel who registers good deeds is on the right side, hence spitting in that direction is forbidden.",
                "This prohibition is primarily for the sanctity of the mosque and the general place of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت اور مسجد کا احترام",
        "english": "Purity and Respect for the Mosque"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تھوکنے کی اجازت کی جگہ",
              "english": "Permissible Place to Spit"
            },
            "content": {
              "urdu": [
                "ضرورت کے وقت بائیں طرف یا بائیں پاؤں کے نیچے تھوکنے کی اجازت دی گئی ہے۔",
                "اگر زمین کچی ہو تو تھوک کر اسے مٹی سے دبا دیا جاتا تھا تاکہ نجاست نہ پھیلے۔",
                "آج کل کے فرش والے مساجد میں جیب میں رومال یا ڈسپوزل ٹشو استعمال کرنا چاہیے۔"
              ],
              "english": [
                "When necessary, spitting is allowed to the left or under the left foot.",
                "If the ground was unpaved, the spittle was immediately covered with soil to prevent the spread of impurity.",
                "In modern carpeted mosques, one should use a handkerchief or disposable tissue in the pocket."
              ]
            }
          },
          {
            "title": {
              "urdu": "تھوکنا گناہ کیوں؟",
              "english": "Why is Spitting a Sin?"
            },
            "content": {
              "urdu": [
                "مسجد میں تھوکنا یا نجاست پھیلانا گناہ ہے کیونکہ مسجد اللہ کا گھر ہے۔",
                "خاص طور پر قبلہ کی سمت تھوکنا یا دائیں طرف تھوکنا عبادت کے آداب کے خلاف ہے۔",
                "جو شخص ایسا کرتا ہے وہ دراصل اپنی نماز کی تعظیم میں کوتاہی کرتا ہے۔"
              ],
              "english": [
                "Spitting or spreading impurity in the mosque is a sin because the mosque is the House of Allah.",
                "Specifically spitting towards the Qiblah or to the right is against the etiquette of worship.",
                "A person who does this is essentially negligent in honoring their prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی احکام اور متبادل",
        "english": "Practical Rulings and Alternatives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کا طریقہ",
              "english": "The Sunnah Method"
            },
            "content": {
              "urdu": [
                "حالتِ نماز میں تھوکنے کی شدید ضرورت پیش آئے تو بائیں ہاتھ کی آستین میں تھوک لیں۔",
                "اس کے بعد آستین کو بند کر دیں یا رومال وغیرہ کا استعمال کریں۔",
                "اس عمل سے نہ تو نماز فاسد ہوگی اور نہ ہی مسجد کے تقدس میں خلل آئے گا۔"
              ],
              "english": [
                "If there is an urgent need to spit during prayer, one should spit into the sleeve of their left hand.",
                "After spitting, the sleeve should be closed, or a handkerchief should be used.",
                "This action neither invalidates the prayer nor violates the sanctity of the mosque."
              ]
            }
          },
          {
            "title": {
              "urdu": "عام جگہوں پر اطلاق",
              "english": "Application in General Places"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص کھلے میدان میں نماز پڑھ رہا ہو تو بھی یہ ادب ملحوظ خاطر رکھنا چاہیے۔",
                "مسجد سے باہر بھی قبلہ کی طرف یا دائیں طرف تھوکنا مکروہ ہے، اگرچہ ممانعت میں شدت کم ہے۔",
                "ان اصولوں پر عمل کرنے سے اسلامی اخلاق اور صفائی کی اہمیت اجاگر ہوتی ہے۔"
              ],
              "english": [
                "Even if a person is praying in an open field, this etiquette must be observed.",
                "Outside the mosque, spitting towards the Qiblah or to the right is also disliked, though the prohibition might be less severe.",
                "Adherence to these principles highlights Islamic ethics and the importance of cleanliness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور اخلاقی سبق",
        "english": "Educational and Ethical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادبِ الٰہی کا درس",
              "english": "Lesson in Divine Etiquette"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ نماز میں ہم جس ہستی سے مخاطب ہیں وہ کتنی عظیم ہے۔",
                "عبادت کے دوران معمولی ترین ظاہری آداب کا خیال رکھنا بھی ضروری ہے۔",
                "یہ صرف صفائی نہیں بلکہ اللہ کی عظمت کا اعتراف بھی ہے۔"
              ],
              "english": [
                "This Hadith teaches us the greatness of the Being we address in prayer.",
                "It is essential to observe even the smallest outward manners during worship.",
                "This is not just about cleanliness but also an acknowledgment of Allah's Majesty."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرشتوں کا احترام",
              "english": "Respect for the Angels"
            },
            "content": {
              "urdu": [
                "دائیں طرف تھوکنے کی ممانعت فرشتوں کے احترام کا بھی درس دیتی ہے۔",
                "اسلام میں ہر جگہ کی طہارت اور موجود مخلوقات کے ادب پر زور دیا گیا ہے۔",
                "یہ ہمیں ہر حال میں اچھے اور شائستہ اخلاق اپنانے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The prohibition of spitting to the right also teaches respect for the attending angels.",
                "Islam emphasizes purity of the environment and etiquette towards the creatures present.",
                "This encourages us to adopt good and refined manners in all circumstances."
              ]
            }
          }
        ]
      }
    }
  ]
}
