{
  "hadithId": 1086,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/7"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2810)، ومسلم (1904). وأصله أن رجلاً سأل النبي ﷺ عن الرجل يقاتل شجاعة، ويقاتل حمية، ويقاتل رياء، فأي ذلك في سبيل الله؟ فقال ﷺ: مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2810) اور امام مسلم (1904) نے روایت کیا ہے۔ اس کا پس منظر یہ ہے کہ ایک اعرابی نے آپ ﷺ سے پوچھا کہ کوئی بہادری کے لیے لڑتا ہے، کوئی غیرت کے لیے اور کوئی دکھاوے کے لیے، تو اللہ کی راہ میں کون ہے؟ آپ ﷺ نے یہ جواب ارشاد فرمایا۔",
    "english": "Sahih. Reported by Al-Bukhari (2810) and Muslim (1904). The context is that a man asked the Prophet (ﷺ) about those who fight for bravery, tribal pride, or show-off, asking who is in the cause of Allah. The Prophet (ﷺ) then gave this reply."
  },
  "importantWords": [
    {
      "arabic": "قَاتَلَ",
      "english": "Fought",
      "urdu": "جنگ کی"
    },
    {
      "arabic": "كَلِمَةُ اَللَّهِ",
      "english": "Word of Allah",
      "urdu": "اللہ کا کلمہ / دین"
    },
    {
      "arabic": "الْعُلْيَا",
      "english": "Superior / Highest",
      "urdu": "بلند تر"
    },
    {
      "arabic": "سَبِيلِ اَللَّهِ",
      "english": "Cause of Allah",
      "urdu": "اللہ کی راہ"
    },
    {
      "arabic": "لِتَكُونَ",
      "english": "In order to be",
      "urdu": "تاکہ ہو جائے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا خلاصہ یہ ہے کہ اللہ کے ہاں صرف وہی عمل مقبول ہے جو خالص اس کی رضا اور دین کی سربلندی کے لیے کیا جائے، محض شہرت یا دنیاوی مفاد کے لیے کی گئی کوشش جہاد نہیں۔",
    "english": "The essence of this Hadith is that only actions performed purely for Allah's pleasure and the supremacy of His religion are accepted; efforts made for fame or worldly gain are not considered Jihad."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2810)",
      "english": "Sahih al-Bukhari (2810)"
    },
    {
      "arabic": "صحيح مسلم (1904)",
      "english": "Sahih Muslim (1904)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa al-Ash'ari"
      },
      "slug": "abu-musa-al-ashari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اخلاصِ نیت کی اہمیت",
        "english": "Importance of Sincerity of Intention"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال کا دارومدار نیت پر",
              "english": "Actions Depend on Intentions"
            },
            "content": {
              "urdu": [
                "اسلام میں کسی بھی عمل کی قبولیت کے لیے نیت کا خالص ہونا بنیادی شرط ہے۔",
                "اگر نیت میں دنیاوی لالچ یا شہرت شامل ہو تو وہ عمل اللہ کے ہاں رد کر دیا جاتا ہے۔",
                "جہاد جیسے عظیم عمل میں بھی اگر نیت اللہ کے لیے نہ ہو تو وہ ضائع ہو جاتا ہے۔"
              ],
              "english": [
                "In Islam, the primary condition for the acceptance of any deed is a sincere intention.",
                "If an action involves worldly greed or fame, it is rejected by Allah.",
                "Even a great act like Jihad is wasted if the intention is not solely for Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "کلمہ اللہ کی سربلندی",
              "english": "Supremacy of Allah's Word"
            },
            "content": {
              "urdu": [
                "حقیقی مجاہد وہ ہے جس کا مقصد صرف اور صرف اسلام کا بول بالا کرنا ہو۔",
                "ذاتی انتقام یا قبائلی عصبیت کے لیے لڑنا اسلامی جہاد کے زمرے میں نہیں آتا۔",
                "یہ حدیث ایک مجاہد کے لیے واضح نصب العین متعین کرتی ہے۔"
              ],
              "english": [
                "A true Mujahid is one whose sole objective is to raise the banner of Islam.",
                "Fighting for personal revenge or tribal fanaticism does not fall under Islamic Jihad.",
                "This Hadith defines a clear objective and mission for a believer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دنیاوی محرکات کی نفی",
        "english": "Rejection of Worldly Motives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شہرت اور بہادری کا دکھاوا",
              "english": "Display of Fame and Bravery"
            },
            "content": {
              "urdu": [
                "بہادری کے چرچے کروانے کے لیے لڑنا ریاکاری ہے جو کہ شرکِ اصغر ہے۔",
                "حدیث میں واضح کیا گیا کہ 'لیذکر' (تاکہ تذکرہ ہو) کا مقصد رکھنے والا فی سبیل اللہ نہیں۔",
                "مومن کا اجر اللہ کے پاس ہے، اسے دنیا کی واہ واہ کی ضرورت نہیں ہونی چاہیے۔"
              ],
              "english": [
                "Fighting to gain a reputation for bravery is hypocrisy, considered a minor Shirk.",
                "The Hadith clarifies that one seeking to be mentioned by people is not in Allah's cause.",
                "A believer's reward is with Allah; they should not crave worldly applause."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالِ غنیمت کی ہوس",
              "english": "Greed for Spoils of War"
            },
            "content": {
              "urdu": [
                "اگر لڑائی کا بنیادی مقصد صرف مال و دولت جمع کرنا ہو تو وہ جہاد نہیں رہتا۔",
                "اللہ کی راہ میں جان دینے والے کا سودا براہِ راست اللہ رب العزت سے ہوتا ہے۔",
                "دنیاوی مفاد کو پسِ پشت ڈال کر ہی اخروی کامیابی حاصل کی جا سکتی ہے۔"
              ],
              "english": [
                "If the primary goal of fighting is merely to collect wealth, it is no longer Jihad.",
                "The one who sacrifices their life in Allah's path strikes a deal directly with Allah.",
                "Success in the Hereafter is achieved by setting aside temporary worldly interests."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمانی اور معاشرتی اثرات",
        "english": "Faith and Social Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کردار سازی",
              "english": "Character Building"
            },
            "content": {
              "urdu": [
                "یہ تعلیم ایک مسلمان کو خود غرضی اور ذاتی مفادات سے بالا تر کرتی ہے۔",
                "اس سے معاشرے میں ایسے مخلص لوگ پیدا ہوتے ہیں جو اجتماعی مفاد کے لیے جیتے ہیں۔",
                "اخلاص کی بنیاد پر ہی امتِ مسلمہ کو دشمنوں پر غلبہ حاصل ہوتا ہے۔"
              ],
              "english": [
                "This teaching elevates a Muslim above selfishness and personal interests.",
                "It produces sincere individuals who live for the collective good of the community.",
                "The Muslim Ummah gains dominance over enemies through the foundation of sincerity."
              ]
            }
          },
          {
            "title": {
              "urdu": "سچی شہادت کی تڑپ",
              "english": "Longing for True Martyrdom"
            },
            "content": {
              "urdu": [
                "جب نیت خالص ہو تو میدانِ جنگ میں قدم بھی ثابت قدم رہتے ہیں۔",
                "موت کا خوف وہی ختم کر سکتا ہے جو اللہ کی محبت میں سرشار ہو۔",
                "اللہ کی راہ میں دی گئی جان ہی اصل زندگی کی ضامن ہے۔"
              ],
              "english": [
                "When the intention is pure, one's steps remain firm on the battlefield.",
                "Only the love of Allah can eliminate the fear of death.",
                "Life given in the path of Allah is the guarantee of true eternal life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہر کام میں نیت کی اصلاح",
              "english": "Reforming Intent in Every Task"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے روزمرہ کے کاموں میں بھی نیت کی جانچ پڑتال کرنی چاہیے۔",
                "خدمتِ خلق ہو یا عبادت، مقصد صرف اللہ کی خوشنودی ہونی چاہیے۔",
                "بغیر اخلاص کے بڑی سے بڑی قربانی بھی بے سود ہے۔"
              ],
              "english": [
                "We must constantly scrutinize our intentions even in daily tasks.",
                "Whether serving humanity or worshipping, the goal must be Allah's pleasure.",
                "Without sincerity, even the greatest sacrifice becomes fruitless."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی تشخص کا وقار",
              "english": "Dignity of Islamic Identity"
            },
            "content": {
              "urdu": [
                "دین کی خدمت کرتے وقت تواضع اور عاجزی اختیار کرنی چاہیے۔",
                "شہرت پسندی سے بچنا ہی مومن کا اصل کمال ہے۔",
                "اللہ ہمیں اپنے کلمے کی سربلندی کے لیے مخلصانہ کوشش کرنے کی توفیق دے۔"
              ],
              "english": [
                "Humility and modesty should be adopted while serving the religion.",
                "Avoiding the desire for fame is the true achievement of a believer.",
                "May Allah grant us the ability to strive sincerely for the supremacy of His Word."
              ]
            }
          }
        ]
      }
    }
  ]
}