{
  "hadithId": 905,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1041"],
    "kitabId": 8,
    "inKitabBab": 6,
    "arabicBook": "كتاب النكاح",
    "babId": 69
  },
  
  "takhreej": {
    "arabic": "ضعيف . رواه أبو داود (2134) ، والنسائي (3943) ، والترمذي (1140) ، وابن ماجه (1971) ، وابن حبان (1305) ، والحاكم (2/187) ، من طريق حماد بن سلمة ، عن أيوب ، عن أبي قلابة ، عن عبد الله بن يزيد ، عن عائشة . وأعله الترمذي وغيره بالإرسال.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے ابو داؤد (2134)، نسائی (3943)، ترمذی (1140) اور ابن ماجہ (1971) نے روایت کیا ہے۔ امام ترمذی اور دیگر ائمہ حدیث نے اسے مرسل (یعنی جس میں صحابی کا واسطہ گرا ہوا ہو) قرار دینے کو ترجیح دی ہے، جس کی وجہ سے اس کی سند میں ضعف ہے۔",
    "english": "Weak (Da'if). Reported by Abu Dawud (2134), An-Nasa'i (3943), At-Tirmidhi (1140), and Ibn Majah (1971). While Ibn Hibban and Al-Hakim graded it Sahih, At-Tirmidhi and other masters of Hadith preferred the view that it is Mursal, hence its weakness."
  },
  "importantWords": [
    {
      "arabic": "يَقْسِمُ",
      "english": "Divides/Distributes",
      "urdu": "تقسیم کرتا ہے"
    },
    {
      "arabic": "فَيَعْدِلُ",
      "english": "Acts justly",
      "urdu": "پس وہ عدل کرتا ہے"
    },
    {
      "arabic": "قَسْمِي",
      "english": "My division",
      "urdu": "میری تقسیم"
    },
    {
      "arabic": "تَلُمْنِي",
      "english": "Blame me",
      "urdu": "مجھے ملامت کر"
    },
    {
      "arabic": "أَمْلِكُ",
      "english": "I possess / I control",
      "urdu": "میں مالک ہوں / میرے بس میں ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ کثرتِ ازواج کی صورت میں ظاہری حقوق (نان و نفقہ، باری) میں عدل واجب ہے، لیکن قلبی میلان اور محبت میں برابری انسان کے بس میں نہیں ہے۔",
    "english": "This Hadith clarifies that while justice in external matters (spending, time) is obligatory between wives, equality in heart's inclination and love is beyond human control."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2134)",
      "english": "Reported by Abu Dawud (2134)"
    },
    {
      "arabic": "رواه الترمذي (1140)",
      "english": "Reported by At-Tirmidhi (1140)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYIq9vM-E7M",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عدل و انصاف کی اہمیت",
        "english": "Importance of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظاہری حقوق میں برابری",
              "english": "Equality in External Rights"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ اپنی ازواج کے درمیان رات گزارنے اور خرچ میں مکمل عدل فرماتے تھے۔",
                "اسلام میں ایک سے زائد شادیاں کرنے والوں پر عدل و انصاف کرنا فرض قرار دیا گیا ہے۔",
                "قیامت کے دن وہ شخص رسوا ہوگا جو ایک بیوی کی طرف جھک گیا اور دوسرے کا حق مارا۔"
              ],
              "english": [
                "The Prophet (ﷺ) was perfectly just in distributing nights and spending among his wives.",
                "In Islam, those who marry more than one wife are strictly obligated to maintain justice.",
                "A person who inclines towards one wife and neglects the other will be disgraced on Judgment Day."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی اسوہِ حسنہ",
              "english": "The Prophetic Example"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اپنی زندگی کے عمل سے ثابت کیا کہ عدل ہی خاندانی سکون کی بنیاد ہے۔",
                "حتیٰ کہ بیماری کی حالت میں بھی آپ ﷺ اپنی ازواج سے باری کی اجازت طلب فرماتے تھے۔",
                "یہ طرزِ عمل امت کے لیے ایک بہترین نمونہ ہے کہ حقوق کی ادائیگی میں کوتاہی نہ کی جائے۔"
              ],
              "english": [
                "The Prophet (ﷺ) proved through his life that justice is the foundation of family peace.",
                "Even during his illness, he sought permission from his wives regarding his stay.",
                "This conduct serves as a perfect model for the Ummah to never neglect rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انسانی اختیار اور قلبی میلان",
        "english": "Human Control and Heart's Inclination"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قلبی محبت پر عدم اختیار",
              "english": "No Control Over Emotional Love"
            },
            "content": {
              "urdu": [
                "کسی ایک بیوی سے زیادہ محبت ہونا ایک فطری امر ہے جو انسان کے بس میں نہیں ہوتا۔",
                "اللہ تعالیٰ نے قرآن میں واضح فرمایا ہے کہ تم دل سے عورتوں میں مکمل برابری نہیں کر سکو گے۔",
                "شریعت ان چیزوں پر گرفت نہیں کرتی جو انسانی قدرت اور اختیار سے باہر ہوں۔"
              ],
              "english": [
                "Loving one wife more than others is a natural feeling beyond human control.",
                "Allah stated in the Quran that you will never be able to be totally equal in heart's love.",
                "Shariah does not hold a person accountable for things beyond their power and will."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ سے عاجزی کا اظہار",
              "english": "Expressing Humility to Allah"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کی دعا اس بات کا اظہار تھی کہ بندہ ہر حال میں اللہ کی پکڑ سے ڈرتا رہے۔",
                "یہ دعا سکھاتی ہے کہ انسان اپنی بہترین کوشش کے بعد بھی اللہ کی رحمت کا محتاج ہے۔",
                "قلبی میلان کا مالک صرف اللہ ہے، وہی دلوں کو جس طرف چاہے پھیر دیتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) supplication showed that a servant must always fear Allah's reckoning.",
                "This prayer teaches that even after best efforts, man is dependent on Allah's mercy.",
                "Allah alone is the Controller of hearts; He turns them whichever way He wills."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کی علمی حیثیت",
              "english": "Scholarly Status of the Narration"
            },
            "content": {
              "urdu": [
                "اگرچہ اس روایت کی سند میں کلام ہے، لیکن اس کا مفہوم قرآنی آیات کے مطابق ہے۔",
                "علماء اس حدیث کو قلبی میلان اور ظاہری حقوق کے فرق کو سمجھانے کے لیے پیش کرتے ہیں۔",
                "اس سے یہ ثابت ہوتا ہے کہ محبت میں زیادتی گناہ نہیں بشرطیکہ حقوق پورے کیے جائیں۔"
              ],
              "english": [
                "Although the chain has some weakness, its meaning aligns with Quranic verses.",
                "Scholars cite this Hadith to explain the difference between heart's love and external rights.",
                "It proves that extra love is not a sin as long as all physical and financial rights are met."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاندانی نظم و ضبط",
              "english": "Family Discipline"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا اپنی تقسیم پر اللہ کو گواہ بنانا نظم و ضبط کی اعلیٰ مثال ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی ازدواجی زندگی میں شفافیت اور دیانتداری پیدا کریں۔",
                "حقوق کی منصفانہ تقسیم سے گھر میں حسد اور نفرت کا خاتمہ ہوتا ہے۔"
              ],
              "english": [
                "The Prophet taking Allah as witness for his division is a prime example of discipline.",
                "Muslims should strive to create transparency and honesty in their marital lives.",
                "Fair distribution of rights eliminates jealousy and hatred within the household."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lessons and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خود احتسابی کا جذبہ",
              "english": "Spirit of Self-Accountability"
            },
            "content": {
              "urdu": [
                "انسان کو ہر وقت یہ فکر ہونی چاہیے کہ وہ کسی کی حق تلفی تو نہیں کر رہا۔",
                "رسول اللہ ﷺ کی یہ دعا ہمیں اپنے اعمال کی مسلسل نگرانی کا سبق دیتی ہے۔",
                "اللہ کے سامنے جوابدہی کا احساس ہی انسان کو ناانصافی سے بچاتا ہے۔"
              ],
              "english": [
                "One should always worry whether they are infringing upon the rights of others.",
                "This prayer of the Prophet (ﷺ) teaches us to constantly monitor our own actions.",
                "The feeling of accountability before Allah is what prevents a person from injustice."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور توازن",
              "english": "Moderation and Balance"
            },
            "content": {
              "urdu": [
                "محبت اور حقوق کے درمیان توازن رکھنا ایک مومن کی کامیابی کی نشانی ہے۔",
                "جذبات کو قابو میں رکھ کر شرعی احکام پر عمل کرنا ہی اصل آزمائش ہے۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ اپنی حد تک کوشش کریں اور باقی اللہ پر چھوڑ دیں۔"
              ],
              "english": [
                "Maintaining balance between love and rights is a sign of a believer's success.",
                "Controlling emotions to follow Shariah rulings is the real test of faith.",
                "This Hadith teaches us to strive within our limits and leave the rest to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}