{
  "hadithId": 1235,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh:1235"],
    "kitabId": 15,
    "inKitabBab": 2,
    "arabicBook": "كتاب المكاتب",
    "babId": 101
  },
 
  "takhreej": {
    "arabic": "حسن بشواهده. رواه أحمد (3/487) والحاكم (2/218) وصححه، وله شاهد عند الترمذي (1655) من حديث أبي هريرة بلفظ قريب.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر حسن ہے۔ اسے امام احمد اور حاکم نے روایت کیا ہے۔ اگرچہ اس کی سند میں کلام ہے، لیکن ترمذی (1655) میں ابوہریرہ رضی اللہ عنہ سے اس کا صحیح شاہد موجود ہے۔",
    "english": "Hasan due to corroborating evidences. Reported by Ahmad (3/487) and Al-Hakim (2/218) who graded it Sahih. A supporting narration exists in At-Tirmidhi (1655) from Abu Hurairah."
  },
  "importantWords": [
    {
      "arabic": "أَعَانَ",
      "english": "Helped/Assisted",
      "urdu": "مدد کی"
    },
    {
      "arabic": "غَارِمًا",
      "english": "Debtor",
      "urdu": "مقروض"
    },
    {
      "arabic": "عُسْرَتِهِ",
      "english": "His difficulty/Hardship",
      "urdu": "اس کی تنگی"
    },
    {
      "arabic": "مُكَاتَبًا",
      "english": "Contracted slave",
      "urdu": "آزادی کا معاہدہ کرنے والا غلام"
    },
    {
      "arabic": "أَظَلَّهُ",
      "english": "Will shade him",
      "urdu": "اسے سایہ دے گا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مجاہدین، مقروض افراد اور غلاموں کی مالی مدد کرنے کی عظیم فضیلت بیان کی گئی ہے کہ ایسا کرنے والا قیامت کی ہولناکی میں اللہ کے سائے میں ہوگا۔",
    "english": "This Hadith highlights the immense reward for assisting Mujahideen, debtors, and slaves, stating that those who help them will receive Allah's shade on Judgment Day."
  },
  "references": [
    {
      "arabic": "رواه أحمد (15979)",
      "english": "Reported by Ahmad (15979)"
    },
    {
      "arabic": "رواه الحاكم (2742)",
      "english": "Reported by Al-Hakim (2742)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سهل بن حنيف",
        "english": "Sahl bin Hunaif"
      },
      "slug": "sahl-bin-hunaif"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "حسن لغيره",
    "english": "Hasan Lighairihi"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انسانی ہمدردی اور تعاون",
        "english": "Compassion and Cooperation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مجاہد کی اعانت",
              "english": "Assisting the Mujahid"
            },
            "content": {
              "urdu": [
                "دین کے دفاع کے لیے نکلنے والے مجاہد کی مدد کرنا خود جہاد کے برابر ہے۔",
                "اس کی ضروریات اور پیچھے رہ جانے والے اہل و عیال کی کفالت عظیم نیکی ہے۔",
                "یہ عمل امت میں شجاعت اور ایثار کے جذبے کو پروان چڑھاتا ہے۔"
              ],
              "english": [
                "Supporting those who strive for the defense of faith is equivalent to Jihad.",
                "Caring for their needs and their families left behind is a great virtue.",
                "This act fosters the spirit of bravery and sacrifice within the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقروض کی تنگی دور کرنا",
              "english": "Relieving the Debtor"
            },
            "content": {
              "urdu": [
                "قرض تلے دبے ہوئے شخص کی مدد کرنا اسے معاشی موت سے بچانا ہے۔",
                "تنگ دست مقروض کو مہلت دینا یا اس کا بوجھ بانٹنا اللہ کو نہایت پسند ہے۔",
                "یہ عمل معاشرے میں معاشی عدل اور بھائی چارے کو مضبوط کرتا ہے۔"
              ],
              "english": [
                "Helping a debt-ridden person saves them from economic despair.",
                "Giving more time to a debtor or sharing their burden is beloved to Allah.",
                "This practice strengthens economic justice and brotherhood in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلامی کا خاتمہ اور اجر",
        "english": "Ending Slavery and its Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مکاتب کی مدد",
              "english": "Helping the Mukatab"
            },
            "content": {
              "urdu": [
                "مکاتب وہ غلام ہے جو اپنی آزادی کے لیے مالک کو رقم دینے کا وعدہ کرتا ہے۔",
                "اسے رقم کی ادائیگی میں تعاون فراہم کرنا اسے انسانی حقوق واپس دلانا ہے۔",
                "اسلام نے غلامی کے نظام کو ختم کرنے کے لیے ایسی نیکیوں کی ترغیب دی۔"
              ],
              "english": [
                "A Mukatab is a slave who promises money to his master for his freedom.",
                "Assisting him in his payment helps him reclaim his fundamental rights.",
                "Islam encouraged such deeds to progressively abolish the system of slavery."
              ]
            }
          },
          {
            "title": {
              "urdu": "عرش کا سایہ",
              "english": "Shade of the Throne"
            },
            "content": {
              "urdu": [
                "قیامت کے دن سورج قریب ہوگا اور لوگ سخت تکلیف اور پسینے میں ہوں گے۔",
                "ایسے میں ان نیکیوں کے بدلے اللہ بندے کو اپنے عرش کا سایہ عطا فرمائے گا۔",
                "یہ سایہ ان لوگوں کے لیے خاص ہے جو دنیا میں دوسروں کے لیے سایہ بنے۔"
              ],
              "english": [
                "On Judgment Day, the sun will be close, and people will be in severe distress.",
                "In exchange for these deeds, Allah will grant the servant His Throne's shade.",
                "This shade is reserved for those who were a source of comfort for others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فلاح",
        "english": "Social Welfare"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایثار اور ہمدردی",
              "english": "Sacrifice and Empathy"
            },
            "content": {
              "urdu": [
                "حدیث ہمیں دوسروں کی پریشانیوں کو محسوس کرنے کا درس دیتی ہے۔",
                "مومن وہی ہے جو دوسرے کی ضرورت کو اپنی ضرورت پر ترجیح دے۔",
                "سماجی تعاون سے معاشرہ فتنہ و فساد اور غربت سے پاک ہوتا ہے۔"
              ],
              "english": [
                "The Hadith teaches us to feel and address the hardships of others.",
                "A true believer prioritizes the needs of others over their own desires.",
                "Social cooperation purifies society from discord, conflict, and poverty."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیکی میں تنوع",
              "english": "Diversity in Piety"
            },
            "content": {
              "urdu": [
                "اسلام صرف نماز روزے کا نام نہیں بلکہ حقوق العباد کی ادائیگی کا بھی نام ہے۔",
                "مالی عبادات روحانی ترقی کے لیے اتنی ہی اہم ہیں جتنی بدنی عبادات۔",
                "ہر فرد اپنی حیثیت کے مطابق ان نیک کاموں میں حصہ لے سکتا ہے۔"
              ],
              "english": [
                "Islam is not just rituals; it is also about fulfilling the rights of others.",
                "Financial worship is as vital for spiritual growth as physical worship.",
                "Every individual can participate in these noble acts according to their means."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستحقین کی تلاش",
              "english": "Searching for Deserving People"
            },
            "content": {
              "urdu": [
                "اپنے اردگرد مقروض اور ضرورت مند لوگوں کی خبر گیری رکھیں۔",
                "دکھاوے کے بغیر خاموشی سے دوسروں کی مالی مدد کرنے کی عادت ڈالیں۔",
                "خالص اللہ کی رضا کے لیے خرچ کرنا ہی اصل سوداگری ہے۔"
              ],
              "english": [
                "Keep track of debtors and needy people within your social circle.",
                "Cultivate the habit of helping others financially without any ostentation.",
                "Spending purely for Allah's pleasure is the ultimate successful trade."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی فکر",
              "english": "Concern for the Hereafter"
            },
            "content": {
              "urdu": [
                "دنیا کی آسائشوں کے مقابلے میں آخرت کے سائے کی طلب رکھیں۔",
                "آج کسی کی تنگی دور کریں گے تو کل اللہ آپ کی تنگی دور فرمائے گا۔",
                "ہر وہ عمل کریں جو قیامت کی ہولناکی سے بچانے والا ہو۔"
              ],
              "english": [
                "Seek the shade of the Hereafter over the luxuries of this world.",
                "If you relieve someone's hardship today, Allah will relieve yours tomorrow.",
                "Engage in every deed that serves as a protection from Judgment Day's terrors."
              ]
            }
          }
        ]
      }
    }
  ]
}