{
  "hadithId": 1000,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1150"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (4 /438)‏، وأبو داود (4590)‏، والنسائي (4736)‏، وابن ماجه (2660).‏ وإسناده صحيح على شرط مسلم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، نسائی اور ابن ماجہ نے روایت کیا ہے۔ اس کی سند صحیح مسلم کی شرط پر صحیح ہے۔",
    "english": "Sahih (Authentic). Reported by Ahmad (4/438), Abu Dawud (4590), An-Nasa'i (4736), and Ibn Majah (2660). Its chain is Sahih according to the criteria of Imam Muslim."
  },
  "importantWords": [
    {
      "arabic": "غُلَامًا",
      "english": "Slave / Servant",
      "urdu": "غلام / نوکر"
    },
    {
      "arabic": "فُقَرَاءَ",
      "english": "Poor people",
      "urdu": "فقراء / غریب لوگ"
    },
    {
      "arabic": "أَغْنِيَاءَ",
      "english": "Rich people",
      "urdu": "امراء / مالدار لوگ"
    },
    {
      "arabic": "قَطَعَ",
      "english": "Cut off",
      "urdu": "کاٹ دیا"
    },
    {
      "arabic": "أُذُنَ",
      "english": "Ear",
      "urdu": "کان"
    },
    {
      "arabic": "شَيْئًا",
      "english": "Anything",
      "urdu": "کچھ بھی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں غریب مالکوں کے غلام کی طرف سے پہنچنے والے نقصان کی تلافی یا قصاص کے حوالے سے ایک مخصوص عدالتی فیصلے کا ذکر ہے جہاں حالات کی بنا پر کوئی مالی جرمانہ عائد نہیں کیا گیا۔",
    "english": "This Hadith mentions a specific judicial ruling regarding a slave of poor owners who caused injury, where no compensation was ordered due to certain circumstantial or financial factors."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4590)",
      "english": "Sunan Abu Dawud (4590)"
    },
    {
      "arabic": "سنن النسائي (4736)",
      "english": "Sunan An-Nasa'i (4736)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمران بن حصين",
        "english": "Imran bin Husain"
      },
      "slug": "imran-bin-husain"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عدالتی فیصلہ اور حالات",
        "english": "Judicial Decision and Circumstances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی عدم استطاعت",
              "english": "Financial Inability"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فقراء کے غلام پر کوئی مالی جرمانہ (دیت) عائد نہیں فرمایا۔",
                "فقہاء کے مطابق جب مجرم یا اس کے عاقلہ (قبیلہ) کے پاس دینے کو کچھ نہ ہو تو سختی نہیں کی جاتی۔",
                "یہ فیصلہ اسلامی انصاف میں معاشی حالات کو مدنظر رکھنے کی ایک مثال ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not impose any financial penalty (Diyat) on the poor people's slave.",
                "According to jurists, when the perpetrator or their kin have no means to pay, harshness is avoided.",
                "This ruling is an example of considering economic conditions in Islamic justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "قصاص کے بجائے عفو",
              "english": "Pardon Instead of Retaliation"
            },
            "content": {
              "urdu": [
                "کچھ شارحین کے مطابق یہ ایک معمولی نوعیت کا زخم تھا جس میں قصاص نہیں تھا۔",
                "نبی ﷺ نے فریقین کے درمیان صلح کروا دی یا معافی کی ترغیب دی۔",
                "اسلامی ریاست میں حاکم کو صلح اور عفو و درگزر کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "Some commentators suggest this was a minor injury where retaliation (Qisas) didn't apply.",
                "The Prophet (ﷺ) facilitated reconciliation or encouraged forgiveness between parties.",
                "In an Islamic state, the ruler should strive for peace and mutual pardon."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلاموں کے افعال کی ذمہ داری",
        "english": "Responsibility for Slaves' Actions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالک کی معاشی حیثیت",
              "english": "Financial Status of the Owner"
            },
            "content": {
              "urdu": [
                "حدیث میں 'فقراء' اور 'اغنیاء' کی تمیز مخصوص سماجی پس منظر کو ظاہر کرتی ہے۔",
                "اگر غلام جرم کرے تو اس کا بوجھ اکثر مالک پر آتا ہے، مگر یہاں وہ استطاعت نہیں رکھتے تھے۔",
                "اسلامی قانون کسی شخص پر اس کی وسعت سے زیادہ بوجھ نہیں ڈالتا۔"
              ],
              "english": [
                "The distinction between 'poor' and 'rich' in the Hadith highlights a social context.",
                "If a slave commits a crime, the liability often falls on the owner, but here they lacked means.",
                "Islamic law does not burden a person beyond their capacity."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانونِ جنایات",
              "english": "Criminal Law (Jinayat)"
            },
            "content": {
              "urdu": [
                "اعضاء کے کاٹنے کے احکام میں دیت کی مقدار شرعاً مقرر ہے۔",
                "تاہم، مخصوص حالات میں قاضی کو جرمانہ معاف کرنے یا ملتوی کرنے کا اختیار ہے۔",
                "یہ حدیث فقہ کے پیچیدہ مسائل میں ایک اہم نظیر (Precedent) فراہم کرتی ہے۔"
              ],
              "english": [
                "The rulings on mutilation have prescribed amounts of blood-money (Diyat) in Shariah.",
                "However, in specific cases, a judge has the authority to waive or delay fines.",
                "This Hadith provides an important precedent in complex juristic matters."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی معاشرت اور مساوات",
        "english": "Islamic Society and Equality"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امراء کا عدالت آنا",
              "english": "Rich People Approaching Court"
            },
            "content": {
              "urdu": [
                "امراء کا نبی ﷺ کے پاس آنا ظاہر کرتا ہے کہ وہ انصاف کے لیے قانون کے پابند تھے۔",
                "اسلام میں کوئی بھی شخص چاہے کتنا ہی امیر ہو، قانون سے بالا تر نہیں ہے۔",
                "عدالتِ نبوی میں غریب اور امیر کے درمیان کوئی امتیاز نہیں برتا گیا۔"
              ],
              "english": [
                "The rich people coming to the Prophet (ﷺ) shows they were bound by law for justice.",
                "In Islam, no person, regardless of wealth, is above the law.",
                "In the Prophetic court, no discrimination was practiced between the poor and the rich."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی ہمدردی",
              "english": "Human Sympathy"
            },
            "content": {
              "urdu": [
                "غریبوں کے ساتھ نرمی برتنا اسلامی معاشرت کا حسن ہے۔",
                "ایسے فیصلے معاشرے میں طبقہ وارانہ کشمکش کو کم کرنے میں مددگار ہوتے ہیں۔",
                "نبی ﷺ کی رحمت تمام طبقات کے لیے یکساں تھی۔"
              ],
              "english": [
                "Showing leniency towards the poor is a beauty of Islamic social conduct.",
                "Such decisions help reduce class conflict within society.",
                "The mercy of the Prophet (ﷺ) was uniform for all social classes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمتِ عملی",
              "english": "Strategic Wisdom"
            },
            "content": {
              "urdu": [
                "قاضی کو فیصلے کے وقت صرف متن نہیں بلکہ زمینی حقائق بھی دیکھنے چاہییں۔",
                "صلح کروانا قانونی سزا دینے سے بعض اوقات زیادہ بہتر نتائج دیتا ہے۔",
                "اسلامی قانون کا مقصد انتقام نہیں بلکہ معاشرتی اصلاح ہے۔"
              ],
              "english": [
                "A judge must consider ground realities, not just the text, when making decisions.",
                "Facilitating peace sometimes yields better results than imposing legal penalties.",
                "The objective of Islamic law is social reform, not mere vengeance."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی پامالی سے بچنا",
              "english": "Avoiding Violation of Rights"
            },
            "content": {
              "urdu": [
                "غلاموں کی لڑائی میں بھی مالکوں کو عدل کا دامن نہیں چھوڑنا چاہیے۔",
                "کسی کو معاشی طور پر تباہ کر دینا انصاف کا مقصد نہیں ہونا چاہیے۔",
                "یہ حدیث ہمیں باہمی رواداری اور درگزر کا سبق دیتی ہے۔"
              ],
              "english": [
                "Even in fights between slaves, owners must not abandon justice.",
                "Destroying someone financially should not be the purpose of justice.",
                "This Hadith teaches us mutual tolerance and the spirit of overlooking faults."
              ]
            }
          }
        ]
      }
    }
  ]
}