{
  "hadithId": 1071,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/10/100"],
    "kitabId": 10,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحدود",
    "babId": 87
  },

  "takhreej": {
    "arabic": "صحيح. رواه أحمد (14704)، وأبو داود (3681)، والترمذي (1865)، وابن ماجه (3393)، وابن حبان (5358). وسنده حسن وله شواهد تقويه.",
    "urdu": "صحیح۔ اسے احمد (14704)، ابوداؤد (3681)، ترمذی (1865)، اور ابن ماجہ (3393) نے روایت کیا ہے۔ ابن حبان نے اسے صحیح کہا ہے، اس کی سند حسن ہے اور دیگر شواہد سے یہ صحیح کے درجے تک پہنچتی ہے۔",
    "english": "Sahih. Reported by Ahmad (14704), Abu Dawud (3681), At-Tirmidhi (1865), Ibn Majah (3393), and Ibn Hibban (5358). Its chain is Hasan and it has corroborating narrations that elevate it to Sahih."
  },
  "importantWords": [
    {
      "arabic": "أَسْكَرَ",
      "english": "Intoxicates",
      "urdu": "نشہ لائے"
    },
    {
      "arabic": "كَثِيرُهُ",
      "english": "Its large quantity",
      "urdu": "اس کی زیادہ مقدار"
    },
    {
      "arabic": "فَقَلِيلُهُ",
      "english": "Its small quantity",
      "urdu": "تو اس کی تھوڑی مقدار"
    },
    {
      "arabic": "حَرَامٌ",
      "english": "Forbidden",
      "urdu": "حرام ہے"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Extracted/Reported it",
      "urdu": "اسے روایت کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نشہ آور اشیاء کے حوالے سے ایک اصولی قاعدہ بیان کیا گیا ہے کہ اگر کسی چیز کے زیادہ استعمال سے نشہ ہوتا ہے، تو اس کا ایک قطرہ یا تھوڑی سی مقدار لینا بھی شرعاً حرام ہے۔",
    "english": "This Hadith establishes a fundamental principle: if a substance causes intoxication when consumed in large amounts, then even a tiny amount of it is strictly prohibited."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3681)",
      "english": "Narrated by Abu Dawud (3681)"
    },
    {
      "arabic": "رواه الترمذي (1865)",
      "english": "Narrated by At-Tirmidhi (1865)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0SjGv7vI8k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نشہ آور اشیاء کا اصولی حکم",
        "english": "The Core Ruling on Intoxicants"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قلیل اور کثیر کا فرق",
              "english": "Distinction between Small and Large Amounts"
            },
            "content": {
              "urdu": [
                "شریعت نے نشہ آور چیز کی مقدار کو نہیں بلکہ اس کی حقیقت کو حرام قرار دیا ہے۔",
                "اگر کوئی یہ کہے کہ تھوڑی مقدار سے نشہ نہیں ہوتا، تو بھی وہ قطعی طور پر حرام ہے۔",
                "یہ قاعدہ انسان کو نشے کی لت میں پڑنے سے پہلے ہی روکنے کے لیے ایک ڈھال ہے۔"
              ],
              "english": [
                "Sharia forbids the essence of an intoxicant regardless of the quantity consumed.",
                "Even if someone claims a small amount doesn't cause drunkenness, it remains strictly Harām.",
                "This principle acts as a shield, preventing people from falling into addiction."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذریعہء حرام بھی حرام ہے",
              "english": "The Means to Haram is Haram"
            },
            "content": {
              "urdu": [
                "تھوڑی مقدار کا استعمال آہستہ آہستہ زیادہ مقدار اور نشے کی عادت کی طرف لے جاتا ہے۔",
                "اسلام گناہ کے راستوں کو بند کرنے (سدِ ذرائع) کے اصول پر سختی سے عمل کرتا ہے۔",
                "اس حکم سے ہر وہ مشروب یا مادہ حرام ہو جاتا ہے جس میں نشہ آور اجزاء پائے جائیں۔"
              ],
              "english": [
                "Consuming small amounts gradually leads to larger quantities and habitual addiction.",
                "Islam strictly follows the principle of 'blocking the means' to prevent sins.",
                "This ruling prohibits any drink or substance that contains intoxicating properties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور طبی اسباق",
        "english": "Juristic and Medical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملاوٹ اور آمیزش",
              "english": "Adulteration and Mixtures"
            },
            "content": {
              "urdu": [
                "اگر کسی حلال مشروب میں نشہ آور چیز ملا دی جائے، تو وہ پورا مشروب حرام ہو جائے گا۔",
                "موجودہ دور کی غذائی مصنوعات میں اس اصول کا اطلاق بہت اہمیت رکھتا ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اجزاء (ingredients) کی تحقیق کر کے مشکوک چیزوں سے بچیں۔"
              ],
              "english": [
                "If an intoxicant is mixed into a lawful drink, the entire mixture becomes prohibited.",
                "This principle is highly relevant for evaluating modern processed food products.",
                "Muslims should investigate ingredients and avoid substances that are doubtful."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی ضرورت اور استثناء",
              "english": "Medical Necessity and Exceptions"
            },
            "content": {
              "urdu": [
                "ادویات میں الکحل کا استعمال صرف اس وقت جائز ہے جب کوئی دوسرا متبادل نہ ہو۔",
                "اس کے لیے مستند ڈاکٹر اور مفتیانِ کرام کی رہنمائی حاصل کرنا ضروری ہے۔",
                "تاہم، محض تفریح یا ذائقے کے لیے ایسی چیزوں کا استعمال کسی صورت جائز نہیں۔"
              ],
              "english": [
                "Using alcohol in medicine is only permitted when no viable alternative exists.",
                "Guidance from reliable doctors and scholars is necessary in such specific cases.",
                "However, using such substances for leisure or taste is never permissible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reformation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سماجی برائیوں کا خاتمہ",
              "english": "Eliminating Social Evils"
            },
            "content": {
              "urdu": [
                "نشہ معاشرتی تباہی، گھریلو جھگڑوں اور حادثات کی سب سے بڑی وجہ ہے۔",
                "اسلامی معاشرے کو پاکیزہ رکھنے کے لیے نشے کی ہر سطح پر ممانعت کی گئی ہے۔",
                "جب لوگ تھوڑی مقدار سے بھی بچیں گے تو معاشرہ بڑی تباہی سے محفوظ رہے گا۔"
              ],
              "english": [
                "Intoxication is a leading cause of social destruction, domestic disputes, and accidents.",
                "Prohibition is enforced at all levels to maintain the purity of Islamic society.",
                "When people avoid even small amounts, society remains safe from greater calamities."
              ]
            }
          },
          {
            "title": {
              "urdu": "نئی نسل کی تربیت",
              "english": "Training the New Generation"
            },
            "content": {
              "urdu": [
                "نوجوانوں کو یہ سمجھانا ضروری ہے کہ 'صرف ایک بار' یا 'تھوڑی سی' بھی حرام ہے۔",
                "یہ حدیث واضح کرتی ہے کہ گناہ کی شروعات ہمیشہ چھوٹی چیز سے ہی ہوتی ہے۔",
                "والدین کو بچوں کے کھانے پینے کی عادات پر گہری نظر رکھنی چاہیے۔"
              ],
              "english": [
                "It's vital to teach youth that even 'just once' or 'a little' is strictly Harām.",
                "This Hadith clarifies that the path to sin often begins with something small.",
                "Parents must keep a close watch on their children's dietary and social habits."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقلی اور ایمانی فائدہ",
        "english": "Intellectual and Spiritual Benefit"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عقل کی حفاظت",
              "english": "Protection of the Intellect"
            },
            "content": {
              "urdu": [
                "عقل اللہ کی طرف سے امانت ہے، اسے نشے سے دھندلانا امانت میں خیانت ہے۔",
                "ہوش و حواس میں رہنا اللہ کی بندگی اور ذکر کے لیے بنیادی شرط ہے۔",
                "نشہ انسان کو اللہ کی یاد سے غافل اور شیطان کا آلہء کار بنا دیتا ہے۔"
              ],
              "english": [
                "Intellect is a trust from Allah; clouding it with intoxicants is a betrayal of that trust.",
                "Remaining conscious and alert is a prerequisite for worship and Dhikr.",
                "Intoxication makes one forget Allah and turns them into a tool for Satan."
              ]
            }
          },
          {
            "title": {
              "urdu": "پرہیزگاری کا معیار",
              "english": "Standard of Piety"
            },
            "content": {
              "urdu": [
                "ایک سچا مومن ہر اس چیز سے بچتا ہے جس میں اللہ کی ناراضگی کا شبہ ہو۔",
                "تھوڑی سی مقدار کو معمولی سمجھنا تقویٰ کے خلاف ہے۔",
                "اللہ کے احکامات کی مکمل اطاعت ہی انسانیت کی فلاح کا واحد راستہ ہے۔"
              ],
              "english": [
                "A true believer avoids everything that carries a suspicion of Allah's displeasure.",
                "Regarding a small quantity as insignificant is contrary to true piety.",
                "Complete obedience to Allah's commands is the only path to human success."
              ]
            }
          }
        ]
      }
    }
  ]
}