{
  "hadithId": 665,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:1528a"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح مسلم (1528)، كتاب البيوع، باب بطلان بيع المبيع قبل القبض.",
    "urdu": "صحیح مسلم (1528)، کتاب البیوع، باب: قبضہ کرنے سے پہلے فروخت کرنے کا باطل ہونا۔",
    "english": "Sahih Muslim (1528), The Book of Transactions, Chapter: The invalidity of selling goods before taking possession of them."
  },
  "importantWords": [
    {
      "arabic": "اِشْتَرَى",
      "english": "Bought / Purchased",
      "urdu": "خریدا"
    },
    {
      "arabic": "طَعَاماً",
      "english": "Food / Grain",
      "urdu": "غلہ / اناج"
    },
    {
      "arabic": "يَبِعْهُ",
      "english": "Sell it",
      "urdu": "اسے فروخت کرے"
    },
    {
      "arabic": "يَكْتَالَهُ",
      "english": "Measures it",
      "urdu": "اسے ناپ لے"
    },
    {
      "arabic": "الْقَبْضُ",
      "english": "Possession",
      "urdu": "قبضہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا اصل مقصد یہ ہے کہ جب تک خریدار خریدی ہوئی چیز پر مکمل قبضہ نہ کر لے، اسے آگے فروخت کرنا جائز نہیں۔",
    "english": "The primary objective of this Hadith is that it is not permissible for a buyer to resell a commodity until they have taken full possession of it."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1528)",
      "english": "Sahih Muslim (1528)"
    },
    {
      "arabic": "فتح الباري شرح صحيح البخاري",
      "english": "Fath al-Bari Sharh Sahih al-Bukhari"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبضہ کی اہمیت",
        "english": "Significance of Possession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملکیت کا مکمل ہونا",
              "english": "Completing Ownership"
            },
            "content": {
              "urdu": [
                "صرف سودا کر لینا کافی نہیں بلکہ سامان کو اپنی تحویل میں لینا ضروری ہے۔",
                "اناج یا غلے کے معاملے میں ناپ تول قبضہ مکمل ہونے کی علامت ہے۔",
                "جب تک چیز خریدار کے قبضے میں نہ آئے، اس کا نفع و نقصان اس کے ذمے نہیں ہوتا۔"
              ],
              "english": [
                "Mere agreement is not enough; one must take the goods into their physical custody.",
                "In the case of grain or food, measuring it signifies the completion of possession.",
                "Until the item is in the buyer's possession, they are not liable for its profit or loss."
              ]
            }
          },
          {
            "title": {
              "urdu": "دھوکہ دہی کا سدِ باب",
              "english": "Preventing Deception"
            },
            "content": {
              "urdu": [
                "بغیر قبضے کے فروخت سے بازار میں خیالی اور فرضی کاروبار کو فروغ ملتا ہے۔",
                "ناپنے سے مقدار واضح ہو جاتی ہے جس سے بعد میں جھگڑے کا امکان ختم ہو جاتا ہے۔",
                "اسلامی شریعت تجارت میں شفافیت اور وضاحت کو لازمی قرار دیتی ہے۔"
              ],
              "english": [
                "Selling without possession leads to speculative and superficial business practices.",
                "Measuring clarifies the exact quantity, eliminating the possibility of future disputes.",
                "Islamic Sharia mandates transparency and clarity in all commercial transactions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کیا یہ حکم صرف کھانے کے لیے ہے؟",
              "english": "Does this only apply to food?"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک کسی بھی چیز کو قبضے سے پہلے بیچنا جائز نہیں۔",
                "امام ابوحنیفہ کے نزدیک صرف منقولہ اشیاء (جو منتقل ہو سکیں) میں قبضہ شرط ہے۔",
                "حدیث میں غلے کا ذکر اس وقت کی عام ضرورت کی وجہ سے بطور مثال ہے۔"
              ],
              "english": [
                "According to Imam Shafi'i, reselling anything before possession is impermissible.",
                "Imam Abu Hanifa views possession as a condition specifically for movable assets.",
                "The mention of grain in the Hadith serves as an example due to the common needs of that time."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبضہ حاصل کرنے کا طریقہ",
              "english": "Methods of Taking Possession"
            },
            "content": {
              "urdu": [
                "جو چیز ناپ کر بکتی ہے اس کا قبضہ ناپنے (کیل) سے ہوتا ہے۔",
                "جو تول کر بکتی ہے اس کا قبضہ وزن کرنے سے مکمل ہوتا ہے۔",
                "دیگر اشیاء میں قبضہ ان کو اٹھانے یا جگہ تبدیل کرنے سے مانا جاتا ہے۔"
              ],
              "english": [
                "Possession of items sold by volume is attained through measuring (Kayl).",
                "Possession of items sold by mass is completed through weighing.",
                "For other goods, possession is recognized by taking them or moving them from their spot."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی فوائد",
        "english": "Economic Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مصنوعی مہنگائی کا خاتمہ",
              "english": "Eliminating Artificial Inflation"
            },
            "content": {
              "urdu": [
                "قبضہ کی شرط سے اشیاء کا بازار میں گردش کرنا یقینی ہو جاتا ہے۔",
                "کاغذی کارروائی کے ذریعے قیمتیں بڑھانے کے عمل پر روک لگتی ہے۔",
                "حقیقی خریدار اور بیچنے والے کے درمیان براہِ راست تعلق پیدا ہوتا ہے۔"
              ],
              "english": [
                "The condition of possession ensures the actual circulation of goods in the market.",
                "It prevents the practice of inflating prices through mere paperwork or speculation.",
                "It creates a direct and meaningful link between the actual buyer and seller."
              ]
            }
          },
          {
            "title": {
              "urdu": "کاروباری اخلاقیات",
              "english": "Business Ethics"
            },
            "content": {
              "urdu": [
                "یہ حکم مسلمانوں کو غیر یقینی (Gharar) سے بچنے کی تربیت دیتا ہے۔",
                "اس سے معاشرے میں اعتماد کی فضا برقرار رہتی ہے۔",
                "محنت اور حقیقی تبادلے پر مبنی رزق میں برکت ہوتی ہے۔"
              ],
              "english": [
                "This ruling trains Muslims to avoid uncertainty (Gharar) in their dealings.",
                "It helps maintain an atmosphere of trust within the business community.",
                "Wealth earned through genuine effort and real exchange carries divine blessing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور میں اطلاق",
        "english": "Application in the Modern Era"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسٹاک ایکسچینج اور آن لائن ٹریڈنگ",
              "english": "Stock Exchange and Online Trading"
            },
            "content": {
              "urdu": [
                "بغیر ڈلیوری لیے حصص (Shares) کو آگے بیچنا اس حدیث کی روشنی میں مشتبہ ہے۔",
                "جدید ڈیجیٹل قبضے کی صورتیں بھی اب فقہاء کے زیرِ بحث ہیں۔",
                "بنیادی اصول وہی ہے کہ نفع کمانے کے لیے رسک (Risk) اور قبضہ ضروری ہے۔"
              ],
              "english": [
                "Selling shares without taking delivery is questionable in light of this Hadith.",
                "Modern forms of digital possession are now being discussed by contemporary jurists.",
                "The core principle remains: risk and possession are essential for earning profit."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "اسلامی معاشیات محض نفع خوری نہیں بلکہ عدل پر مبنی ہے۔",
                "ناپ تول میں احتیاط سنتِ نبوی کا لازمی حصہ ہے۔",
                "مسلمان تاجر کو چاہیے کہ وہ مال اپنی تحویل میں آنے کے بعد ہی سودا کرے۔"
              ],
              "english": [
                "Islamic economics is not just about profiteering but is rooted in justice.",
                "Caution in measuring and weighing is an essential part of the Prophetic Sunnah.",
                "A Muslim merchant should only enter a deal after the goods are in their custody."
              ]
            }
          }
        ]
      }
    }
  ]
}