{
  "hadithId": 62,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 1 (Chapter 6)"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب نواقض الوضوء من النوم",
    "babId": 6
  },

  "takhreej": {
    "arabic": " صحيح.  مسلم ( 376 )  ولفظه: كان أصحاب رسول الله صلى الله عليه وسلم ينامون.  ثم يصلون ولا يتوضأون .  وله روايات أخرى ذكرتها \"بالأصل\"صحيح . رواه أبو داود (200) ، والدارقطني (1/131/3)  وقال الدار قطني: صحيح ",
    "urdu": "صحیح (درجہ)۔ مسلم (376) کا لفظ ہے: 'رسول اللہ صلی اللہ علیہ وسلم کے صحابہ سو جاتے، پھر نماز پڑھتے اور وضو نہیں کرتے تھے۔' ابوداؤد (200) نے روایت کیا ہے اور دارقطنی (1/131/3) نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Muslim (376) with the wording: 'The Companions of the Messenger of Allah (ﷺ) used to sleep, then they would pray without performing Wudu.' Also narrated by Abu Dawud (200) and Ad-Dāraquṭnī (1/131/3), who authenticated it as Sahih."
  },
  "importantWords": [
    {
      "arabic": "يَنْتَظِرُونَ اَلْعِشَاءَ",
      "english": "Used to wait for Ishā' (prayer)",
      "urdu": "نماز عشاء کا انتظار کرتے"
    },
    {
      "arabic": "تَخْفِقَ رُؤُوسُهُمْ",
      "english": "Their heads would droop/nod",
      "urdu": "ان کے سر جھک جاتے"
    },
    {
      "arabic": "يُصَلُّونَ",
      "english": "They would pray",
      "urdu": "نماز پڑھ لیتے"
    },
    {
      "arabic": "لَا  يَتَوَضَّئُونَ",
      "english": "They would not perform Wudu",
      "urdu": "وضو نہیں کرتے"
    },
    {
      "arabic": "عَهْدِهِ",
      "english": "His era/time",
      "urdu": "عہدرسالت مآب"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس فقہی اصول کو بیان کرتی ہے کہ **ہلکی، بیٹھے ہوئے کی نیند** جو انسان کی جسمانی حالت پر قابو نہ پائے، وہ وضو کو نہیں توڑتی، اگرچہ سر جھک جائے، کیونکہ وضو ٹوٹنے کا سبب گہری نیند ہے جو حواس کو ختم کر دے۔",
    "english": "This Hadith establishes the legal principle that **light sleep while sitting**, which does not completely overcome one's senses, does not invalidate Wudu, even if the head nods, because it is not the deep sleep that causes the Wudu to break."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الحيض، رقم 376",
      "english": "Sahih Muslim, The Book of Menstruation, Hadith 376"
    },
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 200",
      "english": "Sunan Abī Dāwūd, The Book of Purification, Hadith 200"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَنَسُ بْنُ مَالِكٍ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Anas ibn Mālik (May Allah be pleased with him)"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-40-sleep-and-wudu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نیند کا حکم اور وضو کا ٹوٹنا",
        "english": "The Ruling on Sleep and Wudu Invalidation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نوم (نیند) کی اقسام",
              "english": "Categories of Sleep (Nawm)"
            },
            "content": {
              "urdu": [
                "اس حدیث کا بنیادی اصول یہ ہے کہ نیند بذات خود وضو کو نہیں توڑتی، بلکہ نیند کے دوران انسان کا اپنے حواس پر قابو کھو دینا وضو کے ٹوٹنے کا سبب ہے۔",
                "صحابہ کرامؓ کی اس نیند کو **ہلکی نیند (نوم یسیر)** قرار دیا گیا ہے، جو بیٹھنے کی حالت میں ہو اور نیند کے غلبے سے سر جھک جائے مگر انسان ہوش میں ہو یا جلد بیدار ہو جائے۔",
                "جمہور فقہاء کے نزدیک، جو نیند انسان کے حواس پر مکمل غلبہ پا کر اس کے جسم کو ڈھیلا کر دے، وہ وضو کو توڑ دیتی ہے (کیونکہ ریح خارج ہونے کا امکان ہوتا ہے)۔"
              ],
              "english": [
                "The basic principle of this Hadith is that sleep itself does not invalidate Wudu; rather, it is the loss of control over one's senses during sleep that breaks it.",
                "The sleep of the Companions (RA) is classified as **light sleep (*nawm yasīr*)**, which occurs while sitting and causes the head to nod, but the person is easily roused or still partly aware.",
                "According to the majority of jurists, deep sleep that completely overcomes one's senses and relaxes the body invalidates Wudu (because it is possible for wind to be released)."
              ]
            }
          },
          {
            "title": {
              "urdu": "سر جھکنے کا اثر",
              "english": "The Effect of the Head Nodding"
            },
            "content": {
              "urdu": [
                "**\"حَتَّى تَخْفِقَ رُؤُوسُهُمْ\"** (یہاں تک کہ ان کے سر جھک جاتے) اس بات کی علامت ہے کہ وہ ہلکی نیند میں تھے، لیکن وہ مکمل طور پر حواس سے غافل نہیں ہوئے تھے۔",
                "چونکہ وہ عشاء کا انتظار کر رہے تھے اور اپنی مجلس میں بیٹھے تھے، اس لیے نیند ہلکی تھی اور ان کے بیٹھنے کی حالت میں کوئی تبدیلی نہیں آئی تھی۔",
                "یہ حالت وضو کو برقرار رکھتی ہے کیونکہ غالب گمان یہ ہے کہ اگر کوئی حدث (وضو توڑنے والی چیز) واقع ہوتا تو انہیں اس کا علم ہو جاتا۔"
              ],
              "english": [
                "The phrase **'ḥattā takhfiqa ru’ūsuhum'** (until their heads would droop) indicates that they were in a light sleep, but their senses were not completely overcome.",
                "Since they were waiting for ʿIshā' and remained seated in their position, the sleep was light and did not change their seated posture.",
                "This state maintains Wudu because the prevailing assumption is that had any *ḥadath* (Wudu-breaker) occurred, they would have been aware of it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور ترجیح",
        "english": "Fiqh Disagreement and Preference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیند کی حالت پر فقہی حکم",
              "english": "Fiqh Ruling Based on Sleep Position"
            },
            "content": {
              "urdu": [
                "امام شافعی کے نزدیک نیند وضو نہیں توڑتی، جب تک کہ بیٹھنے کی جگہ سے کوئی چیز باہر نہ نکلے۔ یعنی اصل حکم **جسم کی حالت** ہے۔",
                "جبکہ امام ابوحنیفہ کے نزدیک نیند مطلقاً وضو توڑ دیتی ہے، سوائے اس کے کہ وہ نماز کی حالت میں ہو (جیسے رکوع یا سجدہ)۔",
                "اس حدیث کی بنیاد پر، امام احمد اور امام مالک کے نزدیک وہ نیند وضو نہیں توڑتی جو **قیام کی جگہ (مقعد)** کو زمین پر جما کر کی گئی ہو (جیسے مسجد میں بیٹھنا)۔"
              ],
              "english": [
                "According to Imām Shāfiʿī, sleep does not break Wudu as long as the sitting position is maintained. This ruling focuses on the **physical state**.",
                "In contrast, Imām Abū Ḥanīfah holds that sleep generally breaks Wudu, unless it occurs in a state of prayer (like bowing or prostrating).",
                "Based on this Hadith, Imām Aḥmad and Imām Mālik rule that sleep does not break Wudu if the person's **seat (*maqʿad*)** is firmly planted on the ground (e.g., sitting in the mosque)."
              ]
            }
          },
          {
            "title": {
              "urdu": "عشاء کی نماز میں آسانی",
              "english": "Ease in Ishā' Prayer"
            },
            "content": {
              "urdu": [
                "یہ واقعہ اس بات کی بھی دلیل ہے کہ صحابہ کرامؓ نماز عشاء کے لیے اتنی دیر تک انتظار کرتے تھے کہ انہیں نیند آنے لگتی، جو نماز کی پابندی پر ان کے حرص کو ظاہر کرتا ہے۔",
                "نبی اکرم ﷺ نے ان کو اس حالت میں نماز پڑھنے کی اجازت دی، جو عشاء کے وقت کی تاخیر اور اس کی مشقت میں آسانی کی ایک صورت ہے۔",
                "اس سے یہ بھی معلوم ہوتا ہے کہ نبی ﷺ کی تعلیمات میں ہر اس کام میں آسانی ہے جو عبادت کے لیے ضروری ہو۔"
              ],
              "english": [
                "This event also proves that the Companions (RA) would wait so long for the ʿIshā' prayer that they would fall asleep, showing their eagerness for prayer.",
                "The Prophet (ﷺ) permitted them to pray in that state, which is a form of ease given the delay and hardship of waiting for ʿIshā' prayer.",
                "This also teaches that the Prophet's teachings include ease in every matter necessary for worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور حدیث کی سند",
        "english": "The Narrator and Hadith Authenticity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا انسؓ کی روایت",
              "english": "The Narration of Sayyiduna Anas (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا انس بن مالک رضی اللہ عنہ کا یہ بیان ان کے نبی ﷺ کے قریب ہونے کی وجہ سے بہت اہم ہے، کیونکہ انہوں نے صحابہ کے معمولات کا مشاہدہ کیا۔",
                "حدیث کی اصل مسلم میں موجود ہے ('ينامون' کے لفظ سے)، اور دارقطنی نے ابو داؤد کے الفاظ کو **صحیح** کہا ہے، جو اس کے حکم کو مزید مضبوط کرتی ہے۔",
                "یہ بات ثابت شدہ ہے کہ صحابہ کرام نے اپنے وضو کے بارے میں کسی بھی قسم کی کوتاہی نہیں کی، اور ان کا عمل سنت کی پیروی میں تھا۔"
              ],
              "english": [
                "The statement of Sayyiduna Anas ibn Mālik (RA) is important due to his close proximity to the Prophet (ﷺ), allowing him to observe the Companions' practices.",
                "The core text of the Hadith is in Muslim (with the word 'yanāmūn'—they would sleep), and Ad-Dāraquṭnī authenticated the wording in Abū Dāwūd as **Sahih**, strengthening its ruling.",
                "It is a confirmed fact that the Companions (RA) were meticulous about their Wudu, and their actions were strictly in accordance with the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "استدلال کا اصول",
              "english": "The Principle of Derivation"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک **استثنائی** صورت کو بیان کرتی ہے، جہاں نیند وضو نہیں توڑتی۔ یہ اس عام اصول کے تحت ہے کہ نیند حدث کا سبب ہے، جب تک کہ حواس پر قابو رہے۔",
                "یعنی، نیند بذات خود ناقضِ وضو نہیں ہے، بلکہ وہ حالتِ غفلت جو نیند کی وجہ سے پیدا ہوتی ہے اور ریح (ہوا) خارج ہونے کا سبب بن سکتی ہے۔",
                "اس لیے اگر کوئی شخص ایسی گہری نیند سو جائے کہ وہ اپنی حالت سے واقف نہ ہو تو اس کا وضو ٹوٹ جاتا ہے۔"
              ],
              "english": [
                "This Hadith describes an **exceptional** case where sleep does not invalidate Wudu. It works under the general principle that sleep is a cause of *ḥadath* only when control over the senses is lost.",
                "That is, sleep itself is not the Wudu-breaker, but the state of unawareness caused by sleep that could lead to the passing of wind.",
                "Therefore, if a person sleeps so deeply that they are unaware of their state, their Wudu is invalidated."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضو میں احتیاط",
              "english": "Caution in Wudu"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ مسجد میں یا کہیں اور نماز کے انتظار میں ہلکی نیند (اونگھ) میں پڑ جائے تو اسے دوبارہ وضو کی ضرورت نہیں۔",
                "تاہم، اگر وہ لیٹ کر سو جائے، یا کسی ایسی حالت میں سو جائے کہ اس کے اعضاء ڈھیلے ہو جائیں اور اسے اپنے حدث کا علم نہ ہو، تو اسے دوبارہ وضو کرنا چاہیے۔",
                "احتیاط کا تقاضا ہے کہ اگر نیند کی نوعیت کے بارے میں شک ہو تو دوبارہ وضو کر لیا جائے، تاکہ نماز یقین کے ساتھ ادا ہو۔"
              ],
              "english": [
                "A Muslim should not feel the need to perform Wudu again if they fall into light sleep (a nap) while waiting for prayer in the mosque or elsewhere.",
                "However, if one sleeps lying down, or in any position that completely relaxes the limbs and makes one unaware of any potential *ḥadath*, they must perform Wudu again.",
                "The demand for caution dictates that if there is any doubt about the nature of the sleep, one should renew Wudu to ensure the prayer is performed with certainty."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیند اور حدث",
              "english": "Sleep and Hadath (Impurity)"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے صحابہ کا عمل اس بات کی دلیل ہے کہ وضو ٹوٹنے کا تعلق **حدث (کسی چیز کے خارج ہونے)** کے غالب گمان سے ہے، نہ کہ صرف نیند سے۔",
                "بیٹھے ہوئے نیند میں چونکہ حواس مکمل طور پر ختم نہیں ہوتے، اس لیے حدث کے خارج ہونے کا یقین یا غالب گمان نہیں ہوتا۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام میں طہارت کو برقرار رکھنے میں غیر ضروری سختی اور وسوسوں سے بچا گیا ہے۔"
              ],
              "english": [
                "The practice of the Prophet's Companions (RA) proves that the invalidation of Wudu is linked to the strong assumption of **ḥadath (the passing of something)**, not merely the act of sleeping.",
                "In light sleep while sitting, the senses are not completely cut off, so there is no certainty or strong assumption that *ḥadath* has occurred.",
                "This ruling demonstrates that Islam avoids unnecessary strictness and obsessive doubt in maintaining ritual purity."
              ]
            }
          }
        ]
      }
    }
  ]
}
