{
  "hadithId": 788,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/788"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
 
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري ( 2586 ) ، ومسلم ( 1623 ). هذا الحديث هو الأصل في وجوب العدل بين الأولاد في العطايا والهبات.",
    "urdu": "صحیح۔ اسے امام بخاری (2586) اور امام مسلم (1623) نے روایت کیا ہے۔ یہ حدیث اولاد کے درمیان عطیات اور ہبہ میں عدل و انصاف کے واجب ہونے کی اصل بنیاد ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2586) and Muslim (1623). This Hadith is the primary evidence for the obligation of maintaining equality among children in gifts and endowments."
  },
  "importantWords": [
    {
      "arabic": "نَحَلْتُ",
      "english": "Gave as a gift",
      "urdu": "میں نے ہبہ کیا / عطا کیا"
    },
    {
      "arabic": "غُلَامًا",
      "english": "A slave / boy",
      "urdu": "غلام"
    },
    {
      "arabic": "لِيُشْهِدَهُ",
      "english": "To make him witness",
      "urdu": "تاکہ اسے گواہ بنائے"
    },
    {
      "arabic": "اِتَّقُوا اَللَّهَ",
      "english": "Fear Allah",
      "urdu": "اللہ سے ڈرو"
    },
    {
      "arabic": "وَاعْدِلُوا",
      "english": "And be just / fair",
      "urdu": "اور انصاف کرو"
    },
    {
      "arabic": "الْبِرِّ",
      "english": "Piety / Filial devotion",
      "urdu": "نیکی / حسن سلوک"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اولاد کے درمیان مالی معاملات اور تحائف میں برابری اور عدل قائم کرنے کا حکم دیتی ہے اور بلا وجہ کسی ایک بچے کو دوسروں پر ترجیح دینے سے منع کرتی ہے۔",
    "english": "This Hadith mandates equality and justice among children in financial gifts and prohibits favoring one child over others without a legitimate reason."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2586)",
      "english": "Reported by Al-Bukhari (2586)"
    },
    {
      "arabic": "رواه مسلم (1623)",
      "english": "Reported by Muslim (1623)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "النعمان بن بشير",
        "english": "An-Nu'man bin Bashir"
      },
      "slug": "an-numan-bin-bashir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اولاد کے درمیان عدل کا وجوب",
        "english": "Obligation of Justice Among Children"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحائف میں برابری",
              "english": "Equality in Gifts"
            },
            "content": {
              "urdu": [
                "والدین پر واجب ہے کہ وہ اپنی اولاد کو تحفہ دیتے وقت برابری کا مظاہرہ کریں۔",
                "بلاوجہ ایک بچے کو زیادہ دینا دوسرے بچوں میں احساسِ محرومی اور نفرت پیدا کرتا ہے۔",
                "نبی ﷺ نے اسے 'جور' (ظلم) قرار دیا اور اس پر گواہ بننے سے انکار فرمایا۔"
              ],
              "english": [
                "Parents are obligated to maintain equality when giving gifts to their children.",
                "Favoring one child without cause creates resentment and hatred among siblings.",
                "The Prophet (ﷺ) called such inequality 'injustice' and refused to witness it."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور انصاف کا تعلق",
              "english": "Relation Between Piety and Justice"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا فرمان 'اللہ سے ڈرو اور عدل کرو' ثابت کرتا ہے کہ یہ ایک ایمانی مطالبہ ہے۔",
                "انصاف نہ کرنا اللہ کی نافرمانی اور گھر کے سکون کو برباد کرنے کے مترادف ہے۔",
                "تقویٰ کا تقاضا ہے کہ والدین اپنے جذبات کے بجائے شرعی اصولوں پر عمل کریں۔"
              ],
              "english": [
                "The command 'Fear Allah and be just' proves that fairness is a requirement of faith.",
                "Failing to be just is a form of disobedience that destroys domestic peace.",
                "Piety requires parents to follow Shariah principles rather than mere personal emotions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نا برابری کے نفسیاتی اور معاشرتی اثرات",
        "english": "Psychological and Social Effects of Inequality"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسنِ سلوک میں رکاوٹ",
              "english": "Obstacle to Filial Devotion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ اگر تم چاہتے ہو کہ تمام اولاد تم سے نیکی کرے تو سب سے عدل کرو۔",
                "والدین کا امتیازی سلوک اولاد کو نافرمانی اور بد تمیزی پر اکسا سکتا ہے۔",
                "جو والد بچپن میں انصاف کرتا ہے، اسے بڑھاپے میں تمام اولاد کی طرف سے خدمت ملتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) noted that if you want equal devotion from all children, be just to them.",
                "Discriminatory behavior by parents can incite children toward disobedience and rudeness.",
                "A father who is just in his children's youth receives service from all of them in old age."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی رشتوں کی خرابی",
              "english": "Damage to Mutual Relationships"
            },
            "content": {
              "urdu": [
                "اولاد میں ترجیحی سلوک بھائیوں کے درمیان حسد اور دشمنی کی دیواریں کھڑی کر دیتا ہے۔",
                "تاریخ گواہ ہے کہ جائیداد کی غیر منصفانہ تقسیم نے کئی ہنستے بستے گھر اجاڑ دیے۔",
                "اسلامی قانون کا مقصد خاندان کے اندرونی اتحاد اور محبت کی حفاظت کرنا ہے۔"
              ],
              "english": [
                "Preferential treatment creates walls of jealousy and enmity between siblings.",
                "History shows that unfair property distribution has ruined many happy families.",
                "Islamic law aims to protect the internal unity and love within the family unit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات اور مستثنیات",
        "english": "Juristic Details and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جائز ترجیح کی صورتیں",
              "english": "Valid Reasons for Preference"
            },
            "content": {
              "urdu": [
                "اگر کوئی بچہ معذور، بیمار یا بہت زیادہ ضرورت مند ہو تو اسے زائد دینا جائز ہے۔",
                "شرعی عذر کی بنا پر دی جانے والی رعایت 'نا انصافی' کے زمرے میں نہیں آتی۔",
                "تاہم عام حالات میں بلا کسی ٹھوس وجہ کے فرق کرنا ناجائز اور گناہ ہے۔"
              ],
              "english": [
                "It is permissible to give more to a child who is disabled, ill, or in extreme need.",
                "Financial aid given based on a valid Shariah excuse is not considered 'injustice'.",
                "However, in normal circumstances, differentiating without a solid reason is prohibited."
              ]
            }
          },
          {
            "title": {
              "urdu": "غلط ہبہ کی واپسی",
              "english": "Revoking an Unfair Gift"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے بشیر بن سعد کو حکم دیا کہ وہ اپنا دیا ہوا غلام واپس لیں۔",
                "اس سے ثابت ہوا کہ اگر والدین سے انصاف میں غلطی ہو جائے تو وہ اسے درست کر سکتے ہیں۔",
                "والد کو اپنی اولاد کو دیے گئے تحفے میں رجوع کرنے کا مکمل شرعی اختیار حاصل ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) commanded Bashir bin Sa'd to take back the slave he had given.",
                "This proves that if parents make a mistake in justice, they should rectify it.",
                "A father has the full Shariah right to revoke a gift given to his child to restore fairness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتِ اولاد کے لیے اسباق",
        "english": "Lessons for Raising Children"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال اور میانہ روی",
              "english": "Moderation and Balance"
            },
            "content": {
              "urdu": [
                "محبت کا اظہار ہو یا مال کی تقسیم، والدین کو ہمیشہ اعتدال برقرار رکھنا چاہیے۔",
                "بچوں کی تربیت میں عملی نمونہ پیش کرنا تقریروں سے زیادہ موثر ہوتا ہے۔",
                "ایک عادل والد اپنی اولاد کے لیے بہترین رول ماڈل ہوتا ہے۔"
              ],
              "english": [
                "Whether expressing love or distributing wealth, parents must maintain moderation.",
                "Setting a practical example in child-rearing is more effective than lectures.",
                "A just father serves as the best role model for his children."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی مشورہ لینا",
              "english": "Seeking Religious Advice"
            },
            "content": {
              "urdu": [
                "بشیر بن سعد کا نبی ﷺ کے پاس جانا ظاہر کرتا ہے کہ اہم فیصلوں میں رہنمائی لینی چاہیے۔",
                "علماء سے رجوع کرنے سے انسان بہت سے گناہوں اور معاشرتی غلطیوں سے بچ جاتا ہے۔",
                "دین پر عمل کرنا ہی دنیا اور آخرت میں فلاح کا واحد راستہ ہے۔"
              ],
              "english": [
                "Bashir bin Sa'd approaching the Prophet shows one should seek guidance for major decisions.",
                "Consulting scholars saves a person from many sins and social blunders.",
                "Adhering to religion is the only path to success in this world and the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}