{
  "hadithId": 109,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["Bukhari 335", "Muslim 521"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب التيمم (Tayamum)",
    "babId": 9
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (335) ، ومسلم (521) وتمام الحديث عند البخاري: \"وأحلت لي المغانم ولم تحل لأحد قبلي، وأعطيت الشفاعة، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس عامة\" صحيح. رواه مسلم (522) ، وحسن. رواه أحمد (763)",
    "urdu": "صحیح (درست) حدیث۔ اسے بخاری (335) اور مسلم (521) نے روایت کیا ہے۔ بخاری میں بقیہ الفاظ یہ ہیں: 'اور میرے لیے مال غنیمت حلال کیا گیا جو مجھ سے پہلے کسی کے لیے حلال نہ تھا، اور مجھے شفاعت عطا کی گئی، اور ہر نبی صرف اپنی قوم کی طرف بھیجا جاتا تھا جبکہ میں تمام انسانوں کی طرف بھیجا گیا ہوں۔' حذیفہ کی روایت کو مسلم (522) نے اور علی کی روایت کو احمد (763) نے حسن سند سے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (335) and Muslim (521). The remainder of the Hadith in Bukhari is: 'War booty was made lawful for me and was not lawful for anyone before me, and I was granted intercession (Shafa'ah), and every prophet was sent specifically to his own people, but I was sent to all mankind.' The narration of Hudhayfah is Sahih (Muslim 522), and the narration of 'Ali is Hasan (Good), reported by Ahmad (763)."
  },
  "importantWords": [
    {
      "arabic": "أُعْطِيتُ",
      "english": "I was given",
      "urdu": "مجھے عطا کی گئیں"
    },
    {
      "arabic": "خَمْسًا",
      "english": "Five (things)",
      "urdu": "پانچ چیزیں"
    },
    {
      "arabic": "بِالرُّعْبِ",
      "english": "With awe/fear",
      "urdu": "رعب و دبدبے سے"
    },
    {
      "arabic": "مَسِيرَةَ شَهْرٍ",
      "english": "A distance of a month's travel",
      "urdu": "ایک مہینہ کی مسافت"
    },
    {
      "arabic": "مَسْجِدًا",
      "english": "A place of prostration/prayer",
      "urdu": "سجدہ گاہ"
    },
    {
      "arabic": "طَهُورًا",
      "english": "A means of purification",
      "urdu": "پاکیزگی کا ذریعہ"
    },
    {
      "arabic": "أَدْرَكَتْهُ",
      "english": "Overtakes him",
      "urdu": "وقت آ جائے"
    },
    {
      "arabic": "تُرْبَتُهَا",
      "english": "Its dust/soil",
      "urdu": "اس کی مٹی"
    },
    {
      "arabic": "اَلْمَاءَ",
      "english": "The water",
      "urdu": "پانی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم صلی اللہ علیہ وسلم کی امتیازی خصوصیات میں سے ایک کو بیان کرتی ہے کہ اللہ تعالیٰ نے پوری زمین کو مسلمانوں کے لیے نماز کی جگہ اور پانی نہ ہونے کی صورت میں مٹی کو تیمم کے ذریعے طہارت کا ذریعہ بنا دیا ہے۔",
    "english": "This Hadith highlights one of the unique distinctions granted to the Prophet (PBUH), which is that Allah made the entire earth a place of prayer for Muslims and its soil a means of purification (Tayammum) when water is unavailable."
  },
  "references": [
    {
      "arabic": "رواه البخاري (335)",
      "english": "Reported by Al-Bukhari (335)"
    },
    {
      "arabic": "رواه مسلم (521)",
      "english": "Reported by Muslim (521) - Jabir"
    },
    {
      "arabic": "رواه مسلم (522)",
      "english": "Reported by Muslim (522) - Hudhayfah"
    },
    {
      "arabic": "رواه أحمد (763)",
      "english": "Reported by Ahmad (763) - Ali"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin 'Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "حذيفة بن اليمان",
        "english": "Hudhayfah bin Al-Yaman"
      },
      "slug": "hudhayfah-bin-al-yaman"
    },
    {
      "id": 3,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=hadith_tayammum_109",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نبوت کی خصوصیات",
        "english": "Unique Characteristics of Prophethood"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رعب سے مدد",
              "english": "Support by Awe (R'ub)"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم کو ایک ایسی خصوصیت عطا کی گئی کہ آپ کا رعب دشمنوں پر ایک ماہ کی مسافت سے طاری ہو جاتا تھا۔",
                "یہ اللہ کی طرف سے آپ صلی اللہ علیہ وسلم کی خاص مدد تھی جس نے اسلامی فتوحات میں اہم کردار ادا کیا۔",
                "یہ رعب نفسیاتی برتری دیتا تھا اور جنگ سے پہلے ہی دشمن کے حوصلے پست کر دیتا تھا۔"
              ],
              "english": [
                "The Prophet (PBUH) was granted the unique characteristic that his awe was cast into the hearts of his enemies from a distance of one month's journey.",
                "This was special divine assistance from Allah which played a significant role in the Islamic conquests and protection.",
                "This psychological advantage lowered the morale of the enemy forces even before any physical engagement took place."
              ]
            }
          },
          {
            "title": {
              "urdu": "زمین کا سجدہ گاہ ہونا",
              "english": "Earth as a Place of Prayer"
            },
            "content": {
              "urdu": [
                "اسلام سے پہلے نماز صرف مخصوص عبادت خانوں یا پاک جگہوں پر ہی ادا کی جا سکتی تھی۔",
                "اللہ نے نبی صلی اللہ علیہ وسلم کی امت کے لیے ساری زمین کو سجدہ گاہ بنا دیا ہے، خواہ وہ کہیں بھی ہوں۔",
                "اس آسانی نے مسلمانوں کو دنیا کے ہر کونے میں وقت پر نماز ادا کرنے کی سہولت فراہم کر دی ہے۔"
              ],
              "english": [
                "Before Islam, prayer (Salat) was only permissible in specific houses of worship or designated holy places.",
                "Allah made the entire surface of the earth a place of prostration (Masjid) for the Prophet's Ummah, wherever they may be.",
                "This ease allows Muslims to perform their prayers wherever the time for Salah overtakes them, simplifying the obligation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تیمم اور طہارت",
        "english": "Tayammum and Purification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مٹی کا ذریعہ طہارت",
              "english": "Dust as a Purifying Agent"
            },
            "content": {
              "urdu": [
                "اس حدیث کا بنیادی فقہی نکتہ یہ ہے کہ مٹی (تراب) کو پانی کی عدم موجودگی میں طہارت کا ذریعہ بنایا گیا ہے۔",
                "یہ صرف وضو یا غسل کے لیے پانی نہ ملنے کی صورت میں ایک عارضی متبادل کے طور پر استعمال ہوتا ہے۔",
                "قرآن اور سنت نے تیمم کو امت محمدیہ کے لیے ایک بڑی آسانی اور رحمت قرار دیا ہے۔"
              ],
              "english": [
                "The core jurisprudential point of this Hadith is that dust (Turab) was made a means of purification (Tayammum) when water is unavailable.",
                "It serves as a temporary substitute for Wudu' (ablution) or Ghusl (ritual bath) only if water cannot be found or used.",
                "Tayammum has been decreed by the Qur'an and Sunnah as a great mercy and facilitation for the Ummah of the Prophet Muhammad (PBUH)."
              ]
            }
          },
          {
            "title": {
              "urdu": "پانی کی عدم دستیابی",
              "english": "Condition of Water Scarcity"
            },
            "content": {
              "urdu": [
                "حضرت حذیفہ کی روایت واضح کرتی ہے کہ تیمم صرف اس صورت میں جائز ہے جب ہمیں پانی دستیاب نہ ہو۔",
                "پانی موجود ہونے یا اسے استعمال کرنے کی قدرت ہونے پر تیمم جائز نہیں ہوتا، کیونکہ پانی اصل طہارت ہے۔",
                "اس سے معلوم ہوتا ہے کہ تیمم ایک رعایت ہے، لیکن یہ پانی کے استعمال کی جگہ نہیں لے سکتا جب پانی موجود ہو۔"
              ],
              "english": [
                "Hudhayfah's narration clarifies that Tayammum is only permissible when water is not available or cannot be reasonably accessed.",
                "If water is present or one is able to use it, Tayammum is invalid, as water is the primary means of purification.",
                "This indicates that Tayammum is a concession, but it cannot replace the use of water when water is present and useable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی فقہی احکام",
        "english": "Practical Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیمم کی اجازت کی وسعت",
              "english": "Scope of Tayammum Permission"
            },
            "content": {
              "urdu": [
                "فقہاء نے تیمم کی اجازت کو صرف 'تراب' (مٹی) تک محدود نہیں کیا بلکہ ہر پاک زمین کی جنس (پتھر، ریت وغیرہ) کو شامل کیا ہے۔",
                "تیمم جنابت اور وضو دونوں کی ضرورت کو پورا کرتا ہے جب پانی دستیاب نہ ہو، یہ ایک اہم حکم ہے۔",
                "تیمم کے صحیح ہونے کے لیے نیت کا ہونا، اور پاک مٹی سے چہرے اور ہاتھوں پر مسح کرنا ضروری ہے۔"
              ],
              "english": [
                "Jurists have broadened the permission for Tayammum beyond mere 'Turab' (dust) to include any clean, dry substance from the earth's surface (e.g., stones, sand).",
                "Tayammum is a crucial ruling as it fulfills the needs of purification for both Janabah (major impurity) and Wudu' (minor impurity) when water is not found.",
                "For Tayammum to be valid, making the intention and wiping the face and hands with clean earth are the essential requirements."
              ]
            }
          },
          {
            "title": {
              "urdu": "زمین کا تقدس",
              "english": "Sanctity of the Earth"
            },
            "content": {
              "urdu": [
                "زمین کے سجدہ گاہ ہونے کا مطلب ہے کہ مسجد کی طرح کسی بھی پاک جگہ پر نماز ادا کی جا سکتی ہے۔",
                "مسلمان کو اپنی نماز کو وقت پر ادا کرنے میں دیر نہیں کرنی چاہیے، سفر میں ہو یا حضر میں۔",
                "یہ اصول مسجد کی عمارتوں کی بجائے عبادات کی اہمیت اور آسانی پر زور دیتا ہے۔"
              ],
              "english": [
                "The earth being a place of prayer signifies that Salah can be performed on any clean surface, just like a mosque.",
                "A Muslim should not delay their prayer beyond its due time, whether they are traveling or resident.",
                "This principle emphasizes the importance and ease of performing worship over the architectural significance of mosque buildings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عمومی رہنمائی اور فوائد",
        "english": "General Guidance and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امت کی برتری",
              "english": "Superiority of the Ummah"
            },
            "content": {
              "urdu": [
                "ان پانچ خصوصیات میں تمام انبیاء کے مقابلے میں امت محمدیہ کی فضیلت اور شان ظاہر ہوتی ہے۔",
                "طہارت اور نماز میں آسانی عطا کرنا اللہ کی طرف سے اس امت کے لیے ایک عظیم انعام ہے۔",
                "یہ خصوصیات ظاہر کرتی ہیں کہ شریعت اسلامیہ کا اطلاق عالمگیر ہے اور ہر دور کے لیے مکمل ہے۔"
              ],
              "english": [
                "These five characteristics reveal the distinction and honor granted to the Ummah of Muhammad (PBUH) compared to all previous prophets.",
                "The facilitation in matters of purification and prayer is a great reward from Allah to this Ummah.",
                "These unique features indicate that the Islamic Shariah is universal in application and complete for all times."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی پابندی",
              "english": "Adherence to Time"
            },
            "content": {
              "urdu": [
                "حدیث تاکید کرتی ہے کہ جیسے ہی نماز کا وقت ہو جائے، اسے فوراً ادا کر لینا چاہیے، چاہے وسائل دستیاب نہ ہوں۔",
                "یہ اس بات کی دلیل ہے کہ نماز ایک لازمی فریضہ ہے جسے کسی بھی حال میں ترک نہیں کیا جا سکتا۔",
                "تیمم کی رعایت کے ذریعے بھی مسلمانوں پر نماز کو وقت پر ادا کرنے کی ذمہ داری قائم رہتی ہے۔"
              ],
              "english": [
                "The Hadith emphasizes that as soon as the time for prayer arrives, it should be performed immediately, even if resources are scarce.",
                "This is strong evidence that Salah is an indispensable duty that cannot be abandoned under any circumstances.",
                "Even with the concession of Tayammum, the responsibility remains on Muslims to perform their prayers strictly within their prescribed times."
              ]
            }
          }
        ]
      }
    }
  ]
}
