{
  "hadithId": 1173,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/13/3"],
    "kitabId": 13,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 96
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6622)، ومسلم (1652)، وأبو داود (3278) بإسناد صحيح.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری (6622) اور امام مسلم (1652) نے روایت کیا ہے۔ ابوداؤد کی روایت بھی صحیح سند کے ساتھ موجود ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6622), Muslim (1652), and Abu Dawud (3278) with a Sahih chain of narration."
  },
  "importantWords": [
    {
      "arabic": "حَلَفْتَ",
      "english": "You swore",
      "urdu": "تم نے قسم کھائی"
    },
    {
      "arabic": "يَمِينٍ",
      "english": "Oath",
      "urdu": "قسم"
    },
    {
      "arabic": "خَيْراً",
      "english": "Better / Good",
      "urdu": "بہتر / بھلائی"
    },
    {
      "arabic": "فَكَفِّرْ",
      "english": "Expiate / Pay penalty",
      "urdu": "پس کفارہ ادا کرو"
    },
    {
      "arabic": "ائْتِ",
      "english": "Do / Perform",
      "urdu": "وہ کام کرو"
    }
  ],
  "summary": {
    "urdu": "اگر کوئی شخص کسی کام کی قسم کھائے لیکن بعد میں اسے توڑ کر دوسرا کام کرنا بہتر معلوم ہو، تو اسے قسم توڑ کر کفارہ دینا چاہیے اور بہتر کام کرنا چاہیے۔",
    "english": "If an oath hinders a better course of action, it should be broken and expiated to pursue what is more beneficial."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6622)",
      "english": "Sahih al-Bukhari (6622)"
    },
    {
      "arabic": "صحيح مسلم (1652)",
      "english": "Sahih Muslim (1652)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الرحمن بن سمرة",
        "english": "Abdur-Rahman bin Samurah"
      },
      "slug": "abdur-rahman-bin-samurah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S8YV59Uu0oU",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قسم اور نیکی میں توازن",
        "english": "Balancing Oaths and Virtue"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بھلائی کو ترجیح دینا",
              "english": "Prioritizing Goodness"
            },
            "content": {
              "urdu": [
                "اسلام میں قسم کو نیکی کے راستے کی رکاوٹ نہیں بننے دیا جاتا۔",
                "اگر قسم کی وجہ سے کوئی دینی یا دنیاوی فائدہ رک رہا ہو تو اسے توڑنا واجب ہے۔",
                "اللہ تعالیٰ کو بندے کی نیکی اور اصلاح زیادہ پسند ہے۔"
              ],
              "english": [
                "Islam does not allow an oath to become an obstacle to performing good deeds.",
                "If an oath prevents a religious or worldly benefit, breaking it becomes necessary.",
                "Allah Almighty prefers the servant's righteousness and rectification over a rigid oath."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضد سے بچنے کی تاکید",
              "english": "Avoiding Stubbornness"
            },
            "content": {
              "urdu": [
                "قسم کھا کر غلط بات پر اڑے رہنا گناہ اور جہالت کی علامت ہے۔",
                "نبی کریم ﷺ نے اس طرز عمل کو ناپسند فرمایا ہے۔",
                "بہتر کام کی طرف رجوع کرنا مومن کی دانشمندی ظاہر کرتا ہے۔"
              ],
              "english": [
                "Persisting in something wrong after taking an oath is a sign of sin and ignorance.",
                "The Holy Prophet (ﷺ) expressed strong disapproval of such rigid behavior.",
                "Turning towards a better course of action demonstrates a believer's wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کفارہِ یمین کے احکام",
        "english": "Rulings on Expiation of Oaths"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفارہ کب ادا کریں؟",
              "english": "When to Expiate?"
            },
            "content": {
              "urdu": [
                "قسم توڑنے سے پہلے یا بعد میں، دونوں صورتوں میں کفارہ جائز ہے۔",
                "بخاری کی روایت کے مطابق پہلے بہتر کام کر لیں پھر کفارہ دیں۔",
                "ابوداؤد کی روایت پہلے کفارہ دینے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "Expiation is permissible either before or after breaking the oath.",
                "According to Al-Bukhari, one can do the better deed first and then expiate.",
                "The narration of Abu Dawud suggests paying the expiation before the action."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفارہ کی مقدار",
              "english": "Details of Expiation"
            },
            "content": {
              "urdu": [
                "دس مسکینوں کو کھانا کھلانا یا انہیں لباس فراہم کرنا کفارہ ہے۔",
                "اگر استطاعت نہ ہو تو تین دن کے مسلسل روزے رکھنے ہوں گے۔",
                "یہ مالی یا بدنی جرمانہ قسم کی حرمت برقرار رکھنے کے لیے ہے۔"
              ],
              "english": [
                "The expiation is feeding ten needy people or providing them with clothing.",
                "If one lacks the financial means, they must fast for three consecutive days.",
                "This financial or physical penalty is to maintain the sanctity of an oath."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی حکمت اور وسعت",
        "english": "Shariah Wisdom and Scope"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین میں آسانی",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ دینِ اسلام فطرت کے مطابق اور لچکدار ہے۔",
                "انسان جذباتی ہو کر قسم کھا سکتا ہے، مگر شریعت اسے راستہ دیتی ہے۔",
                "کسی جائز کام سے خود کو روک لینا اللہ کو مطلوب نہیں ہے۔"
              ],
              "english": [
                "This Hadith clarifies that Islam is a natural and flexible religion.",
                "A person might take an oath emotionally, but Shariah provides a way out.",
                "Allah does not desire for humans to bar themselves from permissible acts."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلقات کی بحالی",
              "english": "Restoring Relationships"
            },
            "content": {
              "urdu": [
                "اکثر لوگ رشتہ داروں سے نہ ملنے کی قسمیں کھا لیتے ہیں۔",
                "ایسی صورت میں صلہ رحمی کرنا اور قسم توڑنا ہی سنت ہے۔",
                "اسلام باہمی محبت اور جوڑ پیدا کرنے والا ضابطہ حیات ہے۔"
              ],
              "english": [
                "Often people swear not to meet or help their close relatives.",
                "In such cases, keeping ties and breaking the oath is the actual Sunnah.",
                "Islam is a code of life that promotes mutual love and social bonding."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فیصلہ سازی میں لچک",
              "english": "Flexibility in Decision Making"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے فیصلوں پر نظر ثانی کرنے کی عادت ڈالنی چاہیے۔",
                "صرف قسم کھا لینے کی وجہ سے نقصان دہ عمل پر قائم رہنا حماقت ہے۔",
                "حق اور بھلائی کا راستہ ملتے ہی اپنی سمت درست کر لینی چاہیے۔"
              ],
              "english": [
                "We should cultivate the habit of reviewing our personal decisions.",
                "Persisting in harmful actions just because of an oath is foolishness.",
                "One should correct their direction as soon as the path of truth is found."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی اطاعت",
              "english": "Obedience to the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے ہمیں ہر تنگی سے نکلنے کا طریقہ سکھا دیا ہے۔",
                "نبی ﷺ کے بتائے ہوئے کفارے پر عمل کرنا اللہ کی اطاعت ہے۔",
                "اتباعِ سنت ہی میں ہر الجھن کا حل اور سکون موجود ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) taught us the way to escape every difficult situation.",
                "Acting upon the expiation prescribed by him is an act of obedience to Allah.",
                "The solution to every confusion and peace lies in following the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}