{
  "hadithId": 517,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/517"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1041). والحديث وعيد شديد لمن جعل السؤال وسيلة للاغتناء لا لسد الحاجة.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1041) نے اسے روایت کیا ہے۔ یہ روایت ان لوگوں کے لیے سخت وعید ہے جو ضرورت کے بغیر مال جمع کرنے کے لیے مانگتے ہیں۔",
    "english": "Sahih. Reported by Muslim (1041). The Hadith serves as a severe warning to those who use begging as a means to accumulate wealth rather than satisfying a need."
  },
  "importantWords": [
    {
      "arabic": "تَكَثُّرًا",
      "english": "To increase wealth",
      "urdu": "مال زیادہ کرنے کے لیے"
    },
    {
      "arabic": "جَمْرًا",
      "english": "Live coals",
      "urdu": "انبار / دہکتے انگارے"
    },
    {
      "arabic": "فَلْيَسْتَقِلَّ",
      "english": "Let him take little",
      "urdu": "پس وہ کم کر لے"
    },
    {
      "arabic": "لِيَسْتَكْثِرْ",
      "english": "Let him take much",
      "urdu": "وہ زیادہ کر لے"
    },
    {
      "arabic": "سَأَلَ",
      "english": "Asked / Begged",
      "urdu": "سوال کیا / مانگا"
    },
    {
      "arabic": "أَمْوَالَهُمْ",
      "english": "Their wealth",
      "urdu": "ان کے مال"
    }
  ],
  "summary": {
    "urdu": "بغیر کسی معاشی مجبوری کے محض دولت میں اضافے کے لیے لوگوں سے مانگنا دراصل جہنم کی آگ کو اکٹھا کرنا ہے، جس کا انجام انتہائی دردناک ہے۔",
    "english": "Begging from others solely to amass wealth without genuine need is equivalent to gathering the fire of Hell for oneself."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1041)",
      "english": "Sahih Muslim (1041)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طمع اور گداگری کا انجام",
        "english": "The Consequence of Greed and Begging"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرص و ہوس کی مذمت",
              "english": "Condemnation of Greed"
            },
            "content": {
              "urdu": [
                "جو شخص ضرورت نہ ہونے کے باوجود مال بڑھانے کے لیے مانگتا ہے وہ گناہ کا مرتکب ہے۔",
                "ایسا مال دنیا میں وبال اور آخرت میں آگ کا ذریعہ بنے گا۔",
                "اسلام نے قناعت کی تعلیم دی ہے اور بلا وجہ مانگنے سے سختی سے روکا ہے۔"
              ],
              "english": [
                "Anyone who begs to increase wealth without necessity is committing a sin.",
                "Such wealth becomes a burden in this life and fire in the Hereafter.",
                "Islam teaches contentment and strictly forbids begging without a valid reason."
              ]
            }
          },
          {
            "title": {
              "urdu": "انگاروں کا حصول",
              "english": "Acquiring Coals of Fire"
            },
            "content": {
              "urdu": [
                "حدیث میں مانگ کر جمع کیے گئے مال کو 'انگاروں' سے تشبیہ دی گئی ہے۔",
                "یہ اس بات کی طرف اشارہ ہے کہ حرام طریقے سے جمع مال تکلیف کا باعث ہوگا۔",
                "جتنا زیادہ انسان مانگ کر جمع کرے گا، اتنی ہی جہنم کی آگ بڑھے گی۔"
              ],
              "english": [
                "The Hadith likens wealth gathered through begging to 'live coals'.",
                "This indicates that wealth collected unlawfully will cause immense pain.",
                "The more a person accumulates by begging, the more their Hellfire increases."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خودداری اور عزتِ نفس",
        "english": "Self-Respect and Dignity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انسانی وقار کا تحفظ",
              "english": "Protecting Human Dignity"
            },
            "content": {
              "urdu": [
                "لوگوں کے سامنے ہاتھ پھیلانا انسان کی اپنی عزت کو خاک میں ملانا ہے۔",
                "مومن کو چاہیے کہ وہ اپنی ضروریات کے لیے صرف اللہ کی طرف رجوع کرے۔",
                "پیشہ ورانہ گداگری معاشرے کے معاشی ڈھانچے کو بھی نقصان پہنچاتی ہے۔"
              ],
              "english": [
                "Stretching hands before people tarnishes an individual's own dignity.",
                "A believer should turn only to Allah to fulfill their needs.",
                "Professional begging also harms the economic structure of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "قناعت میں سکون",
              "english": "Peace in Contentment"
            },
            "content": {
              "urdu": [
                "اللہ کی دی ہوئی تھوڑی روزی پر صبر کرنا مانگنے سے ہزار درجہ بہتر ہے۔",
                "جو لوگ صبر کرتے ہیں اللہ ان کے لیے غیب سے راستے پیدا کر دیتا ہے۔",
                "حقیقی غنا دل کا غنی ہونا ہے نہ کہ دوسروں کے مال پر نظر رکھنا۔"
              ],
              "english": [
                "Being patient with little provision from Allah is far better than begging.",
                "Allah creates ways from the unseen for those who practice patience.",
                "True richness is the contentment of the heart, not eyeing others' wealth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دینی و معاشرتی سبق",
        "english": "Religious and Social Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سائل کی اقسام",
              "english": "Types of Seekers"
            },
            "content": {
              "urdu": [
                "صرف وہ شخص مانگ سکتا ہے جو واقعی فاقہ کشی یا شدید قرض میں ہو۔",
                "پیشہ ور بھکاریوں کی حوصلہ شکنی کرنا پورے معاشرے کی ذمہ داری ہے۔",
                "مال جمع کرنے کے لیے مانگنا اللہ کی دی ہوئی نعمتوں کی ناشکری ہے۔"
              ],
              "english": [
                "Only those facing starvation or severe debt are permitted to ask.",
                "It is society's collective responsibility to discourage professional beggars.",
                "Begging to accumulate wealth is ingratitude for the blessings Allah gave."
              ]
            }
          },
          {
            "title": {
              "urdu": "انتخاب کی آزادی کا مفہوم",
              "english": "The Meaning of Choice"
            },
            "content": {
              "urdu": [
                "فرمانِ نبوی 'کم کرے یا زیادہ' ایک طرح کی دھمکی اور تنبیہ ہے۔",
                "انسان کو اپنے انجام کا فیصلہ خود کرنا ہے کہ وہ جنت چاہتا ہے یا آگ۔",
                "یہ فقرہ اس عمل کی سنگینی اور ہولناکی کو واضح کرنے کے لیے استعمال ہوا ہے۔"
              ],
              "english": [
                "The prophetic phrase 'let him ask for little or much' is a severe warning.",
                "A person must decide their own fate: whether they want Paradise or Fire.",
                "This expression is used to highlight the gravity and horror of the act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محنت کی ترغیب",
              "english": "Encouragement of Labor"
            },
            "content": {
              "urdu": [
                "ہاتھ پھیلانے کے بجائے محنت مزدوری کر کے پیٹ پالنا سنتِ انبیاء ہے۔",
                "حلال کمائی میں برکت ہے چاہے وہ مقدار میں تھوڑی ہی کیوں نہ ہو۔",
                "خودداری کے ساتھ زندگی گزارنا آخرت میں سرخی روئی کا باعث ہے۔"
              ],
              "english": [
                "Earning a living through labor instead of begging is the Sunnah of Prophets.",
                "There is blessing in lawful income, even if it is small in quantity.",
                "Living with self-respect leads to success and honor in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستحقین کی پہچان",
              "english": "Identifying the Deserving"
            },
            "content": {
              "urdu": [
                "صدقہ دینے والوں کو چاہیے کہ وہ اصل ضرورت مندوں کو تلاش کریں۔",
                "ہر مانگنے والا مستحق نہیں ہوتا، تحقیق کر کے دینا زیادہ اجر کا باعث ہے۔",
                "سفید پوش لوگوں کی مدد کرنا جو مانگتے نہیں، سب سے بہترین نیکی ہے۔"
              ],
              "english": [
                "Those giving charity should actively seek out the truly needy.",
                "Not every beggar is deserving; verifying before giving brings more reward.",
                "Helping dignified people who do not beg is the most superior act of kindness."
              ]
            }
          }
        ]
      }
    }
  ]
}