{
  "hadithId": 134,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["1:2:6"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (424)‏، والنسائي (172)‏، والترمذي (154)‏، وابن ماجه (672)‏، وأحمد (3 /465 و 440 و 142 و 143)‏، وابن حبان (1490)‏، (1491)‏.‏ وفي لفظ: \"أعظم للأجر\"، وفي أخر: \"لأجرها\".‏ وقال الترمذي: \"حديث رافع بن خديج حديث حسن صحيح\".‏ ومعنى \"أسفروا\": أراد صلى الله عليه وسلم في الليالي المقمرة التي لا يتبين فيها وضوح طلوع الفجر؛ لئلا يؤدي المرء صلاة الصبح إلا بعد التيقن بالإسفار بطلوع الفجر، فإن الصلاة إذا أديت كما وصفنا كان أعظم للأجر من أن تصلى على غير يقين من طلوع الفجر.‏ قاله ابن حبان.‏ ومن قبل ذلك نقل الترمذي عن الشافعي وأحمد وإسحاق أنهم قالوا: معنى الإسفار: أن يضح الفجر فلا يشك فيه.‏",
    "urdu": "صحیح۔ اسے ابو داؤد (424)، نسائی (172)، ترمذی (154)، ابن ماجہ (672)، اور احمد (3/465، 440، 142، 143) نے روایت کیا ہے، اور ابن حبان (1490، 1491) نے بھی۔ ایک روایت میں 'أعظم للأجر' (اجر کے لیے زیادہ عظیم) اور دوسری میں 'لأجرها' (اس کے اجر کے لیے) الفاظ ہیں۔ ترمذی نے کہا: 'رافع بن خدیج کی حدیث حسن صحیح ہے۔' 'أَصْبِحُوا' (صبح واضح ہونے پر پڑھو) کا مطلب ہے: نبی اکرم ﷺ نے چاندنی راتوں میں نماز فجر کی ادائیگی کو یقین کے ساتھ صبح کی روشنی واضح ہونے کے بعد کرنے کا حکم دیا تاکہ کوئی شک و شبہ نہ رہے۔ کیونکہ یقین کے ساتھ ادا کی گئی نماز کا اجر، شک و شبہ والی نماز سے زیادہ ہوتا ہے۔ یہ بات ابن حبان نے کہی ہے۔ اس سے قبل، ترمذی نے شافعی، احمد اور اسحاق سے نقل کیا کہ 'اسفار' کا مطلب ہے: فجر اس قدر واضح ہو جائے کہ اس میں کوئی شک نہ رہے۔",
    "english": "Authentic (Sahih). Reported by Abu Dawud (424), An-Nasa'i (172), At-Tirmidhi (154), Ibn Majah (672), and Ahmad (3/465, 440, 142, 143). Also by Ibn Hibban (1490, 1491). In one wording, it is 'greater for the reward' (أعظم للأجر) and in another, 'for its reward' (لأجرها). At-Tirmidhi said: 'The Hadith of Rafi' ibn Khadij is Hasan Sahih (Good and Authentic).' The meaning of 'Aṣbiḥū' (Perform the Fajr when it is clearly bright) is that the Prophet (ﷺ) intended for the prayer to be performed in moonlit nights where the clarity of the true dawn is not distinct, so that one does not pray except after being certain of the bright true dawn. For the prayer performed with certainty is greater in reward than one prayed without certainty. This was stated by Ibn Hibban. Earlier, At-Tirmidhi quoted Ash-Shafi'i, Ahmad, and Ishaq as saying: The meaning of 'Isfār' (brightening) is that the dawn becomes clear so there is no doubt about it."
  },
  "importantWords": [
    {
      "arabic": "أَصْبِحُوا",
      "english": "Perform (Fajr) when it is bright",
      "urdu": "صبح خوب واضح ہونے پر پڑھو"
    },
    {
      "arabic": "اَلصُّبْحِ",
      "english": "The Dawn Prayer (Fajr)",
      "urdu": "فجر کی نماز"
    },
    {
      "arabic": "أَعْظَمُ",
      "english": "Greater/Most magnificent",
      "urdu": "سب سے زیادہ عظیم"
    },
    {
      "arabic": "لِأُجُورِكُمْ",
      "english": "For your rewards",
      "urdu": "تمہارے اجر کے لیے"
    },
    {
      "arabic": "اَلْخَمْسَةُ",
      "english": "The Five (compilers)",
      "urdu": "پانچوں محدثین"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "Graded it as authentic",
      "urdu": "اسے صحیح قرار دیا"
    },
    {
      "arabic": "إِسْفَار",
      "english": "Clear brightening of dawn",
      "urdu": "صبح کی واضح روشنی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز فجر کو اس کے وقت کے دوران میں اس قدر مؤخر کر کے پڑھنے کی فضیلت بیان کرتی ہے کہ صبح کی روشنی (اسفار) خوب واضح ہو جائے اور کسی قسم کا شک نہ رہے۔ اس عمل سے اجر و ثواب میں اضافہ ہوتا ہے۔",
    "english": "This Hadith highlights the virtue of delaying the Fajr prayer within its prescribed time until the dawn light (Isfār) is clearly visible and free from doubt. This practice is stated to bring about a greater reward for the worshipper."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (424)",
      "english": "Reported by Abu Dawud (424)"
    },
    {
      "arabic": "رواه الترمذي (154)",
      "english": "Reported by At-Tirmidhi (154)"
    },
    {
      "arabic": "رواه ابن ماجه (672)",
      "english": "Reported by Ibn Majah (672)"
    },
    {
      "arabic": "صححه ابن حبان (1490)",
      "english": "Authenticates by Ibn Hibban (1490)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رافع بن خديج",
        "english": "Rafi' ibn Khadij"
      },
      "slug": "rafi-ibn-khadij"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز فجر کا افضل وقت",
        "english": "The Preferred Time for Fajr Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسفار کی فضیلت",
              "english": "Virtue of Isfār (Brightening)"
            },
            "content": {
              "urdu": [
                "حدیث اس بات کو واضح کرتی ہے کہ نماز فجر کو 'اسفار' یعنی صبح کی روشنی خوب پھیل جانے کے بعد پڑھنا افضل ہے۔",
                "اسفار کا مطلب یہ ہے کہ وقت کے دخول کا یقین ہو جائے اور نماز شک سے پاک ہو۔",
                "یہ عمل اس لیے اجر میں زیادہ ہے کہ اس میں نماز کو بہترین اور یقینی وقت پر ادا کیا جاتا ہے۔"
              ],
              "english": [
                "The Hadith clarifies that it is more virtuous to perform the Fajr prayer after 'Isfār' (when the dawn light is well-spread).",
                "Isfār means having certainty about the time's entry and performing the prayer free from doubt.",
                "This action is greater in reward because the prayer is performed at its best and most certain time."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف",
              "english": "Juristic Differences"
            },
            "content": {
              "urdu": [
                "Some Imams like Shafi'i, Ahmad, and Ishaq considered Isfār preferable, as mentioned in the Hadith.",
                "Whereas Imam Abu Hanifah and some other jurists prefer 'Taghlīs' (praying in the dark), based on other narrations.",
                "Both methods are permissible, but for congregation, 'Isfār' is generally preferred to ensure people's confidence."
              ],
              "english": [
                "Some Imams like Shafi'i, Ahmad, and Ishaq considered Isfār preferable, as mentioned in the Hadith.",
                "Whereas Imam Abu Hanifah and some other jurists prefer 'Taghlīs' (praying in the dark), based on other narrations.",
                "Both methods are permissible, but for congregation, 'Isfār' is generally preferred to ensure people's confidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر میں اضافے کی حکمت",
        "english": "Wisdom Behind the Increased Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یقین اور اطمینان",
              "english": "Certainty and Assurance"
            },
            "content": {
              "urdu": [
                "اجر میں اضافے کی بنیادی وجہ یہ ہے کہ نماز کی ادائیگی فجر کے طلوع ہونے کے مکمل یقین کے بعد ہوتی ہے۔",
                "اگر نماز شک و شبہ کے وقت پڑھی جائے تو ممکن ہے کہ وقت سے پہلے ادا ہو جائے، جس سے اجر کم ہو گا۔",
                "اسفار نمازی کو اس بات کا اطمینان دیتا ہے کہ وہ اللہ کے مقرر کردہ وقت میں عبادت کر رہا ہے۔"
              ],
              "english": [
                "The main reason for the increased reward is that the prayer is performed with complete certainty after the dawn has risen.",
                "If the prayer is performed during a time of doubt, it might be offered prematurely, which reduces the reward.",
                "Isfār provides the worshipper assurance that they are performing the worship within the time appointed by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت اور یکسوئی",
              "english": "Purity and Focus"
            },
            "content": {
              "urdu": [
                "اجر زیادہ ہونے کی ایک وجہ یہ بھی ہے کہ اس وقت لوگ زیادہ بیدار اور ہشاش بشاش ہوتے ہیں۔",
                "بیداری اور واضح روشنی میں نماز میں خشوع و خضوع اور طہارت کا احساس بہتر ہوتا ہے۔",
                "ایسا وقت اختیار کرنا جو عبادت کے لیے سب سے زیادہ موزوں ہو، باعثِ فضیلت ہے۔"
              ],
              "english": [
                "Another reason for the greater reward is that people are often more awake and refreshed at this time.",
                "The sense of reverence (Khushu') and purity is enhanced when praying in wakefulness and clear light.",
                "Choosing a time most conducive to worship is a source of virtue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اطلاق",
        "english": "Practical Implementation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد اور جماعت کا وقت",
              "english": "Mosque and Congregational Time"
            },
            "content": {
              "urdu": [
                "اکثر مساجد میں فجر کو اسفار کے وقت کے قریب ادا کیا جاتا ہے تاکہ زیادہ لوگ باجماعت شامل ہو سکیں۔",
                "علماء نے مشورہ دیا ہے کہ جماعت کا وقت اتنا مؤخر کیا جائے کہ لوگوں کی شرکت آسان ہو۔",
                "باجماعت نماز کی فضیلت 'اسفار' کی فضیلت سے زیادہ اہم ہے۔"
              ],
              "english": [
                "Most mosques perform Fajr close to the time of Isfār so that more people can join the congregation.",
                "Scholars have advised that the congregational time should be delayed slightly to facilitate attendance.",
                "The virtue of congregational prayer is more important than the sole virtue of Isfār."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "اس حدیث پر عمل نبی اکرم ﷺ کی سنت کو زندہ کرنے کے مترادف ہے۔",
                "انفرادی طور پر نماز ادا کرنے والے شخص کے لیے بھی اسفار کا خیال رکھنا مستحسن ہے۔",
                "سنت نبوی ﷺ کو تمام فقہی آراء پر فوقیت حاصل ہے۔"
              ],
              "english": [
                "Acting upon this Hadith is equivalent to reviving the Sunnah of the Prophet (ﷺ).",
                "It is praiseworthy even for an individual praying alone to consider the time of Isfār.",
                "The Prophetic Sunnah takes precedence over all other jurisprudential opinions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی فوائد",
        "english": "Training Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اطمینانِ قلب",
              "english": "Tranquility of the Heart"
            },
            "content": {
              "urdu": [
                "یقین کے ساتھ نماز ادا کرنے سے دل کو اطمینان اور سکون حاصل ہوتا ہے۔",
                "اللہ کی رضا اور زیادہ اجر کی تلاش مومن کو محنت پر آمادہ کرتی ہے۔",
                "عبادت کو بہترین شکل میں ادا کرنا ہی ایمان کا تقاضا ہے۔"
              ],
              "english": [
                "Performing prayer with certainty brings tranquility and peace to the heart.",
                "The pursuit of Allah's pleasure and greater reward motivates the believer to strive.",
                "Performing worship in its best form is a requirement of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت میں احتیاط",
              "english": "Caution in Worship"
            },
            "content": {
              "urdu": [
                "حدیث اس بات کی تعلیم دیتی ہے کہ شرعی امور میں ہمیشہ احتیاط اور یقین کو ترجیح دینی چاہیے۔",
                "شک کی حالت میں عبادت نہ کی جائے، بلکہ یقین حاصل کیا جائے۔",
                "یہ احتیاطی تدبیر نماز کے صحیح ہونے کے لیے بنیادی شرط ہے۔"
              ],
              "english": [
                "The Hadith teaches that certainty and caution should always be preferred in religious matters.",
                "Worship should not be performed in a state of doubt; rather, certainty must be established.",
                "This precautionary measure is a fundamental condition for the validity of the prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
