{
  "hadithId": 1336,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/106"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (6404)‏، ومسلم (2693).",
    "urdu": "صحیح۔ اسے امام بخاری (6404) اور امام مسلم (2693) نے اپنی صحیحین میں روایت کیا ہے۔ یہ حدیث توحید کے کلمات کی فضیلت پر ایک عظیم بشارت ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6404) and Muslim (2693). This Hadith serves as a great glad tiding regarding the virtues of the words of Monotheism."
  },
  "importantWords": [
    {
      "arabic": "لَا شَرِيكَ لَهُ",
      "english": "No partner for Him",
      "urdu": "اس کا کوئی شریک نہیں"
    },
    {
      "arabic": "لَهُ الْمُلْكُ",
      "english": "To Him belongs the Sovereignty",
      "urdu": "اسی کے لیے بادشاہت ہے"
    },
    {
      "arabic": "أَعْتَقَ",
      "english": "Manumitted / Set free",
      "urdu": "آزاد کیا"
    },
    {
      "arabic": "وَلَدِ إِسْمَاعِيلَ",
      "english": "Descendants of Ishmael",
      "urdu": "اولادِ اسماعیل علیہ السلام"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں توحید کے جامع کلمات کو دس مرتبہ پڑھنے کا ثواب اولادِ اسماعیل کے چار غلام آزاد کرنے کے برابر قرار دیا گیا ہے، جو کہ ایک انتہائی فضیلت والا عمل ہے۔",
    "english": "This Hadith states that the reward for reciting the words of Tawhid ten times is equivalent to freeing four slaves from the noble lineage of Prophet Ishmael (AS)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الدعوات، رقم 6404",
      "english": "Sahih al-Bukhari, Book of Supplications, No. 6404"
    },
    {
      "arabic": "صحيح مسلم، كتاب الذكر والدعاء، رقم 2693",
      "english": "Sahih Muslim, Book of Remembrance and Supplication, No. 2693"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو أيوب الأنصاري",
        "english": "Abu Ayyub al-Ansari"
      },
      "slug": "abu-ayyub-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کلماتِ توحید کی عظمت",
        "english": "The Greatness of the Words of Tawhid"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جامع ذکر",
              "english": "A Comprehensive Dhikr"
            },
            "content": {
              "urdu": [
                "یہ کلمات اللہ کی وحدانیت، اس کی قدرت اور اس کی حمد کا بہترین مجموعہ ہیں۔",
                "ان کلمات کا اقرار انسان کے عقیدہ توحید کو پختہ کرتا ہے جو کہ اسلام کی اصل روح ہے۔",
                "یہ ذکر مختصر ہونے کے باوجود ثواب کے اعتبار سے بہت بھاری ہے۔"
              ],
              "english": [
                "These words are a perfect combination of Allah's Oneness, His Power, and His Praise.",
                "Reciting these words strengthens a person's belief in Monotheism, which is the core of Islam.",
                "Despite being short, this remembrance is immensely heavy in reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلام آزاد کرنے کی فضیلت",
        "english": "The Virtue of Freeing Slaves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اولادِ اسماعیل کی خصوصیت",
              "english": "Lineage of Ishmael (AS)"
            },
            "content": {
              "urdu": [
                "اولادِ اسماعیل علیہ السلام سے مراد عرب کے معزز قبائل ہیں، ان کے غلام آزاد کرنا زیادہ فضیلت رکھتا ہے۔",
                "قدیم دور میں غلام کو آزادی دلانا دنیا کے مہنگے ترین اور افضل ترین صدقات میں سے تھا۔",
                "اللہ نے محض اپنی زبان سے ذکر کرنے والوں کو وہ اجر عطا فرمایا جو بہت بڑی مالی قربانی سے ملتا تھا۔"
              ],
              "english": [
                "Descendants of Ishmael (AS) refer to noble Arab lineages; freeing them carries higher virtue.",
                "In ancient times, freeing a slave was among the most expensive and superior forms of charity.",
                "Allah grants the same reward to those who remember Him verbally as those who make massive financial sacrifices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ذکر کی برکات اور ثمرات",
        "english": "Blessings and Fruits of Dhikr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شیطان سے حفاظت",
              "english": "Protection from Satan"
            },
            "content": {
              "urdu": [
                "دیگر روایات کے مطابق یہ کلمات پڑھنے والا سارا دن شیطان کے شر سے محفوظ رہتا ہے۔",
                "یہ ذکر انسان کے نامہ اعمال میں نیکیوں کا اضافہ کرتا ہے اور گناہوں کو مٹاتا ہے۔",
                "مسلسل یہ کلمات پڑھنے والا اللہ کا مقرب بندہ بن جاتا ہے۔"
              ],
              "english": [
                "According to other narrations, reciting these words protects a person from Satan's evil all day long.",
                "This Dhikr increases good deeds in the book of accounts and erases sins.",
                "One who recites these words consistently becomes close to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزانہ کا معمول",
              "english": "Daily Routine"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ ان کلمات کو اپنی صبح اور شام کے اذکار کا حصہ بنائیں۔",
                "صرف چند منٹ نکال کر ہم وہ اجر پا سکتے ہیں جو لاکھوں روپے صدقہ کرنے سے بھی مشکل سے ملتا ہے۔",
                "ذکرِ الہی غفلت کو دور کرنے اور دل کو زندہ رکھنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "We should make these words a part of our morning and evening supplications.",
                "By spending just a few minutes, we can earn rewards that are difficult to achieve even by donating millions.",
                "Remembrance of Allah is the best way to remove heedlessness and keep the heart spiritually alive."
              ]
            }
          }
        ]
      }
    }
  ]
}