{
  "hadithId": 1347,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["bukhari:6306"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "كتاب الدعوات",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6306)، والترمذي (3393)، والنسائي (5522). وزاد البخاري: 'من قالها من النهار موقنا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها فمات قبل أن يصبح فهو من أهل الجنة'.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (6306) نے اسے روایت کیا ہے۔ بخاری کی مکمل روایت میں یہ بھی ذکر ہے کہ جو شخص یقین کے ساتھ دن میں یہ پڑھے اور شام سے پہلے فوت ہو جائے یا رات میں پڑھے اور صبح سے پہلے فوت ہو جائے، وہ جنتی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (6306). The full narration adds that whoever recites this with firm faith in the morning and dies before evening, or recites it at night and dies before morning, will be among the people of Paradise."
  },
  "importantWords": [
    {
      "arabic": "سَيِّدُ اَلِاسْتِغْفَارِ",
      "english": "Master of Forgiveness",
      "urdu": "استغفار کا سردار / سب سے افضل دعا"
    },
    {
      "arabic": "عَهْدِكَ وَوَعْدِكَ",
      "english": "Your covenant and promise",
      "urdu": "تیرا عہد اور تیرا وعدہ"
    },
    {
      "arabic": "أَبُوءُ",
      "english": "I acknowledge / confess",
      "urdu": "میں اعتراف کرتا ہوں / اقرار کرتا ہوں"
    },
    {
      "arabic": "شَرِّ مَا صَنَعْتُ",
      "english": "Evil of what I have done",
      "urdu": "اپنے کیے کے شر سے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث توبہ اور استغفار کی سب سے بہترین اور جامع دعا (سید الاستغفار) سکھاتی ہے، جس میں توحید کا اقرار، اللہ کی بندگی، نعمتوں کا اعتراف اور گناہوں سے معافی کی درخواست موجود ہے۔",
    "english": "This Hadith teaches 'Sayyid al-Istighfar,' the master supplication for seeking forgiveness, which combines the declaration of Monotheism, servitude to Allah, gratitude for blessings, and confession of sins."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6306)",
      "english": "Sahih al-Bukhari (6306)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "شداد بن أوس",
        "english": "Shaddad bin Aus"
      },
      "slug": "shaddad-bin-aus"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کی جامعیت اور فضیلت",
        "english": "Comprehensiveness and Virtue of the Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سید الاستغفار کیوں؟",
              "english": "Why is it the Master Supplication?"
            },
            "content": {
              "urdu": [
                "اس دعا کو 'سید' (سردار) اس لیے کہا گیا کیونکہ اس میں بندگی کے تمام آداب جمع ہیں۔",
                "اس کا آغاز اللہ کی ربوبیت اور توحید کے اعتراف سے ہوتا ہے جو دعا کی قبولیت کی بنیاد ہے۔",
                "یہ دعا انسان کو اپنی اصل حیثیت (اللہ کا بندہ ہونا) یاد دلاتی ہے۔"
              ],
              "english": [
                "It is called 'Sayyid' (Master) because it encompasses all etiquettes of servitude.",
                "It begins with acknowledging Allah's Lordship and Oneness, the foundation for accepted prayers.",
                "The prayer reminds a person of their true status as a slave to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کے اہم اجزاء کی تشریح",
        "english": "Explanation of Key Components"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عہد اور وعدہ",
              "english": "Covenant and Promise"
            },
            "content": {
              "urdu": [
                "عہد سے مراد وہ میثاق ہے جو روحوں نے اللہ سے کیا تھا کہ وہی ہمارا رب ہے۔",
                "وعدہ سے مراد وہ پختہ ارادہ ہے کہ ہم مرتے دم تک ایمان اور اطاعت پر قائم رہیں گے۔",
                "انسان اپنی کمزوری کا اعتراف کرتا ہے کہ وہ 'بساط بھر' (ما استطعت) کوشش کرے گا۔"
              ],
              "english": [
                "The covenant refers to the primordial testimony that Allah is our Lord.",
                "The promise refers to the firm intention to remain on faith and obedience until death.",
                "The human acknowledges limitation by saying 'as much as I can' (Ma istata'tu)."
              ]
            }
          },
          {
            "title": {
              "urdu": "نعمتوں اور گناہوں کا اعتراف",
              "english": "Confession of Blessings and Sins"
            },
            "content": {
              "urdu": [
                "سچی توبہ کے لیے ضروری ہے کہ انسان مانے کہ تمام نعمتیں اللہ کی طرف سے ہیں۔",
                "گناہوں کا صاف دل سے اقرار ہی عاجزی ہے اور یہی اللہ کو پسند ہے۔",
                "نعمتوں کے مقابلے میں اپنی کوتاہیوں کا ذکر انسان کے دل کو نرم کرتا ہے۔"
              ],
              "english": [
                "Sincere repentance requires acknowledging that all blessings are from Allah.",
                "An honest confession of sins is the essence of humility, which Allah loves.",
                "Mentioning one's shortcomings in the light of divine blessings softens the heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنت کی ضمانت",
        "english": "Guarantee of Paradise"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یقین کے ساتھ پڑھنا",
              "english": "Reciting with Firm Conviction"
            },
            "content": {
              "urdu": [
                "صرف الفاظ زبان سے کہنا کافی نہیں بلکہ دل میں ان کا یقین ہونا ضروری ہے۔",
                "نبی ﷺ نے اسے صبح اور شام پڑھنے پر جنت کی خوشخبری دی ہے۔",
                "یہ دعا بندے کے ایمان کی تجدید کرتی ہے اور اسے اللہ کے قریب لاتی ہے۔"
              ],
              "english": [
                "Uttering words is not enough; one must have firm belief in them in the heart.",
                "The Prophet (ﷺ) promised Paradise for those who recite it in the morning or evening.",
                "This supplication renews a believer's faith and draws them closer to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزمرہ کا معمول",
              "english": "Daily Practice"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو چاہیے کہ اسے زبانی یاد کرے اور فجر و مغرب کے بعد لازمی پڑھے۔",
                "گناہ ہو جانے کی صورت میں فوراً اس دعا کے ذریعے اللہ سے رجوع کریں۔",
                "اپنی زندگی کے ہر لمحے میں اللہ کی نعمتوں پر شکر اور اپنی خطاؤں پر استغفار کرتے رہیں۔"
              ],
              "english": [
                "Every Muslim should memorize this and recite it after Fajr and Maghrib.",
                "In case of committing a sin, immediately turn to Allah using this supplication.",
                "Always be in a state of gratitude for Allah's blessings and seeking forgiveness for mistakes."
              ]
            }
          }
        ]
      }
    }
  ]
}