{
  "hadithId": 1150,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/12/16"],
    "kitabId": 12,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأطعمة - باب الصيد والذبائح",
    "babId": 93
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1931). وأخرجه أبو داود (2855)، والنسائي (7/186)، وابن ماجه (3213).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام مسلم نے اپنی صحیح (1931) میں روایت کیا ہے۔ یہ روایت شکار کے حلال ہونے کی مدت اور اس کی جسمانی حالت کے متعلق اہم ضابطہ بیان کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (1931). Also reported by Abu Dawud (2855), An-Nasa'i (7/186), and Ibn Majah (3213)."
  },
  "importantWords": [
    {
      "arabic": "رَمَيْتَ",
      "english": "You shot / threw",
      "urdu": "تم نے تیر مارا"
    },
    {
      "arabic": "غَابَ",
      "english": "Disappeared / Hidden",
      "urdu": "اوجھل ہو گیا / غائب ہو گیا"
    },
    {
      "arabic": "أَدْرَكْتَهُ",
      "english": "You found it",
      "urdu": "تم نے اسے پا لیا"
    },
    {
      "arabic": "يُنْتِنْ",
      "english": "Become putrid / Stink",
      "urdu": "بدبودار ہو جائے / سڑ جائے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا خلاصہ یہ ہے کہ اگر شکاری کا تیر لگنے کے بعد جانور بھاگ جائے اور کچھ وقت بعد وہ مردہ ملے، تو وہ حلال ہے بشرطیکہ اس کے جسم میں تیر کا ہی زخم ہو اور وہ سڑ کر بدبودار نہ ہوا ہو۔",
    "english": "The summary of this Hadith is that if a wounded animal escapes after being hit by an arrow and is found dead later, it is Halal to eat, provided its death was caused by that arrow and the meat has not spoiled or become rotten."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1931)",
      "english": "Sahih Muslim (1931)"
    },
    {
      "arabic": "سنن أبي داود (2855)",
      "english": "Sunan Abi Dawud (2855)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو ثعلبة الخشني",
        "english": "Abu Tha'laba al-Khushani"
      },
      "slug": "abu-thalaba-al-khushani"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شکار کے اوجھل ہونے کا حکم",
        "english": "Ruling on Game Disappearing After Shooting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موت کا سبب",
              "english": "Cause of Death"
            },
            "content": {
              "urdu": [
                "اگر جانور تیر لگنے کے بعد غائب ہو جائے اور شکاری اسے تلاش کر کے مردہ پائے تو وہ حلال ہے۔",
                "شرط یہ ہے کہ موت کا واضح سبب وہی تیر ہو جو شکاری نے 'بسم اللہ' پڑھ کر مارا تھا۔",
                "اگر جانور میں کسی درندے کے دانتوں یا کسی دوسرے مہلک زخم کا نشان ملے تو وہ حرام ہو جائے گا۔"
              ],
              "english": [
                "If an animal disappears after being hit and is later found dead, it remains Halal.",
                "The condition is that the clear cause of death must be the arrow shot with 'Bismillah'.",
                "If marks from a predator or any other lethal wound are found, the animal becomes Haram."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی قید",
              "english": "Time Limitation"
            },
            "content": {
              "urdu": [
                "دوسری روایات کی روشنی میں، اگر شکاری اسے دو یا تین دن بعد بھی پائے تو وہ کھا سکتا ہے۔",
                "وقت کی کوئی خاص حد مقرر نہیں ہے بلکہ اصل معیار گوشت کی حالت ہے۔",
                "جب تک گوشت کھانے کے قابل ہو اور خراب نہ ہوا ہو، وہ حلال ہی رہتا ہے۔"
              ],
              "english": [
                "In light of other narrations, the hunter can eat it even if found after two or three days.",
                "There is no specific time limit; the primary criterion is the condition of the meat.",
                "As long as the meat is edible and hasn't spoiled, it remains Halal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گوشت کے سڑنے (انتان) کی ممانعت",
        "english": "Prohibition of Consuming Putrid Meat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدبو دار گوشت",
              "english": "Malodorous Meat"
            },
            "content": {
              "urdu": [
                "اگر گوشت میں تعفن یا سڑاند پیدا ہو جائے (Putrefaction)، تو اسے کھانا ممنوع ہے۔",
                "اس ممانعت کی بنیادی وجہ طبی نقصانات اور 'طیب' غذا کا اسلامی تصور ہے۔",
                "سڑا ہوا گوشت انسانی صحت کے لیے زہریلا ثابت ہو سکتا ہے۔"
              ],
              "english": [
                "If the meat starts to decay or develops a foul smell, eating it is forbidden.",
                "The reason for this is medical risk and the Islamic concept of 'Tayyib' (pure) food.",
                "Decayed meat can be toxic and harmful to human health."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی پہلو",
              "english": "Medical Aspect"
            },
            "content": {
              "urdu": [
                "اسلام نے چودہ سو سال پہلے گوشت کے خراب ہونے کی صورت میں اس کے استعمال سے روکا۔",
                "گوشت کے سڑنے سے اس میں بیکٹیریا اور زہریلے مادے پیدا ہو جاتے ہیں۔",
                "یہ حکم حفظانِ صحت کے جدید اصولوں کے عین مطابق ہے۔"
              ],
              "english": [
                "Islam prevented the consumption of spoiled meat 1400 years ago.",
                "Decomposing meat produces harmful bacteria and toxins.",
                "This ruling aligns perfectly with modern principles of hygiene and food safety."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی میں گرنے کا مسئلہ",
              "english": "The Issue of Falling in Water"
            },
            "content": {
              "urdu": [
                "اگر اوجھل ہونے کے بعد جانور پانی میں گرا ہوا ملے تو وہ حرام ہوگا۔",
                "کیونکہ یہ احتمال ہے کہ اس کی موت زخم سے نہیں بلکہ پانی میں ڈوبنے (دم گھٹنے) سے ہوئی ہو۔",
                "شک کی صورت میں حرمت کا پہلو غالب رہتا ہے۔"
              ],
              "english": [
                "If the missing animal is found in water, it becomes Haram.",
                "There is a possibility it died from drowning rather than the arrow wound.",
                "In cases of doubt, the ruling of prohibition prevails."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحت کا خیال",
              "english": "Care for Health"
            },
            "content": {
              "urdu": [
                "مسلمان کو صرف وہی چیز کھانی چاہیے جو صاف ستھری اور صحت بخش ہو۔",
                "خراب یا مشکوک خوراک سے پرہیز کرنا سنتِ نبوی ہے۔",
                "کھانے پینے کے معاملات میں احتیاط برتنا جسمانی اور روحانی تندرستی کے لیے ضروری ہے۔"
              ],
              "english": [
                "A Muslim should only eat what is clean and healthy.",
                "Avoiding spoiled or doubtful food is a Sunnah of the Prophet (ﷺ).",
                "Being cautious in dietary habits is essential for physical and spiritual health."
              ]
            }
          }
        ]
      }
    }
  ]
}