{
  "hadithId": 552,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/46"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1162). ساقه الحافظ في بلوغ المرام بتقديم وتأخير في الألفاظ حسب تبويب الكتاب.",
    "urdu": "صحیح۔ اسے امام مسلم نے اپنی صحیح (1162) میں روایت کیا ہے۔ اس حدیث میں نفلی روزوں کی فضیلت کا جامع بیان موجود ہے۔",
    "english": "Sahih. Reported by Muslim (1162). The author of Bulugh al-Maram presented it with slight reordering of phrases to suit the chapter's context."
  },
  "importantWords": [
    {
      "arabic": "يُكَفِّرُ",
      "english": "Expiates / Atone",
      "urdu": "مٹا دیتا ہے / کفارہ بنتا ہے"
    },
    {
      "arabic": "اَلْمَاضِيَةَ",
      "english": "The past",
      "urdu": "گزشتہ"
    },
    {
      "arabic": "الْبَاقِيَةَ",
      "english": "The coming / remaining",
      "urdu": "آنے والا"
    },
    {
      "arabic": "وُلِدْتُ",
      "english": "I was born",
      "urdu": "میں پیدا ہوا"
    },
    {
      "arabic": "بُعِثْتُ",
      "english": "I was commissioned",
      "urdu": "میں مبعوث کیا گیا"
    },
    {
      "arabic": "أُنْزِلَ",
      "english": "Was revealed",
      "urdu": "نازل کیا گیا"
    }
  ],
  "summary": {
    "urdu": "عرفہ اور عاشورہ کے روزے گناہوں کی معافی کا ذریعہ ہیں، جبکہ سوموار کا روزہ نبی ﷺ کی ولادت اور وحی کے آغاز کے شکریہ کے طور پر مسنون ہے۔",
    "english": "Fasting on 'Arafah and 'Ashura serves as atonement for sins, while fasting on Mondays is recommended as gratitude for the Prophet's birth and the start of Revelation."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1162)",
      "english": "Reported by Muslim (1162)"
    },
    {
      "arabic": "جامع الترمذي (749)",
      "english": "Jami' at-Tirmidhi (749)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abu Qatadah al-Ansari"
      },
      "slug": "abu-qatadah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=J9H7C1Qz8uY",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "یومِ عرفہ کے روزے کی فضیلت",
        "english": "Virtue of Fasting on the Day of Arafah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دو سالوں کے گناہوں کا کفارہ",
              "english": "Atonement for Two Years of Sins"
            },
            "content": {
              "urdu": [
                "عرفہ کا روزہ پچھلے ایک سال اور آنے والے ایک سال کے گناہوں کو مٹا دیتا ہے۔",
                "یہ اللہ تعالیٰ کی طرف سے امتِ محمدیہ کے لیے بہت بڑی رعایت ہے۔",
                "اس سے مراد صغیرہ گناہ ہیں، کیونکہ کبیرہ گناہوں کے لیے توبہ ضروری ہے۔"
              ],
              "english": [
                "The fast of Arafah expiates sins of the preceding and following year.",
                "This is a massive concession from Allah for the Ummah of Muhammad (ﷺ).",
                "This refers to minor sins, as major sins require specific repentance."
              ]
            }
          },
          {
            "title": {
              "urdu": "عرفہ کا روزہ کن کے لیے ہے؟",
              "english": "Who Should Fast on Arafah?"
            },
            "content": {
              "urdu": [
                "یہ روزہ ان لوگوں کے لیے مسنون ہے جو حج پر نہیں گئے ہوں۔",
                "حاجیوں کے لیے عرفات کے میدان میں روزہ نہ رکھنا افضل ہے۔",
                "تاکہ حاجی عبادات اور دعاؤں کے لیے جسمانی توانائی برقرار رکھ سکیں۔"
              ],
              "english": [
                "This fast is sunnah for those who are not performing Hajj.",
                "For pilgrims at Arafat, it is better not to fast.",
                "This ensures pilgrims have the strength for worship and supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "یومِ عاشورہ اور اس کا اجر",
        "english": "Day of Ashura and its Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گزشتہ سال کی معافی",
              "english": "Forgiveness of the Past Year"
            },
            "content": {
              "urdu": [
                "عاشورہ (10 محرم) کا روزہ ایک سال کے گناہوں کا کفارہ بنتا ہے۔",
                "یہ دن فرعون سے بنی اسرائیل کی نجات کی یادگار ہے۔",
                "نبی ﷺ نے اس دن شکرانے کے طور پر روزہ رکھنے کی ترغیب دی۔"
              ],
              "english": [
                "Fasting on Ashura (10th Muharram) expiates one year of sins.",
                "This day commemorates the salvation of Israelites from Pharaoh.",
                "The Prophet (ﷺ) encouraged fasting on this day out of gratitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "یہودیوں کی مخالفت",
              "english": "Differentiating from Jews"
            },
            "content": {
              "urdu": [
                "سنت یہ ہے کہ 10 محرم کے ساتھ 9 یا 11 کا روزہ بھی ملایا جائے۔",
                "اس کا مقصد اہل کتاب (یہودیوں) کی مشابہت سے بچنا ہے۔",
                "اسلام ہر معاملے میں اپنی الگ اور ممتاز شناخت قائم کرتا ہے۔"
              ],
              "english": [
                "It is sunnah to fast the 9th or 11th along with the 10th of Muharram.",
                "The purpose is to avoid complete imitation of the People of the Book.",
                "Islam establishes its unique identity in every matter of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سوموار کے روزے کی حکمت",
        "english": "Wisdom Behind Fasting on Mondays"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولادت اور وحی کا دن",
              "english": "Day of Birth and Revelation"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے سوموار کے روزے کی وجہ اپنی ولادت اور بعثت بتائی۔",
                "یہ دن نعمتِ رسالت اور نعمتِ قرآن کے نزول کا دن ہے۔",
                "روزہ رکھنا ان عظیم نعمتوں پر اللہ کا شکر ادا کرنے کا بہترین طریقہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) cited his birth and commission as reasons for fasting Mondays.",
                "This day marks the blessing of Prophethood and the Quran's revelation.",
                "Fasting is the best way to thank Allah for these immense blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعمال کی پیشی",
              "english": "Presentation of Deeds"
            },
            "content": {
              "urdu": [
                "دیگر احادیث کے مطابق سوموار اور جمعرات کو اعمال اللہ کے سامنے پیش ہوتے ہیں۔",
                "نبی ﷺ نے پسند فرمایا کہ جب اعمال پیش ہوں تو وہ روزے سے ہوں۔",
                "ہفتہ وار بنیادوں پر یہ روزہ روحانی پاکیزگی کا ذریعہ ہے۔"
              ],
              "english": [
                "Deeds are presented to Allah on Mondays and Thursdays according to other reports.",
                "The Prophet (ﷺ) loved to be fasting when his deeds were presented.",
                "This weekly fast serves as a means of spiritual purification."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی اسباق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفلی عبادات کی اہمیت",
              "english": "Importance of Voluntary Worship"
            },
            "content": {
              "urdu": [
                "نفلی روزے اللہ تعالیٰ کے قرب کا بہترین ذریعہ ہیں۔",
                "یہ روزے فرائض کی کمی کو پورا کرنے میں مددگار ثابت ہوتے ہیں۔",
                "مومن کو چاہیے کہ ان فضیلت والے دنوں کو ضائع نہ کرے۔"
              ],
              "english": [
                "Voluntary fasts are an excellent means of gaining closeness to Allah.",
                "These fasts help compensate for deficiencies in obligatory acts.",
                "A believer should not waste these virtuous and rewarding days."
              ]
            }
          },
          {
            "title": {
              "urdu": "نعمتوں پر شکر گزاری",
              "english": "Gratitude for Blessings"
            },
            "content": {
              "urdu": [
                "عبادت کے ذریعے نعمتوں کا جشن منانا اسلامی طریقہ ہے۔",
                "نبی ﷺ کی سیرت سے ہمیں ہر حال میں بندگی کا سبق ملتا ہے۔",
                "گناہوں کی معافی کے مواقع تلاش کرنا عقل مند مومن کی نشانی ہے۔"
              ],
              "english": [
                "Celebrating blessings through worship is the Islamic way.",
                "The Prophet's (ﷺ) life teaches us servitude in every situation.",
                "Seeking opportunities for forgiveness is the sign of a wise believer."
              ]
            }
          }
        ]
      }
    }
  ]
}