{
  "hadithId": 1302,
  "hadithNo": 26,
  "hadithReferences": {
    "sunnah.com": ["bulugh:1502"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده. أخرجه الطبراني في الأوسط (931) وأبو يعلى (4338) وابن أبي الدنيا في كتاب الصمت (560). وصححه الألباني في السلسلة الصحيحة (2360).",
    "urdu": "یہ حدیث اپنے شواہد کے ساتھ صحیح ہے۔ اسے طبرانی نے الاوسط (931) اور ابو یعلیٰ نے (4338) میں روایت کیا ہے۔ علامہ البانی نے اسے 'سلسلہ صحیحہ' میں صحیح قرار دیا ہے۔",
    "english": "Sahih through supporting evidences. Reported by At-Tabarani in Al-Awsat (931), Abu Ya'la (4338), and Ibn Abi ad-Dunya. Authenticated by Al-Albani in As-Silsilah as-Sahihah (2360)."
  },
  "importantWords": [
    {
      "arabic": "كَفَّ",
      "english": "Restrained / Withheld",
      "urdu": "روک لیا / قابو کیا"
    },
    {
      "arabic": "غَضَبَهُ",
      "english": "His anger",
      "urdu": "اپنا غصہ"
    },
    {
      "arabic": "عَذَابَهُ",
      "english": "His punishment",
      "urdu": "اپنا عذاب"
    },
    {
      "arabic": "شَاهِدٌ",
      "english": "Witness / Supporting evidence",
      "urdu": "گواہ / شاہد روایت"
    },
    {
      "arabic": "عَوْرَتَهُ",
      "english": "His faults / private parts",
      "urdu": "اس کے عیب / پردہ پوشی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غصے پر قابو پانے کی عظیم فضیلت بیان کرتی ہے کہ جو بندہ دنیا میں لوگوں پر غصہ نہیں نکالتا، اللہ تعالیٰ قیامت کے دن اس سے اپنا عذاب ہٹا لیتا ہے۔",
    "english": "This Hadith highlights the virtue of anger management, stating that restraining anger toward others results in Allah withholding His punishment on the Day of Judgment."
  },
  "references": [
    {
      "arabic": "المعجم الأوسط للطبراني (931)",
      "english": "Al-Mu'jam al-Awsat by At-Tabarani (931)"
    },
    {
      "arabic": "مسند أبي يعلى (4338)",
      "english": "Musnad Abu Ya'la (4338)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A_zWp7S7v-g",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غصہ اور مکافاتِ عمل",
        "english": "Anger and Divine Retribution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جیسا کرو گے ویسا بھرو گے",
              "english": "As You Sow, So Shall You Reap"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ کا اصول ہے کہ بندے کے ساتھ اس کے عمل جیسا سلوک کیا جاتا ہے۔",
                "اگر انسان لوگوں کی غلطیوں پر غصہ پی جاتا ہے تو اللہ اس کے گناہوں سے درگزر فرماتا ہے۔",
                "دوسروں پر رحم کرنا اللہ کی رحمت کے حصول کا ایک بڑا ذریعہ ہے۔"
              ],
              "english": [
                "Allah's principle is to treat the servant according to his own actions toward others.",
                "If a person swallows their anger at people's mistakes, Allah overlooks their sins.",
                "Showing mercy to others is a primary means of obtaining Allah's mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "عذاب سے نجات کا راستہ",
              "english": "Way to Escape Punishment"
            },
            "content": {
              "urdu": [
                "قیامت کا دن انتہائی ہولناک ہوگا جہاں ہر کوئی اللہ کے عذاب سے ڈر رہا ہوگا۔",
                "اس دن کی سختی سے بچنے کے لیے غصے پر قابو پانا ایک بہترین نسخہ ہے۔",
                "جو یہاں اپنی طاقت کے باوجود معاف کرے گا، اللہ وہاں قدرت کے باوجود عذاب سے بچائے گا۔"
              ],
              "english": [
                "The Day of Resurrection will be terrifying, with everyone fearing Allah's wrath.",
                "Controlling anger is an excellent remedy to escape the hardships of that day.",
                "Whoever forgives here despite having power, Allah will spare them there despite His power."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غصے پر قابو پانے کی اہمیت",
        "english": "The Importance of Restraining Anger"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقیقی بہادری",
              "english": "True Bravery"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ اصل بہادر وہ ہے جو غصے کے وقت اپنے نفس پر قابو رکھے۔",
                "جذبات میں آکر انتقام لینا آسان ہے لیکن خاموش رہنا مشکل ترین مجاہدہ ہے۔",
                "غصے کو پینا ایمان کی پختگی اور کردار کی عظمت کی دلیل ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said the truly strong is the one who controls himself during anger.",
                "Taking revenge in the heat of emotion is easy, but remaining silent is a great struggle.",
                "Suppressing anger is evidence of firm faith and greatness of character."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی فوائد",
              "english": "Social Benefits"
            },
            "content": {
              "urdu": [
                "غصہ گھروں اور معاشروں میں فساد اور لڑائی جھگڑوں کی بنیاد بنتا ہے۔",
                "اگر لوگ غصہ روک لیں تو طلاقوں اور قتل و غارت کی شرح میں نمایاں کمی آسکتی ہے۔",
                "صبر اور حلم سے باہمی تعلقات میں محبت اور استحکام پیدا ہوتا ہے۔"
              ],
              "english": [
                "Anger is the foundation of discord and conflicts within homes and societies.",
                "Restraining anger can significantly reduce rates of divorce and violence.",
                "Patience and forbearance create love and stability in mutual relationships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور نفسیاتی اثرات",
        "english": "Spiritual and Psychological Effects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قلبی سکون",
              "english": "Peace of Heart"
            },
            "content": {
              "urdu": [
                "غصہ انسان کے اندرونی سکون کو برباد کر کے بے چینی پیدا کر دیتا ہے۔",
                "غصہ پینے والے کے دل کو اللہ تعالیٰ ایمان اور اطمینان سے بھر دیتا ہے۔",
                "نفسیاتی طور پر ضبطِ نفس انسان کو ذہنی تناؤ اور بلڈ پریشر جیسی بیماریوں سے بچاتا ہے۔"
              ],
              "english": [
                "Anger destroys inner peace and creates restless anxiety within an individual.",
                "Allah fills the heart of the one who restrains anger with faith and tranquility.",
                "Psychologically, self-control protects a person from stress and ailments like hypertension."
              ]
            }
          },
          {
            "title": {
              "urdu": "پردہ پوشی کا صلہ",
              "english": "Reward for Covering Faults"
            },
            "content": {
              "urdu": [
                "حدیث کے شاہد الفاظ کے مطابق غصہ روکنے والے کے عیبوں پر اللہ پردہ ڈالتا ہے۔",
                "جب انسان غصے میں کسی کی تذلیل نہیں کرتا تو اللہ اسے رسوائی سے بچاتا ہے۔",
                "دوسروں کے پردے رکھنا درحقیقت اپنی عاقبت سنوارنے کا عمل ہے۔"
              ],
              "english": [
                "According to supporting narrations, Allah covers the faults of those who restrain anger.",
                "When a person refrains from humiliating others in rage, Allah protects them from disgrace.",
                "Covering others' faults is actually an act of securing one's own future in the hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور سبق",
        "english": "Practical Training and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبوی علاج",
              "english": "Prophetic Remedies"
            },
            "content": {
              "urdu": [
                "غصہ آئے تو 'اعوذ باللہ' پڑھنا شیطان کے اثر کو ختم کرنے کا نبوی طریقہ ہے۔",
                "وضو کرنا اور اپنی جسمانی حالت بدل لینا غصے کی آگ کو ٹھنڈا کرتا ہے۔",
                "خاموشی اختیار کرنا سب سے بہترین دفاع ہے جو پچھتاوے سے بچاتا ہے۔"
              ],
              "english": [
                "Reciting 'A'udhu billah' is the Prophetic way to nullify Satan's influence during anger.",
                "Performing Wudu and changing one's physical posture cools the fire of rage.",
                "Adopting silence is the best defense that saves a person from future regret."
              ]
            }
          },
          {
            "title": {
              "urdu": "عفو و درگزر کی عادت",
              "english": "Habit of Forgiveness"
            },
            "content": {
              "urdu": [
                "ہمیں ہر وقت یاد رکھنا چاہیے کہ ہم خود بھی اللہ کی معافی کے طلبگار ہیں۔",
                "غصہ آنے پر اللہ کی قدرت اور اپنی عاجزی کو یاد کرنا چاہیے۔",
                "روزمرہ زندگی میں لوگوں کی چھوٹی غلطیوں کو نظر انداز کرنا ہی تقویٰ ہے۔"
              ],
              "english": [
                "We must always remember that we ourselves are seekers of Allah's forgiveness.",
                "When angry, one should recall Allah's supreme power and their own humility.",
                "Overlooking small mistakes of people in daily life is the essence of piety."
              ]
            }
          }
        ]
      }
    }
  ]
}