{
  "hadithId": 1281,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh:1481"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أحمد (23630)، والطبراني في الكبير (4/253). وصححه الألباني في السلسلة الصحيحة (951).",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام احمد (23630) اور طبرانی نے روایت کیا ہے۔ علامہ البانی نے اسے سلسلہ صحیحہ میں صحیح قرار دیا ہے۔ اس کے آخر میں یہ بھی ہے کہ اللہ قیامت کے دن ریاکاروں سے فرمائے گا کہ ان کے پاس جاؤ جنہیں دنیا میں دکھاتے تھے، دیکھو کیا وہاں کوئی بدلہ ملتا ہے۔",
    "english": "Hasan (Good). Reported by Ahmad (23630) and At-Tabarani. Authenticated by Al-Albani in As-Silsilah as-Sahihah (951). The narration adds that on the Day of Judgment, Allah will tell those who showed off to go to those they were showing off to in the world and see if they find any reward with them."
  },
  "importantWords": [
    {
      "arabic": "أَخْوَفَ",
      "english": "Most fearful",
      "urdu": "سب سے زیادہ ڈر"
    },
    {
      "arabic": "أَخَافُ",
      "english": "I fear",
      "urdu": "میں ڈرتا ہوں"
    },
    {
      "arabic": "الشِّرْكُ",
      "english": "Polytheism",
      "urdu": "شرک"
    },
    {
      "arabic": "الأَصْغَرُ",
      "english": "The lesser / smaller",
      "urdu": "چھوٹا / اصغر"
    },
    {
      "arabic": "الرِّيَاءُ",
      "english": "Showing off",
      "urdu": "ریاکاری / دکھاوا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ریاکاری (دکھاوے) کی مذمت کرتی ہے اور اسے 'شرکِ اصغر' قرار دے کر خبردار کرتی ہے کہ یہ نیکیوں کو برباد کرنے والا ایک مخفی گناہ ہے۔",
    "english": "This Hadith condemns showing off (Riya) and labels it as 'Lesser Shirk,' warning that it is a hidden sin that nullifies good deeds."
  },
  "references": [
    {
      "arabic": "مسند أحمد (23630)",
      "english": "Musnad Ahmad (23630)"
    },
    {
      "arabic": "السلسلة الصحيحة (951)",
      "english": "As-Silsilah as-Sahihah (951)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "محمود بن لبيد الأنصاري",
        "english": "Mahmud bin Labid al-Ansari"
      },
      "slug": "mahmud-bin-labid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R0uWlV_E0Yk",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شرکِ اصغر کی حقیقت",
        "english": "The Reality of Lesser Shirk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ریاکاری کا مفہوم",
              "english": "Meaning of Showing Off"
            },
            "content": {
              "urdu": [
                "ریاکاری سے مراد عبادت کے ذریعے اللہ کے بجائے لوگوں کی تعریف حاصل کرنا ہے۔",
                "نبی ﷺ نے اسے شرکِ اصغر اس لیے کہا کیونکہ اس میں نیت غیر اللہ کے لیے ہوتی ہے۔",
                "یہ ایک مخفی گناہ ہے جو انسان کے دل میں چھپ کر آتا ہے۔"
              ],
              "english": [
                "Showing off means seeking praise from people through worship instead of Allah.",
                "The Prophet (ﷺ) called it lesser Shirk because the intention is for other than Allah.",
                "It is a hidden sin that enters the human heart very subtly."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا خوف",
              "english": "What the Prophet (ﷺ) Feared"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کو اپنی امت کے بارے میں اس گناہ کا سب سے زیادہ ڈر تھا۔",
                "بڑے شرک کی پہچان آسان ہے، مگر ریاکاری نیکی کے لبادے میں ہوتی ہے۔",
                "یہ نیک لوگوں کے لیے زیادہ خطرناک ہے کیونکہ یہ عبادات میں داخل ہو جاتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) feared this sin most for his Ummah among all trials.",
                "Major Shirk is easy to recognize, but Riya is hidden within virtuous acts.",
                "It is particularly dangerous for the pious as it infiltrates their acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نیک اعمال پر اثرات",
        "english": "Effects on Good Deeds"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال کی بربادی",
              "english": "Nullification of Deeds"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ صرف وہی عمل قبول کرتا ہے جو خالص اسی کے لیے ہو۔",
                "اگر نیکی میں دکھاوا شامل ہو جائے تو وہ نیکی ضائع ہو جاتی ہے۔",
                "ریاکاری نیکی کے ثمر کو ایسے ختم کرتی ہے جیسے دیمک لکڑی کو۔"
              ],
              "english": [
                "Allah only accepts deeds that are performed purely and solely for His sake.",
                "If showing off is mixed with a good deed, that deed becomes void.",
                "Riya destroys the fruit of a good deed like termites destroying wood."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیامت کی رسوائی",
              "english": "Disgrace on Judgment Day"
            },
            "content": {
              "urdu": [
                "قیامت کے دن اللہ ریاکاروں کو ان کے حال پر چھوڑ دے گا۔",
                "انہیں کہا جائے گا کہ ان لوگوں سے اجر مانگو جنہیں دکھانے کے لیے عمل کیا تھا۔",
                "اس دن تمام پوشیدہ نیتیں ظاہر کر دی جائیں گی۔"
              ],
              "english": [
                "On the Day of Resurrection, Allah will abandon the people of Riya.",
                "They will be told to seek rewards from those they tried to impress in the world.",
                "On that day, all hidden intentions and secrets will be laid bare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاص کی اہمیت",
        "english": "Importance of Sincerity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خالص نیت",
              "english": "Pure Intentions"
            },
            "content": {
              "urdu": [
                "دین کی بنیاد 'الاخلاص' یعنی نیت کی پاکیزگی پر ہے۔",
                "مومن کو چاہیے کہ وہ اپنی عبادات کو لوگوں کی نظروں سے بچائے۔",
                "تہائی رات کی دعا اور خفیہ صدقہ اخلاص پیدا کرنے کے بہترین طریقے ہیں۔"
              ],
              "english": [
                "The foundation of religion is based on 'Al-Ikhlas' (purity of intention).",
                "A believer should strive to keep their worship hidden from the eyes of people.",
                "Late-night prayers and secret charity are best ways to cultivate sincerity."
              ]
            }
          },
          {
            "title": {
              "urdu": "قلبی سکون",
              "english": "Peace of Heart"
            },
            "content": {
              "urdu": [
                "ریاکار ہمیشہ لوگوں کی رائے کا غلام اور بے چین رہتا ہے۔",
                "مخلص انسان صرف اللہ کی رضا دیکھتا ہے اور اسے سکون حاصل ہوتا ہے۔",
                "لوگوں کی خوشنودی حاصل کرنا ایک ایسا ہدف ہے جو کبھی پورا نہیں ہو سکتا۔"
              ],
              "english": [
                "A person who shows off remains a slave to public opinion and is restless.",
                "A sincere person looks only for Allah's approval and finds true peace.",
                "Seeking the pleasure of people is a goal that can never be fully achieved."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اصلاح اور دعا",
        "english": "Practical Reform and Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محاسبہ نفس",
              "english": "Self-Examination"
            },
            "content": {
              "urdu": [
                "ہر نیکی شروع کرنے سے پہلے اپنی نیت کو چیک کرنا ضروری ہے۔",
                "نیکی کے دوران بھی اپنے دل کی کیفیت پر نظر رکھنی چاہیے۔",
                "اگر دکھاوے کا وسوسہ آئے تو فوراً اللہ سے توبہ کرنی چاہیے۔"
              ],
              "english": [
                "It is essential to check one's intention before starting any good deed.",
                "One must monitor the state of their heart even during the performance of the deed.",
                "If a thought of showing off occurs, one should immediately repent to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحفظ کی دعا",
              "english": "Supplication for Protection"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے شرک سے بچنے کی خاص دعا سکھائی ہے۔",
                "اللہ سے ہر اس شرک کی معافی مانگنی چاہیے جسے ہم جانتے ہیں یا نہیں جانتے۔",
                "استغفار کی کثرت ریاکاری کے زہر کا تریاق ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) taught a specific prayer to seek protection from Shirk.",
                "We must ask Allah for forgiveness for Shirk we are aware of or unaware of.",
                "Abundant seeking of forgiveness (Istighfar) is the antidote to the poison of Riya."
              ]
            }
          }
        ]
      }
    }
  ]
}