{
  "hadithId": 794,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/794"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
 
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري ( 2622 )‏ ، ومسلم (1620)‏. والحديث بتمامه فيه قوله ﷺ: «فإن العائد في صدقته، كالكلب يعود في قيئه».",
    "urdu": "صحیح۔ اسے امام بخاری (2622) اور امام مسلم (1620) نے روایت کیا ہے۔ اس کے مکمل الفاظ میں یہ تشبیہ بھی موجود ہے کہ اپنی دی ہوئی نیکی یا صدقہ کو واپس لینا کتے کے اپنی قے چاٹنے جیسا عمل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2622) and Muslim (1620). The complete Hadith includes the Prophet's statement: \"For the one who takes back his charity is like a dog that returns to its vomit.\""
  },
  "importantWords": [
    {
      "arabic": "حَمَلْتُ",
      "english": "I provided a mount",
      "urdu": "میں نے سواری دی"
    },
    {
      "arabic": "أَضَاعَهُ",
      "english": "Neglected / Wasted it",
      "urdu": "اسے ضائع یا ناکارہ کر دیا"
    },
    {
      "arabic": "بِرُخْصٍ",
      "english": "At a cheap price",
      "urdu": "سستے داموں"
    },
    {
      "arabic": "لَا تَبْتَعْهُ",
      "english": "Do not buy it",
      "urdu": "اسے مت خریدو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں صدقہ کی ہوئی چیز کو دوبارہ خریدنے سے منع کیا گیا ہے، چاہے وہ سستی ہی کیوں نہ مل رہی ہو۔ اس کا مقصد نیکی کے خلوص کو برقرار رکھنا اور احسان جتلانے کے شبہ سے بچنا ہے۔",
    "english": "This Hadith prohibits repurchasing something given in charity, even at a bargain price, to maintain the sincerity of the act and avoid any appearance of reclaiming a favor."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2622)",
      "english": "Reported by Al-Bukhari (2622)"
    },
    {
      "arabic": "رواه مسلم (1620)",
      "english": "Reported by Muslim (1620)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صدقہ کی واپسی کی ممانعت",
        "english": "Prohibition of Returning Charity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خریداری کے ذریعے واپسی",
              "english": "Returning through Purchase"
            },
            "content": {
              "urdu": [
                "اگرچہ خریدنا ایک تجارتی معاملہ ہے، لیکن اپنی ہی صدقہ کی ہوئی چیز خریدنا شرعی طور پر ناپسندیدہ ہے۔",
                "اس میں یہ اندیشہ ہوتا ہے کہ بیچنے والا شرم و مروت میں آ کر سستا بیچ دے گا، جو ایک طرح سے صدقہ کی واپسی ہی کہلائے گی۔",
                "نبی ﷺ نے 'ایک درہم' کی مثال دے کر اس معاملے کی سختی کو واضح فرمایا۔"
              ],
              "english": [
                "Although buying is a commercial act, repurchasing one's own charity is Shariah-prohibited.",
                "There is a risk the seller might lower the price out of shyness, effectively making it a partial return of charity.",
                "The Prophet (ﷺ) used the 'one Dirham' example to emphasize the strictness of this rule."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلوصِ نیت کی حفاظت",
              "english": "Protecting Sincerity of Intention"
            },
            "content": {
              "urdu": [
                "صدقہ خالص اللہ کی رضا کے لیے ہوتا ہے، اس کے بعد اس چیز سے کسی بھی قسم کا دنیاوی فائدہ حاصل کرنا نیکی کے اجر کو کم کر سکتا ہے۔",
                "مومن کا دل اس چیز سے مکمل طور پر جدا ہو جانا چاہیے جو اس نے اللہ کو دے دی۔",
                "نبی ﷺ نے اس عمل کو کتے کی قے سے تشبیہ دے کر اس کی اخلاقی قباحت بیان فرمائی۔"
              ],
              "english": [
                "Charity is purely for Allah's sake; seeking any worldly benefit from it afterward can diminish the reward.",
                "A believer's heart should completely detach from what has been given to Allah.",
                "The Prophet (ﷺ) described the moral repulsiveness of this act by comparing it to a dog's vomit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور استثنا",
        "english": "Juristic Aspects and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وراثت کے ذریعے واپسی",
              "english": "Return through Inheritance"
            },
            "content": {
              "urdu": [
                "اگر صدقہ لینے والا وفات پا جائے اور وہ چیز وراثت میں صدقہ دینے والے کو ملے، تو وہ جائز ہے۔",
                "کیونکہ وراثت ایک جبری منتقلی ہے، اس میں انسان کی اپنی خواہش یا خریداری شامل نہیں ہوتی۔",
                "ممانعت صرف ان صورتوں میں ہے جہاں انسان ارادی طور پر اس چیز کو دوبارہ حاصل کرے۔"
              ],
              "english": [
                "If the recipient dies and the original donor inherits the item, it is permissible.",
                "Inheritance is a compulsory legal transfer, not involving personal desire or purchase.",
                "The prohibition only applies to intentional acts of reclaiming the item."
              ]
            }
          },
          {
            "title": {
              "urdu": "تیسرے فریق سے خریدنا",
              "english": "Buying from a Third Party"
            },
            "content": {
              "urdu": [
                "اگر صدقہ لینے والا اسے کسی دوسرے کو بیچ دے، اور آپ اس تیسرے شخص سے خریدیں، تو اکثر فقہاء اسے جائز قرار دیتے ہیں۔",
                "کیونکہ اب وہ تعلق ختم ہو چکا ہے جس کی وجہ سے مروت یا رعایت کا خدشہ تھا۔",
                "تاہم تقویٰ کا تقاضا یہی ہے کہ اپنی دی ہوئی چیز سے دور رہا جائے۔"
              ],
              "english": [
                "If the recipient sells it to someone else, buying it from that third party is generally allowed by jurists.",
                "The direct link involving potential shyness or undue discount is broken in this case.",
                "However, piety (Taqwa) suggests staying away from what was once given away."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا عمر کی امانت و دیانت",
        "english": "Integrity of Umar (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشورے کی اہمیت",
              "english": "Importance of Seeking Counsel"
            },
            "content": {
              "urdu": [
                "سیدنا عمر رضی اللہ عنہ کا خود فیصلہ کرنے کے بجائے آپ ﷺ سے پوچھنا ان کی احتیاط کو ظاہر کرتا ہے۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ مشکوک معاملات میں عمل سے پہلے اہل علم سے رجوع کرنا چاہیے۔",
                "صحابہ کرام اپنے مالی معاملات کو شریعت کے مطابق ڈھالنے کے لیے بے تاب رہتے تھے۔"
              ],
              "english": [
                "Umar's (RA) decision to consult the Prophet (ﷺ) instead of acting alone shows his extreme caution.",
                "This Hadith teaches us to consult scholars in doubtful matters before taking action.",
                "The Sahaba were eager to align their financial dealings strictly with Shariah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اموالِ جہاد کی حفاظت",
              "english": "Protection of Jihad Assets"
            },
            "content": {
              "urdu": [
                "گھوڑا اللہ کے راستے میں دینا ایک عظیم عمل تھا، لیکن اس کی بے قدری دیکھ کر سیدنا عمر کو دکھ ہوا۔",
                "نبی ﷺ نے ان کی توجہ اس سے ہٹا کر ایک بڑے اخلاقی اصول کی طرف مبذول کرائی۔",
                "نیکی ضائع نہیں ہوتی، چاہے وہ چیز جس پر خرچ کیا گیا وہ ناکارہ ہی کیوں نہ ہو جائے۔"
              ],
              "english": [
                "Providing a horse for Jihad was a great deed, and Umar was pained to see it neglected.",
                "The Prophet (ﷺ) redirected his focus toward a higher moral principle.",
                "A good deed is never wasted, even if the physical object spent upon becomes unusable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخاوت اور عالی ظرفی",
              "english": "Generosity and Magnanimity"
            },
            "content": {
              "urdu": [
                "ایک بار جو چیز اللہ کے لیے دے دی، اسے بھول جانا چاہیے۔",
                "نیکی کر کے اس کے بدلے یا اس چیز کے مستقبل پر نظر رکھنا کمزوری ہے۔",
                "اسلام ہمیں دل کی غنی (بے نیازی) سکھاتا ہے۔"
              ],
              "english": [
                "Once something is given for Allah, it should be forgotten.",
                "Monitoring the future of a gifted item or seeking something in return is a weakness.",
                "Islam teaches the independence and richness of the heart (Ghina)."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقیر لالچ سے بچنا",
              "english": "Avoiding Petty Greed"
            },
            "content": {
              "urdu": [
                "سستی چیز دیکھ کر اپنی دی ہوئی نیکی کو داؤ پر نہیں لگانا چاہیے۔",
                "مالی منفعت کے مقابلے میں اخلاقی اقدار کو ہمیشہ ترجیح دینی چاہیے۔",
                "آپ ﷺ کا اسوہ ہمیں حرص و ہوس سے پاک معاشرے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "One should not jeopardize their good deed for the sake of a bargain price.",
                "Moral values must always take precedence over financial gain.",
                "The Prophet's (ﷺ) example encourages a society free from petty greed."
              ]
            }
          }
        ]
      }
    }
  ]
}