{
  "hadithId": 116,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["1:116"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب الطهارة",
    "babId": 9
  },

  "takhreej": {
    "arabic": " ضعيف.  رواه أبو داود (336)  من حديث جابر، قال: خرجنا في سفر، فأصاب رجلا منا حجر فشجه في رأسه، ثم احتلم، فسأل أصحابه، فقال: هل تجدون لي رخصة في التيمم؟ فقالوا: ما نجد لك رخصة وأنت تقدر على الماء، فاغتسل فمات، فلما قدمنا على النبي صلى الله عليه وسلم أخبر بذلك، فقال: \"قتلوه قتلهم الله، ألا سألوا إذ لم يعلموا، فإنما شفاه العي السؤال، . . . \" الحديث.  والجملة التي ذکرها الحافظ: «وَيَعْصِبَ عَلَى جُرْحِهِ خِرْقَةً...» ضعيفة ومختلف فيها.",
    "urdu": "ضعیف (کمزور) روایت۔ اسے ابو داؤد (336) نے حضرت جابر کی حدیث سے روایت کیا ہے، جس میں مذکور ہے کہ وہ ایک سفر پر نکلے، ایک شخص کو پتھر لگا اور سر پھٹ گیا، پھر اسے احتلام ہوا، اس نے ساتھیوں سے پوچھا: کیا میرے لیے تیمم کی رخصت ہے؟ انہوں نے کہا: جب تم پانی پر قادر ہو تو تمہارے لیے کوئی رخصت نہیں، پس اس نے غسل کیا اور وفات پا گیا۔ جب وہ نبی ﷺ کے پاس آئے تو آپ کو یہ واقعہ بتایا گیا، تو آپ نے فرمایا: \"انہوں نے اسے مار ڈالا، اللہ انہیں مارے، انہوں نے پوچھا کیوں نہیں جب انہیں علم نہیں تھا؟ بے شک جہالت کا علاج سوال ہے۔\"۔۔۔ اور حافظ (ابن حجر) نے جو جملہ ذکر کیا ہے: \"وَيَعْصِبَ عَلَى جُرْحِهِ خِرْقَةً...\" (اپنے زخم پر پٹی باندھ کر۔۔۔) وہ ضعیف ہے اور اس میں اختلاف ہے۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (336) from the Hadith of Jabir, who said: We set out on a journey, and one of our men was struck by a stone, which wounded his head. Then he had a wet dream. He asked his companions, 'Do you find any concession for me to perform Tayammum?' They said, 'We find no concession for you while you are able to use water.' So he performed Ghusl and died. When we came to the Prophet (PBUH) and informed him, he said, 'They killed him, may Allah kill them! Why did they not ask when they did not know? Indeed, the cure for ignorance is inquiry.'... The specific phrase mentioned by Al-Hafiz (Ibn Hajar): 'and to tie a rag over his wound...' is weak and subject to dispute."
  },
  "importantWords": [
    {
      "arabic": "شُجَّ",
      "english": "Was injured (head wound)",
      "urdu": "سر پر زخم آیا"
    },
    {
      "arabic": "فَاغْتَسَلَ",
      "english": "So he performed Ghusl",
      "urdu": "اس نے غسل کیا"
    },
    {
      "arabic": "يَكْفِيهِ",
      "english": "It would be sufficient for him",
      "urdu": "اس کے لیے کافی ہوتا"
    },
    {
      "arabic": "يَعْصِبَ",
      "english": "He should tie (a cloth)",
      "urdu": "وہ باندھے"
    },
    {
      "arabic": "جُرْحِهِ",
      "english": "His wound",
      "urdu": "اس کا زخم"
    },
    {
      "arabic": "خِرْقَةً",
      "english": "Rag/Cloth",
      "urdu": "پٹی/کپڑا"
    },
    {
      "arabic": "يَغْسِلَ سَائِرَ جَسَدِهِ",
      "english": "Wash the rest of his body",
      "urdu": "باقی بدن کو دھو لے"
    },
    {
      "arabic": "قَتَلُوهُ",
      "english": "They killed him",
      "urdu": "انہوں نے اسے مار ڈالا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ایک ایسے شخص کا واقعہ بیان کرتی ہے جسے سر پر زخم تھا اور احتلام کے بعد ساتھیوں کے غلط مشورے پر غسل کیا اور وفات پا گیا۔ نبی اکرم ﷺ نے فرمایا کہ اس کے لیے صرف تیمم کرنا، زخم پر پٹی باندھ کر مسح کرنا اور باقی بدن کو دھونا کافی تھا، ساتھ ہی آپ ﷺ نے جہالت میں فتویٰ دینے پر سخت ملامت فرمائی۔",
    "english": "This Hadith narrates the story of a man who died after performing Ghusl due to a head injury and a wet dream, following bad advice from his companions. The Prophet ﷺ stated that it would have been sufficient for the man to perform Tayammum, wipe over his bandaged wound, and wash the rest of his body. He strongly condemned giving rulings based on ignorance."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (336)",
      "english": "Reported by Abu Dawud (336)"
    },
    {
      "arabic": "في سنده ضعف",
      "english": "With a weak chain of narration"
    }
  ],
  "narrators": [
    {
      "id": 11601,
      "name": {
        "arabic": "جَابِرُ بْنُ عَبْدِ اَللَّهِ",
        "english": "Jabir ibn Abdullah"
      },
      "slug": "jabir-ibn-abdullah"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جہالت کی مذمت اور سوال کی اہمیت",
        "english": "Condemnation of Ignorance and Importance of Inquiry"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بغیر علم کے فتویٰ کا نقصان",
              "english": "Harm of Ruling Without Knowledge"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ان ساتھیوں پر سخت غصے کا اظہار کیا جنہوں نے علم نہ ہونے کے باوجود غلط فتویٰ دیا۔",
                "یہ اس بات کی دلیل ہے کہ کسی بھی شخص کو شرعی مسائل میں بغیر علم کے رائے نہیں دینی چاہیے۔",
                "بغیر علم کے دی گئی رائے انسان کی ہلاکت کا سبب بن سکتی ہے، جیسا کہ اس واقعہ میں ہوا۔"
              ],
              "english": [
                "The Prophet ﷺ expressed severe anger towards the companions who issued a wrong ruling despite their lack of knowledge.",
                "This proves that no one should give an opinion on religious matters without proper knowledge.",
                "A ruling given without knowledge can lead to a person's destruction, as happened in this incident."
              ]
            }
          },
          {
            "title": {
              "urdu": "سوال جہالت کا علاج ہے",
              "english": "Inquiry is the Cure for Ignorance"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے فرمایا: \"جہالت کا علاج سوال کرنا ہے۔\" یہ علم حاصل کرنے کی ترغیب ہے۔",
                "جب بھی شرعی حکم میں کوئی ابہام یا مشکل پیش آئے تو اہل علم سے رجوع کرنا ضروری ہے۔",
                "دین اسلام میں مشکل اور عذر کی حالت میں رہنمائی اور آسانی موجود ہے۔"
              ],
              "english": [
                "The Prophet ﷺ stated: 'Indeed, the cure for ignorance is inquiry,' which encourages seeking knowledge.",
                "Whenever ambiguity or difficulty arises in a legal ruling, it is necessary to consult people of knowledge.",
                "Islam provides clear guidance and ease during states of difficulty or excuse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت کا صحیح طریقہ",
        "english": "Correct Method of Purification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنبی اور زخم کی رخصت",
              "english": "Concession for Janabah and Wound"
            },
            "content": {
              "urdu": [
                "جس شخص کے جسم پر زخم ہو اور اسے غسلِ جنابت کی ضرورت ہو، وہ تیمم اور غسل کو جمع کر سکتا ہے۔",
                "صحیح طریقہ یہ ہے کہ پانی کے استعمال سے بچے، زخم کو ڈھانپے اور باقی صحیح اعضاء کو دھوئے۔",
                "اس سے معلوم ہوتا ہے کہ جنابت کے غسل میں بھی جہاں پانی نقصان دہ ہو وہاں مسح یا تیمم ہو سکتا ہے۔"
              ],
              "english": [
                "A person with a wound who requires Ghusl (due to Janabah) can combine Tayammum and Ghusl.",
                "The correct method is to avoid water, cover the wound, and wash the rest of the sound limbs.",
                "This shows that even in Ghusl for Janabah, wiping or Tayammum is permissible where water is harmful."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعضاء کی جزوی طہارت",
              "english": "Partial Purification of Limbs"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے زخم پر پٹی باندھ کر مسح کرنے اور باقی بدن دھونے کا حکم دے کر جزوی طہارت کا اصول واضح کیا۔",
                "یہ حکم اس بات کی دلیل ہے کہ اگر کچھ حصے دھوئے جا سکتے ہوں تو صرف اتنا حصہ دھونا ضروری ہے۔",
                "جو حصہ دھونا ممکن نہ ہو اس کے لیے مسح یا تیمم کو کافی سمجھا جائے گا، جیسا کہ گزشتہ حدیث میں بھی بیان ہوا۔"
              ],
              "english": [
                "The Prophet's command to wipe over the bandage and wash the rest of the body established the principle of partial purification.",
                "This ruling proves that if some parts can be washed, only that portion must be washed.",
                "The part that cannot be washed is substituted by wiping or Tayammum, as mentioned in the previous Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند اور فقہ کا اعتبار",
        "english": "Chain of Narration and Juristic Reliance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کا درجہ ضعیف",
              "english": "Grade of the Chain (Da'if)"
            },
            "content": {
              "urdu": [
                "اس روایت کی سند میں کمزوری اور اختلاف ہے، لہٰذا اس کا مکمل حصہ احکام کی بنیاد نہیں بن سکتا۔",
                "تاہم، روایت کا پہلا حصہ (قتلہم اللہ، ألا سألوا) شواہد کی وجہ سے صحیح ہے اور بہت اہم ہے۔",
                "فقہاء نے مسح علی الجبیرہ کا حکم دیگر صحیح اصولوں کی بنیاد پر اخذ کیا ہے۔"
              ],
              "english": [
                "The chain of this narration is weak and disputed, so its complete text cannot be the basis for rulings.",
                "However, the first part of the Hadith ('May Allah kill them! Why did they not ask?') is authentic due to supporting evidence and is very important.",
                "Jurists relied on other authentic principles to derive the ruling for 'Masah alal Jabirah'."
              ]
            }
          },
          {
            "title": {
              "urdu": "رحمت اور وسعت",
              "english": "Mercy and Comprehensiveness"
            },
            "content": {
              "urdu": [
                "اس واقعہ میں نبی ﷺ کی اپنے پیروکاروں کے لیے رحمت اور شریعت کی وسعت واضح ہوتی ہے۔",
                "اللہ کا مقصد بندوں کو تکلیف دینا نہیں بلکہ آسانی فراہم کرنا ہے، خاص کر عذر کی حالت میں۔",
                "یہ اصول دین میں احتیاط کے ساتھ ساتھ آسانی پر بھی عمل کرنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "This incident clearly demonstrates the Prophet's mercy towards his followers and the comprehensiveness of Sharia.",
                "The aim of Allah is not to burden people but to provide ease, especially during times of excuse.",
                "This principle encourages acting upon ease alongside exercising caution in religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علمی اور اخلاقی درس",
        "english": "Scholarly and Ethical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذمہ داری کا احساس",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "کسی کے بارے میں فتویٰ دینے سے پہلے ہر مسلمان کو اپنی علمی استعداد کا جائزہ لینا چاہیے۔",
                "بڑے مسائل میں صرف مستند علماء سے ہی رہنمائی حاصل کرنی چاہیے نہ کہ عام لوگوں سے۔",
                "یہ واقعہ ہمیں دین کے معاملے میں ذمہ داری کا احساس اور احتیاط کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Every Muslim must assess their scholarly capacity before issuing a ruling on behalf of someone else.",
                "For major issues, guidance must only be sought from reliable scholars, not from laypeople.",
                "This incident teaches us a sense of responsibility and caution in matters of religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین یسر ہے",
              "english": "Religion is Ease"
            },
            "content": {
              "urdu": [
                "غلط فتوے سے ظاہر ہوتا ہے کہ وہ لوگ شریعت کی آسانی کے اصول کو نہیں سمجھے۔",
                "تیمم اور مسح کی رخصتیں صرف عذر کی صورت میں عبادت کو جاری رکھنے کے لیے ہیں۔",
                "تکلیف کو دور کرنا شرعی مقاصد (مقاصدِ شریعہ) میں سے ایک اہم مقصد ہے۔"
              ],
              "english": [
                "The wrong ruling indicates that those individuals did not understand the principle of ease in Sharia.",
                "The concessions of Tayammum and wiping are provided solely to continue worship during excuses.",
                "Averting hardship is one of the crucial objectives (Maqasid al-Shari'ah) of Islamic law."
              ]
            }
          }
        ]
      }
    }
  ]
}
