{
  "hadithId": 535,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/535"],
    "kitabId": 5,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصيام",
    "babId": 33
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1923)، ومسلم (1095). والحديث يحث على أكلة السحر لما فيها من الخير الديني والدنيوي.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (1923) اور امام مسلم (1095) نے اسے روایت کیا ہے۔ یہ روایت سحری کھانے کی اہمیت اور اس میں موجود خیر و برکت کو واضح کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1923) and Muslim (1095). The Hadith encourages taking the pre-dawn meal due to the spiritual and physical blessings it contains."
  },
  "importantWords": [
    {
      "arabic": "تَسَحَّرُوا",
      "english": "Take Suhoor",
      "urdu": "سحری کھاؤ"
    },
    {
      "arabic": "اَلسَّحُورِ",
      "english": "The pre-dawn meal",
      "urdu": "سحری کا کھانا"
    },
    {
      "arabic": "بَرَكَةً",
      "english": "Blessing",
      "urdu": "برکت / خیرِ کثیر"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے روزے کے لیے سحری کرنے کی تاکید فرمائی ہے کیونکہ یہ سنتِ نبوی، جسمانی طاقت اور اجر و ثواب کا مجموعہ ہے۔",
    "english": "The Prophet (ﷺ) emphasized taking the pre-dawn meal (Suhoor) because it embodies following the Sunnah, physical strength, and immense spiritual reward."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1923)",
      "english": "Sahih al-Bukhari (1923)"
    },
    {
      "arabic": "صحيح مسلم (1095)",
      "english": "Sahih Muslim (1095)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A8vNfB2u3qM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سحری کی اہمیت اور برکت",
        "english": "Importance and Blessing of Suhoor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی اور روحانی برکت",
              "english": "Physical and Spiritual Blessing"
            },
            "content": {
              "urdu": [
                "سحری کھانے سے روزے دار کو دن بھر عبادت اور کام کاج کے لیے جسمانی طاقت ملتی ہے۔",
                "یہ وقت دعا کی قبولیت اور اللہ کی رحمتوں کے نزول کا ہوتا ہے۔",
                "سحری کرنا ایک ایسی عبادت ہے جس میں کھانے پینے پر بھی ثواب ملتا ہے۔"
              ],
              "english": [
                "Suhoor provides the faster with physical strength for worship and daily tasks throughout the day.",
                "This time is significant for the acceptance of prayers and the descent of Allah's mercy.",
                "Taking Suhoor is an act of worship where one is rewarded even for eating and drinking."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلِ کتاب سے امتیاز",
              "english": "Distinction from the People of the Book"
            },
            "content": {
              "urdu": [
                "ہمارے اور اہل کتاب (یہود و نصاریٰ) کے روزے میں بنیادی فرق سحری کا کھانا ہے۔",
                "نبی ﷺ نے مسلمانوں کو ان کی مشابہت سے بچنے کے لیے سحری کی ترغیب دی۔",
                "سنت پر عمل کرنا ہی اسلام کی صحیح شناخت کو برقرار رکھتا ہے۔"
              ],
              "english": [
                "The fundamental difference between our fast and that of the People of the Book is taking Suhoor.",
                "The Prophet (ﷺ) encouraged Suhoor to distinguish Muslims from earlier nations.",
                "Following the Sunnah preserves the correct identity of Islamic practices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سحری کا مسنون طریقہ",
        "english": "The Sunnah Method of Suhoor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تاخیر سے سحری کرنا",
              "english": "Delaying Suhoor"
            },
            "content": {
              "urdu": [
                "سنت یہ ہے کہ سحری کو آخری وقت (صبح صادق سے قریب) تک مؤخر کیا جائے۔",
                "نبی ﷺ اور صحابہ کرام کی سحری اور فجر کی نماز کے درمیان صرف پچاس آیات تلاوت کرنے جتنا وقفہ ہوتا تھا۔",
                "جلدی سحری کر کے سو جانا سنت کے خلاف اور سستی کا باعث ہے۔"
              ],
              "english": [
                "It is Sunnah to delay Suhoor until the last possible moment (close to dawn).",
                "The gap between the Prophet's (ﷺ) Suhoor and Fajr prayer was only enough to recite fifty verses.",
                "Eating Suhoor too early and going back to sleep is contrary to the Sunnah and causes lethargy."
              ]
            }
          },
          {
            "title": {
              "urdu": "کم سے کم مقدار",
              "english": "Minimum Quantity"
            },
            "content": {
              "urdu": [
                "برکت حاصل کرنے کے لیے پیٹ بھر کر کھانا ضروری نہیں، ایک گھونٹ پانی یا ایک کھجور بھی کافی ہے۔",
                "نبی ﷺ نے بہترین سحری کھجور کو قرار دیا ہے۔",
                "اصل مقصد نیت اور سنت کی پیروی ہے، نہ کہ محض پیٹ بھرنا۔"
              ],
              "english": [
                "To obtain the blessing, a full meal isn't necessary; a sip of water or a single date suffices.",
                "The Prophet (ﷺ) identified dates as the best Suhoor for a believer.",
                "The real objective is the intention and following the Sunnah, not just satiation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی فوائد",
        "english": "Juristic and Moral Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاق کی درستی",
              "english": "Correction of Manners"
            },
            "content": {
              "urdu": [
                "سحری کھانے والا بھوک کی وجہ سے ہونے والی چڑچڑاہٹ اور بد اخلاقی سے محفوظ رہتا ہے۔",
                "یہ عمل انسان کو نظم و ضبط اور وقت کی پابندی سکھاتا ہے۔",
                "خاندان کے ساتھ مل کر سحری کرنا باہمی محبت اور الفت کا باعث بنتا ہے۔"
              ],
              "english": [
                "Taking Suhoor helps the faster avoid irritability and bad manners caused by extreme hunger.",
                "This practice teaches discipline and punctuality regarding time.",
                "Eating Suhoor with family fosters mutual love and affection within the household."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرشتوں کی دعا",
              "english": "Supplication of the Angels"
            },
            "content": {
              "urdu": [
                "احادیث میں آتا ہے کہ اللہ تعالیٰ اور اس کے فرشتے سحری کرنے والوں پر رحمت بھیجتے ہیں۔",
                "کتنا خوش نصیب ہے وہ شخص جس کے لیے کائنات کی نورانی مخلوق دعا کرے۔",
                "یہ اعزاز صرف سحری کی سنت پوری کرنے والوں کے لیے خاص ہے۔"
              ],
              "english": [
                "Narrations state that Allah and His angels send blessings upon those who take Suhoor.",
                "Fortunate is the person for whom the luminous beings of the universe supplicate.",
                "This honor is specific to those who fulfill the Sunnah of the pre-dawn meal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تساہل سے بچنا",
              "english": "Avoiding Negligence"
            },
            "content": {
              "urdu": [
                "صرف نیند کی خاطر سحری کی عظیم برکت سے محروم نہیں ہونا چاہیے۔",
                "اگر بھوک نہ بھی ہو تو سنت کی نیت سے تھوڑا بہت ضرور تناول کریں۔",
                "مومن ہمیشہ خیر کے مواقع تلاش کرتا ہے اور انہیں ضائع نہیں ہونے دیتا۔"
              ],
              "english": [
                "One should not miss the great blessing of Suhoor just for the sake of sleep.",
                "Even if not hungry, consume something with the intention of following the Sunnah.",
                "A believer always seeks opportunities for goodness and does not let them go to waste."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال پسندی",
              "english": "Moderation"
            },
            "content": {
              "urdu": [
                "سحری میں اتنا بھی نہ کھائیں کہ پورا دن سستی اور نیند غالب رہے۔",
                "اعتدال کے ساتھ کھانا سنتِ نبوی ﷺ کے زیادہ قریب ہے۔",
                "دینِ اسلام زندگی کے ہر معاملے میں توازن برقرار رکھنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Do not overeat during Suhoor to the extent that lethargy and sleep dominate the day.",
                "Eating with moderation is closer to the Prophetic Sunnah.",
                "Islam teaches maintaining balance in every aspect of life."
              ]
            }
          }
        ]
      }
    }
  ]
}