{
  "hadithId": 1029,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/38"],
    "kitabId": 9,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام",
    "babId": 83
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6902)، ومسلم (2158). ورواه أحمد (2/243)، والنسائي (8/61)، وابن حبان (5972) بزيادة «فلا دية له ولا قصاص».",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم دونوں میں موجود ہے۔ احمد، نسائی اور ابن حبان کی روایت میں یہ صراحت بھی ہے کہ ایسی صورت میں نہ کوئی جرمانہ (دیت) ہوگا اور نہ ہی بدلہ (قصاص) لیا جائے گا۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (6802) and Muslim (2158). Ahmad (2/243), An-Nasa'i (8/61), and Ibn Hibban (5972) recorded it with the addition: 'There is neither blood money nor retaliation for him.'"
  },
  "importantWords": [
    {
      "arabic": "اِطَّلَعَ",
      "english": "Peeped / Looked into",
      "urdu": "جھانکا / نظر ڈالی"
    },
    {
      "arabic": "بِغَيْرِ إِذْنٍ",
      "english": "Without permission",
      "urdu": "بغیر اجازت کے"
    },
    {
      "arabic": "فَحَذَفْتَهُ",
      "english": "You threw at him",
      "urdu": "تم نے اسے ماری (کنکری)"
    },
    {
      "arabic": "فَفَقَأْتَ",
      "english": "Put out / Blinded",
      "urdu": "پھوڑ دی (آنکھ)"
    },
    {
      "arabic": "جُنَاحٌ",
      "english": "Sin / Blame",
      "urdu": "گناہ / حرج"
    },
    {
      "arabic": "قِصَاص",
      "english": "Retaliation",
      "urdu": "بدلہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں گھر کی پرائیویسی اور تقدس کے تحفظ کا حق دیا گیا ہے، کہ اگر کوئی غیر قانونی طور پر جھانکے اور اسے روکنے میں اسے جسمانی نقصان پہنچے تو گھر والے پر کوئی ذمہ داری نہیں ہوگی۔",
    "english": "This Hadith establishes the right to privacy and the sanctity of the home, stating that if an intruder peeps in without permission, the resident is not liable for any injury inflicted to stop him."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6902)",
      "english": "Reported by Al-Bukhari (6902)"
    },
    {
      "arabic": "رواه مسلم (2158)",
      "english": "Reported by Muslim (2158)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dusi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6o9l6Kts",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "گھر کا تقدس اور پرائیویسی",
        "english": "Privacy and Sanctity of the Home"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجازت کے بغیر دیکھنا",
              "english": "Looking Without Permission"
            },
            "content": {
              "urdu": [
                "اسلام نے گھروں کے اندر جھانکنے کو ایک سنگین اخلاقی اور قانونی جرم قرار دیا ہے۔",
                "گھر انسان کی نجی زندگی کا قلعہ ہے جس میں کسی کو مداخلت کا حق نہیں۔",
                "نبی کریم ﷺ نے پردے اور حیا کے تحفظ کے لیے یہ سخت حکم بیان فرمایا ہے۔"
              ],
              "english": [
                "Islam considers peeping into homes a serious moral and legal offense.",
                "The home is a sanctuary of private life where no one has the right to intrude.",
                "The Prophet (ﷺ) issued this stern ruling to protect modesty and privacy."
              ]
            }
          },
          {
            "title": {
              "urdu": "دفاع کا حق",
              "english": "Right of Self-Defense"
            },
            "content": {
              "urdu": [
                "گھر والے کو اپنی پرائیویسی کے تحفظ کے لیے طاقت استعمال کرنے کا حق حاصل ہے۔",
                "اگر جھانکنے والا منع کرنے پر باز نہ آئے تو اسے جسمانی طور پر روکنا جائز ہے۔",
                "یہ حکم دراصل غیر قانونی مداخلت کرنے والے کے لیے ایک بڑی تنبیہ ہے۔"
              ],
              "english": [
                "A resident has the right to use force to protect their private domain.",
                "If an intruder continues to peep after being warned, physical prevention is allowed.",
                "This ruling serves as a severe deterrent against unlawful intrusion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی ذمہ داری سے استثنیٰ",
        "english": "Exemption from Legal Liability"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قصاص اور دیت کی نفی",
              "english": "No Qisas or Diyyah"
            },
            "content": {
              "urdu": [
                "اگر کنکری مارنے سے جھانکنے والے کی آنکھ ضائع ہو جائے تو اس کا کوئی بدلہ نہیں۔",
                "گھر والے سے نہ تو دیت (مالی جرمانہ) لیا جائے گا اور نہ ہی قصاص واجب ہوگا۔",
                "مجرم نے خود اپنے آپ کو خطرے میں ڈالا، اس لیے اس کا خون 'رائیگاں' قرار پایا۔"
              ],
              "english": [
                "If the peeper's eye is blinded by a pebble, there is no legal retaliation.",
                "The resident is liable for neither blood money (Diyyah) nor Qisas.",
                "The intruder placed himself in danger, thus forfeiting his legal protection."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی ضابطہ",
              "english": "Legal Principles"
            },
            "content": {
              "urdu": [
                "یہ اصول 'دفعِ صائل' (حملہ آور کو روکنے) کے قانون کے تحت آتا ہے۔",
                "اسلامی فقہ میں کسی برائی کو روکتے وقت ہونے والا نقصان معاف ہے۔",
                "تاہم، یہ ضروری ہے کہ کارروائی صرف ضرورت کی حد تک ہی کی جائے۔"
              ],
              "english": [
                "This principle falls under the law of repelling a transgressor (Daf' al-Sa'il).",
                "In Islamic Fiqh, harm caused while preventing an evil is often excused.",
                "However, it is essential that the action is limited to what is necessary."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تربیتی پہلو",
        "english": "Moral and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظر کی حفاظت",
              "english": "Guarding the Gaze"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں اپنی نظریں نیچی رکھنے اور دوسروں کی عیب جوئی سے روکتا ہے۔",
                "دوسروں کے گھروں کے حالات جاننے کی تجسس کرنا شیطانی صفت ہے۔",
                "حیا کا تقاضا ہے کہ انسان دوسرے کی نجی زندگی کا مکمل احترام کرے۔"
              ],
              "english": [
                "Islam commands us to lower our gaze and avoid spying on others.",
                "Being curious about the private affairs of others is a Satanic trait.",
                "Modesty requires a person to fully respect the private lives of others."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجازت لینے کی اہمیت",
              "english": "Importance of Seeking Permission"
            },
            "content": {
              "urdu": [
                "کسی کے گھر میں داخل ہونے سے پہلے تین بار اجازت لینا سنت ہے۔",
                "اجازت کا بنیادی مقصد نظر کو غلط جگہ پڑنے سے بچانا ہی ہے۔",
                "معاشرتی امن کے لیے گھروں کی حدود کا احترام انتہائی لازمی ہے۔"
              ],
              "english": [
                "It is Sunnah to seek permission three times before entering a house.",
                "The primary purpose of seeking permission is to guard the gaze.",
                "Respecting domestic boundaries is vital for maintaining social peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترتیب وار کارروائی",
              "english": "Sequential Action"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک پہلے تنبیہ کرنا بہتر ہے، پھر کارروائی کی جائے۔",
                "اگر صرف ڈرانے سے کام چل جائے تو آنکھ پھوڑنا جائز نہیں ہوگا۔",
                "قانون کا مقصد انصاف ہے، بلاوجہ کسی کو معذور کرنا مقصود نہیں ہے۔"
              ],
              "english": [
                "Most jurists suggest warning the intruder first before taking action.",
                "If a verbal warning suffices, blinding the eye would not be permissible.",
                "The law aims for justice, not unnecessary mutilation of individuals."
              ]
            }
          },
          {
            "title": {
              "urdu": "گواہی اور ثبوت",
              "english": "Witness and Proof"
            },
            "content": {
              "urdu": [
                "عدالت میں یہ ثابت کرنا ہوگا کہ زخمی شخص واقعی جھانک رہا تھا۔",
                "صرف دعوے پر کسی کی آنکھ پھوڑنے کا لائسنس نہیں دیا جا سکتا۔",
                "اسلامی ریاست میں ہر فعل کے لیے شرعی ثبوت کی ضرورت ہوتی ہے۔"
              ],
              "english": [
                "It must be proven in court that the injured person was indeed peeping.",
                "A mere claim does not grant a license to inflict physical injury.",
                "In an Islamic state, every action requires valid Sharia-compliant proof."
              ]
            }
          }
        ]
      }
    }
  ]
}