{
  "hadithId": 1002,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1152"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5758)، ومسلم (1681). وأخرجه أبو داود (4572)، والنسائي (4822)، وابن حبان (5989)، والحاكم (3/575).",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم کی متفق علیہ روایت ہے۔ امام ابو داؤد، نسائی، ابن حبان اور حاکم نے بھی اسے صحیح سند کے ساتھ نقل کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (5758) and Muslim (1681). It was also reported by Abu Dawud (4572), An-Nasa'i (4822), Ibn Hibban (5989), and Al-Hakim (3/575)."
  },
  "importantWords": [
    {
      "arabic": "اِقْتَتَلَتِ",
      "english": "Fought / Quarrelled",
      "urdu": "لڑ پڑیں"
    },
    {
      "arabic": "جَنِينِهَا",
      "english": "Her Fetus / Unborn child",
      "urdu": "اس کا حمل / بچہ"
    },
    {
      "arabic": "غُرَّةٌ",
      "english": "High-quality slave",
      "urdu": "بہترین غلام یا لونڈی"
    },
    {
      "arabic": "عَاقِلَتِهَا",
      "english": "Paternal relatives",
      "urdu": "عاقلہ / قاتل کے رشتہ دار"
    },
    {
      "arabic": "يُطَلُّ",
      "english": "Be dismissed / Go unavenged",
      "urdu": "باطل / ضائع"
    },
    {
      "arabic": "سَجْعِهِ",
      "english": "Rhymed prose",
      "urdu": "قافیہ بندی / مسجع کلام"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غیر ارادی قتل (شبه عمد) میں حاملہ عورت اور اس کے پیٹ میں موجود بچے (جنین) کی دیت اور وراثت کے احکام بیان کرتی ہے۔",
    "english": "This Hadith outlines the rulings for blood-money (Diyat) and inheritance regarding a pregnant woman and her fetus in cases of quasi-intentional homicide."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5758)",
      "english": "Sahih al-Bukhari (5758)"
    },
    {
      "arabic": "صحيح مسلم (1681)",
      "english": "Sahih Muslim (1681)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جنین کی دیت کا حکم",
        "english": "Rulings on Fetal Blood-Money"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غرہ کی تعریف",
              "english": "Definition of Ghurra"
            },
            "content": {
              "urdu": [
                "جنین (پیٹ کے بچے) کی موت پر سزا کے طور پر ایک غلام یا لونڈی دینا واجب ہے۔",
                "اس دیت کو 'غرہ' کہا جاتا ہے جس کی قیمت مکمل دیت کا بیسواں حصہ (5 اونٹ) ہوتی ہے۔",
                "یہ حکم اس صورت میں ہے جب بچہ ماں کے پیٹ میں ہی مر جائے یا مردہ پیدا ہو۔"
              ],
              "english": [
                "Providing a male or female slave is obligatory as a penalty for the death of a fetus.",
                "This Diyat is called 'Ghurra,' valued at one-twentieth of a full Diyat (5 camels).",
                "This applies when the fetus dies in the womb or is born dead due to the assault."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی جان کی تکریم",
              "english": "Sanctity of Human Life"
            },
            "content": {
              "urdu": [
                "اسلام نے پیٹ میں موجود بچے کو بھی ایک قانونی وجود تسلیم کیا ہے۔",
                "اس پر حملہ کرنا اور اسے ضائع کرنا ایک جرم ہے جس کی تلافی ضروری ہے۔",
                "یہ قانون انسانی زندگی کے تحفظ کو پیدائش سے پہلے ہی یقینی بناتا ہے۔"
              ],
              "english": [
                "Islam recognizes the fetus in the womb as a legal entity.",
                "Assaulting it or causing its loss is a crime that requires compensation.",
                "This law ensures the protection of human life even before birth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عاقلہ پر دیت کی ذمہ داری",
        "english": "Liability of Paternal Relatives"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاقلہ کا کردار",
              "english": "The Role of Al-Aqilah"
            },
            "content": {
              "urdu": [
                "شبه عمد (ایسا قتل جو ارادی نہ ہو) میں دیت قاتل کے رشتہ داروں (عاقلہ) پر ہوتی ہے۔",
                "یہ نظام قبائلی تعاون اور مالی بوجھ کو بانٹنے کے لیے وضع کیا گیا ہے۔",
                "اس سے خاندان کے افراد میں ایک دوسرے کی نگرانی کا احساس پیدا ہوتا ہے۔"
              ],
              "english": [
                "In quasi-intentional homicide, Diyat is borne by the killer's paternal relatives (Aqilah).",
                "This system is designed for tribal cooperation and sharing the financial burden.",
                "It instills a sense of mutual responsibility and monitoring among family members."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقتولہ کی وراثت",
              "english": "Inheritance of the Deceased"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے مقتولہ کی دیت کو اس کے وارثوں (اولاد اور شوہر وغیرہ) میں تقسیم فرمایا۔",
                "دیت مقتول کا مال تصور کی جاتی ہے جو شرعی حصوں کے مطابق تقسیم ہوگی۔",
                "یہ فیصلہ وراثت کے عام اصولوں کی تائید کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) distributed the Diyat of the deceased among her heirs (children, husband, etc.).",
                "Diyat is considered the property of the deceased, to be divided by Shariah shares.",
                "This ruling confirms the general principles of inheritance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کاہنوں کے طرزِ کلام کی مذمت",
        "english": "Condemnation of Soothsayer Speech"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق کے مقابلے میں باطل کلام",
              "english": "Falsehood Against Truth"
            },
            "content": {
              "urdu": [
                "حمل بن نابغہ نے قافیہ بندی کے ذریعے شرعی حکم کا مذاق اڑانے کی کوشش کی۔",
                "اس نے دلیل دی کہ جو بچہ ابھی دنیا میں نہیں آیا اس کی دیت کیوں دی جائے؟",
                "نبی ﷺ نے اس کے لفاظی والے انداز کو 'کاہنوں کا بھائی' قرار دے کر ناپسند فرمایا۔"
              ],
              "english": [
                "Hamal bin an-Nabigha tried to mock the Shariah ruling using rhymed prose.",
                "He argued that a child not yet in the world shouldn't have blood-money paid.",
                "The Prophet (ﷺ) disliked his rhetorical style, calling him a 'brother of soothsayers'."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی احکام کی فوقیت",
              "english": "Supremacy of Shariah Rulings"
            },
            "content": {
              "urdu": [
                "انسانی عقل اور منطق کو وحی کے واضح حکم پر مقدم نہیں کیا جا سکتا۔",
                "قافیہ بندی اور لفاظی کے ذریعے حق کو باطل کرنا مذموم عمل ہے۔",
                "مومن کا کام سمعنا و اطعنا (ہم نے سنا اور اطاعت کی) ہونا چاہیے۔"
              ],
              "english": [
                "Human intellect and logic cannot be prioritized over clear Divine revelation.",
                "Using rhetoric and rhyming to invalidate the truth is blameworthy.",
                "The duty of a believer is 'we hear and we obey'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عدالتی و معاشرتی اسباق",
        "english": "Judicial and Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عمر کی علمی پیاس",
              "english": "Umar's Quest for Knowledge"
            },
            "content": {
              "urdu": [
                "سیدنا عمر رضی اللہ عنہ نے خلیفہ ہونے کے باوجود سنت کی تلاش میں صحابہ سے مشورہ کیا۔",
                "یہ عمل حکمرانوں کے لیے سنت پر عمل پیرا ہونے کی بہترین مثال ہے۔",
                "کسی مسئلے کا علم نہ ہونے پر صاحبِ علم سے پوچھنا دانشمندی ہے۔"
              ],
              "english": [
                "Umar (RA), despite being Caliph, consulted Sahaba to find the Sunnah on this matter.",
                "This action is a prime example for rulers to follow the Sunnah.",
                "It is wise to ask those with knowledge when one is unaware of a ruling."
              ]
            }
          },
          {
            "title": {
              "urdu": "جھگڑوں کا حل",
              "english": "Conflict Resolution"
            },
            "content": {
              "urdu": [
                "خواتین کے باہمی جھگڑوں کے نتائج بھی سنگین ہو سکتے ہیں جن کا تصفیہ عدالت میں ہونا چاہیے۔",
                "اسلامی قانون معاشرے میں ہر قسم کے فساد کی تلافی کا نظام فراہم کرتا ہے۔",
                "انصاف کی فراہمی میں کسی قبیلے یا گروہ کی رعایت نہیں کی جاتی۔"
              ],
              "english": [
                "Conflicts between women can have serious results that must be settled in court.",
                "Islamic law provides a system for compensating all types of societal mischief.",
                "In providing justice, no favor is shown to any tribe or group."
              ]
            }
          }
        ]
      }
    }
  ]
}