{
  "hadithId": 1304,
  "hadithNo": 28,
  "hadithReferences": {
    "sunnah.com": [
      "bukhari:7042"
    ],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب التعبير",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (7042)، والترمذي (1751)، وأبو داود (5024)، وأحمد (1/359).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (7042) نے اسے اپنی صحیح میں روایت کیا ہے۔ یہ ایک طویل حدیث کا حصہ ہے جس میں جھوٹے خواب بیان کرنے اور تصویر سازی کی ممانعت کا بھی ذکر ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (7042). It is part of a longer Hadith that also forbids describing false dreams and making images."
  },
  "importantWords": [
    {
      "arabic": "تَسَمَّعَ",
      "english": "Listened stealthily / Eavesdropped",
      "urdu": "کان لگا کر سنا / چھپ کر سنا"
    },
    {
      "arabic": "كَارِهُونَ",
      "english": "They are unwilling / Disliking",
      "urdu": "وہ ناپسند کرنے والے ہوں"
    },
    {
      "arabic": "صُبَّ",
      "english": "Poured",
      "urdu": "انڈیلا جائے گا"
    },
    {
      "arabic": "الْآنُكُ",
      "english": "Molten lead",
      "urdu": "پگھلا ہوا سیسہ"
    },
    {
      "arabic": "الرَّصَاص",
      "english": "Lead",
      "urdu": "سیسہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث لوگوں کی نجی گفتگو کو چھپ کر سننے (جاسوسی کرنے) کی سخت ممانعت کرتی ہے اور ایسا کرنے والوں کے لیے قیامت کے دن ہولناک عذاب کی خبر دیتی ہے۔",
    "english": "This Hadith strictly prohibits eavesdropping on private conversations and warns of a terrifying punishment on the Day of Resurrection for those who violate people's privacy."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (7042)",
      "english": "Sahih al-Bukhari (7042)"
    },
    {
      "arabic": "سنن أبي داود (5024)",
      "english": "Sunan Abu Dawud (5024)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رازداری کی اہمیت",
        "english": "Importance of Privacy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نجی زندگی کا تحفظ",
              "english": "Protection of Private Life"
            },
            "content": {
              "urdu": [
                "اسلام ہر انسان کو نجی زندگی اور رازداری کا حق دیتا ہے۔",
                "دوسروں کے ذاتی معاملات میں مداخلت کرنا اخلاقی اور شرعی جرم ہے۔",
                "بلا اجازت کسی کی گفتگو سننا امانت میں خیانت کے مترادف ہے۔"
              ],
              "english": [
                "Islam grants every individual the right to a private life and confidentiality.",
                "Interfering in others' personal affairs is a moral and religious offense.",
                "Listening to a conversation without permission is equivalent to a breach of trust."
              ]
            }
          },
          {
            "title": {
              "urdu": "جاسوسی کی ممانعت",
              "english": "Prohibition of Spying"
            },
            "content": {
              "urdu": [
                "قرآن پاک میں 'تجسس' یعنی دوسروں کے عیب تلاش کرنے سے منع کیا گیا ہے۔",
                "چوری چھپے باتیں سننا جاسوسی کی ایک بدترین قسم ہے۔",
                "یہ عمل معاشرے میں بداعتمادی اور شک کی فضا پیدا کرتا ہے۔"
              ],
              "english": [
                "The Holy Quran forbids 'Tajassus' (spying/seeking out others' faults).",
                "Stealthily listening to conversations is one of the worst forms of spying.",
                "This act creates an atmosphere of distrust and suspicion in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عذاب کی نوعیت",
        "english": "The Nature of Punishment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مکافاتِ عمل",
              "english": "The Law of Retribution"
            },
            "content": {
              "urdu": [
                "جزا اور سزا عمل کی جنس سے ہوتی ہے۔",
                "جس کان نے ناجائز طریقے سے لذت حاصل کی، اسے سیسے سے سزا دی جائے گی۔",
                "پگھلا ہوا سیسہ کانوں میں ڈالنا انتہائی تکلیف دہ اور رسوا کن عذاب ہے۔"
              ],
              "english": [
                "Reward and punishment match the nature of the deed.",
                "The ear that sought unlawful pleasure through eavesdropping will be punished with lead.",
                "Pouring molten lead into the ears is an excruciatingly painful and humiliating punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیامت کی ہولناکی",
              "english": "Horrors of Resurrection"
            },
            "content": {
              "urdu": [
                "یہ عذاب اس بات کی دلیل ہے کہ اللہ کے ہاں بندوں کی عزت کتنی اہم ہے۔",
                "دنیا کی چھوٹی سی لذت آخرت کے بڑے عذاب کا سبب بن سکتی ہے۔",
                "انسان کو ہر وقت اللہ کی نگرانی کا احساس ہونا چاہیے۔"
              ],
              "english": [
                "This punishment proves how vital an individual's honor is to Allah.",
                "A small worldly pleasure can lead to a great punishment in the hereafter.",
                "A person should always feel that they are under Allah's supervision."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اخلاقیات",
        "english": "Social Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی احترام",
              "english": "Mutual Respect"
            },
            "content": {
              "urdu": [
                "اگر لوگ ایک دوسرے سے چھپ کر باتیں کر رہے ہوں تو وہاں سے ہٹ جانا چاہیے۔",
                "زبردستی دوسروں کی محفل میں شامل ہونا یا کان لگانا بدتمیزی ہے۔",
                "شائستہ معاشرہ وہی ہے جہاں ہر ایک کی پرائیویسی کا احترام ہو۔"
              ],
              "english": [
                "If people are talking privately, one should move away from them.",
                "Forcing oneself into others' gatherings or eavesdropping is rudeness.",
                "A civilized society is one where everyone's privacy is respected."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید ٹیکنالوجی کا استعمال",
              "english": "Use of Modern Technology"
            },
            "content": {
              "urdu": [
                "کسی کی فون کال سننا یا میسجز پڑھنا بھی اسی ممانعت میں آتا ہے۔",
                "خفیہ ریکارڈنگ کرنا یا کیمروں سے جاسوسی کرنا گناہِ عظیم ہے۔",
                "ٹیکنالوجی کو دوسروں کے عیب چھپانے کے لیے استعمال کریں، فاش کرنے کے لیے نہیں۔"
              ],
              "english": [
                "Listening to phone calls or reading private messages falls under this prohibition.",
                "Secret recording or spying through cameras is a major sin.",
                "Use technology to cover others' faults, not to expose them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اصلاحِ نفس",
              "english": "Self-Reform"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی زبان کے ساتھ ساتھ اپنے کانوں کی بھی حفاظت کریں۔",
                "دوسروں کے عیبوں کے بجائے اپنے گناہوں پر نظر رکھنی چاہیے۔",
                "توبہ کا دروازہ کھلا ہے، اگر ایسا عمل ہو چکا ہو تو اللہ سے معافی مانگیں۔"
              ],
              "english": [
                "We must guard our ears just as we guard our tongues.",
                "Focus on your own sins instead of looking for faults in others.",
                "The door of repentance is open; if such an act has been committed, seek Allah's forgiveness."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ ظن",
              "english": "Good Expectations"
            },
            "content": {
              "urdu": [
                "دوسروں کے بارے میں ہمیشہ اچھا گمان رکھیں۔",
                "جاسوسی انسان کے دل میں کینہ اور نفرت پیدا کرتی ہے۔",
                "پاکیزہ زندگی وہی ہے جو شک اور تجسس سے پاک ہو۔"
              ],
              "english": [
                "Always maintain good expectations regarding others.",
                "Spying breeds malice and hatred in a person's heart.",
                "A pure life is one that is free from doubt and curiosity."
              ]
            }
          }
        ]
      }
    }
  ]
}