{
  "hadithId": 104,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["Bukhari 248", "Muslim 316"],
    "kitabId": 1,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطهارة",
    "babId": 8
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (248) ، ومسلم (316) ، وبما أن المؤلف ساق لفظ مسلم فعنده بعد قول: \"أصول الشعر\" إضافة وهي قولها: \"حتى إذا رأى أن قد استبرأ\". صحيح. رواه البخاري (248) ، ومسلم (316) ، وبما أن المؤلف ساق لفظ مسلم فعنده بعد قول: \"أصول الشعر\" إضافة وهي قولها: \"حتى إذا رأى أن قد استبرأ\". ",
    "urdu": "صحیح (درست) حدیث۔ اسے بخاری (248) اور مسلم (316) نے روایت کیا ہے۔ اور چونکہ مصنف نے مسلم کے الفاظ کو لیا ہے تو ان کے ہاں 'أصول الشعر' کے قول کے بعد یہ اضافہ ہے کہ سیدہ عائشہ رضی اللہ عنہا نے فرمایا: 'یہاں تک کہ آپ نے محسوس کیا کہ آپ مکمل طور پر پاک ہو گئے۔' یہ صحیح ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (248) and Muslim (316). Since the author used Muslim's wording, there is an addition after 'roots of his hair,' which is her saying: 'until he saw that he had cleansed himself completely.' This Hadith is authentic."
  },
  "importantWords": [
    {
      "arabic": "اِغْتَسَلَ",
      "english": "Took a bath",
      "urdu": "غسل کیا"
    },
    {
      "arabic": "اَلْجَنَابَةِ",
      "english": "Sexual impurity (Janabah)",
      "urdu": "جنابت"
    },
    {
      "arabic": "يَدَيْهِ",
      "english": "His two hands",
      "urdu": "اپنے دونوں ہاتھ"
    },
    {
      "arabic": "يَتَوَضَّأُ",
      "english": "Performs ablution (Wudu')",
      "urdu": "وضو کرتے"
    },
    {
      "arabic": "أُصُولِ اَلشَّعْرِ",
      "english": "Roots of the hair",
      "urdu": "بالوں کی جڑیں"
    },
    {
      "arabic": "حَفَنَاتٍ",
      "english": "Handfuls (of water)",
      "urdu": "چلو"
    },
    {
      "arabic": "جَسَدِهِ",
      "english": "His body",
      "urdu": "ان کا وجود/بدن"
    },
    {
      "arabic": "رِجْلَيْهِ",
      "english": "His two feet",
      "urdu": "ان کے دونوں پاؤں"
    },
    {
      "arabic": "بِالْمِنْدِيلِ",
      "english": "With the towel",
      "urdu": "رومال/تولیہ"
    },
    {
      "arabic": "يَنْفُضُ",
      "english": "Shakes off",
      "urdu": "جھاڑنا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث غسل جنابت (بڑے غسل) کا مکمل شرعی طریقہ بیان کرتی ہے، جس میں ہاتھ دھونے، نجاست صاف کرنے، وضو کرنے، سر میں پانی پہنچانے اور آخر میں پاؤں دھونے کی ترتیب واضح کی گئی ہے۔",
    "english": "This Hadith describes the complete method of Ghusl (ritual bath) from Janabah, detailing the sequence: washing hands, cleansing private parts, performing Wudu', wetting the hair roots, pouring water over the head and body, and finally washing the feet."
  },
  "references": [
    {
      "arabic": "رواه البخاري (248)",
      "english": "Reported by Al-Bukhari (248)"
    },
    {
      "arabic": "رواه مسلم (316)",
      "english": "Reported by Muslim (316)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "ميمونة بنت الحارث الهلالية",
        "english": "Maymunah bint Al-Harith Al-Hilaliyyah"
      },
      "slug": "maymunah-bint-al-harith"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=hadith_ghusl_104",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غسل کا مسنون طریقہ",
        "english": "The Sunnah Method of Ghusl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابتدائی اعمال اور وضو",
              "english": "Initial Actions and Wudu'"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم غسل سے پہلے سب سے پہلے اپنے دونوں ہاتھوں کو دھوتے تھے۔",
                "پھر ناپاکی کی جگہ کو بائیں ہاتھ سے دھوتے اور ہاتھ کو زمین یا مٹی سے صاف کر لیتے تھے جیسا کہ سیدہ میمونہ رضی اللہ عنہا کی روایت میں ہے۔",
                "اس کے بعد آپ صلی اللہ علیہ وسلم نماز والے وضو کی طرح مکمل وضو کرتے تھے تاکہ طہارت مکمل ہو۔"
              ],
              "english": [
                "The Prophet (PBUH) would start the Ghusl by washing both hands thoroughly before beginning the ritual.",
                "He would then cleanse the private parts with the left hand, purifying the hand afterward by rubbing it on the ground or with earth, as mentioned in Maymunah's narration.",
                "Following this initial cleansing, he would perform a complete Wudu' (ablution) just as he would for prayer, ensuring purification."
              ]
            }
          },
          {
            "title": {
              "urdu": "سر دھونے کا طریقہ",
              "english": "Method of Washing the Head"
            },
            "content": {
              "urdu": [
                "وضو کے بعد آپ صلی اللہ علیہ وسلم پانی لے کر اپنی انگلیوں کو بالوں کی جڑوں میں داخل کرتے تھے۔",
                "اس کا مقصد یہ تھا کہ پانی بالوں کی جڑوں اور کھال تک اچھی طرح پہنچ جائے اور کوئی حصہ خشک نہ رہے۔",
                "اس کے بعد آپ صلی اللہ علیہ وسلم اپنے سر پر تین چلو پانی ڈالتے تھے، جو اس حصے کو مکمل پاک کرنے کے لیے کافی تھا۔"
              ],
              "english": [
                "After performing Wudu', the Prophet (PBUH) would take water and put his fingers into the roots of his hair.",
                "The purpose was to ensure that the water reached the scalp and the roots of the hair completely, leaving no spot dry.",
                "He would then pour three full handfuls of water over his head, which was sufficient to purify this specific area thoroughly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جسم اور پاؤں کی صفائی",
        "english": "Cleansing the Body and Feet"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باقی جسم پر پانی بہانا",
              "english": "Pouring Water Over the Rest of the Body"
            },
            "content": {
              "urdu": [
                "سر دھونے کے بعد آپ صلی اللہ علیہ وسلم اپنے باقی سارے جسم پر پانی بہاتے تھے۔",
                "اس بات کو یقینی بناتے تھے کہ جسم کا کوئی حصہ بھی خشک نہ رہ جائے، اور یہ غسل کا لازمی حصہ ہے۔",
                "جسم کے ہر حصے کو اچھی طرح ملنا اور پانی پہنچانا غسل کی تکمیل کے لیے ضروری ہے۔"
              ],
              "english": [
                "After washing his head, the Prophet (PBUH) would pour water over the rest of his entire body.",
                "He ensured that not a single part of the body remained dry, as this is an essential part of the complete Ghusl.",
                "Thoroughly rubbing and directing water to every part of the body is necessary for the completion of the ritual bath."
              ]
            }
          },
          {
            "title": {
              "urdu": "پاؤں کا آخر میں دھونا",
              "english": "Washing the Feet at the End"
            },
            "content": {
              "urdu": [
                "غسل کے آخر میں آپ صلی اللہ علیہ وسلم اپنے دونوں پاؤں دھوتے تھے، جیسا کہ سیدہ عائشہ رضی اللہ عنہا نے روایت کیا۔",
                "اس کی وجہ یہ ہو سکتی ہے کہ غسل کے دوران پاؤں پر پانی اور نجاست کے قطرے گرنے کا امکان ہوتا ہے۔",
                "یہ عمل اس بات کو یقینی بناتا ہے کہ پاؤں کی صفائی دوبارہ ہو جائے اور غسل صحیح طور پر مکمل ہو۔"
              ],
              "english": [
                "At the very end of the Ghusl, the Prophet (PBUH) would wash both of his feet, as narrated by 'Aishah (RA).",
                "This step is likely performed last because water and residual impurity drops may fall on the feet during the washing of the body.",
                "This ensures that the feet are completely cleansed again, concluding the Ghusl in a proper and complete manner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت کے آداب",
        "english": "Etiquettes of Purification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تولیہ (رومال) کا استعمال",
              "english": "Usage of a Towel"
            },
            "content": {
              "urdu": [
                "سیدہ میمونہ رضی اللہ عنہا کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے رومال (تولیہ) کو استعمال کرنے سے انکار فرما دیا۔",
                "اس سے معلوم ہوتا ہے کہ جسم سے پانی کو جھاڑ کر خشک کرنا تولیہ کے استعمال سے افضل ہے۔",
                "یہ تواضع اور سادگی کو ظاہر کرتا ہے اور جسم کو خشک کرنے میں بے جا تکلف سے اجتناب کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Maymunah's narration mentions that the Prophet (PBUH) refused to use the towel (mandil) that was offered to him.",
                "This indicates that shaking the water off the body with the hand is superior to using a towel immediately.",
                "It teaches humility and simplicity, encouraging avoidance of unnecessary formalities in drying the body after the ritual."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مسائل",
              "english": "Juristic Implications"
            },
            "content": {
              "urdu": [
                "غسل جنابت کے دوران وضو کرنا ایک مسنون اور مستحب عمل ہے۔",
                "حنفی فقہاء کے نزدیک پاؤں کا آخر میں دھونا مستحب ہے اور وضو غسل میں شامل ہو جاتا ہے۔",
                "شوافع اور حنابلہ کے نزدیک غسل کے بعد جسم سے نجاست کو دور کرنا ضروری نہیں اگر وہ پانی کے ساتھ بہہ چکی ہو۔"
              ],
              "english": [
                "Performing Wudu' during the Ghusl from Janabah is a recommended and Sunnah action, not strictly obligatory.",
                "According to the Hanafi jurists, washing the feet at the end is recommended, and the Wudu' is considered to be incorporated within the Ghusl itself.",
                "The Shafi'i and Hanbali schools hold that there is no need to remove impurities from the body after the Ghusl if they have been washed away by the water."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تعلیمی پہلو",
        "english": "Moral and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی کی اتباع",
              "english": "Following the Prophet (PBUH)"
            },
            "content": {
              "urdu": [
                "یہ حدیث طہارت اور صفائی کے معاملے میں نبی اکرم صلی اللہ علیہ وسلم کی کامل پیروی کی تعلیم دیتی ہے۔",
                "غسل کا یہ تفصیلی طریقہ ہمیں ایک مسلمان کی زندگی میں پاکیزگی کی اہمیت کو سکھاتا ہے۔",
                "آپ صلی اللہ علیہ وسلم کے ہر عمل کی اتباع میں ہمارے لیے بہترین نمونہ اور ثواب موجود ہے۔"
              ],
              "english": [
                "This Hadith instructs us to completely follow the Prophet (PBUH) in matters of purification and cleanliness.",
                "This detailed method of Ghusl teaches us the paramount importance of purity in a Muslim's life.",
                "There is an immense reward and the best example for us in adhering to every action of the Messenger of Allah (PBUH)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تدبر اور حفظ",
              "english": "Reflection and Memorization"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو غسل کے اس مسنون طریقے کو غور سے پڑھنا اور یاد کرنا چاہیے۔",
                "آپ صلی اللہ علیہ وسلم نے عمل کر کے امت کو صحیح طریقہ سکھایا، لہٰذا اسے سمجھنا ضروری ہے۔",
                "صحیح طریقے سے غسل کی ادائیگی ہی عبادات کی قبولیت کی بنیادی شرط ہے۔"
              ],
              "english": [
                "Muslims should carefully read and memorize this Sunnah method of Ghusl as documented in the Hadith.",
                "The Prophet (PBUH) taught the Ummah the correct way by performing it, thus it is vital to understand it.",
                "The correct performance of Ghusl is a fundamental prerequisite for the acceptance of many acts of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
