{
  "hadithId": 474,
  "hadithNo": 50,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/50"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (3128). وفي إسناده محمد بن الحسن بن عطية العوفي وهو ضعيف. ومع ذلك، فإن أصل النهي عن النعي والنوح ثابت في الصحيحين وغيرهما من الأحاديث الصحيحة.",
    "urdu": "ضعیف۔ اسے ابوداؤد (3128) نے روایت کیا ہے۔ اس کی سند میں محمد بن حسن بن عطیہ عوفی ضعیف راوی ہے۔ تاہم نوحہ کی ممانعت کی اصل صحیح بخاری اور صحیح مسلم کی دیگر صحیح احادیث سے ثابت ہے۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (3218). Its chain contains Muhammad bin al-Hasan al-Awfi, who is weak. However, the core prohibition of wailing is established through many other Sahih narrations in Bukhari and Muslim."
  },
  "importantWords": [
    {
      "arabic": "لَعَنَ",
      "english": "Cursed",
      "urdu": "لعنت فرمائی"
    },
    {
      "arabic": "النَّائِحَةَ",
      "english": "The wailing woman",
      "urdu": "نوحہ کرنے والی"
    },
    {
      "arabic": "الْمُسْتَمِعَةَ",
      "english": "The (female) listener",
      "urdu": "سننے والی"
    },
    {
      "arabic": "نِيَاحَة",
      "english": "Wailing / Lamenting",
      "urdu": "نوحہ / بین کرنا"
    },
    {
      "arabic": "صَبْر",
      "english": "Patience",
      "urdu": "صبر"
    }
  ],
  "summary": {
    "urdu": "میت پر چلا کر رونا، بین کرنا (نوحہ) اور ایسی محفلوں میں شوق سے شریک ہونا سخت گناہ ہے جو اللہ کی رحمت سے دوری کا سبب بنتا ہے۔",
    "english": "Loudly lamenting over the dead (wailing) and intentionally listening to such acts are grave sins that distance a person from Allah's mercy."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الجنائز، رقم 3128",
      "english": "Sunan Abi Dawud, Book of Funerals, Hadith 3128"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-sa-id-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fq4m8D0p4yU",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نوحہ کی حقیقت اور ممانعت",
        "english": "Reality and Prohibition of Wailing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نوحہ سے کیا مراد ہے؟",
              "english": "What constitutes Wailing?"
            },
            "content": {
              "urdu": [
                "نوحہ سے مراد میت پر آواز بلند کر کے رونا، گریبان پھاڑنا اور جاہلیت کے بین کرنا ہے۔",
                "اس میں میت کے اوصاف کو مبالغہ آرائی کے ساتھ بیان کر کے لوگوں کو رلانا شامل ہے۔",
                "یہ عمل اللہ کی تقدیر پر ناراضگی اور بے صبری کا واضح اظہار سمجھا جاتا ہے۔"
              ],
              "english": [
                "Wailing refers to crying loudly over the deceased, tearing clothes, and pagan lamenting.",
                "It involves listing the qualities of the dead with exaggeration to incite public crying.",
                "This act is considered a clear expression of dissatisfaction and impatience with Allah's decree."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کا مفہوم",
              "english": "The Meaning of the Curse"
            },
            "content": {
              "urdu": [
                "لعنت کا مطلب اللہ کی رحمت سے دوری ہے، جو کہ کسی گناہ کے کبیرہ ہونے کی علامت ہے۔",
                "آپ ﷺ نے نوحہ کرنے والی کے ساتھ ساتھ اسے سننے والی پر بھی لعنت فرمائی ہے۔",
                "یہ اس بات کی دلیل ہے کہ گناہ میں تعاون کرنا یا اسے پسند کرنا بھی گناہ ہے۔"
              ],
              "english": [
                "A curse (La'nah) signifies being distanced from Allah's mercy, marking it as a major sin.",
                "The Prophet (ﷺ) cursed not only the one who wails but also the one who listens to it.",
                "This proves that cooperating in sin or approving of it is also a sinful act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سننے والی پر گرفت کی وجہ",
        "english": "Reason for Cursing the Listener"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہ کی حوصلہ افزائی",
              "english": "Encouraging the Sin"
            },
            "content": {
              "urdu": [
                "سننے والی عورت نوحہ کرنے والی کی ہمت بڑھاتی ہے اور اس فعل کو سماجی قبولیت دیتی ہے۔",
                "اگر لوگ ایسی محفلوں کا بائیکاٹ کریں تو یہ جاہلانہ رسم خود بخود دم توڑ دے گی۔",
                "برائی کو دیکھنا یا سننا اور اسے نہ روکنا بھی شرعی طور پر ناپسندیدہ اور لائقِ گرفت ہے۔"
              ],
              "english": [
                "The listening woman encourages the wailer and gives social acceptance to this prohibited act.",
                "If people boycott such gatherings, this ignorant custom would naturally fade away.",
                "Watching or listening to evil without preventing it is religiously disliked and punishable."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی اصلاح",
              "english": "Social Reformation"
            },
            "content": {
              "urdu": [
                "اسلام چاہتا ہے کہ مسلمانوں کا معاشرہ جاہلیت کی ہر قسم کی خرافات سے پاک ہو۔",
                "نوحہ سننے سے دل میں غم کی کیفیت غیر فطری طور پر بڑھتی ہے جو ایمان کے لیے نقصان دہ ہے۔",
                "مومن کو چاہیے کہ وہ لایعنی اور گناہ کی باتوں سے اپنے کانوں کی حفاظت کرے۔"
              ],
              "english": [
                "Islam desires that the Muslim society be free from all forms of pre-Islamic superstitions.",
                "Listening to wailing unnaturally increases grief, which is detrimental to one's faith.",
                "A believer must protect their ears from vain talk and sinful expressions of sorrow."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صبر کی فضیلت اور رونا",
        "english": "Virtue of Patience vs. Normal Crying"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری رونا جائز ہے",
              "english": "Natural Crying is Permissible"
            },
            "content": {
              "urdu": [
                "غم کے موقع پر آنکھوں سے آنسو بہنا اور دل کا غمزدہ ہونا ایک انسانی فطرت ہے۔",
                "نبی ﷺ بھی اپنے بیٹے ابراہیم کی وفات پر روئے تھے اور اسے اللہ کی رحمت قرار دیا تھا۔",
                "ممانعت صرف آواز نکالنے، بین کرنے اور تقدیر پر شکوہ کرنے کے حوالے سے ہے۔"
              ],
              "english": [
                "Shedding tears and feeling sorrow in the heart during grief is a part of human nature.",
                "The Prophet (ﷺ) wept upon the death of his son Ibrahim and called it a mercy from Allah.",
                "The prohibition only applies to raising the voice, lamenting, and complaining against destiny."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبرِ جمیل کا اجر",
              "english": "Reward for Beautiful Patience"
            },
            "content": {
              "urdu": [
                "صدمے کے پہلے لمحے میں صبر کرنا ہی اصل صبر ہے جس پر جنت کی بشارت ہے۔",
                "نوحہ کرنے سے میت کو فائدہ نہیں ہوتا بلکہ اس سے میت کو قبر میں تکلیف دی جاتی ہے۔",
                "میت کے لیے بہترین عمل صبر کرنا، استغفار کرنا اور اس کے لیے صدقہ کرنا ہے۔"
              ],
              "english": [
                "True patience is that shown at the first stroke of a calamity, which is rewarded with Paradise.",
                "Wailing does not benefit the dead; rather, it can cause the deceased distress in the grave.",
                "The best acts for the dead are showing patience, seeking forgiveness, and giving charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رسومِ جاہلیت سے برات",
              "english": "Dissociation from Ignorant Customs"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے خاندانوں میں ہونے والی غیر شرعی رسومات کی سختی سے حوصلہ شکنی کرنی چاہیے۔",
                "تعزیت کا مقصد لواحقین کو تسلی دینا ہے نہ کہ انہیں مزید رونے دھونے پر اکسانا۔",
                "سنتِ نبوی ﷺ کی پیروی میں ہی دنیا اور آخرت کی حقیقی کامیابی پوشیدہ ہے۔"
              ],
              "english": [
                "We must strictly discourage un-Islamic rituals within our families and social circles.",
                "The purpose of condolence is to comfort the bereaved, not to incite them to more wailing.",
                "True success in this world and the Hereafter lies in following the Sunnah of the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "زبان اور کانوں کی حفاظت",
              "english": "Guarding the Tongue and Ears"
            },
            "content": {
              "urdu": [
                "انسان کا ہر عضو اللہ کے ہاں جوابدہ ہے، اس لیے انہیں گناہوں سے بچانا ضروری ہے۔",
                "غم کی گھڑی میں کلماتِ استرجاع (اناللہ واناالیہ راجعون) پڑھنا مسنون عمل ہے۔",
                "اللہ ہمیں ہر اس کام سے بچنے کی توفیق دے جو اس کی ناراضگی کا باعث بنے۔"
              ],
              "english": [
                "Every limb of a person is accountable to Allah; therefore, it is vital to guard them from sins.",
                "Reciting Istirja (Truly to Allah we belong...) during grief is the Sunnah practice.",
                "May Allah grant us the ability to avoid every act that causes His displeasure."
              ]
            }
          }
        ]
      }
    }
  ]
}