{
  "hadithId": 496,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": [
      ""
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه الطبراني في الكبير والحاكم (1/401) وصححه ووافقه الذهبي. أما الشطر الثاني المتعلق بالخضروات فرواه الدارقطني (2/97) وهو ضعيف الإسناد لكن معناه صحيح عند أكثر الفقهاء.",
    "urdu": "پہلی روایت صحیح ہے، اسے طبرانی اور حاکم نے روایت کیا اور حاکم و ذہبی نے اسے صحیح قرار دیا ہے۔ دوسری روایت (سبزیوں اور پھلوں سے متعلق) دارقطنی میں ہے اور وہ سنداً ضعیف ہے، البتہ اس کا مفہوم (کہ سبزیوں میں زکوٰۃ نہیں) اکثر فقہاء کے نزدیک درست ہے۔",
    "english": "Authentic. The first part was reported by at-Tabarani and al-Hakim (1/401), who graded it Sahih, and adh-Dhahabi agreed. The second part regarding vegetables was reported by ad-Daraqutni (2/97) and is weak, though its legal implication is supported by many jurists."
  },
  "importantWords": [
    {
      "arabic": "أَصْنَافِ",
      "english": "Categories / Commodities",
      "urdu": "اقسام / اصناف"
    },
    {
      "arabic": "الشَّعِيرِ",
      "english": "Barley",
      "urdu": "جو"
    },
    {
      "arabic": "الْحِنْطَةِ",
      "english": "Wheat",
      "urdu": "گندم"
    },
    {
      "arabic": "الزَّبِيبِ",
      "english": "Raisins",
      "urdu": "کشمش / منقیٰ"
    },
    {
      "arabic": "عَفَا",
      "english": "Exempted / Forgave",
      "urdu": "معاف کر دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان بنیادی زرعی اجناس کا ذکر ہے جن پر عشر (زکوٰۃ) فرض ہے، اور ایسی اشیاء (سبزیاں اور کچھ پھل) کی نشاندہی کی گئی ہے جو زکوٰۃ سے مستثنیٰ ہیں۔",
    "english": "This Hadith identifies the primary agricultural products subject to Zakat (Ushr) and lists certain perishable items (vegetables/fruits) that are exempt."
  },
  "references": [
    {
      "arabic": "المستدرك للحاكم (1474)",
      "english": "Al-Mustadrak al-Hakim (1474)"
    },
    {
      "arabic": "سنن الدارقطني (2/97)",
      "english": "Sunan ad-Daraqutni (2/97)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa al-Ash'ari"
      },
      "slug": "abu-musa-al-ashari"
    },
    {
      "id": 2,
      "name": {
        "arabic": "معاذ بن جبل",
        "english": "Mu'adh bin Jabal"
      },
      "slug": "muadh-bin-jabal"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_rOun7K5bY",
  "grade": {
    "arabic": "صحيح (الأصل) وضعيف (الزيادة)",
    "english": "Sahih (main narration) and Da'if (the addition)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عشر کے لیے زرعی اجناس کا تعین",
        "english": "Defining Commodities for Ushr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چار بنیادی اجناس",
              "english": "The Four Primary Commodities"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے گندم، جو، کھجور اور کشمش کو زکوٰۃ کے لیے بنیادی اجناس قرار دیا۔",
                "ان اشیاء کی خصوصیت یہ ہے کہ یہ ذخیرہ کی جا سکتی ہیں اور انسانی خوراک کا اہم حصہ ہیں۔",
                "ائمہ کے درمیان اختلاف ہے کہ آیا زکوٰۃ صرف ان چار میں ہے یا ہر اس غلہ میں جو ذخیرہ ہو سکے۔"
              ],
              "english": [
                "The Prophet (ﷺ) specified wheat, barley, dates, and raisins as Zakat-eligible items.",
                "These items are characterized by being storable and acting as staple food sources.",
                "Jurists differ on whether Zakat is limited to these four or applies to all storable grains."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذخیرہ اندوزی کی اہلیت",
              "english": "Storable Nature of Produce"
            },
            "content": {
              "urdu": [
                "زکوٰۃ ان فصلوں پر فرض ہوتی ہے جو خشک ہونے کے بعد خراب نہیں ہوتیں۔",
                "ایسی اجناس جو ناپ تول کر بیچی جاتی ہیں اور جن سے سال بھر کی معاشی ضروریات وابستہ ہیں۔",
                "یہ اصول زرعی معیشت میں استحکام پیدا کرتا ہے۔"
              ],
              "english": [
                "Zakat is generally due on crops that do not perish quickly once dried.",
                "This applies to commodities sold by measure/weight that support year-round economy.",
                "This principle creates stability within the agricultural economy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سبزیوں اور پھلوں سے استثناء",
        "english": "Exemption of Vegetables and Fruits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سبزیوں پر زکوٰۃ کیوں نہیں؟",
              "english": "Why no Zakat on Vegetables?"
            },
            "content": {
              "urdu": [
                "کھیرا، تربوز اور دیگر سبزیاں جلد خراب ہونے والی اشیاء ہیں، ان میں عشر نہیں ہے۔",
                "ان اشیاء کی خرید و فروخت پر ہونے والے منافع پر (اگر نصاب تک پہنچے) زکوٰۃ ہوگی، براہِ راست فصل پر نہیں۔",
                "یہ رعایت کسانوں کے لیے آسانی کا باعث ہے کیونکہ ان کا ضیاع زیادہ ہوتا ہے۔"
              ],
              "english": [
                "Vegetables like cucumbers and watermelons are perishable, so direct Ushr is not due on them.",
                "Zakat applies to the income/profit from selling these items (if meeting Nisab), not the harvest itself.",
                "This exemption eases the burden on farmers due to the high rate of spoilage in fresh produce."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب کا فرق",
              "english": "Juristic Differences"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ کے نزدیک زمین سے نکلنے والی ہر چیز (سوائے ایندھن وغیرہ کے) پر عشر ہے۔",
                "امام شافعی اور امام احمد اس حدیث کی بنا پر صرف ذخیرہ ہونے والے اناج میں عشر مانتے ہیں۔",
                "احتیاط اور غریبوں کے فائدے کے پیشِ نظر امام ابوحنیفہ کا قول زیادہ جامع لگتا ہے۔"
              ],
              "english": [
                "Imam Abu Hanifa views Ushr as due on everything the earth produces (except fuel, etc.).",
                "Imams Shafi'i and Ahmad limit Ushr to storable grains based on this Hadith.",
                "Abu Hanifa's view is often seen as more comprehensive for the benefit of the needy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا معاذ کی یمن میں تعلیمات",
        "english": "Mu'adh's Teachings in Yemen"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضاحتی احکامات",
              "english": "Clarifying Commands"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنے نمائندوں کو واضح ہدایات دیں کہ وہ لوگوں سے کیا وصول کریں۔",
                "یہ حکم انصاف پر مبنی تھا تاکہ لوگ اپنے قیمتی پھلوں اور سبزیوں کے چھن جانے سے نہ ڈریں۔",
                "اسلامی ریاست میں وصولی کے اصولوں کی شفافیت بہت اہم ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) gave clear instructions to his delegates on what to collect.",
                "This prevented people from fearing the loss of their perishable valuable fruits/vegetables.",
                "Transparency in collection principles is vital in an Islamic state."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شریعت کی لچک",
              "english": "Flexibility of Shariah"
            },
            "content": {
              "urdu": [
                "شریعت نے ضرورت اور حالات کے مطابق اشیاء کو زکوٰۃ سے مستثنیٰ کیا ہے۔",
                "دین میں سختی نہیں بلکہ آسانی پیدا کرنا مقصود ہے۔",
                "زرعی ٹیکس (عشر) کا نظام غریبوں کی معاشی مدد کا سب سے بڑا ذریعہ ہے۔"
              ],
              "english": [
                "Shariah exempts certain items based on necessity and practical conditions.",
                "The objective of religion is ease, not creating undue hardship.",
                "The Ushr system is a primary source for the financial support of the poor."
              ]
            }
          }
        ]
      }
    }
  ]
}