{
  "hadithId": 1215,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/14/23"],
    "kitabId": 14,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 99
  },
 
  "takhreej": {
    "arabic": "صحيح بشواهده.‏ رواه أحمد (3/344)، وأبو داود (3246)، والنسائي في الكبرى (3/491)، وابن حبان (1192). وله شاهد صحيح عن أبي هريرة عند ابن ماجه (2325).",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے احمد، ابوداؤد اور نسائی نے روایت کیا، جبکہ ابن حبان نے اسے صحیح کہا ہے۔ ابن ماجہ میں ابوہریرہ رضی اللہ عنہ سے اس کا صحیح شاہد موجود ہے۔",
    "english": "Sahih due to corroborating evidences. Reported by Ahmad (3/344), Abu Dawud (3246), An-Nasa'i (3/491), and Ibn Hibban (1192). It has a Sahih supporting narration from Abu Hurairah in Ibn Majah (2325)."
  },
  "importantWords": [
    {
      "arabic": "مِنْبَرِي",
      "english": "My pulpit",
      "urdu": "میرا منبر"
    },
    {
      "arabic": "يَمِينٍ",
      "english": "Oath",
      "urdu": "قسم"
    },
    {
      "arabic": "آثِمَةٍ",
      "english": "Sinful/False",
      "urdu": "گناہ والی / جھوٹی"
    },
    {
      "arabic": "تَبَوَّأَ",
      "english": "Took/Prepared",
      "urdu": "ٹھکانہ بنا لیا"
    },
    {
      "arabic": "مَقْعَدَهُ",
      "english": "His seat",
      "urdu": "اپنا مقام"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مسجد نبوی اور منبرِ رسول ﷺ جیسی مقدس جگہوں پر جھوٹی قسم کھانے کی سخت وعید بیان کی گئی ہے، جو کہ جہنم کا باعث ہے۔",
    "english": "This Hadith warns against taking false oaths at sacred places like the Prophet's (ﷺ) pulpit, stating that such a grave sin leads to Hell."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3246)",
      "english": "Reported by Abu Dawud (3246)"
    },
    {
      "arabic": "رواه أحمد (14631)",
      "english": "Reported by Ahmad (14631)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مقدس مقامات کی حرمت",
        "english": "Sanctity of Sacred Places"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منبرِ رسول ﷺ پر قسم",
              "english": "Oath at the Prophet's (ﷺ) Pulpit"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کے منبر پر قسم کھانا عام جگہوں سے زیادہ حساس معاملہ ہے۔",
                "مقدس جگہ پر جھوٹ بولنا گناہ کی سنگینی کو کئی گنا بڑھا دیتا ہے۔",
                "یہ عمل براہِ راست رسول اللہ ﷺ کی مجلس اور مقام کی توہین ہے۔"
              ],
              "english": [
                "Taking an oath at the Prophet's pulpit is more sensitive than in ordinary places.",
                "Lying at a sacred site multiplies the gravity of the sin significantly.",
                "This act is a direct insult to the Prophet's assembly and esteemed station."
              ]
            }
          },
          {
            "title": {
              "urdu": "تغلیظِ یمین (قسم کی سختی)",
              "english": "Taghlidh al-Yamin (Empowerment of Oath)"
            },
            "content": {
              "urdu": [
                "اسلامی فقہ میں بعض اوقات جگہ اور وقت کی وجہ سے قسم کو سخت کیا جاتا ہے۔",
                "مقدس مقامات پر قسم دلانے کا مقصد انسان کے دل میں خوفِ خدا پیدا کرنا ہے۔",
                "ایسی جگہ پر جھوٹ بولنے والا شخص اللہ کی کھلی نافرمانی کا مرتکب ہوتا ہے۔"
              ],
              "english": [
                "In Islamic jurisprudence, oaths are sometimes intensified by time or location.",
                "Administering oaths at holy sites aims to instill the fear of Allah in the heart.",
                "One who lies in such a place commits an act of open defiance against Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جہنم کی وعید",
        "english": "The Warning of Hellfire"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ٹھکانہ بنالینا کا مفہوم",
              "english": "Meaning of 'Preparing One's Seat'"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ اس گناہ کا بدلہ یقینی طور پر جہنم ہے۔",
                "جھوٹی قسم کھانے والا شخص خود اپنے لیے عذاب کا راستہ منتخب کرتا ہے۔",
                "یہ الفاظ گناہ کی ہولناکی اور اس پر ملنے والی سزا کی شدت کو ظاہر کرتے ہیں۔"
              ],
              "english": [
                "This implies that the retribution for this sin is definitely Hellfire.",
                "A person who takes a false oath knowingly chooses the path of punishment.",
                "These words illustrate the horror of the sin and the severity of the penalty."
              ]
            }
          },
          {
            "title": {
              "urdu": "معمولی چیز پر جھوٹی قسم",
              "english": "False Oath over Trivial Things"
            },
            "content": {
              "urdu": [
                "ابوداؤد کی روایت کے مطابق چاہے وہ چیز مسواک جیسی معمولی ہی کیوں نہ ہو۔",
                "گناہ مال کی قیمت پر نہیں بلکہ اللہ کے نام کی بے حرمتی پر منحصر ہے۔",
                "حقیر دنیاوی فائدے کے لیے آخرت بیچنا بدترین خسارہ اور نادانی ہے۔"
              ],
              "english": [
                "According to Abu Dawud, this applies even if the object is as trivial as a Miswak.",
                "The sin is not based on the value of property but on desecrating Allah's name.",
                "Selling the Hereafter for a petty worldly gain is the ultimate loss and folly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی و اخلاقی اثرات",
        "english": "Social and Ethical Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدالتی شفافیت",
              "english": "Judicial Transparency"
            },
            "content": {
              "urdu": [
                "اگر لوگ جھوٹی قسمیں کھائیں گے تو عدالتی نظام مفلوج ہو جائے گا۔",
                "قسم کو انصاف کے حصول کے لیے ایک آخری اور حتمی ہتھیار مانا گیا ہے۔",
                "جھوٹ کا سہارا لینا معاشرے میں ظلم اور ناانصافی کو رواج دیتا ہے۔"
              ],
              "english": [
                "The judicial system becomes paralyzed if people resort to false oaths.",
                "The oath is regarded as a final and decisive tool for achieving justice.",
                "Resorting to lies promotes a culture of oppression and inequity in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان کی آزمائش",
              "english": "Trial of Faith"
            },
            "content": {
              "urdu": [
                "قسم کھانا دراصل انسان کے ایمان اور دیانتداری کا امتحان ہے۔",
                "مومن کی پہچان یہ ہے کہ وہ ہر حال میں اللہ کے نام کی لاج رکھتا ہے۔",
                "دنیاوی فائدے پر اللہ کے ڈر کو ترجیح دینا ہی حقیقی کامیابی ہے۔"
              ],
              "english": [
                "Taking an oath is essentially a test of a person's faith and integrity.",
                "The hallmark of a believer is honoring the name of Allah in all situations.",
                "Prioritizing the fear of Allah over worldly benefit is the true success."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور توبہ",
        "english": "Practical Lessons and Repentance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "ہر مسلمان کو چاہیے کہ وہ اپنی زبان کو جھوٹ سے پاک رکھے۔",
                "بات بات پر قسم کھانے کی عادت سے پرہیز کرنا چاہیے تاکہ حرمت برقرار رہے۔",
                "سچی بات کہنا اور دوسروں کے حقوق کا تحفظ کرنا بہترین عبادت ہے۔"
              ],
              "english": [
                "Every Muslim must strive to keep their tongue purified from lies.",
                "Habitually taking oaths for everything should be avoided to maintain sanctity.",
                "Speaking the truth and protecting the rights of others is a great act of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "تلافی اور رجوع",
              "english": "Restitution and Returning to Allah"
            },
            "content": {
              "urdu": [
                "جس نے جھوٹی قسم کھائی ہو اس پر سچی توبہ اور مال کی واپسی فرض ہے۔",
                "اللہ کی ناراضگی سے بچنے کے لیے دنیا میں ہی حساب صاف کر لینا چاہیے۔",
                "توبہ کا دروازہ کھلا ہے مگر حق دار کا حق لوٹانا توبہ کی شرط ہے۔"
              ],
              "english": [
                "One who took a false oath must sincerely repent and return the property.",
                "One should settle all accounts in this world to avoid Allah's displeasure.",
                "The door of repentance is open, but returning the stolen right is a condition."
              ]
            }
          }
        ]
      }
    }
  ]
}