{
  "hadithId": 1331,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh:1510"
    ],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "كتاب الجامع",
    "babId": 106
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (1/403)، وابن حبان (959)، والبزار (1888)، وأبو يعلى (5075). وصححه الألباني في إرواء الغليل (74).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد بن حنبل اور ابن حبان نے روایت کیا ہے۔ اس کی ایک شاہد روایت سیدہ عائشہ رضی اللہ عنہا سے بھی مروی ہے۔ علامہ البانی نے اسے 'ارواء الغلیل' میں صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic). Reported by Ahmad (1/403) and Ibn Hibban (959). It has a supporting narration from Aishah (RAA). Authenticated by Al-Albani in Irwa' al-Ghalil (74)."
  },
  "importantWords": [
    {
      "arabic": "أَحْسَنْتَ",
      "english": "Made beautiful / perfected",
      "urdu": "بہترین بنایا / سنوارا"
    },
    {
      "arabic": "خَلْقِي",
      "english": "My creation / physical form",
      "urdu": "میری تخلیق / ظاہری شکل و صورت"
    },
    {
      "arabic": "خُلُقِي",
      "english": "My character / manners",
      "urdu": "میرا اخلاق / باطنی اوصاف"
    },
    {
      "arabic": "فَحَسِّنْ",
      "english": "So make beautiful",
      "urdu": "تو اچھا بنا دے"
    }
  ],
  "summary": {
    "urdu": "اس نبوی دعا میں اللہ تعالیٰ سے باطنی حسن یعنی اچھے اخلاق کی التجا کی گئی ہے، اور یہ اعتراف کیا گیا ہے کہ جس طرح انسانی جسم اللہ کی بہترین تخلیق ہے، اسی طرح اخلاق کی خوبصورتی بھی صرف اسی کی توفیق سے ممکن ہے۔",
    "english": "This Prophetic supplication seeks internal beauty (good character) from Allah, acknowledging that just as physical form is a divine creation, moral excellence is also a gift from Him."
  },
  "references": [
    {
      "arabic": "مسند أحمد (3823)",
      "english": "Musnad Ahmad (3823)"
    },
    {
      "arabic": "صحيح ابن حبان (959)",
      "english": "Sahih Ibn Hibban (959)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ظاہر اور باطن کا توازن",
        "english": "Balance Between Interior and Exterior"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خلق اور خلق میں فرق",
              "english": "Distinction Between Khalq and Khuluq"
            },
            "content": {
              "urdu": [
                "لفظ 'خلق' سے مراد انسان کی ظاہری شکل و صورت ہے جو اللہ نے 'احسنِ تقویم' پر بنائی ہے۔",
                "لفظ 'خلق' (اخلاق) سے مراد انسان کی باطنی صفات اور رویے ہیں۔",
                "انسان کی اصل قیمت اس کے ظاہری ڈھانچے سے نہیں بلکہ اس کے پاکیزہ اخلاق سے ہوتی ہے۔"
              ],
              "english": [
                "'Khalq' refers to the physical appearance created by Allah in the best of molds.",
                "'Khuluq' refers to the internal attributes and moral behavior.",
                "A person's true value lies in their moral purity, not their physical structure."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاق کے لیے دعا کی ضرورت",
              "english": "Necessity of Praying for Character"
            },
            "content": {
              "urdu": [
                "اچھے اخلاق اللہ کی طرف سے ایک بڑی نعمت اور عطیہ ہیں۔",
                "جس طرح ہم رزق اور صحت مانگتے ہیں، اسی طرح ہمیں اخلاق کی درستی کی دعا بھی مانگنی چاہیے۔",
                "نبی کریم ﷺ کے کامل ہونے کے باوجود آپ ﷺ کا یہ دعا مانگنا امت کے لیے تعلیم ہے۔"
              ],
              "english": [
                "Good character is a great blessing and gift from Allah.",
                "Just as we pray for sustenance and health, we must pray for the rectification of our manners.",
                "The Prophet's (ﷺ) practice of this prayer despite his perfection is a teaching for the Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حسنِ اخلاق کی اہمیت",
        "english": "Excellence of Good Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان کی تکمیل",
              "english": "Completion of Faith"
            },
            "content": {
              "urdu": [
                "کامل ترین مومن وہ ہے جس کے اخلاق سب سے اچھے ہوں۔",
                "قیامت کے دن میزان میں سب سے وزنی عمل 'حسنِ اخلاق' ہی ہوگا۔",
                "اچھے اخلاق والا شخص اپنے اخلاق کے ذریعے تہجد گزار اور روزے دار کا درجہ پا لیتا ہے۔"
              ],
              "english": [
                "The most perfect believer is the one best in character.",
                "Good character will be the heaviest deed on the scales on the Day of Judgment.",
                "A well-mannered person can reach the rank of those who pray at night and fast during the day."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وضاحتِ عامہ (آئینے کی روایت)",
        "english": "General Clarification (Mirror Narration)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی تخصیص",
              "english": "Specifying the Time"
            },
            "content": {
              "urdu": [
                "بعض روایات میں یہ دعا آئینہ دیکھنے کے وقت منسوب ہے، مگر وہ روایات سنداً کمزور ہیں۔",
                "محدثین کے نزدیک یہ دعا کسی بھی وقت، خصوصاً نمازوں میں یا عام اوقات میں مانگی جا سکتی ہے۔",
                "دعا کا مقصد ہر وقت اپنے باطن کی اصلاح کی طرف متوجہ رہنا ہے۔"
              ],
              "english": [
                "Some narrations link this prayer specifically to looking in a mirror, but those chains are weak.",
                "According to scholars, this prayer can be recited at any time, especially during or after Salah.",
                "The goal is to remain constantly focused on the rectification of one's inner self."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باطنی حسن کی جستجو",
              "english": "Striving for Internal Beauty"
            },
            "content": {
              "urdu": [
                "جتنا وقت ہم اپنے ظاہری لباس اور بناؤ سنگھار کو دیتے ہیں، اس سے زیادہ توجہ اپنے اخلاق پر دینی چاہیے۔",
                "برے اخلاق (غصہ، تکبر، جھوٹ) سے نجات کے لیے اللہ کے سامنے گڑگڑانا چاہیے۔",
                "جب بھی ہم اپنے جسمانی حسن کو دیکھیں یا اس پر اللہ کا شکر ادا کریں، فوراً اخلاق کی بہتری کی فکر بھی کریں۔"
              ],
              "english": [
                "We should dedicate more time to improving our manners than we spend on clothing and appearance.",
                "One should supplicate earnestly to be saved from bad traits like anger, pride, and lying.",
                "Whenever we appreciate our physical gifts, we should immediately reflect on improving our character."
              ]
            }
          }
        ]
      }
    }
  ]
}