{
  "hadithId": 917,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1053"],
    "kitabId": 8,
    "inKitabBab": 8,
    "arabicBook": "كتاب الطلاق",
    "babId": 71
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (1472) من حديث ابن عباس رضي الله عنهما. وهذا الحديث أصل في مسألة الطلاق الثلاث بلفظ واحد، وقد اختلف الفقهاء في تنزيله.",
    "urdu": "صحیح۔ اسے امام مسلم (1472) نے روایت کیا ہے۔ یہ حدیث ایک مجلس کی تین طلاقوں کے مسئلے میں بنیادی اہمیت رکھتی ہے۔ سیدنا عمر رضی اللہ عنہ کا اقدام ایک انتظامی تعزیر تھی تاکہ لوگ طلاق جیسے معاملے میں لاپرواہی نہ برتیں۔",
    "english": "Sahih. Reported by Muslim (1472). This Hadith is a primary source regarding the issue of triple divorce in one sitting. Umar's (RA) decision was an administrative penalty to deter people from misusing the right of divorce."
  },
  "importantWords": [
    {
      "arabic": "عَهْدِ",
      "english": "Era / Time",
      "urdu": "زمانہ"
    },
    {
      "arabic": "اَلثَّلَاثِ",
      "english": "Three",
      "urdu": "تین"
    },
    {
      "arabic": "وَاحِدَةٌ",
      "english": "One",
      "urdu": "ایک"
    },
    {
      "arabic": "اِسْتَعْجَلُوا",
      "english": "They became hasty",
      "urdu": "انہوں نے جلدی کی"
    },
    {
      "arabic": "أَنَاةٌ",
      "english": "Deliberation / Patience",
      "urdu": "مہلت / بردباری"
    },
    {
      "arabic": "أَمْضَيْنَاهُ",
      "english": "Enforce it",
      "urdu": "ہم اسے نافذ کر دیں"
    }
  ],
  "summary": {
    "urdu": "حدیث بتاتی ہے کہ عہدِ نبوی میں ایک مجلس کی تین طلاقیں ایک ہی شمار ہوتی تھیں، مگر سیدنا عمر نے لوگوں کی جلد بازی کو روکنے کے لیے انہیں تین ہی نافذ کرنے کا حکم دیا۔",
    "english": "The Hadith states that in the Prophet's time, triple divorce in one sitting was treated as one. Later, Umar (RA) enforced it as three to discourage people from acting hastily."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1472)",
      "english": "Sahih Muslim (1472)"
    },
    {
      "arabic": "سنن النسائي (3430)",
      "english": "Sunan an-Nasa'i (3430)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تاریخی پس منظر",
        "english": "Historical Context"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عہدِ نبوی کا معمول",
              "english": "Practice in the Prophetic Era"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کے دور میں اگر کوئی شخص اکٹھی تین طلاقیں دیتا تو اسے ایک ہی رجعی طلاق مانا جاتا تھا۔",
                "سیدنا ابوبکر صدیق اور سیدنا عمر کے ابتدائی دور میں بھی یہی طریقہ رائج رہا۔",
                "اس کا مقصد یہ تھا کہ میاں بیوی کو صلح اور رجوع کا موقع فراہم کیا جا سکے۔"
              ],
              "english": [
                "During the Prophet's (ﷺ) time, three divorces given at once were treated as a single revocable divorce.",
                "This practice continued during Abu Bakr's era and the early years of Umar's caliphate.",
                "The purpose was to provide the couple with an opportunity for reconciliation and return."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدنا عمر کا انتظامی فیصلہ",
              "english": "Umar's Administrative Decision"
            },
            "content": {
              "urdu": [
                "جب لوگوں نے طلاق کو مذاق بنا لیا اور کثرت سے اکٹھی طلاقیں دینے لگے تو حضرت عمر نے سخت موقف اختیار کیا۔",
                "انہوں نے اسے بطور سزا تین ہی نافذ کر دیا تاکہ لوگ اس سنگین گناہ سے باز رہیں۔",
                "یہ فیصلہ شرعی اصولوں کے تحت ایک حاکمِ وقت کی سیاسی و انتظامی بصیرت پر مبنی تھا۔"
              ],
              "english": [
                "When people began to treat divorce lightly and uttered triple divorces frequently, Umar took a stern stance.",
                "He enforced it as three as a penalty to deter people from committing this grave act.",
                "This decision was based on the political and administrative wisdom of a ruler within Shariah limits."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات اور آراء",
        "english": "Juristic Views and Differences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Position of the Majority"
            },
            "content": {
              "urdu": [
                "چاروں ائمہ (احناف، مالکی، شافعی، حنبلی) کے نزدیک ایک مجلس کی تین طلاقیں تین ہی واقع ہو جاتی ہیں۔",
                "وہ سیدنا عمر کے اس فیصلے کو اجماعِ صحابہ اور حتمی قانون کے طور پر تسلیم کرتے ہیں۔",
                "ان کے نزدیک طلاق دینے والا اپنے حق کو ضائع کر دیتا ہے اس لیے اسے سزا ملنی چاہیے۔"
              ],
              "english": [
                "The four schools of thought (Hanafi, Maliki, Shafi'i, Hanbali) hold that triple divorce in one sitting counts as three.",
                "They accept Umar's decision as a consensus of the Companions and a final legal ruling.",
                "According to them, the one who divorces waives his right, so he must bear the consequences."
              ]
            }
          },
          {
            "title": {
              "urdu": "اہلِ حدیث اور بعض دیگر کا موقف",
              "english": "View of Ahl-e-Hadith and Others"
            },
            "content": {
              "urdu": [
                "اہلِ حدیث اور بعض جلیل القدر فقہاء کے نزدیک اصل سنت یہی ہے کہ اسے ایک ہی مانا جائے۔",
                "وہ دلیل دیتے ہیں کہ جو چیز عہدِ نبوی میں ایک تھی وہ بعد میں تین نہیں بن سکتی۔",
                "اس موقف کے مطابق طلاقِ ثلاثہ کے بعد بھی رجوع کی گنجائش باقی رہتی ہے۔"
              ],
              "english": [
                "Ahl-e-Hadith and some prominent jurists believe the original Sunnah is to count it as one.",
                "They argue that what was considered one in the Prophet's time cannot become three later.",
                "According to this view, the possibility of reconciliation remains after a triple divorce."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Social Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جلد بازی کے نقصانات",
              "english": "Dangers of Hastiness"
            },
            "content": {
              "urdu": [
                "غصے میں دی گئی اکٹھی تین طلاقیں خاندانوں کو تباہ کر دیتی ہیں اور واپسی کی راہ بند ہو جاتی ہے۔",
                "سیدنا عمر نے اسی جلد بازی کو روکنے کے لیے قانون کو سخت کیا تھا۔",
                "معاشرے میں طلاق کے صحیح طریقے کا شعور پیدا کرنا بہت ضروری ہے۔"
              ],
              "english": [
                "Triple divorces given in anger destroy families and block the path to return.",
                "Umar (RA) tightened the law specifically to stop this impulsive behavior.",
                "It is essential to create awareness about the correct method of divorce in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "صلح و مشورت کی اہمیت",
              "english": "Importance of Consultation"
            },
            "content": {
              "urdu": [
                "اسلام طلاق کو ایک مبغوض ترین حلال قرار دیتا ہے اس لیے جلد بازی سے بچنا چاہیے۔",
                "کوئی بھی بڑا فیصلہ کرنے سے پہلے بزرگوں اور صاحبِ علم لوگوں سے مشورہ کرنا چاہیے۔",
                "قرآن و سنت کی تعلیمات کا مقصد گھروں کو آباد رکھنا ہے نہ کہ اجاڑنا۔"
              ],
              "english": [
                "Islam considers divorce the most loathed permissible thing, so haste must be avoided.",
                "Before making any major decision, one should consult elders and knowledgeable people.",
                "The teachings of the Quran and Sunnah aim to sustain homes, not to ruin them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور نصیحت",
        "english": "Wisdom and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی حدود کی پاسداری",
              "english": "Observing Shariah Limits"
            },
            "content": {
              "urdu": [
                "اللہ کے احکامات کے ساتھ مذاق یا اپنی مرضی کرنا دنیا و آخرت میں نقصان کا باعث ہے۔",
                "طلاق دینے کا سنت طریقہ یہ ہے کہ الگ الگ وقفوں سے ایک ایک کر کے دی جائے۔",
                "شرعی حدود کی پاسداری ہی میں انسانیت کی فلاح اور خیر پوشیدہ ہے۔"
              ],
              "english": [
                "Mocking Allah's commands or following one's whims leads to loss in both worlds.",
                "The Sunnah method is to issue divorce one by one over separate intervals.",
                "Human welfare and goodness are hidden only in observing Shariah limits."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاکمِ وقت کا اختیار",
              "english": "Authority of the Ruler"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ اسلامی حکومت معاشرے کی اصلاح کے لیے تعزیری قوانین بنا سکتی ہے۔",
                "سیدنا عمر کا عمل اجتہادِ حکمرانی کی ایک بہترین مثال ہے۔",
                "قوانین کا مقصد عوام کی بھلائی اور برائی کا خاتمہ ہونا چاہیے۔"
              ],
              "english": [
                "This Hadith proves that an Islamic government can create penal laws to reform society.",
                "Umar's (RA) action is a perfect example of governing ijtihad.",
                "The purpose of laws should be the welfare of the public and the eradication of evil."
              ]
            }
          }
        ]
      }
    }
  ]
}