{
  "hadithId": 563,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/563"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "حسن صحيح. رواه أبو داود (2337)، والترمذي (738)، وابن ماجه (1651)، وأحمد (2/442). وصححه الترمذي وابن حبان والألباني، بينما أنكره الإمام أحمد لمخالفته أحاديث أخرى.",
    "urdu": "حسن صحیح۔ اسے ابوداؤد (2337)، ترمذی (738)، ابن ماجہ (1651) اور احمد نے روایت کیا ہے۔ امام ترمذی، ابن حبان اور البانی نے اسے صحیح کہا ہے، جبکہ امام احمد نے دیگر احادیث سے بظاہر تعارض کی بنا پر اسے منکر قرار دیا ہے۔",
    "english": "Hasan Sahih. Reported by Abu Dawud (2337), At-Tirmidhi (738), Ibn Majah (1651), and Ahmad (2/442). Authenticated by At-Tirmidhi and Al-Albani, though Imam Ahmad considered it Munkar due to apparent conflict with other narrations."
  },
  "importantWords": [
    {
      "arabic": "اِنْتَصَفَ",
      "english": "Reaches the middle",
      "urdu": "آدھا ہو جائے"
    },
    {
      "arabic": "شَعْبَانَ",
      "english": "Shaban",
      "urdu": "شعبان کا مہینہ"
    },
    {
      "arabic": "فَلَا تَصُومُوا",
      "english": "Do not fast",
      "urdu": "پس تم روزہ نہ رکھو"
    },
    {
      "arabic": "اسْتَنْكَرَهُ",
      "english": "Graded it Munkar",
      "urdu": "اسے منکر قرار دیا"
    },
    {
      "arabic": "الْخَمْسَةُ",
      "english": "The Five (Hadith Compilers)",
      "urdu": "پانچوں محدثین"
    }
  ],
  "summary": {
    "urdu": "نبی ﷺ نے شعبان کے دوسرے حصے (16 تاریخ سے) میں نفلی روزے رکھنے سے منع فرمایا ہے تاکہ انسان رمضان کے لیے اپنی قوت بچا سکے، سوائے ان کے جو پہلے سے روزے رکھنے کے عادی ہوں۔",
    "english": "The Prophet (ﷺ) prohibited starting voluntary fasts after the mid of Shaban to preserve strength for Ramadan, except for those who have a regular habit of fasting."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2337)",
      "english": "Reported by Abu Dawud (2337)"
    },
    {
      "arabic": "رواه الترمذي (738)",
      "english": "Reported by At-Tirmidhi (738)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=X0h7_m8K4X8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ممانعت کی نوعیت اور حکمت",
        "english": "Nature and Wisdom of Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمضان کے لیے تیاری",
              "english": "Preparation for Ramadan"
            },
            "content": {
              "urdu": [
                "شعبان کے دوسرے حصے میں روزوں سے روکنے کا مقصد رمضان کے فرض روزوں کے لیے جسمانی توانائی برقرار رکھنا ہے۔",
                "مسلسل روزے رکھنے سے انسان رمضان شروع ہونے تک نڈھال ہو سکتا ہے جس سے فرض عبادت متاثر ہونے کا اندیشہ ہے۔",
                "شریعت میں فرائض کو نوافل پر ترجیح دی گئی ہے، لہذا وہ نفل جو فرض میں خلل ڈالے، اس سے بچنا بہتر ہے۔"
              ],
              "english": [
                "The aim of prohibiting fasting in the latter half of Shaban is to maintain physical energy for Ramadan.",
                "Continuous fasting might leave a person exhausted by the time Ramadan starts, potentially affecting obligatory worship.",
                "Shariah prioritizes obligatory acts over voluntary ones; hence, avoiding voluntary acts that hinder obligations is preferred."
              ]
            }
          },
          {
            "title": {
              "urdu": "امتیازی فرق",
              "english": "Distinctive Separation"
            },
            "content": {
              "urdu": [
                "اس ممانعت سے نفلی اور فرضی روزوں کے درمیان ایک واضح وقفہ اور امتیاز پیدا ہوتا ہے۔",
                "تاکہ لوگ رمضان کے روزوں کو شعبان کے ساتھ ملا کر ایک طویل تسلسل نہ بنا لیں۔",
                "یہ حکم دین میں غلو (حد سے بڑھنے) کو روکنے کے لیے ایک حفاظتی تدبیر ہے۔"
              ],
              "english": [
                "This prohibition creates a clear gap and distinction between voluntary and obligatory fasts.",
                "It prevents people from merging Shaban and Ramadan into one prolonged sequence of fasting.",
                "This ruling serves as a precautionary measure against extremism (Ghuluw) in religious practices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مستثنیٰ صورتیں",
        "english": "Exceptional Circumstances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عادی روزہ دار",
              "english": "Regular Fasters"
            },
            "content": {
              "urdu": [
                "وہ لوگ جو پہلے سے پیر اور جمعرات یا صومِ داؤدی کے عادی ہوں، ان کے لیے ۱۵ شعبان کے بعد بھی روزہ رکھنا جائز ہے۔",
                "نبی ﷺ کا اپنا عمل بھی شعبان میں کثرت سے روزے رکھنے کا تھا، جو جواز کی دلیل ہے۔",
                "ممانعت صرف ان کے لیے ہے جو خاص ۱۵ شعبان کے بعد سے نئے نفلی روزوں کی ابتدا کرنا چاہتے ہوں۔"
              ],
              "english": [
                "Those accustomed to fasting on Mondays and Thursdays or the Fast of Dawud may continue after mid-Shaban.",
                "The Prophet's (ﷺ) own practice of fasting extensively in Shaban serves as a proof of permissibility.",
                "The prohibition is specifically for those who intend to start new voluntary fasts only after the 15th."
              ]
            }
          },
          {
            "title": {
              "urdu": "قضا اور نذر کے روزے",
              "english": "Make-up and Vow Fasts"
            },
            "content": {
              "urdu": [
                "اگر کسی کے ذمے رمضان کے قضا روزے باقی ہوں، تو وہ شعبان کے آخری حصے میں بھی رکھے جا سکتے ہیں۔",
                "نذر (منت) مانے ہوئے روزے بھی اس ممانعت کے زمرے میں نہیں آتے۔",
                "فرض کی تکمیل اور واجب کی ادائیگی ہر حال میں نفلی ممانعت پر مقدم ہے۔"
              ],
              "english": [
                "Missed Ramadan fasts (Qada) can still be made up during the latter part of Shaban.",
                "Fasts due to a vow (Nadhr) are also excluded from this general prohibition.",
                "Completing obligatory and mandatory fasts always takes precedence over voluntary restrictions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محدثین کا اختلاف",
        "english": "Scholarly Disagreement"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام احمد کا موقف",
              "english": "Position of Imam Ahmad"
            },
            "content": {
              "urdu": [
                "امام احمد بن حنبل نے اس حدیث کو 'منکر' قرار دیا ہے کیونکہ یہ ان کے نزدیک زیادہ صحیح احادیث کے خلاف ہے۔",
                "ان کی دلیل بخاری و مسلم کی وہ حدیث ہے جس میں صرف رمضان سے ایک دو دن پہلے روزہ رکھنے سے روکا گیا ہے۔",
                "کبار محدثین کے درمیان یہ علمی بحث اس بات کی علامت ہے کہ احادیث کے فہم میں باریکیاں موجود ہیں۔"
              ],
              "english": [
                "Imam Ahmad graded this Hadith as 'Munkar' because he felt it contradicted more authentic narrations.",
                "His evidence is the Sahihayn report which only forbids fasting one or two days before Ramadan.",
                "This academic debate among major scholars highlights the depth and nuances in understanding Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "تطبیق اور مفاہمت",
              "english": "Reconciliation and Harmony"
            },
            "content": {
              "urdu": [
                "جمہور علماء ان روایات میں اس طرح تطبیق دیتے ہیں کہ بلا ضرورت نئے سرے سے نفل شروع کرنا منع ہے۔",
                "اگر نیت رمضان کی تیاری اور پہلے سے تسلسل کی ہو تو کوئی حرج نہیں۔",
                "احتیاط کا تقاضا یہ ہے کہ اگر جسمانی کمزوری کا خوف ہو تو ۱۵ شعبان کے بعد نفل نہ رکھے جائیں۔"
              ],
              "english": [
                "The majority of scholars reconcile these reports by stating that starting new voluntary fasts without reason is forbidden.",
                "If the intention is preparation for Ramadan or a continuation of habit, there is no harm.",
                "Precaution dictates that if physical weakness is feared, one should avoid voluntary fasts after mid-Shaban."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال پسندی",
              "english": "Moderation"
            },
            "content": {
              "urdu": [
                "اسلام ہر معاملے میں اعتدال اور توازن کی تعلیم دیتا ہے۔",
                "نیکی میں بھی اتنا ہی بوجھ اٹھانا چاہیے جتنا انسان برداشت کر سکے۔",
                "رمضان کے استقبال کے لیے تروتازہ رہنا خود ایک سنت ہے۔"
              ],
              "english": [
                "Islam teaches moderation and balance in every aspect of life.",
                "Even in righteous deeds, one should only take on what they can bear.",
                "Staying refreshed to welcome Ramadan is a Sunnah in itself."
              ]
            }
          },
          {
            "title": {
              "urdu": "علمی تنوع کا احترام",
              "english": "Respect for Scholarly Diversity"
            },
            "content": {
              "urdu": [
                "ائمہ کے درمیان اختلاف ہمیں مسائل کے مختلف پہلوؤں کو سمجھنے میں مدد دیتا ہے۔",
                "کسی ایک موقف پر سختی کرنے کے بجائے دلائل کی بنیاد پر عمل کرنا چاہیے۔",
                "علماء کی آراء کا احترام دین کی فہم کا لازمی حصہ ہے۔"
              ],
              "english": [
                "Differences among Imams help us understand various dimensions of an issue.",
                "One should act based on evidence rather than being rigid on a single viewpoint.",
                "Respecting the opinions of scholars is an essential part of religious understanding."
              ]
            }
          }
        ]
      }
    }
  ]
}