{
  "hadithId": 221,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "ضعيف (مرفوعاً). رواه الدارقطني مرفوعاً وموقوفاً (2/312). دارقطني نے ہی موقوف (ابوہریرہ کا قول) کو زیادہ صحیح قرار دیا ہے، جہاں انہوں نے کہا ہے: 'هو أشبهها بالصواب' (یہ زیادہ صحیح کے مشابہ ہے)۔ جبکہ جہر بالبسملہ کے شواہد صحیح ہیں۔",
    "urdu": "ضعیف (مرفوعاً)۔ اسے دارقطنی نے مرفوعاً (نبیؐ سے منسوب) اور موقوفاً (صحابہؓ سے منسوب) دونوں طرح سے روایت کیا ہے (2/312)۔ دارقطنی نے موقوف روایت کو ہی زیادہ صحیح قرار دیا ہے، لیکن جہر بالبسملہ کے دیگر شواہد صحیح ہیں۔",
    "english": "Weak (Marfū'). Reported by Ad-Dāraquṭnī both Marfū' (attributed to the Prophet) and Maukūf (attributed to the Companion) (2/312). Ad-Dāraquṭnī considered the Maukūf narration (saying of Abu Hurayrah) to be more correct. However, there are authentic corroborating reports for reciting the Basmalah audibly."
  },
  "importantWords": [
    {
      "arabic": "إِذَا قَرَأْتُمْ",
      "english": "When you recite",
      "urdu": "جب تم پڑھو"
    },
    {
      "arabic": "اَلْفَاتِحَةِ",
      "english": "Al-Fātiḥah",
      "urdu": "سورۃ فاتحہ"
    },
    {
      "arabic": "فَاقْرَءُوا",
      "english": "Then recite",
      "urdu": "تو پڑھا کرو"
    },
    {
      "arabic": "آيَاتِهَا",
      "english": "Its verses",
      "urdu": "اس کی آیتوں میں سے"
    },
    {
      "arabic": "صَوَّبَ وَقْفَهُ",
      "english": "Upheld its Maukūf (وقفہ)",
      "urdu": "اس کا موقوف ہونا درست قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث فقہی اعتبار سے اہم سوال اٹھاتی ہے کہ آیا 'بسم اللہ الرحمن الرحیم' سورۃ فاتحہ کی ایک آیت ہے یا نہیں۔ اس روایت میں 'بسم اللہ' کو فاتحہ کی آیت قرار دینے اور اسے پڑھنے کا حکم دیا گیا ہے، جو شافعی مکتب فکر کی دلیل ہے۔ اگرچہ دارقطنی نے اسے موقوف قرار دیا، لیکن یہ مسئلہ نماز میں 'بسم اللہ' کی اہمیت اور قراءت کے آداب کو واضح کرتا ہے۔",
    "english": "This Hadith raises an important juristic question: Is 'Bismi Allāhi Ar-Raḥmāni Ar-Raḥīm' a verse of Surah Al-Fātiḥah? The narration commands its recitation and states that it is a verse of Al-Fātiḥah, which is the evidence for the Shāfi'ī school. Although Ad-Dāraquṭnī considered it Maukūf (Companion's saying), it highlights the importance of 'Bismillah' and the etiquette of recitation in prayer."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني، كتاب الصلاة، باب الجهر ببسم الله الرحمن الرحيم (2/312)",
      "english": "Sunan Ad-Dāraquṭnī, Book of Prayer, Chapter: Reciting 'Bismi Allāhi Ar-Raḥmāni Ar-Raḥīm' audibly (2/312)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurayrah"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "موقوف صحيح (رأي الدارقطني)",
    "english": "Maukūf Sahih (The view of Ad-Dāraquṭnī)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بسم اللہ کا فقہی مسئلہ",
        "english": "The Juristic Issue of Bismillah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فاتحہ کا جزو یا آغاز",
              "english": "Part of Al-Fātiḥah or its Beginning"
            },
            "content": {
              "urdu": [
                "اس روایت میں 'بسم اللہ' کو سورۃ فاتحہ کی ایک آیت قرار دیا گیا ہے، جو امام شافعیؒ کا مسلک ہے۔",
                "اس دلیل کی بنیاد پر وہ جہری نمازوں میں بھی اسے بلند آواز سے پڑھنا فرض یا سنت قرار دیتے ہیں۔",
                "دوسری طرف، حنفی اور مالکی مکاتب فکر اسے فاتحہ کا جزو نہیں مانتے اور آہستہ یا بالکل نہیں پڑھتے۔"
              ],
              "english": [
                "This narration claims 'Bismillah' is a verse of Al-Fātiḥah, which is the position of Imam Ash-Shāfi'ī (RA).",
                "Based on this evidence, they consider reciting it audibly in loud prayers obligatory or Sunnah.",
                "Conversely, the Ḥanafī and Mālikī schools do not consider it a part of Al-Fātiḥah and recite it silently or omit it."
              ]
            }
          },
          {
            "title": {
              "urdu": "سند کا فیصلہ",
              "english": "Decision on the Chain of Narration"
            },
            "content": {
              "urdu": [
                "امام دارقطنی اور دیگر محققین نے اس روایت کو مرفوع (نبی صلی اللہ علیہ وسلم کا قول) کے بجائے موقوف (ابوہریرہ کا قول) قرار دیا۔",
                "اگرچہ یہ صحابی کا قول ہے، لیکن صحابہ کے قول کا دینی امور میں بہت وزن ہوتا ہے۔",
                "اس کے باوجود، یہ حدیث مطلقاً 'بسم اللہ' کو جہراً پڑھنے کے لیے ایک دلیل بنی، حالانکہ نبی صلی اللہ علیہ وسلم کا غالب عمل سِراً پڑھنا تھا۔"
              ],
              "english": [
                "Imam Ad-Dāraquṭnī and other researchers deemed this narration Maukūf (saying of Abu Hurayrah) rather than Marfū' (saying of the Prophet PBUH).",
                "Even as a saying of a Companion, it carries significant weight in religious matters.",
                "Despite this, the Hadith became evidence for reciting 'Bismillah' audibly, although the Prophet's predominant practice was silent recitation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور عملی اہمیت",
        "english": "Spiritual and Practical Importance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہر حال میں قراءت",
              "english": "Recitation in All Circumstances"
            },
            "content": {
              "urdu": [
                "خواہ آیت مانا جائے یا نہ، نماز میں 'بسم اللہ' پڑھنا سنت سے ثابت ہے اور قراءت کا ایک لازمی ادب ہے۔",
                "اس کی قراءت اللہ کے بابرکت نام سے ہر کام کو شروع کرنے کی تعلیم کو مضبوط کرتی ہے۔",
                "قراءت سے پہلے بسم اللہ پڑھنا شیطانی وسوسوں سے محفوظ رہنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Whether considered a verse or not, reciting 'Bismillah' in prayer is proven by the Sunnah and is a necessary etiquette of recitation.",
                "Its recitation strengthens the teaching of beginning every action with Allah's blessed Name.",
                "Reciting 'Bismillah' before the main recitation is a means of protection from Satanic whispers."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابوہریرہ کا علم",
              "english": "The Knowledge of Abu Hurayrah (RA)"
            },
            "content": {
              "urdu": [
                "حضرت ابوہریرہ کا یہ موقف کہ 'بسم اللہ' آیت ہے، ان کے گہرے علم اور سورۃ فاتحہ کے فضائل پر یقین کو ظاہر کرتا ہے۔",
                "وہ بلند آواز سے بسم اللہ پڑھ کر لوگوں کو اس کے پڑھنے کی ترغیب دینا چاہتے تھے، جیسا کہ سابقہ حدیث میں گزرا۔",
                "اس صحابی کا عمل نبی صلی اللہ علیہ وسلم کی نماز کی ہر تفصیل کو محفوظ رکھنے کا ذریعہ بنا۔"
              ],
              "english": [
                "Abu Hurayrah's stance that 'Bismillah' is a verse demonstrates his deep knowledge and conviction about the virtues of Al-Fātiḥah.",
                "He wanted to encourage people to recite it by reciting it audibly, as mentioned in the previous Hadith.",
                "The practice of this Companion became a means of preserving every detail of the Prophet's prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتماعی اور تربیتی پیغام",
        "english": "Communal and Educational Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اختلاف میں وسعت",
              "english": "Scope within Differences"
            },
            "content": {
              "urdu": [
                "چونکہ 'بسم اللہ' کو جہراً اور سِراً دونوں طرح پڑھنا ثابت ہے، اس لیے مسلمانوں کو اس میں وسعت رکھنی چاہیے۔",
                "کسی کو بھی ایک طریقے پر سختی سے جم کر دوسرے مسنون طریقے پر عمل کرنے والے کو غلط نہیں ٹھہرانا چاہیے۔",
                "اختلافات میں بھی سنت پر عمل کرنا ہی اصل کامیابی کی دلیل ہے۔"
              ],
              "english": [
                "Since reciting 'Bismillah' both audibly and silently is established, Muslims should allow for scope in this matter.",
                "No one should rigidly stick to one method and condemn those who follow another proven Sunnah practice.",
                "Adhering to the Sunnah, even amid differences, is the true mark of success."
              ]
            }
          },
          {
            "title": {
              "urdu": "قراءت کے آداب",
              "english": "Etiquettes of Recitation"
            },
            "content": {
              "urdu": [
                "امام کو چاہیے کہ وہ اپنی قراءت میں ایسی سنتوں کو اپنائے جو مقتدیوں کے لیے آسانی اور خشوع کا باعث بنیں۔",
                "یہ مسئلہ نماز میں امام اور مقتدی کے درمیان تعلق اور مقتدی پر خاموشی کے حکم کی تفصیل میں مدد دیتا ہے۔",
                "جو شخص اس اختلاف کی حکمت کو سمجھتا ہے، وہ نماز کے آداب کو بہتر طریقے سے ادا کرتا ہے۔"
              ],
              "english": [
                "The Imām should adopt Sunnah practices in recitation that bring ease and Khushu' to the followers.",
                "This issue helps elaborate on the relationship between the Imām and the follower and the detailed ruling on the follower's silence.",
                "The one who understands the wisdom behind this difference adheres to the etiquettes of prayer better."
              ]
            }
          }
        ]
      }
    }
  ]
}
