{
  "hadithId": 1141,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1141"],
    "kitabId": 12,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام - كتاب الأطعمة",
    "babId": 92
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه أحمد (2/381)، وأبو داود (3799)، من طريق عيسى بن نميلة، عن أبيه، قال: كنت عند ابن عمر، به. وهذا سند فيه ثلاثة مجاهيل: عيسى، وأبوه، والشيخ الذي سمعه من أبي هريرة.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے امام احمد (381/2) اور ابو داؤد (3799) نے عیسیٰ بن نمیلہ کے واسطے سے روایت کیا ہے۔ اس کی سند میں تین راوی مجہول (نامعلوم) ہیں: عیسیٰ، ان کے والد، اور وہ بزرگ جنہوں نے اسے ابوہریرہ سے سنا۔",
    "english": "Weak. Recorded by Ahmad (2/381) and Abu Dawud (3799), via 'Isa bin Numailah, from his father. This chain contains three unknown (Majhul) narrators: 'Isa, his father, and the old man who narrated from Abu Hurairah."
  },
  "importantWords": [
    {
      "arabic": "القُنْفُذِ",
      "english": "Hedgehog",
      "urdu": "خار پشت / سیہ"
    },
    {
      "arabic": "مُحَرَّماً",
      "english": "Forbidden",
      "urdu": "حرام"
    },
    {
      "arabic": "طَاعِمٍ",
      "english": "Eater",
      "urdu": "کھانے والا"
    },
    {
      "arabic": "خِبْثَةٌ",
      "english": "Loathsome / Evil",
      "urdu": "خبیث / گندہ"
    },
    {
      "arabic": "الخَبَائِثِ",
      "english": "Impure things",
      "urdu": "ناپاک چیزیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں خار پشت (سیہ) کے حلال یا حرام ہونے کا ذکر ہے، جس کے متعلق ابن عمر رضی اللہ عنہ اسے حلال سمجھتے تھے جبکہ ایک ضعیف روایت کی بنا پر اسے خبیث قرار دیا گیا۔",
    "english": "The Hadith discusses the permissibility of eating hedgehog; Ibn 'Umar viewed it as permissible based on the Quran, while a weak narration labels it as loathsome."
  },
  "references": [
    {
      "arabic": "رواه أحمد (2/381)",
      "english": "Reported by Ahmad (2/381)"
    },
    {
      "arabic": "رواه أبو داود (3799)",
      "english": "Reported by Abu Dawud (3799)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S080S080S08",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خار پشت کا شرعی حکم",
        "english": "Ruling on the Hedgehog"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابن عمر رضی اللہ عنہ کا موقف",
              "english": "Position of Ibn 'Umar"
            },
            "content": {
              "urdu": [
                "سیدنا ابن عمر رضی اللہ عنہ نے قرآن کی عمومی آیت سے اس کے حلال ہونے کا استدلال کیا۔",
                "ان کے نزدیک جب تک کسی چیز کی واضح حرمت ثابت نہ ہو وہ حلال رہتی ہے۔",
                "یہ موقف اشیاء میں اصل اباحت (اجازت) کے قاعدے پر مبنی ہے۔"
              ],
              "english": [
                "Ibn 'Umar (RA) used a general Quranic verse to argue for its permissibility.",
                "In his view, things remain permissible unless a clear prohibition is established.",
                "This position is based on the principle of original permissibility in things."
              ]
            }
          },
          {
            "title": {
              "urdu": "خبیث اشیاء کی ممانعت",
              "english": "Prohibition of Loathsome Things"
            },
            "content": {
              "urdu": [
                "دوسری جانب اسے 'خبیث' قرار دے کر حرام کرنے کی کوشش کی گئی ہے۔",
                "اسلام میں طیبات (پاکیزہ چیزیں) حلال اور خبائث (گندی چیزیں) حرام ہیں۔",
                "تاہم اس حدیث کی سند ضعیف ہونے کی وجہ سے یہ حکم قطعی نہیں ہے۔"
              ],
              "english": [
                "On the other hand, it was labeled 'loathsome' to justify its prohibition.",
                "In Islam, pure things are halal while impure/loathsome things are haram.",
                "However, due to the weakness of this chain, the ruling is not definitive."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت کی علمی حیثیت",
        "english": "Status of the Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی کمزوری",
              "english": "Weakness of the Chain"
            },
            "content": {
              "urdu": [
                "اس روایت کی سند میں کئی راوی مجہول ہیں جس سے یہ ضعیف ہو گئی۔",
                "مجہول راوی کی خبر شرعی احکام میں حجت کے طور پر قبول نہیں کی جاتی۔",
                "اسی لیے علماء نے خار پشت کے گوشت کے بارے میں مختلف آراء دی ہیں۔"
              ],
              "english": [
                "The chain of this narration contains unknown narrators, making it weak.",
                "Reports from unknown narrators are not accepted as evidence in Shariah.",
                "Therefore, scholars have differing opinions regarding the meat of a hedgehog."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہاء کا اختلاف",
              "english": "Disagreement among Jurists"
            },
            "content": {
              "urdu": [
                "امام مالک اور شافعی کے نزدیک خار پشت کا کھانا جائز اور حلال ہے۔",
                "امام ابو حنیفہ اور امام احمد کے نزدیک اسے کھانا مکروہ یا حرام ہے۔",
                "اختلاف کی بنیاد اسے 'خبائث' میں شمار کرنے یا نہ کرنے پر ہے۔"
              ],
              "english": [
                "According to Imam Malik and Shafi'i, eating hedgehog is permissible.",
                "Imam Abu Hanifa and Imam Ahmad view it as disliked or prohibited.",
                "The disagreement stems from whether it is classified as 'impure' or not."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرآنی استدلال",
        "english": "Quranic Reasoning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آیت کا مفہوم",
              "english": "Meaning of the Verse"
            },
            "content": {
              "urdu": [
                "ابن عمر نے سورہ الانعام کی آیت 145 سے دلیل پیش کی جو مکہ میں اتری۔",
                "اس وقت صرف چار چیزیں (مردار، خون، سور، غیر اللہ کا نام) حرام تھیں۔",
                "یہ آیت صحابہ کے نزدیک عمومی حلال ہونے کی بڑی دلیل سمجھی جاتی تھی۔"
              ],
              "english": [
                "Ibn 'Umar cited Surah Al-An'am verse 145, revealed in Makkah.",
                "At that time, only four things were strictly forbidden for consumption.",
                "This verse was a major evidence for general permissibility among Companions."
              ]
            }
          },
          {
            "title": {
              "urdu": "بعد کے احکامات",
              "english": "Subsequent Rulings"
            },
            "content": {
              "urdu": [
                "قرآن کے بعد سنت نے درندوں اور شکاری پرندوں کو بھی حرام قرار دیا۔",
                "اگر سنت سے کوئی صریح ممانعت آجائے تو اسے قرآن پر اضافہ مانا جاتا ہے۔",
                "لیکن خار پشت کے معاملے میں حدیث ضعیف ہونے سے ممانعت ثابت نہیں ہوئی۔"
              ],
              "english": [
                "After the Quran, the Sunnah also forbade beasts of prey and birds of prey.",
                "If a clear prohibition comes from Sunnah, it adds to Quranic laws.",
                "Regarding the hedgehog, the prohibition is not proven due to the weak Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی اہمیت",
              "english": "Importance of Verification"
            },
            "content": {
              "urdu": [
                "کسی بھی چیز کو حرام کہنے سے پہلے مستند دلیل کا ہونا ضروری ہے۔",
                "بغیر علم کے اللہ کی حلال کردہ چیزوں کو حرام کرنا سخت گناہ ہے۔",
                "احادیث کی صحت کی جانچ کرنا دین کو سمجھنے کے لیے لازمی ہے۔"
              ],
              "english": [
                "It is essential to have authentic evidence before declaring something haram.",
                "Prohibiting what Allah has made lawful without knowledge is a grave sin.",
                "Verifying the authenticity of Hadiths is mandatory for understanding religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور احتیاط",
              "english": "Piety and Caution"
            },
            "content": {
              "urdu": [
                "مشتبہ چیزوں سے بچنا تقویٰ کا تقاضا ہے اگرچہ وہ حلال کیوں نہ ہوں۔",
                "جہاں علماء کا اختلاف ہو وہاں احتیاط برتنا زیادہ بہتر عمل ہے۔",
                "انسانی طبیعت جس چیز کو ناپسند کرے اسے نہ کھانا گناہ نہیں ہے۔"
              ],
              "english": [
                "Avoiding doubtful matters is a requirement of piety, even if they are legal.",
                "Where scholars disagree, exercising caution is a superior practice.",
                "Refusing to eat something naturally disliked by humans is not a sin."
              ]
            }
          }
        ]
      }
    }
  ]
}