{
  "hadithId": 449,
  "hadithNo": 25,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1245",
      "https://sunnah.com/muslim:951"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1245)، ومسلم (951). والحديث دليل على مشروعية صلاة الجنازة على الغائب إذا كان له فضل أو لم يصل عليه في مكانه.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (1245) و مسلم (951) میں موجود ہے۔ یہ حدیث نمازِ جنازہ غائبانہ کے مشروع ہونے پر دلیل ہے، خاص طور پر اس صورت میں جب میت صاحبِ فضل ہو یا اس کے مقام پر جنازہ نہ ہوا ہو۔",
    "english": "Authentic. Reported by Al-Bukhari (1245) and Muslim (951). The Hadith is a primary evidence for the permissibility of Ghaibana (absentee) funeral prayers for virtuous individuals or those whose funeral was not offered."
  },
  "importantWords": [
    {
      "arabic": "نَعَى",
      "english": "Announced the death",
      "urdu": "خبرِ وفات دی"
    },
    {
      "arabic": "النَّجَاشِيَّ",
      "english": "An-Najashi (Negus)",
      "urdu": "نجاشی (شاہِ حبشہ)"
    },
    {
      "arabic": "الْمُصَلَّى",
      "english": "Prayer ground",
      "urdu": "عید گاہ / جنازہ گاہ"
    },
    {
      "arabic": "صَفَّ",
      "english": "Arranged in rows",
      "urdu": "صفیں بنائیں"
    },
    {
      "arabic": "كَبَّرَ",
      "english": "Said Takbir",
      "urdu": "تکبیر کہی"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے شاہِ حبشہ نجاشی کی وفات پر مدینہ میں غائبانہ نمازِ جنازہ پڑھائی، جس میں چار تکبیرات کہی گئیں اور صحابہ کی صف بندی کروائی گئی۔",
    "english": "The Prophet (ﷺ) offered the absentee funeral prayer for the King of Ethiopia, An-Najashi, in Madinah, performing it with four Takbirs and arranging the companions in rows."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1245)",
      "english": "Sahih al-Bukhari (1245)"
    },
    {
      "arabic": "صحيح مسلم (951)",
      "english": "Sahih Muslim (951)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازِ جنازہ غائبانہ",
        "english": "Absentee Funeral Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی حیثیت",
              "english": "Legal Status"
            },
            "content": {
              "urdu": [
                "نجاشی کی نمازِ جنازہ غائبانہ طور پر ادا کی گئی کیونکہ وہ حبشہ میں تھے۔",
                "امام شافعی اور امام احمد کے نزدیک یہ ہر غائب میت کے لیے جائز ہے۔",
                "دیگر فقہاء کے نزدیک یہ نجاشی کی خاص فضیلت یا غیبی مشاہدے پر مبنی تھا۔"
              ],
              "english": [
                "The funeral prayer for An-Najashi was performed in absentia as he was in Abyssinia.",
                "Imams Shafi'i and Ahmad consider this permissible for any deceased person abroad.",
                "Other jurists view it as a specific honor for Najashi or based on a divine vision."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبیرات کی تعداد",
              "english": "Number of Takbirs"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے نجاشی کے جنازے میں چار تکبیرات کہیں۔",
                "چار تکبیرات کہنا ہی نمازِ جنازہ کا مسنون اور مستند طریقہ ہے۔",
                "یہ عمل نمازِ جنازہ کی مکمل ادائیگی اور ترتیب کو واضح کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) recited four Takbirs during the funeral prayer for An-Najashi.",
                "Performing four Takbirs is the established and sunnah method of funeral prayer.",
                "This act clarifies the complete procedure and sequence of the Janazah prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نجاشی کا مقام اور اسلام",
        "english": "Status of Najashi and his Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معجزانہ اطلاع",
              "english": "Miraculous Announcement"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اسی دن وفات کی اطلاع دی جس دن وہ فوت ہوئے تھے۔",
                "یہ آپ ﷺ کا ایک بہت بڑا معجزہ تھا جو وحی کے ذریعے ممکن ہوا۔",
                "نجاشی وہ بادشاہ تھے جنہوں نے مسلمانوں کو حبشہ میں پناہ دی تھی۔"
              ],
              "english": [
                "The Prophet (ﷺ) announced the death on the very day it occurred in Ethiopia.",
                "This was a significant miracle performed through divine revelation (Wahi).",
                "An-Najashi was the righteous king who provided refuge to Muslims in Abyssinia."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کی گواہی",
              "english": "Testimony of Faith"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے نجاشی کو 'بھائی' اور 'نیک بندہ' کہہ کر مخاطب فرمایا۔",
                "آپ ﷺ کا جنازہ پڑھانا ان کے سچے مسلمان ہونے کی قطعی دلیل ہے۔",
                "ان کے علاقے میں کوئی نمازِ جنازہ پڑھنے والا نہیں تھا اس لیے آپ ﷺ نے پڑھائی۔"
              ],
              "english": [
                "The Prophet (ﷺ) referred to An-Najashi as a 'brother' and a 'righteous servant'.",
                "Leading his funeral prayer is a decisive proof of his true conversion to Islam.",
                "Since there was no one to pray Janazah there, the Prophet (ﷺ) offered it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جنازہ کے آداب",
        "english": "Etiquettes of the Funeral"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صف بندی کی اہمیت",
              "english": "Importance of Rows"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے صحابہ کو باہر لے جا کر باقاعدہ صفوں میں کھڑا کیا۔",
                "نمازِ جنازہ میں صفوں کی درستگی اور تعداد کی اہمیت واضح ہوتی ہے۔",
                "جتنی زیادہ صفیں اور لوگ ہوں گے، میت کے لیے شفاعت اتنی ہی زیادہ ہوگی۔"
              ],
              "english": [
                "The Prophet (ﷺ) took the companions to a prayer ground and arranged rows.",
                "This highlights the importance of alignment and the number of rows in Janazah.",
                "The more people and rows present, the greater the intercession for the deceased."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنازہ گاہ کا استعمال",
              "english": "Use of the Prayer Ground"
            },
            "content": {
              "urdu": [
                "نبی ﷺ جنازے کے لیے عموماً مسجد سے باہر کسی کھلی جگہ تشریف لے جاتے۔",
                "باہر جنازہ پڑھنا کثرتِ ازدحام اور صفائی کے لحاظ سے بہتر ہے۔",
                "تاہم، ضرورت کے تحت مسجد کے اندر جنازہ پڑھنا بھی جائز ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) usually went to an open area outside the mosque for Janazah.",
                "Praying outside is better for accommodating large crowds and maintaining purity.",
                "However, it is also permissible to pray inside the mosque if necessary."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محسنین کی قدر",
              "english": "Appreciating Benefactors"
            },
            "content": {
              "urdu": [
                "اسلام محسنین کی قدردانی سکھاتا ہے چاہے وہ دور دراز کیوں نہ ہوں۔",
                "نجاشی نے مشکل وقت میں مسلمانوں کا ساتھ دیا، نبی ﷺ نے ان کا حق ادا کیا۔",
                "نیک لوگوں کی وفات پر دعا اور جنازہ کرنا وفاداری کی علامت ہے۔"
              ],
              "english": [
                "Islam teaches appreciation for benefactors, regardless of their distance.",
                "Najashi supported Muslims during trials; the Prophet (ﷺ) honored that favor.",
                "Praying for and offering Janazah for the righteous is a mark of loyalty."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحادِ امت",
              "english": "Unity of the Ummah"
            },
            "content": {
              "urdu": [
                "مدینہ میں حبشہ کے بادشاہ کا جنازہ پڑھنا اسلامی عالمگیریت کی مثال ہے۔",
                "مسلمان جغرافیائی حدود سے بالاتر ایک دوسرے کے بھائی ہیں۔",
                "ایمان کا رشتہ تمام دنیاوی رشتوں اور سرحدوں سے زیادہ مضبوط ہے۔"
              ],
              "english": [
                "Praying for an Ethiopian King in Madinah exemplifies Islamic universality.",
                "Muslims are brothers to one another, transcending all geographical borders.",
                "The bond of faith is stronger than all worldly ties and boundaries."
              ]
            }
          }
        ]
      }
    }
  ]
}