{
  "hadithId": 1079,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/10/108"],
    "kitabId": 10,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحدود",
    "babId": 88
  },

  "takhreej": {
    "arabic": "حسن بشواهده. أخرجه ابن أبي خيثمة في تاريخه، والدارقطني في الأفراد، وأحمد في المسند (20412) من حديث خالد بن عرفطة، وله شواهد من حديث أبي ذر وأبي بكرة رضي الله عنهم.",
    "urdu": "حسن (شواہد کے ساتھ)۔ اسے ابن ابی خیثمہ اور دارقطنی نے روایت کیا ہے۔ امام احمد نے اسے خالد بن عرفطہ رضی اللہ عنہ سے (20412) روایت کیا ہے۔ ابو ذر اور ابو بكرة کی احادیث سے اسے تقویت حاصل ہے۔",
    "english": "Hasan due to corroborating evidences. Reported by Ibn Abi Khaythama, Ad-Daraqutni, and Ahmad in his Musnad (20412) via Khalid bin 'Urfutah. It has supporting narrations from Abu Dharr and Abu Bakrah (RA)."
  },
  "importantWords": [
    {
      "arabic": "فِتَنٌ",
      "english": "Tribulations",
      "urdu": "فتنے / آزمائشیں"
    },
    {
      "arabic": "عَبْدَ اَللَّهِ",
      "english": "Slave of Allah",
      "urdu": "اللہ کا بندہ"
    },
    {
      "arabic": "اَلْمَقْتُولَ",
      "english": "The Slain",
      "urdu": "قتل ہونے والا"
    },
    {
      "arabic": "اَلْقَاتِلَ",
      "english": "The Killer",
      "urdu": "قتل کرنے والا"
    },
    {
      "arabic": "تَكُونُ",
      "english": "Will be / Will occur",
      "urdu": "ہوں گے / واقع ہوں گے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں فتنوں کے دور میں مسلمانوں کو آپسی خانہ جنگی اور خون خرابے سے بچنے کی تاکید کی گئی ہے کہ ظالم بننے سے بہتر ہے کہ انسان مظلوم بن کر جان دے دے۔",
    "english": "This Hadith emphasizes avoiding civil strife and bloodshed during times of Fitna, teaching that it is better to be the victim of oppression than to be an oppressor."
  },
  "references": [
    {
      "arabic": "أخرجه أحمد (20412)",
      "english": "Reported by Ahmad (20412)"
    },
    {
      "arabic": "أخرجه الدارقطني",
      "english": "Reported by Ad-Daraqutni"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "خباب بن الأرت",
        "english": "Khabbab bin al-Aratt"
      },
      "slug": "khabbab-bin-al-aratt"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYmX7G6f48A",
  "grade": {
    "arabic": "حسن بشواهده",
    "english": "Hasan due to corroborating narrations"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فتنوں میں مسلمان کا رویہ",
        "english": "Muslim Behavior in Times of Strife"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون خرابے سے اجتناب",
              "english": "Avoiding Bloodshed"
            },
            "content": {
              "urdu": [
                "جب مسلمانوں کے درمیان سیاسی یا گروہی فتنہ کھڑا ہو، تو اس سے الگ تھلگ رہنا واجب ہے۔",
                "نبی کریم ﷺ نے اپنے ہاتھ گندے کرنے اور ناحق قتل سے سختی سے منع فرمایا ہے۔",
                "کسی مسلمان کا خون بہانا اللہ کے نزدیک کعبہ کی حرمت سے بھی زیادہ سنگین معاملہ ہے۔"
              ],
              "english": [
                "When political or sectarian strife arises among Muslims, staying isolated from it is mandatory.",
                "The Prophet (ﷺ) strictly forbade staining one's hands with the blood of unjust killing.",
                "Shedding a Muslim's blood is more grave to Allah than the sanctity of the Kaaba."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقتول بننے کی حکمت",
              "english": "Wisdom in Being the Slain"
            },
            "content": {
              "urdu": [
                "مقتول بننے کا مطلب یہ ہے کہ انسان ظالم بننے کے بجائے اپنی جان کی قربانی دے دے۔",
                "قیامت کے دن مظلوم ہونا اللہ کے ہاں سرخروئی کا باعث ہوگا جبکہ قاتل سخت عذاب میں ہوگا۔",
                "یہ حکم اس وقت ہے جب حق و باطل کا فرق واضح نہ ہو اور فتنہ عام ہو چکا ہو۔"
              ],
              "english": [
                "Being the 'slain' means sacrificing one's life rather than becoming an oppressor.",
                "On Judgment Day, being the victim leads to salvation while the killer faces severe punishment.",
                "This command applies when the line between truth and falsehood is blurred and strife is widespread."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انسانی جان کی حرمت",
        "english": "Sanctity of Human Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاتل کا انجام",
              "english": "The Fate of the Killer"
            },
            "content": {
              "urdu": [
                "قرآن و سنت میں ناحق قتل کرنے والے کے لیے دائمی جہنم کی وعید آئی ہے۔",
                "فتنوں کے دور میں جذبات میں آکر کسی کو قتل کرنا دنیا و آخرت کی بربادی ہے۔",
                "ایک قاتل اللہ کی رحمت سے دور کر دیا جاتا ہے اور اس کا توبہ کا راستہ کٹھن ہوتا ہے۔"
              ],
              "english": [
                "The Quran and Sunnah warn of eternal Hellfire for those who kill unjustly.",
                "Killing someone out of emotional impulse during times of Fitna ruins this life and the next.",
                "A killer is distanced from Allah's mercy and their path to repentance becomes difficult."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبر اور تقویٰ",
              "english": "Patience and Piety"
            },
            "content": {
              "urdu": [
                "فتنے کے وقت زبان اور ہاتھ پر قابو رکھنا ایمان کی پختگی کی علامت ہے۔",
                "صبر کا دامن تھامے رکھنا انسان کو بہت سے گناہوں اور پچھتاووں سے بچاتا ہے۔",
                "اللہ تعالیٰ مظلوموں کا ولی ہے اور ان کی قربانی کو ضائع نہیں فرماتا۔"
              ],
              "english": [
                "Controlling one's tongue and hands during Fitna is a sign of firm faith.",
                "Holding onto patience protects a person from many sins and regrets.",
                "Allah is the Protector of the oppressed and does not let their sacrifice go in vain."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی امن کا تحفظ",
        "english": "Preserving Social Peace"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فساد سے دوری",
              "english": "Distance from Corruption"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو آپس میں لڑنے کے بجائے امن کے قیام کے لیے کوشش کرنی چاہیے۔",
                "اگر فتنہ اس قدر بڑھ جائے کہ روکنا ممکن نہ ہو تو گوشہ نشینی اختیار کرنا بہتر ہے۔",
                "معاشرے میں آگ لگانے والے شرپسندوں کا آلہ کار بننے سے بچنا ضروری ہے۔"
              ],
              "english": [
                "Muslims should strive to establish peace instead of fighting among themselves.",
                "If strife escalates beyond control, adopting seclusion is the better option.",
                "It is essential to avoid becoming a tool for mischief-makers who ignite social fires."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلاحِ نفس کی اہمیت",
              "english": "Importance of Self-Reform"
            },
            "content": {
              "urdu": [
                "فتنوں کے وقت دوسروں پر تنقید کے بجائے اپنی اصلاح پر توجہ دینی چاہیے۔",
                "ذکر اللہ اور عبادات میں مشغول رہنا فتنوں کے زہریلے اثرات سے بچاتا ہے۔",
                "نیک اعمال کی کثرت انسان کے دل کو فتنوں کے اندھیروں میں روشنی فراہم کرتی ہے۔"
              ],
              "english": [
                "During Fitna, focus on self-reform instead of criticizing others.",
                "Engaging in Dhikr and worship protects one from the poisonous effects of strife.",
                "Abundance of righteous deeds provides light to the heart in the darkness of Fitna."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور عملی سبق",
        "english": "Educational and Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہابیل کی مثال",
              "english": "The Example of Abel"
            },
            "content": {
              "urdu": [
                "آدم علیہ السلام کے بیٹے ہابیل نے اپنے بھائی کے سامنے ہاتھ نہیں اٹھایا تھا۔",
                "ہابیل کا رویہ قیامت تک کے لیے مسلمانوں کے لیے ایک بہترین نمونہ ہے۔",
                "اللہ نے ہابیل کے اس تقویٰ اور صبر کی تعریف فرمائی ہے۔"
              ],
              "english": [
                "Abel, the son of Adam (AS), did not raise his hand against his brother.",
                "Abel's conduct serves as an excellent model for Muslims until the Day of Judgment.",
                "Allah praised Abel's piety and patience in the Holy Quran."
              ]
            }
          },
          {
            "title": {
              "urdu": "دورِ حاضر میں اطلاق",
              "english": "Application in the Present Age"
            },
            "content": {
              "urdu": [
                "آج کے دور میں سوشل میڈیا اور فرقہ واریت کے فتنوں سے بچنا لازم ہے۔",
                "کسی کے خلاف نفرت پھیلانا یا قتل پر اکسانا بھی قاتل بننے کے مترادف ہے۔",
                "ہمیں ہر حال میں امن پسند 'عبداللہ' (اللہ کا بندہ) بن کر رہنا چاہیے۔"
              ],
              "english": [
                "In this age, avoiding the Fitna of social media and sectarianism is mandatory.",
                "Spreading hatred or inciting murder is equivalent to being a killer.",
                "We must remain peace-loving 'Abdullah' (slaves of Allah) at all costs."
              ]
            }
          }
        ]
      }
    }
  ]
}