{
  "hadithId": 857,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/43"],
    "kitabId": 8,
    "inKitabBab": 2,
    "arabicBook": "كتاب النكاح",
    "babId": 65
  },
  
  "takhreej": {
    "arabic": "حسن . رواه أبو داود (2102) ، والحاكم ( 2 / 164) من طريق محمد بن عمرو ، عن أبي سلمة ، عن أبي هريرة ، به . وقال الحافظ في التلخيص (364) : إسناده حسن .",
    "urdu": "حسن۔ اسے ابوداؤد (2102) اور حاکم (164/2) نے محمد بن عمرو کے واسطے سے روایت کیا ہے۔ حافظ ابن حجر نے تلخیص الحبیر میں اس کی سند کو حسن قرار دیا ہے۔",
    "english": "Hasan. Reported by Abu Dawud (2102) and Al-Hakim (2/164) through Muhammad bin 'Amr from Abu Salamah from Abu Hurairah. Al-Hafiz Ibn Hajar graded its chain as Hasan in Al-Talkhis."
  },
  "importantWords": [
    {
      "arabic": "أَنْكِحُوا",
      "english": "Give in marriage",
      "urdu": "نکاح کر دو"
    },
    {
      "arabic": "انْكِحُوا إِلَيْهِ",
      "english": "Marry from them",
      "urdu": "ان کے ہاں نکاح کرو"
    },
    {
      "arabic": "حَجَّامًا",
      "english": "A cupper / Barber",
      "urdu": "حجام / پچھنے لگانے والا"
    },
    {
      "arabic": "بَنِي بَيَاضَةَ",
      "english": "Tribe of Banu Bayadah",
      "urdu": "بنی بیاضہ (قبیلہ)"
    },
    {
      "arabic": "جَيِّدٍ",
      "english": "Good / Reliable",
      "urdu": "عمدہ / اچھی"
    }
  ],
  "summary": {
    "urdu": "اسلام میں نکاح کے لیے اصل معیار تقویٰ اور ایمان ہے، پیشہ ورانہ حیثیت یا سماجی طبقہ رشتے کی راہ میں رکاوٹ نہیں ہونا چاہیے۔",
    "english": "In Islam, the primary criteria for marriage compatibility are piety and faith; professional status or social class should not be barriers to marriage."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2102)",
      "english": "Sunan Abi Dawud (2102)"
    },
    {
      "arabic": "المستدرك للحاكم (2/164)",
      "english": "Al-Mustadrak al-Hakim (2/164)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کفو اور پیشہ ورانہ حیثیت",
        "english": "Compatibility and Professional Status"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیشوں کی برابری",
              "english": "Equality of Professions"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے ابوہند کے پیشے (حجام) کے باوجود ان کے ساتھ رشتہ داری کی ترغیب دی۔",
                "یہ اس بات کی دلیل ہے کہ پیشہ ورانہ کام نکاح میں رکاوٹ نہیں بننا چاہیے۔",
                "اسلام نے جاہلیت کے ان تصورات کو ختم کیا جو مخصوص پیشوں کو حقیر سمجھتے تھے۔"
              ],
              "english": [
                "The Prophet (ﷺ) encouraged marriage ties with Abu Hind despite his profession as a cupper.",
                "This serves as evidence that a person's profession should not hinder marriage compatibility.",
                "Islam abolished pre-Islamic notions that looked down upon specific manual occupations."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین داری اصل بنیاد",
              "english": "Piety as the Foundation"
            },
            "content": {
              "urdu": [
                "نکاح کے معاملے میں سب سے اہم چیز لڑکے اور لڑکی کا دین اور اخلاق ہے۔",
                "آپ ﷺ کا یہ حکم معاشرتی مساوات اور اسلامی بھائی چارے کی بہترین مثال ہے۔",
                "اگر انسان نیک ہے تو اس کا کم تر سمجھا جانے والا پیشہ اسے عیب دار نہیں بناتا۔"
              ],
              "english": [
                "The most important factor in marriage is the religious commitment and character of the individuals.",
                "This command is a perfect example of social equality and Islamic brotherhood.",
                "If a person is righteous, an occupation considered lowly by society does not degrade them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reformation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نسلی تفاخر کا خاتمہ",
              "english": "End of Racial Pride"
            },
            "content": {
              "urdu": [
                "بنی بیاضہ ایک معزز قبیلہ تھا، انہیں ایک حجام سے رشتہ داری کا حکم دے کر مساوات سکھائی گئی۔",
                "اسلام نے خاندانی برتری کے بجائے ایمانی برتری کا تصور متعارف کرایا۔",
                "آپ ﷺ نے عملی طور پر طبقاتی فرق کو مٹا کر ایک پاکیزہ معاشرہ تشکیل دیا۔"
              ],
              "english": [
                "Banu Bayadah was a noble tribe, and they were taught equality by being ordered to marry with a cupper.",
                "Islam introduced the concept of superiority based on faith rather than lineage.",
                "The Prophet (ﷺ) practically erased class distinctions to form a pure, unified society."
              ]
            }
          },
          {
            "title": {
              "urdu": "محنت کشوں کی عزت",
              "english": "Dignity of Labor"
            },
            "content": {
              "urdu": [
                "حجام کا کام انسانی خدمت اور حلال روزی کمانے کا ایک ذریعہ ہے۔",
                "نبی کریم ﷺ نے محنت کشوں کو اللہ کا دوست قرار دیا اور انہیں معاشرے میں مقام دیا۔",
                "یہ حدیث محنت کی عظمت اور کارکنوں کے سماجی حقوق کے تحفظ کی ضامن ہے۔"
              ],
              "english": [
                "Cupping or barbering is a service to humanity and a means of earning a lawful living.",
                "The Prophet (ﷺ) called the hardworking person a friend of Allah and gave them status.",
                "This Hadith guarantees the dignity of labor and protects the social rights of workers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نکاح میں آسانی",
        "english": "Ease in Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر ضروری شرائط سے گریز",
              "english": "Avoiding Unnecessary Conditions"
            },
            "content": {
              "urdu": [
                "رشتہ طے کرتے وقت غیر ضروری سماجی رتبے اور مال و دولت کی شرط نہیں ہونی چاہیے۔",
                "حدیث سے ثابت ہے کہ نیک مرد اور نیک عورت کا جوڑ ہی اصل کامیابی ہے۔",
                "معاشرے میں رشتوں کی راہ میں حائل مصنوعی رکاوٹوں کو دور کرنا مسنون عمل ہے۔"
              ],
              "english": [
                "Unnecessary conditions of social rank and wealth should not be imposed when selecting a spouse.",
                "It is proven from the Hadith that the pairing of a righteous man and woman is true success.",
                "Removing artificial barriers that hinder marriage in society is a Sunnah act."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی خیر خواہی",
              "english": "Mutual Well-being"
            },
            "content": {
              "urdu": [
                "بنی بیاضہ کو ابوہند کے لیے نکاح کی فکر کرنے کا حکم دیا گیا، جو باہمی ہمدردی کا ثبوت ہے۔",
                "ایک دوسرے کی ازدواجی ضروریات کا خیال رکھنا اسلامی برادری کا خاصہ ہے۔",
                "یہ عمل معاشرے میں عفت اور پاکدامنی کو عام کرنے میں مددگار ثابت ہوتا ہے۔"
              ],
              "english": [
                "Banu Bayadah were ordered to care for Abu Hind's marriage, proving mutual sympathy.",
                "Caring for the marital needs of one another is a characteristic of the Islamic community.",
                "This practice helps in making chastity and moral purity widespread in the society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعصب کا خاتمہ",
              "english": "Eradication of Prejudice"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے دلوں سے پیشوں اور برادریوں کے حوالے سے پائے جانے والے تعصب کو نکالنا چاہیے۔",
                "سچی بندگی اور اطاعتِ رسول ﷺ کا تقاضا ہے کہ ہم انسانوں کو ان کے تقویٰ سے جانچیں۔",
                "سنتِ نبوی ﷺ پر عمل کرنا ہی معاشرتی امن اور سکون کا ضامن ہے۔"
              ],
              "english": [
                "We must remove prejudices from our hearts regarding certain professions and communities.",
                "True servitude and obedience to the Prophet (ﷺ) require us to judge people by their piety.",
                "Following the Sunnah of the Prophet (ﷺ) ensures social peace and tranquility."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی نمونہ",
              "english": "Practical Model"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا یہ فیصلہ رہتی دنیا تک کے لیے ایک بہترین سماجی ضابطہ ہے۔",
                "ہمیں اپنے نکاح کے معاملات میں ان ہی نبوی اصولوں کو اپنانا چاہیے۔",
                "دین کی تعلیمات پر عمل کرنے سے ہی معاشرے کی حقیقی فلاح ممکن ہے۔"
              ],
              "english": [
                "This decision of the Prophet (ﷺ) is a perfect social code for all of humanity.",
                "We should adopt these Prophetic principles in our own marriage-related affairs.",
                "Real welfare of society is only possible through practicing the teachings of the religion."
              ]
            }
          }
        ]
      }
    }
  ]
}