{
  "hadithId": 1342,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/112"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ حديث النعمان رواه أبو داود (1479)، والترمذي (2969)، والنسائي في الكبرى (11464)، وابن ماجه (3828). أما لفظ \"مخ العبادة\" فضعيف لوروده من طريق ابن لهيعة. أما حديث أبي هريرة فهو حسن رواه الترمذي (3370)، وابن حبان (870)، والحاكم (1/490).",
    "urdu": "صحیح۔ نعمان بن بشیر کی روایت ابوداؤد (1479)، ترمذی (2969)، نسائی (11464) اور ابن ماجہ (3828) میں ہے۔ 'مخ العبادہ' والے الفاظ سنداً ضعیف ہیں مگر معنی درست ہیں۔ ابوہریرہ رضی اللہ عنہ کی روایت حسن ہے جسے ابن حبان اور حاکم نے صحیح کہا ہے۔",
    "english": "Sahih. The narration of Nu'man is in Abu Dawud (1479), At-Tirmidhi (2969), An-Nasa'i (11464), and Ibn Majah (3828). The wording 'essence of worship' is weak in chain but sound in meaning. The narration of Abu Hurairah is Hasan, graded Sahih by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "اَلدُّعَاءَ",
      "english": "Supplication",
      "urdu": "پکارنا / دعا مانگنا"
    },
    {
      "arabic": "اَلْعِبَادَةُ",
      "english": "Worship",
      "urdu": "بندگی / پرستش"
    },
    {
      "arabic": "أَكْرَمَ",
      "english": "More Noble / Honorable",
      "urdu": "زیادہ معزز / زیادہ پسندیدہ"
    },
    {
      "arabic": "مُخُّ",
      "english": "Essence / Marrow",
      "urdu": "مغز / نچوڑ"
    }
  ],
  "summary": {
    "urdu": "ان احادیث کا مجموعی خلاصہ یہ ہے کہ دعا بندگی کی روح اور اللہ کے نزدیک سب سے معزز عمل ہے۔ یہ انسان کی عاجزی اور اللہ کی ربوبیت کا سب سے بڑا اقرار ہے۔",
    "english": "The overall summary of these narrations is that Dua is the soul of worship and the most honorable act before Allah. It is the greatest expression of human humility and Allah's Lordship."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب الدعوات، رقم 3372",
      "english": "Sunan at-Tirmidhi, Book of Supplications, No. 3372"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "النعمان بن بشير",
        "english": "An-Nu'man bin Bashir"
      },
      "slug": "an-numan-bin-bashir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا ہی عبادت ہے",
        "english": "Supplication is Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کا جوہر",
              "english": "The Essence of Devotion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے 'دعا ہی عبادت ہے' فرما کر یہ واضح کیا کہ بندگی کا اصل مقصد اللہ کے سامنے عاجزی اور اس کی محتاجی کا اظہار کرنا ہے۔",
                "دعا میں بندہ اپنی تمام مادی طاقتوں سے دستبردار ہو کر صرف اللہ کی طرف متوجہ ہوتا ہے، جو توحید کا اعلیٰ ترین درجہ ہے۔",
                "نماز، روزہ اور حج جیسی تمام عبادات کے اندر بھی دعا کا عنصر بنیادی طور پر موجود ہوتا ہے۔"
              ],
              "english": [
                "By stating 'Dua is worship,' the Prophet (ﷺ) clarified that the core of servitude is expressing humility and dependency on Allah.",
                "In Dua, a servant relinquishes all material power and turns solely to Allah, representing the highest level of Monotheism.",
                "The element of Dua is fundamentally present within all acts of worship, such as Prayer, Fasting, and Hajj."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کی عظمت اور مقام",
        "english": "The Magnitude and Status of Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کے ہاں معزز عمل",
              "english": "Honorable Deed Before Allah"
            },
            "content": {
              "urdu": [
                "اللہ کے نزدیک دعا سے زیادہ معزز کوئی چیز نہیں کیونکہ یہ اللہ کی قدرت اور سخاوت پر بندے کے کامل بھروسے کی علامت ہے۔",
                "جب بندہ دعا مانگتا ہے تو وہ درحقیقت اللہ کی ربوبیت اور الوہیت کی گواہی دے رہا ہوتا ہے۔",
                "دعا نہ مانگنے والے کو قرآن میں 'متکبر' (تکبر کرنے والا) کہا گیا ہے کیونکہ وہ خود کو اللہ سے بے نیاز سمجھتا ہے۔"
              ],
              "english": [
                "Nothing is more honorable to Allah than Dua because it signifies the servant's absolute trust in Allah's power and generosity.",
                "When a servant supplicates, they are essentially witnessing Allah's Lordship and Divinity.",
                "Those who do not supplicate are called 'arrogant' in the Quran because they deem themselves independent of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کے اثرات اور فوائد",
        "english": "Effects and Benefits of Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تقدیر اور دعا",
              "english": "Destiny and Supplication"
            },
            "content": {
              "urdu": [
                "دعا آنے والی مصیبتوں کو ٹالنے اور نازل شدہ پریشانیوں میں آسانی کا ذریعہ بنتی ہے۔",
                "دعا کبھی رائیگاں نہیں جاتی؛ یا تو وہ دنیا میں قبول ہوتی ہے، یا اس کے بدلے کوئی برائی ٹال دی جاتی ہے، یا اسے آخرت کے لیے ذخیرہ کر لیا جاتا ہے۔",
                "مسلسل دعا مانگنا بندے اور خالق کے درمیان تعلق کو مضبوط اور زندہ رکھتا ہے۔"
              ],
              "english": [
                "Dua serves as a means to avert future calamities and bring ease during current hardships.",
                "A Dua is never wasted; it is either granted in this world, an evil is averted because of it, or it is stored for the Hereafter.",
                "Consistent supplication keeps the relationship between the servant and the Creator strong and vibrant."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آدابِ دعا کا اہتمام",
              "english": "Observing the Etiquettes of Dua"
            },
            "content": {
              "urdu": [
                "دعا مانگتے وقت مکمل یقین، عاجزی اور توجہ ہونی چاہیے کیونکہ اللہ غافل دل کی دعا قبول نہیں فرماتا۔",
                "دعا کا آغاز اللہ کی حمد و ثنا اور نبی ﷺ پر درود شریف سے کرنا چاہیے تاکہ قبولیت کے امکانات بڑھ جائیں۔",
                "انسان کو چاہیے کہ چھوٹی سے چھوٹی اور بڑی سے بڑی ہر حاجت کے لیے صرف اپنے رب ہی کے سامنے ہاتھ پھیلائے۔"
              ],
              "english": [
                "Dua should be made with absolute conviction, humility, and focus, as Allah does not accept Dua from a heedless heart.",
                "Start the Dua with the praise of Allah and blessings upon the Prophet (ﷺ) to increase the chances of acceptance.",
                "One should stretch their hands only before their Lord for every need, whether small or large."
              ]
            }
          }
        ]
      }
    }
  ]
}