{
  "hadithId": 975,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/975"],
    "kitabId": 8,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 77
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5364)‏، ومسلم (1714)‏ واللفظ لمسلم، وهو أصل في وجوب النفقة للزوجة.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (5364) اور امام مسلم (1714) نے روایت کیا ہے، اور الفاظ مسلم کے ہیں۔ یہ بیوی کے نفقہ کے وجوب کی اصل دلیل ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (5364) and Muslim (1714). The wording is from Muslim, and it is a fundamental evidence for the obligation of providing maintenance for the wife."
  },
  "importantWords": [
    {
      "arabic": "شَحِيحٌ",
      "english": "Stingy / Miserly",
      "urdu": "کنجوس / بخیل"
    },
    {
      "arabic": "اَلنَّفَقَةِ",
      "english": "Maintenance / Expenses",
      "urdu": "خرچہ / نفقہ"
    },
    {
      "arabic": "يَكْفِينِي",
      "english": "Sufficient for me",
      "urdu": "مجھے کافی ہو"
    },
    {
      "arabic": "جُنَاحٍ",
      "english": "Sin / Blame",
      "urdu": "گناہ / حرج"
    },
    {
      "arabic": "بِالْمَعْرُوفِ",
      "english": "Reasonably / According to custom",
      "urdu": "بھلے طریقے سے / معروف طریقے سے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ اگر شوہر بیوی اور بچوں کے ضروری اخراجات پورے نہ کرے تو بیوی اس کی اجازت کے بغیر بقدرِ ضرورت مال لے سکتی ہے۔",
    "english": "This Hadith establishes that if a husband fails to provide necessary maintenance, the wife is permitted to take from his wealth what is reasonably sufficient for her and her children."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5364)",
      "english": "Reported by Al-Bukhari (5364)"
    },
    {
      "arabic": "رواه مسلم (1714)",
      "english": "Reported by Muslim (1714)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fO264uXas",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نفقہ کا وجوب",
        "english": "Obligation of Maintenance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شوہر کی ذمہ داری",
              "english": "Husband's Responsibility"
            },
            "content": {
              "urdu": [
                "بیوی اور بچوں کے خوراک، لباس اور رہائش کے اخراجات شوہر کے ذمہ ہیں۔",
                "اسلام میں نفقہ کی ادائیگی کو شوہر پر ایک قانونی اور شرعی حق قرار دیا گیا ہے۔",
                "اس ذمہ داری میں کوتاہی کرنا گناہ اور اللہ کی نافرمانی کے زمرے میں آتا ہے۔"
              ],
              "english": [
                "The husband is responsible for the food, clothing, and housing expenses of his wife and children.",
                "In Islam, providing maintenance is a legal and Sharia-mandated right upon the husband.",
                "Negligence in this responsibility is considered a sin and disobedience to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقِ خود اختیاری",
              "english": "Right of Self-Help"
            },
            "content": {
              "urdu": [
                "اگر شوہر خرچ دینے میں بخل کرے تو بیوی اپنا حق خود حاصل کر سکتی ہے۔",
                "پوشیدہ طور پر مال لینا اس صورت میں چوری نہیں بلکہ حق کی وصولی کہلائے گا۔",
                "یہ رعایت صرف بنیادی ضروریات کو پورا کرنے کے لیے دی گئی ہے۔"
              ],
              "english": [
                "If the husband is miserly with maintenance, the wife may take her right herself.",
                "Taking money secretly in this context is considered recovering a right, not theft.",
                "This concession is granted only for fulfilling basic and essential needs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معروف کا معیار",
        "english": "The Standard of 'Al-Ma'ruf'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بھلے طریقے کی وضاحت",
              "english": "Explanation of Reasonable Manner"
            },
            "content": {
              "urdu": [
                "حدیث میں 'بالمعروف' کا لفظ بہت اہم ہے جس کا مطلب ہے رواج کے مطابق۔",
                "بیوی کو اس قدر مال لینے کی اجازت ہے جو اس کے خاندان کے معیار کے مطابق ہو۔",
                "اس سے مراد فضول خرچی یا اسراف کی اجازت ہرگز نہیں ہے۔"
              ],
              "english": [
                "The word 'Al-Ma'ruf' in the Hadith is crucial, meaning according to local custom.",
                "The wife is allowed to take an amount consistent with the social status of her family.",
                "This does not imply permission for extravagance or wasteful spending."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضرورت کی حد",
              "english": "The Limit of Necessity"
            },
            "content": {
              "urdu": [
                "اجازت صرف اتنی مقدار کے لیے ہے جو بیوی اور بچوں کی کفالت کر سکے۔",
                "شوہر کے مال کا بیجا استعمال یا اسے ذخیرہ کرنا جائز نہیں ہے۔",
                "یہ حکم ضرورت اور حاجت کے اصول پر مبنی ہے۔"
              ],
              "english": [
                "The permission is limited to the amount sufficient for the wife and children's upkeep.",
                "Excessive use or hoarding of the husband's wealth remains prohibited.",
                "This ruling is based on the principle of necessity and requirement."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی اور سماجی پہلو",
        "english": "Legal and Social Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسائل کے حل کے لیے رجوع",
              "english": "Consultation for Dispute Resolution"
            },
            "content": {
              "urdu": [
                "ہند بنت عتبہ کا نبی ﷺ سے پوچھنا ظاہر کرتا ہے کہ مسائل کا حل علم سے کرنا چاہیے۔",
                "گھریلو جھگڑوں کو شرعی اصولوں کی روشنی میں حل کرنا بہتر ہے۔",
                "فتویٰ لینے کا مقصد اپنے حقوق کی درست پہچان ہونا چاہیے۔"
              ],
              "english": [
                "Hind's inquiry to the Prophet (ﷺ) shows that problems should be solved through knowledge.",
                "Domestic disputes are best resolved in light of Sharia principles.",
                "The purpose of seeking a fatwa should be the correct identification of one's rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و انصاف",
              "english": "Justice and Equity"
            },
            "content": {
              "urdu": [
                "اسلام شوہر اور بیوی دونوں کے حقوق کے درمیان توازن پیدا کرتا ہے۔",
                "شوہر کو حاکم بنایا گیا ہے لیکن اس پر ذمہ داریوں کا بوجھ بھی ڈالا گیا ہے۔",
                "انصاف کا تقاضا ہے کہ کمزور فریق کے حقوق کا تحفظ کیا جائے۔"
              ],
              "english": [
                "Islam creates a balance between the rights of both the husband and the wife.",
                "The husband is made the maintainer but is also burdened with responsibilities.",
                "Justice requires that the rights of the vulnerable party be protected."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بخل کی مذمت",
              "english": "Condemnation of Stinginess"
            },
            "content": {
              "urdu": [
                "اپنے گھر والوں پر خرچ کرنے میں کنجوسی کرنا ناپسندیدہ عمل ہے۔",
                "شوہر کو چاہیے کہ وہ فراخ دلی سے اپنی اولاد اور بیوی کی ضروریات پوری کرے۔",
                "بہترین صدقہ وہ ہے جو انسان اپنے اہل و عیال پر خرچ کرے۔"
              ],
              "english": [
                "Being miserly in spending on one's family is a disliked action.",
                "The husband should generously provide for the needs of his children and wife.",
                "The best charity is that which a person spends on his own family."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی ادائیگی",
              "english": "Fulfillment of Rights"
            },
            "content": {
              "urdu": [
                "معاشرے کے ہر فرد کو دوسرے کے حقوق کا لحاظ رکھنا چاہیے۔",
                "اگر ہم ایک دوسرے کے حقوق ادا کریں تو عدالتی کارروائی کی ضرورت نہیں رہتی۔",
                "یہ حدیث گھریلو نظم و نسق کو چلانے کے لیے ایک بہترین نمونہ پیش کرتی ہے۔"
              ],
              "english": [
                "Every member of society should respect the rights of others.",
                "If we fulfill each other's rights, there is no need for legal interventions.",
                "This Hadith offers an excellent model for managing domestic affairs."
              ]
            }
          }
        ]
      }
    }
  ]
}