{
  "hadithId": 1091,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/12"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (5/444)، وأبو داود (2655)، والترمذي (1613)، والنسائي في الكبرى (8618)، وصححه الحاكم (2/116). وأصله في صحيح البخاري (3160).",
    "urdu": "صحیح۔ اسے احمد (5/444)، ابوداؤد (2655)، ترمذی (1613) اور نسائی نے روایت کیا ہے اور حاکم نے اسے صحیح کہا ہے۔ اس کی اصل صحیح بخاری (3160) میں موجود ہے۔",
    "english": "Sahih. Reported by Ahmad (5/444), Abu Dawud (2655), At-Tirmidhi (1613), and An-Nasa'i in Al-Kubra (8618). Authenticated by Al-Hakim (2/116). Its origin is in Sahih al-Bukhari (3160)."
  },
  "importantWords": [
    {
      "arabic": "أَوَّلَ اَلنَّهَارِ",
      "english": "Beginning of the day",
      "urdu": "دن کا آغاز"
    },
    {
      "arabic": "أَخَّرَ",
      "english": "Delayed",
      "urdu": "تاخیر کی / پیچھے کیا"
    },
    {
      "arabic": "تَزُولَ اَلشَّمْسُ",
      "english": "Sun passes the meridian",
      "urdu": "سورج ڈھل جائے (زوال)"
    },
    {
      "arabic": "تَهُبَّ اَلرِّيَاحُ",
      "english": "Winds blow",
      "urdu": "ہوائیں چلیں"
    },
    {
      "arabic": "اَلنَّصْرُ",
      "english": "The Victory",
      "urdu": "نصرت / مدد"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں جنگ شروع کرنے کے مسنون اوقات بیان کیے گئے ہیں۔ آپ ﷺ یا تو صبح سویرے حملہ فرماتے یا پھر زوال کے بعد کا وقت پسند فرماتے تھے جب ہوائیں چلتی ہیں۔",
    "english": "This Hadith describes the Prophetic strategy for the timing of battle: starting either early in the morning or after the sun passed its zenith when winds typically blow."
  },
  "references": [
    {
      "arabic": "رواه البخاري (3160)",
      "english": "Narrated by Al-Bukhari (3160)"
    },
    {
      "arabic": "رواه أبو داود (2655)",
      "english": "Narrated by Abu Dawud (2655)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "النعمان بن مقرن المزني",
        "english": "An-Nu'man bin Muqarrin al-Muzani"
      },
      "slug": "an-numan-bin-muqarrin"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYmX7G6f48A",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جنگی حکمتِ عملی اور اوقات",
        "english": "Military Strategy and Timing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صبح کے وقت کی اہمیت",
              "english": "Importance of the Morning"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ عام طور پر صبح کے وقت حملے کو پسند فرماتے تھے۔",
                "صبح کا وقت برکت کا وقت ہے اور دشمن اس وقت غافل ہوتا ہے۔",
                "اس وقت تازہ دم فوج کے ساتھ حملہ کرنا زیادہ مؤثر ثابت ہوتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) generally preferred launching attacks in the early morning.",
                "The morning is a time of blessing, and the enemy is often heedless then.",
                "Attacking with fresh troops at this hour proves to be more effective."
              ]
            }
          },
          {
            "title": {
              "urdu": "زوال کے بعد تاخیر کی وجہ",
              "english": "Reason for Delaying Until After Zenith"
            },
            "content": {
              "urdu": [
                "اگر صبح جنگ نہ ہوتی تو آپ ﷺ تپتی دھوپ میں جنگ سے گریز فرماتے۔",
                "زوال کے بعد گرمی کی شدت کم ہونا شروع ہو جاتی ہے جو کہ سپاہیوں کے لیے بہتر ہے۔",
                "یہ وقت دعا کی قبولیت اور نصرتِ الٰہی کے نزول کا خاص وقت مانا گیا ہے۔"
              ],
              "english": [
                "If no morning battle occurred, he avoided fighting during the peak midday heat.",
                "After the zenith, the intensity of heat lessens, which is better for soldiers.",
                "This time is regarded as a special moment for the acceptance of prayers and divine aid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قدرتی عوامل اور نصرتِ الٰہی",
        "english": "Natural Factors and Divine Victory"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہواؤں کا چلنا اور فتح",
              "english": "Winds Blowing and Victory"
            },
            "content": {
              "urdu": [
                "حدیث میں ہواؤں کے چلنے کو فتح کی علامت اور نصرت کا ذریعہ بتایا گیا ہے۔",
                "غزوہ احزاب میں اللہ نے تیز ہوا کے ذریعے ہی دشمن کے قدم اکھاڑے تھے۔",
                "ہوائیں اللہ کا لشکر ہیں جو مومنین کی مدد اور کفار کی پریشانی کا سبب بنتی ہیں۔"
              ],
              "english": [
                "The blowing of winds is mentioned as a sign of victory and a means of aid.",
                "In the Battle of the Trench, Allah uprooted the enemy using a powerful wind.",
                "Winds are among Allah's soldiers that assist believers and harass the disbelievers."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا اور نماز کا وقت",
              "english": "Time for Prayer and Supplication"
            },
            "content": {
              "urdu": [
                "زوال کے بعد فرض نمازوں کا وقت ہوتا ہے جہاں فرشتے حاضر ہوتے ہیں۔",
                "مسلمان اس وقت اللہ کے سامنے سجدہ ریز ہو کر نصرت کی دعا مانگتے ہیں۔",
                "جنگ صرف مادی وسائل سے نہیں بلکہ روحانی قوت اور دعا سے جیتی جاتی ہے۔"
              ],
              "english": [
                "After the zenith, obligatory prayers begin, a time when angels are present.",
                "Muslims prostrate before Allah at this time, seeking His divine assistance.",
                "Battles are won not just by material means, but by spiritual strength and prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سپاہیوں کی فلاح و بہبود",
        "english": "Welfare of the Soldiers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موسمی حالات کا لحاظ",
              "english": "Consideration of Weather Conditions"
            },
            "content": {
              "urdu": [
                "نبی ﷺ اپنے سپاہیوں کی جسمانی راحت کا بے حد خیال رکھتے تھے۔",
                "شدید گرمی میں لڑنا سپاہیوں کو جلد تھکا دیتا ہے اور ہمت پست کرتا ہے۔",
                "موافق ہواؤں کے وقت لڑنا عسکری لحاظ سے فائدہ مند ہوتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was deeply concerned for the physical comfort of his soldiers.",
                "Fighting in extreme heat exhausts troops quickly and lowers morale.",
                "Fighting when winds are favorable is militarily advantageous for the troops."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکیمانہ قیادت",
              "english": "Wise Leadership"
            },
            "content": {
              "urdu": [
                "ایک اچھا لیڈر وہی ہے جو دشمن پر وار کرنے کے لیے بہترین لمحے کا انتخاب کرے۔",
                "آپ ﷺ نے جنگ کو محض خون خرابہ نہیں بلکہ ایک منظم عمل بنا کر دکھایا۔",
                "فطرت کے قوانین کو سمجھ کر ان سے فائدہ اٹھانا سنتِ نبوی ﷺ ہے۔"
              ],
              "english": [
                "A good leader chooses the perfect moment to strike at the enemy effectively.",
                "The Prophet (ﷺ) demonstrated that war is an organized effort, not just bloodshed.",
                "Utilizing the laws of nature to one's advantage is part of the Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور عملی اسباق",
        "english": "Spiritual and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ پر توکل",
              "english": "Trust in Allah"
            },
            "content": {
              "urdu": [
                "مدد صرف اللہ کی طرف سے آتی ہے، اس لیے صحیح وقت کا انتظار کرنا چاہیے۔",
                "مومن اسباب اختیار کرتا ہے مگر نظر مسبب الاسباب پر رکھتا ہے۔",
                "نصرتِ الٰہی کے نزول کے لیے صبر اور استقامت بنیادی شرائط ہیں۔"
              ],
              "english": [
                "Aid comes only from Allah; therefore, one must wait for the proper timing.",
                "A believer employs means but keeps his eyes on the Provider of means.",
                "Patience and steadfastness are primary conditions for the descent of divine aid."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی اہمیت",
              "english": "Importance of Discipline"
            },
            "content": {
              "urdu": [
                "لشکر کو امیر کے حکم اور مقررہ اوقات کی پابندی کرنی چاہیے۔",
                "افراتفری کے بجائے سکون اور وقار کے ساتھ میدان میں نکلنا چاہیے۔",
                "اسلام ہر کام کو سلیقے اور بہترین ترتیب سے کرنے کا درس دیتا ہے۔"
              ],
              "english": [
                "An army must adhere to the commander's orders and the designated timings.",
                "Troops should enter the field with tranquility and dignity rather than chaos.",
                "Islam teaches us to perform every task with elegance and optimal order."
              ]
            }
          }
        ]
      }
    }
  ]
}