{
  "hadithId": 529,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/529"],
    "kitabId": 5,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصيام",
    "babId": 33
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1900)، ومسلم (1080). واللفظ لمسلم يفسر معنى 'فاقدروا له' بإكمال العدة ثلاثين يوماً عند تعذر الرؤية.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری (1900) و مسلم (1080) میں موجود ہے۔ مسلم کی روایت 'فاقدروا له' کی تفسیر کرتی ہے کہ اگر چاند نظر نہ آئے تو تیس دن پورے کیے جائیں۔",
    "english": "Sahih. Reported by Al-Bukhari (1900) and Muslim (1080). Muslim's version explains 'calculate for it' as completing thirty days if the moon is obscured."
  },
  "importantWords": [
    {
      "arabic": "رأَيْتُمُوهُ",
      "english": "You see it",
      "urdu": "تم اسے دیکھ لو"
    },
    {
      "arabic": "فَصُومُوا",
      "english": "So fast",
      "urdu": "پس روزہ رکھو"
    },
    {
      "arabic": "فَأَفْطِرُوا",
      "english": "Break the fast",
      "urdu": "پس افطار کرو (عید کرو)"
    },
    {
      "arabic": "غُمَّ / أُغْمِيَ",
      "english": "Cloudy / Obscured",
      "urdu": "ابر آلود / چھپ گیا"
    },
    {
      "arabic": "فَاقْدُرُوا",
      "english": "Calculate / Estimate",
      "urdu": "اندازہ کرو / گنتی کرو"
    },
    {
      "arabic": "اَلْعِدَّةَ",
      "english": "The number / Count",
      "urdu": "گنتی / تعداد"
    }
  ],
  "summary": {
    "urdu": "روزوں کا آغاز اور اختتام چاند دیکھنے پر منحصر ہے؛ اگر بادلوں کی وجہ سے چاند نظر نہ آئے تو شعبان یا رمضان کے تیس دن پورے کرنا لازم ہے۔",
    "english": "The beginning and end of fasting depend on sighting the new moon; if it is obscured by clouds, the month of Sha'ban or Ramadan must be completed as thirty days."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1900)",
      "english": "Sahih al-Bukhari (1900)"
    },
    {
      "arabic": "صحيح مسلم (1080)",
      "english": "Sahih Muslim (1080)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar bin al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رویتِ ہلال کا اصول",
        "english": "The Principle of Moon Sighting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بصری مشاہدے کی اہمیت",
              "english": "Importance of Visual Sighting"
            },
            "content": {
              "urdu": [
                "اسلام میں قمری مہینوں کا آغاز چاند کو آنکھ سے دیکھنے پر منحصر ہے۔",
                "یہ طریقہ کار نہایت سادہ اور ہر عام و خاص کے لیے قابلِ فہم ہے۔",
                "نبی ﷺ نے امت کو نجوم اور پیچیدہ حسابات کے بجائے رویت کا حکم دیا۔"
              ],
              "english": [
                "In Islam, lunar months begin based on the visual sighting of the new moon.",
                "This method is simple and easily understood by both the elite and commoners.",
                "The Prophet (ﷺ) ordered sighting instead of relying on astrology or complex math."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحاد اور نظم و ضبط",
              "english": "Unity and Discipline"
            },
            "content": {
              "urdu": [
                "چاند دیکھ کر روزہ شروع کرنا پوری امت میں یکسانیت پیدا کرتا ہے۔",
                "اس حکم سے عبادات کے اوقات میں نظم و ضبط پیدا ہوتا ہے۔",
                "اجتماعی رویت سے مسلمانوں کے مابین سماجی اتحاد مضبوط ہوتا ہے۔"
              ],
              "english": [
                "Starting fasts by sighting the moon creates uniformity across the Ummah.",
                "This ruling instills discipline in the timings of various acts of worship.",
                "Collective sighting strengthens social unity and harmony among Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ابر آلود مطلع کا حکم",
        "english": "Ruling for an Obscured Horizon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیس دن کی تکمیل",
              "english": "Completion of Thirty Days"
            },
            "content": {
              "urdu": [
                "اگر بادلوں کی وجہ سے چاند نظر نہ آئے تو مہینہ تیس دن کا شمار ہوگا۔",
                "شعبان کی انتیس تاریخ کو چاند نہ دکھے تو تیسرا دن شعبان ہی کا ہوگا۔",
                "یہ حکم شک کو دور کرنے اور یقین کے ساتھ عبادت کے لیے دیا گیا ہے۔"
              ],
              "english": [
                "If the moon is obscured by clouds, the month is counted as thirty days.",
                "If not seen on the 29th of Sha'ban, the next day is considered Sha'ban.",
                "This command aims to remove doubt and ensure worship starts with certainty."
              ]
            }
          },
          {
            "title": {
              "urdu": "فاقدروا لہ کی تفسیر",
              "english": "Interpretation of 'Calculate for it'"
            },
            "content": {
              "urdu": [
                "بعض نے اس کا مطلب حساب لگایا، مگر صحیح معنی تیس دن پورے کرنا ہے۔",
                "بخاری و مسلم کی دیگر روایات نے اس ابہام کو مکمل طور پر واضح کر دیا۔",
                "صحیح تفسیر وہی ہے جو خود حدیث کے الفاظ سے واضح ہو رہی ہے۔"
              ],
              "english": [
                "Some interpreted it as calculation, but the correct meaning is completing 30 days.",
                "Other narrations in Bukhari and Muslim clarify this ambiguity completely.",
                "The most authentic interpretation is that which is evident from the Hadith text."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی وسعت اور حساب",
        "english": "Juristic Scope and Astronomy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فلکیاتی حساب کا مقام",
              "english": "Status of Astronomical Calculations"
            },
            "content": {
              "urdu": [
                "دورِ حاضر میں سائنسی آلات چاند کی پیدائش بتانے میں مددگار ثابت ہو سکتے ہیں۔",
                "بنیادی حکم رویت (دیکھنا) ہی ہے، حساب محض معاون ہو سکتا ہے۔",
                "اگر حساب رویت کے خلاف ہو تو رویتِ بصری ہی کو ترجیح دی جائے گی۔"
              ],
              "english": [
                "Modern scientific tools can help in predicting the birth of the new moon.",
                "The primary command remains visual sighting; math is merely a secondary aid.",
                "If calculations contradict sighting, the actual visual sighting is prioritized."
              ]
            }
          },
          {
            "title": {
              "urdu": "امتِ امی کا تصور",
              "english": "Concept of the Unlettered Nation"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ ہم ایک ایسی امت ہیں جو لکھنا اور حساب نہیں جانتے۔",
                "اس سے مراد یہ ہے کہ دین کو مشکل حسابات پر موقوف نہیں رکھا گیا۔",
                "اسلامی احکامات کی بنیاد فطرت اور آسانی پر رکھی گئی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said we are a nation that does not write or calculate.",
                "This means religion is not dependent on complex mathematical systems.",
                "Islamic rulings are founded upon natural simplicity and ease for all."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اطاعتِ رسول ﷺ",
              "english": "Obedience to the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "روزے کا آغاز اپنی مرضی کے بجائے فرمانِ نبوی ﷺ کے مطابق کریں۔",
                "سنت کی پیروی میں ہی برکت اور عبادات کی قبولیت کا راز ہے۔",
                "شک کی حالت میں تیس دن پورے کرنا ہی سلامتی کا راستہ ہے۔"
              ],
              "english": [
                "Start fasting according to the Prophet's (ﷺ) command, not personal choice.",
                "The secret to blessings and acceptance of worship lies in following Sunnah.",
                "Completing thirty days in case of doubt is the path of spiritual safety."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی فیصلے کی پابندی",
              "english": "Adherence to Collective Decisions"
            },
            "content": {
              "urdu": [
                "چاند کے معاملے میں ریاستی اور شرعی کمیٹیوں کے فیصلے کا احترام کریں۔",
                "انفرادی طور پر چاند دیکھ کر الگ عید یا روزہ کرنا انتشار کا باعث ہے۔",
                "نظمِ جماعت کو برقرار رکھنا اسلامی معاشرت کا اہم جزو ہے۔"
              ],
              "english": [
                "Respect the decisions of official Shariah committees regarding the moon.",
                "Fasting or celebrating Eid individually causes discord in the community.",
                "Maintaining the order of the group is a vital part of Islamic social life."
              ]
            }
          }
        ]
      }
    }
  ]
}