{
  "hadithId": 404,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/2/404"],
    "kitabId": 2,
    "inKitabBab": 15,
    "arabicBook": "كتاب الصلاة",
    "babId": 25
  },
  
  "takhreej": {
    "arabic": "ضعيف.‏ رواه الشافعي في المسند (1/175)، والطبراني في الكبير (11/213). في إسناده ضعف، ولكن معناه ثابت في أحاديث صحيحة أخرى.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے امام شافعی اور طبرانی نے روایت کیا ہے۔ اس کی سند میں ضعف ہے، تاہم تیز ہوا کے وقت دعا مانگنے کا مفہوم دیگر صحیح احادیث سے ثابت ہے۔",
    "english": "Weak (Da'if). Reported by Ash-Shafi'i and At-Tabarani. There is weakness in its chain, though the concept of supplicating during strong winds is supported by other Sahih narrations."
  },
  "importantWords": [
    {
      "arabic": "هَبَّتْ",
      "english": "Blew / Stirred",
      "urdu": "چلی / چلی"
    },
    {
      "arabic": "رِيحٌ",
      "english": "Wind",
      "urdu": "ہوا"
    },
    {
      "arabic": "جَثَا",
      "english": "Fell to knees",
      "urdu": "گھٹنوں کے بل بیٹھ گیا"
    },
    {
      "arabic": "رَحْمَةً",
      "english": "Mercy",
      "urdu": "رحمت"
    },
    {
      "arabic": "عَذَابًا",
      "english": "Punishment",
      "urdu": "عذاب"
    },
    {
      "arabic": "قَطُّ",
      "english": "Ever / Never",
      "urdu": "کبھی بھی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث تیز ہوا کے وقت اللہ کی پناہ مانگنے اور اسے رحمت بنانے کی دعا کرنے کی ترغیب دیتی ہے تاکہ وہ عذاب کی شکل اختیار نہ کرے۔",
    "english": "This Hadith encourages seeking Allah's refuge and praying for mercy during strong winds, so that they do not become a source of punishment."
  },
  "references": [
    {
      "arabic": "رواه الشافعي في المسند (502)",
      "english": "Reported by Ash-Shafi'i in Al-Musnad (502)"
    },
    {
      "arabic": "رواه الطبراني في الكبير (11533)",
      "english": "Reported by At-Tabarani in Al-Kabir (11533)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R6w2v2eE6rM",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تیز ہوا اور نبوی رویہ",
        "english": "Prophetic Reaction to Winds"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ الٰہی کا غلبہ",
              "english": "Prevalence of Fear of Allah"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ قدرتی آفات اور تیز ہوا کے وقت اللہ سے ڈرتے تھے۔",
                "گھٹنوں کے بل بیٹھنا اللہ کے سامنے انتہائی عاجزی کا اظہار ہے۔",
                "آپ ﷺ کو اندیشہ ہوتا کہ کہیں یہ کسی گناہ کی پاداش میں عذاب نہ ہو۔"
              ],
              "english": [
                "The Prophet (PBUH) feared Allah during natural disasters and strong winds.",
                "Falling to the knees expresses extreme humility before Allah the Almighty.",
                "He (PBUH) worried that it might be a punishment for some sins."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی اہمیت",
              "english": "Importance of Supplication"
            },
            "content": {
              "urdu": [
                "تیز ہوا کو دیکھ کر پریشان ہونے کے بجائے دعا کا سہارا لینا چاہیے۔",
                "دعا بلاؤں کو ٹالنے اور اللہ کی رحمت کو متوجہ کرنے کا ذریعہ ہے۔",
                "مسنون دعا 'اللهم اجعلها رحمة' پڑھنا سنتِ نبوی سے ثابت ہے۔"
              ],
              "english": [
                "Instead of being anxious during winds, one should resort to supplication.",
                "Dua is a means to avert calamities and attract Allah's mercy.",
                "Reciting the sunnah dua for mercy is established from the Prophet (PBUH)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہوا: رحمت یا عذاب",
        "english": "Wind: Mercy or Punishment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سابقہ قوموں کا عبرت ناک انجام",
              "english": "Lessons from Previous Nations"
            },
            "content": {
              "urdu": [
                "قرآن کے مطابق قومِ عاد کو تیز ہوا کے ذریعے ہی ہلاک کیا گیا تھا۔",
                "مومن کو ہر ایسی نشانی سے عبرت پکڑنی چاہیے جو ماضی میں ہلاکت کا سبب بنی۔",
                "تیز ہوا اللہ کا لشکر ہے جو مومن کے لیے رحمت اور کافر کے لیے عذاب ہو سکتی ہے۔"
              ],
              "english": [
                "According to the Quran, the people of 'Ad were destroyed by a fierce wind.",
                "A believer should take heed from signs that caused destruction in the past.",
                "Strong wind is an army of Allah that can be mercy for some and punishment for others."
              ]
            }
          },
          {
            "title": {
              "urdu": "بارش کی نوید",
              "english": "Glad Tidings of Rain"
            },
            "content": {
              "urdu": [
                "اکثر اوقات ہوائیں اللہ کی رحمت یعنی بارش کی خوشخبری لے کر آتی ہیں۔",
                "نبی ﷺ کی دعا کا مقصد ہوا کے شر سے بچنا اور اس کی خیر پانا تھا۔",
                "ہواؤں کا چلنا زمین کے نظام اور انسانی زندگی کے لیے ضروری ہے۔"
              ],
              "english": [
                "Often, winds bring the glad tidings of Allah's mercy, which is rain.",
                "The Prophet's (PBUH) dua aimed to avoid wind's evil and gain its good.",
                "The blowing of winds is essential for the Earth's ecosystem and human life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی پہلو",
        "english": "Juristic and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہوا کو برا بھلا کہنے کی ممانعت",
              "english": "Prohibition of Cursing the Wind"
            },
            "content": {
              "urdu": [
                "اسلام میں ہوا یا موسم کو گالی دینا یا برا کہنا منع ہے۔",
                "ہوائیں اللہ کے حکم کے تابع ہیں اور اس کے اشارے پر چلتی ہیں۔",
                "برا کہنے کے بجائے اللہ سے اس کی خیر کا سوال کرنا بہتر عمل ہے۔"
              ],
              "english": [
                "In Islam, it is forbidden to curse or speak ill of the wind or weather.",
                "Winds are subject to Allah's command and move by His decree.",
                "Instead of complaining, it is better to ask Allah for its benefit."
              ]
            }
          },
          {
            "title": {
              "urdu": "عاجزی و انکساری",
              "english": "Humility and Submission"
            },
            "content": {
              "urdu": [
                "قدرت کے مظاہر کے سامنے انسان کی بے بسی ظاہر ہوتی ہے۔",
                "مومن کا شیوہ ہے کہ وہ ہر حال میں اپنے رب کی طرف رجوع کرے۔",
                "گھٹنوں کے بل بیٹھنا اس بات کا اعتراف ہے کہ اقتدارِ اعلیٰ صرف اللہ کا ہے۔"
              ],
              "english": [
                "The helplessness of man is revealed before the phenomena of nature.",
                "It is the hallmark of a believer to turn to his Lord in every situation.",
                "Kneeling is an admission that supreme sovereignty belongs only to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنون دعاؤں کا اہتمام",
              "english": "Practicing Sunnah Supplications"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو روزمرہ کے بدلتے حالات کی دعائیں یاد کرنی چاہئیں۔",
                "ان دعاؤں کا ورد انسان کو نفسیاتی سکون اور روحانی تحفظ دیتا ہے۔",
                "سنت پر عمل کرنا ہی دنیا اور آخرت میں کامیابی کی ضمانت ہے۔"
              ],
              "english": [
                "Muslims should memorize supplications for changing daily circumstances.",
                "Reciting these prayers provides psychological peace and spiritual protection.",
                "Adhering to the Sunnah is the guarantee for success in both worlds."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی عظمت کا استحضار",
              "english": "Remembrance of Allah's Greatness"
            },
            "content": {
              "urdu": [
                "موسمی تبدیلیوں کو محض اتفاق نہ سمجھیں بلکہ اللہ کی یاد کا ذریعہ بنائیں۔",
                "تیز ہوا چلتے وقت اپنے اعمال کا محاسبہ کرنا چاہیے۔",
                "اللہ کی رحمت کے طلبگار رہیں اور اس کے عذاب سے ہمیشہ ڈرتے رہیں۔"
              ],
              "english": [
                "Do not view weather changes as coincidences; use them to remember Allah.",
                "One should hold oneself accountable when witnessing strong winds.",
                "Keep seeking Allah's mercy and always remain fearful of His punishment."
              ]
            }
          }
        ]
      }
    }
  ]
}
