{
  "hadithId": 888,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/78"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
 
  "takhreej": {
    "arabic": "منكر بهذا اللفظ . رواه الحاكم (2/178)، والطبراني في الكبير (5837). والحديث أصله في الصحيحين، ولكن بلفظ: \"التمس ولو خاتماً من حديد\"، وفي رواية الصحيحين أن الرجل لم يجد حتى الخاتم فزوجه بما معه من القرآن. أما لفظ زوجه بالخاتم فعلاً ففيه نكارة لمخالفتها للثقات.",
    "urdu": "یہ الفاظ منکر ہیں۔ اس حدیث کی اصل بخاری و مسلم میں ہے جس میں آپ ﷺ نے فرمایا تھا: ”تلاش کرو خواہ لوہے کی ایک انگوٹھی ہی کیوں نہ ہو۔“ لیکن اس شخص کو وہ بھی نہ ملی تھی، چنانچہ آپ ﷺ نے اسے اس قرآن کی بنیاد پر نکاح میں دے دیا جو اسے یاد تھا۔ لوہے کی انگوٹھی پر نکاح ہو جانے والے الفاظ سنداً کمزور ہیں۔",
    "english": "Munkar (denied) with this specific wording. The original narration is in Bukhari and Muslim, where the Prophet (ﷺ) said, 'Look for something, even if it is an iron ring.' However, the man could not even find that, so the Prophet (ﷺ) married him to her based on the Quran he had memorized."
  },
  "importantWords": [
    {
      "arabic": "زَوَّجَ",
      "english": "Married off / Joined in marriage",
      "urdu": "نکاح کر دیا"
    },
    {
      "arabic": "بِخَاتَمٍ",
      "english": "With a ring",
      "urdu": "انگوٹھی کے بدلے"
    },
    {
      "arabic": "حَدِيدٍ",
      "english": "Iron",
      "urdu": "لوہا"
    },
    {
      "arabic": "طَرَفٌ",
      "english": "A portion / fragment",
      "urdu": "ایک ٹکڑا / حصہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مفہوم یہ ہے کہ مہر میں قیمتی اشیاء کا ہونا ضروری نہیں، بلکہ معمولی چیز (جیسے لوہے کی انگوٹھی) بھی مہر بن سکتی ہے اگر فریقین راضی ہوں۔",
    "english": "The essence of this Hadith is that Mahr does not need to be expensive; even a simple item like an iron ring can suffice if both parties agree."
  },
  "references": [
    {
      "arabic": "المستدرك للحاكم، كتاب النكاح، رقم الحديث ٢٧٥٠",
      "english": "Al-Mustadrak Al-Hakim, Book of Marriage, Hadith No. 2750"
    },
    {
      "arabic": "صحيح البخاري، كتاب النكاح، رقم الحديث ٥١٢١",
      "english": "Sahih Bukhari, Book of Marriage, Hadith No. 5121 (Contextual reference)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سهل بن سعد الساعدي",
        "english": "Sahl bin Sa'd al-Sa'idi"
      },
      "slug": "sahl-bin-sad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqGjI2Y8HLo",
  "grade": {
    "arabic": "منكر بهذا اللفظ / أصله في الصحيحين",
    "english": "Munkar with this wording / Original is in Sahihain"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہر میں سادگی اور آسانی",
        "english": "Simplicity and Ease in Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معمولی چیز کی مہر میں حیثیت",
              "english": "Status of Simple Items as Mahr"
            },
            "content": {
              "urdu": [
                "شریعت نے مہر کی کوئی زیادہ سے زیادہ حد مقرر نہیں کی، لیکن سادگی کو پسند کیا ہے۔",
                "لوہے کی انگوٹھی کی مثال اس لیے دی گئی تاکہ واضح ہو کہ مہر محض ایک علامت ہے، قیمت نہیں۔",
                "نکاح کو اتنا آسان ہونا چاہیے کہ غریب سے غریب شخص بھی اسے حلال طریقے سے کر سکے۔"
              ],
              "english": [
                "Shariah has not set a maximum limit for Mahr, but it prefers simplicity.",
                "The example of an iron ring shows that Mahr is a symbolic token, not a purchase price.",
                "Marriage should be made easy enough so that even the poorest individual can perform it lawfully."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی ترغیب",
              "english": "The Prophet's (ﷺ) Encouragement"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس شخص کو کچھ نہ کچھ تلاش کرنے کا حکم دیا تاکہ سنتِ مہر پوری ہو۔",
                "یہ اس بات کی دلیل ہے کہ نکاح بالکل خالی نہیں ہونا چاہیے، کچھ نہ کچھ مالی حق ضرور ہو۔",
                "اگر مادی چیز نہ ہو تو معنوی چیز (جیسے تعلیم دینا) بھی مہر بن سکتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) ordered the man to find something to fulfill the Sunnah of Mahr.",
                "This indicates that a marriage should not be void of any financial right or gift.",
                "If material goods are unavailable, non-material benefits (like teaching) can serve as Mahr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علمی و فنی باریکیاں",
        "english": "Scholarly and Technical Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کے الفاظ کی تحقیق",
              "english": "Investigation of the Wording"
            },
            "content": {
              "urdu": [
                "صحیح روایات کے مطابق اس شخص کو لوہے کی انگوٹھی بھی میسر نہیں آئی تھی۔",
                "حاکم کی اس روایت کے الفاظ کہ 'لوہے کی انگوٹھی پر نکاح کیا' محدثین کے نزدیک وہم ہے۔",
                "حقیقت میں اس کا نکاح قرآن کی سورتیں سکھانے کے بدلے ہوا تھا۔"
              ],
              "english": [
                "According to authentic reports, the man could not even find an iron ring.",
                "The specific wording in Al-Hakim's report is considered an error by Hadith critics.",
                "In reality, the marriage was finalized in exchange for him teaching Quranic chapters."
              ]
            }
          },
          {
            "title": {
              "urdu": "لوہے کا استعمال اور مہر",
              "english": "Use of Iron and Mahr"
            },
            "content": {
              "urdu": [
                "بعض فقہاء نے مہر کی کم سے کم مقدار مقرر کی ہے، لیکن یہ حدیث ان کے خلاف دلیل ہے۔",
                "لوہے کی انگوٹھی سے ثابت ہوتا ہے کہ ہر وہ چیز جو مال کہلائے، مہر بن سکتی ہے۔",
                "مہر کی اصل روح عورت کی رضا مندی اور شوہر کی استطاعت کے درمیان توازن ہے۔"
              ],
              "english": [
                "Some jurists set a minimum amount for Mahr, but this Hadith serves as evidence against fixed minimums.",
                "The mention of an iron ring proves that anything defined as 'wealth' can be Mahr.",
                "The true spirit of Mahr is the balance between the woman's consent and the husband's capacity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی پیغام",
        "english": "Social Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمود و نمائش کی نفی",
              "english": "Negating Extravagance"
            },
            "content": {
              "urdu": [
                "بھاری مہر اور شاہانہ اخراجات نکاح میں تاخیر اور معاشرتی برائیوں کا سبب بنتے ہیں۔",
                "نبی ﷺ نے ایک مفلس صحابی کا نکاح کروا کر معاشرے کو ایک نیا رخ دیا۔",
                "برکت مہر کی کثرت میں نہیں بلکہ سنت کی پیروی اور سادگی میں ہے۔"
              ],
              "english": [
                "Heavy dowers and lavish expenses cause delays in marriage and lead to social vices.",
                "The Prophet (ﷺ) gave society a new direction by facilitating the marriage of a poor companion.",
                "Blessing lies not in the abundance of Mahr but in following the Sunnah and simplicity."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کے لیے سبق",
              "english": "Lesson for Women"
            },
            "content": {
              "urdu": [
                "جس عورت نے قرآن کی تعلیم پر مہر قبول کیا، وہ رہتی دنیا کے لیے قناعت کی مثال بن گئی۔",
                "دیندار شوہر کی تلاش دنیاوی مال و دولت سے زیادہ مقدم ہونی چاہیے۔",
                "نیک میاں بیوی کا ساتھ ہی اصل کامیابی اور سکون کا باعث ہے۔"
              ],
              "english": [
                "The woman who accepted Quranic teaching as Mahr became an eternal example of contentment.",
                "Seeking a religious husband should take precedence over worldly wealth.",
                "The companionship of a righteous spouse is the true cause of success and peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیت کی پاکیزگی",
              "english": "Purity of Intention"
            },
            "content": {
              "urdu": [
                "اگر نیت پاک ہو تو اللہ تعالیٰ کم وسائل میں بھی نکاح کے اسباب پیدا کر دیتا ہے۔",
                "حلال راستے کو اختیار کرنا اللہ کی نصرت اور مدد کو اپنی طرف متوجہ کرتا ہے۔",
                "مومن کو چاہیے کہ وہ ہر حال میں اللہ کی رضا کو ترجیح دے۔"
              ],
              "english": [
                "If intentions are pure, Allah creates means for marriage even with limited resources.",
                "Choosing the lawful path attracts the support and help of Allah.",
                "A believer should prioritize Allah's pleasure in every circumstance."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحقیق کی اہمیت",
              "english": "Importance of Investigation"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ بھی معلوم ہوا کہ حدیث کے الفاظ کو پرکھنا کتنا ضروری ہے۔",
                "محدثین کی محنت ہی سے ہمیں پتہ چلا کہ کون سے الفاظ مستند ہیں اور کون سے وہم۔",
                "دین کے معاملے میں ہمیشہ مستند اور ثقہ ذرائع کی طرف رجوع کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith also shows how vital it is to scrutinize the specific wordings of narrations.",
                "It is through the efforts of Hadith scholars that we know which words are authentic and which are errors.",
                "In religious matters, one should always refer to authentic and reliable sources."
              ]
            }
          }
        ]
      }
    }
  ]
}