{
  "hadithId": 419,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-419"],
    "kitabId": 2,
    "inKitabBab": 17,
    "arabicBook": "بلوغ المرام",
    "babId": 27
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5840)‏، ومسلم (2071). واللفظ لمسلم، والحلة السيراء هي التي يخالطها الحرير أو تكون مخططة به.",
    "urdu": "یہ حدیث صحیح اور متفق علیہ ہے۔ اسے امام بخاری (5840) اور امام مسلم (2071) نے روایت کیا ہے۔ 'حلہ سیراء' سے مراد وہ لباس ہے جس میں ریشم کی آمیزش ہو یا ریشمی دھاریوں والا جوڑا ہو۔",
    "english": "Sahih. Reported by Al-Bukhari (5840) and Muslim (2071). The 'Siyara' suit refers to a garment mixed with silk or having silk stripes."
  },
  "importantWords": [
    {
      "arabic": "حُلَّةً",
      "english": "Suit / Two-piece garment",
      "urdu": "جوڑا / لباس"
    },
    {
      "arabic": "سِيَرَاءَ",
      "english": "Striped with silk",
      "urdu": "ریشمی پٹیوں والا"
    },
    {
      "arabic": "اَلْغَضَبَ",
      "english": "Anger / Displeasure",
      "urdu": "غصہ / ناراضگی"
    },
    {
      "arabic": "فَشَقَقْتُهَا",
      "english": "I tore it / divided it",
      "urdu": "پس میں نے اسے پھاڑ دیا"
    },
    {
      "arabic": "نِسَائِي",
      "english": "My women (female relatives)",
      "urdu": "میری عورتیں (گھر کی خواتین)"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے حضرت علیؓ کو ایک ریشمی جوڑا ہدیہ کیا، مگر جب انہوں نے اسے پہنا تو آپ ﷺ نے ناپسندیدگی ظاہر فرمائی کیونکہ ریشم مردوں پر حرام ہے، چنانچہ انہوں نے اسے گھر کی خواتین میں تقسیم کر دیا۔",
    "english": "The Prophet (ﷺ) gifted a silk garment to 'Ali (RA), but expressed displeasure when he wore it as silk is forbidden for men. Consequently, 'Ali (RA) divided it among the women of his household."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5840)",
      "english": "Sahih al-Bukhari (5840)"
    },
    {
      "arabic": "صحيح مسلم (2071)",
      "english": "Sahih Muslim (2071)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=ruling+of+silk+for+men+and+women+urdu",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ریشم کی شرعی حیثیت",
        "english": "Islamic Status of Silk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردوں پر ریشم کی ممانعت",
              "english": "Prohibition of Silk for Men"
            },
            "content": {
              "urdu": [
                "اسلام میں ریشم پہننا مردوں کے لیے حرام قرار دیا گیا ہے۔",
                "نبی ﷺ نے اسے امت کے مردوں کے لیے دنیا میں ممنوع قرار دیا۔",
                "یہ حکم مردانہ وقار کی حفاظت اور عیاشی سے بچنے کے لیے ہے۔"
              ],
              "english": [
                "Wearing silk is strictly forbidden for men in Islam.",
                "The Prophet (ﷺ) prohibited it for the males of his Ummah in this life.",
                "This ruling aims to protect masculine dignity and avoid extravagance."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کے لیے ریشم کا جواز",
              "english": "Permissibility of Silk for Women"
            },
            "content": {
              "urdu": [
                "ریشم کا لباس خواتین کے لیے مکمل طور پر حلال اور جائز ہے۔",
                "حضرت علیؓ کا اسے خواتین میں بانٹنا اس جواز کی واضح دلیل ہے۔",
                "اسلام خواتین کی زینت اور فطری پسند کا پورا لحاظ رکھتا ہے۔"
              ],
              "english": [
                "Silk clothing is entirely lawful and permissible for women.",
                "Ali (RA) dividing the cloth among women proves this permissibility.",
                "Islam considers the natural inclination of women towards adornment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہدیہ اور اس کا استعمال",
        "english": "Gifts and Their Usage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرام اشیاء کا ہدیہ دینا",
              "english": "Gifting Prohibited Items"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ریشمی جوڑا حضرت علیؓ کو پہننے کے لیے نہیں دیا تھا۔",
                "ایسی اشیاء ہدیہ کرنا جائز ہے جن کا نفع دوسرے طریقے سے لیا جا سکے۔",
                "ہدیہ وصول کرنے والا اسے اپنی ضرورت یا خواتین کے لیے رکھ سکتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not give the silk suit to 'Ali to wear it himself.",
                "It is permissible to gift items that can be utilized in other lawful ways.",
                "The recipient can keep the gift for trade or for the women of the family."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا اندازِ تربیت",
              "english": "The Prophet's (ﷺ) Method of Training"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے زبان سے ٹوکنے کے بجائے چہرے کے تاثرات سے ناگواری ظاہر کی۔",
                "مربی کو چاہیے کہ وہ موقع کی مناسبت سے نرمی یا سختی اختیار کرے۔",
                "صحابہ کرام آپ ﷺ کے چہرے کے تاثرات سے حکم سمجھ لیتے تھے۔"
              ],
              "english": [
                "The Prophet (ﷺ) showed displeasure through facial expressions instead of words.",
                "An educator should employ softness or firmness as the situation demands.",
                "The Companions used to understand commands through the Prophet's (ﷺ) face."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اتباعِ سنت کا جذبہ",
        "english": "Spirit of Following the Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فوری اطاعتِ رسول ﷺ",
              "english": "Immediate Obedience to the Messenger (ﷺ)"
            },
            "content": {
              "urdu": [
                "حضرت علیؓ نے جیسے ہی غصہ دیکھا، فوری طور پر جوڑا اتار دیا۔",
                "صحابہ کرام حق بات سامنے آنے پر تاویل کے بجائے عمل کرتے تھے۔",
                "سچی محبت کا تقاضا یہی ہے کہ محبوب کی ناگواری پر عمل ترک کر دیا جائے۔"
              ],
              "english": [
                "As soon as 'Ali (RA) saw the anger, he immediately removed the suit.",
                "The Companions acted upon the truth without seeking excuses or delays.",
                "True love requires abandoning actions that displease the beloved."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کا ضیاع نہ کرنا",
              "english": "Avoiding Waste of Wealth"
            },
            "content": {
              "urdu": [
                "انہوں نے قیمتی لباس کو ضائع کرنے کے بجائے اسے خواتین کے لیے پھاڑا۔",
                "یہ عمل سکھاتا ہے کہ ممنوعہ شے کا وہ حصہ استعمال کریں جو جائز ہے۔",
                "اسلام مال کی حفاظت اور اس کے درست استعمال کی تلقین کرتا ہے۔"
              ],
              "english": [
                "He tore the expensive garment for women instead of wasting it.",
                "This teaches utilizing the permissible parts or aspects of restricted items.",
                "Islam encourages the protection of wealth and its correct distribution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہل خانہ کا خیال",
              "english": "Caring for Family Members"
            },
            "content": {
              "urdu": [
                "مرد کو چاہیے کہ وہ اپنی خواتین کے جائز مطالبات اور زیب و زینت کا خیال رکھے۔",
                "حضرت علیؓ کا خواتین میں ریشم بانٹنا ان کی شفقت کو ظاہر کرتا ہے۔",
                "گھر میں خوشی اور برابری کا ماحول قائم کرنا سنتِ صحابہ ہے۔"
              ],
              "english": [
                "A man should care for the lawful adornment needs of his female relatives.",
                "Ali (RA) distributing silk among women demonstrates his compassion.",
                "Establishing joy and equality within the home is the practice of Sahaba."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور احتیاط",
              "english": "Piety and Precaution"
            },
            "content": {
              "urdu": [
                "مشتبہ یا ناپسندیدہ چیزوں سے بچنا کمالِ ایمان کی علامت ہے۔",
                "نبی ﷺ کی ناراضگی مول لینا کسی مومن کے لیے ممکن نہیں تھا۔",
                "زندگی کے ہر معاملے میں اللہ اور اس کے رسول ﷺ کی مرضی تلاش کریں۔"
              ],
              "english": [
                "Avoiding doubtful or disliked matters is a sign of perfected faith.",
                "Incurring the Prophet's (ﷺ) displeasure was unbearable for a believer.",
                "Seek the will of Allah and His Messenger (ﷺ) in every life matter."
              ]
            }
          }
        ]
      }
    }
  ]
}
