{
  "hadithId": 1256,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/21"],
    "kitabId": 16,
    "inKitabBab": 2,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 103
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (13)‏، ومسلم (45).",
    "urdu": "صحیح۔ اسے امام بخاری (13) اور امام مسلم (45) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (13) and Muslim (45)."
  },
  "importantWords": [
    {
      "arabic": "نَفْسِي بِيَدِهِ",
      "english": "My soul is in His Hand",
      "urdu": "میری جان اس کے ہاتھ (قدرت) میں ہے"
    },
    {
      "arabic": "لَا يُؤْمِنُ",
      "english": "Does not believe (fully)",
      "urdu": "مومن نہیں ہو سکتا (کامل ایمان نہیں)"
    },
    {
      "arabic": "لِجَارِهِ",
      "english": "For his neighbor",
      "urdu": "اپنے پڑوسی کے لیے"
    },
    {
      "arabic": "لِأَخِيهِ",
      "english": "For his brother",
      "urdu": "اپنے بھائی کے لیے"
    }
  ],
  "summary": {
    "urdu": "ایمانِ کامل کی شرط یہ ہے کہ انسان دوسروں کے لیے وہی خیر اور بھلائی چاہے جو وہ اپنے لیے پسند کرتا ہے۔ یہ حدیث اسلامی معاشرت میں بے غرضی اور ہمدردی کی بنیاد ہے۔",
    "english": "The condition for perfect faith is wishing for others the same good one wishes for oneself. This Hadith forms the basis of altruism and empathy in Islamic society."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الإيمان، رقم 13",
      "english": "Sahih al-Bukhari, Book of Faith, No. 13"
    },
    {
      "arabic": "صحيح مسلم، كتاب الإيمان، رقم 45",
      "english": "Sahih Muslim, Book of Faith, No. 45"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کمالِ ایمان کا معیار",
        "english": "The Criterion for Perfect Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمان اور اخلاق کا تعلق",
              "english": "The Link Between Faith and Ethics"
            },
            "content": {
              "urdu": [
                "حدیث میں ایمان کی نفی سے مراد 'کمالِ ایمان' کی نفی ہے، یعنی وہ شخص کامل مومن نہیں ہو سکتا۔",
                "اسلام صرف چند عبادات کا نام نہیں بلکہ یہ دوسروں کے ساتھ حسنِ سلوک کا نام بھی ہے۔",
                "دوسروں کے لیے وہی پسند کرنا جو اپنے لیے ہو، ایک مومن کے دل کی صفائی کی علامت ہے۔"
              ],
              "english": [
                "The negation of faith in the Hadith refers to the negation of 'perfect faith'.",
                "Islam is not just rituals; it encompasses how one treats others with kindness.",
                "Wishing for others what you wish for yourself indicates a heart free from malice."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس پرستی کا خاتمہ",
              "english": "Eradicating Egoism"
            },
            "content": {
              "urdu": [
                "یہ حدیث انسان کو خود غرضی اور انانیت سے نکال کر ایثار کی طرف لے جاتی ہے۔",
                "اگر ہم اپنے لیے سکون، رزق اور عزت چاہتے ہیں تو دوسروں کے لیے بھی یہی تمنا کرنی چاہیے۔",
                "حسد اور کینہ ایمان کے نور کو ختم کر دیتے ہیں، جبکہ یہ جذبہ اسے جلا بخشتا ہے۔"
              ],
              "english": [
                "This Hadith steers a person away from selfishness toward selflessness.",
                "If we desire peace, wealth, and honor for ourselves, we must desire it for others too.",
                "Envy and malice extinguish the light of faith, while this sentiment nourishes it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پڑوسی اور بھائی کے حقوق",
        "english": "Rights of Neighbors and Brothers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پڑوسی کی اہمیت",
              "english": "Importance of the Neighbor"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے پڑوسی کے حقوق پر اتنا زور دیا کہ صحابہ کو لگا شاید اسے وراثت میں حصہ دے دیا جائے گا۔",
                "پڑوسی کے دکھ سکھ میں شریک ہونا اور اسے اذیت سے بچانا ایمان کا حصہ ہے۔",
                "چاہے پڑوسی مسلم ہو یا غیر مسلم، اس کے ساتھ خیر خواہی کا معاملہ کرنا لازم ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) emphasized the neighbor's rights so much that Companions thought they might inherit property.",
                "Sharing in a neighbor's joys and sorrows and protecting them from harm is part of faith.",
                "Whether a neighbor is Muslim or non-Muslim, well-wishing toward them is mandatory."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی بھائی چارہ",
              "english": "Islamic Brotherhood"
            },
            "content": {
              "urdu": [
                "لفظ 'بھائی' میں تمام مسلمان شامل ہیں، چاہے وہ دنیا کے کسی بھی کونے میں ہوں۔",
                "امتِ مسلمہ ایک جسم کی مانند ہے، جس کے ایک حصے میں تکلیف ہو تو پورا جسم تڑپ اٹھتا ہے۔",
                "دوسروں کی کامیابی پر خوش ہونا اور ان کی ناکامی پر غمزدہ ہونا ایمانی تقاضا ہے۔"
              ],
              "english": [
                "The word 'brother' includes all Muslims globally, regardless of location.",
                "The Muslim Ummah is like one body; if one part hurts, the whole body feels the pain.",
                "Rejoicing in others' success and grieving their failures is a requirement of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد",
        "english": "Social Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امن اور ہم آہنگی",
              "english": "Peace and Harmony"
            },
            "content": {
              "urdu": [
                "جب ہر شخص دوسروں کا خیر خواہ بن جائے گا، تو معاشرے سے جرائم اور نفرتیں ختم ہو جائیں گی۔",
                "یہ اصول طبقاتی کشمکش کو ختم کرنے اور سماجی انصاف قائم کرنے میں مدد دیتا ہے۔",
                "ایثار و قربانی پر مبنی معاشرہ ہی مثالی اسلامی ریاست کی بنیاد بنتا ہے۔"
              ],
              "english": [
                "When everyone becomes a well-wisher for others, crimes and hatred disappear from society.",
                "This principle helps eliminate class conflict and establish social justice.",
                "A society built on altruism and sacrifice forms the foundation of an ideal Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی تعاون",
              "english": "Mutual Cooperation"
            },
            "content": {
              "urdu": [
                "دوسروں کی مدد کرنا درحقیقت اپنی آخرت کو سنوارنا ہے۔",
                "اللہ تعالیٰ اس بندے کی مدد میں رہتا ہے جب تک وہ اپنے بھائی کی مدد میں لگا رہتا ہے۔",
                "یہ حدیث ہمیں انفرادی زندگی سے نکال کر اجتماعی فلاح و بہبود کی فکر عطا کرتی ہے۔"
              ],
              "english": [
                "Helping others is, in reality, beautifying one's own Hereafter.",
                "Allah continues to help a servant as long as the servant is helping his brother.",
                "This Hadith transitions us from individualistic living to concern for collective welfare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خود احتسابی",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "ہمیں ہر فیصلے سے پہلے سوچنا چاہیے کہ کیا ہم دوسروں کے لیے وہی چاہ رہے ہیں جو اپنے لیے؟",
                "کاروبار، سیاست اور عام معاملات میں دیانت داری کا مظاہرہ کرنا اسی حدیث پر عمل ہے۔",
                "کسی کو دھوکہ دینا یا کسی کا حق مارنا کمالِ ایمان کے منافی عمل ہے۔"
              ],
              "english": [
                "Before every decision, we should ask: Am I wishing for others what I wish for myself?",
                "Demonstrating integrity in business, politics, and daily affairs is practicing this Hadith.",
                "Deceiving someone or usurping their rights contradicts the perfection of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا اسوہ",
              "english": "The Prophet's (ﷺ) Example"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے اپنی پوری زندگی دوسروں کی خیر خواہی اور خدمت میں گزاری۔",
                "آپ ﷺ نے بھوک برداشت کی لیکن دوسروں کو کھانا کھلایا، یہ ایثار کی معراج ہے۔",
                "اتباعِ سنت کا تقاضا ہے کہ ہم بھی اپنے اندر دوسروں کے لیے محبت اور تڑپ پیدا کریں۔"
              ],
              "english": [
                "The Prophet (ﷺ) spent his entire life in the well-wishing and service of others.",
                "He endured hunger to feed others, which is the pinnacle of altruism.",
                "Following the Sunnah requires developing love and concern for others within ourselves."
              ]
            }
          }
        ]
      }
    }
  ]
}