{
  "hadithId": 166,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["1:4:7"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (صلاة التطوع في السفر)",
    "babId": 13
  },
  
  "takhreej": {
    "arabic": "صحيح رواه البخاري (1093)‏ ، ومسلم (701)‏ وهذه الصلاة صلاة السبحة بالليل كما في رواية مسلم، وبعض روايات البخاري، واللفظ الذي ذكره الحافظ هنا هو لفظ البخاري .‏ هذه الزيادة للبخاري برقم (1097)‏ ، ويومئ برأسه أي في الركوع والسجود .‏ حسن .‏ رواه أبو داود (1225)‏ وصححه غير واحد .‏",
    "urdu": "صحیح۔ اسے بخاری (1093) اور مسلم (701) نے روایت کیا ہے۔ یہ نماز (سواری پر) رات کی نفل نماز (صلاة السبحة) تھی، جیسا کہ مسلم اور بعض بخاری کی روایات میں ہے۔ اور حافظ ابن حجر کا ذکر کردہ الفاظ بخاری کے ہیں۔ یہ اضافہ بخاری میں (1097) پر ہے، اور 'یومئ برأسه' (سر سے اشارہ کرتے) سے مراد رکوع اور سجدے میں اشارہ کرنا ہے۔ حسن۔ اسے ابو داؤد (1225) نے روایت کیا ہے اور ایک سے زائد محدثین نے اسے صحیح قرار دیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (1093) and Muslim (701). This prayer (on the mount) was the supererogatory prayer at night (Ṣalāt as-Subḥah), as mentioned in Muslim's and some Al-Bukhārī's narrations. The wording mentioned here by Al-Ḥāfiẓ is Al-Bukhārī's. This addition is in Al-Bukhārī (1097), and 'yuwmi'u bi ra'sih' (gestures with his head) means gesturing for bowing and prostration. Ḥasan (Good). Reported by Abu Dawud (1225) and authenticated by more than one scholar.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "عَلَى رَاحِلَتِهِ",
      "english": "Upon his mount",
      "urdu": "اپنی سواری پر"
    },
    {
      "arabic": "حَيْثُ تَوَجَّهَتْ بِهِ",
      "english": "Wherever it turned him",
      "urdu": "جس طرف بھی رخ کرتی"
    },
    {
      "arabic": "يُومِئُ بِرَأْسِهِ",
      "english": "He gestures with his head",
      "urdu": "وہ سر سے اشارہ کرتے"
    },
    {
      "arabic": "اَلْمَكْتُوبَةِ",
      "english": "The prescribed/obligatory prayer",
      "urdu": "فرض نماز"
    },
    {
      "arabic": "يَتَطَوَّعَ",
      "english": "To perform a supererogatory prayer (Nafl)",
      "urdu": "نفل نماز پڑھنا چاہتے"
    },
    {
      "arabic": "اِسْتَقْبَلَ بِنَاقَتِهِ اَلْقِبْلَةِ",
      "english": "He turned his she-camel towards the Qiblah",
      "urdu": "اپنی اونٹنی کا رخ قبلہ کی طرف کرتے"
    },
    {
      "arabic": "وَجْهَ رِكَابِهِ",
      "english": "The direction of his mount's travel",
      "urdu": "سواری کا رخ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سفر کے دوران نفل نماز ادا کرنے کے ایک خصوصی حکم کو بیان کرتی ہے: نبی اکرم صلی اللہ علیہ وسلم اپنی سواری پر سوار ہو کر بھی نفل نماز ادا فرما لیتے تھے، اور آپ کی سواری کا رخ جس طرف بھی ہوتا، نماز درست ہوتی تھی۔ یہ عمل سر سے اشارہ کر کے کیا جاتا تھا، اور یہ صرف نفل نمازوں کے لیے تھا، نہ کہ فرض نمازوں کے لیے۔ نیز، نفل نماز کا آغاز کرتے وقت ایک بار سواری کا رخ قبلہ کی طرف کرنا سنت ہے۔",
    "english": "This Hadith describes a special ruling for performing supererogatory (Nafl) prayers during travel: The Prophet (ﷺ) would perform voluntary prayers while mounted on his animal, and the prayer was valid regardless of the direction the animal was facing. This was done by gesturing with the head for bowing and prostration, and it was restricted to voluntary prayers, not obligatory ones. Furthermore, it is Sunnah to face the Qiblah just for the opening Takbīr of the voluntary prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1093) عن عامر بن ربيعة",
      "english": "Reported by Al-Bukhārī (1093) from 'Āmir ibn Rabī'ah"
    },
    {
      "arabic": "رواه مسلم (701) عن عامر بن ربيعة",
      "english": "Reported by Muslim (701) from 'Āmir ibn Rabī'ah"
    },
    {
      "arabic": "رواه أبو داود (1225) عن أنس",
      "english": "Reported by Abu Dawud (1225) from Anas"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عامر بن ربيعة",
        "english": "Āmir ibn Rabī'ah"
      },
      "slug": "amir-ibn-rabiah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Mālik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "صحيح وحسن",
    "english": "Authentic (Ṣaḥīḥ) and Good (Ḥasan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سواری پر نفل نماز کے احکام",
        "english": "Rulings on Voluntary Prayer on a Mount"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صرف نفل کے لیے اجازت",
              "english": "Permission Only for Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے سواری پر نماز کو صرف نفل (تطوع) تک محدود رکھا، فرض (مکتوبہ) نماز کے لیے نہیں۔",
                "فرض نماز میں کھڑا ہونا اور قبلہ کی طرف رخ کرنا ضروری ہے، جو سواری کی حالت میں ممکن نہیں۔",
                "یہ حکم نفل نماز میں آسانی اور لوگوں کو زیادہ سے زیادہ عبادت کا موقع فراہم کرنے کے لیے دیا گیا۔"
              ],
              "english": [
                "The Prophet (ﷺ) restricted praying on a mount to supererogatory (Taṭawwu') prayers, excluding obligatory (Maktūbah) prayers.",
                "Standing and facing the Qiblah are essential for obligatory prayers, which are not feasible while mounted and traveling.",
                "This ruling grants ease in voluntary prayer and encourages people to perform more acts of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "سر سے اشارہ کرنا",
              "english": "Gesturing with the Head"
            },
            "content": {
              "urdu": [
                "نفل نماز میں رکوع اور سجدہ کے لیے سر سے اشارہ کیا جاتا تھا، جس میں سجدہ کا اشارہ رکوع سے زیادہ جھکا کر کیا جائے۔",
                "یہ اشارہ اصلی رکوع اور سجدے کا قائم مقام ہوتا ہے اور سواری پر نماز کا طریقہ ہے۔",
                "سر سے اشارہ صرف عذر کی حالت میں یا سواری پر نفل نماز کے لیے جائز ہے۔"
              ],
              "english": [
                "In voluntary prayer, bowing (Rukū') and prostration (Sujūd) were performed by gesturing with the head, with the gesture for prostration being lower than that for bowing.",
                "This gesture substitutes the actual Rukū' and Sujūd and is the method of praying on a mount.",
                "Gesturing with the head is only permissible in case of necessity or for voluntary prayers while riding."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبلہ کا استقبال اور نیت",
        "english": "Facing the Qiblah and Intention"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفل نماز کا آغاز",
              "english": "Beginning the Voluntary Prayer"
            },
            "content": {
              "urdu": [
                "انسؓ کی حدیث کے مطابق، نفل نماز شروع کرتے وقت تکبیر تحریمہ کے لیے سواری کا رخ قبلہ کی طرف کرنا مستحب ہے۔",
                "ایک بار قبلہ کا رخ کرنے کے بعد سواری جس طرف بھی چلی جائے، نماز جاری رکھنا جائز ہے۔",
                "نفل نماز میں آغاز کے بعد قبلہ سے انحراف معاف ہے، لیکن ابتداء میں استقبال کرنا کمال ہے۔"
              ],
              "english": [
                "According to Anas's Hadith, it is recommended (Mustaḥabb) to turn the mount towards the Qiblah for the opening Takbīr of the voluntary prayer.",
                "After facing the Qiblah once, the prayer remains valid even if the mount subsequently turns in any direction.",
                "Deviation from the Qiblah after the start is excused in Nafl prayer, but facing it initially completes the act."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرض نماز کے لیے حکم",
              "english": "Ruling for Obligatory Prayer"
            },
            "content": {
              "urdu": [
                "فرض نماز کے لیے ہر حال میں سواری سے اتر کر زمین پر کھڑے ہو کر اور قبلہ کی طرف رخ کر کے پڑھنا فرض ہے۔",
                "صرف اس صورت میں سواری پر فرض نماز پڑھی جا سکتی ہے جب اترنے کی صورت میں جانی یا مالی نقصان کا شدید خطرہ ہو۔",
                "فرض نماز میں اشارہ کر کے پڑھنا صرف اس شخص کے لیے جائز ہے جو شدید بیماری کی وجہ سے رکوع و سجدہ نہ کر سکے۔"
              ],
              "english": [
                "For obligatory prayers, it is mandatory to dismount the animal, stand on the ground, and face the Qiblah in all circumstances.",
                "Praying the obligatory prayer on a mount is only permissible if there is a serious fear of physical or financial harm upon dismounting.",
                "Gesturing for obligatory prayer is only allowed for a person who cannot perform Rukū' and Sujūd due to severe illness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور فقہی فوائد",
        "english": "Training and Juristic Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں آسانی",
              "english": "Ease in Worship"
            },
            "content": {
              "urdu": [
                "نفل نماز میں یہ رخصت سفر میں بھی عبادت کو جاری رکھنے کی ترغیب دیتی ہے اور مشقت کو کم کرتی ہے۔",
                "اسلام میں فرائض میں سختی اور نوافل میں آسانی کا اصول اس حدیث سے واضح ہوتا ہے۔",
                "مسلمان کو اس آسانی سے فائدہ اٹھانا چاہیے اور سفر میں بھی نوافل کا اہتمام کرنا چاہیے۔"
              ],
              "english": [
                "This concession for voluntary prayer encourages continuous worship during travel and alleviates hardship.",
                "The principle of strictness in obligatory prayers and ease in voluntary ones is evident from this Hadith.",
                "A Muslim should benefit from this ease and be diligent in performing voluntary prayers even while traveling."
              ]
            }
          },
          {
            "title": {
              "urdu": "رکوع و سجدہ کی اہمیت",
              "english": "Importance of Rukū' and Sujūd"
            },
            "content": {
              "urdu": [
                "فرض نماز میں رکوع و سجدہ کا عدم ترک یہ ظاہر کرتا ہے کہ وہ نماز کے بنیادی ارکان ہیں۔",
                "نفل میں اشارہ کی اجازت اس بات کی دلیل ہے کہ نماز میں ان ارکان کو ادا کرنا ضروری ہے، اگر ممکن نہ ہو تو اشارہ کافی ہے۔",
                "یہ حکم نفل نماز میں عذر کی صورت میں رکوع و سجدہ کے لیے اشارہ کرنے کے جواز کو ثابت کرتا ہے۔"
              ],
              "english": [
                "The non-abandonment of Rukū' and Sujūd in obligatory prayers shows they are fundamental pillars of the prayer.",
                "The permission to gesture in voluntary prayers proves that performing these pillars is necessary, but gesturing suffices when unable to perform them fully.",
                "This ruling validates gesturing for Rukū' and Sujūd in voluntary prayer when there is a valid excuse."
              ]
            }
          }
        ]
      }
    }
  ]
}
