{
  "hadithId": 1272,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/37"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "الجامع - باب الزهد والورع",
    "babId": 104
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2965).",
    "urdu": "صحیح۔ اسے امام مسلم (2965) نے اپنی صحیح میں روایت کیا ہے۔ یہ حدیث فتنوں کے زمانے میں گوشہ نشینی اور تقویٰ کی فضیلت پر دلالت کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (2965). This Hadith highlights the virtue of piety and avoiding fame, especially during times of social upheaval."
  },
  "importantWords": [
    {
      "arabic": "اَلتَّقِيَّ",
      "english": "Pious / God-fearing",
      "urdu": "پرہیزگار / متقی"
    },
    {
      "arabic": "اَلْغَنِيَّ",
      "english": "Rich (in soul/contentment)",
      "urdu": "غنی / بے نیاز / قناعت پسند"
    },
    {
      "arabic": "اَلْخَفِيَّ",
      "english": "Hidden / Anonymous",
      "urdu": "گمنام / جو شہرت سے بچے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اللہ کے تین پسندیدہ اوصاف بیان کیے گئے ہیں: اللہ سے ڈرنا، نفس کی بے نیازی (قناعت) اور دکھاوے یا شہرت کے بجائے خاموشی سے اللہ کی عبادت کرنا۔",
    "english": "This Hadith identifies three traits beloved by Allah: piety (Taqwa), self-sufficiency/contentment of the heart, and remaining obscure to avoid pride and fame."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الزهد والرقائق، رقم 2965",
      "english": "Sahih Muslim, Book of Asceticism and Heart-Melters, No. 2965"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعد بن أبي وقاص",
        "english": "Sa'd bin Abi Waqqas"
      },
      "slug": "sa-d-bin-abi-waqqas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پسندیدہ بندے کی صفات",
        "english": "Characteristics of the Beloved Servant"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تقویٰ: بنیادِ عمل",
              "english": "Taqwa: The Foundation"
            },
            "content": {
              "urdu": [
                "تقویٰ کا مطلب اللہ کی نافرمانی سے بچنا اور اس کے احکامات پر عمل کرنا ہے۔",
                "یہ تمام نیکیوں کی جڑ ہے اور اللہ کے ہاں معیارِ عزت ہے۔",
                "متقی بندہ تنہائی میں بھی اللہ سے ویسے ہی ڈرتا ہے جیسے محفل میں۔"
              ],
              "english": [
                "Taqwa means guarding oneself against Allah's disobedience and following His commands.",
                "It is the root of all virtues and the standard of honor in the sight of Allah.",
                "A pious servant fears Allah in private just as they do in public."
              ]
            }
          },
          {
            "title": {
              "urdu": "غنی: دل کی بے نیازی",
              "english": "Ghani: Contentment of the Heart"
            },
            "content": {
              "urdu": [
                "اس سے مراد مال کی کثرت نہیں بلکہ 'نفس کا غنی' ہونا ہے، یعنی جو میسر ہے اس پر راضی رہنا۔",
                "ایسا شخص لوگوں کے سامنے ہاتھ پھیلانے سے بچتا ہے اور صرف اللہ پر بھروسہ کرتا ہے۔",
                "قناعت انسان کو حرص اور لالچ جیسی بیماریوں سے محفوظ رکھتی ہے۔"
              ],
              "english": [
                "This does not refer to material wealth but to 'wealth of the soul'—being satisfied with what one has.",
                "Such a person avoids begging or relying on people, placing their trust solely in Allah.",
                "Contentment protects a person from the diseases of greed and envy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گمنامی اور اخلاص",
        "english": "Anonymity and Sincerity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شہرت سے گریز",
              "english": "Avoiding Fame"
            },
            "content": {
              "urdu": [
                "'خفی' وہ بندہ ہے جو شہرت اور منصب کی طلب نہیں رکھتا اور اپنے نیک اعمال کو چھپاتا ہے۔",
                "شہرت پسندی اکثر انسان کو ریاکاری (دکھاوے) میں مبتلا کر دیتی ہے جو نیکیوں کو برباد کر دیتی ہے۔",
                "اللہ کو وہ عمل زیادہ پسند ہے جو خالص اسی کے لیے ہو اور جس میں نمود و نمائش نہ ہو۔"
              ],
              "english": [
                "The 'hidden' (Khafi) person is one who does not seek fame or status and hides their good deeds.",
                "The pursuit of fame often leads to ostentation (Riya'), which destroys the reward of good deeds.",
                "Allah loves deeds performed purely for Him, free from the desire for public recognition."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیاق و سباق اور حکمت",
        "english": "Context and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتنوں سے بچاؤ",
              "english": "Protection from Trials"
            },
            "content": {
              "urdu": [
                "سعد بن ابی وقاص رضی اللہ عنہ نے یہ حدیث اس وقت سنائی جب مسلمانوں میں سیاسی اختلافات چل رہے تھے۔",
                "آپ نے گوشہ نشینی اختیار کی تاکہ کسی فتنے کا حصہ نہ بنیں اور خاموشی سے اللہ کی عبادت کریں۔",
                "یہ حدیث سکھاتی ہے کہ جب معاشرے میں برائی عام ہو جائے تو اپنی ذات کی اصلاح اور گمنامی میں عافیت ہے۔"
              ],
              "english": [
                "Sa'd bin Abi Waqqas narrated this when there were political disputes among Muslims.",
                "He chose isolation to avoid being part of the turmoil, focusing quietly on worshipping Allah.",
                "The Hadith teaches that when corruption is widespread, focus on self-reform and obscurity is a safety."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیتوں کی پاکیزگی",
              "english": "Purity of Intentions"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی عبادتوں کو صرف اللہ کے لیے خالص کریں اور لوگوں کی واہ واہ کی تمنا نہ کریں۔",
                "تھوڑے مال پر صبر اور شکر کرنا ہمیں اللہ کا محبوب بنا سکتا ہے۔",
                "سچی کامیابی سماجی رتبے میں نہیں بلکہ اللہ کی محبت اور تقویٰ میں ہے۔"
              ],
              "english": [
                "We should purify our worship for Allah alone and not crave the applause of people.",
                "Being patient and grateful with little wealth can make us beloved to Allah.",
                "True success is not in social status but in Allah's love and piety."
              ]
            }
          }
        ]
      }
    }
  ]
}