{
  "hadithId": 1222,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/15/3"],
    "kitabId": 15,
    "inKitabBab": 1,
    "arabicBook": "كتاب العتق",
    "babId": 100
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2522)، ومسلم (1501). ورواية السعاية عند البخاري (2527) ومسلم (1503).",
    "urdu": "صحیح۔ اسے بخاری (2522) اور مسلم (1501) نے روایت کیا ہے۔ سعایہ (غلام کی محنت سے آزادی) والی زیادتی بھی بخاری اور مسلم میں ثابت ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2522) and Muslim (1501). The addition regarding 'Sa'aya' (work for freedom) is in Al-Bukhari (2527) and Muslim (1503)."
  },
  "importantWords": [
    {
      "arabic": "شِرْكًا",
      "english": "Share / Portion",
      "urdu": "حصہ / شرکت"
    },
    {
      "arabic": "قُوِّمَ",
      "english": "Valued / Appraised",
      "urdu": "قیمت لگائی جائے گی"
    },
    {
      "arabic": "قِيمَةَ عَدْلٍ",
      "english": "Fair price",
      "urdu": "انصاف پر مبنی قیمت"
    },
    {
      "arabic": "خَلَاصُه",
      "english": "Full liberation",
      "urdu": "مکمل آزادی"
    },
    {
      "arabic": "اسْتُسْعِيَ",
      "english": "Made to work for freedom",
      "urdu": "محنت مزدوری کروانا"
    },
    {
      "arabic": "مَشْقُوقٍ",
      "english": "Overburdened",
      "urdu": "مشقت / تنگی"
    }
  ],
  "summary": {
    "urdu": "اگر کوئی شخص مشترکہ غلام میں اپنا حصہ آزاد کرے تو اسے چاہیے کہ باقی شرکاء کو قیمت دے کر مکمل آزاد کرے، ورنہ غلام کو محنت کر کے اپنی قیمت ادا کرنے کا موقع دیا جائے۔",
    "english": "If a person frees their share in a jointly owned slave, they must pay the other partners to ensure full freedom, or the slave is allowed to work to pay off the remaining value."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب العتق، رقم 2522",
      "english": "Sahih al-Bukhari, Book of Emancipation, No. 2522"
    },
    {
      "arabic": "صحيح مسلم، كتاب العتق، رقم 1501",
      "english": "Sahih Muslim, Book of Emancipation, No. 1501"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آزادی کی سرایت اور کفالت",
        "english": "Contagion and Guarantee of Freedom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آزادی کی تقسیم کا عمل",
              "english": "The Process of Partitioned Freedom"
            },
            "content": {
              "urdu": [
                "اسلام میں آزادی ایک ایسی صفت ہے جو تقسیم نہیں ہوتی بلکہ پورے جسم میں سرایت کر جاتی ہے۔",
                "اگر ایک شریک اپنا حصہ آزاد کرتا ہے تو شریعت اسے مکمل آزادی کی طرف لے جانا چاہتی ہے۔",
                "یہ اصول اس بات کی ضمانت ہے کہ غلامی کا بوجھ جلد از جلد ختم کیا جائے۔"
              ],
              "english": [
                "In Islam, freedom is a quality that is not partitioned but spreads to the entire body.",
                "If one partner frees their share, Sharia aims to transition toward total liberation.",
                "This principle ensures that the burden of slavery is eliminated as quickly as possible."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالدار شریک کی ذمہ داری",
              "english": "Responsibility of the Wealthy Partner"
            },
            "content": {
              "urdu": [
                "اگر حصہ آزاد کرنے والا صاحبِ مال ہو، تو اس پر واجب ہے کہ وہ دوسرے شرکاء کا نقصان پورا کرے۔",
                "انصاف کی قیمت (قیمۃ عدل) مقرر کرنا ضروری ہے تاکہ کسی شریک کے ساتھ زیادتی نہ ہو۔",
                "یہ حکم مالی ذمہ داری اور انسانی ہمدردی کے توازن کو برقرار رکھتا ہے۔"
              ],
              "english": [
                "If the partner who frees a share is wealthy, they must compensate the other partners.",
                "Setting a fair value (Qimat-e-Adl) is necessary to ensure no partner is wronged.",
                "This ruling maintains a balance between financial responsibility and human compassion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سعایہ (غلام کی محنت) کا ضابطہ",
        "english": "The Regulation of Sa'aya (Work)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلام کو خود مختاری دینا",
              "english": "Empowering the Slave"
            },
            "content": {
              "urdu": [
                "اگر آزاد کرنے والے کے پاس مال نہ ہو تو غلام کو اپنی باقی قیمت کمانے کی اجازت دی جاتی ہے۔",
                "اسے 'سعایہ' کہا جاتا ہے جس میں غلام محنت کر کے دوسرے شرکاء کو ان کا حق دیتا ہے۔",
                "اس سے غلام کو یہ احساس ملتا ہے کہ وہ اپنی آزادی خود حاصل کر سکتا ہے۔"
              ],
              "english": [
                "If the emancipator lacks wealth, the slave is allowed to earn the remaining price.",
                "This is called 'Sa'aya', where the slave works to pay the other partners their due.",
                "This gives the slave a sense of agency in securing their own freedom."
              ]
            }
          },
          {
            "title": {
              "urdu": "بغیر مشقت کے محنت",
              "english": "Labor Without Hardship"
            },
            "content": {
              "urdu": [
                "حدیث میں 'غیر مشقوق علیہ' کی شرط ہے کہ غلام پر اس کی طاقت سے زیادہ بوجھ نہ ڈالا جائے۔",
                "آزادی کے عمل میں کسی بھی طرح کا ظلم یا جسمانی اذیت اسلام میں ممنوع ہے۔",
                "یہ شریعت کی اس رحمت کو ظاہر کرتا ہے جو غلاموں کے حقوق کی محافظ ہے۔"
              ],
              "english": [
                "The Hadith specifies 'without hardship', meaning the slave shouldn't be overburdened.",
                "Any form of oppression or physical distress in the liberation process is forbidden in Islam.",
                "This reflects the mercy of Sharia, which acts as a guardian for the rights of slaves."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب کے اختلافات",
        "english": "Differences Among Juristic Schools"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احناف اور شوافع کا موقف",
              "english": "Positions of Hanafis and Shafi'is"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک سعایہ ایک مضبوط شرعی اصول ہے جس پر اس حدیث سے دلیل لی جاتی ہے۔",
                "امام شافعی کے نزدیک اگر آزاد کرنے والا غریب ہو تو صرف اس کا حصہ ہی آزاد ہوگا (تجزئ)۔",
                "یہ فقہی بحث روایات کے مختلف طریقوں اور ان کی تشریح پر مبنی ہے۔"
              ],
              "english": [
                "Hanafis consider Sa'aya a strong legal principle based on the evidence of this Hadith.",
                "According to Imam Shafi'i, if the emancipator is poor, only their share is freed (Tazaj'i).",
                "This juristic debate is based on different chains of narration and their interpretations."
              ]
            }
          },
          {
            "title": {
              "urdu": "انصاف کی قیمت کا تعین",
              "english": "Determining the Fair Price"
            },
            "content": {
              "urdu": [
                "تمام فقہاء اس بات پر متفق ہیں کہ قیمت کا تعین بازار کے موجودہ نرخوں کے مطابق ہو۔",
                "مقصد یہ ہے کہ باقی شرکاء کو ان کا مالی نقصان نہ اٹھانا پڑے۔",
                "اسلامی معاشرت میں نجی ملکیت اور انفرادی آزادی دونوں کا احترام ملحوظ رکھا گیا ہے۔"
              ],
              "english": [
                "All jurists agree that the valuation should follow current market rates.",
                "The goal is to ensure the remaining partners do not suffer financial loss.",
                "In Islamic society, both private property and individual freedom are respected."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی و اخلاقی پہلو",
        "english": "Social and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلامی سے مکمل نجات",
              "english": "Complete Liberation from Bondage"
            },
            "content": {
              "urdu": [
                "اسلام کا حتمی مقصد انسان کو انسان کی غلامی سے نکال کر اللہ کی بندگی میں لانا ہے۔",
                "ایسے پیچیدہ قوانین اس لیے بنائے گئے تاکہ آزادی کے راستے میں رکاوٹیں کم ہوں۔",
                "آدھی آزادی کے بجائے مکمل آزادی کو ترجیح دینا معاشرتی وقار کا تقاضا ہے۔"
              ],
              "english": [
                "The ultimate goal of Islam is to bring humans out of bondage into the service of Allah.",
                "Complex laws were established to minimize barriers in the path of freedom.",
                "Prioritizing full freedom over partial freedom is a requirement of social dignity."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحاد اور مالی دیانت",
              "english": "Unity and Financial Integrity"
            },
            "content": {
              "urdu": [
                "مشترکہ جائیداد میں کسی ایک کا فیصلہ دوسروں پر اثر انداز ہوتا ہے، جس میں دیانت ضروری ہے۔",
                "یہ حدیث سکھاتی ہے کہ نیکی کا عمل دوسروں کے حقوق غصب کر کے نہیں کیا جا سکتا۔",
                "مالی معاملات میں صفائی اور شفافیت اسلامی معاشرے کا خاصہ ہے۔"
              ],
              "english": [
                "In joint property, one person's decision affects others, necessitating integrity.",
                "This Hadith teaches that acts of virtue cannot be done by usurping the rights of others.",
                "Clarity and transparency in financial dealings are hallmarks of an Islamic society."
              ]
            }
          }
        ]
      }
    }
  ]
}