{
  "hadithId": 561,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh/561"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 34
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1144). وأخرجه البخاري (1985) بنحوه في النهي عن صيام الجمعة منفرداً.",
    "urdu": "صحیح۔ اسے مسلم (1144) نے روایت کیا ہے۔ بخاری (1985) میں بھی تنہا جمعہ کے دن روزہ رکھنے کی ممانعت مروی ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (1144). Al-Bukhari (1985) also reported a similar meaning regarding the prohibition of fasting on Friday alone."
  },
  "importantWords": [
    {
      "arabic": "لَا تَخْتَصُّوا",
      "english": "Do not single out",
      "urdu": "تم مخصوص نہ کرو"
    },
    {
      "arabic": "قِيَامٍ",
      "english": "Standing (in prayer)",
      "urdu": "عبادت کے لیے کھڑا ہونا"
    },
    {
      "arabic": "بَيْنِ",
      "english": "Between / Among",
      "urdu": "درمیان"
    },
    {
      "arabic": "إِلَّا",
      "english": "Except",
      "urdu": "مگر / سوائے"
    },
    {
      "arabic": "صِيَامٍ",
      "english": "Fasting",
      "urdu": "روزہ رکھنا"
    },
    {
      "arabic": "لَيْلَةَ",
      "english": "Night",
      "urdu": "رات"
    }
  ],
  "summary": {
    "urdu": "جمعہ کے دن کو تنہا نفلی روزے کے لیے یا جمعہ کی رات کو خصوصی طور پر قیامِ لیل کے لیے مخصوص کرنا منع ہے، تاکہ دین میں بدعت پیدا نہ ہو اور غلو سے بچا جا سکے۔",
    "english": "It is prohibited to specify Friday for fasting alone or Friday night for night prayers exclusively, to prevent innovation in religion and religious extremism."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1144)",
      "english": "Reported by Muslim (1144)"
    },
    {
      "arabic": "رواه البخاري (1985)",
      "english": "Reported by Al-Bukhari (1985)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9_mK02-v6w",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کے دن کی تخصیص کی ممانعت",
        "english": "Prohibition of Specifying Friday"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزے کی ممانعت کی وجہ",
              "english": "Reason for Fasting Prohibition"
            },
            "content": {
              "urdu": [
                "جمعہ کا دن مومنین کے لیے عید کا دن ہے، اور عید کے دن روزہ نہیں رکھا جاتا۔",
                "مسلمانوں کو اس دن نمازِ جمعہ اور ذکر و اذکار کے لیے ترو تازہ رہنا چاہیے۔",
                "تنہا جمعہ کا روزہ رکھنا اس لیے ناپسندیدہ ہے تاکہ لوگ اسے فرض نہ سمجھنے لگیں۔"
              ],
              "english": [
                "Friday is a day of celebration (Eid) for believers, and fasting is generally not done on Eid.",
                "Muslims should remain energetic for the Friday prayer and for the remembrance of Allah.",
                "Fasting on Friday alone is disliked so people do not mistakenly regard it as an obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیامِ لیل کی تخصیص",
              "english": "Specifying Night Prayer"
            },
            "content": {
              "urdu": [
                "عبادت میں مداومت ہونی چاہیے، صرف ایک مخصوص رات کو جاگنا اور باقی راتیں غافل رہنا درست نہیں۔",
                "نبی ﷺ نے کسی بھی دن یا رات کو اپنی طرف سے مخصوص فضیلت دینے سے روکا ہے۔",
                "جمعہ کی رات کی اپنی فضیلت ہے (درود پاک پڑھنا وغیرہ)، مگر اسے خاص نماز کے لیے مخصوص کرنا منع ہے۔"
              ],
              "english": [
                "Consistency is key in worship; staying awake for one specific night while neglecting others is incorrect.",
                "The Prophet (ﷺ) forbade assigning specific ritual virtues to days/nights without divine evidence.",
                "Friday night has its own virtues (e.g., reciting Salawat), but singling it out for a special prayer is forbidden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استثنائی صورتیں",
        "english": "Exceptional Circumstances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عادی روزے",
              "english": "Regular Fasts"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص ایک دن چھوڑ کر ایک دن روزہ (صومِ داؤدی) رکھتا ہو اور جمعہ کا دن آ جائے تو وہ روزہ رکھ سکتا ہے۔",
                "اگر کسی نے نذر مانی ہو یا قضا روزہ رکھنا ہو تو وہ جمعہ کے دن رکھا جا سکتا ہے۔",
                "اسی طرح اگر جمعہ کے ساتھ جمعرات یا ہفتہ کا روزہ ملا لیا جائے تو ممانعت ختم ہو جاتی ہے۔"
              ],
              "english": [
                "If someone observes the fast of Dawud (alternate days) and it falls on a Friday, they may fast.",
                "If someone has a vow (Nadhr) or a make-up (Qada) fast, it is permissible to observe it on Friday.",
                "Likewise, if one joins Thursday or Saturday with the Friday fast, the prohibition is lifted."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایامِ بیض اور عرفہ",
              "english": "Ayyam al-Bid and Arafah"
            },
            "content": {
              "urdu": [
                "اگر ایامِ بیض (13، 14، 15) میں سے کوئی دن جمعہ ہو، تو اس کا روزہ رکھنا جائز ہے۔",
                "اسی طرح اگر یومِ عرفہ یا یومِ عاشورہ جمعہ کے دن آ جائے، تو اسے تنہا رکھا جا سکتا ہے۔",
                "ممانعت صرف اس وقت ہے جب نیت خاص 'جمعہ کی تعظیم' کے لیے تنہا روزہ رکھنے کی ہو۔"
              ],
              "english": [
                "If one of the White Days (13th, 14th, 15th) falls on a Friday, fasting is permissible.",
                "Similarly, if the Day of Arafah or Ashura falls on a Friday, one may fast it individually.",
                "The prohibition only applies when the intention is specifically to fast 'Friday alone' for its own sake."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عبادت میں میانہ روی",
        "english": "Moderation in Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلو سے بچاؤ",
              "english": "Avoiding Extremism"
            },
            "content": {
              "urdu": [
                "شریعت نے عبادات کے اوقات مقرر کیے ہیں تاکہ انسان انتہا پسندی کا شکار نہ ہو۔",
                "اپنی طرف سے نئی عبادات گھڑنا 'بدعت' کی طرف لے جاتا ہے۔",
                "سنت کی پیروی میں ہی اصل کامیابی اور اللہ کی رضا چھپی ہے۔"
              ],
              "english": [
                "Shariah has set timings for worship so that individuals do not fall into extremism.",
                "Inventing new rituals on one's own leads to 'Bid'ah' (innovation).",
                "True success and Allah's pleasure lie solely in following the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمعہ کے دن کے مسنون اعمال",
              "english": "Sunnah Acts for Friday"
            },
            "content": {
              "urdu": [
                "جمعہ کے دن روزہ رکھنے کے بجائے غسل کرنا، خوشبو لگانا اور سورہ کہف پڑھنا مسنون ہے۔",
                "اس دن کثرت سے درود شریف پڑھنے کی تاکید کی گئی ہے۔",
                "ان اعمال پر توجہ دینا جمعہ کی تخصیصِ روزہ سے زیادہ افضل ہے۔"
              ],
              "english": [
                "Instead of fasting, it is Sunnah to bathe, apply perfume, and recite Surah al-Kahf on Friday.",
                "Increasing the recitation of Salawat (blessings upon the Prophet) is highly encouraged on this day.",
                "Focusing on these acts is superior to singling out Friday for a voluntary fast."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباعِ رسول ﷺ",
              "english": "Following the Messenger ﷺ"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کو اپنی خواہشات کے بجائے رسول اللہ ﷺ کے حکم کا پابند ہونا چاہیے۔",
                "نیکی وہ ہے جو اللہ اور اس کے رسول ﷺ نے بتائی ہو، نہ کہ وہ جو ہمیں اچھی لگے۔",
                "روک دیے جانے والے کاموں سے رکنا بھی عبادت کا حصہ ہے۔"
              ],
              "english": [
                "A Muslim must be bound by the commands of the Prophet ﷺ rather than their own desires.",
                "Goodness is what Allah and His Messenger ﷺ have defined, not what we perceive as good.",
                "Abstaining from forbidden acts is as much a part of worship as performing commanded ones."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم کی اہمیت",
              "english": "Importance of Knowledge"
            },
            "content": {
              "urdu": [
                "عبادت سے پہلے علم حاصل کرنا ضروری ہے تاکہ عمل صحیح ہو سکے۔",
                "بغیر علم کے عبادت کرنا انسان کو گمراہی یا بدعت میں ڈال سکتا ہے۔",
                "علماء سے مسائل پوچھ کر عمل کرنا ہی صراطِ مستقیم ہے۔"
              ],
              "english": [
                "Acquiring knowledge before worship is essential so that the action is correct.",
                "Worshipping without knowledge can lead a person into misguidance or innovation.",
                "Acting upon issues after consulting scholars is the essence of the Straight Path."
              ]
            }
          }
        ]
      }
    }
  ]
}