{
  "hadithId": 1239,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:2184a"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "كتاب السلام",
    "babId": 102
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (6290)‏، ومسلم (2184)‏.",
    "urdu": "یہ حدیث صحیح اور متفق علیہ ہے۔ اسے امام بخاری (6290) اور امام مسلم (2184) نے روایت کیا ہے۔",
    "english": "Sahih. Muttafaqun 'Alayh. Reported by Al-Bukhari (6290) and Muslim (2184)."
  },
  "importantWords": [
    {
      "arabic": "يَتَنَاجَى",
      "english": "Whisper / Secret talk",
      "urdu": "سرگوشی کرنا"
    },
    {
      "arabic": "دُونَ",
      "english": "To the exclusion of",
      "urdu": "چھوڑ کر / علاوہ"
    },
    {
      "arabic": "تَخْتَلِطُوا",
      "english": "Mingle / Mix",
      "urdu": "گھل مل جاؤ"
    },
    {
      "arabic": "يُحْزِنُهُ",
      "english": "Grieves him",
      "urdu": "اسے غمگین کرتا ہے"
    },
    {
      "arabic": "ثَلَاثَةً",
      "english": "Three",
      "urdu": "تین"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سماجی آداب سکھائے گئے ہیں کہ تین افراد کی موجودگی میں دو کا الگ بات کرنا تیسرے کی دل آزاری کا باعث ہے، اس لیے اس سے منع کیا گیا ہے۔",
    "english": "This Hadith teaches social etiquette, prohibiting two people from whispering in the presence of a third, as it causes feelings of exclusion and sadness."
  },
  "references": [
    {
      "arabic": "رواه البخاري (6290)",
      "english": "Reported by Al-Bukhari (6290)"
    },
    {
      "arabic": "رواه مسلم (2184)",
      "english": "Reported by Muslim (2184)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah bin Mas'ud"
      },
      "slug": "abdullah-bin-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7v68sXyV0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سماجی آداب اور اخلاقیات",
        "english": "Social Etiquette and Morals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیسرے فرد کی دل آزاری",
              "english": "Grieving the Third Person"
            },
            "content": {
              "urdu": [
                "تین میں سے دو کا سرگوشی کرنا تیسرے کو تنہائی کا احساس دلاتا ہے۔",
                "وہ شخص یہ سوچ سکتا ہے کہ شاید اس کے خلاف کوئی بات ہو رہی ہے۔",
                "اسلام ہر اس عمل سے روکتا ہے جو باہمی نفرت یا شک کا باعث بنے۔"
              ],
              "english": [
                "Whispering between two when only three are present causes feelings of exclusion.",
                "The excluded person might suspect that they are being talked about negatively.",
                "Islam prohibits any action that fosters mutual hatred or suspicion among believers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی معاشرت کا حسن",
              "english": "The Beauty of Islamic Social Life"
            },
            "content": {
              "urdu": [
                "یہ حدیث ظاہر کرتی ہے کہ اسلام دوسروں کے جذبات کا کتنا خیال رکھتا ہے۔",
                "معاشرتی تعلقات میں شفافیت اور برابری کو اہمیت دی گئی ہے۔",
                "دوستوں کی محفل میں ہر ایک کو توجہ دینا اخلاق کا حصہ ہے۔"
              ],
              "english": [
                "This Hadith demonstrates how Islam values the feelings of every individual.",
                "Transparency and equality are emphasized within social relationships.",
                "Giving attention to everyone in a gathering is a core part of good character."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حدود و قیود",
        "english": "Juristic Boundaries and Rules"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممانعت کی شرائط",
              "english": "Conditions of Prohibition"
            },
            "content": {
              "urdu": [
                "یہ ممانعت اس وقت ہے جب صرف تین لوگ ایک ساتھ ہوں۔",
                "اگر مجمع زیادہ ہو تو دو افراد کا بات کرنا جائز ہے۔",
                "مقصود یہ ہے کہ کوئی بھی فرد خود کو نظر انداز ہوتا محسوس نہ کرے۔"
              ],
              "english": [
                "This prohibition specifically applies when only three people are together.",
                "If there is a larger group, it is permissible for two to talk privately.",
                "The objective is to ensure no individual feels ignored or marginalized."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضرورت کے تحت گنجائش",
              "english": "Permission under Necessity"
            },
            "content": {
              "urdu": [
                "اگر تیسرے شخص سے اجازت لے لی جائے تو سرگوشی کی جا سکتی ہے۔",
                "شدید ضرورت یا ایمرجنسی میں بھی اس حکم میں نرمی ممکن ہے۔",
                "حکم کی بنیاد 'غمگین کرنا' ہے، اگر وہ راضی ہو تو ممانعت نہیں۔"
              ],
              "english": [
                "Whispering is allowed if permission is sought from the third person first.",
                "In cases of absolute necessity or emergency, this rule can be relaxed.",
                "The ruling is based on 'causing grief'; if they agree, the prohibition is lifted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نفساتی پہلو اور اصلاح",
        "english": "Psychological Aspect and Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدگمانی کا سدِ باب",
              "english": "Preventing Suspicion"
            },
            "content": {
              "urdu": [
                "شیطان ایسے موقعوں پر انسان کے دل میں وسوسے ڈالتا ہے۔",
                "سرگوشی سے بچ کر ہم ایک دوسرے کے بارے میں حسنِ ظن قائم رکھتے ہیں۔",
                "قلبی سکون کے لیے محفل میں سب کو شریکِ گفتگو رکھنا چاہیے۔"
              ],
              "english": [
                "Satan uses such opportunities to instill doubts in a person's heart.",
                "By avoiding private talk, we maintain good expectations of one another.",
                "To ensure peace of mind, everyone in the group should be included in talk."
              ]
            }
          },
          {
            "title": {
              "urdu": "باہمی محبت کا فروغ",
              "english": "Promoting Mutual Love"
            },
            "content": {
              "urdu": [
                "ایک دوسرے کے حقوق اور جذبات کا احترام محبت بڑھاتا ہے۔",
                "نبی ﷺ نے چھوٹی چھوٹی باتوں کے ذریعے معاشرے کی اصلاح فرمائی۔",
                "مومن وہ ہے جو دوسروں کے لیے وہی پسند کرے جو اپنے لیے کرے۔"
              ],
              "english": [
                "Respecting the rights and feelings of others increases mutual affection.",
                "The Prophet (ﷺ) reformed society through these subtle yet deep lessons.",
                "A believer is one who loves for others what he loves for himself."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گفتگو کے آداب",
              "english": "Manner of Conversation"
            },
            "content": {
              "urdu": [
                "ایسی زبان میں بات نہ کریں جو محفل میں موجود تیسرا شخص نہ سمجھتا ہو۔",
                "یہ بھی سرگوشی کے زمرے میں آتا ہے اور اسے ناپسند کیا گیا ہے۔",
                "گفتگو ایسی ہونی چاہیے جو سب کے لیے واضح اور عام فہم ہو۔"
              ],
              "english": [
                "Do not speak a language that the third person present does not understand.",
                "This also falls under whispering and is considered disliked in Islam.",
                "Conversation should be clear and accessible to everyone in the gathering."
              ]
            }
          },
          {
            "title": {
              "urdu": "شائستگی کا مظاہرہ",
              "english": "Demonstrating Politeness"
            },
            "content": {
              "urdu": [
                "اپنی حرکات و سکنات سے کسی کو حقیر یا کم تر محسوس نہ ہونے دیں۔",
                "ایک سچے مسلمان کا اخلاق ہر جگہ نمایاں ہونا چاہیے۔",
                "دوسروں کی خوشی اور غم کا خیال رکھنا ہی انسانیت کا نچوڑ ہے۔"
              ],
              "english": [
                "Never let your actions or gestures make someone feel inferior or belittled.",
                "The character of a true Muslim should be evident in every social setting.",
                "Respecting the joy and sorrow of others is the essence of humanity."
              ]
            }
          }
        ]
      }
    }
  ]
}