{
  "hadithId": 891,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/90"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
 
  "takhreej": {
    "arabic": "منكر بهذا اللفظ. رواه ابن ماجه (2037) من طريق عبيد بن القاسم وهو كذاب. وأصل القصة في صحيح البخاري (5254، 5255) من حديث أبي أسيد الساعدي بلفظ الجونية.",
    "urdu": "یہ روایت اس لفظ کے ساتھ منکر (ضعیف) ہے کیونکہ ابن ماجہ کی سند میں عبید بن القاسم نامی راوی کذاب ہے۔ تاہم اس قصے کی اصل صحیح بخاری (5254) میں سیدنا ابواسید ساعدی کی روایت سے ثابت ہے جہاں 'الجونیہ' کا ذکر ہے۔",
    "english": "Rejected (Munkar) with this wording. Reported by Ibn Majah (2037) via Ubaid bin al-Qasim, who is a liar. However, the origin of the story is in Sahih al-Bukhari (5254) on the authority of Abu Usaid al-Sa'idi."
  },
  "importantWords": [
    {
      "arabic": "تَعَوَّذَتْ",
      "english": "Sought refuge",
      "urdu": "پناہ طلب کی"
    },
    {
      "arabic": "مَعَاذٍ",
      "english": "Refuge / Protector",
      "urdu": "پناہ گاہ (اللہ تعالیٰ)"
    },
    {
      "arabic": "فَمَتَّعَهَا",
      "english": "Gave her a gift",
      "urdu": "اسے فائدہ / تحفہ دیا"
    },
    {
      "arabic": "أَثْوَابٍ",
      "english": "Garments / Clothes",
      "urdu": "کپڑے"
    },
    {
      "arabic": "مَتْرُوكٌ",
      "english": "Abandoned narrator",
      "urdu": "متروک (ناقابلِ قبول راوی)"
    }
  ],
  "summary": {
    "urdu": "اگر رخصتی کے وقت عورت شوہر کو ناپسند کرے اور علیحدگی چاہے، تو زبردستی کرنے کے بجائے اسے طلاق دے کر حسنِ سلوک کے ساتھ رخصت کرنا سنتِ نبوی ہے۔",
    "english": "If a woman expresses dislike or seeks refuge from her husband at the time of consummation, it is the Prophetic way to release her with divorce and provide a parting gift gracefully."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5254)",
      "english": "Sahih al-Bukhari (5254)"
    },
    {
      "arabic": "سنن ابن ماجه (2037)",
      "english": "Sunan Ibn Majah (2037)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "منكر (أصله في الصحيح)",
    "english": "Munkar (Original story is Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طلاق اور حسنِ سلوک",
        "english": "Divorce and Kind Treatment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی پناہ کا احترام",
              "english": "Respecting Refuge in Allah"
            },
            "content": {
              "urdu": [
                "جب اس خاتون نے نادانی میں یا کسی کے بہکاوے میں اللہ کی پناہ مانگی، تو آپ ﷺ نے فوری طور پر اس کا احترام فرمایا۔",
                "نبی کریم ﷺ نے ثابت کیا کہ اللہ کا نام سب سے بڑا ہے اور اس کے نام پر پناہ مانگنے والے کو مایوس نہیں کیا جاتا۔",
                "آپ ﷺ نے اس کے ساتھ کوئی زبردستی نہیں کی بلکہ اسے اس کی مرضی پر چھوڑ دیا۔"
              ],
              "english": [
                "When the woman sought refuge in Allah, whether out of ignorance or due to being misled, the Prophet (ﷺ) immediately respected it.",
                "He demonstrated that Allah's name is supreme, and one who seeks refuge through it should not be disappointed.",
                "The Prophet (ﷺ) did not use any coercion but rather allowed her to exercise her will."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصتی کا تحفہ (متعہ طلاق)",
              "english": "Parting Gift (Mut'at al-Talaq)"
            },
            "content": {
              "urdu": [
                "طلاق دینے کے بعد عورت کو کچھ مادی فائدہ دینا (کپڑے یا مال) قرآنی حکم 'متعوہن' کے مطابق ہے۔",
                "اس کا مقصد مطلقہ عورت کی دلجوئی کرنا اور اسے باعزت طریقے سے رخصت کرنا ہے۔",
                "یہ تحفہ میاں بیوی کے درمیان تعلق کے تلخ خاتمے کے بجائے اخلاقیات پر مبنی جدائی کی علامت ہے۔"
              ],
              "english": [
                "Providing a material gift (garments or wealth) after divorce aligns with the Quranic command of 'Mut'ah'.",
                "The purpose is to console the divorced woman and send her away in an honorable manner.",
                "This gift represents an ethical separation rather than a bitter end to the relationship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خواتین کی رضامندی",
        "english": "Consent of Women"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح میں ناپسندیدگی کا حق",
              "english": "Right to Express Dislike"
            },
            "content": {
              "urdu": [
                "اسلام عورت کو یہ حق دیتا ہے کہ اگر وہ رشتہ نبھانے کی استطاعت نہ رکھتی ہو تو علیحدگی کا مطالبہ کرے۔",
                "نبی کریم ﷺ کا یہ عمل مردوں کے لیے سبق ہے کہ وہ نکاح کو جبر و ستم کا ذریعہ نہ بنائیں۔",
                "خوشگوار ازدواجی زندگی کی بنیاد فریقین کی دلی آمادگی پر ہے۔"
              ],
              "english": [
                "Islam grants a woman the right to seek separation if she finds herself unable to maintain the relationship.",
                "The Prophet's (ﷺ) action is a lesson for men not to turn marriage into a tool of oppression.",
                "A successful marital life is based on the heartfelt consent of both parties."
              ]
            }
          },
          {
            "title": {
              "urdu": "سازشوں سے آگاہی",
              "english": "Awareness of Deception"
            },
            "content": {
              "urdu": [
                "تاریخی روایات کے مطابق اس خاتون کو کچھ لوگوں نے یہ پٹی پڑھائی تھی کہ آپ ﷺ کو یہ جملہ پسند آئے گا۔",
                "آپ ﷺ نے اس کی نادانی کو محسوس کیا مگر پناہ مانگنے کی حرمت کی وجہ سے اسے جدا کر دیا۔",
                "معلوم ہوا کہ ازدواجی معاملات میں دوسروں کی باتوں میں آکر غلطی کرنا نقصان دہ ہو سکتا ہے۔"
              ],
              "english": [
                "Historical reports suggest the woman was misled into believing that the Prophet (ﷺ) would like that specific phrase.",
                "He sensed her naivety but separated from her due to the sanctity of the refuge she sought.",
                "This indicates that being influenced by outside gossip in marital affairs can lead to harmful outcomes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Legal Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مدخولہ کا مہر",
              "english": "Dower of an Unconsummated Wife"
            },
            "content": {
              "urdu": [
                "اگر خلوت سے پہلے طلاق ہو جائے تو عورت آدھے مہر یا 'متعہ' (تحفہ) کی حقدار ہوتی ہے۔",
                "آپ ﷺ نے اسے تین کپڑے دے کر اس کے حق کی ادائیگی فرمائی۔",
                "یہ حدیث طلاق کے بعد کے مالی حقوق کی ادائیگی کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "If divorce occurs before consummation, the woman is entitled to half the Mahr or a parting gift (Mut'ah).",
                "The Prophet (ﷺ) fulfilled this by providing her with three garments.",
                "This Hadith encourages the fulfillment of financial obligations following a divorce."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی وقار اور عاجزی",
              "english": "Prophetic Dignity and Humility"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس خاتون کے 'اعوذ باللہ' کہنے پر نہ برا مانا اور نہ اسے ڈانٹا۔",
                "یہ آپ ﷺ کے اعلیٰ اخلاق اور عظیم مرتبے کی دلیل ہے۔",
                "مومن کو چاہیے کہ جب کوئی اللہ کا واسطہ دے تو وہ فوری طور پر اپنی انا سے پیچھے ہٹ جائے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not take offense nor did he rebuke her when she said, 'I seek refuge in Allah'.",
                "This is a proof of his sublime character and exalted rank.",
                "A believer should immediately set aside their ego when someone invokes the name of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جدائی میں بھی احسان",
              "english": "Excellence in Separation"
            },
            "content": {
              "urdu": [
                "قرآن کا حکم ہے: 'تسریح باحسان' یعنی بھلے طریقے سے رخصت کرنا۔",
                "علیحدگی کی صورت میں ایک دوسرے کی برائیاں کرنے کے بجائے خاموشی اور تحفہ تحائف سے رخصت کرنا بہتر ہے۔",
                "اسلامی معاشرت میں تلخیوں کو ختم کرنے کا یہ بہترین نسخہ ہے۔"
              ],
              "english": [
                "The Quranic command is 'releasing with kindness', meaning a graceful parting.",
                "In cases of separation, it is better to part with silence and gifts rather than trading insults.",
                "This is the best prescription for minimizing bitterness in an Islamic society."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی اہمیت",
              "english": "Importance of the Sunnah"
            },
            "content": {
              "urdu": [
                "یہ قصہ ہمیں سکھاتا ہے کہ زندگی کے ہر موڑ پر سنتِ نبوی ﷺ میں حل موجود ہے۔",
                "نازک معاملات میں آپ ﷺ کے اسلوب کو اپنانے سے انسانی حقوق پامال نہیں ہوتے۔",
                "دینِ اسلام فہم اور ہمدردی پر مبنی نظامِ حیات فراہم کرتا ہے۔"
              ],
              "english": [
                "This story teaches us that the Sunnah provides solutions for every situation in life.",
                "Adopting the Prophet's (ﷺ) approach in sensitive matters prevents the violation of human rights.",
                "Islam provides a way of life based on understanding, compassion, and justice."
              ]
            }
          }
        ]
      }
    }
  ]
}