{
  "hadithId": 1140,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/12/6"],
    "kitabId": 12,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأطعمة",
    "babId": 92
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (3/318)، وأبو داود (3801)، والنسائي (5/191)، والترمذي (851)، وابن ماجه (3236)، وابن حبان (1068). وصححه البخاري والترمذي.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، نسائی، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ امام ترمذی اور امام بخاری نے اس کی صحت کی تصدیق کی ہے۔",
    "english": "Sahih. Reported by Ahmad (3/318), Abu Dawud (3801), An-Nasa'i (5/191), At-Tirmidhi (851), Ibn Majah (3236), and Ibn Hibban (1068). Graded Sahih by Al-Bukhari and At-Tirmidhi."
  },
  "importantWords": [
    {
      "arabic": "اَلضَّبُعُ",
      "english": "Hyena",
      "urdu": "بجو / لکڑ بگھا"
    },
    {
      "arabic": "صَيْدٌ",
      "english": "Game / Hunted animal",
      "urdu": "شکار"
    },
    {
      "arabic": "نِعْمَ",
      "english": "Yes",
      "urdu": "ہاں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ بجو (Hyena) شرعی طور پر حلال جانوروں میں شمار ہوتا ہے اور اس کا شکار کرنا اور گوشت کھانا جائز ہے۔",
    "english": "This Hadith establishes that the hyena is considered a permissible (Halal) animal to hunt and consume according to Shariah."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1791)",
      "english": "Sunan at-Tirmidhi (1791)"
    },
    {
      "arabic": "سنن أبي داود (3801)",
      "english": "Sunan Abi Dawud (3801)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بجو (Hyena) کی حلت کا حکم",
        "english": "Ruling on the Permissibility of Hyena"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی حیثیت",
              "english": "Shariah Status"
            },
            "content": {
              "urdu": [
                "بجو ان درندوں میں شامل ہے جن کے بارے میں ممانعت کا حکم نہیں ہے کیونکہ یہ انسانوں پر حملہ آور نہیں ہوتا۔",
                "سیدنا جابر رضی اللہ عنہ نے واضح طور پر اسے نبی ﷺ کا قول قرار دے کر شکار اور حلال ثابت کیا۔",
                "اہلِ علم کے نزدیک یہ ان درندوں سے مستثنیٰ ہے جن کے کچلی والے دانت ہوتے ہیں۔"
              ],
              "english": [
                "The hyena is included among those predators that are not forbidden because it is not typically aggressive towards humans.",
                "Jabir (R.A) explicitly attributed its permissibility to the Prophet (ﷺ), confirming it is Halal.",
                "Scholars consider it an exception to the general prohibition of fanged predators."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب",
              "english": "Juristic Opinions"
            },
            "content": {
              "urdu": [
                "امام شافعی، امام احمد اور امام اسحاق کے نزدیک بجو کا گوشت حلال ہے۔",
                "امام ابوحنیفہ کے نزدیک یہ مکروہ ہے کیونکہ یہ کچلی والے دانتوں سے شکار کرتا ہے۔",
                "تاہم، اس صریح صحیح حدیث کی روشنی میں حلت کا قول زیادہ قوی معلوم ہوتا ہے۔"
              ],
              "english": [
                "Imams Shafi'i, Ahmad, and Ishaq consider the meat of the hyena to be Halal.",
                "Imam Abu Hanifa views it as disliked (Makruh) because it hunts with fangs.",
                "However, in light of this explicit Sahih Hadith, the view of its permissibility is stronger."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شکار کے احکام",
        "english": "Rulings on Hunting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بجو بطورِ شکار",
              "english": "Hyena as Game"
            },
            "content": {
              "urdu": [
                "حدیث میں اسے 'صید' (شکار) کہا گیا ہے، جس کا مطلب ہے کہ اسے ذبح کر کے کھایا جا سکتا ہے۔",
                "اگر کوئی محرم (حالتِ احرام میں) اسے قتل کرے تو اس پر جزا (فدیہ) لازم ہوگی۔",
                "عرب کے لوگ قدیم زمانے سے اسے کھاتے آ رہے تھے اور شریعت نے اس کی توثیق کی۔"
              ],
              "english": [
                "The Hadith labels it as 'Game', meaning it can be slaughtered and eaten.",
                "If a person in the state of Ihram kills it, they are required to pay a penalty (Fidya).",
                "Arabs had been consuming it since ancient times, and Shariah validated this practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علم الحدیث اور تحقیق",
        "english": "Hadith Science and Verification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی صحت",
              "english": "Authenticity of Chain"
            },
            "content": {
              "urdu": [
                "امام بخاری نے اس حدیث کی سند کو صحیح قرار دیا ہے جو اس کی حجیت پر مہر ہے۔",
                "صحابہ کرام سے براہِ راست سوال کر کے شرعی مسائل کی تحقیق کرنا تابعین کا شیوہ تھا۔",
                "اس حدیث سے معلوم ہوتا ہے کہ سنتِ نبوی ہی حلال و حرام کا حتمی پیمانہ ہے۔"
              ],
              "english": [
                "Imam Al-Bukhari authenticated the chain of this Hadith, confirming its authority.",
                "The Tabi'un made it a practice to verify Shariah issues by directly questioning the Sahaba.",
                "This Hadith shows that the Prophetic Sunnah is the ultimate standard for Halal and Haram."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شک دور کرنے کا طریقہ",
              "english": "Way to Remove Doubts"
            },
            "content": {
              "urdu": [
                "کسی بھی مشکوک معاملے میں اہل علم سے سوال کر کے اطمینان حاصل کرنا چاہیے۔",
                "صرف ذاتی رائے کے بجائے مستند حوالہ جات اور سنت پر بھروسہ کرنا ضروری ہے۔",
                "دین میں ہر چیز کی بنیاد دلیل پر ہونی چاہیے۔"
              ],
              "english": [
                "In any doubtful matter, one should seek satisfaction by asking people of knowledge.",
                "It is essential to rely on authentic references and Sunnah rather than personal opinion.",
                "Everything in religion should be based on evidence (Dalil)."
              ]
            }
          },
          {
            "title": {
              "urdu": "طیب رزق کی اہمیت",
              "english": "Importance of Pure Provision"
            },
            "content": {
              "urdu": [
                "اللہ نے ہمارے لیے زمین میں بہت سی پاکیزہ چیزیں پیدا کی ہیں۔",
                "حلال و حرام کے ضابطوں کی پابندی ہی ایک مومن کی پہچان ہے۔",
                "پاکیزہ غذا انسانی اخلاق اور عبادات پر مثبت اثر ڈالتی ہے۔"
              ],
              "english": [
                "Allah has created many pure things for us on earth.",
                "Adhering to the regulations of Halal and Haram is the identity of a believer.",
                "Pure food has a positive impact on human character and worship."
              ]
            }
          }
        ]
      }
    }
  ]
}