{
  "hadithId": 488,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1575"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },

  "takhreej": {
    "arabic": "حسن. رواه أحمد (20023)، وأبو داود (1575)، والنسائي (2444)، وصححه الحاكم (1/398) والذهبي. وقد اختلف العلماء في لفظ 'شطر ماله' فمنهم من أخذ به عقوبة مالية ومنهم من أوله.",
    "urdu": "یہ حدیث حسن ہے۔ اسے احمد (20023)، ابوداؤد (1575) اور نسائی (2444) نے روایت کیا ہے۔ امام حاکم اور ذہبی نے اسے صحیح کہا ہے۔ 'شطر مالہ' (آدھا مال) کے لفظ پر فقہاء کے درمیان بحث رہی ہے کہ آیا یہ مالی جرمانہ ہے یا اس سے مراد زکوٰۃ کی وصولی کا سخت انداز ہے۔",
    "english": "Hasan (Good). Reported by Ahmad (20023), Abu Dawud (1575), and an-Nasa'i (2444). Al-Hakim and adh-Dhahabi authenticated it. Scholars have discussed the phrase 'half of his property,' interpreting it either as a financial penalty or a rigorous collection method."
  },
  "importantWords": [
    {
      "arabic": "سَائِمَةِ",
      "english": "Pasturing (livestock)",
      "urdu": "چرنے والے (جانور)"
    },
    {
      "arabic": "مُؤْتَجِرًا",
      "english": "Seeking reward",
      "urdu": "حصولِ ثواب کی نیت سے"
    },
    {
      "arabic": "مَنَعَهَا",
      "english": "Withheld it",
      "urdu": "اسے (زکوٰۃ کو) روکا"
    },
    {
      "arabic": "وَشَطْرَ مَالِهِ",
      "english": "And half of his property",
      "urdu": "اور اس کے مال کا نصف"
    },
    {
      "arabic": "عَزْمَةً",
      "english": "Absolute command",
      "urdu": "لازمی حکم / پختہ ارادہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اونٹوں کی زکوٰۃ کے نصاب کے ساتھ زکوٰۃ روکنے والوں کے لیے سخت سزا بیان کی گئی ہے، نیز یہ واضح کیا گیا ہے کہ زکوٰۃ کا مال آلِ محمد ﷺ کے لیے حرام ہے۔",
    "english": "This Hadith details Zakat for camels and prescribes a severe penalty for evaders, while affirming that Zakat is forbidden for the family of the Prophet Muhammad (ﷺ)."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1575)",
      "english": "Sunan Abu Dawud (1575)"
    },
    {
      "arabic": "سنن النسائي (2444)",
      "english": "Sunan an-Nasa'i (2444)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "بهز بن حكيم",
        "english": "Bahz bin Hakim"
      },
      "slug": "bahz-bin-hakim"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_R_AAnM",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ سے انکار کی سزا",
        "english": "Penalty for Withholding Zakat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی جرمانہ",
              "english": "Financial Penalty"
            },
            "content": {
              "urdu": [
                "جو شخص جانتے بوجھتے زکوٰۃ روک لے، اسلامی حکومت اسے زبردستی وصول کرے گی۔",
                "حدیث کے مطابق سزا کے طور پر اس کا مزید مال بھی لیا جا سکتا ہے۔",
                "یہ حکم اس اہمیت کو اجاگر کرتا ہے جو اسلام نے غریبوں کے حق (زکوٰۃ) کو دی ہے۔"
              ],
              "english": [
                "If someone deliberately withholds Zakat, the Islamic state will take it by force.",
                "According to the Hadith, an additional portion of their property may be taken as a penalty.",
                "This highlights the immense importance Islam places on the rights of the poor (Zakat)."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی تشریح",
              "english": "Juristic Interpretation"
            },
            "content": {
              "urdu": [
                "امام احمد کے نزدیک یہ حدیث مالی جرمانے کے جواز کی دلیل ہے۔",
                "جمہور فقہاء کے نزدیک 'شطر مالہ' سے مراد اس مال کا آدھا حصہ ہے جس میں سے زکوٰۃ وصول کی جا رہی ہے۔",
                "بعض نے اسے منسوخ قرار دیا ہے، مگر نفاذِ زکوٰۃ میں سختی پر سب کا اتفاق ہے۔"
              ],
              "english": [
                "Imam Ahmad uses this Hadith as evidence for the permissibility of financial fines.",
                "The majority of jurists interpret 'half of his property' as referring to the category of wealth being taxed.",
                "Some consider the penalty aspect abrogated, but all agree on the necessity of enforcing Zakat."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آلِ محمد ﷺ پر زکوٰۃ کی حرمت",
        "english": "Prohibition of Zakat for the Prophet's Family"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بنو ہاشم کا مقام",
              "english": "Status of Banu Hashim"
            },
            "content": {
              "urdu": [
                "زکوٰۃ لوگوں کے مال کا میل کچیل ہے، اس لیے یہ نبی ﷺ کی آل کے لیے حلال نہیں۔",
                "آلِ محمد ﷺ سے مراد بنو ہاشم اور بنو المطلب ہیں۔",
                "اللہ نے ان کے وقار کی حفاظت کے لیے انہیں صدقات سے پاک رکھا ہے۔"
              ],
              "english": [
                "Zakat is considered the 'dirt' of people's wealth, thus unfit for the Prophet's (ﷺ) family.",
                "The family of Muhammad (ﷺ) refers to the clans of Banu Hashim and Banu al-Muttalib.",
                "Allah has kept them away from charities to preserve their dignity and honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "بدلے میں خمس کا حق",
              "english": "Right to the Fifth (Khumus)"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کے بجائے اہل بیت کے لیے بیت المال (مالِ غنیمت) سے خمس مقرر کیا گیا تھا۔",
                "یہ ان کی معاشی کفالت کا شرعی طریقہ ہے تاکہ ان کی ضروریات پوری رہیں۔",
                "اسلام میں خاندانی وقار اور معاشی حق دونوں کا توازن موجود ہے۔"
              ],
              "english": [
                "Instead of Zakat, a fifth of the war booty (Khumus) was designated for the Ahl al-Bayt.",
                "This is the Shariah's way to ensure their financial support and needs are met.",
                "Islam maintains a balance between family honor and economic rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نیت اور اجر",
        "english": "Intention and Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاص کی اہمیت",
              "english": "Importance of Sincerity"
            },
            "content": {
              "urdu": [
                "زکوٰۃ خوش دلی اور حصولِ ثواب کی نیت سے ادا کرنی چاہیے۔",
                "مجبوری یا بوجھ سمجھ کر دی گئی زکوٰۃ وہ اجر نہیں پاتی جو اخلاص سے ملتی ہے۔",
                "اللہ تعالیٰ بندے کے دل کی نیت اور خوش دلی کو دیکھتا ہے۔"
              ],
              "english": [
                "Zakat should be paid cheerfully and with the intention of gaining reward.",
                "Zakat paid as a burden or out of compulsion lacks the full spiritual reward.",
                "Allah Almighty observes the intention and the willingness of the heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت اور ٹیکس میں فرق",
              "english": "Difference between Worship and Tax"
            },
            "content": {
              "urdu": [
                "زکوٰۃ صرف معاشی بوجھ نہیں بلکہ ایک عظیم روحانی عبادت ہے۔",
                "اس کے ذریعے مال میں برکت اور نفس کی پاکیزگی حاصل ہوتی ہے۔",
                "ٹیکس صرف مادی ضرورت ہے، جبکہ زکوٰۃ دنیا اور آخرت دونوں کی فلاح ہے۔"
              ],
              "english": [
                "Zakat is not merely an economic levy but a profound spiritual act of worship.",
                "Through it, one achieves blessings in wealth and purification of the soul.",
                "While taxes are material necessities, Zakat encompasses success in both worlds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکومتی نظم و ضبط",
              "english": "Administrative Discipline"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست کو فرائض کے نفاذ میں پرعزم اور مضبوط ہونا چاہیے۔",
                "زکوٰۃ کا نظام معاشرتی انصاف قائم کرنے کے لیے ناگزیر ہے۔",
                "قانون کی پاسداری ہی سے معاشرے میں توازن پیدا ہوتا ہے۔"
              ],
              "english": [
                "The Islamic state must be resolute and firm in enforcing obligatory duties.",
                "The Zakat system is essential for establishing social justice.",
                "Compliance with the law is what creates balance in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کی حقیقت",
              "english": "Nature of Wealth"
            },
            "content": {
              "urdu": [
                "ہمارا مال درحقیقت اللہ کی امانت ہے، اس لیے اس کے احکام ماننا لازم ہیں۔",
                "زکوٰۃ روکنا اللہ کی امانت میں خیانت کرنے کے مترادف ہے۔",
                "انسان کو اپنے مال کے بارے میں آخرت میں جوابدہ ہونا پڑے گا۔"
              ],
              "english": [
                "Our wealth is actually a trust from Allah, making His commands binding.",
                "Withholding Zakat is akin to betraying Allah's trust.",
                "Man will be held accountable for his wealth in the Hereafter."
              ]
            }
          }
        ]
      }
    }
  ]
}