{
  "hadithId": 473,
  "hadithNo": 49,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/tirmidhi:1056"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه الترمذي (1056)، وابن حبان (3178)، وابن ماجه (1576). والحديث له شواهد من حديث ابن عباس وحسان بن ثابت، وهو محمول على من تكثر الزيارة وتفعل ما يخالف الشرع عند القبور.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ترمذی (1056) اور ابن حبان (3178) نے روایت کیا ہے۔ اس کے شواہد ابن عباس اور حسان بن ثابت رضی اللہ عنہم سے بھی مروی ہیں۔ یہ ممانعت ان خواتین کے لیے ہے جو کثرت سے زیارت کریں یا قبروں پر غیر شرعی امور انجام دیں۔",
    "english": "Sahih. Reported by At-Tirmidhi (1056) and Ibn Hibban (3178). It has supporting narrations from Ibn Abbas and Hassan bin Thabit. This prohibition is interpreted as applying to women who visit excessively or engage in unlawful behavior at graves."
  },
  "importantWords": [
    {
      "arabic": "لَعَنَ",
      "english": "Cursed",
      "urdu": "لعنت فرمائی"
    },
    {
      "arabic": "زَائِرَاتِ",
      "english": "Female visitors",
      "urdu": "زیارت کرنے والیاں"
    },
    {
      "arabic": "الْقُبُورِ",
      "english": "The Graves",
      "urdu": "قبریں"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Reported it",
      "urdu": "اسے نکالا / روایت کیا"
    },
    {
      "arabic": "صَحَّحَهُ",
      "english": "Authenticated it",
      "urdu": "اسے صحیح قرار دیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان خواتین کے لیے سخت وعید بیان کی گئی ہے جو کثرت سے قبروں کی زیارت کرتی ہیں، تاکہ انہیں جزع فزع اور بدعت سے بچایا جا سکے۔",
    "english": "This Hadith issues a stern warning to women who visit graves frequently, aimed at protecting them from excessive grieving and forbidden innovations."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1056)",
      "english": "Sunan at-Tirmidhi (1056)"
    },
    {
      "arabic": "صحيح ابن حبان (3178)",
      "english": "Sahih Ibn Hibban (3178)"
    },
    {
      "arabic": "سنن ابن ماجه (1576)",
      "english": "Sunan Ibn Majah (1576)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_0XN0fS5jU",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ممانعت کی نوعیت",
        "english": "Nature of Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کثرتِ زیارت سے ممانعت",
              "english": "Prohibition of Frequent Visiting"
            },
            "content": {
              "urdu": [
                "حدیث میں 'زوارات' یا 'زائرات' کے الفاظ کثرت سے زیارت کرنے پر دلالت کرتے ہیں۔",
                "مسلسل قبرستان جانے سے خواتین کے لیے جزع فزع اور بے صبری کا اندیشہ ہوتا ہے۔",
                "شریعت نے خواتین کی نازک مزاجی کے پیشِ نظر انہیں اس مشقت سے روکا ہے۔"
              ],
              "english": [
                "The wording implies a prohibition against those who visit graves excessively.",
                "Frequent visits may lead women to intense grief and lack of patience.",
                "Shariah discourages this to protect women's emotional state and dignity."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیر شرعی افعال سے بچاؤ",
              "english": "Prevention of Unlawful Acts"
            },
            "content": {
              "urdu": [
                "قبروں پر رونا دھونا، بین کرنا اور غیر شرعی رسومات انجام دینا حرام ہے۔",
                "لعنت کا لفظ ظاہر کرتا ہے کہ یہ گناہِ کبیرہ اور انتہائی ناپسندیدہ عمل ہے۔",
                "اسلام نے قبرستان کے ماحول کو صرف عبرت اور دعا کے لیے خاص کیا ہے۔"
              ],
              "english": [
                "Wailing, screaming, and performing innovated rituals at graves are forbidden.",
                "The term 'curse' indicates that such behavior is a major and detested sin.",
                "Islam designates graveyards solely for taking lessons and offering prayers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مذاہب اور گنجائش",
        "english": "Juristic Views and Permissions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مطلق زیارت کا حکم",
              "english": "Ruling on General Visiting"
            },
            "content": {
              "urdu": [
                "اگر خاتون باپردہ ہو اور صبر و ادب کے ساتھ جائے تو بعض علماء اسے جائز کہتے ہیں۔",
                "سیدہ عائشہ رضی اللہ عنہا کا اپنے بھائی کی قبر پر جانا اس کی ایک دلیل ہے۔",
                "تاہم، فتنے اور اختلاط کے خوف سے گھر پر رہ کر دعا کرنا ہی افضل ہے۔"
              ],
              "english": [
                "If a woman is modestly dressed and acts with patience, some scholars permit it.",
                "Lady Aisha's (RA) visit to her brother's grave is cited as evidence for this.",
                "However, avoiding fitna and intermingling makes staying home superior."
              ]
            }
          },
          {
            "title": {
              "urdu": "منسوخی کا پہلو",
              "english": "Aspect of Abrogation"
            },
            "content": {
              "urdu": [
                "ابتداء میں مرد و عورت دونوں کو قبرستان جانے سے منع کیا گیا تھا۔",
                "بعد میں آپ ﷺ نے فرمایا: 'اب ان کی زیارت کیا کرو'، جس میں خواتین بھی شامل ہو سکتی ہیں۔",
                "لیکن لعنت والی وعید ان کے لیے باقی ہے جو وہاں جا کر خلافِ شرع کام کریں۔"
              ],
              "english": [
                "Initially, both men and women were forbidden from visiting graveyards.",
                "The Prophet (ﷺ) later allowed it, saying, 'Now visit them,' including women.",
                "But the warning of the curse remains for those who violate Shariah at graves."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمت اور معاشرتی اصلاح",
        "english": "Wisdom and Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پردہ پوشی اور حیا",
              "english": "Privacy and Modesty"
            },
            "content": {
              "urdu": [
                "قبرستان میں مردوں کا اژدھام ہوتا ہے جہاں خواتین کا جانا حیا کے خلاف ہو سکتا ہے۔",
                "خواتین کی عزت و تکریم ان کے پردے اور گھر کی چار دیواری میں ہے۔",
                "اسلامی معاشرے میں غیر ضروری اختلاط کو ہمیشہ ناپسند کیا گیا ہے۔"
              ],
              "english": [
                "Graveyards are often crowded with men, making female presence inappropriate.",
                "A woman's honor and dignity lie in her modesty and home boundaries.",
                "Islamic society consistently discourages unnecessary gender intermingling."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبر کی تلقین",
              "english": "Encouraging Patience"
            },
            "content": {
              "urdu": [
                "موت کے صدمے کو کم کرنے کے لیے صبر و رضا کی تعلیم دی گئی ہے۔",
                "بار بار قبر پر جانا زخموں کو تازہ رکھتا ہے اور سکون میں رکاوٹ بنتا ہے۔",
                "میت کو ایصالِ ثواب کے لیے قبر پر جانا شرط نہیں، کہیں سے بھی دعا ہو سکتی ہے۔"
              ],
              "english": [
                "Patience and submission to Allah's will are taught to lessen grief.",
                "Repeated visits keep emotional wounds fresh and hinder tranquility.",
                "Visiting the grave is not a requirement for sending rewards to the deceased."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباعِ سنت کی اہمیت",
              "english": "Importance of Following Sunnah"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کے فرامین پر من و عن عمل کرنا ہی ایمان کا تقاضا ہے۔",
                "جس کام سے آپ ﷺ نے سختی سے روکا ہو، اس میں ہماری ہی بھلائی ہے۔",
                "دین کے معاملے میں جذبات کے بجائے احکامِ شرعیہ کو مقدم رکھنا چاہیے۔"
              ],
              "english": [
                "Obeying the Prophet's (ﷺ) commands completely is a requirement of faith.",
                "There is inherent goodness for us in avoiding what he strictly forbade.",
                "Religious rulings must take precedence over emotions in all matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "میت کا بہترین تحفہ",
              "english": "The Best Gift for the Deceased"
            },
            "content": {
              "urdu": [
                "میت کے لیے سب سے نفع بخش چیز استغفار اور صدقہ جاریہ ہے۔",
                "خواتین اپنے گھروں میں رہ کر میت کے لیے قرآن خوانی اور دعا کر سکتی ہیں۔",
                "قبر پر جا کر چیخنا میت کے لیے راحت کے بجائے اذیت کا باعث بنتا ہے۔"
              ],
              "english": [
                "The most beneficial acts for the dead are seeking forgiveness and charity.",
                "Women can recite the Quran and pray for the dead from within their homes.",
                "Screaming at the grave causes distress to the deceased instead of relief."
              ]
            }
          }
        ]
      }
    }
  ]
}