{
  "hadithId": 392,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-392"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (1147)‏، وأصله في البخاري (960) ومسلم (885) من حديث جابر بن سمرة وجابر بن عبد الله رضي الله عنهم أجمعين.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد نے روایت کیا ہے اور بخاری و مسلم میں جابر بن سمرہ اور جابر بن عبداللہ سے اس کی اصل موجود ہے کہ عیدین میں نہ اذان تھی نہ اقامت۔",
    "english": "Sahih. Reported by Abu Dawud (1147). The origin is in Al-Bukhari (960) and Muslim (885) through Jabir bin Samura and Jabir bin Abdullah, confirming no Adhan or Iqamah for Eids."
  },
  "importantWords": [
    {
      "arabic": "بِلَا أَذَانٍ",
      "english": "Without Adhan",
      "urdu": "بغیر اذان کے"
    },
    {
      "arabic": "لَا إِقَامَةٍ",
      "english": "No Iqamah",
      "urdu": "کوئی اقامت نہیں"
    },
    {
      "arabic": "صَلَّى",
      "english": "Offered prayer",
      "urdu": "نماز ادا کی"
    },
    {
      "arabic": "اَلْعِيدَ",
      "english": "The Eid",
      "urdu": "عید"
    },
    {
      "arabic": "أَصْلُهُ",
      "english": "Its origin",
      "urdu": "اس کی اصل"
    }
  ],
  "summary": {
    "urdu": "عیدین کی نماز کے لیے اذان اور اقامت مشروع نہیں ہے، لوگ بغیر کسی پکار کے نماز کے لیے جمع ہوتے ہیں۔",
    "english": "Adhan and Iqamah are not prescribed for the Eid prayers; people gather for prayer without any formal call."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1147)",
      "english": "Sunan Abu Dawud (1147)"
    },
    {
      "arabic": "صحيح البخاري (960)",
      "english": "Sahih al-Bukhari (960)"
    },
    {
      "arabic": "صحيح مسلم (885)",
      "english": "Sahih Muslim (885)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=no+adhan+iqamah+for+eid+prayer+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اذان و اقامت کی نفی",
        "english": "Negation of Adhan and Iqamah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ مستمرہ",
              "english": "The Established Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے دور میں عیدین کے لیے کبھی اذان یا اقامت نہیں کہی گئی۔",
                "یہ حکم عید الفطر اور عید الاضحی دونوں کے لیے یکساں ہے۔",
                "صحابہ کرام اور خلفائے راشدین نے بھی اسی سنت پر عمل کیا۔"
              ],
              "english": [
                "Adhan and Iqamah were never called for the Eids during the Prophet's time.",
                "This ruling applies equally to both Eid-ul-Fitr and Eid-ul-Adha.",
                "The Companions and Caliphs consistently followed this established Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نمازوں میں فرق",
              "english": "Distinction Between Prayers"
            },
            "content": {
              "urdu": [
                "اذان و اقامت صرف پنجگانہ فرائض اور جمعہ کے لیے خاص ہے۔",
                "عید کی نماز میں ان کا نہ ہونا اسے دیگر نمازوں سے ممتاز کرتا ہے۔",
                "بغیر اذان کے نماز ادا کرنا شریعت کے سادہ اور فطری ہونے کی دلیل ہے۔"
              ],
              "english": [
                "Adhan and Iqamah are specific to the five daily prayers and Jumu'ah.",
                "Their absence in Eid prayer distinguishes it from the regular daily prayers.",
                "Offering prayer without Adhan reflects the simple and natural essence of Sharia."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بدعت سے اجتناب",
        "english": "Avoiding Innovation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خود ساختہ طریقے کی ممانعت",
              "english": "Prohibition of Self-Made Methods"
            },
            "content": {
              "urdu": [
                "دین میں اپنی طرف سے کسی نئی پکار کا اضافہ کرنا درست نہیں ہے۔",
                "کچھ ادوار میں لوگوں نے عید کے لیے اذان شروع کی جسے بدعت کہا گیا۔",
                "سنت پر اکتفا کرنا ہی بندگی کی اصل روح اور کامیابی کا راستہ ہے۔"
              ],
              "english": [
                "Adding any new form of call into the religion is not permissible.",
                "In some eras, people started Adhan for Eid, which was labeled as Bid'ah.",
                "Contentment with the Sunnah is the true spirit of devotion and success."
              ]
            }
          },
          {
            "title": {
              "urdu": "پکار کا متبادل",
              "english": "Alternative for Calling People"
            },
            "content": {
              "urdu": [
                "عید کے لیے 'الصلاة جامعة' جیسے الفاظ کہنا بھی سنت سے ثابت نہیں ہے۔",
                "لوگوں کا وقتِ مقررہ پر خود بخود جمع ہونا ہی کافی سمجھا گیا ہے۔",
                "راستوں میں تکبیرات کہنا لوگوں کو عید کی طرف متوجہ کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Saying 'As-Salatu Jamiah' for Eid is also not established from Sunnah.",
                "The spontaneous gathering of people at a fixed time is deemed sufficient.",
                "Reciting Takbirat on the way serves as a notice for the upcoming Eid prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و شرعی حکمت",
        "english": "Juristic and Sharia Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عید گاہ کا مقام",
              "english": "The Status of the Musalla"
            },
            "content": {
              "urdu": [
                "اذان و اقامت عموماً مساجد میں نماز کے باقاعدہ نظام کے لیے ہے۔",
                "عید گاہ ایک کھلا میدان ہوتا ہے جہاں سال میں ایک بار اجتماع ہوتا ہے۔",
                "یہاں کا نظام عام مساجد کے روزانہ کے معمول سے مختلف رکھا گیا ہے۔"
              ],
              "english": [
                "Adhan and Iqamah are generally for the regular systems within mosques.",
                "The Eidgah is an open field hosting an assembly only once or twice a year.",
                "Its system is kept distinct from the daily routine of standard mosques."
              ]
            }
          },
          {
            "title": {
              "urdu": "وحدتِ امت کا مظہر",
              "english": "Manifestation of Ummah's Unity"
            },
            "content": {
              "urdu": [
                "بغیر کسی پکار کے ہزاروں کا جمع ہونا مسلمانوں کے نظم و ضبط کی علامت ہے۔",
                "یہ ظاہر کرتا ہے کہ مسلمان اپنے فرائض کے بارے میں کتنے باشعور ہیں۔",
                "سنت کی یکسانیت پوری دنیا کے مسلمانوں کو ایک لڑی میں پروتی ہے۔"
              ],
              "english": [
                "Thousands gathering without a call symbolizes the discipline of Muslims.",
                "It shows how conscious Muslims are regarding their religious duties.",
                "The uniformity of the Sunnah binds Muslims worldwide in a single chain."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی اہمیت",
              "english": "Importance of Sunnah"
            },
            "content": {
              "urdu": [
                "عبادات میں اصل معیار رسول اللہ ﷺ کی اتباع اور پیروی ہے۔",
                "جو کام آپ ﷺ نے نہیں کیا، اسے نہ کرنا ہی اصل دینداری ہے۔",
                "ہمیں ہر چھوٹی بڑی سنت کو سیکھنے اور اس پر عمل کرنے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "The real standard in worship is following the Messenger of Allah (ﷺ).",
                "Abstaining from what he did not do is the essence of true religiosity.",
                "We should strive to learn and act upon every Sunnah, large or small."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی قدر",
              "english": "Valuing Time"
            },
            "content": {
              "urdu": [
                "عید کے وقت کا پہلے سے تعین لوگوں کو وقت کی پابندی سکھاتا ہے۔",
                "اذان کا انتظار کیے بغیر عید گاہ پہنچنا شوقِ بندگی کی علامت ہے۔",
                "یہ حدیث ہمیں اپنے معاملات میں مستعد اور تیار رہنے کا درس دیتی ہے۔"
              ],
              "english": [
                "Pre-determining the Eid time teaches people the value of punctuality.",
                "Reaching the Eidgah without waiting for a call signals devotion.",
                "This Hadith teaches us to be proactive and prepared in our affairs."
              ]
            }
          }
        ]
      }
    }
  ]
}
