{
  "hadithId": 411,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-411"],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام",
    "babId": 26
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1032)‏، والنسائي (3/164)، وابن ماجه (3889)، وأحمد (6/190).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (1032) نے روایت کیا ہے۔ اگرچہ حافظ ابن حجر نے اسے 'اخرجاہ' (بخاری و مسلم) کہا ہے، مگر یہ صرف بخاری میں ہے، تاہم اس کی صحت پر کوئی کلام نہیں۔",
    "english": "Sahih. Reported by Al-Bukhari (1032). Though Al-Hafiz attributed it to both Al-Bukhari and Muslim, it is found in Al-Bukhari. It is also narrated by An-Nasa'i and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "صَيِّبًا",
      "english": "Downpour / Pouring rain",
      "urdu": "خوب برسنے والی بارش"
    },
    {
      "arabic": "نَافِعًا",
      "english": "Beneficial",
      "urdu": "نفع بخش"
    },
    {
      "arabic": "رَأَى",
      "english": "He saw",
      "urdu": "دیکھا"
    },
    {
      "arabic": "اَلْمَطَرَ",
      "english": "The rain",
      "urdu": "بارش"
    },
    {
      "arabic": "أَخْرَجَاهُ",
      "english": "Reported by both (Bukhari & Muslim)",
      "urdu": "دونوں (بخاری و مسلم) نے اسے نکالا"
    }
  ],
  "summary": {
    "urdu": "بارش کے وقت مسنون دعا 'اللهم صيبا نافعا' پڑھنا سنت ہے تاکہ بارش اللہ کی رحمت اور فائدے کا باعث بنے نہ کہ زحمت کا۔",
    "english": "It is Sunnah to recite the prayer 'O Allah, make it a beneficial downpour' when it rains, asking for mercy and benefit instead of harm."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1032)",
      "english": "Sahih al-Bukhari (1032)"
    },
    {
      "arabic": "سنن النسائي (1523)",
      "english": "Sunan An-Nasa'i (1523)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=dua+for+rain+hadith+explanation+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بارش اور دعا کا تعلق",
        "english": "Connection Between Rain and Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبولیت کا وقت",
              "english": "Time of Acceptance"
            },
            "content": {
              "urdu": [
                "بارش کا وقت اللہ کی رحمت کے نزول کا وقت ہوتا ہے۔",
                "روایات کے مطابق بارش کے دوران مانگی جانے والی دعا رد نہیں ہوتی۔",
                "مومن کو چاہیے کہ اس موقع پر اپنے اور امت کے لیے خیر مانگے۔"
              ],
              "english": [
                "The time of rain is a time when Allah's mercy descends upon us.",
                "According to traditions, supplications made during rain are not rejected.",
                "A believer should seek goodness for themselves and the Ummah at this time."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوف اور امید کا توازن",
              "english": "Balance of Fear and Hope"
            },
            "content": {
              "urdu": [
                "بارش رحمت بھی ہو سکتی ہے اور عذاب کی صورت بھی اختیار کر سکتی ہے۔",
                "نبی ﷺ بادل دیکھ کر فکر مند ہوتے تھے کہ کہیں یہ عذاب نہ ہو۔",
                "یہ دعا اس خوف کو امید اور نفع میں بدلنے کی التجا ہے۔"
              ],
              "english": [
                "Rain can be a source of mercy or take the form of a punishment.",
                "The Prophet (ﷺ) grew concerned upon seeing clouds, fearing divine wrath.",
                "This prayer is a plea to turn that fear into hope and benefit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کے الفاظ کی حکمت",
        "english": "Wisdom of the Prayer's Wording"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظ 'صیب' کی وضاحت",
              "english": "Explanation of 'Sayyiban'"
            },
            "content": {
              "urdu": [
                "'صیب' اس بارش کو کہتے ہیں جو بہت زیادہ اور موسلا دھار ہو۔",
                "نبی ﷺ نے کثرت کے ساتھ ساتھ معیار (نفع) کی بھی دعا کی۔",
                "صرف بارش کا ہونا کافی نہیں، اس کا کارآمد ہونا اصل نعمت ہے۔"
              ],
              "english": [
                "'Sayyib' refers to a heavy and abundant downpour of rain.",
                "The Prophet (ﷺ) prayed for quality (benefit) alongside quantity.",
                "Mere rain is not enough; its usefulness is the true blessing."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفع بخش بارش کی طلب",
              "english": "Requesting Beneficial Rain"
            },
            "content": {
              "urdu": [
                "ایسی بارش جو زمین کو زندگی دے اور فصلوں کو اگائے۔",
                "ایسی بارش سے پناہ مانگی گئی جو سیلاب یا تباہی کا باعث بنے۔",
                "دعا میں جامعیت رسول اللہ ﷺ کے کلام کا خاصہ ہے۔"
              ],
              "english": [
                "Prayer is for rain that gives life to earth and grows crops.",
                "Refuge is sought from rain that causes floods or destruction.",
                "Conciseness and comprehensiveness are traits of the Prophet's (ﷺ) speech."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اتباعِ سنت کا اسلوب",
        "english": "Style of Following the Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطری مظاہر پر ذکر",
              "english": "Remembrance During Natural Events"
            },
            "content": {
              "urdu": [
                "مسلمان ہر قدرتی تبدیلی کو اللہ کی طرف منسوب کرتا ہے۔",
                "بارش دیکھ کر فوری دعا کرنا بندگی اور تعلق باللہ کی دلیل ہے۔",
                "یہ عمل غفلت کو دور کر کے دل کو خالق کی طرف موڑتا ہے۔"
              ],
              "english": [
                "A Muslim attributes every natural change to Allah Almighty.",
                "Immediate prayer upon seeing rain proves servitude and connection to Allah.",
                "This act removes heedlessness and turns the heart toward the Creator."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ مستمرہ کی پیروی",
              "english": "Adhering to Regular Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا یہ معمول دائمی تھا کہ جب بھی بارش دیکھتے یہ کہتے۔",
                "چھوٹی سنتوں پر عمل کرنا بڑی برکات کا ذریعہ بنتا ہے۔",
                "ہمیں چاہیے کہ اپنے بچوں کو یہ مسنون دعائیں یاد کروائیں۔"
              ],
              "english": [
                "It was the Prophet's (ﷺ) regular habit to say this whenever it rained.",
                "Implementing minor Sunnahs becomes a source of major blessings.",
                "We must ensure we teach our children these Prophetic supplications."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مثبت سوچ کی اہمیت",
              "english": "Importance of Positive Thinking"
            },
            "content": {
              "urdu": [
                "بارش کو زحمت سمجھنے کے بجائے اسے رحمت بنانے کی دعا کرنی چاہیے۔",
                "مومن ہمیشہ خیر کی امید رکھتا ہے اور برائی سے پناہ مانگتا ہے۔",
                "دعا انسان کے اندر عاجزی اور اللہ پر بھروسہ پیدا کرتی ہے۔"
              ],
              "english": [
                "Instead of viewing rain as a nuisance, pray for it to be a mercy.",
                "A believer always hopes for good and seeks refuge from evil.",
                "Supplication develops humility and trust in Allah within a person."
              ]
            }
          },
          {
            "title": {
              "urdu": "قدرتی نعمتوں کا شکر",
              "english": "Gratitude for Natural Blessings"
            },
            "content": {
              "urdu": [
                "بارش اللہ کی طرف سے پانی کا ایک مفت اور عظیم انتظام ہے۔",
                "اس کی قدر کرنا اور اس کے نفع کے لیے دعا کرنا شکر گزاری ہے۔",
                "شکر کرنے سے اللہ تعالی نعمتوں میں مزید اضافہ فرماتا ہے۔"
              ],
              "english": [
                "Rain is a free and magnificent provision of water from Allah.",
                "Valuing it and praying for its benefit is a form of gratitude.",
                "By being grateful, Allah increases His blessings even further."
              ]
            }
          }
        ]
      }
    }
  ]
}
