{
  "hadithId": 1282,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bukhari:33", "muslim:59"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (33)، ومسلم (59). ورواية عبد الله بن عمرو عند البخاري (34) ومسلم (58) بلفظ: أربع من كن فيه كان منافقاً خالصاً.",
    "urdu": "یہ حدیث صحیح ہے اور متفق علیہ ہے۔ اسے امام بخاری (33) اور امام مسلم (59) نے روایت کیا ہے۔ عبداللہ بن عمرو کی روایت (بخاری: 34) میں چار خصلتوں کا ذکر ہے جس میں جھگڑے کے وقت بدزبانی بھی شامل ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (33) and Muslim (59). The narration of 'Abdullah bin 'Amr is also in Bukhari (34) and Muslim (58), mentioning four traits that make one a pure hypocrite."
  },
  "importantWords": [
    {
      "arabic": "آيَةُ",
      "english": "Sign / Mark",
      "urdu": "نشانی / علامت"
    },
    {
      "arabic": "الْمُنَافِقِ",
      "english": "Hypocrite",
      "urdu": "منافق"
    },
    {
      "arabic": "أَخْلَفَ",
      "english": "Broke (promise)",
      "urdu": "خلاف ورزی کی"
    },
    {
      "arabic": "ائْتُمِنَ",
      "english": "Entrusted",
      "urdu": "امانت رکھی گئی"
    },
    {
      "arabic": "خَاصَمَ",
      "english": "Quarreled",
      "urdu": "جھگڑا کیا"
    },
    {
      "arabic": "فَجَرَ",
      "english": "Behaved obscenely",
      "urdu": "بدزبانی کی / گالی دی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث منافقانہ کردار کی پہچان کرواتی ہے تاکہ مسلمان جھوٹ، وعدہ خلافی، خیانت اور بدزبانی جیسی قبیح عادات سے بچ کر اپنے ایمان کی حفاظت کریں۔",
    "english": "This Hadith identifies the character of a hypocrite, warning Muslims to guard their faith by avoiding lying, breaking promises, betrayal, and foul language."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (33)",
      "english": "Sahih al-Bukhari (33)"
    },
    {
      "arabic": "صحيح مسلم (59)",
      "english": "Sahih Muslim (59)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9NOnXh6g5U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نفاق کی اقسام",
        "english": "Types of Hypocrisy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتقادی بمقابلہ عملی نفاق",
              "english": "Belief vs Practical Hypocrisy"
            },
            "content": {
              "urdu": [
                "اعتقادی نفاق یہ ہے کہ دل میں کفر ہو اور زبان پر اسلام، یہ کفر ہے۔",
                "عملی نفاق یہ ہے کہ ایمان تو ہو مگر عادات منافقوں جیسی ہوں۔",
                "اس حدیث میں عملی نفاق کی مذمت کی گئی ہے تاکہ کردار کی اصلاح ہو۔"
              ],
              "english": [
                "Hypocrisy in belief is hiding disbelief while claiming Islam; this is Kufr.",
                "Practical hypocrisy is having faith but acting like a hypocrite.",
                "This Hadith condemns practical hypocrisy to encourage character reform."
              ]
            }
          },
          {
            "title": {
              "urdu": "کردار کی اہمیت",
              "english": "Importance of Character"
            },
            "content": {
              "urdu": [
                "اسلام صرف عبادات کا نام نہیں بلکہ معاملات کی درستگی بھی ہے۔",
                "سچا مومن وہی ہے جس کے قول و فعل میں تضاد نہ ہو۔",
                "نفاق کی علامات ایمان کی جڑوں کو کمزور کر دیتی ہیں۔"
              ],
              "english": [
                "Islam is not just about worship but also about honest dealings.",
                "A true believer is one whose actions match their words.",
                "The signs of hypocrisy weaken the very foundations of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اخلاقیات",
        "english": "Social Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچائی اور امانت",
              "english": "Truthfulness and Trust"
            },
            "content": {
              "urdu": [
                "جھوٹ بولنا تمام برائیوں کی جڑ اور منافق کی پہلی نشانی ہے۔",
                "امانت میں خیانت کرنا معاشرتی اعتماد کو ٹھیس پہنچاتا ہے۔",
                "مومن کی پہچان اس کی سچائی اور دیانتداری سے ہوتی ہے۔"
              ],
              "english": [
                "Lying is the root of all evils and the first sign of a hypocrite.",
                "Betraying a trust damages the fabric of social confidence.",
                "A believer is recognized by their truthfulness and integrity."
              ]
            }
          },
          {
            "title": {
              "urdu": "عہد کی پاسداری",
              "english": "Keeping Promises"
            },
            "content": {
              "urdu": [
                "وعدہ پورا کرنا ایک عظیم اسلامی اور انسانی صفت ہے۔",
                "وعدہ خلافی سے باہمی تعلقات اور ساکھ متاثر ہوتی ہے۔",
                "قرآن میں بھی عہد کی پاسداری کا سختی سے حکم دیا گیا ہے۔"
              ],
              "english": [
                "Fulfilling promises is a great Islamic and human virtue.",
                "Breaking promises negatively impacts relationships and reputation.",
                "The Quran strictly commands the fulfillment of covenants."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جذبات پر قابو اور زبان",
        "english": "Emotional Control and Tongue"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جھگڑے میں بدزبانی",
              "english": "Foul Language in Disputes"
            },
            "content": {
              "urdu": [
                "منافق غصے کے وقت اپنی زبان پر قابو نہیں رکھ پاتا۔",
                "گالی گلوچ کرنا اور حد سے گزر جانا کمزور کردار کی علامت ہے۔",
                "مومن اختلاف کے باوجود اخلاق کا دامن ہاتھ سے نہیں چھوڑتا۔"
              ],
              "english": [
                "A hypocrite fails to control their tongue during moments of anger.",
                "Using foul language and exceeding limits is a sign of weak character.",
                "A believer maintains good manners even during disagreements."
              ]
            }
          },
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "زبان کا غلط استعمال انسان کو نفاق کے قریب کر دیتا ہے۔",
                "حق گوئی اور نرم کلامی ایمان کی خوبصورتی ہے۔",
                "قیامت کے دن زبان کا حساب بہت سخت لیا جائے گا۔"
              ],
              "english": [
                "Misuse of the tongue brings a person closer to hypocrisy.",
                "Speaking the truth and kindness are the beauties of faith.",
                "The accountability of the tongue will be severe on Judgment Day."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصلاحِ نفس کا طریقہ",
        "english": "Method of Self-Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اپنا محاسبہ کرنا",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "ہمیں دیکھنا چاہیے کہ کہیں ہم میں ان میں سے کوئی عادت تو نہیں۔",
                "صحابیِ رسول بھی اپنے بارے میں نفاق کا ڈر رکھتے تھے۔",
                "ان عادات سے چھٹکارا پانا ہی اصل توبہ اور اصلاح ہے۔"
              ],
              "english": [
                "We must check if any of these traits exist within ourselves.",
                "Even the Sahaba feared hypocrisy for their own souls.",
                "Getting rid of these habits is the true form of repentance."
              ]
            }
          },
          {
            "title": {
              "urdu": "مستقل مزاجی",
              "english": "Consistency in Good"
            },
            "content": {
              "urdu": [
                "سچائی اور امانت داری کو اپنی زندگی کا مستقل حصہ بنائیں۔",
                "مشکل وقت میں بھی وعدہ پورا کرنا اصل امتحان ہے۔",
                "نبی ﷺ کے اخلاق کو نمونہ بنا کر ہی نفاق سے بچا جا سکتا ہے۔"
              ],
              "english": [
                "Make truth and honesty a permanent part of your life.",
                "Keeping a promise during hard times is the real test.",
                "Hypocrisy can only be avoided by following the Prophet's (ﷺ) manners."
              ]
            }
          }
        ]
      }
    }
  ]
}