{
  "hadithId": 712,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/80"],
    "kitabId": 7,
    "inKitabBab": 4,
    "arabicBook": "كتاب البيوع",
    "babId": 45
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري ( 2192 )‏، ومسلم ( 1539 ).‏ والحديث استثناء من تحريم المزابنة.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2192) اور امام مسلم (1539) نے روایت کیا ہے۔ یہ حدیث بیعِ مزابنہ کی ممانعت سے ایک خاص استثنا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2117) and Muslim (1539). This Hadith serves as a specific exception to the general prohibition of Al-Muzabanah."
  },
  "importantWords": [
    {
      "arabic": "رَخَّصَ",
      "english": "Granted a concession",
      "urdu": "رخصت دی / اجازت دی"
    },
    {
      "arabic": "الْعَرَايَا",
      "english": "Araya (Gifts of date trees)",
      "urdu": "عرایا (عریہ کی جمع)"
    },
    {
      "arabic": "بِخَرْصِهَا",
      "english": "By estimation",
      "urdu": "اندازے سے"
    },
    {
      "arabic": "رُطَبًا",
      "english": "Fresh dates",
      "urdu": "تازہ کھجوریں"
    },
    {
      "arabic": "كَيْلاً",
      "english": "By measure",
      "urdu": "ناپ کر / ماپ کر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'بیعِ عرایا' کا ذکر ہے، جو کہ ایک غریب آدمی کو یہ سہولت دیتی ہے کہ وہ درخت پر لگی تازہ کھجوروں کو اپنے پاس موجود خشک کھجوروں سے اندازے کے مطابق بدل سکے، جبکہ عام حالات میں ایسا سودا 'مزابنہ' ہونے کی وجہ سے منع ہے۔",
    "english": "This Hadith explains 'Bay' al-Araya,' a concession allowing the exchange of unpicked fresh dates on trees for an estimated amount of dried dates, primarily to facilitate poor families who wish to eat fresh fruit."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب البيوع",
      "english": "Sahih Muslim, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "زيد بن ثابت",
        "english": "Zaid bin Thabit"
      },
      "slug": "zaid-bin-thabit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیعِ عرایا کا مفہوم",
        "english": "The Concept of Bay' al-Araya"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مزابنہ سے استثنا",
              "english": "Exception from Muzabanah"
            },
            "content": {
              "urdu": [
                "عام طور پر درخت پر لگی کھجور کو توڑی ہوئی کھجور سے بدلنا 'مزابنہ' کہلاتا ہے جو منع ہے۔",
                "لیکن غریب لوگوں کی ضرورت کے پیشِ نظر آپ ﷺ نے پانچ وسق تک کی اجازت دی۔",
                "اس میں مقصد تجارت یا نفع خوری نہیں بلکہ انسانی ضرورت پوری کرنا ہے۔"
              ],
              "english": [
                "Generally, exchanging dates on trees for picked ones is 'Muzabanah' and is forbidden.",
                "The Prophet (ﷺ) allowed an exception up to five 'Wasqs' for those in need.",
                "The primary goal here is meeting human needs rather than commercial profit."
              ]
            }
          },
          {
            "title": {
              "urdu": "اندازے کی بنیاد (خرص)",
              "english": "Basis of Estimation (Khars)"
            },
            "content": {
              "urdu": [
                "درخت پر لگی کھجوروں کا درست وزن ممکن نہیں، اس لیے ماہرین کا اندازہ معتبر مانا گیا۔",
                "تاکہ خریدار اور بیچنے والے میں سے کسی کی حق تلفی نہ ہو۔",
                "اسلامی قانون میں ضرورت کے وقت کچھ شرائط میں نرمی دی جاتی ہے۔"
              ],
              "english": [
                "Accurate weighing of unpicked dates is impossible, so expert estimation is used.",
                "This ensures that neither the buyer nor the seller is treated unfairly.",
                "Islamic law provides flexibility in certain conditions during times of necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سماجی حکمت",
        "english": "Juristic and Social Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غرباء کی رعایت",
              "english": "Facilitating the Poor"
            },
            "content": {
              "urdu": [
                "کچھ انصاری صحابہ کے پاس باغات نہ تھے مگر وہ تازہ کھجوریں کھانا چاہتے تھے۔",
                "آپ ﷺ نے انہیں اجازت دی کہ وہ اپنے پاس موجود خشک کھجوروں سے بدل لیں۔",
                "یہ حکم ثابت کرتا ہے کہ شریعت سماجی ضروریات اور انسانی خواہشات کا خیال رکھتی ہے۔"
              ],
              "english": [
                "Some Ansar did not own orchards but desired to eat fresh dates.",
                "The Prophet (ﷺ) allowed them to exchange their dried dates for fresh ones on trees.",
                "This ruling proves Sharia accounts for social needs and human desires."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدود کا تعین",
              "english": "Defining Limits"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک یہ رخصت صرف پانچ وسق (تقریباً 650 کلو) تک محدود ہے۔",
                "اس سے زیادہ کی اجازت نہیں کیونکہ پھر یہ خالص بیعِ غرر بن جائے گی۔",
                "اسلامی رخصتیں ہمیشہ مخصوص حدود اور قواعد کے تابع ہوتی ہیں۔"
              ],
              "english": [
                "Jurists limit this concession to five 'Wasqs' (approx. 650 kg).",
                "Exceeding this is disallowed as it would become a purely speculative sale (Gharar).",
                "Islamic concessions are always subject to specific limits and regulations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصولِ فقہ کا نکتہ",
        "english": "Point of Usul al-Fiqh"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت اور ممنوعات",
              "english": "Necessity and Prohibitions"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس قاعدے کی دلیل ہے کہ 'ضرورت ممنوع چیزوں کو مباح کر دیتی ہے'۔",
                "مگر یہ اباحت صرف ضرورت کی حد تک اور شرائط کے ساتھ ہوتی ہے۔",
                "شریعت کا مقصد لوگوں کے لیے تنگی نہیں بلکہ آسانی پیدا کرنا ہے۔"
              ],
              "english": [
                "This Hadith supports the maxim: 'Necessity renders prohibited things permissible.'",
                "However, this permissibility is restricted to the extent of the need and specific conditions.",
                "The objective of Sharia is to create ease, not hardship, for the people."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور رخصت",
              "english": "Piety and Concessions"
            },
            "content": {
              "urdu": [
                "اللہ کو رخصتوں پر عمل کرنا ویسا ہی پسند ہے جیسا کہ فرائض پر۔",
                "مشکل حالات میں رخصت سے فائدہ اٹھانا دین کی روح کے خلاف نہیں۔",
                "مومن کو چاہیے کہ وہ دین میں موجود جائز سہولیات کو پہچانے۔"
              ],
              "english": [
                "Allah loves for His concessions to be acted upon just as His obligations.",
                "Utilizing concessions in difficult times is not contrary to the spirit of faith.",
                "A believer should recognize and appreciate the legitimate facilities provided in religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیر خواہی کا جذبہ",
              "english": "Spirit of Goodwill"
            },
            "content": {
              "urdu": [
                "باغات کے مالکان کو چاہیے کہ وہ ضرورت مندوں کے ساتھ تعاون کریں۔",
                "معاشرے میں لین دین کے وقت دوسروں کی مجبوری کا احساس کرنا چاہیے۔",
                "اسلامی معاشرت ہمدردی اور باہمی مدد کی بنیاد پر قائم ہے۔"
              ],
              "english": [
                "Orchard owners should cooperate with those in need.",
                "Individuals should be mindful of others' constraints during transactions.",
                "Islamic society is built on compassion and mutual assistance."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاملات میں توازن",
              "english": "Balance in Dealings"
            },
            "content": {
              "urdu": [
                "قوانین کی سختی کے ساتھ ساتھ انسانی ضروریات کا توازن رکھنا سنت ہے۔",
                "اگر کسی خاص صورتحال میں قانونی رعایت مل رہی ہو تو اس کا ناجائز فائدہ نہ اٹھائیں۔",
                "دیانتدارانہ اندازہ لگانا بھی ایک اخلاقی ذمہ داری ہے۔"
              ],
              "english": [
                "Balancing strict laws with human needs is a Sunnah.",
                "If a legal concession is available for a specific situation, do not exploit it unfairly.",
                "Making an honest and fair estimation is also an ethical responsibility."
              ]
            }
          }
        ]
      }
    }
  ]
}