{
  "hadithId": 224,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري في كتاب الأذان، باب القراءة في الظهر والعصر (759)، ومسلم في كتاب الصلاة، باب القراءة في الظهر والعصر (451).",
    "urdu": "صحیح متفق علیہ۔ اسے بخاری نے کتاب الأذان، باب القراءة فی الظھر والعصر (759) میں اور مسلم نے کتاب الصلاة، باب القراءة فی الظھر والعصر (451) میں روایت کیا ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). Reported by Al-Bukhari in the Book of Adhan, Chapter: Recitation in Zuhr and 'Asr (759), and by Muslim in the Book of Prayer, Chapter: Recitation in Zuhr and 'Asr (451)."
  },
  "importantWords": [
    {
      "arabic": "يُصَلِّي بِنَا",
      "english": "He used to lead us in prayer",
      "urdu": "ہمیں نماز پڑھاتے تھے"
    },
    {
      "arabic": "الظُّهْرِ وَالْعَصْرِ",
      "english": "Zuhr and 'Asr (prayers)",
      "urdu": "ظہر اور عصر کی نماز"
    },
    {
      "arabic": "الرَّكْعَتَيْنِ الْأُولَيَيْنِ",
      "english": "The first two Rak'ah",
      "urdu": "پہلی دو رکعتیں"
    },
    {
      "arabic": "سُورَتَيْنِ",
      "english": "Two (additional) Surahs",
      "urdu": "دو سورتیں"
    },
    {
      "arabic": "يُسْمِعُنَا الْآيَةَ",
      "english": "Make us hear a verse",
      "urdu": "کبھی ہمیں کوئی آیت سنا دیتے"
    },
    {
      "arabic": "يُطَوِّلُ الرَّكْعَةَ الْأُولَى",
      "english": "He would lengthen the first Rak'ah",
      "urdu": "پہلی رکعت لمبی کرتے تھے"
    },
    {
      "arabic": "الْأُخْرَيَيْنِ",
      "english": "The last two (Rak'ah)",
      "urdu": "آخری دو رکعتیں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ظہر اور عصر کی نمازوں میں قرأت کے مسنون طریقہ کو بیان کرتی ہے، جو کہ سِری (آہستہ) قرأت والی نمازیں ہیں۔ نبی صلی اللہ علیہ وسلم پہلی دو رکعتوں میں سورۃ فاتحہ کے ساتھ دو مزید سورتیں پڑھتے تھے اور پہلی رکعت کو دوسری سے لمبا کرتے تھے۔ آخری دونوں رکعتوں میں صرف سورۃ فاتحہ پر اکتفا کرتے تھے، اور کبھی کبھار مقتدیوں کو سننے کے لیے کوئی آیت بلند آواز سے پڑھ دیتے تھے تاکہ سنت کی تعلیم ہو جائے۔",
    "english": "This Hadith clarifies the Sunnah method of recitation in Zuhr and 'Asr prayers, which are silent (Sirrī) prayers. The Prophet (PBUH) would recite Al-Fātiḥah along with two additional Surahs in the first two Rak'ah, lengthening the first Rak'ah more than the second. In the final two Rak'ah, he would only recite Al-Fātiḥah. Occasionally, he would recite a verse audibly for the followers to hear, serving as a teaching of the Sunnah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأذان، باب القراءة في الظهر والعصر (759)",
      "english": "Sahih Al-Bukhari, Book of Adhan, Chapter: Recitation in Zuhr and 'Asr (759)"
    },
    {
      "arabic": "صحيح مسلم، كتاب الصلاة، باب القراءة في الظهر والعصر (451)",
      "english": "Sahih Muslim, Book of Prayer, Chapter: Recitation in Zuhr and 'Asr (451)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abu Qatadah Al-Ansari"
      },
      "slug": "abu-qatadah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سِری نمازوں میں قرأت کا طریقہ",
        "english": "Method of Recitation in Silent Prayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پہلی دو رکعتوں کی اہمیت",
              "english": "Importance of the First Two Rak'ah"
            },
            "content": {
              "urdu": [
                "ظہر اور عصر کی نمازوں میں قرأت سِراً (آہستہ) ہوتی ہے، لیکن ان میں فاتحہ کے ساتھ دیگر سورتیں بھی پڑھی جاتی ہیں۔",
                "پہلی دو رکعتوں میں قرأت کا یہ حصہ سنت ہے اور پہلی رکعت کو لمبا کرنا مزید فضیلت کا باعث ہے۔",
                "دوسری رکعت کو تھوڑا ہلکا کرنا نبی صلی اللہ علیہ وسلم کے اعتدال کا طریقہ تھا۔"
              ],
              "english": [
                "Recitation in Zuhr and 'Asr prayers is silent (Sirrī), but Al-Fātiḥah along with additional Surahs is recited in them.",
                "This recitation part in the first two Rak'ah is Sunnah, and lengthening the first Rak'ah adds to the virtue.",
                "Shortening the second Rak'ah slightly was the Prophet's way of demonstrating moderation."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخری دو رکعتیں",
              "english": "The Last Two Rak'ah"
            },
            "content": {
              "urdu": [
                "آخری دونوں رکعتوں میں صرف سورۃ فاتحہ پڑھنا سنت سے ثابت ہے، جس پر فقہاء کا اتفاق ہے۔",
                "ان میں اضافی سورتیں نہ پڑھنا نماز کے آخری حصے میں ہلکا پن اور آسانی پیدا کرتا ہے۔",
                "اگرچہ ان میں بھی دوسری سورتیں پڑھنا جائز ہے، مگر نبی صلی اللہ علیہ وسلم کا غالب عمل صرف فاتحہ پڑھنا تھا۔"
              ],
              "english": [
                "Reciting only Surah Al-Fātiḥah in the final two Rak'ah is proven by the Sunnah and is agreed upon by jurists.",
                "Omitting additional Surahs in these Rak'ah brings lightness and ease to the final part of the prayer.",
                "Although reciting additional Surahs is permissible, the Prophet's predominant practice was reciting only Al-Fātiḥah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیم اور تطبیق کا طریقہ",
        "english": "Method of Teaching and Reconciliation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آیت کا سنا دینا",
              "english": "Reciting a Verse Audibly"
            },
            "content": {
              "urdu": [
                "سِری نمازوں میں کبھی کبھار کوئی آیت بلند آواز سے سنانا ایک تعلیمی مقصد کے تحت تھا تاکہ مقتدی جان لیں۔",
                "اس طرح سے مقتدیوں کو معلوم ہو جاتا تھا کہ امام نے قرآن کی قراءت کی ہے اور یہ سنت ہے۔",
                "یہ عمل اس بات کو ظاہر کرتا ہے کہ تعلیم اور سنت کی وضاحت بھی نماز کے اہم مقاصد میں سے ہے۔"
              ],
              "english": [
                "Reciting a verse audibly sometimes during silent prayers served an educational purpose, informing the followers.",
                "This way, the followers knew that the Imām had recited the Qur'an, and that this was the Sunnah.",
                "This practice indicates that teaching and clarifying the Sunnah are also important objectives of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "پہلی رکعت کی طوالت",
              "english": "Lengthening the First Rak'ah"
            },
            "content": {
              "urdu": [
                "پہلی رکعت کو لمبا کرنے کی حکمت یہ ہے کہ اس طرح مقتدیوں کو قراءت کا حق مل جاتا ہے۔",
                "جو لوگ دیر سے جماعت میں شامل ہوتے ہیں، انہیں پہلی رکعت میں شمولیت کا پورا موقع مل جاتا ہے۔",
                "نماز کے پہلے حصے کو طویل کرنے سے نمازی کو خشوع اور سکون کے لیے بھی زیادہ وقت ملتا ہے۔"
              ],
              "english": [
                "The wisdom behind lengthening the first Rak'ah is to allow the followers their right to recitation (of Al-Fātiḥah).",
                "Those joining the congregation late get a better opportunity to catch the first Rak'ah completely.",
                "Lengthening the initial part of the prayer also gives the worshipper more time for Khushu' and tranquility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اصول",
        "english": "Juristic and Practical Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقتدی کی قراءت",
              "english": "Recitation of the Follower"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ اصول اخذ ہوتا ہے کہ سِری نمازوں میں مقتدی پر بھی سورۃ فاتحہ پڑھنا فرض ہے۔",
                "چونکہ امام آہستگی سے پڑھتا ہے، لہٰذا مقتدی پر قراءت کا بوجھ نہیں ہٹتا، اور اسے خود پڑھنا چاہیے۔",
                "اگرچہ یہ حکم جہری نمازوں میں اختلاف کا باعث ہے، لیکن سری نمازوں میں مقتدی کا پڑھنا متفق علیہ ہے۔"
              ],
              "english": [
                "This Hadith implies that reciting Al-Fātiḥah is obligatory for the follower even in silent prayers.",
                "Since the Imām recites softly, the burden of recitation does not fall away from the follower, and they must recite it themselves.",
                "While this ruling causes disagreement in audible prayers, the follower's recitation in silent prayers is by consensus."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال کی پابندی",
              "english": "Adherence to Moderation"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے نماز کی طوالت اور اختصار میں ایک معتدل راستہ اختیار کیا، جو سنت ہے۔",
                "امام کو چاہیے کہ وہ نہ تو نماز کو بہت زیادہ لمبا کرے کہ لوگوں کو مشقت ہو، اور نہ ہی اتنا مختصر کرے کہ ارکان فوت ہو جائیں۔",
                "نماز کو مسنون طریقے پر ادا کرنے میں ہی خیر اور برکت ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) adopted a moderate path regarding the length and brevity of the prayer, which is the Sunnah.",
                "The Imām should neither prolong the prayer excessively, causing hardship, nor shorten it so much that the pillars are missed.",
                "True goodness and blessing lie in performing the prayer according to the Sunnah method."
              ]
            }
          }
        ]
      }
    }
  ]
}
