{
  "hadithId": 223,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أحمد (4/353)، وأبو داود في كتاب الصلاة، باب ما يجزئ من القراءة إذا لم يحسن القرآن (832)، والنسائي (2/143)، وابن حبان (1808)، والدارقطني (1/313)، والحاكم (1/241). هذا الحديث حسن بشواهده، ولفظه بتمامها: 'قال: يا رسول الله! هذا لله عز وجل، فما لي؟ قال: قل اللهم ارحمني وارزقني، وعافني، واهدني...'",
    "urdu": "حسن (درجہ)۔ اسے احمد (4/353)، ابو داؤد (832)، نسائی (2/143)، ابن حبان (1808)، دارقطنی (1/313)، اور حاکم (1/241) نے روایت کیا ہے۔ یہ حدیث شواہد کی بنا پر حسن ہے، اور اس کا مکمل متن یہ ہے: 'اس نے عرض کیا: اے اللہ کے رسول! یہ تو اللہ عزوجل کے لیے ہے، میرے لیے کیا ہے؟ فرمایا: کہہ: 'اللهم ارحمني وارزقني، وعافني، واهدني...' (اے اللہ مجھ پر رحم فرما، مجھے رزق دے، مجھے عافیت دے، اور مجھے ہدایت دے)۔'",
    "english": "Hasan (Good). Reported by Ahmad (4/353), Abu Dawud in the Book of Prayer, Chapter: What is sufficient for recitation if one does not know the Qur'an (832), An-Nasa’i (2/143), Ibn Hibbān (1808), Ad-Dāraquṭnī (1/313), and Al-Ḥākim (1/241). The Hadith is Hasan due to supporting evidence. The complete text includes the man's question: 'O Messenger of Allah! This is for Allah, the Mighty and Sublime, so what is for me?' He replied: 'Say: Allāhumma-rḥamnī, warzuqnī, wa 'āfinī, wa-hdinī...' (O Allah, have mercy on me, grant me sustenance, grant me well-being, and guide me...)'"
  },
  "importantWords": [
    {
      "arabic": "لَا أَسْتَطِيعُ",
      "english": "I am not able",
      "urdu": "میں نہیں کر سکتا"
    },
    {
      "arabic": "مَا يُجْزِئُنِي",
      "english": "What will suffice me",
      "urdu": "جو میرے لیے کافی ہو جائے"
    },
    {
      "arabic": "سُبْحَانَ اللَّهِ",
      "english": "Glory be to Allah",
      "urdu": "اللہ پاک ہے"
    },
    {
      "arabic": "وَلَا حَوْلٌ وَلَا قُوَّةً",
      "english": "There is no might and no power",
      "urdu": "نہیں ہے کوئی طاقت اور قوت"
    },
    {
      "arabic": "الْعَلِيِّ الْعَظِيمِ",
      "english": "The Most High, the Most Mighty",
      "urdu": "بلند اور عظمت والا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ان لوگوں کے لیے ایک آسانی اور رخصت فراہم کرتی ہے جو کسی وجہ سے نماز میں سورۃ فاتحہ یا قرآن کا کوئی حصہ نہیں پڑھ سکتے۔ نبی صلی اللہ علیہ وسلم نے فرمایا کہ ایسے شخص کے لیے تسبیحات (سبحان اللہ، الحمد للہ، اللہ اکبر، وغیرہ) پڑھ لینا کافی ہے، لیکن اسے اس کے ساتھ اپنے لیے دنیا اور آخرت کی بھلائی کی دعائیں بھی مانگنی چاہییں۔",
    "english": "This Hadith provides an ease and concession for those who cannot recite Al-Fātiḥah or any part of the Qur'an in prayer due to an inability. The Prophet (PBUH) instructed that such a person can suffice with reciting certain phrases of glorification (Tasbīhāt) like 'Subḥāna Allāhi,' 'Al-Ḥamdu Lillāh,' 'Allāhu Akbar,' etc. However, he should also supplicate for the good of this world and the Hereafter."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب ما يجزئ من القراءة إذا لم يحسن القرآن (832)",
      "english": "Sunan Abu Dawud, Book of Prayer, Chapter: What is sufficient for recitation if one does not know the Qur'an (832)"
    },
    {
      "arabic": "سنن النسائي، كتاب الافتتاح، باب الإجزاء من القراءة لمن لم يحسن القرآن (2/143)",
      "english": "Sunan An-Nasa’i, Book of Opening the Prayer, Chapter: Sufficiency of recitation for one who does not know the Qur'an (2/143)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن أبي أوفى",
        "english": "Abdullāh ibn Abī Awfā"
      },
      "slug": "abdullah-ibn-abi-awfa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "حسن",
    "english": "Good (Hasan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں قراءت کا متبادل",
        "english": "Alternative to Recitation in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن نہ پڑھ سکنے کی صورت",
              "english": "Inability to Recite the Qur'an"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس شخص کے لیے ہے جو نیا مسلمان ہوا ہو یا کسی عذر کی بنا پر سورۃ فاتحہ یا کوئی اور سورت یاد نہ کر سکے۔",
                "نبی صلی اللہ علیہ وسلم نے ایسے شخص کو چار کلماتِ ذکر (سبحان اللہ، الحمد للہ، لا الہ الا اللہ، اللہ اکبر) سکھائے۔",
                "یہ کلمات چونکہ اللہ کی تعظیم اور وحدانیت کو بیان کرتے ہیں، اس لیے یہ قراءت کا متبادل بن جاتے ہیں۔"
              ],
              "english": [
                "This Hadith is a concession for someone who is a new Muslim or cannot memorize Al-Fātiḥah/other surahs due to a valid excuse.",
                "The Prophet (PBUH) taught such a person four phrases of remembrance (Tasbīhāt) to suffice them.",
                "These phrases, by glorifying Allah and affirming Monotheism, serve as a valid substitute for recitation."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی اور وسعت",
              "english": "Ease and Scope"
            },
            "content": {
              "urdu": [
                "یہ حکم اس بات کی دلیل ہے کہ اللہ تعالیٰ دین میں آسانی پیدا کرنا چاہتا ہے، اور کسی کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا۔",
                "مسلمان کو چاہیے کہ وہ ان کلمات پر اکتفا نہ کرے بلکہ حتی الامکان جلد از جلد قرآن کا کچھ حصہ یاد کرے۔",
                "ذکر کا یہ طریقہ قراءت کے فرض کو اس وقت تک پورا کرتا ہے جب تک قاری قراءت پر قادر نہ ہو جائے۔"
              ],
              "english": [
                "This ruling proves that Allah intends ease in religion and does not burden anyone beyond their capacity.",
                "A Muslim should not rely solely on these phrases but strive to memorize some part of the Qur'an as soon as possible.",
                "This method of Dhikr fulfills the obligation of recitation until the person is able to recite the Qur'an."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ذکر اور دعا کا فرق",
        "english": "Distinction Between Dhikr and Du'a"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی ثنا اور اپنی حاجت",
              "english": "Praising Allah and One's Needs"
            },
            "content": {
              "urdu": [
                "پہلا حصہ (سبحان اللہ...) مکمل طور پر اللہ کی حمد و ثنا اور عظمت کے لیے وقف ہے۔",
                "جب صحابی نے اپنے لیے دعا کا پوچھا تو نبی صلی اللہ علیہ وسلم نے دوسرا حصہ سکھایا ('اللهم ارحمني وارزقني...')۔",
                "یہ تعلیم یہ بتاتی ہے کہ نماز میں اللہ کی ثنا کرنا اور اپنی حاجتیں طلب کرنا دونوں مسنون ہیں۔"
              ],
              "english": [
                "The first part ('Subḥāna Allāhi...') is dedicated entirely to the praise and glorification of Allah.",
                "When the Companion asked for a supplication for himself, the Prophet taught him the second part ('Allāhumma-rḥamnī...').",
                "This teaching indicates that both praising Allah and asking for one's needs are Sunnah in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی قبولیت",
              "english": "Acceptance of the Supplication"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کا یہ فرمانا کہ 'اس شخص نے اپنا ہاتھ بھلائی سے بھر لیا' دعا کی قبولیت کی بشارت ہے۔",
                "یہ اس بات کی دلیل ہے کہ جب بندہ عاجزی سے اللہ کے حضور اپنی مجبوری بیان کرتا ہے تو اللہ قبول فرماتا ہے۔",
                "یہ عمل مسلمانوں کو یہ سکھاتا ہے کہ وہ نماز میں صرف ثنا نہیں بلکہ دنیا و آخرت کی دعائیں بھی مانگیں۔"
              ],
              "english": [
                "The Prophet's statement that 'this man filled his hand with goodness' is a glad tiding of the supplication's acceptance.",
                "It proves that when a servant humbly expresses his helplessness before Allah, Allah accepts his plea.",
                "This practice teaches Muslims to include not only praise but also supplications for this world and the Hereafter in their prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور علمی درجہ بندی",
        "english": "Juristic and Scholarly Grading"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسن سند کا جواز",
              "english": "Justification of Hasan Chain"
            },
            "content": {
              "urdu": [
                "محدثین کی ایک جماعت نے اس حدیث کو ضعیف تسلیم کیا، لیکن ابن حبان اور حاکم نے اسے صحیح قرار دیا۔",
                "اس کی سند میں 'ابراہیم سکسکی' پر کلام ہوا ہے، لیکن اس کے شواہد (جیسے رفاعہ بن رافع کی حدیث) اس کو حسن بنا دیتے ہیں۔",
                "چنانچہ، یہ حکم فقہی طور پر قابل عمل ہے اور اس پر عمل کرنا جائز ہے۔"
              ],
              "english": [
                "A group of earlier Hadith scholars considered the Hadith weak, but Ibn Hibbān and Al-Ḥākim deemed it authentic.",
                "The chain is criticized due to 'Ibrahim Al-Saksaki,' but supporting reports (like the Hadith of Rifa'ah ibn Rafi') elevate its status to Ḥasan.",
                "Consequently, this ruling is juristically actionable and permissible to follow."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کے ارکان میں قراءت",
              "english": "Recitation Among the Pillars of Prayer"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس بات کی تصدیق کرتی ہے کہ سورۃ فاتحہ یا اس کا متبادل (ذکر) پڑھنا نماز کا ایک اہم رکن ہے۔",
                "جو شخص یہ تسبیحات بھی نہیں پڑھ سکتا، تو اس کے لیے خاموش رہنا یا زیادہ تر ارکان میں خاموش رہنا بھی جائز ہے۔",
                "لیکن جس پر قراءت فرض ہے (جیسے منفرد) اور وہ جان بوجھ کر چھوڑے تو نماز باطل ہے۔"
              ],
              "english": [
                "This Hadith confirms that reciting Surah Al-Fātiḥah or its substitute (Dhikr) is a major pillar of the prayer.",
                "For a person unable to recite even these Tasbīhāt, remaining silent or mostly silent during the recitation pillar is permissible.",
                "However, if recitation is obligatory (like for one praying alone) and they deliberately omit it, the prayer is invalid."
              ]
            }
          }
        ]
      }
    }
  ]
}
