{
  "hadithId": 1102,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/23"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "ضعيف لكونه مرسلاً. أخرجه أبو داود في مراسيله (335) والترمذي (1401) موقوفاً، والعقيلي في الضعفاء (2/244) موصولاً من طريق عبد الله بن خراش وهو ضعيف جداً. والحديث له شواهد من مرسل ابن إسحاق وسعيد بن المسيب.",
    "urdu": "یہ روایت مرسل ہونے کی وجہ سے ضعیف ہے۔ امام ابوداؤد نے اسے المراسیل (335) میں روایت کیا ہے۔ اس کی موصول سند میں عبداللہ بن خراش ہے جو کہ بہت ضعیف راوی ہے۔ تاہم ابن اسحاق اور سعید بن مسیب کی مراسیل میں اس کے شواهد موجود ہیں۔",
    "english": "Weak due to being Mursal. Reported by Abu Dawud in al-Marasil (335). Its connected chain through al-Uqayli contains Abdullah bin Kharash who is very weak. However, there are supporting Mursal reports from Ibn Ishaq and Said bin al-Musayyib."
  },
  "importantWords": [
    {
      "arabic": "نَصَبَ",
      "english": "Set up / Installed",
      "urdu": "نصب کیا"
    },
    {
      "arabic": "اَلْمَنْجَنِيقَ",
      "english": "Catapult",
      "urdu": "منجنیق"
    },
    {
      "arabic": "أَهْلِ اَلطَّائِفِ",
      "english": "People of Ta'if",
      "urdu": "اہلِ طائف"
    },
    {
      "arabic": "اَلْمَرَاسِيلِ",
      "english": "Mursal reports",
      "urdu": "مراسیل (وہ حدیث جس میں تابعی براہ راست نبی ﷺ سے روایت کرے)"
    },
    {
      "arabic": "ثِقَاتٌ",
      "english": "Reliable narrators",
      "urdu": "ثقہ راوی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں غزوہ طائف کے دوران قلعے کی دیواریں گرانے کے لیے منجنیق (بڑے پتھر پھینکنے والی مشین) کے استعمال کا تذکرہ ہے، جو جنگی ٹیکنالوجی کے جواز پر دلالت کرتی ہے۔",
    "english": "This Hadith mentions the use of a catapult (Manjaniq) during the siege of Ta'if to breach the fortress walls, indicating the permissibility of using advanced military technology."
  },
  "references": [
    {
      "arabic": "مراسیل أبي داود (335)",
      "english": "Marasil Abi Dawud (335)"
    },
    {
      "arabic": "سنن الترمذي (1401)",
      "english": "Sunan at-Tirmidhi (1401)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "مكحول الشامي",
        "english": "Makul al-Shami"
      },
      "slug": "makul-al-shami"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "ضعيف (مرسل)",
    "english": "Da'if (Mursal)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جدید جنگی آلات کا استعمال",
        "english": "Use of Modern War Equipment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنگی ٹیکنالوجی کا جواز",
              "english": "Legality of Military Tech"
            },
            "content": {
              "urdu": [
                "منجنیق اس دور کا سب سے جدید اور بھاری جنگی ہتھیار سمجھا جاتا تھا۔",
                "نبی ﷺ کا اسے استعمال کرنا ثابت کرتا ہے کہ ضرورت پڑنے پر جدید آلات استعمال کیے جا سکتے ہیں۔",
                "اسلامی جنگی حکمت عملی میں دشمن کی قوت کو توڑنے کے لیے مادی اسباب اختیار کرنا درست ہے۔"
              ],
              "english": [
                "The catapult was considered the most advanced heavy weaponry of that era.",
                "The Prophet's (ﷺ) use of it proves that modern equipment can be used when necessary.",
                "Islamic military strategy allows adopting material means to break the enemy's strength."
              ]
            }
          },
          {
            "title": {
              "urdu": "قلعہ بندی اور محاصرہ",
              "english": "Fortification and Siege"
            },
            "content": {
              "urdu": [
                "اہل طائف اپنے مضبوط قلعوں میں محصور ہو گئے تھے جس کی وجہ سے منجنیق ضروری تھی۔",
                "اس سے معلوم ہوا کہ قلعہ بند دشمن کے خلاف بھاری ہتھیاروں کا استعمال جائز ہے۔",
                "مقصد دشمن کی پناہ گاہوں کو ختم کر کے انہیں سر تسلیم خم کرنے پر مجبور کرنا تھا۔"
              ],
              "english": [
                "The people of Ta'if were fortified in strong castles, making the catapult necessary.",
                "This shows that heavy weaponry is permissible against a fortified enemy.",
                "The goal was to destroy enemy shelters and force them into submission."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عسکری احکام",
        "english": "Juristic and Military Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نادانستہ نقصان کی گنجائش",
              "english": "Allowance for Unintended Damage"
            },
            "content": {
              "urdu": [
                "منجنیق سے پتھر پھینکنے میں یہ خطرہ ہوتا ہے کہ عورتیں یا بچے بھی زد میں آ جائیں۔",
                "لیکن جب مقصد قلعہ فتح کرنا ہو تو نادانستہ ہلاکتیں معاف سمجھی جاتی ہیں۔",
                "یہ حکم اس صورت میں ہے جب دشمن کے شر کو ختم کرنے کے لیے اس کے سوا چارہ نہ ہو۔"
              ],
              "english": [
                "Firing stones with a catapult carries the risk of hitting women or children.",
                "However, when the objective is to conquer a fort, unintentional casualties are overlooked.",
                "This ruling applies when there is no other way to eliminate the enemy's threat."
              ]
            }
          },
          {
            "title": {
              "urdu": "تلاشِ اسباب",
              "english": "Seeking Strategic Means"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے اس غزوے میں دیگر آلات جیسے 'دبابہ' (لکڑی کا ٹینک) بھی استعمال کیے۔",
                "مسلمانوں کو چاہیے کہ وہ دفاع کے لیے بہترین سے بہترین ٹیکنالوجی حاصل کریں۔",
                "اللہ پر توکل کے ساتھ ساتھ اسباب کا مکمل حصول بھی سنتِ نبوی کا حصہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used other devices like the 'Dabbabah' (wooden tank) in this battle.",
                "Muslims should strive to acquire the best possible technology for defense.",
                "Full acquisition of means alongside trust in Allah is part of the Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت اور درایت",
        "english": "Narration and Analysis"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرسل روایات کی اہمیت",
              "english": "Importance of Mursal Reports"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حدیث مرسل ہے لیکن کتبِ سیرت میں اس کے متعدد شواہد موجود ہیں۔",
                "محدثین کے نزدیک جب مرسل روایات مختلف طرق سے آئیں تو وہ حجت بن جاتی ہیں۔",
                "امام ابوداؤد کا اسے اپنی 'المراسیل' میں لانا اس کی تاریخی اہمیت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Although this report is Mursal, it has numerous supporting accounts in Seerah books.",
                "Scholars hold that when Mursal reports come through multiple paths, they become proof.",
                "Imam Abu Dawud including it in his 'Al-Marasil' highlights its historical significance."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام عقیلی کی جرح",
              "english": "Critique by Imam al-Uqayli"
            },
            "content": {
              "urdu": [
                "امام عقیلی نے اسے ضعیف کہا کیونکہ اس کی موصول سند میں راوی مجروح تھا۔",
                "علم الحدیث میں سند کی باریکیوں پر توجہ دینا دین کی حفاظت کے لیے ضروری ہے۔",
                "ہمیں مستند تاریخ اور روایات کے درمیان فرق کو ملحوظ خاطر رکھنا چاہیے۔"
              ],
              "english": [
                "Imam al-Uqayli classified it as weak due to a flawed narrator in the connected chain.",
                "Attention to the nuances of chains in Hadith science is vital for preserving religion.",
                "We must maintain the distinction between authentic history and narrations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دورِ حاضر اور ٹیکنالوجی",
              "english": "Modern Era and Technology"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو سائنس اور ٹیکنالوجی کے میدان میں سبقت حاصل کرنی چاہیے۔",
                "طاقت کا توازن برقرار رکھنا دشمن کی جارحیت کو روکنے کے لیے ناگزیر ہے۔",
                "منجنیق کا استعمال ہمیں سکھاتا ہے کہ ہر دور کے چیلنجز کا مقابلہ اسی دور کے آلات سے کرنا ہے۔"
              ],
              "english": [
                "Muslims should strive for excellence in the fields of science and technology.",
                "Maintaining a balance of power is indispensable for deterring enemy aggression.",
                "The use of the catapult teaches us to meet the challenges of every era with its own tools."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمت اور تدبر",
              "english": "Wisdom and Deliberation"
            },
            "content": {
              "urdu": [
                "جنگ میں جذبات کے بجائے عقل اور حکمت سے کام لینا کامیابی کی کنجی ہے۔",
                "صحیح وقت پر صحیح ہتھیار کا انتخاب سپہ سالار کی بصیرت کا امتحان ہوتا ہے۔",
                "دینِ اسلام زندگی کے ہر موڑ پر عقل سلیم اور مصلحت کے استعمال کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Using intellect and wisdom rather than emotions in war is the key to success.",
                "Choosing the right weapon at the right time tests the foresight of the commander.",
                "Islam encourages the use of sound intellect and expediency at every turn of life."
              ]
            }
          }
        ]
      }
    }
  ]
}