{
  "hadithId": 641,
  "hadithNo": 35,
  "hadithReferences": {
    "sunnah.com": ["bulugh/641"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري ( 1764 )‏، ومسلم ( 1310 )‏.‏",
    "urdu": "صحیح۔ اسے امام بخاری (1764) نے روایت کیا ہے۔ یہ واقعہ منیٰ سے واپسی پر مکہ میں داخل ہونے سے پہلے کا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1764) and Muslim (1310). This took place after leaving Mina and before the final departure from Makkah."
  },
  "importantWords": [
    {
      "arabic": "رَقَدَ رَقْدَةً",
      "english": "Slept for a while",
      "urdu": "تھوڑی دیر آرام کیا / سو گئے"
    },
    {
      "arabic": "الْمُحَصَّبِ",
      "english": "Al-Muhassab (Place name)",
      "urdu": "محصب (مکہ اور منیٰ کے درمیان ایک جگہ)"
    },
    {
      "arabic": "طَافَ بِهِ",
      "english": "Performed Tawaf",
      "urdu": "اس (بیت اللہ) کا طواف کیا"
    },
    {
      "arabic": "رَكِبَ",
      "english": "Mounted / Rode",
      "urdu": "سوار ہوئے"
    }
  ],
  "summary": {
    "urdu": "حج کے مناسک سے فارغ ہو کر منیٰ سے واپسی پر مقامِ محصب میں قیام کرنا، آرام کرنا اور پھر طوافِ وداع کر کے رخصت ہونا سنتِ نبوی ہے۔",
    "english": "After completing the Hajj rituals and leaving Mina, it is Sunnah to halt at al-Muhassab, rest there, and then perform Tawaf al-Wada' (Farewell Tawaf) before final departure."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1764)",
      "english": "Reported by Al-Bukhari (1764)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مقامِ محصب میں قیام (تحصیب)",
        "english": "Staying at Al-Muhassab (Tahsib)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محصب کی پہچان",
              "english": "Identification of Al-Muhassab"
            },
            "content": {
              "urdu": [
                "محصب مکہ اور منیٰ کے درمیان ایک کھلی جگہ ہے، اسے 'ابطح' اور 'خیف بنی کنانہ' بھی کہا جاتا ہے۔",
                "نبی ﷺ نے منیٰ سے واپسی پر یہاں پڑاؤ ڈالا اور چار نمازیں ادا فرمائیں۔",
                "یہ وہی جگہ ہے جہاں قریش نے بنو ہاشم کے بائیکاٹ کا معاہدہ کیا تھا، آپ ﷺ نے وہاں قیام کر کے اسلام کی فتح کا اظہار فرمایا۔"
              ],
              "english": [
                "Al-Muhassab is an open space between Makkah and Mina, also known as al-Abtah or Khayf Bani Kinanah.",
                "The Prophet (ﷺ) camped here upon returning from Mina and performed four prayers.",
                "This was the site where the Quraysh signed the boycott against Bani Hashim; staying here symbolized the ultimate victory of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیام کی شرعی حیثیت",
              "english": "Legal Status of the Halt"
            },
            "content": {
              "urdu": [
                "علماء کے درمیان اختلاف ہے کہ کیا یہاں رکنا حج کی مستقل سنت ہے یا محض اتفاقی آرام کے لیے تھا۔",
                "سیدنا ابن عمر اور سیدنا انس اسے سنتِ مقصودہ سمجھتے تھے اور یہاں قیام کا اہتمام کرتے تھے۔",
                "سیدہ عائشہ اور سیدنا عباس کے نزدیک یہ سنت نہیں بلکہ محض تھکاوٹ دور کرنے کے لیے ایک پڑاؤ تھا۔"
              ],
              "english": [
                "Scholars differ on whether this halt is a formal Sunnah of Hajj or just a coincidental rest stop.",
                "Ibn 'Umar and Anas (RA) considered it an intended Sunnah and made sure to stay there.",
                "Aisha and Ibn 'Abbas (RA) believed it wasn't a ritual, but merely a resting place to recover from exhaustion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طوافِ وداع کی تیاری",
        "english": "Preparation for the Farewell Tawaf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آرام اور نشاط",
              "english": "Rest and Rejuvenation"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے طوافِ وداع سے پہلے آرام فرمایا تاکہ آخری عبادت مکمل نشاط اور یکسوئی کے ساتھ ادا کی جا سکے۔",
                "یہ عمل سکھاتا ہے کہ بڑی عبادت سے پہلے جسمانی آرام کا خیال رکھنا مستحسن ہے۔",
                "محصب میں تھوڑی دیر سونے کے بعد آپ ﷺ رات کے آخری پہر میں مکہ روانہ ہوئے۔"
              ],
              "english": [
                "The Prophet (ﷺ) rested before the Farewell Tawaf to perform the final ritual with energy and focus.",
                "This teaches that taking care of one's physical rest before major worship is recommended.",
                "After sleeping briefly at al-Muhassab, he proceeded to Makkah in the later part of the night."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخری عمل: طواف",
              "english": "The Final Act: Tawaf"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے مکہ چھوڑنے سے پہلے بیت اللہ کا طواف کیا، جسے طوافِ وداع کہتے ہیں۔",
                "اس طواف کے بعد آپ ﷺ نے مکہ میں قیام نہیں کیا بلکہ مدینہ کی طرف سفر شروع فرما دیا۔",
                "یہ حکم ہے کہ مکہ سے رخصتی کے وقت حاجی کا آخری عہد بیت اللہ کا طواف ہونا چاہیے۔"
              ],
              "english": [
                "Before leaving Makkah, the Prophet (ﷺ) performed Tawaf al-Wada' (the Farewell Tawaf).",
                "Following this Tawaf, he did not stay in Makkah but immediately began his journey back to Madinah.",
                "It is a general command that a pilgrim's final engagement in Makkah should be the Tawaf."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنتِ نبوی میں نظم و ضبط",
        "english": "Discipline in the Prophetic Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اوقاتِ نماز کا اہتمام",
              "english": "Observance of Prayer Timings"
            },
            "content": {
              "urdu": [
                "سفر اور تھکاوٹ کے باوجود نبی ﷺ نے تمام نمازیں اپنے وقت پر ادا فرمائیں۔",
                "مومن کے لیے نماز کسی بھی حال میں معاف نہیں ہے، خاص طور پر حج جیسے مبارک سفر میں۔",
                "یہ حدیث ایک مثالی مسافر کے شیڈول کی عکاسی کرتی ہے۔"
              ],
              "english": [
                "Despite travel and fatigue, the Prophet (ﷺ) offered all prayers at their respective times.",
                "Prayer is never excused for a believer, especially during a blessed journey like Hajj.",
                "This Hadith reflects the disciplined schedule of an ideal traveler."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور میانہ روی",
              "english": "Moderation and Balance"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے عبادت کے ساتھ ساتھ جسمانی ضرورت (نیند) کو بھی پورا کیا۔",
                "دینِ اسلام میں رہبانیت یا جسم کو بلا وجہ مشقت میں ڈالنا پسندیدہ نہیں ہے۔",
                "حقیقی بندگی یہ ہے کہ اللہ کے حقوق اور نفس کے حقوق کے درمیان توازن برقرار رکھا جائے۔"
              ],
              "english": [
                "The Prophet (ﷺ) fulfilled both spiritual duties and physical needs (sleep).",
                "Islam does not favor monasticism or putting the body through unnecessary hardship.",
                "True servitude lies in maintaining a balance between the rights of Allah and the rights of one's self."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیاری اور منصوبہ بندی",
              "english": "Preparation and Planning"
            },
            "content": {
              "urdu": [
                "کسی بھی کام کے اختتام پر بھی وہی مستعدی دکھانی چاہیے جو آغاز میں تھی۔",
                "طوافِ وداع حج کا 'فائنل ٹچ' ہے، اس کے لیے ترو تازہ ہونا ضروری ہے۔",
                "نبی ﷺ کا طرزِ عمل ہمیں ہر کام کو احسن طریقے سے مکمل کرنے کا سبق دیتا ہے۔"
              ],
              "english": [
                "The same diligence shown at the start of a task should be maintained until the end.",
                "Tawaf al-Wada' is the 'final touch' of Hajj; being refreshed for it is vital.",
                "The Prophet's (ﷺ) conduct teaches us to complete every task in the best possible manner."
              ]
            }
          },
          {
            "title": {
              "urdu": "خیر و برکت کے مقامات",
              "english": "Places of Goodness and Barakah"
            },
            "content": {
              "urdu": [
                "ایسی جگہوں پر رکنا جہاں اللہ کی نصرت آئی ہو (جیسے محصب)، ایمان کو تازگی بخشتا ہے۔",
                "صحابہ کرام نبی ﷺ کے نقشِ قدم پر چلنے میں فخر محسوس کرتے تھے۔",
                "اتباعِ سنت ہی وہ راستہ ہے جو انسان کو اللہ کے محبوب بندوں میں شامل کرتا ہے۔"
              ],
              "english": [
                "Stopping at places where Allah's help was manifested (like al-Muhassab) refreshes one's faith.",
                "The Sahaba took pride in following exactly in the Prophet's (ﷺ) footsteps.",
                "Adherence to the Sunnah is the path that includes a person among Allah's beloved servants."
              ]
            }
          }
        ]
      }
    }
  ]
}