{
  "hadithId": 1249,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:5783"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "كتاب اللباس",
    "babId": 102
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5783)، ومسلم (2085).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (5783) اور امام مسلم (2085) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5783) and Muslim (2085)."
  },
  "importantWords": [
    {
      "arabic": "لَا يَنْظُرُ",
      "english": "Will not look",
      "urdu": "نہیں دیکھے گا"
    },
    {
      "arabic": "جَرَّ",
      "english": "Dragged / Trailed",
      "urdu": "گھسیٹا"
    },
    {
      "arabic": "ثَوْبَهُ",
      "english": "His garment",
      "urdu": "اپنا کپڑا"
    },
    {
      "arabic": "خُيَلَاءَ",
      "english": "Pride / Arrogance",
      "urdu": "تکبر و غرور"
    },
    {
      "arabic": "الْمُسْبِلِ",
      "english": "One who lowers garment",
      "urdu": "ٹخنوں سے نیچے کپڑا رکھنے والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تکبر کی نیت سے لباس کو ٹخنوں سے نیچے لٹکانے کی سخت ممانعت کی گئی ہے اور اسے اللہ کی ناراضگی کا سبب قرار دیا گیا ہے۔",
    "english": "This Hadith strictly prohibits trailing one's garment below the ankles out of pride, stating it causes the withdrawal of Allah's mercy."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5783)",
      "english": "Reported by Al-Bukhari (5783)"
    },
    {
      "arabic": "رواه مسلم (2085)",
      "english": "Reported by Muslim (2085)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9K8Z2o3T4Y",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تکبر اور لباس کا تعلق",
        "english": "Relation between Pride and Attire"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیتِ تکبر کی سزا",
              "english": "Punishment for Arrogant Intent"
            },
            "content": {
              "urdu": [
                "لباس کو زمین پر گھسیٹنا قدیم دور میں امارت اور بڑائی کی علامت تھا۔",
                "اللہ تعالیٰ دلوں کے بھید جانتا ہے اور تکبر کو سخت ناپسند فرماتا ہے۔",
                "جو شخص لوگوں کو حقیر سمجھ کر ایسا کرے وہ اللہ کی نظرِ رحمت سے محروم ہے۔"
              ],
              "english": [
                "Trailing garments was a historical symbol of status and superiority.",
                "Allah knows the secrets of hearts and detests arrogance deeply.",
                "Whoever acts thus to belittle others is deprived of Allah's Mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظرِ رحمت سے محرومی",
              "english": "Deprivation of Divine Mercy"
            },
            "content": {
              "urdu": [
                "اللہ کا نہ دیکھنا اس کی ناراضگی اور غضب کی ایک نہایت سخت علامت ہے۔",
                "قیامت کے دن ایسے شخص کا نہ تزکیہ ہوگا اور نہ اسے معاف کیا جائے گا۔",
                "یہ وعید اس گناہ کے کبیرہ اور نہایت سنگین ہونے پر واضح دلالت کرتی ہے۔"
              ],
              "english": [
                "Allah not looking is a severe sign of His wrath and displeasure.",
                "On Judgment Day, such a person will neither be purified nor forgiven.",
                "This warning clearly indicates that this act is a major and grave sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی حدود اور ٹخنے",
        "english": "Sharia Limits and Ankles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مردوں کے لیے لباس کی حد",
              "english": "Garment Limit for Men"
            },
            "content": {
              "urdu": [
                "مردوں کے لیے ازار یا شلوار کو ٹخنوں سے اوپر رکھنا واجب ہے۔",
                "حدیث کے مطابق ٹخنوں سے نیچے کا حصہ جہنم کی آگ میں جلے گا۔",
                "یہ حکم صرف مردوں کے لیے ہے جبکہ عورتوں کے لیے پردہ ضروری ہے۔"
              ],
              "english": [
                "It is mandatory for men to keep their lower garment above the ankles.",
                "According to Hadith, the part below the ankles will be in the Fire.",
                "This rule applies to men; women are commanded to cover their feet."
              ]
            }
          },
          {
            "title": {
              "urdu": "بغیر تکبر کے لٹکانے کا حکم",
              "english": "Ruling on Trailing without Pride"
            },
            "content": {
              "urdu": [
                "اگر نیت تکبر کی نہ ہو تب بھی ٹخنوں سے نیچے کپڑا رکھنا گناہ ہے۔",
                "حضرت ابوبکر صدیقؓ کی مثال میں کپڑا خود بخود نیچے گر جاتا تھا۔",
                "عمدا ایسا کرنا بہرحال ممنوع ہے کیونکہ یہ تکبر کی مشابہت پیدا کرتا ہے۔"
              ],
              "english": [
                "Even without prideful intent, keeping clothes below ankles is sinful.",
                "In Abu Bakr's (RA) case, his garment would slip down involuntarily.",
                "Doing it intentionally is forbidden as it resembles arrogant behavior."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و سماجی پہلو",
        "english": "Ethical and Social Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی اور عاجزی",
              "english": "Simplicity and Humility"
            },
            "content": {
              "urdu": [
                "اسلامی لباس میں سادگی ہونی چاہیے نہ کہ فضول خرچی اور نمائش۔",
                "ٹخنوں سے اوپر کپڑا رکھنا بظاہر چھوٹا عمل ہے مگر یہ بندگی کی علامت ہے۔",
                "مومن کی پہچان یہ ہے کہ وہ اپنی ظاہری ہیئت میں بھی سنت کا پابند ہو۔"
              ],
              "english": [
                "Islamic attire should embody simplicity rather than waste and show.",
                "Keeping clothes above ankles is a small act but a sign of servitude.",
                "A believer is recognized by adhering to Sunnah in outward appearance."
              ]
            }
          },
          {
            "title": {
              "urdu": "صفائی اور ستھرائی",
              "english": "Purity and Hygiene"
            },
            "content": {
              "urdu": [
                "کپڑا جب زمین پر گھسٹتا ہے تو وہ گندگی اور نجاست سے آلودہ ہوتا ہے۔",
                "ٹخنوں سے اوپر کپڑا رکھنے سے لباس پاکیزہ اور صاف رہتا ہے۔",
                "شریعت کے احکامات میں ہمیشہ انسانی عقل اور بہتری پوشیدہ ہوتی ہے۔"
              ],
              "english": [
                "When a garment trails on the ground, it gets soiled and impure.",
                "Keeping it above the ankles ensures the clothing remains clean.",
                "Sharia's commands always contain inherent wisdom and human benefit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کی اصلاح",
        "english": "Reform in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خریداری میں احتیاط",
              "english": "Caution in Purchasing"
            },
            "content": {
              "urdu": [
                "لباس سلواتے یا خریدتے وقت لمبائی کا خاص خیال رکھنا چاہیے۔",
                "فیشن کے نام پر اللہ اور اس کے رسول ﷺ کی نافرمانی سے بچیں۔",
                "نوجوانوں کو اس سنت کی اہمیت سے آگاہ کرنا وقت کی ضرورت ہے۔"
              ],
              "english": [
                "Special care should be taken regarding length when buying clothes.",
                "Avoid disobeying Allah and His Messenger (ﷺ) in the name of fashion.",
                "Educating the youth about this Sunnah is a necessity of our time."
              ]
            }
          },
          {
            "title": {
              "urdu": "روحانی فائدہ",
              "english": "Spiritual Benefit"
            },
            "content": {
              "urdu": [
                "سنت کی اتباع انسان کے نفس کو قابو میں رکھنے میں مدد دیتی ہے۔",
                "جب انسان اللہ کے لیے اپنی پسند قربان کرتا ہے تو ایمان بڑھتا ہے۔",
                "اعلیٰ اخلاق اور سنت کی پیروی ہی آخرت میں نجات کا راستہ ہے۔"
              ],
              "english": [
                "Following the Sunnah helps in controlling one's lower desires (Nafs).",
                "When a person sacrifices their preference for Allah, faith increases.",
                "Adhering to high morals and the Sunnah is the path to salvation."
              ]
            }
          }
        ]
      }
    }
  ]
}