{
  "hadithId": 1238,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/3"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "الجامع - باب الأدب",
    "babId": 102
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2553)، والترمذي (2389)، وأحمد (17630).",
    "urdu": "صحیح۔ اسے امام مسلم (2553) اور امام ترمذی (2389) نے اپنی سنن میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Muslim (2162) and At-Tirmidhi (2389)."
  },
  "importantWords": [
    {
      "arabic": "اَلْبِرُّ",
      "english": "Righteousness",
      "urdu": "نیکی"
    },
    {
      "arabic": "اَلْإِثْمُ",
      "english": "Sin",
      "urdu": "گناہ"
    },
    {
      "arabic": "حُسْنُ اَلْخُلُقِ",
      "english": "Good Character",
      "urdu": "اچھا اخلاق"
    },
    {
      "arabic": "حَاكَ",
      "english": "Wavers / Agitates",
      "urdu": "کھٹکے / بے چین کرے"
    },
    {
      "arabic": "يَطَّلِعَ",
      "english": "To find out / Observe",
      "urdu": "مطلع ہونا / دیکھ لینا"
    },
    {
      "arabic": "كَرِهْتَ",
      "english": "You hate / Dislike",
      "urdu": "تو ناپسند کرے"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے نیکی کو حسنِ اخلاق سے تعبیر کیا اور گناہ کی پہچان یہ بتائی کہ وہ دل میں بے چینی پیدا کرتا ہے اور انسان اسے چھپاتا ہے۔",
    "english": "The Prophet (ﷺ) defined righteousness as having good character and described sin as something that creates inner unrest and a desire for secrecy."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب البر والصلة والآداب، رقم 2553",
      "english": "Sahih Muslim, Book of Virtue, Good Manners and Joining of the Ties of Relationship, No. 2553"
    },
    {
      "arabic": "سنن الترمذي، كتاب الزهد، رقم 2389",
      "english": "Sunan at-Tirmidhi, Book of Asceticism, No. 2389"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "النواس بن سمعان الأنصاري",
        "english": "An-Nawwas bin Sam'an Al-Ansari"
      },
      "slug": "an-nawwas-bin-saman"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نیکی اور حسنِ اخلاق",
        "english": "Righteousness and Good Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسنِ اخلاق کی وسعت",
              "english": "The Breadth of Good Character"
            },
            "content": {
              "urdu": [
                "حسنِ اخلاق صرف مسکرا کر ملنے کا نام نہیں بلکہ اس میں تمام شرعی نیکیوں کا مجموعہ شامل ہے۔",
                "نبی کریم ﷺ نے نیکی کی جامع تعریف فرمائی کہ دوسروں کے ساتھ اللہ کے احکامات کے مطابق معاملہ کرنا نیکی ہے۔",
                "جس انسان کے اخلاق درست ہو جاتے ہیں، اس کے لیے دیگر عبادات پر عمل کرنا آسان ہو جاتا ہے۔"
              ],
              "english": [
                "Good character is not just meeting people with a smile; it encompasses all Sharia-based virtues.",
                "The Prophet (ﷺ) gave a comprehensive definition: treating others according to Allah's commands is righteousness.",
                "When a person refines their character, performing other acts of worship becomes naturally easier."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمان کا کمال",
              "english": "Perfection of Faith"
            },
            "content": {
              "urdu": [
                "احادیث میں بہترین مومن اسے قرار دیا گیا ہے جس کے اخلاق سب سے اچھے اور پاکیزہ ہوں۔",
                "قیامت کے دن میزان میں سب سے وزنی چیز مومن کا حسنِ اخلاق ہی ثابت ہوگی۔",
                "نبی ﷺ کی بعثت کا ایک بڑا مقصد ہی انسانی اخلاق کی تکمیل اور ان کی تہذیب کرنا تھا۔"
              ],
              "english": [
                "In various Hadiths, the best believer is identified as the one with the finest and purest character.",
                "On the Day of Judgment, the heaviest thing on the scales will be the believer's good conduct.",
                "A major purpose of the Prophet's (ﷺ) mission was to perfect and refine human morality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گناہ کی پہچان اور ضمیر کی آواز",
        "english": "Recognizing Sin and the Voice of Conscience"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دل کی کھٹک",
              "english": "The Heart's Agitation"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے انسانی فطرت میں ایک ایسا نظام رکھا ہے جو برائی پر بے چین ہو جاتا ہے۔",
                "اگر کسی کام کو کرتے وقت دل میں ہچکچاہٹ محسوس ہو، تو وہ گناہ کی واضح نشانی ہے۔",
                "مومن کا ضمیر اسے برے کاموں سے روکنے کے لیے ایک اندرونی مانیٹر کا کام کرتا ہے۔"
              ],
              "english": [
                "Allah has placed a system within human nature that becomes restless upon witnessing evil.",
                "If you feel hesitation or a 'sting' in your heart while doing something, it is a clear sign of sin.",
                "A believer's conscience acts as an internal monitor to prevent them from engaging in bad deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "رسوائی کا خوف",
              "english": "Fear of Public Exposure"
            },
            "content": {
              "urdu": [
                "گناہ کی دوسری علامت یہ ہے کہ انسان ڈرتا ہے کہ کہیں دوسرے لوگ اس کام کو نہ دیکھ لیں۔",
                "نیکی وہ ہے جو اعلانیہ کی جا سکے، جبکہ برائی وہ ہے جسے پردوں میں چھپانے کی کوشش کی جائے۔",
                "یہ اصول انسان کو منافقت سے بچنے اور اپنی خلوت کو پاکیزہ رکھنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "The second sign of sin is the fear that other people might discover or see the act.",
                "Virtue is that which can be done openly, while evil is what one tries to hide behind veils.",
                "This principle teaches humans to avoid hypocrisy and to keep their private lives pure."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فطری بصیرت اور تقویٰ",
        "english": "Inherent Insight and Piety"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اپنے دل سے فتویٰ لو",
              "english": "Consult Your Heart"
            },
            "content": {
              "urdu": [
                "بعض اوقات لوگ گناہ کو حلال ثابت کرنے کے لیے بہانے تراشتے ہیں مگر دل سچ جانتا ہے۔",
                "شریعت نے دل کے اطمینان کو ایک اہم معیار قرار دیا ہے تاکہ انسان دھوکے میں نہ رہے۔",
                "تقویٰ کا مطلب ہی یہ ہے کہ انسان ان مشتبہ چیزوں سے بچے جو اس کے سکونِ قلب کو برباد کریں۔"
              ],
              "english": [
                "Sometimes people create excuses to justify a sin, but the heart knows the underlying truth.",
                "Sharia considers the tranquility of the heart as a standard so that humans are not deceived.",
                "Piety means avoiding doubtful matters that ruin one's internal peace and spiritual calm."
              ]
            }
          },
          {
            "title": {
              "urdu": "پاکیزہ معاشرے کی بنیاد",
              "english": "Foundation of a Pure Society"
            },
            "content": {
              "urdu": [
                "جب معاشرے کا ہر فرد اپنے ضمیر کی آواز سنے گا، تو جرائم کی شرح خود بخود کم ہو جائے گی۔",
                "یہ حدیث ایک خودکار اصلاحی نظام فراہم کرتی ہے جو کسی بیرونی پولیس کا محتاج نہیں ہے۔",
                "سچی نیکی وہ ہے جو بندے اور رب کے درمیان تعلق کو مضبوط اور شفاف بنا دے۔"
              ],
              "english": [
                "When every member of society listens to their conscience, crime rates will naturally decrease.",
                "This Hadith provides an automatic reform system that doesn't rely solely on external policing.",
                "True righteousness is that which makes the relationship between the servant and Lord strong."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاملات میں شفافیت",
              "english": "Transparency in Dealings"
            },
            "content": {
              "urdu": [
                "ہمیں ہر وہ کام چھوڑ دینا چاہیے جس کے ظاہر ہونے پر ہمیں شرمندگی کا سامنا کرنا پڑے۔",
                "اپنی زندگی کو اتنا شفاف بنائیں کہ آپ کی تنہائی اور محفل میں کوئی بڑا فرق نہ رہے۔",
                "دیانت داری اور سچائی ہی وہ اوصاف ہیں جو انسان کو معاشرے میں معزز بناتے ہیں۔"
              ],
              "english": [
                "We should abandon any action that would cause us embarrassment if it were revealed to others.",
                "Make your life so transparent that there is no major discrepancy between your private and public self.",
                "Honesty and truthfulness are the traits that make a person truly honorable in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کا محاسبہ",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "روزانہ کی بنیاد پر اپنے اعمال کا جائزہ لیں کہ کون سے کام دل میں کھٹک پیدا کر رہے ہیں۔",
                "توبہ کا دروازہ کھلا ہے، لہذا گناہ کی کھٹک محسوس ہوتے ہی اللہ کی طرف رجوع کرنا چاہیے۔",
                "نیکی کی طرف سبقت کرنا اور برائی سے دوری اختیار کرنا ہی اصل کامیابی کا راز ہے۔"
              ],
              "english": [
                "Review your actions daily to see which ones are causing agitation or guilt in your heart.",
                "The door of repentance is open; turn to Allah as soon as you feel the sting of sin.",
                "Hastening toward good and distancing oneself from evil is the true secret of success."
              ]
            }
          }
        ]
      }
    }
  ]
}