{
  "hadithId": 1340,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/110"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2137).",
    "urdu": "صحیح۔ اسے امام مسلم (2137) نے اپنی صحیح میں روایت کیا ہے۔ یہ حدیث کلماتِ طیبات کی جامعیت اور فضیلت پر دلالت کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (2137). This Hadith signifies the comprehensiveness and excellence of the four blessed phrases."
  },
  "importantWords": [
    {
      "arabic": "أَحَبُّ اَلْكَلَامِ",
      "english": "Most beloved words",
      "urdu": "سب سے پسندیدہ کلام"
    },
    {
      "arabic": "لَا يَضُرُّكَ",
      "english": "It does not harm you",
      "urdu": "تجھے نقصان نہیں دے گا"
    },
    {
      "arabic": "بَدَأْتَ",
      "english": "You started",
      "urdu": "تو نے شروع کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں چار کلمات (تسبیح، تحمید، تہلیل اور تکبیر) کو اللہ کے نزدیک سب سے زیادہ محبوب قرار دیا گیا ہے اور ان کو کسی بھی ترتیب سے پڑھنے کی اجازت دی گئی ہے۔",
    "english": "In this Hadith, four phrases (Tasbih, Tahmid, Tahlil, and Takbir) are declared the most beloved to Allah, and they may be recited in any order."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الآداب، رقم 2137",
      "english": "Sahih Muslim, Book of Manners, No. 2137"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "محبوب کلمات کی اہمیت",
        "english": "Significance of the Beloved Phrases"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی پسند کا معیار",
              "english": "The Standard of Allah's Preference"
            },
            "content": {
              "urdu": [
                "یہ چار کلمات اسلام کے بنیادی عقائد اور بندگی کے جوہر کو سمیٹے ہوئے ہیں۔",
                "ان میں اللہ کی پاکیزگی، اس کا شکر، اس کی توحید اور اس کی عظمت کا بیک وقت اعتراف موجود ہے۔",
                "اللہ کے محبوب ہونے کا مطلب یہ ہے کہ ان پر اجر و ثواب بھی بہت زیادہ ہے۔"
              ],
              "english": [
                "These four phrases encapsulate the core beliefs of Islam and the essence of servitude.",
                "They simultaneously acknowledge Allah's purity, gratitude to Him, His Oneness, and His Greatness.",
                "Their being beloved to Allah implies that the reward for reciting them is also immense."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کلمات کی ترتیب اور لچک",
        "english": "Order and Flexibility of Phrases"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسانی اور سہولت",
              "english": "Ease and Convenience"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے فرمایا کہ کسی بھی کلمے سے شروع کرنا نقصان دہ نہیں، یعنی ترتیب واجب نہیں ہے۔",
                "یہ شریعت کی آسانی ہے کہ انسان اپنی سہولت کے مطابق ذکر کر سکے۔",
                "اصل مقصد ان الفاظ کے معانی پر غور کرنا اور دل کی حاضری کے ساتھ اللہ کو یاد کرنا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) stated that starting with any phrase is not harmful, meaning the order is not obligatory.",
                "This reflects the ease within Sharia, allowing a person to remember Allah as per their convenience.",
                "The real objective is to reflect on the meanings and remember Allah with a present heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہر کلمے کی اپنی انفرادیت",
        "english": "The Uniqueness of Each Phrase"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تسبیح، تحمید، تہلیل اور تکبیر",
              "english": "Tasbih, Tahmid, Tahlil, and Takbir"
            },
            "content": {
              "urdu": [
                "سبحان اللہ: اللہ کو ہر عیب اور کمزوری سے پاک قرار دینا۔",
                "الحمدللہ: تمام کمالات کا منبع اللہ کو ماننا اور اس کا شکر ادا کرنا۔",
                "لا الہ الا اللہ: توحید کا سب سے بڑا اعلان جو شرک کی نفی کرتا ہے۔",
                "اللہ اکبر: اللہ کو کائنات کی ہر طاقت اور چیز سے بڑا ماننا۔"
              ],
              "english": [
                "Subhan Allah: Declaring Allah free from all defects and weaknesses.",
                "Alhamdulillah: Recognizing Allah as the source of all perfection and thanking Him.",
                "La ilaha illallah: The greatest declaration of Tawhid, negating all partners.",
                "Allahu Akbar: Recognizing Allah as greater than every power and everything in the universe."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہمہ وقت ذکر کا معمول",
              "english": "A Routine of Constant Remembrance"
            },
            "content": {
              "urdu": [
                "یہ کلمات اتنے مختصر ہیں کہ چلتے پھرتے، کام کاج کے دوران آسانی سے پڑھے جا سکتے ہیں۔",
                "ان کا ورد زبان کو لغو باتوں سے پاک رکھتا ہے اور دل میں اللہ کی محبت پیدا کرتا ہے۔",
                "نبی کریم ﷺ نے فرمایا کہ یہ کلمات سورج کی روشنی پڑنے والی ہر چیز سے بہتر ہیں۔"
              ],
              "english": [
                "These phrases are so short they can easily be recited while walking or working.",
                "Reciting them keeps the tongue clean from idle talk and fosters Allah's love in the heart.",
                "The Prophet (ﷺ) said these phrases are better than everything upon which the sun rises."
              ]
            }
          }
        ]
      }
    }
  ]
}