{
  "hadithId": 1128,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/49"],
    "kitabId": 11,
    "inKitabBab": 2,
    "arabicBook": "كتاب الجهاد - باب الجزية والهدنة",
    "babId": 90
  },
  
  "takhreej": {
    "arabic": "صحيح. أصل القصة في البخاري (2731) مطولاً، وأخرجه أبو داود (2765، 2766) في كتاب الجهاد، ومسلم (1784) من حديث أنس.",
    "urdu": "یہ حدیث صحیح ہے۔ اس کا بنیادی واقعہ امام بخاری نے اپنی صحیح (2731) میں تفصیل سے ذکر کیا ہے۔ امام ابوداؤد نے کتاب الجہاد میں اور امام مسلم نے حضرت انس کی روایت سے اس کا کچھ حصہ روایت کیا ہے۔",
    "english": "Sahih. The main event is recorded by Al-Bukhari (2731) in detail. Abu Dawud reported it in the Book of Jihad (2765, 2766), and Muslim (1784) narrated the portion regarding the return of converts from the Hadith of Anas."
  },
  "importantWords": [
    {
      "arabic": "وَضْعِ اَلْحَرْبِ",
      "english": "Cessation of war",
      "urdu": "جنگ بندی"
    },
    {
      "arabic": "يَكُفُّ",
      "english": "Refrain / Desist",
      "urdu": "ہاتھ روکنا"
    },
    {
      "arabic": "رَدَدْتُمُوهُ",
      "english": "Return him",
      "urdu": "تم اسے واپس کر دو گے"
    },
    {
      "arabic": "فَرَجاً وَمُخْرِجاً",
      "english": "Relief and a way out",
      "urdu": "کشائش اور راستہ"
    },
    {
      "arabic": "الْهُدْنَة",
      "english": "Truce",
      "urdu": "صلح / التوائے جنگ"
    }
  ],
  "summary": {
    "urdu": "صلح حدیبیہ کی شرائط بظاہر مسلمانوں کے خلاف تھیں، مگر رسول اللہ ﷺ کی بصیرت اور اللہ کے وعدے کے مطابق یہ 'فتحِ مبین' ثابت ہوئی جس نے اسلام کے غلبے کی بنیاد رکھی۔",
    "english": "The Treaty of Hudaibiya appeared unfavorable to Muslims initially, but through the Prophet's (ﷺ) strategic foresight, it became a 'Manifest Victory' that paved the way for Islam's expansion."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2731)",
      "english": "Sahih al-Bukhari (2731)"
    },
    {
      "arabic": "صحيح مسلم (1784)",
      "english": "Sahih Muslim (1784)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "المسور بن مخرمة",
        "english": "Al-Miswar bin Makhrama"
      },
      "slug": "al-miswar-bin-makhrama"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صلح حدیبیہ اور اس کی حکمت",
        "english": "Treaty of Hudaibiya and its Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنگ بندی کا معاہدہ",
              "english": "Agreement of Ceasefire"
            },
            "content": {
              "urdu": [
                "دس سالہ جنگ بندی کا مقصد عرب میں دعوتِ دین کے لیے پرامن ماحول فراہم کرنا تھا۔",
                "اس عرصہ میں مسلمانوں کو اپنی قوت منظم کرنے اور قبائل تک پیغام پہنچانے کا موقع ملا۔",
                "امن کا دورانیہ جنگ کے مقابلے میں اسلام کی اشاعت کے لیے زیادہ ممد و معاون ثابت ہوا۔"
              ],
              "english": [
                "The ten-year truce aimed to provide a peaceful environment for the propagation of Islam.",
                "This period allowed Muslims to organize their strength and reach out to various tribes.",
                "The era of peace proved more beneficial for the spread of Islam than the years of conflict."
              ]
            }
          },
          {
            "title": {
              "urdu": "سخت شرائط پر صبر",
              "english": "Patience Over Harsh Conditions"
            },
            "content": {
              "urdu": [
                "مکہ سے آنے والے مسلمانوں کو واپس کرنے کی شرط صحابہ کے لیے بہت تکلیف دہ تھی۔",
                "آپ ﷺ نے وحی الٰہی کی روشنی میں ان شرائط کو قبول کیا تاکہ بڑی مصلحت حاصل ہو۔",
                "یہ واقعہ ثابت کرتا ہے کہ کبھی کبھی عارضی پسپائی مستقل کامیابی کا پیش خیمہ ہوتی ہے۔"
              ],
              "english": [
                "The condition to return converts fleeing from Makkah was emotionally painful for the Sahaba.",
                "The Prophet (ﷺ) accepted these terms under divine guidance to achieve a greater strategic goal.",
                "This event proves that temporary concessions can lead to permanent success."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی بصیرت اور توکل",
        "english": "Prophetic Foresight and Trust"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستقبل کی نوید",
              "english": "Glad Tidings for the Future"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کو یقین تھا کہ اللہ تعالیٰ مظلوم مسلمانوں کے لیے کوئی نہ کوئی راستہ نکال دے گا۔",
                "ابوجندل اور ابوبصیر رضی اللہ عنہما جیسے صحابہ کے واقعات نے اس پیش گوئی کو سچ ثابت کیا۔",
                "جو لوگ حق پر ہوں، اللہ انہیں کبھی تنہا نہیں چھوڑتا چاہے حالات کتنے ہی کٹھن ہوں۔"
              ],
              "english": [
                "The Prophet (ﷺ) was certain that Allah would provide relief for oppressed Muslims.",
                "The subsequent events involving Abu Jandal and Abu Basir (R.A) proved this prediction true.",
                "Allah never abandons those on the side of truth, no matter how difficult the circumstances."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفاق سے پاک گروہ",
              "english": "A Group Free from Hypocrisy"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے فرمایا کہ جو مدینہ چھوڑ کر کافروں کے پاس جائے اسے جانے دو کیونکہ وہ خیر سے دور ہوا۔",
                "اس سے اسلامی معاشرے کی تطہیر ہوئی اور صرف مخلص لوگ ہی باقی رہے۔",
                "کمزور ایمان والوں کا نکل جانا جماعت کی اندرونی مضبوطی کا باعث بنتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said to let those who desert Medina go, as they are removed from goodness.",
                "This resulted in the purification of the Islamic society, leaving only the sincere.",
                "The departure of those with weak faith can lead to the internal strengthening of the group."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سیاسی احکام",
        "english": "Juristic and Political Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مسلموں سے معاہدے",
              "english": "Treaties with Non-Muslims"
            },
            "content": {
              "urdu": [
                "کفار سے صلح اور معاہدہ کرنا اسلامی ریاست کی خارجہ پالیسی کا جائز حصہ ہے۔",
                "معاہدے کی پاسداری مسلمانوں پر اس وقت تک فرض ہے جب تک دشمن اسے نہ توڑے۔",
                "حاکمِ وقت کو مصلحت کی بنا پر بعض مراعات دینے کا مکمل اختیار حاصل ہے۔"
              ],
              "english": [
                "Making peace and treaties with disbelievers is a valid part of Islamic state foreign policy.",
                "Upholding a treaty is obligatory for Muslims as long as the enemy does not violate it.",
                "The ruler has the full authority to grant certain concessions for the greater benefit of the state."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کا استثناء",
              "english": "Exemption of Women"
            },
            "content": {
              "urdu": [
                "بعد میں نازل ہونے والی آیات نے واضح کیا کہ مسلمان خواتین کو کافروں کے حوالے نہیں کیا جائے گا۔",
                "یہ صلح نامہ صرف مردوں کے متعلق تھا، جس سے اسلام میں خواتین کے خاص مقام کا پتہ چلتا ہے۔",
                "ایمان لانے والی عورتوں کی حفاظت اسلامی ریاست کی غیرت کا تقاضا ہے۔"
              ],
              "english": [
                "Later revelations clarified that Muslim women would not be returned to disbelievers.",
                "The treaty specifically applied to men, highlighting the special protection granted to women in Islam.",
                "Protecting women who embrace the faith is a requirement of Islamic honor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جذباتی فیصلوں سے گریز",
              "english": "Avoiding Emotional Decisions"
            },
            "content": {
              "urdu": [
                "حدیبیہ کے موقع پر صحابہ جذباتی تھے مگر آپ ﷺ نے عقل اور وحی کو مقدم رکھا۔",
                "اجتماعی معاملات میں جذباتی ہونے کے بجائے دور رس نتائج پر غور کرنا چاہیے۔",
                "قیادت کی اطاعت میں ہی امت کی خیر اور کامیابی پوشیدہ ہے۔"
              ],
              "english": [
                "The Sahaba were emotional at Hudaibiya, but the Prophet (ﷺ) prioritized wisdom and revelation.",
                "In collective affairs, long-term consequences should be considered over emotional reactions.",
                "The goodness and success of the Ummah lie in obedience to righteous leadership."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی تدبیر پر یقین",
              "english": "Belief in Allah's Planning"
            },
            "content": {
              "urdu": [
                "جب انسان اللہ کے حکم پر چلتا ہے تو بظاہر نقصان بھی نفع میں بدل جاتا ہے۔",
                "کٹھن حالات میں اللہ سے 'مخرج' (راستہ) کی امید رکھنا ایمان کا تقاضا ہے۔",
                "ہمیشہ صلح اور خیر کے راستے تلاش کرنے چاہئیں جب تک حق متاثر نہ ہو۔"
              ],
              "english": [
                "When a person follows Allah's command, apparent losses turn into gains.",
                "Hoping for a 'way out' from Allah during hard times is a requirement of faith.",
                "One should always seek paths of reconciliation and goodness as long as the truth remains compromised."
              ]
            }
          }
        ]
      }
    }
  ]
}