{
  "hadithId": 786,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/786"],
    "kitabId": 7,
    "inKitabBab": 17,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 58
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري ( 2737 )‏ ، ومسلم (1632)‏. وهذا الحديث هو أصل مشروعية الوقف في الإسلام.",
    "urdu": "صحیح۔ اسے امام بخاری (2737) اور امام مسلم (1632) نے روایت کیا ہے۔ یہ حدیث اسلام میں 'وقف' کے قانون کی بنیاد سمجھی جاتی ہے۔",
    "english": "Sahih. Reported by Bukhari (2737) and Muslim (1632). This Hadith is the fundamental proof for the legality of Waqf (endowments) in Islam."
  },
  "importantWords": [
    {
      "arabic": "أَنْفَسُ",
      "english": "More precious / Valuable",
      "urdu": "زیادہ نفیس / قیمتی"
    },
    {
      "arabic": "حَبَسْتَ",
      "english": "Retained / Frozen (as Waqf)",
      "urdu": "روک لیا / وقف کر دیا"
    },
    {
      "arabic": "أَصْلَهَا",
      "english": "The original property / Corpus",
      "urdu": "اس کی اصل (زمین)"
    },
    {
      "arabic": "اَلرِّقَابِ",
      "english": "Slaves (to be freed)",
      "urdu": "گردنیں آزاد کرانا"
    },
    {
      "arabic": "وَلِيَهَا",
      "english": "Its administrator / Manager",
      "urdu": "اس کا نگران / متولی"
    },
    {
      "arabic": "غَيْرَ مُتَمَوِّلٍ",
      "english": "Without accumulating wealth",
      "urdu": "مال جمع کیے بغیر"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اسلام میں وقف کے نظام کو واضح کرتی ہے، جس میں اصل جائیداد کو محفوظ رکھا جاتا ہے تاکہ اس کا نفع دائمی طور پر رفاہی کاموں میں خرچ ہوتا رہے۔",
    "english": "This Hadith establishes the system of Waqf (endowments) in Islam, where the principal property is preserved while its benefits are continuously spent on charitable causes."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2737)",
      "english": "Reported by Al-Bukhari (2737)"
    },
    {
      "arabic": "رواه مسلم (1632)",
      "english": "Reported by Muslim (1632)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وقف کی شرعی حقیقت",
        "english": "The Shariah Reality of Waqf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقف کی تعریف اور طریقہ",
              "english": "Definition and Method of Waqf"
            },
            "content": {
              "urdu": [
                "وقف کا مطلب ہے کسی جائیداد کی اصل کو اللہ کی ملکیت میں دے دینا تاکہ اسے بیچا نہ جا سکے۔",
                "صرف اس زمین یا مکان سے حاصل ہونے والی آمدنی کو غریبوں اور نیک کاموں میں لگایا جاتا ہے۔",
                "سیدنا عمر رضی اللہ عنہ کا یہ عمل مسلمانوں کے لیے رہتی دنیا تک ایک نمونہ بن گیا۔"
              ],
              "english": [
                "Waqf means dedicating the corpus of a property to Allah so it cannot be sold or gifted.",
                "Only the income or produce derived from it is spent on the poor and virtuous causes.",
                "This act of Umar (RA) became a perpetual model for the Muslim Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفیس مال اللہ کی راہ میں دینا",
              "english": "Giving Precious Wealth for Allah"
            },
            "content": {
              "urdu": [
                "سیدنا عمر نے اپنی زندگی کا سب سے قیمتی اثاثہ اللہ کے لیے وقف کرنے کا مشورہ مانگا۔",
                "یہ قرآن کی آیت 'تم نیکی کو نہیں پہنچ سکتے جب تک اپنا محبوب مال خرچ نہ کرو' کی عملی تفسیر ہے۔",
                "صحابہ کرام اپنی بہترین چیزیں دین کی سربلندی کے لیے قربان کرنے میں فخر محسوس کرتے تھے۔"
              ],
              "english": [
                "Umar (RA) sought advice on dedicating his most valuable asset for the sake of Allah.",
                "This is a practical application of the verse: 'You will not attain piety until you spend from what you love.'",
                "The Sahaba took pride in sacrificing their best possessions for the exaltation of Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وقف کے مصارف اور متولی کے احکام",
        "english": "Expenditure and Administration of Waqf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آمدنی کے حقدار کون؟",
              "english": "Who is Entitled to the Income?"
            },
            "content": {
              "urdu": [
                "سیدنا عمر نے وقف کے لیے فقراء، رشتہ داروں، مسافروں اور جہاد کو ترجیح دی۔",
                "اس سے معلوم ہوا کہ وقف صرف مسجد کے لیے نہیں بلکہ سماجی فلاح کے لیے بھی ہو سکتا ہے۔",
                "غلاموں کی آزادی اور مہمان نوازی بھی اسلامی وقف کے اہم شعبے ہیں۔"
              ],
              "english": [
                "Umar (RA) prioritized the poor, relatives, wayfarers, and Jihad for the Waqf income.",
                "This shows that Waqf is not restricted to mosques but includes general social welfare.",
                "Freeing slaves and hospitality are also vital areas of Islamic endowment."
              ]
            }
          },
          {
            "title": {
              "urdu": "متولی کا معاوضہ",
              "english": "Compensation for the Trustee"
            },
            "content": {
              "urdu": [
                "نگران یا متولی کے لیے جائز ہے کہ وہ اپنی محنت کے بدلے ضرورت کے مطابق اس میں سے کھائے۔",
                "شرط یہ ہے کہ وہ اس وقف سے ذاتی جائیداد نہ بنائے اور نہ ہی مال ذخیرہ کرے۔",
                "یہ اصول امانت داری اور شفافیت کو یقینی بنانے کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "It is permissible for the manager (Mutawalli) to consume from it reasonably for their labor.",
                "The condition is that they must not accumulate personal wealth or hoard from the trust.",
                "This principle ensures trustworthiness and transparency in managing endowments."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وقف کے قانونی ضابطے",
        "english": "Legal Regulations of Waqf"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ناقابلِ فروخت جائیداد",
              "english": "Non-Transferable Property"
            },
            "content": {
              "urdu": [
                "ایک بار وقف ہونے کے بعد جائیداد کبھی بھی بیچی یا ہبہ نہیں کی جا سکتی۔",
                "یہ وراثت میں بھی تقسیم نہیں ہوتی بلکہ ہمیشہ وقف کی حیثیت میں باقی رہتی ہے۔",
                "یہی وجہ ہے کہ وقف کو 'صدقہ جاریہ' کہا جاتا ہے کیونکہ اس کا نفع ختم نہیں ہوتا۔"
              ],
              "english": [
                "Once a property is made Waqf, it can never be sold, gifted, or transferred.",
                "It is not divided in inheritance but remains in its endowed state forever.",
                "This is why Waqf is called 'Sadaqah Jariyah' as its benefits are unending."
              ]
            }
          },
          {
            "title": {
              "urdu": "مشورے کی اہمیت",
              "english": "Importance of Consultation"
            },
            "content": {
              "urdu": [
                "سیدنا عمر کا نبی ﷺ سے مشورہ لینا ظاہر کرتا ہے کہ مالی معاملات میں اہل علم سے رجوع کرنا چاہیے۔",
                "صحیح مشورہ نیکی کے اجر کو کئی گنا بڑھا دیتا ہے اور غلطیوں سے بچاتا ہے۔",
                "دین میں مشورہ لینا سنتِ نبوی اور سنتِ صحابہ ہے۔"
              ],
              "english": [
                "Umar's consultation with the Prophet (ﷺ) shows that one should consult scholars in financial matters.",
                "Correct advice multiplies the reward of goodness and prevents legal errors.",
                "Seeking counsel is a Prophetic Sunnah and a tradition of the Companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صدقہ جاریہ کی فکر",
              "english": "Focus on Perpetual Charity"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی کمائی کا کچھ حصہ ایسے کاموں میں لگائیں جو ہماری موت کے بعد بھی جاری رہیں۔",
                "ایجوکیشن ٹرسٹ، ہسپتال یا پانی کا انتظام بہترین وقف کی صورتیں ہیں۔",
                "دنیا کا مال یہیں رہ جائے گا، صرف اللہ کے لیے دیا ہوا مال ساتھ جائے گا۔"
              ],
              "english": [
                "We should invest part of our earnings in projects that continue after our death.",
                "Education trusts, hospitals, or water facilities are excellent forms of Waqf.",
                "Worldly wealth stays behind; only what is given for Allah goes with the person."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی خدمت کا جذبہ",
              "english": "Spirit of Social Service"
            },
            "content": {
              "urdu": [
                "سیدنا عمر نے فقراء کے ساتھ ساتھ رشتہ داروں کا بھی خیال رکھا، جو صلہ رحمی کی علامت ہے۔",
                "دینِ اسلام صرف عبادات کا نام نہیں بلکہ دکھی انسانیت کی خدمت کا نام بھی ہے۔",
                "معاشرے کے کمزور طبقات کی معاشی مدد کرنا ہم سب کی اخلاقی ذمہ داری ہے۔"
              ],
              "english": [
                "Umar (RA) cared for kinsmen along with the poor, showing the importance of family ties.",
                "Islam is not just rituals but also about serving suffering humanity.",
                "Supporting the vulnerable segments of society is a moral responsibility for all of us."
              ]
            }
          }
        ]
      }
    }
  ]
}