{
  "hadithId": 410,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:898"],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "كتاب صلاة الاستسقاء",
    "babId": 26
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (898)، وأبو داود (5100)، والنسائي في الكبرى (1849).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اپنی صحیح (898) میں اسے روایت کیا ہے۔ اس کے علاوہ ابو داؤد اور نسائی میں بھی یہ موجود ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim (898), Abu Dawud (5100), and An-Nasa'i in Al-Kubra (1849)."
  },
  "importantWords": [
    {
      "arabic": "أَصَابَنَا",
      "english": "Befell us / Reached us",
      "urdu": "ہمیں پہنچی / آ لی"
    },
    {
      "arabic": "مَطَرٌ",
      "english": "Rain",
      "urdu": "بارش"
    },
    {
      "arabic": "فَحَسَرَ",
      "english": "He uncovered / Lifted",
      "urdu": "پس آپ نے ہٹایا / اٹھایا"
    },
    {
      "arabic": "ثَوْبَهُ",
      "english": "His garment",
      "urdu": "اپنا کپڑا"
    },
    {
      "arabic": "حَدِيثُ عَهْدٍ",
      "english": "Newly come / Recent",
      "urdu": "نیا نیا / تازہ"
    },
    {
      "arabic": "بِرَبِّهِ",
      "english": "With its Lord",
      "urdu": "اپنے رب کے پاس سے"
    }
  ],
  "summary": {
    "urdu": "بارش کے دوران جسم کا کچھ حصہ ظاہر کرنا تاکہ اس پر بارش کے قطرے پڑیں، مسنون عمل ہے کیونکہ بارش اللہ کی تازہ رحمت ہے۔",
    "english": "Exposing a part of the body to the rain is a Sunnah act, as rain is a mercy newly created and sent by Allah."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (898)",
      "english": "Sahih Muslim (898)"
    },
    {
      "arabic": "سنن أبي داود (5100)",
      "english": "Sunan Abu Dawud (5100)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik Al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0S_Wv7Yq9E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بارش: اللہ کی رحمت",
        "english": "Rain: The Mercy of Allah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تخلیقِ نو اور برکت",
              "english": "New Creation and Blessing"
            },
            "content": {
              "urdu": [
                "بارش اللہ تعالیٰ کی صفتِ تخلیق اور ربوبیت کا تازہ اظہار ہے۔",
                "اسے 'حدیث عہد' کہنے کا مطلب ہے کہ یہ ابھی اللہ کے حکم سے پیدا ہو کر آئی ہے۔",
                "نبی کریم ﷺ اس میں برکت تلاش کرتے تھے کیونکہ یہ پاکیزہ اور مبارک ہے۔"
              ],
              "english": [
                "Rain is a fresh manifestation of Allah's attribute of creation and Lordship.",
                "Calling it 'Hadith 'Ahd' means it has just been created by Allah's command.",
                "The Prophet (PBUH) sought blessings in it because it is pure and blessed."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسم پر بارش لینا",
              "english": "Exposing the Body to Rain"
            },
            "content": {
              "urdu": [
                "بارش کے قطروں کو براہِ راست جسم پر لینا سنتِ نبوی سے ثابت ہے۔",
                "نبی ﷺ نے اپنا کپڑا سر یا کندھے سے ہٹایا تاکہ بارش آپ کو چھو سکے۔",
                "یہ عمل اللہ کی رحمت سے محبت اور اس کے قریب ہونے کی خواہش کا اظہار ہے۔"
              ],
              "english": [
                "Receiving raindrops directly on the body is established from the Prophetic Sunnah.",
                "The Prophet (PBUH) uncovered his garment so the rain could touch him directly.",
                "This act expresses love for Allah's mercy and a desire for closeness to Him."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و علمی نکات",
        "english": "Juristic and Scholarly Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ستر کا خیال رکھنا",
              "english": "Observing the Awrah"
            },
            "content": {
              "urdu": [
                "کپڑا ہٹانے سے مراد وہ حصہ ہے جو ستر (پردہ) میں داخل نہیں ہے۔",
                "عموماً علماء کے نزدیک اس سے مراد بازو، پنڈلی یا سر کا حصہ ہے۔",
                "سنت پر عمل کرتے ہوئے شرعی حدود اور پردے کا خیال رکھنا لازم ہے۔"
              ],
              "english": [
                "Uncovering the garment refers to parts that are not included in the 'Awrah.",
                "Scholars generally interpret this as the arms, shins, or the head.",
                "While following the Sunnah, it is mandatory to observe Sharia limits of modesty."
              ]
            }
          },
          {
            "title": {
              "urdu": "بارش کے وقت کی دعائیں",
              "english": "Supplications during Rain"
            },
            "content": {
              "urdu": [
                "بارش کا وقت دعا کی قبولیت کے خاص اوقات میں سے ایک ہے۔",
                "نبی ﷺ بارش شروع ہوتے ہی 'اللہم صیبًا نافعًا' کی دعا فرماتے تھے۔",
                "اس حدیث سے ثابت ہوتا ہے کہ بارش اللہ کی نعمت ہے، زحمت نہیں۔"
              ],
              "english": [
                "The time of rain is one of the special times when supplications are accepted.",
                "The Prophet (PBUH) would pray 'O Allah, make it a beneficial rain' at its start.",
                "This Hadith proves that rain is a blessing from Allah, not a burden."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی پہلو",
        "english": "Educational and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فطرت سے لگاؤ",
              "english": "Connection with Nature"
            },
            "content": {
              "urdu": [
                "اسلام انسان کو فطری ماحول اور اللہ کی نشانیوں سے جوڑتا ہے۔",
                "بارش کو دیکھ کر اللہ کی عظمت کا احساس پیدا کرنا ایمان کی علامت ہے۔",
                "نبی ﷺ کی زندگی کا ہر لمحہ اللہ کی یاد میں بسر ہوتا تھا۔"
              ],
              "english": [
                "Islam connects humans with the natural environment and Allah's signs.",
                "Feeling the greatness of Allah upon seeing rain is a sign of faith.",
                "Every moment of the Prophet's (PBUH) life was spent in remembrance of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "توہم پرستی کا خاتمہ",
              "english": "Elimination of Superstition"
            },
            "content": {
              "urdu": [
                "بارش کو ستاروں یا بتوں کی طرف منسوب کرنا شرک اور جاہلیت ہے۔",
                "آپ ﷺ نے واضح کیا کہ بارش کا تعلق براہِ راست رب تعالیٰ کے حکم سے ہے۔",
                "مسلمان کو ہر نعمت کا حقیقی منبع اللہ کی ذات کو سمجھنا چاہیے۔"
              ],
              "english": [
                "Attributing rain to stars or idols is Shirk and a sign of ignorance.",
                "The Prophet (PBUH) clarified that rain is directly linked to Allah's command.",
                "A Muslim must recognize the Essence of Allah as the true source of every blessing."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کو زندہ کرنا",
              "english": "Reviving the Sunnah"
            },
            "content": {
              "urdu": [
                "بارش میں بھیگنے کو صرف تفریح نہ سمجھیں بلکہ اسے سنت نیت سے کریں۔",
                "ایسی چھوٹی چھوٹی سنتوں پر عمل کرنا اللہ کی محبت کے حصول کا ذریعہ ہے۔",
                "اپنے بچوں کو بھی بارش کے وقت کی دعائیں اور آداب سکھائیں۔"
              ],
              "english": [
                "Do not view getting wet in the rain just as fun; do it with the intention of Sunnah.",
                "Practicing such small Sunnahs is a means to attain the love of Allah.",
                "Teach your children the supplications and etiquettes of the rainy season."
              ]
            }
          },
          {
            "title": {
              "urdu": "شکر گزاری کا جذبہ",
              "english": "Spirit of Gratitude"
            },
            "content": {
              "urdu": [
                "پانی کی بوند بوند اللہ کا احسان ہے جس پر شکر واجب ہے۔",
                "بارش زمین کو زندگی بخشتی ہے، جو اللہ کی صفتِ رحمانیت کی عکاس ہے۔",
                "ہر بارش کے بعد اللہ کا شکر ادا کریں کہ اس نے ہمیں سیراب کیا۔"
              ],
              "english": [
                "Every drop of water is a favor from Allah for which gratitude is obligatory.",
                "Rain gives life to the Earth, reflecting Allah's attribute of Mercy.",
                "After every rainfall, thank Allah for providing us with water."
              ]
            }
          }
        ]
      }
    }
  ]
}
