{
  "hadithId": 1339,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh:1518"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "كتاب الجامع",
    "babId": 107
  },
 
  "takhreej": {
    "arabic": "صحيح لغيره. رواه النسائي في السنن الكبرى (10617)، وأحمد (11713)، وابن حبان (840)، والحاكم (1/512). ورغم ضعف بعض طرقه، إلا أن معناه ثابت في أحاديث أخرى صحيحة.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر 'صحیح لغيرہ' ہے۔ اسے نسائی نے 'عمل الیوم واللیلۃ' (10617)، احمد (11713) اور ابن حبان نے روایت کیا ہے۔ اس کا مفہوم دیگر صحیح احادیث سے ثابت ہے۔",
    "english": "Sahih Lighairihi (Authentic due to supporting narrations). Reported by An-Nasa'i in 'Amal al-Yawm wal-Laylah (10617), Ahmad (11713), and Ibn Hibban (840). Although some chains are weak, the meaning is confirmed by other authentic narrations."
  },
  "importantWords": [
    {
      "arabic": "الْبَاقِيَاتُ اَلصَّالِحَاتُ",
      "english": "The everlasting righteous deeds",
      "urdu": "ہمیشہ باقی رہنے والی نیکیاں"
    },
    {
      "arabic": "لَا حَوْلَ وَلَا قُوَّةَ",
      "english": "No might and no power",
      "urdu": "نہ گناہ سے بچنے کی طاقت اور نہ نیکی کی ہمت"
    },
    {
      "arabic": "تَسْبِيح",
      "english": "Glorification",
      "urdu": "اللہ کی پاکیزگی بیان کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ان کلماتِ ذکر کی نشاندہی کی گئی ہے جنہیں قرآن مجید میں 'باقیات صالحات' کہا گیا ہے، یعنی وہ اعمال جو دنیا کے مٹ جانے کے بعد بھی بندے کے لیے آخرت میں سرمایہ بنیں گے۔",
    "english": "This Hadith identifies the words of remembrance referred to in the Quran as 'the everlasting righteous deeds,' meaning deeds that remain as a treasure for the servant in the Hereafter even after the world perishes."
  },
  "references": [
    {
      "arabic": "سنن النسائي الكبرى (10617)",
      "english": "Sunan an-Nasa'i al-Kubra (10617)"
    },
    {
      "arabic": "صحيح ابن حبان (840)",
      "english": "Sahih Ibn Hibban (840)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih Lighairihi (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "باقیات صالحات کا مفہوم",
        "english": "Concept of Everlasting Good Deeds"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دنیا کی زینت بمقابلہ آخرت کا سرمایہ",
              "english": "Worldly Adornment vs. Hereafter Treasure"
            },
            "content": {
              "urdu": [
                "قرآن کے مطابق مال اور اولاد دنیا کی زینت ہیں، جبکہ 'باقیات صالحات' وہ ہیں جن کا اجر ہمیشہ رہے گا۔",
                "یہ کلمات قیامت کے دن بندے کے میزان میں سب سے وزنی ثابت ہوں گے۔",
                "دنیا کی ہر چیز فانی ہے، مگر ان کلمات کا ثواب ابدی ہے۔"
              ],
              "english": [
                "According to the Quran, wealth and children are adornments of this world, while 'the everlasting righteous deeds' are those whose reward remains forever.",
                "These words will prove to be the heaviest on the servant's scale on the Day of Judgment.",
                "Everything in this world is fleeting, but the reward of these words is eternal."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کلماتِ ذکر کی عظمت",
        "english": "Greatness of the Words of Remembrance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توحید، تسبیح، تحمید اور تکبیر",
              "english": "Tawheed, Tasbih, Tahmid, and Takbir"
            },
            "content": {
              "urdu": [
                "ان کلمات میں اللہ کی توحید (لا الہ الا اللہ)، پاکیزگی (سبحان اللہ)، بڑائی (اللہ اکبر) اور شکر (الحمد للہ) کا مجموعہ ہے۔",
                "یہ چاروں کلمات اللہ کو تمام کلاموں میں سب سے زیادہ محبوب ہیں۔",
                "ان کلمات کو پڑھنے والا عرشِ الٰہی کے گرد ذکر کرنے والے فرشتوں کی مشابہت اختیار کرتا ہے۔"
              ],
              "english": [
                "These words combine Allah's Oneness (Tawheed), Purity (Tasbih), Greatness (Takbir), and Gratitude (Tahmid).",
                "These four phrases are the most beloved speech to Allah.",
                "One who recites these words resembles the angels who glorify Allah around the Divine Throne."
              ]
            }
          },
          {
            "title": {
              "urdu": "حول اور قوت کا اقرار",
              "english": "Acknowledging Might and Power"
            },
            "content": {
              "urdu": [
                "'لا حول ولا قوۃ الا باللہ' جنت کے خزانوں میں سے ایک خزانہ ہے۔",
                "اس کا مطلب یہ ہے کہ اللہ کی مدد کے بغیر نہ گناہ سے بچنے کی کوئی راہ ہے اور نہ نیکی کی کوئی طاقت۔",
                "یہ کلمہ انسان کے اندر عاجزی پیدا کرتا ہے اور تکبر کو ختم کرتا ہے۔"
              ],
              "english": [
                "'La hawla wa la quwwata illa billah' is one of the treasures of Paradise.",
                "It means there is no way to avoid sin nor any power to do good except through Allah's help.",
                "This phrase instills humility within a person and eradicates arrogance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکر کو اپنا معمول بنائیں",
              "english": "Make Dhikr a Routine"
            },
            "content": {
              "urdu": [
                "ان پانچوں کلمات کو ملا کر کثرت سے پڑھنے کی عادت ڈالنی چاہیے۔",
                "یہ ذکر چلتے پھرتے، کام کاج کے دوران اور فارغ اوقات میں آسانی سے کیا جا سکتا ہے۔",
                "دنیاوی پریشانیوں کے حل اور دل کے سکون کے لیے یہ ذکر اکسیر کا درجہ رکھتا ہے۔"
              ],
              "english": [
                "One should develop the habit of frequently reciting these five phrases together.",
                "This Dhikr can easily be performed while walking, working, or in free time.",
                "For resolving worldly anxieties and achieving peace of heart, this Dhikr is a potent remedy."
              ]
            }
          }
        ]
      }
    }
  ]
}