{
  "hadithId": 1165,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/42"],
    "kitabId": 12,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأضحية",
    "babId": 94
  },
  
  "takhreej": {
    "arabic": "صحيح. أخرجه أحمد (1/79)، وأبو داود (2804)، والترمذي (1498) وقال: حسن صحيح، والنسائي (4372)، وابن ماجه (3142)، وصححه ابن حبان والحاكم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ امام ترمذی، ابن حبان اور حاکم نے اس کی صحت کی تصدیق کی ہے۔",
    "english": "Sahih. Reported by Ahmad (1/79), Abu Dawud (2804), At-Tirmidhi (1498) who graded it Hasan Sahih, An-Nasa'i (4372), and Ibn Majah (3142). Graded Sahih by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "نَسْتَشْرِفَ",
      "english": "Pay attention / Inspect",
      "urdu": "ہم غور سے دیکھیں / معائنہ کریں"
    },
    {
      "arabic": "مُقَابَلَةٍ",
      "english": "Ear cut from front",
      "urdu": "جس کے کان کا اگلا حصہ کٹا ہو"
    },
    {
      "arabic": "مُدَابَرَةٍ",
      "english": "Ear cut from back",
      "urdu": "جس کے کان کا پچھلا حصہ کٹا ہو"
    },
    {
      "arabic": "خَرْمَاءَ",
      "english": "Slit ear",
      "urdu": "پھٹے ہوئے کان والا"
    },
    {
      "arabic": "ثَرْمَاءَ",
      "english": "Broken teeth",
      "urdu": "ٹوٹے ہوئے دانتوں والا"
    },
    {
      "arabic": "عَوْرَاءَ",
      "english": "One-eyed",
      "urdu": "کانا جانور"
    }
  ],
  "summary": {
    "urdu": "قربانی کے جانور کا مکمل معائنہ ضروری ہے؛ آنکھوں اور کانوں کے واضح عیوب والے جانور کی قربانی سے بچنا چاہیے۔",
    "english": "Thorough inspection of the sacrificial animal is required; animals with significant defects in eyes or ears should be avoided for sacrifice."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2804)",
      "english": "Sunan Abi Dawud (2804)"
    },
    {
      "arabic": "سنن الترمذي (1498)",
      "english": "Sunan at-Tirmidhi (1498)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F3XpA-Tj1O0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جانور کے معائنے کی اہمیت",
        "english": "Importance of Animal Inspection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غور سے دیکھ بھال کرنا",
              "english": "Diligent Inspection"
            },
            "content": {
              "urdu": [
                "قربانی کے لیے جانور خریدتے وقت اس کے تمام اعضاء کا باریک بینی سے جائزہ لینا سنت ہے۔",
                "نبی ﷺ نے خاص طور پر آنکھوں اور کانوں کی سلامتی کو جانچنے کا حکم دیا ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ اللہ کی راہ میں پیش کیا جانے والا ہدیہ عیب سے پاک ہونا چاہیے۔"
              ],
              "english": [
                "It is a Sunnah to carefully inspect all parts of the animal before purchasing it for sacrifice.",
                "The Prophet (ﷺ) specifically commanded checking the soundness of the eyes and ears.",
                "This order proves that the offering presented to Allah must be free from defects."
              ]
            }
          },
          {
            "title": {
              "urdu": "عیب دار جانور سے بچنا",
              "english": "Avoiding Defective Animals"
            },
            "content": {
              "urdu": [
                "ایسے عیوب جو جانور کی شکل و صورت یا اس کی قیمت کو کم کریں، ناپسندیدہ ہیں۔",
                "کانا پن یا کان کا کٹا ہونا واضح عیوب ہیں جو قربانی کے معیار کو متاثر کرتے ہیں۔",
                "بہترین جانور کا انتخاب اللہ کے شعائر کی تعظیم اور تقویٰ کی علامت ہے۔"
              ],
              "english": [
                "Defects that diminish the animal's appearance or its value are highly discouraged.",
                "Being one-eyed or having cut ears are obvious flaws that affect the quality of sacrifice.",
                "Choosing the best animal is a sign of honoring Allah's rituals and attaining piety."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کانوں اور دانتوں کے عیوب",
        "english": "Defects of Ears and Teeth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کان کٹے جانور کا حکم",
              "english": "Ruling on Cut Ears"
            },
            "content": {
              "urdu": [
                "اگر کان کا اگلا یا پچھلا حصہ کٹا ہو تو ایسی قربانی سے منع کیا گیا ہے۔",
                "اسی طرح اگر کان درمیان سے چرا ہوا ہو تو وہ بھی عیب دار جانور شمار ہوتا ہے۔",
                "فقہاء کے نزدیک اگر کان کا اکثر حصہ (نصف سے زیادہ) کٹا ہو تو قربانی جائز نہیں ہوتی۔"
              ],
              "english": [
                "If the front or back part of the ear is cut off, sacrificing such an animal is forbidden.",
                "Similarly, if the ear is slit through the middle, it is also considered a defective animal.",
                "According to jurists, if more than half of the ear is missing, the sacrifice is invalid."
              ]
            }
          },
          {
            "title": {
              "urdu": "ٹوٹے دانتوں والا جانور",
              "english": "Animal with Broken Teeth"
            },
            "content": {
              "urdu": [
                "جس جانور کے سامنے کے دانت ٹوٹے ہوئے ہوں، اس کی قربانی بھی ناپسندیدہ ہے۔",
                "اگر دانت ٹوٹنے کی وجہ سے جانور چارہ نہ کھا سکے تو قربانی جائز نہیں ہوگی۔",
                "دانتوں کی سلامتی جانور کی تندرستی اور توانائی کی ایک بڑی علامت ہوتی ہے۔"
              ],
              "english": [
                "Sacrificing an animal whose front teeth are broken is also discouraged in the Hadith.",
                "If the broken teeth prevent the animal from grazing or eating, the sacrifice is invalid.",
                "The soundness of the teeth is a major indicator of the animal's overall health and vigor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی بصیرت اور اصول",
        "english": "Juristic Insight and Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عیوب کی اقسام",
              "english": "Types of Defects"
            },
            "content": {
              "urdu": [
                "محدثین نے ان عیوب کو 'عیبِ فاحش' قرار دیا ہے جو قربانی میں رکاوٹ بنتے ہیں۔",
                "معمولی کٹ یا عیب جو نمایاں نہ ہو، اس سے قربانی ہو جاتی ہے مگر کراہت رہتی ہے۔",
                "اہلِ علم نے اس حدیث سے یہ اصول اخذ کیا کہ جانور ہر طرح سے کامل ہونا چاہیے۔"
              ],
              "english": [
                "Scholars categorize these as major defects that hinder the validity of the sacrifice.",
                "Minor nicks or flaws that are not prominent do not invalidate it, but it remains disliked.",
                "Scholars derived the principle that the animal should be perfect in every possible way."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط کا تقاضا",
              "english": "Requirement of Caution"
            },
            "content": {
              "urdu": [
                "قربانی کی تیاری میں احتیاط برتنا اللہ کی محبت اور ڈر کا اظہار ہے۔",
                "شک والے جانور کو چھوڑ کر واضح تندرست جانور لینا ایمان کا تقاضا ہے۔",
                "فقہاء کہتے ہیں کہ دانتوں، کانوں اور آنکھوں کا معائنہ خریداری کی بنیاد ہونا چاہیے۔"
              ],
              "english": [
                "Exercising caution in preparing for sacrifice expresses love and fear of Allah.",
                "Leaving a doubtful animal for a clearly healthy one is a requirement of faith.",
                "Jurists state that inspecting teeth, ears, and eyes should be the basis of purchase."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تربیتی سبق",
        "english": "Ethical and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بہترین کا انتخاب",
              "english": "Selection of the Best"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ اللہ کے لیے ہمیشہ بہترین چیز کا انتخاب کریں۔",
                "قربانی محض ایک رسم نہیں بلکہ جذبہِ ایثار کی عملی تربیت ہے۔",
                "جانور کی قیمت کے بجائے اس کے معیار اور سلامتی پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "This Hadith teaches us to always choose the absolute best for Allah's sake.",
                "Sacrifice is not merely a ritual but practical training in the spirit of devotion.",
                "One should focus on the quality and soundness of the animal rather than just the price."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی تعلیم",
              "english": "Teaching Discipline"
            },
            "content": {
              "urdu": [
                "عبادات میں تفصیلات کا خیال رکھنا ایک مسلمان کے نظم و ضبط کو ظاہر کرتا ہے۔",
                "رسول اللہ ﷺ کی ہدایات زندگی کے ہر شعبے میں کمال حاصل کرنے کی ترغیب دیتی ہیں۔",
                "ان احکامات پر عمل کرنے سے نیت میں اخلاص اور عمل میں حسن پیدا ہوتا ہے۔"
              ],
              "english": [
                "Attending to details in worship reflects the discipline of a true Muslim.",
                "The Prophet's (ﷺ) instructions encourage seeking perfection in every field of life.",
                "Following these commands creates sincerity in intention and beauty in action."
              ]
            }
          }
        ]
      }
    }
  ]
}