{
  "hadithId": 768,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/768"],
    "kitabId": 7,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 56
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (1547). والماذيانات هي مسايل المياه، وأقبال الجداول هي أوائل الأنهار الصغيرة. وهذا يفسر النهي العام عن كراء الأرض بأنه محمول على الغرر والجهالة.",
    "urdu": "صحیح۔ اسے امام مسلم (1547) نے روایت کیا ہے۔ 'ماذایانات' سے مراد پانی کی نالیاں ہیں اور 'اقبال الجداول' سے مراد چھوٹے نہروں کے ابتدائی حصے ہیں۔ یہ روایت زمین کے کرایے کی ممانعت کی اصل وجہ (یعنی دھوکہ اور جہالت) کو واضح کرتی ہے۔",
    "english": "Sahih. Reported by Muslim (1547). The term 'Maadhiyanat' refers to water channels, and 'Aqbal al-Jadawil' refers to the heads of small streams. This clarifies that the general prohibition of renting land was due to uncertainty (Gharar)."
  },
  "importantWords": [
    {
      "arabic": "كِرَاءِ",
      "english": "Renting",
      "urdu": "ٹھیکہ / کرایہ"
    },
    {
      "arabic": "الْمَاذِيَانَاتِ",
      "english": "Water channels",
      "urdu": "پانی کی نالیاں"
    },
    {
      "arabic": "أَقْبَالِ اَلْجَدَاوِلِ",
      "english": "Stream heads",
      "urdu": "نہروں کے کنارے"
    },
    {
      "arabic": "يَهْلِكُ",
      "english": "Perishes",
      "urdu": "تباہ ہونا"
    },
    {
      "arabic": "زَجَرَ",
      "english": "Forbade / Reprimanded",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "مَضْمُونٌ",
      "english": "Guaranteed / Fixed",
      "urdu": "طے شدہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ زمین کو نقد رقم (سونے چاندی) کے عوض کرایے پر دینا جائز ہے۔ ممانعت صرف اس صورت میں تھی جب کرایہ زمین کے کسی خاص غیر یقینی حصے کی پیداوار کو قرار دیا جائے۔",
    "english": "This Hadith clarifies that renting land for cash (gold/silver) is permissible. The prohibition only applied to uncertain crop-sharing where a specific, risky part of the land's produce was designated as rent."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1547)",
      "english": "Reported by Muslim (1547)"
    },
    {
      "arabic": "سنن النسائي (3903)",
      "english": "Sunan an-Nasa'i (3903)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رافع بن خديج",
        "english": "Rafi' bin Khadij"
      },
      "slug": "rafi-bin-khadij"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زمین کے کرایے کی شرعی حیثیت",
        "english": "Legal Status of Land Rental"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقد کرایے کا جواز",
              "english": "Permissibility of Cash Rent"
            },
            "content": {
              "urdu": [
                "سونے یا چاندی (نقد رقم) کے بدلے زمین کرایے پر دینا بالاتفاق جائز ہے۔",
                "رافع بن خدیج رضی اللہ عنہ نے واضح کیا کہ اس میں کوئی شرعی قباحت نہیں۔",
                "یہ طریقہ کار مزارع اور مالک دونوں کے لیے نفع و نقصان کے ابہام کو ختم کرتا ہے۔"
              ],
              "english": [
                "Renting land for gold, silver, or cash is universally permitted in Islamic Law.",
                "Rafi' bin Khadij (RA) clarified that there is no religious objection to this practice.",
                "This method eliminates uncertainty regarding profit and loss for both the tenant and the owner."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی اصل وجہ: غرر (دھوکہ)",
              "english": "The Core Reason for Prohibition: Gharar"
                },
            "content": {
              "urdu": [
                "ممانعت ان صورتوں میں تھی جہاں کرایہ زمین کے کسی خاص ٹکڑے کی پیداوار پر رکھا جاتا تھا۔",
                "مثال کے طور پر 'نالی کے کنارے والی فصل میری ہوگی'، یہ غیر یقینی ہے کیونکہ وہاں فصل ہو بھی سکتی ہے اور نہیں۔",
                "اسلام ہر اس معاملے سے روکتا ہے جس میں ایک فریق کا فائدہ یقینی اور دوسرے کا مشکوک ہو۔"
              ],
              "english": [
                "The prohibition applied to cases where rent was based on the produce of a specific patch of land.",
                "For example, claiming the crop near water channels is uncertain as it may or may not grow.",
                "Islam forbids any transaction where one party's gain is guaranteed while the other's is doubtful."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ماذایانات اور اقبال الجداول کی وضاحت",
        "english": "Explanation of Maadhiyanat and Streamlets"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قدیم دور کی غلط مزارعت",
              "english": "Incorrect Ancient Sharecropping"
            },
            "content": {
              "urdu": [
                "دورِ جاہلیت اور ابتدائے اسلام میں لوگ نالیوں کے قریب بہتر پیداوار والے حصے اپنے لیے رکھ لیتے۔",
                "باقی بنجر یا کم پیداوار والی زمین مزارع کے حصے میں آتی، جو کہ ظلم تھا۔",
                "نبی ﷺ نے اس ناانصافی کو ختم کر کے منصفانہ نظام متعارف کرایا۔"
              ],
              "english": [
                "In pre-Islamic times, owners reserved fertile areas near water for themselves.",
                "The tenant would get the barren or low-yield parts, which was an act of injustice.",
                "The Prophet (ﷺ) abolished this unfairness and introduced a just system."
              ]
            }
          },
          {
            "title": {
              "urdu": "مساوی تقسیم کا اصول",
              "english": "Principle of Equal Distribution"
            },
            "content": {
              "urdu": [
                "اگر پیداوار میں شراکت کرنی ہو تو وہ پورے کھیت کی مجموعی پیداوار کے تناسب سے ہونی چاہیے۔",
                "کرایہ متعین (Fixed) ہونا چاہیے تاکہ کسی قسم کا جھگڑا پیدا نہ ہو۔",
                "مساوی سلوک اسلامی معیشت کا بنیادی ستون ہے۔"
              ],
              "english": [
                "If sharecropping is done, it must be a percentage of the entire field's yield.",
                "The rent must be fixed or clearly defined to prevent any potential disputes.",
                "Equitable treatment is a fundamental pillar of the Islamic economic system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ابہام کا ازالہ",
        "english": "Clarifying Juristic Ambiguity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عام ممانعت کی تشریح",
              "english": "Interpretation of General Prohibition"
            },
            "content": {
              "urdu": [
                "بعض احادیث میں زمین کے کرایے سے مطلقاً منع کیا گیا ہے، جس سے مراد وہی 'خاص حصہ' والا کرایہ ہے۔",
                "رافع بن خدیج رضی اللہ عنہ کی یہ روایت ان مجمل احادیث کی بہترین تفسیر کرتی ہے۔",
                "جب ممانعت کی وجہ (جہالت) ختم ہو جائے تو معاملہ جائز ہو جاتا ہے۔"
              ],
              "english": [
                "Some Hadiths generally forbid renting land, which refers to the 'specific patch' method.",
                "This narration by Rafi' bin Khadij (RA) provides the best commentary on those general reports.",
                "Once the cause of prohibition (uncertainty) is removed, the transaction becomes valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "معلوم اور مضمون چیز",
              "english": "Known and Guaranteed Terms"
            },
            "content": {
              "urdu": [
                "حدیث میں 'معلوم' سے مراد وہ کرایہ ہے جو پہلے سے طے شدہ اور واضح ہو۔",
                "مضمون کا مطلب ہے کہ وہ چیز جس کی ادائیگی یقینی ہو اور اس میں قمار (جوا) نہ ہو۔",
                "جدید دور کے لیز اور کرایہ داری کے معاہدے اسی اصول پر مبنی ہیں۔"
              ],
              "english": [
                "In the Hadith, 'known' refers to rent that is pre-determined and clear.",
                "'Guaranteed' means the payment is certain and does not involve gambling-like risks.",
                "Modern leasing and rental agreements are based on these very principles."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاہدے کی شفافیت",
              "english": "Transparency in Contracts"
            },
            "content": {
              "urdu": [
                "کاروباری معاہدے میں ہر چیز واضح ہونی چاہیے تاکہ بعد میں فتنہ پیدا نہ ہو۔",
                "ایسی شرائط سے بچنا چاہیے جن میں کسی ایک فریق کے استحصال کا اندیشہ ہو۔",
                "اسلام ہمیں معاملات میں صفائی اور دیانتداری کا سبق دیتا ہے۔"
              ],
              "english": [
                "Business contracts must be explicit to prevent future discord or conflict.",
                "Terms that suggest the exploitation of one party must be avoided.",
                "Islam teaches us clarity and honesty in all our financial dealings."
              ]
            }
          },
          {
            "title": {
              "urdu": "استحصال کا خاتمہ",
              "english": "Ending Exploitation"
            },
            "content": {
              "urdu": [
                "زمیندار کو چاہیے کہ وہ کاشتکار کی محنت کا احترام کرے اور اسے غیر یقینی صورتحال میں نہ ڈالے۔",
                "نقد کرایہ کاشتکار کے لیے بعض اوقات بٹائی سے زیادہ سہولت بخش ہوتا ہے۔",
                "معاشرتی انصاف کا تقاضا ہے کہ نفع و نقصان کی تقسیم منصفانہ ہو۔"
              ],
              "english": [
                "Landowners should respect the tenant's labor and not put them in uncertain situations.",
                "Cash rent is often more convenient for the tenant than crop-sharing.",
                "Social justice requires that the distribution of profit and risk be equitable."
              ]
            }
          }
        ]
      }
    }
  ]
}