{
  "hadithId": 477,
  "hadithNo": 53,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1285"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1285) في كتاب الجنائز، باب الجلوس عند القبر. والبنت المذكورة هي أم كلثوم رضي الله عنها.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (1285) نے اسے روایت کیا ہے۔ یہ روایت اس بات کی دلیل ہے کہ وفات پر غم کا اظہار اور آنسو بہانا جائز ہے۔",
    "english": "Authentic. Reported by Al-Bukhari (1285). The daughter mentioned in the narration is Umm Kulthum (RA). This Hadith validates expressing grief through tears."
  },
  "importantWords": [
    {
      "arabic": "شَهِدْتُ",
      "english": "I witnessed / attended",
      "urdu": "میں حاضر ہوا"
    },
    {
      "arabic": "بِنْتًا",
      "english": "Daughter",
      "urdu": "صاحبزادی / بیٹی"
    },
    {
      "arabic": "تُدْفَنُ",
      "english": "Being buried",
      "urdu": "دفن کی جا رہی تھی"
    },
    {
      "arabic": "جَالِسٌ",
      "english": "Sitting",
      "urdu": "بیٹھے ہوئے"
    },
    {
      "arabic": "تَدْمَعَانِ",
      "english": "Shedding tears",
      "urdu": "آنسو بہہ رہے تھے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ کسی عزیز کی وفات پر رونا اور آنسو بہانا فطری عمل ہے اور سنتِ نبوی ﷺ سے ثابت ہے، بشرطیکہ نوحہ اور بین نہ کیا جائے۔",
    "english": "This Hadith demonstrates that weeping for the deceased is a natural human emotion and is Sunnah, provided it does not involve forbidden wailing."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1285)",
      "english": "Sahih al-Bukhari (1285)"
    },
    {
      "arabic": "سنن أبي داود (3134)",
      "english": "Sunan Abu Dawud (3134)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رونے کی شرعی حیثیت",
        "english": "Legal Status of Weeping"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آنسو بہانا اللہ کی رحمت ہے",
              "english": "Tears are a Mercy from Allah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے اپنے بیٹے ابراہیم اور صاحبزادیوں کی وفات پر آنسو بہائے۔",
                "آپ ﷺ نے فرمایا کہ یہ وہ رحمت ہے جو اللہ نے بندوں کے دلوں میں رکھی ہے۔",
                "آنکھوں سے آنسو نکلنا اور دل کا غمگین ہونا صبر کے منافی نہیں ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) wept at the death of his son Ibrahim and his daughters.",
                "He stated that these tears are a mercy placed by Allah in the hearts.",
                "Shedding tears and feeling sorrow is not contradictory to being patient."
              ]
            }
          },
          {
            "title": {
              "urdu": "نوحہ اور رونے میں فرق",
              "english": "Difference between Weeping and Wailing"
            },
            "content": {
              "urdu": [
                "آواز کے بغیر صرف آنسو بہانا ہر حال میں جائز اور مسنون ہے۔",
                "چیخنا، چلانا، کپڑے پھاڑنا اور بین کرنا اسلام میں سختی سے منع ہے۔",
                "نبی ﷺ نے زبان سے صرف وہی کلمات نکالنے کا حکم دیا جو رب کو پسند ہوں۔"
              ],
              "english": [
                "Shedding tears silently is permissible and a confirmed Sunnah of the Prophet.",
                "Screaming, tearing clothes, and wailing are strictly forbidden in Islam.",
                "The Prophet (ﷺ) commanded to utter only words that please the Lord."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تدفین کے موقع پر بیٹھنا",
        "english": "Sitting During the Burial"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبر کے پاس بیٹھنا",
              "english": "Sitting by the Grave"
            },
            "content": {
              "urdu": [
                "نبی ﷺ میت کی تدفین کے وقت قبر کے قریب تشریف فرما ہوتے تھے۔",
                "یہ بیٹھنا میت کے ساتھ ہمدردی اور تدفین کے عمل کی نگرانی کے لیے تھا۔",
                "اس دوران میت کے لیے استغفار اور آخرت کی یاد میں مشغول رہنا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used to sit near the grave during the burial process.",
                "This sitting was for showing compassion and overseeing the burial steps.",
                "One should engage in seeking forgiveness and reflecting on the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کو نصیحت کرنا",
              "english": "Advising the Companions"
            },
            "content": {
              "urdu": [
                "تدفین کے وقت نبی ﷺ اکثر صحابہ کو موت اور قبر کے احوال بتاتے۔",
                "اس موقع پر خاموشی اور سنجیدگی سے عبرت حاصل کرنا مسنون ہے۔",
                "موت کا منظر دیکھ کر دل میں رقت اور اللہ کا خوف پیدا ہونا چاہیے۔"
              ],
              "english": [
                "During burial, the Prophet (ﷺ) often advised about death and the grave.",
                "It is Sunnah to maintain silence and take heed from the burial scene.",
                "The sight of death should create softheartedness and fear of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "میت کے حقوق اور سنت",
        "english": "Rights of the Dead and Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تدفین میں حاضری کی فضیلت",
              "english": "Virtue of Attending Burial"
            },
            "content": {
              "urdu": [
                "جنازے میں شرکت کرنا اور تدفین تک رہنا عظیم ثواب کا باعث ہے۔",
                "نبی ﷺ نے خود اپنی اولاد کی تدفین میں شرکت کر کے اس کی اہمیت بتائی۔",
                "یہ عمل میت کے لواحقین کے لیے تسلی اور ہمدردی کا باعث بنتا ہے۔"
              ],
              "english": [
                "Attending the funeral and staying until burial brings a massive reward.",
                "The Prophet (ﷺ) showed its importance by attending his children's burial.",
                "This presence provides significant comfort to the bereaved family members."
              ]
            }
          },
          {
            "title": {
              "urdu": "ثباتِ قدمی کی دعا",
              "english": "Prayer for Steadfastness"
            },
            "content": {
              "urdu": [
                "تدفین کے بعد میت کے لیے قبر میں سوالات کے جواب کی دعا کرنی چاہیے۔",
                "نبی ﷺ نے اس موقع پر استغفار کی خصوصی تلقین فرمائی ہے۔",
                "میت اس وقت سب سے زیادہ اپنے بھائیوں کی دعاؤں کی محتاج ہوتی ہے۔"
              ],
              "english": [
                "After burial, one should pray for the deceased to answer the questions.",
                "The Prophet (ﷺ) specifically urged seeking forgiveness at this moment.",
                "The deceased is most in need of their brothers' prayers at this time."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و تربیتی پہلو",
        "english": "Moral and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی بشریت",
              "english": "Humanity of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا رونا آپ کی بشری نزاکت اور لطافتِ طبع کو ظاہر کرتا ہے۔",
                "آپ ﷺ تمام انسانوں میں سب سے زیادہ رحم دل اور شفیق تھے۔",
                "اولاد کا غم ایک ایسا صدمہ ہے جس پر رونا تقویٰ کے خلاف نہیں ہے۔"
              ],
              "english": [
                "His weeping reflects his human nature and the refinement of his soul.",
                "He (ﷺ) was the most merciful and compassionate among all of mankind.",
                "Grieving for children is a sorrow where crying does not negate piety."
              ]
            }
          },
          {
            "title": {
              "urdu": "آخرت کی تیاری",
              "english": "Preparing for the Hereafter"
            },
            "content": {
              "urdu": [
                "قبر کا کنارہ وہ مقام ہے جہاں سے ابدی سفر کا آغاز ہوتا ہے۔",
                "جنازے میں شرکت ہمیں اپنی موت کے لیے تیار رہنے کا سبق دیتی ہے۔",
                "اصل کامیابی اللہ کی رضا اور جنت کا حصول ہے جس کی فکر لازم ہے۔"
              ],
              "english": [
                "The edge of the grave is the point where the eternal journey begins.",
                "Attending funerals teaches us to be ready for our own departure.",
                "True success is attaining Allah's pleasure and Paradise, which is vital."
              ]
            }
          }
        ]
      }
    }
  ]
}