{
  "hadithId": 930,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/930", "tirmidhi/1201"],
    "kitabId": 8,
    "inKitabBab": 10,
    "arabicBook": "كتاب الإيلاء والظهار والكفارة",
    "babId": 73
  },
  
  "takhreej": {
    "arabic": "منكر بهذا السياق. رواه الترمذي (1201) من طريق مسلمة بن علقمة عن داود بن أبي هند. وضعفه الإمام أحمد وقال: مسلمة يحدث عن داود بمناكير. والصحيح أن النبي ﷺ آلى شهراً ثم رجع وكفر عن يمينه كما في الصحيحين.",
    "urdu": "یہ روایت ان الفاظ کے ساتھ منکر ہے۔ اسے ترمذی (1201) نے روایت کیا ہے مگر اس کے ایک راوی مسلمہ بن علقمہ کو امام احمد نے ضعیف کہا ہے اور ان کی داؤد سے روایات کو منکر قرار دیا ہے۔ صحیح بخاری و مسلم کی روایات اس کے معنی کی تائید کرتی ہیں کہ آپ ﷺ نے ایک ماہ کا ایلاء کیا تھا۔",
    "english": "Munkar (Rejected) with this specific chain/wording. Reported by At-Tirmidhi (1201). While the narrators are generally reliable, the specific link between Maslama and Dawud is weak. However, the core event of Ila' is established in Sahih Bukhari and Muslim."
  },
  "importantWords": [
    {
      "arabic": "آلَى",
      "english": "Took an oath of Ila'",
      "urdu": "ایلاء کیا (قسم کھائی)"
    },
    {
      "arabic": "حَرَّمَ",
      "english": "Made forbidden",
      "urdu": "حرام کیا"
    },
    {
      "arabic": "حَلَالًا",
      "english": "Permissible",
      "urdu": "حلال"
    },
    {
      "arabic": "يَمِينِ",
      "english": "Oath",
      "urdu": "قسم"
    },
    {
      "arabic": "كَفَّارَةً",
      "english": "Expiation",
      "urdu": "کفارہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بیان ہے کہ نبی ﷺ نے اپنی ازواج سے دور رہنے کی قسم کھائی تھی، پھر اس قسم کو ختم کر کے کفارہ ادا کیا، جو کہ قسم توڑنے کے شرعی حکم کی تعلیم ہے۔",
    "english": "The Hadith mentions that the Prophet (ﷺ) swore to stay away from his wives, then revoked the oath and offered expiation, teaching the legal ruling for breaking an oath."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1201)",
      "english": "Reported by At-Tirmidhi (1201)"
    },
    {
      "arabic": "أصله في البخاري (5289)",
      "english": "Original event in Al-Bukhari (5289)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "منكر",
    "english": "Munkar (Rejected)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایلاء کی حقیقت اور مفہوم",
        "english": "Reality and Meaning of Ila'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایلاء کی شرعی تعریف",
              "english": "Shariah Definition of Ila'"
            },
            "content": {
              "urdu": [
                "ایلاء سے مراد شوہر کا بیوی سے قربت نہ کرنے کی قسم کھانا ہے۔",
                "اسلام سے قبل اس کی کوئی مدت مقرر نہیں تھی جو عورت پر ظلم تھا۔",
                "اسلام نے اس کی حد چار ماہ مقرر کر دی تاکہ حقوق ضائع نہ ہوں۔"
              ],
              "english": [
                "Ila' refers to a husband swearing an oath to abstain from intimacy with his wife.",
                "Before Islam, there was no time limit, which was oppressive to women.",
                "Islam fixed a maximum limit of four months to protect marital rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا ایلاء کرنا",
              "english": "The Prophet's (ﷺ) Ila'"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ایک ماہ تک ازواج سے الگ رہنے کی قسم کھائی تھی۔",
                "یہ ایلاء ازواج مطہرات کی دنیاوی مطالبات پر ناراضگی کی بنا پر تھا۔",
                "آپ ﷺ نے 29 دن بعد قسم ختم کر کے رجوع فرما لیا تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) swore to stay away from his wives for one month.",
                "This was due to his displeasure regarding their worldly demands.",
                "He ended the oath after 29 days and returned to them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قسم اور کفارہ کے احکامات",
        "english": "Rulings on Oaths and Expiation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قسم توڑنے کا شرعی حل",
              "english": "Legal Solution for Breaking Oaths"
            },
            "content": {
              "urdu": [
                "اگر قسم توڑنا زیادہ بہتر ہو تو اسے توڑ کر کفارہ دینا چاہیے۔",
                "حلال چیز کو اپنے اوپر حرام کرنا بھی ایک قسم ہی شمار ہوتا ہے۔",
                "نبی ﷺ کا عمل بتاتا ہے کہ قسم نیکی کے کام میں رکاوٹ نہیں ہونی چاہیے۔"
              ],
              "english": [
                "If breaking an oath is better, one should break it and pay expiation.",
                "Making a permissible thing forbidden for oneself is treated as an oath.",
                "The Prophet's action shows oaths shouldn't hinder doing what is better."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفارہ کی نوعیت",
              "english": "Nature of Expiation"
            },
            "content": {
              "urdu": [
                "قسم کا کفارہ دس مسکینوں کو کھانا کھلانا یا لباس دینا ہے۔",
                "اگر اس کی استطاعت نہ ہو تو تین دن کے روزے رکھنا واجب ہے۔",
                "یہ کفارہ انسان کو اپنی زبان کی حفاظت اور سنجیدگی سکھاتا ہے۔"
              ],
              "english": [
                "Expiation involves feeding or clothing ten needy people.",
                "If one is unable to do so, fasting for three days is required.",
                "This kaffarah teaches a person to be serious and guard their tongue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عائلی زندگی اور نبوی اسوہ",
        "english": "Family Life and Prophetic Example"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھریلو تربیت کا انداز",
              "english": "Style of Domestic Discipline"
            },
            "content": {
              "urdu": [
                "ایلاء کا واقعہ ظاہر کرتا ہے کہ گھر میں نظم و ضبط ضروری ہے۔",
                "نبی ﷺ نے مار پیٹ کے بجائے خاموش علیحدگی کو ترجیح دی۔",
                "یہ عمل شوہروں کے لیے اشتعال کے وقت صبر کی بہترین مثال ہے۔"
              ],
              "english": [
                "The incident of Ila' shows that domestic discipline is necessary.",
                "The Prophet (ﷺ) preferred silent separation over physical harshness.",
                "This act is an example for husbands to show patience during provocation."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق اور صلح پسندی",
              "english": "Rights and Reconciliation"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اپنی قسم کے باوجود ازواج کے حقوق کا لحاظ رکھا۔",
                "صلح کے لیے اپنی قسم کا کفارہ ادا کرنا کمالِ بندگی ہے۔",
                "اسلام میں خاندانی تعلقات کو جوڑنا توڑنے سے زیادہ اہم ہے۔"
              ],
              "english": [
                "He respected the rights of his wives despite his personal oath.",
                "Paying expiation for the sake of reconciliation is a sign of true servitude.",
                "In Islam, uniting family ties is more important than upholding a rigid oath."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و اخلاقی فوائد",
        "english": "Juristic and Moral Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حلال کو حرام کرنے کی ممانعت",
              "english": "Prohibition of Forbidding the Halal"
            },
            "content": {
              "urdu": [
                "اللہ کی حلال کردہ اشیاء کو ہمیشہ کے لیے حرام کرنا جائز نہیں ہے۔",
                "ایسا کرنا اللہ کی شریعت میں مداخلت کے مترادف سمجھا جاتا ہے۔",
                "نبی ﷺ کو بھی اللہ نے اس بات پر متنبہ فرمایا تھا (سورۃ التحریم)۔"
              ],
              "english": [
                "It is not permissible to permanently forbid what Allah has made lawful.",
                "Doing so is considered interference in Allah's legislation.",
                "Allah even cautioned the Prophet (ﷺ) regarding this (Surah At-Tahrim)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیمی پہلو",
              "english": "Educational Aspect"
            },
            "content": {
              "urdu": [
                "یہ حدیث مبلغین کے لیے تربیت کا ایک اہم سبق فراہم کرتی ہے۔",
                "انسانی جذبات اور شرعی احکام میں توازن قائم رکھنا ضروری ہے۔",
                "ہر مشکل کا حل اللہ کی کتاب اور سنتِ رسول میں موجود ہے۔"
              ],
              "english": [
                "This Hadith provide a vital lesson in discipline for educators.",
                "It is essential to balance human emotions with Shariah rulings.",
                "The solution to every problem lies in Allah's Book and the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}