{
  "hadithId": 1310,
  "hadithNo": 34,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/80"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "الجامع - باب الترهيب من مساوئ الأخلاق",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "ضعيف جداً أو موضوع. رواه الترمذي (2505). قال الترمذي: 'حديث حسن غريب وليس إسناده بمتصل'، لأن خالد بن معدان لم يلحق معاذاً. وفي السند محمد بن الحسن الهمداني، اتهمه أحمد بالكذب ووضعه ابن حبان في الضعفاء.",
    "urdu": "یہ روایت سخت ضعیف یا موضوع ہے۔ اسے امام ترمذی (2505) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن غریب کہا ہے لیکن ساتھ ہی صراحت کی کہ سند متصل نہیں ہے۔ اس کے راوی محمد بن الحسن کو امام احمد نے کذاب (جھوٹا) قرار دیا ہے۔",
    "english": "Very weak or fabricated. Reported by At-Tirmidhi (2505). Although At-Tirmidhi graded it Hasan Gharib, he noted the chain is broken. One narrator, Muhammad bin al-Hasan, was accused of lying by Imam Ahmad."
  },
  "importantWords": [
    {
      "arabic": "عَيَّرَ",
      "english": "Taunted / Reproached",
      "urdu": "عار دلائی / شرمندہ کیا"
    },
    {
      "arabic": "بِذَنْبٍ",
      "english": "For a sin",
      "urdu": "کسی گناہ پر"
    },
    {
      "arabic": "لَمْ يَمُتْ",
      "english": "Will not die",
      "urdu": "نہیں مرے گا"
    },
    {
      "arabic": "يَعْمَلَهُ",
      "english": "Commits it",
      "urdu": "اسے کر لے"
    }
  ],
  "summary": {
    "urdu": "اگرچہ اس حدیث کی سند ضعیف ہے، مگر اس کا اخلاقی پیغام یہ ہے کہ کسی کے ماضی کے گناہوں پر اسے طعنہ دینا خود پسندی اور تکبر کی علامت ہے، جو انسان کو اسی برائی میں مبتلا کر سکتا ہے۔",
    "english": "Despite the weakness of the narration's chain, its moral essence warns that shaming others for past sins stems from arrogance, which may lead the mocker to fall into the same sin."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب صفة القيامة، رقم 2505",
      "english": "Sunan at-Tirmidhi, Book of the Description of the Day of Judgment, No. 2505"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاذ بن جبل",
        "english": "Mu'adh bin Jabal"
      },
      "slug": "muadh-bin-jabal"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "ضعيف جداً",
    "english": "Very Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دوسروں کو گناہ پر عار دلانے کی ممانعت",
        "english": "Prohibition of Shaming Others for Sins"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عار دلانے اور نصیحت میں فرق",
              "english": "Difference Between Shaming and Advising"
            },
            "content": {
              "urdu": [
                "نصیحت کا مقصد دوسرے کی اصلاح اور خیر خواہی ہوتا ہے، جو کہ اسلام میں پسندیدہ ہے۔",
                "عار دلانے (طعنہ دینے) کا مقصد دوسرے کو ذلیل کرنا اور خود کو اس سے بہتر سمجھنا ہوتا ہے۔",
                "جس گناہ سے کوئی توبہ کر چکا ہو، اسے بار بار یاد دلا کر شرمندہ کرنا اخلاقی طور پر انتہائی قبیح عمل ہے۔"
              ],
              "english": [
                "The goal of advising is reform and well-wishing, which is encouraged in Islam.",
                "The goal of shaming is to humiliate the other person and view oneself as superior.",
                "Repeatedly reminding someone of a sin they have already repented for is morally repugnant."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبر کا انجام",
              "english": "Consequence of Arrogance"
            },
            "content": {
              "urdu": [
                "دوسروں کے گناہوں پر طعنہ زنی انسان کے اندر چھپے ہوئے تکبر اور خود پسندی کو ظاہر کرتی ہے۔",
                "جب انسان دوسرے کو حقیر سمجھتا ہے تو اللہ تعالیٰ اسے اس کی اپنی حالت پر چھوڑ دیتا ہے، جس سے وہ خود اسی گناہ میں مبتلا ہو جاتا ہے۔",
                "عافیت اس میں ہے کہ انسان دوسروں کے عیب چھپائے اور اپنی اصلاح کی فکر کرے۔"
              ],
              "english": [
                "Mocking others for their sins reveals hidden pride and self-righteousness.",
                "When a person looks down on another, Allah may leave them to their own devices, leading them to commit the same sin.",
                "Safety lies in concealing the faults of others and focusing on one's own self-reform."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توبہ کی اہمیت اور حرمت",
        "english": "Sanctity and Importance of Repentance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہ سے توبہ کرنے والا",
              "english": "The One Who Repents"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا: 'گناہ سے توبہ کرنے والا ایسا ہے جیسے اس نے گناہ کیا ہی نہ ہو۔'",
                "جب اللہ نے توبہ قبول کر کے گناہ مٹا دیا، تو کسی انسان کو حق نہیں پہنچتا کہ وہ اس گناہ کو یاد دلا کر تذلیل کرے۔",
                "ایسا رویہ توبہ کرنے والے کی دل شکنی اور اسے دوبارہ گناہ کی طرف دھکیلنے کا باعث بن سکتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) said: 'The one who repents from sin is like one who has no sin.'",
                "Once Allah has accepted repentance and erased the sin, no human has the right to humiliate the person by bringing it up.",
                "Such behavior breaks the heart of the penitent and might drive them back toward sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی تحقیق اور محدثین کی رائے",
        "english": "Chain Verification and Scholars' Views"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کی فنی حیثیت",
              "english": "Technical Status of the Hadith"
            },
            "content": {
              "urdu": [
                "یہ حدیث اپنی سند کے لحاظ سے سخت ضعیف ہے، اس لیے اسے نبی ﷺ کا قطعی ارشاد نہیں مانا جا سکتا۔",
                "تاہم، اس کا معنی درست ہے اور دیگر صحیح احادیث (جیسے عیب چھپانے کی فضیلت) اس کی تائید کرتی ہیں۔",
                "حسن بصریؒ اور دیگر اکابرینِ سلف سے اس مفہوم کے اقوال منقول ہیں۔"
              ],
              "english": [
                "Technically, the chain is very weak and cannot be definitively attributed to the Prophet (ﷺ).",
                "However, the meaning is sound and supported by Sahih narrations regarding the virtue of concealing others' faults.",
                "Statements with this similar meaning have been narrated from Hasan al-Basri and other early scholars."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اخلاقی سبق",
        "english": "Practical Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اپنے عیبوں پر نظر",
              "english": "Observing One's Own Faults"
            },
            "content": {
              "urdu": [
                "عقلمند وہ ہے جو دوسروں کے عیب ڈھونڈنے کے بجائے اپنے عیبوں کو دیکھ کر ان کی اصلاح کرے۔",
                "ہمیں اللہ سے ہمیشہ عافیت اور ثابت قدمی مانگنی چاہیے، نہ کہ اپنی نیکی پر ناز کرنا چاہیے۔",
                "کسی کی لغزش پر 'الحمدللہ الذی عافانی' (شکر ہے اس اللہ کا جس نے مجھے اس سے بچایا) کہنا چاہیے، نہ کہ مذاق اڑانا چاہیے۔"
              ],
              "english": [
                "The wise person is one who corrects their own faults instead of searching for the faults of others.",
                "We should always ask Allah for well-being and steadfastness rather than being proud of our virtues.",
                "Upon seeing someone's slip, one should say, 'Praise be to Allah who saved me,' rather than mocking them."
              ]
            }
          }
        ]
      }
    }
  ]
}