{
  "hadithId": 833,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/10"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5030) ومسلم (1425). وهو حديث أصل في باب المهر وجواز كونه تعليم قرآن.",
    "urdu": "صحیح۔ اسے بخاری (5030) اور مسلم (1425) نے روایت کیا ہے۔ یہ حدیث مہر کے احکام اور قرآن سکھانے کو مہر بنانے کے جواز میں اصل بنیاد ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5030) and Muslim (1425). It is a fundamental Hadith regarding the rulings of Mahr (dowry)."
  },
  "importantWords": [
    {
      "arabic": "أَهَبُ",
      "english": "To gift / present",
      "urdu": "ہبہ کرنا / تحفہ دینا"
    },
    {
      "arabic": "طَأْطَأَ",
      "english": "Lowered (his head)",
      "urdu": "نیچا کر لیا"
    },
    {
      "arabic": "خَاتَمًا",
      "english": "Ring",
      "urdu": "انگوٹھی"
    },
    {
      "arabic": "إِزَارِي",
      "english": "My lower garment",
      "urdu": "میرا تہ بند"
    },
    {
      "arabic": "مَلَّكْتُكَهَا",
      "english": "I have given her in your charge",
      "urdu": "میں نے اسے تمہاری ملکیت (نکاح) میں دے دیا"
    },
    {
      "arabic": "عَنْ ظَهْرِ قَلْبِكَ",
      "english": "By heart (from memory)",
      "urdu": "زبانی یاد ہونا"
    }
  ],
  "summary": {
    "urdu": "نکاح کے لیے مہر کا ہونا ضروری ہے، تاہم اگر مال میسر نہ ہو تو قرآن کی تعلیم یا کوئی علمی خدمت بھی مہر قرار دی جا سکتی ہے۔",
    "english": "Mahr is an essential part of marriage; however, if wealth is unavailable, teaching the Qur'an can serve as a valid dowry."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5030)",
      "english": "Sahih al-Bukhari (5030)"
    },
    {
      "arabic": "صحيح مسلم (1425)",
      "english": "Sahih Muslim (1425)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سهل بن سعد الساعدي",
        "english": "Sahl bin Sa'd al-Sa'idi"
      },
      "slug": "sahl-bin-sad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0_u6e6eK2rI",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہر کی شرعی حیثیت",
        "english": "Sharia Status of Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہر کا لازمی ہونا",
              "english": "Requirement of Mahr"
            },
            "content": {
              "urdu": [
                "نکاح کے لیے مہر ایک لازمی شرعی تقاضا ہے جو مرد کی طرف سے عورت کو دیا جاتا ہے۔",
                "نبی کریم ﷺ نے انتہائی غریب صحابی سے بھی مہر کی تلاش کا تقاضا فرمایا۔",
                "اس سے ثابت ہوتا ہے کہ مہر کے بغیر نکاح کا تصور مکمل نہیں ہوتا۔"
              ],
              "english": [
                "Mahr is an obligatory Sharia requirement given by the husband to the wife.",
                "The Prophet (ﷺ) insisted on finding a dowry even from an extremely poor companion.",
                "This proves that the concept of marriage is incomplete without a designated Mahr."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہر کی کم از کم مقدار",
              "english": "Minimum Amount of Mahr"
            },
            "content": {
              "urdu": [
                "شریعت میں مہر کی کوئی خاص بڑی مقدار مقرر نہیں، یہ حسبِ استطاعت ہونا چاہیے۔",
                "لوہے کی انگوٹھی کا ذکر ظاہر کرتا ہے کہ مہر معمولی مالیت کا بھی ہو سکتا ہے۔",
                "اسلام نے مہر میں آسانی پیدا کرنے کی ترغیب دی ہے تاکہ نکاح آسان ہو۔"
              ],
              "english": [
                "Sharia does not fix a massive amount for Mahr; it should be according to means.",
                "The mention of an iron ring shows that Mahr can be of minimal material value.",
                "Islam encourages ease in setting Mahr to facilitate the process of marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمِ قرآن بطور مہر",
        "english": "Teaching Qur'an as Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مالی مہر کا جواز",
              "english": "Permissibility of Non-Monetary Mahr"
            },
            "content": {
              "urdu": [
                "اگر نقد رقم یا سونا چاندی میسر نہ ہو تو علمی خدمت کو مہر بنایا جا سکتا ہے۔",
                "قرآن کی سورتیں سکھانا ایک عظیم معنوی اور دینی مہر ہے۔",
                "یہ اس بات کی دلیل ہے کہ علم و ہنر بھی ایک قیمتی اثاثہ ہیں۔"
              ],
              "english": [
                "If cash or jewelry is unavailable, educational services can be designated as Mahr.",
                "Teaching chapters of the Qur'an is a noble spiritual and religious dowry.",
                "This serves as evidence that knowledge and skills are valuable assets."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن کی عظمت",
              "english": "Greatness of the Qur'an"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے قرآن کو مادی مال و متاع پر ترجیح دی۔",
                "جس صحابی کے پاس مال نہیں تھا، اس کے پاس قرآن کا ہونا اس کی فضیلت بن گیا۔",
                "یہ عمل امت کو پیغام دیتا ہے کہ قرآن سیکھنا اور سکھانا کتنا اہم ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) prioritized the Qur'an over material wealth and possessions.",
                "For the companion who lacked money, knowing the Qur'an became his greatest virtue.",
                "This action sends a message to the Ummah about the importance of teaching the Qur'an."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نکاح میں آسانی اور حیا",
        "english": "Ease and Modesty in Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی کریم ﷺ کی بصیرت",
              "english": "The Insight of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے عورت کے سوال پر خاموشی اختیار کر کے اس کی حیا کا بھرم رکھا۔",
                "صحابی کی ضرورت دیکھ کر آپ ﷺ نے فوری طور پر نکاح کا انتظام فرمایا۔",
                "یہ واقعہ حکمران اور مربی کے طور پر آپ ﷺ کی شفقت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) maintained the woman's modesty by remaining silent initially.",
                "Recognizing the companion's need, he immediately arranged the marriage.",
                "This incident highlights his compassion as a leader and a spiritual mentor."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیوہ اور مجرد افراد کی فکر",
              "english": "Concern for Single Individuals"
            },
            "content": {
              "urdu": [
                "معاشرے میں نکاح کو اتنا آسان ہونا چاہیے کہ کوئی بھی بن بیاہا نہ رہے۔",
                "غریبی نکاح کی راہ میں رکاوٹ نہیں بننی چاہیے۔",
                "صحابی کا آدھا تہ بند پیش کرنا ان کے نکاح کے لیے شوق اور قربانی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Marriage should be easy enough in society so that no one remains single.",
                "Poverty should not act as an insurmountable barrier to getting married.",
                "The companion offering half his garment shows his deep desire and sacrifice for marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کے لیے کوشش",
              "english": "Striving for Marriage"
            },
            "content": {
              "urdu": [
                "انسان کو چاہیے کہ وہ حلال طریقے سے زندگی گزارنے کے لیے مہر کا بندوبست کرے۔",
                "حتیٰ کہ لوہے کی انگوٹھی جیسی معمولی چیز بھی مہر ہو سکتی ہے۔",
                "اسلام نے معاشرے کو پاکیزہ رکھنے کے لیے نکاح کی حوصلہ افزائی کی ہے۔"
              ],
              "english": [
                "One should strive to arrange Mahr to lead a lawful and pure life.",
                "Even a minor item like an iron ring can suffice as a valid dowry.",
                "Islam encourages marriage to maintain the moral purity of the society."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم کی وراثت",
              "english": "The Inheritance of Knowledge"
            },
            "content": {
              "urdu": [
                "دینی علم دنیاوی مال سے زیادہ قیمتی اور پائیدار پونجی ہے۔",
                "شوہر کا بیوی کو قرآن سکھانا ان کے تعلق میں برکت کا باعث بنتا ہے۔",
                "یہ حدیث علم کی اہمیت کو معاشی تناظر میں بھی واضح کرتی ہے۔"
              ],
              "english": [
                "Religious knowledge is a more valuable and lasting asset than worldly wealth.",
                "A husband teaching his wife the Qur'an brings immense blessing to their relationship.",
                "This Hadith clarifies the value of knowledge even in an economic context."
              ]
            }
          }
        ]
      }
    }
  ]
}