{
  "hadithId": 952,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/952"
    ],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (6/370)، وأبو داود (2300)، والنسائي (3511)، والترمذي (1204)، وابن ماجه (2031). وقال الترمذي: حديث حسن صحيح. وصححه ابن حبان والحاكم والذهلي.",
    "urdu": "یہ روایت صحیح ہے۔ اسے امام احمد (6/370)، ابوداؤد (2300)، نسائی (3511)، ترمذی (1204) اور ابن ماجہ (2031) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے اور ابن حبان و حاکم نے بھی اس کی تصحیح کی ہے۔",
    "english": "Sahih. Reported by Ahmad (6/370), Abu Dawud (2300), An-Nasa'i (3511), At-Tirmidhi (1204), and Ibn Majah (2031). At-Tirmidhi graded it Hasan Sahih, and it was authenticated by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "أَعْبُدٍ",
      "english": "Slaves",
      "urdu": "غلاموں"
    },
    {
      "arabic": "مَسْكَنًا",
      "english": "Dwelling / House",
      "urdu": "رہنے کی جگہ"
    },
    {
      "arabic": "نَفَقَةً",
      "english": "Maintenance / Expenses",
      "urdu": "نفقہ / خرچہ"
    },
    {
      "arabic": "اُمْكُثِي",
      "english": "Stay / Remain",
      "urdu": "تم ٹھہرو"
    },
    {
      "arabic": "أَجَلَهُ",
      "english": "Its appointed term",
      "urdu": "اپنی مدت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ وفات کی عدت گزارنے والی عورت کے لیے اسی گھر میں رہنا واجب ہے جہاں وہ شوہر کی وفات کے وقت مقیم تھی، الا یہ کہ کوئی شدید شرعی عذر ہو۔",
    "english": "This Hadith establishes that it is obligatory for a widow to observe her Iddah in the same house where she was residing at the time of her husband's death, unless there is a severe legal necessity."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2300)",
      "english": "Reported by Abu Dawud (2300)"
    },
    {
      "arabic": "رواه الترمذي (1204)",
      "english": "Reported by At-Tirmidhi (1204)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "فريعة بنت مالك",
        "english": "Furai'ah bint Malik"
      },
      "slug": "furaiah-bint-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9U0K07_z0U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عدت میں سکونت کا حکم",
        "english": "Ruling of Residency During Iddah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سابقہ گھر میں قیام کی اہمیت",
              "english": "Importance of Staying in the Marital Home"
            },
            "content": {
              "urdu": [
                "شوہر کی وفات کے وقت بیوہ جس گھر میں رہائش پذیر تھی، وہیں عدت گزارنا واجب ہے۔",
                "نبی ﷺ نے سیدہ فریعہ کو پہلے اجازت دی مگر پھر حکمِ الہی کی روشنی میں رجوع فرمایا۔",
                "یہ پابندی عورت کی حفاظت اور نکاح کے رشتے کی حرمت کو برقرار رکھنے کے لیے ہے۔"
              ],
              "english": [
                "It is obligatory for a widow to observe Iddah in the house where she resided at the time of her husband's death.",
                "The Prophet (ﷺ) initially granted permission but then corrected it based on Divine decree.",
                "This restriction ensures the protection of the woman and upholds the sanctity of the marriage bond."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدت کی مدت کی تحدید",
              "english": "Defining the Duration of Iddah"
            },
            "content": {
              "urdu": [
                "بیوہ کی عدت چار ماہ دس دن ہے، اس دوران گھر تبدیل کرنا جائز نہیں ہے۔",
                "قرآن مجید کے حکم 'حتی یبلغ الکتاب اجلہ' سے مراد عدت کی اسی مدت کی تکمیل ہے۔",
                "اس دوران عورت کو زیب و زینت اور گھر سے بلا ضرورت نکلنے سے پرہیز کرنا چاہیے۔"
              ],
              "english": [
                "The Iddah for a widow is four months and ten days, during which changing residence is not allowed.",
                "The Quranic command 'until the prescribed term is reached' refers to completing this specific period.",
                "During this time, the woman must refrain from adornment and leaving the house without necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مالکیت اور نفقہ کے مسائل",
        "english": "Ownership and Maintenance Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملکیتی گھر کی شرط نہیں",
              "english": "Ownership is Not a Prerequisite"
            },
            "content": {
              "urdu": [
                "عدت کے لیے یہ ضروری نہیں کہ گھر شوہر کی اپنی ملکیت میں ہو۔",
                "کرائے کے مکان یا عارضی رہائش گاہ میں بھی عدت وہیں پوری کی جائے گی۔",
                "سیدہ فریعہ کے شوہر نے ملکیتی گھر نہیں چھوڑا تھا، پھر بھی انہیں وہیں رکنے کا حکم ملا۔"
              ],
              "english": [
                "For observing Iddah, it is not necessary that the house be owned by the husband.",
                "Even in a rented house or temporary residence, the Iddah must be completed there.",
                "Furai'ah's husband did not leave an owned house, yet she was commanded to remain in that residence."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفقہ (خرچہ) کا انتظام",
              "english": "Maintenance and Provision"
            },
            "content": {
              "urdu": [
                "بیوہ کا نفقہ اس کے اپنے مال یا شوہر کی وراثت سے پورا کیا جاتا ہے۔",
                "اگر وراثت نہ ہو تو بیوہ کے قریبی رشتہ داروں پر اس کی کفالت کی ذمہ داری ہے۔",
                "مالی تنگی کے باوجود شرعی ضابطے کی پابندی کو گھر کی تبدیلی پر ترجیح دی گئی ہے۔"
              ],
              "english": [
                "A widow's maintenance is drawn from her own property or the husband's inheritance.",
                "If there is no inheritance, her close relatives bear the responsibility of her support.",
                "Despite financial hardship, adhering to Shariah regulations is prioritized over moving house."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلفائے راشدین کا طرزِ عمل",
        "english": "Practice of the Rightly Guided Caliphs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عثمانؓ کا فیصلہ",
              "english": "Decision of Uthman (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عثمان غنی رضی اللہ عنہ نے اپنے دورِ خلافت میں اسی حدیث کے مطابق فیصلہ دیا۔",
                "خلفائے راشدین نے سنتِ نبوی کو قانون کی حیثیت دے کر معاشرے میں رائج کیا۔",
                "صحابہ کرام کا کسی حدیث پر عمل کرنا اس کی صحت اور اہمیت کی بڑی دلیل ہے۔"
              ],
              "english": [
                "Uthman ibn Affan (RA) gave judicial rulings during his caliphate according to this Hadith.",
                "The Rightly Guided Caliphs implemented the Sunnah as established law in society.",
                "The practice of the companions regarding a Hadith is strong evidence of its authenticity and weight."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماعِ صحابہ اور تسلسل",
              "english": "Consensus and Continuity"
            },
            "content": {
              "urdu": [
                "اکثر صحابہ اور ائمہ فقہ اسی بات پر متفق ہیں کہ عدت کے دوران گھر نہ بدلا جائے۔",
                "یہ تسلسل ظاہر کرتا ہے کہ عائلی قوانین میں استحکام کتنا ضروری ہے۔",
                "اسلامی عدالتی نظام میں آثارِ صحابہ کو ایک مستند ماخذ کی حیثیت حاصل ہے۔"
              ],
              "english": [
                "The majority of companions and Imams of Fiqh agree that the house should not be changed during Iddah.",
                "This continuity shows how essential stability is within family laws.",
                "In the Islamic judicial system, the precedents of the companions are held as authentic sources."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استثنائی حالات اور رخصت",
        "english": "Exceptional Circumstances and Concessions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوف اور ناگزیر ضرورت",
              "english": "Fear and Absolute Necessity"
            },
            "content": {
              "urdu": [
                "اگر بیوہ کو اکیلے رہنے میں جان یا مال کا خطرہ ہو تو وہ جگہ بدل سکتی ہے۔",
                "اگر گھر منہدم ہونے کا ڈر ہو یا کرایہ ادا کرنے کی کوئی صورت نہ ہو تو رخصت ہے۔",
                "اسلامی شریعت ضرورت کے وقت انسانی جان اور عزت کو ترجیح دیتی ہے۔"
              ],
              "english": [
                "If a widow fears for her life or property while staying alone, she may change her location.",
                "If the house is at risk of collapsing or there is no way to pay rent, a concession exists.",
                "Islamic Shariah prioritizes human life and dignity in times of dire necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور حکمت",
              "english": "Moderation and Wisdom"
            },
            "content": {
              "urdu": [
                "عورت کو بلا ضرورت گھر سے نہیں نکلنا چاہیے، مگر ضروری کاموں کے لیے اجازت ہے۔",
                "سوگ کا مطلب دنیا سے مکمل کٹ جانا نہیں بلکہ زینت سے بچنا ہے۔",
                "دینِ اسلام میں ہر حکم کے پیچھے انسانی فلاح اور معاشرتی نظم و ضبط پوشیدہ ہے۔"
              ],
              "english": [
                "A woman should not leave the house unnecessarily, but permission exists for essential tasks.",
                "Mourning does not mean complete social isolation, but rather refraining from adornment.",
                "Behind every command in Islam lies human welfare and social discipline."
              ]
            }
          }
        ]
      }
    }
  ]
}