{
  "hadithId": 862,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/52"],
    "kitabId": 8,
    "inKitabBab": 2,
    "arabicBook": "كتاب النكاح",
    "babId": 65
  },
 
  "takhreej": {
    "arabic": "ضعيف . رواه أحمد (2/207)، والترمذي (1143)، وابن ماجه (2010). وفي سنده حجاج بن أرطاة وهو مدلس. والحديث الصحيح هو حديث ابن عباس عند أحمد وأبي داود (2240) أن النبي صلى الله عليه وسلم ردها بالنكاح الأول.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے احمد، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ اس کی سند میں حجاج بن ارطاہ مدلس ہے اور اسے ضعیف قرار دیا گیا ہے۔ صحیح روایت ابن عباس کی ہے کہ آپ ﷺ نے انہیں پہلے نکاح پر ہی برقرار رکھا تھا۔",
    "english": "Weak. Reported by Ahmad (2/207), At-Tirmidhi (1143), and Ibn Majah (2010). Its chain includes Hajjaj bin Artat, who is a Mudallis. The authentic version is from Ibn 'Abbas, stating they were returned based on the first marriage."
  },
  "importantWords": [
    {
      "arabic": "رَدَّ",
      "english": "Returned",
      "urdu": "واپس بھیجا / لوٹایا"
    },
    {
      "arabic": "اِبْنَتَهُ",
      "english": "His daughter",
      "urdu": "اپنی بیٹی"
    },
    {
      "arabic": "نِكَاحٍ جَدِيدٍ",
      "english": "New marriage contract",
      "urdu": "نیا نکاح"
    },
    {
      "arabic": "أَجْوَدُ",
      "english": "Better / More excellent",
      "urdu": "عمدہ / بہتر"
    },
    {
      "arabic": "إِسْنَادًا",
      "english": "Chain of narration",
      "urdu": "سند کے اعتبار سے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تذکرہ ہے کہ جب سیدہ زینب کے شوہر ابوالعاص ایمان لائے تو نبی ﷺ نے ان کا دوبارہ نکاح پڑھایا، تاہم محققین کے نزدیک پہلے نکاح پر برقرار رکھنے والی روایت زیادہ مستند ہے۔",
    "english": "This Hadith mentions that the Prophet (ﷺ) performed a new marriage for Zainab and Abu al-As upon his conversion, though scholars prefer the report stating they remained on their original contract."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب النكاح، رقم الحديث ١١٤٣",
      "english": "Jami` at-Tirmidhi, Book of Marriage, Hadith No. 1143"
    },
    {
      "arabic": "سنن ابن ماجه، كتاب النكاح، رقم الحديث ٢٠١٠",
      "english": "Sunan Ibn Majah, Book of Marriage, Hadith No. 2010"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "ضعيف (والعمل على خلافه)",
    "english": "Da'if (Weak - and the practice is contrary to it)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح پر کفر کے اثرات",
        "english": "Effects of Disbelief on Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہجرت اور جدائی کا واقعہ",
              "english": "Migration and Separation"
            },
            "content": {
              "urdu": [
                "سیدہ زینب رضی اللہ عنہا ہجرت کر کے مدینہ آ گئی تھیں جبکہ ابوالعاص مکہ میں ہی رہے۔",
                "اسلام قبول کرنے میں تاخیر کی وجہ سے ان کے درمیان طویل جدائی رہی۔",
                "نبی کریم ﷺ نے اپنی بیٹی کے اس صبر اور رشتہ داری کا پورا لحاظ رکھا۔"
              ],
              "english": [
                "Zainab (RA) migrated to Madinah while Abu al-As remained in Makkah as a non-Muslim.",
                "Due to the delay in his conversion, they remained separated for a long period.",
                "The Prophet (ﷺ) showed immense consideration for his daughter's patience and family ties."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدت کے اندر اسلام لانا",
              "english": "Converting within the Iddah"
            },
            "content": {
              "urdu": [
                "اگر شوہر عدت کے دوران اسلام لے آئے تو نکاح برقرار رہتا ہے اور تجدید کی ضرورت نہیں۔",
                "سیدہ زینب اور ابوالعاص کے معاملے میں سالوں کی جدائی تھی جس نے فقہی بحث چھیڑی۔",
                "جمہور کے نزدیک اگر میاں بیوی دونوں مسلمان ہو جائیں تو وہ پرانے نکاح پر رہ سکتے ہیں۔"
              ],
              "english": [
                "If the husband accepts Islam during the waiting period, the marriage remains valid without renewal.",
                "The case of Zainab and Abu al-As involved years of separation, sparking juristic debate.",
                "The majority view is that if both become Muslim, they can continue their original marriage."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایات کا تقابل اور ترجیح",
        "english": "Comparison and Preference of Narrations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابن عباس کی روایت کی فضیلت",
              "english": "Superiority of Ibn Abbas's Narration"
            },
            "content": {
              "urdu": [
                "امام احمد اور دیگر محدثین نے ابن عباس کی روایت کو زیادہ صحیح اور مستند قرار دیا ہے۔",
                "اس روایت کے مطابق آپ ﷺ نے انہیں 'پہلے نکاح' کی بنیاد پر ہی اکٹھا رہنے دیا۔",
                "یہ موقف اسلام میں داخل ہونے والوں کے لیے آسانی اور رحمت کا باعث ہے۔"
              ],
              "english": [
                "Imam Ahmad and other critics stated that Ibn Abbas's report is more authentic and sound.",
                "According to this report, the Prophet (ﷺ) kept them together based on the 'first marriage'.",
                "This position reflects ease and mercy for those entering the fold of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمرو بن شعیب کی روایت کا ضعف",
              "english": "Weakness of Amr bin Shu'aib's Report"
            },
            "content": {
              "urdu": [
                "اس روایت کی سند میں حجاج بن ارطاہ ہے جو کہ ثقہ نہیں مانا جاتا۔",
                "نئے نکاح کی شرط اسلام لانے والوں پر بوجھ بن سکتی تھی جو سنت کے خلاف ہے۔",
                "محدثین کے نزدیک جب دو روایات ٹکرائیں تو قوی سند والی کو ترجیح دی جاتی ہے۔"
              ],
              "english": [
                "The chain of this report contains Hajjaj bin Artat, who is not considered reliable.",
                "Requiring a new contract could have been a burden for new converts, contrary to Sunnah.",
                "Scholars prioritize the narration with the stronger chain when two reports conflict."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمتیں اور فوائد",
        "english": "Juristic Wisdom and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کا استحکام",
              "english": "Stability of the Family System"
            },
            "content": {
              "urdu": [
                "اسلام خاندان کو توڑنے کے بجائے اسے جوڑنے اور مستحکم کرنے کی کوشش کرتا ہے۔",
                "سابقہ نکاح کو تسلیم کرنا میاں بیوی کے درمیان الفت کو برقرار رکھنے میں مددگار ہے۔",
                "یہ عمل ثابت کرتا ہے کہ ایمان لانے سے سابقہ جائز سماجی بندھن ختم نہیں ہوتے۔"
              ],
              "english": [
                "Islam strives to unite and stabilize the family rather than dismantling it.",
                "Recognizing the previous marriage helps maintain affection between the spouses.",
                "This practice proves that entering faith does not nullify prior valid social bonds."
              ]
            }
          },
          {
            "title": {
              "urdu": "نو مسلموں کے لیے سہولت",
              "english": "Facilitation for New Muslims"
            },
            "content": {
              "urdu": [
                "نئے نکاح اور مہر کی شرط نو مسلموں کے لیے مالی اور سماجی مشکل پیدا کر سکتی تھی۔",
                "شریعت نے نکاح کے معاملے میں لچک رکھ کر دعوتِ دین کے کام کو آسان بنایا۔",
                "اسلام ایک دینِ فطرت ہے جو انسانی تعلقات کی نزاکتوں کو سمجھتا ہے۔"
              ],
              "english": [
                "Mandating a new contract and dower could cause financial and social hardship for converts.",
                "Sharia eased the path of Dawah by maintaining flexibility in marriage laws.",
                "Islam is a religion of nature that understands the sensitivities of human relationships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور تربیت",
        "english": "Practical Lesson and Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق الحدیث کی اہمیت",
              "english": "Importance of Hadith Research"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ ہر سنی سنائی بات کو بغیر تحقیق قبول نہیں کرنا چاہیے۔",
                "علماء کا روایات کو پرکھنا دین کی حفاظت کا ایک اہم حصہ ہے۔",
                "مستند علم ہی صحیح عمل کی بنیاد بنتا ہے۔"
              ],
              "english": [
                "This Hadith teaches us not to accept every report without thorough investigation.",
                "Scholars' scrutiny of narrations is a vital part of preserving the religion.",
                "Authentic knowledge forms the foundation for correct religious practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور وفاداری",
              "english": "Modesty and Loyalty"
            },
            "content": {
              "urdu": [
                "سیدہ زینب کی اپنے شوہر کے لیے وفاداری رہتی دنیا تک کے لیے ایک مثال ہے۔",
                "نبی ﷺ نے ان کی محبت اور رشتہ داری کا احترام فرما کر ہمیں اخلاق سکھائے۔",
                "ایمان کے ساتھ ساتھ اعلیٰ اخلاقی اقدار کی پاسداری بھی ضروری ہے۔"
              ],
              "english": [
                "Zainab's loyalty to her husband remains an example for the world to follow.",
                "The Prophet (ﷺ) taught us ethics by respecting her love and kinship ties.",
                "Upholding high moral values alongside faith is essential for a believer."
              ]
            }
          }
        ]
      }
    }
  ]
}