{
  "hadithId": 81,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["muslim:269a"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": " صحيح. رواه مسلم (269) . ضعيف. أي بلفظ: \"والموارد\" وباقيه صحيح. رواه أبو داود (26) ولفظه: \"اتقوا الملاعن الثلاث: البراز في الموارد، وقارعة الطريق، والظل\". ضعيف. رواه أحمد (2715) . أي: التخلي. منكر. رواه الطبراني بتمامه في \"الأوسط\" كما في مجمع البحرين (349) ، وفي \"الكبير\" الشطر الأخير منه كما في \"مجمع الزوائد\" (104) .",
    "urdu": "ابوہریرہ رضی اللہ عنہ کی روایت **صحیح** ہے (مسلم 269)۔ ابوداؤد (26) اور احمد (2715) کی روایات میں اضافے (الموارد، نقْع ماء) سند کے اعتبار سے ضعیف ہیں، اگرچہ مرکزی حکم (راستہ اور سایہ) صحیح ہے۔",
    "english": "The core Hadith from Abu Hurairah is **Sahih** (Muslim 269). The additions in Abu Dawud (26) and Ahmad (2715) chains regarding 'watering places' and 'stagnant water' are weak, although the main prohibition (pathway and shade) is sound."
  },
  "importantWords": [
    {
      "arabic": "اِتَّقُوا",
      "english": "Beware of / Avoid",
      "urdu": "اجتناب کرو / بچو"
    },
    {
      "arabic": "اَللَّاعِنِينَ",
      "english": "The two acts that draw curses",
      "urdu": "دو لعنت کا سبب بننے والی چیزیں"
    },
    {
      "arabic": "يَتَخَلَّى",
      "english": "He relieves himself (defecates/urinates)",
      "urdu": "قضائے حاجت کرتا ہے"
    },
    {
      "arabic": "طَرِيقِ",
      "english": "Pathway / Road",
      "urdu": "راستہ"
    },
    {
      "arabic": "ظِلِّهِمْ",
      "english": "Their shade (resting place)",
      "urdu": "ان کا سایہ"
    },
    {
      "arabic": "اَلْمَوَارِدَ",
      "english": "Watering places / Access to water",
      "urdu": "گھاٹ / پانی کی جگہ"
    },
    {
      "arabic": "نَقْعِ مَاءٍ",
      "english": "Stagnant water",
      "urdu": "جمع شدہ پانی"
    },
    {
      "arabic": "اَلْأَشْجَارِ اَلْمُثْمِرَةِ",
      "english": "Fruit-bearing trees",
      "urdu": "پھل دار درخت"
    },
    {
      "arabic": "ضَفَّةِ",
      "english": "Bank / Edge",
      "urdu": "کنارہ"
    },
    {
      "arabic": "اَلنَّهْرِ الْجَارِي",
      "english": "Flowing river",
      "urdu": "جاری نہر"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے ان ممنوعہ مقامات کی نشاندہی کرتی ہے جو لوگوں کے لیے تکلیف اور لعنت کا سبب بنتے ہیں۔ بنیادی طور پر لوگوں کے **راستہ** اور ان کی **سایہ دار بیٹھنے کی جگہوں** پر رفع حاجت کرنا سخت منع ہے۔",
    "english": "This Hadith identifies prohibited places for relieving oneself that cause distress and invite curses from people. Primarily, it strictly forbids answering the call of nature in **public pathways** and in **resting places under shade**."
  },
  "references": [
    {
      "arabic": "رواه مسلم (269)",
      "english": "Reported by Muslim (No. 269)"
    },
    {
      "arabic": "رواه أبو داود (26)",
      "english": "Reported by Abu Dawud (No. 26)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ - رضى الله عنه",
        "english": "Abu Hurairah (May Allah be pleased with him)"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "مُعَاذٍ",
        "english": "Mu'adh (May Allah be pleased with him)"
      },
      "slug": "muadh-ibn-jabal"
    },
    {
      "id": 3,
      "name": {
        "arabic": "اِبْنِ عَبَّاسٍ",
        "english": "Ibn Abbas (May Allah be pleased with them both)"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "لعنت کا سبب بننے والے دو اعمال",
        "english": "The Two Acts that Draw Curses (Al-La'inayn)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راستہ میں قضائے حاجت",
              "english": "Relieving Oneself in the Pathway"
            },
            "content": {
              "urdu": [
                "راستہ میں قضائے حاجت کرنے کا مطلب ہے کسی بھی عام گزرگاہ، شاہراہ یا لوگوں کے استعمال میں آنے والے راستے پر نجاست کرنا۔",
                "ایسا کرنے سے لوگوں کو تکلیف ہوتی ہے، ان کے بدن یا لباس پر نجاست لگنے کا خطرہ ہوتا ہے، اور یہ اسلامی تعلیمات کے منافی ہے۔",
                "نبی صلی اللہ علیہ وسلم نے اس سے اس لیے منع فرمایا کیونکہ یہ عمل لوگوں کی لعنت اور برائی کا سبب بنتا ہے جو اس جگہ سے گزریں گے۔"
              ],
              "english": [
                "Relieving oneself in the pathway means defecating or urinating on any public road, highway, or path used by people.",
                "This causes distress to others, risks contaminating their bodies or clothing with impurity, and is against Islamic teachings.",
                "The Prophet (PBUH) prohibited this because the act invites curses and condemnation from the people who must use or bypass that area."
              ]
            }
          },
          {
            "title": {
              "urdu": "سایہ دار آرام گاہیں",
              "english": "Resting Places under Shade"
            },
            "content": {
              "urdu": [
                "سایہ دار جگہ سے مراد وہ مقام ہے جہاں لوگ گرمی یا دھوپ سے بچنے کے لیے ٹھہرتے ہیں یا بیٹھے کر بات چیت کرتے ہیں۔",
                "ایسی جگہ کو ناپاک کرنا نہ صرف لوگوں کے آرام کی جگہ کو غلیظ کرتا ہے بلکہ ان کی ملکیت اور حق تلفی بھی ہے۔",
                "مسلم کی روایت میں یہ دو جگہیں (راستہ اور سایہ دار جگہ) لعنت کو دعوت دینے والے بنیادی اسباب کے طور پر ذکر ہوئی ہیں۔"
              ],
              "english": [
                "A shaded place refers to any spot where people gather, rest, or seek shelter from the heat or sun.",
                "Defiling such a spot not only pollutes a place of public utility but also violates the rights and comfort of others.",
                "In the sound (Sahih) narration of Muslim, these two locations (pathway and shade) are mentioned as the primary reasons for inviting curses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ضعیف اضافے اور ان کا فقہی حکم",
        "english": "Weak Additions and their Juristic Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی کی جگہوں کا حکم",
              "english": "Ruling on Water Sources"
            },
            "content": {
              "urdu": [
                "معاذ رضی اللہ عنہ کی روایت میں **گھاٹوں (مَوَارِدَ)** اور ابن عباس رضی اللہ عنہما کی روایت میں **جمع شدہ پانی (نَقْعِ مَاءٍ)** سے نہی وارد ہوئی ہے۔",
                "اگرچہ ان اضافوں کی سند ضعیف ہے، لیکن فقہاء نے انہیں **صحیح قیاس** کی بنا پر قبول کیا ہے کہ یہ بھی لوگوں کو تکلیف دہ ہیں۔",
                "پینے یا استعمال کے پانی کو ناپاک کرنا شدید نقصان دہ ہے اور یہ بھی لوگوں کی لعنت کا سبب بن سکتا ہے۔ "
              ],
              "english": [
                "The narrations of Mu'adh mention the prohibition on **watering places (Mawarid)** and Ibn Abbas on **stagnant water (Naq'i Ma')**.",
                "Although the chains of these additions are weak, jurists accept them based on **sound analogy (Qiyas)**, as they cause similar distress to people.",
                "Contaminating drinking or utility water is severely harmful and can also invite people's curses. "
              ]
            }
          },
          {
            "title": {
              "urdu": "پھل دار درخت اور نہر کا کنارہ",
              "english": "Fruit Trees and River Banks"
            },
            "content": {
              "urdu": [
                "طبرانی کی روایت (ابن عمر سے) میں **پھل دار درخت کے نیچے** اور **جاری نہر کے کنارے** رفع حاجت سے منع کیا گیا ہے۔",
                "پھل دار درخت کے نیچے کرنے سے پھل اور لوگوں کے کھانے کی چیزیں نجس ہو سکتی ہیں، جو ایک نقصان دہ عمل ہے۔",
                "جاری نہر کا کنارہ یا جاری پانی کو آلودہ کرنا عمومی صحت کے لیے خطرہ ہے، اس لیے ان سب سے اجتناب واجب ہے۔"
              ],
              "english": [
                "At-Tabarani's narration (from Ibn Umar) prohibits relieving oneself **under fruit-bearing trees** and on the **bank of a flowing river**.",
                "Doing so under fruit trees risks contaminating the fruit and people's food, which is a harmful act.",
                "Polluting the bank or water of a flowing river poses a risk to general health, making avoidance of all these places obligatory."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مضمرات اور حیاء",
        "english": "Juristic Implications and Modesty (Haya)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحریم کا سبب: ضرر رسانی",
              "english": "Reason for Prohibition: Causing Harm (Darar)"
            },
            "content": {
              "urdu": [
                "ان تمام ممنوعہ جگہوں کی ممانعت کا بنیادی سبب یہ ہے کہ یہ لوگوں کو تکلیف (ضرر) پہنچاتی ہیں، جو اسلام میں حرام ہے۔",
                "راستہ، سایہ اور پانی کی جگہوں کو نجس کرنا لوگوں کے حقوق کی خلاف ورزی اور ان کی ضروریات کی توہین ہے۔",
                "اسلام میں طہارت کا حکم صرف فرد کی ذات تک محدود نہیں بلکہ اس کا تعلق **سماجی آداب** اور عوامی حقوق سے بھی ہے۔"
              ],
              "english": [
                "The core reason for prohibiting all these locations is that they cause harm (Darar) to people, which is forbidden in Islam.",
                "Defiling pathways, shade, and water sources is a violation of people's rights and a disrespect to their needs.",
                "The command for purity in Islam is not just limited to the individual but also relates to **social etiquette** and public rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعنت کا معنی",
              "english": "Meaning of the Curse (Al-La'inayn)"
            },
            "content": {
              "urdu": [
                "'اللاعنین' کا لفظی معنی ہے 'وہ دو چیزیں جو لعنت کا سبب بنتی ہیں'— یعنی وہ جن پر لوگ لعنت بھیجتے ہیں۔",
                "جو شخص ان جگہوں پر رفع حاجت کرے گا، گزرنے والے اسے بددعا دیں گے، اور یہ بری عاقبت کی علامت ہے۔",
                "یہ شدید وعید حیاء اور نظافت کی اہمیت کو اجاگر کرتی ہے کہ گندگی پھیلانا اتنا بڑا جرم ہے جو لعنت کا مستحق بنا دے۔"
              ],
              "english": [
                "The literal meaning of 'Al-La'inayn' is 'the two acts that bring curses'—meaning the places where people curse the perpetrator.",
                "The person who relieves himself in these spots will be cursed by passersby, indicating a severely negative consequence.",
                "This stern warning underscores the importance of modesty and cleanliness, showing that spreading filth is a major offense deserving of condemnation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Modern Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شہروں میں قضائے حاجت",
              "english": "Relieving Oneself in Cities"
            },
            "content": {
              "urdu": [
                "شہروں اور قصبوں میں یہ حکم گلیوں، پارکوں اور عام عوامی مقامات پر رفع حاجت کی ممانعت کو شامل کرتا ہے۔",
                "مسلمانوں کو چاہیے کہ وہ ہمیشہ بیت الخلاء استعمال کریں اور عوامی جگہوں پر گندگی پھیلانے سے سخت اجتناب کریں۔",
                "پانی کے گھاٹ اور جمع شدہ پانی کی جگہوں کی ممانعت کا اطلاق نلکوں، تالابوں، اور نہروں کے کنارے پر بھی ہوتا ہے۔"
              ],
              "english": [
                "In cities and towns, this ruling extends to prohibiting relieving oneself in streets, public parks, and general public areas.",
                "Muslims must always use dedicated lavatories and strictly avoid causing contamination in public spaces.",
                "The prohibition against watering places and stagnant water applies equally to public fountains, ponds, and riverbanks."
              ]
            }
          },
          {
            "title": {
              "urdu": "صفائی اور اسلامی تعلیمات",
              "english": "Cleanliness and Islamic Teachings"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک بہت بڑا سماجی اور ماحولیاتی اصول فراہم کرتی ہے جو عوامی صفائی اور حفظان صحت کی تعلیم دیتا ہے۔",
                "صفائی نصف ایمان ہے، اور دوسروں کو تکلیف سے بچانا اسلامی اخلاق کا بنیادی جزو ہے۔",
                "سخت ممانعت کے باوجود، اگر کسی جگہ مجبوری ہو تو اسے لوگوں کی نظروں سے دور اور غیر استعمال شدہ زمین میں کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith provides a major social and environmental principle, teaching public hygiene and sanitation.",
                "Cleanliness is half of faith, and preventing harm to others is a fundamental component of Islamic ethics.",
                "Despite the strict prohibition, if necessity dictates, one must perform the act far away from view and in unused, barren ground."
              ]
            }
          }
        ]
      }
    }
  ]
}
