{
  "hadithId": 472,
  "hadithNo": 48,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/48", "muslim/977", "tirmidhi/1054"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (977)، والترمذي (1054) وقال: حسن صحيح، وابن ماجه (1571) من حديث ابن مسعود بسند فيه ضعف لكن معناه صحيح وتؤيده الروايات الأخرى.",
    "urdu": "صحیح۔ اسے امام مسلم (977) نے اپنی صحیح میں روایت کیا ہے۔ ترمذی (1054) نے اسے حسن صحیح کہا۔ ابن ماجہ (1571) کی زیادتی اگرچہ سنداً کچھ کمزور ہے مگر اس کا مفہوم دیگر صحیح روایات سے ثابت ہے۔",
    "english": "Sahih. Reported by Muslim (977) and At-Tirmidhi (1054) who graded it Hasan Sahih. The addition in Ibn Majah (1571) via Ibn Mas'ud has some weakness in its chain, but its meaning is authentic and supported by other narrations."
  },
  "importantWords": [
    {
      "arabic": "نَهَيْتُكُمْ",
      "english": "I forbade you",
      "urdu": "میں نے تمہیں منع کیا تھا"
    },
    {
      "arabic": "زِيَارَةِ",
      "english": "Visiting",
      "urdu": "زیارت / ملنا"
    },
    {
      "arabic": "تُذَكِّرُ",
      "english": "Reminds",
      "urdu": "یاد دلاتی ہے"
    },
    {
      "arabic": "تُزَهِّدُ",
      "english": "Makes indifferent",
      "urdu": "بے رغبت کرتی ہے"
    },
    {
      "arabic": "الآخِرَةَ",
      "english": "The Hereafter",
      "urdu": "آخرت"
    },
    {
      "arabic": "الدُّنْيَا",
      "english": "The World",
      "urdu": "دنیا"
    }
  ],
  "summary": {
    "urdu": "قبروں کی زیارت اب جائز اور مستحب ہے کیونکہ یہ انسان کو آخرت کی یاد دلاتی ہے اور دنیا کی رنگینیوں سے بے رغبت کر کے توبہ کی طرف مائل کرتی ہے۔",
    "english": "Visiting graves is now permissible and recommended as it serves as a reminder of the Hereafter and diminishes worldly attachment."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الجنائز، رقم 977",
      "english": "Sahih Muslim, The Book of Funerals, Hadith 977"
    },
    {
      "arabic": "سنن الترمذي، كتاب الجنائز، رقم 1054",
      "english": "Sunan at-Tirmidhi, Book of Funerals, Hadith 1054"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "بريدة بن الحصيب الأسلمي",
        "english": "Buraidah bin al-Haseeb al-Aslami"
      },
      "slug": "buraidah-bin-al-haseeb"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حکم کی تبدیلی اور حکمت",
        "english": "Change of Ruling and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممانعت سے اباحت تک",
              "english": "From Prohibition to Permissibility"
            },
            "content": {
              "urdu": [
                "اسلام کے ابتدائی دور میں قبروں کی زیارت سے اس لیے روکا گیا تھا تاکہ لوگ جاہلانہ رسوم اور شرک سے دور رہیں۔",
                "جب مسلمانوں کے دلوں میں توحید راسخ ہو گئی، تو آپ ﷺ نے اس پابندی کو ختم کر کے زیارت کی اجازت دے دی۔",
                "یہ اس بات کی دلیل ہے کہ شریعت کے بعض احکامات مصلحت کے تحت تبدیل (منسوخ) ہوئے ہیں۔"
              ],
              "english": [
                "In the early days of Islam, visiting graves was forbidden to keep people away from pagan rituals and Shirk.",
                "Once Monotheism became firmly rooted in the hearts of Muslims, the Prophet (ﷺ) lifted the ban.",
                "This serves as evidence that certain Sharia rulings were modified (abrogated) based on communal welfare."
              ]
            }
          },
          {
            "title": {
              "urdu": "جاہلیت کی رسوم کا خاتمہ",
              "english": "Ending Pre-Islamic Customs"
            },
            "content": {
              "urdu": [
                "جاہلیت میں لوگ قبروں پر چیخ و پکار اور فخریہ بین کرتے تھے، جس سے اسلام نے سختی سے روکا۔",
                "اب اجازت کا مقصد صرف اللہ کی یاد اور میت کے لیے دعا کرنا ہے، نہ کہ کوئی غیر شرعی حرکت۔",
                "اسلامی طریقے سے زیارتِ قبور انسان کے اخلاق اور روحانیت میں بہتری لاتی ہے۔"
              ],
              "english": [
                "In the Jahiliyyah era, people used graves for loud wailing and boastful mourning, which Islam strictly forbade.",
                "The current permission is solely for remembering Allah and praying for the dead, not for un-Islamic acts.",
                "Visiting graves in the Islamic manner improves a person's character and spirituality."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "زیارتِ قبور کے روحانی فوائد",
        "english": "Spiritual Benefits of Visiting Graves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخرت کی یاد دہانی",
              "english": "Reminder of the Hereafter"
            },
            "content": {
              "urdu": [
                "خاموش قبریں انسان کو پکار کر کہتی ہیں کہ ایک دن اسے بھی اسی مٹی کے نیچے آنا ہے۔",
                "یہ منظر دل کی سختی کو ختم کرتا ہے اور انسان کو اپنی موت کے لیے تیاری کی فکر دیتا ہے۔",
                "آخرت کا تصور ہی انسان کو گناہوں سے بچانے اور نیکیوں کی طرف راغب کرنے کا سب سے بڑا محرک ہے۔"
              ],
              "english": [
                "Silent graves call out to man, reminding him that one day he too must lie beneath this soil.",
                "This sight softens the heart and makes a person concerned about preparing for their own end.",
                "The concept of the Hereafter is the greatest motivator for avoiding sins and performing good deeds."
              ]
            }
          },
          {
            "title": {
              "urdu": "دنیا سے بے رغبتی",
              "english": "Indifference to the World"
            },
            "content": {
              "urdu": [
                "قبرستان جا کر انسان کو احساس ہوتا ہے کہ دنیا کی شان و شوکت اور مال و دولت سب عارضی ہے۔",
                "یہ زیارت دنیا کی حرص اور لالچ کو کم کرتی ہے اور قناعت پسندی کا جذبہ پیدا کرتی ہے۔",
                "جب انسان بڑے بڑے بادشاہوں کو مٹی میں دیکھتا ہے تو اس کا تکبر خاک میں مل جاتا ہے۔"
              ],
              "english": [
                "Visiting the graveyard makes one realize that worldly glory and wealth are all temporary.",
                "This visit reduces greed and worldly desire while fostering a spirit of contentment.",
                "When a person sees mighty rulers turned to dust, his arrogance is completely shattered."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آدابِ زیارت اور مسنون دعا",
        "english": "Etiquettes and Sunnah Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سلام اور دعا کا طریقہ",
              "english": "Method of Salutation and Prayer"
            },
            "content": {
              "urdu": [
                "قبرستان میں داخل ہوتے وقت 'السلام علیکم یا اھل القبور' کہنا اور میت کے لیے مغفرت کی دعا کرنا سنت ہے۔",
                "وہاں جا کر صرف اللہ سے مانگنا چاہیے، صاحبِ قبر سے مرادیں مانگنا یا سجدہ کرنا شرک ہے۔",
                "میت کے لیے تلاوتِ قرآن یا استغفار کرنا ان کے درجات کی بلندی کا سبب بنتا ہے۔"
              ],
              "english": [
                "It is Sunnah to say 'Peace be upon you, O inhabitants of the graves' and pray for their forgiveness.",
                "One should only ask from Allah at the graves; seeking needs from the deceased or prostrating is Shirk.",
                "Reciting Quran or seeking forgiveness for the deceased causes their ranks to be elevated."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کے لیے حکم",
              "english": "Ruling for Women"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک خواتین کے لیے بھی کبھی کبھار زیارتِ قبور جائز ہے اگر وہ صبر کا دامن نہ چھوڑیں۔",
                "کثرت سے جانے اور وہاں جزع فزع (بین) کرنے والی عورتوں پر حدیث میں لعنت آئی ہے۔",
                "خواتین کو چاہیے کہ وہ پردے اور شرعی حدود کا خیال رکھتے ہوئے عبرت کے لیے قبرستان جائیں۔"
              ],
              "english": [
                "Most scholars believe occasional visits are permissible for women if they maintain patience and decorum.",
                "Hadith curses women who visit frequently and engage in excessive wailing or prohibited acts.",
                "Women should observe Hijab and Sharia limits if they visit for the purpose of taking heed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Lesson for Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موت کی تیاری",
              "english": "Preparation for Death"
            },
            "content": {
              "urdu": [
                "قبرستان کی زیارت کو اپنی زندگی کا حصہ بنائیں تاکہ غفلت کے پردے چاک ہو سکیں۔",
                "موت کو کثرت سے یاد کرنا انسان کے اخلاق اور معاملات کو درست کرنے میں مدد دیتا ہے۔",
                "کامیاب وہ ہے جو اپنے آخری ٹھکانے کو یاد رکھے اور وہاں کے لیے نیک اعمال کا ذخیرہ کرے۔"
              ],
              "english": [
                "Make visiting the graveyard a part of your life to tear away the veils of negligence.",
                "Remembering death frequently helps in rectifying one's character and worldly dealings.",
                "Successful is the one who remembers their final abode and gathers righteous deeds for it."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور سنت کی پیروی",
              "english": "Moderation and Following Sunnah"
            },
            "content": {
              "urdu": [
                "زیارتِ قبور میں نہ تو بالکل ترک کرنا چاہیے اور نہ ہی وہاں میلے ٹھیلے لگانے چاہئیں۔",
                "سنتِ نبوی ﷺ کے مطابق سادگی سے جانا اور عبرت حاصل کرنا ہی اصل مقصود ہے۔",
                "دین میں غلو اور بدعات سے بچنا ہی ایمان کی سلامتی کی ضمانت ہے۔"
              ],
              "english": [
                "One should neither abandon visiting graves nor turn them into places of festivals.",
                "The real objective is to visit simply according to the Sunnah and gain a spiritual lesson.",
                "Avoiding extremism and innovations in religion is the guarantee of the safety of faith."
              ]
            }
          }
        ]
      }
    }
  ]
}