{
  "hadithId": 48,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 20 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجمع بين المضمضة والاستنشاق",
    "babId": 4
  },

  "takhreej": {
    "arabic": "صحيح.  وهو جزء من الحديث المتقدم برقم (34) . ",
    "urdu": "صحیح (درجہ)۔ اور یہ حدیث، حدیث نمبر (34) کا حصہ ہے۔",
    "english": "Sahih (Authentic). This is a part of the previously mentioned Hadith number (34)."
  },
  "importantWords": [
    {
      "arabic": "تَمَضْمَضَ",
      "english": "Rinsed his mouth",
      "urdu": "کلی کی"
    },
    {
      "arabic": "وَاسْتَنْثَرَ",
      "english": "And cleaned his nose",
      "urdu": "ناک میں پانی ڈالا"
    },
    {
      "arabic": "ثَلَاثًا",
      "english": "Three times",
      "urdu": "تین بار"
    },
    {
      "arabic": "يُمَضْمِضُ وَيَنْثِرُ",
      "english": "Rinsing mouth and nose",
      "urdu": "کلی اور ناک میں پانی ڈالتے"
    },
    {
      "arabic": "اَلْكَفِّ",
      "english": "The scoop/palm",
      "urdu": "ہاتھ (چلو)"
    },
    {
      "arabic": "اَلْمَاءَ",
      "english": "The water",
      "urdu": "پانی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح طور پر وضو کے عمل میں کلی کرنے اور ناک میں پانی ڈالنے کے لیے **ایک ہی چلو (scoop)** سے پانی استعمال کرنے کی سنت کو بیان کرتی ہے، اور اس عمل کو تین بار دہرانا سنت ہے۔",
    "english": "This Hadith clearly establishes the Sunnah of combining rinsing the mouth and cleaning the nose by using water from **a single scoop (Kaff)** of the hand for both actions, and repeating this combined action three times."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 136",
      "english": "Sunan Abī Dāwūd, The Book of Purification, Hadith 136"
    },
    {
      "arabic": "سنن النسائي، كتاب الطهارة، رقم 87",
      "english": "Sunan An-Nasā’ī, The Book of Purification, Hadith 87"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Ali ibn Abi Talib (May Allah be pleased with him)"
      },
      "slug": "ali-ibn-abi-talib"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-26-combine-mouth-nose",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کلی اور ناک کو جمع کرنے کی سنت",
        "english": "The Sunnah of Combining Mouth and Nose Rinse"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عملِ جمع اور اس کی کیفیت",
              "english": "The Combined Action and Its Manner"
            },
            "content": {
              "urdu": [
                "یہ حدیث وضو کے اندر کلی (مضمضہ) اور ناک میں پانی ڈالنے (استنثار) کے عمل کو ایک ہی چلو سے کرنے کا طریقہ سکھاتی ہے۔",
                "نبی اکرم ﷺ ایک ہی چلو میں پانی لیتے اور اس کے کچھ حصے سے کلی کرتے اور باقی حصے سے ناک صاف کرتے۔",
                "یہ طریقہ سنت میں **افضل** اور **صحیح ترین** مانا جاتا ہے، کیونکہ یہ نبی ﷺ کا کثرت سے عمل تھا۔"
              ],
              "english": [
                "This Hadith teaches the method of combining rinsing the mouth (Maḍmaḍah) and cleaning the nose (Istinthār) using a single scoop of water in Wudu.",
                "The Prophet (ﷺ) would take water in one scoop, use part of it for rinsing his mouth, and the rest for his nose.",
                "This method is considered the **most superior** and **most authentic Sunnah**, as it was the Prophet's most frequent practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "علیحدگی اور جمع کا حکم",
              "english": "The Ruling of Separation vs. Combination"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک کلی اور ناک میں پانی ڈالنا دونوں ہی **سنت مؤکدہ** ہیں اور ان کا ایک چلو سے کرنا **افضلیت** کا حامل ہے۔",
                "اگرچہ وضو درست ہو جاتا ہے اگر کوئی ان دونوں کو الگ الگ چلو سے بھی کرے، لیکن اس صورت میں سنتِ مؤکدہ کی فضیلت فوت ہو جائے گی۔",
                "یہ حدیث واضح کرتی ہے کہ ایک ہی عضو سے متصل دو عملوں کو ایک ساتھ مکمل کرنا وقت اور پانی کی بچت کے لیے بہترین ہے۔"
              ],
              "english": [
                "According to the majority of jurists, both rinsing the mouth and cleaning the nose are **Confirmed Sunnah (Sunnah Mu'akkadah)**, and performing them with one scoop holds **superiority**.",
                "Although the Wudu is valid if one uses separate scoops for each, the virtue of the superior Sunnah is missed in that case.",
                "This Hadith clarifies that completing two connected actions from a single source of water is best for conserving time and water."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعداد اور طریقہ کار",
        "english": "The Number of Times and Procedure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تثلیث (تین بار دہرانا)",
              "english": "Tathlīth (Repeating Thrice)"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے اس عمل کو **تین بار** دہرایا، جو وضو میں طہارت کو مکمل کرنے کی ایک اہم سنت ہے۔",
                "تثلیث (تین بار دہرانا) تمام غسل شدہ اعضاء کی صفائی اور ان کو پاک کرنے میں مبالغہ کو ظاہر کرتی ہے، جو فضیلت کا باعث ہے۔",
                "وضو کو سنت کے مطابق ادا کرنے کے لیے، ہر بار ایک ہی چلو سے کلی اور ناک صاف کرنے کے عمل کو تین بار مکمل کرنا چاہیے۔"
              ],
              "english": [
                "The Messenger of Allah (ﷺ) repeated this combined action **three times**, which is an essential Sunnah for perfecting the purification in Wudu.",
                "*Tathlīth* (repeating three times) signifies thoroughness in cleansing and purifying all washed limbs, which brings greater reward.",
                "To perform Wudu according to the Sunnah, one should complete the combined mouth-and-nose rinse action three times, using a single scoop each time."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرض اور سنت کا فرق",
              "english": "The Difference Between Obligatory and Sunnah"
            },
            "content": {
              "urdu": [
                "کلی اور ناک میں پانی ڈالنا، امام ابوحنیفہ اور امام مالک کے نزدیک **سنت** ہیں اور فرض نہیں، جبکہ دوسرے ائمہ کے نزدیک ان میں سے بعض کو واجب قرار دیا گیا ہے۔",
                "اگرچہ فرض صرف ایک بار دھونا ہے، لیکن نبی ﷺ نے ہمیشہ تین بار کیا اور اس سے سنت کی اہمیت واضح ہوئی۔",
                "مؤمن کو چاہیے کہ وہ وضو میں ہر عمل کو ایک، دو یا تین بار کرے، لیکن تین بار کرنا سب سے افضل ہے۔"
              ],
              "english": [
                "Rinsing the mouth and nose are considered **Sunnah** and not obligatory by Imām Abū Ḥanīfah and Imām Mālik, although some other Imāms deem them, or one of them, obligatory.",
                "Although the obligation is generally to wash once, the Prophet (ﷺ) consistently did it three times, clarifying the importance of the Sunnah.",
                "A believer should perform every action in Wudu one, two, or three times, but performing it three times is the most virtuous."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور فوائد",
        "english": "Juristic Wisdom and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی کا تحفظ اور آسانی",
              "english": "Water Conservation and Ease"
            },
            "content": {
              "urdu": [
                "وضو میں **ایک چلو** سے کلی اور ناک صاف کرنا پانی کے اسراف (فضول خرچی) سے بچنے کی عملی تعلیم ہے۔",
                "یہ طریقہ اسلام کی تعلیمات میں شامل ہے کہ طہارت جیسی اہم عبادت میں بھی سادگی اور وسائل کی بچت کو ملحوظ رکھا جائے۔",
                "پانی کی بچت نہ صرف ماحولیاتی لحاظ سے اہم ہے بلکہ اسراف کی ممانعت (حرمت) کے شرعی حکم پر عمل پیرا ہونے کا بھی ذریعہ ہے۔"
              ],
              "english": [
                "Using **one scoop** for both the mouth and nose rinse in Wudu is a practical lesson in avoiding extravagance (Isrāf) with water.",
                "This method aligns with Islamic teachings to observe simplicity and resource conservation, even in important acts of worship like purification.",
                "Water conservation is not only environmentally sound but also a means of adhering to the religious command against wastefulness."
              ]
            }
          },
          {
            "title": {
              "urdu": "چہرے کی طہارت سے تعلق",
              "english": "The Relation to Facial Purity"
            },
            "content": {
              "urdu": [
                "چہرہ دھونے کے حکم میں چہرے کے اندرونی حصے (منہ اور ناک) کی صفائی کو شامل کرنا ایک فقہی حکمت ہے تاکہ طہارت کامل ہو۔",
                "چہرہ وضو کا ایک اہم فرض ہے، اور منہ اور ناک کے رستے جسم کے اندرونی حصے سے منسلک ہیں، اس لیے انہیں پاک کرنا وضو کی روح ہے۔",
                "فقہاء نے اسی بنیاد پر کلی اور ناک میں پانی ڈالنے کو فرض یا سنتِ مؤکدہ قرار دیا ہے تاکہ چہرہ دھونے کی تکمیل ہو سکے۔"
              ],
              "english": [
                "It is a juristic wisdom to include the cleansing of the internal parts of the face (mouth and nose) in the command to wash the face, ensuring complete purity.",
                "The face is a major obligation of Wudu, and the mouth and nose are connected to the internal body, making their purification vital to the spirit of Wudu.",
                "Based on this, jurists deemed Maḍmaḍah and Istinthār either obligatory or confirmed Sunnah, to ensure the full completion of washing the face."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اور تعلیمی سبق",
        "english": "Practical and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی اور روحانی پاکیزگی",
              "english": "Physical and Spiritual Purity"
            },
            "content": {
              "urdu": [
                "کلی اور ناک میں پانی ڈالنا نہ صرف نماز کے لیے جسمانی طہارت کا ذریعہ ہے بلکہ یہ روحانی پاکیزگی کی علامت بھی ہے۔",
                "ناک اور منہ کا نظام جسم کا وہ حصہ ہے جہاں سے بدبو اور گندگی کا اخراج ہوتا ہے، لہٰذا ان کی مکمل صفائی ایک مسلمان کی بہترین حالت ہے۔",
                "اس سنت پر عمل کرنے سے، ایمان میں اضافہ ہوتا ہے اور انسان اللہ کے سامنے مکمل صفائی کے ساتھ کھڑا ہونے کے لیے تیار ہوتا ہے۔"
              ],
              "english": [
                "Rinsing the mouth and nose is not only a source of physical purification for Salah but also a symbol of spiritual cleanliness.",
                "The nose and mouth system is where foul odors and impurities can enter and exit the body, making their complete cleansing the optimal state for a Muslim.",
                "By adhering to this Sunnah, faith is enhanced, and one prepares to stand before Allah with the highest degree of purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتباع سنت کی اہمیت",
              "english": "Importance of Following the Sunnah"
            },
            "content": {
              "urdu": [
                "سیدنا علی رضی اللہ عنہ کی یہ روایت نبی اکرم ﷺ کے عملی وضو کی **دقیقی تفصیلات** کو امت تک پہنچاتی ہے، جو عملِ اتباع (پیروی) کا سب سے اونچا درجہ ہے۔",
                "ایک ہی چلو سے کلی اور ناک صاف کرنا اس بات کی دلیل ہے کہ وضو ایک منظم اور سادہ عمل ہے، جو کسی بھی قسم کی پیچیدگی سے پاک ہے۔",
                "مسلمان کو چاہیے کہ وہ ہر عمل میں نبی ﷺ کی سنت کو اپنائے، کیونکہ آپ ﷺ کا طریقہ کار ہر لحاظ سے کامل اور خیر و برکت والا ہے۔"
              ],
              "english": [
                "This narration by Sayyiduna Ali (RA) conveys the **precise details** of the Prophet's practical Wudu to the Ummah, representing the highest degree of following the Sunnah.",
                "Performing the mouth and nose rinse from a single scoop is evidence that Wudu is an organized and simple act, free from any unnecessary complexity.",
                "A Muslim should adopt the Sunnah of the Prophet (ﷺ) in every action, as his method is perfect and full of blessings in all respects."
              ]
            }
          }
        ]
      }
    }
  ]
}
