{
  "hadithId": 442,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/18"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (3154). وفي إسناده أبو مالك النخعي وهو ضعيف، لكن المعنى صحيح ومؤيد بأدلة أخرى تنهى عن الإسراف.",
    "urdu": "ضعیف۔ اسے ابوداؤد (3154) نے روایت کیا ہے۔ اس کی سند میں ابو مالک نخعی ضعیف راوی ہے، تاہم اس کا مفہوم دیگر صحیح احادیث اور شرعی اصولوں (اسراف کی ممانعت) سے مطابقت رکھتا ہے۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (3154). Its chain contains Abu Malik an-Nakha'i, who is weak. However, the meaning is supported by other Islamic principles that forbid extravagance."
  },
  "importantWords": [
    {
      "arabic": "لَا تُغَالُوا",
      "english": "Do not exceed limits / Go to extremes",
      "urdu": "غلو نہ کرو / حد سے نہ بڑھو"
    },
    {
      "arabic": "اَلْكَفَنِ",
      "english": "The shroud",
      "urdu": "کفن"
    },
    {
      "arabic": "يُسْلُبُ",
      "english": "Stripped away / Withered",
      "urdu": "سلب کر لیا جاتا ہے / چھین لیا جاتا ہے"
    },
    {
      "arabic": "سَرِيعًا",
      "english": "Quickly",
      "urdu": "جلدی سے"
    },
    {
      "arabic": "سَمِعْتُ",
      "english": "I heard",
      "urdu": "میں نے سنا"
    }
  ],
  "summary": {
    "urdu": "کفن کی خریداری میں فضول خرچی اور بہت زیادہ مہنگا کپڑا استعمال کرنے سے بچنا چاہیے کیونکہ یہ مٹی میں جلد ضائع ہو جاتا ہے۔",
    "english": "One should avoid extravagance and spending excessively on the shroud, as it is destined to decay quickly in the grave."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الجنائز، رقم 3154",
      "english": "Sunan Abi Dawud, Book of Funerals, Hadith 3154"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=AIs4y_F_CGE",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اسراف اور فضول خرچی کی ممانعت",
        "english": "Prohibition of Extravagance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفن میں میانہ روی",
              "english": "Moderation in Shrouding"
            },
            "content": {
              "urdu": [
                "کفن کا مقصد میت کے جسم کی پردہ پوشی ہے، اس میں فخر یا نمود و نمائش کی کوئی جگہ نہیں ہے۔",
                "نہایت قیمتی اور ریشمی کپڑا استعمال کرنا مال کو ضائع کرنے کے مترادف ہے جو کہ منع ہے۔",
                "شریعت ہمیں ہر معاملے میں، یہاں تک کہ تدفین میں بھی سادگی اور میانہ روی کا حکم دیتی ہے۔"
              ],
              "english": [
                "The purpose of the shroud is to cover the deceased's body; there is no room for pride or showing off.",
                "Using extremely expensive or silk fabric is equivalent to wasting wealth, which is prohibited.",
                "Sharia commands us toward simplicity and moderation in all matters, including funerals."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کی حفاظت",
              "english": "Preserving Wealth"
            },
            "content": {
              "urdu": [
                "میت کا مال اس کے ورثاء کا حق ہوتا ہے، اسے غیر ضروری جگہوں پر خرچ کرنا مناسب نہیں۔",
                "کفن پر بے جا خرچ کرنے کے بجائے وہ مال میت کے قرض کی ادائیگی یا صدقہ جاریہ میں لگنا چاہیے۔",
                "اسلامی تعلیمات کے مطابق زندہ لوگوں کا حق مردوں کے پرتعیش کفن سے زیادہ مقدم ہے۔"
              ],
              "english": [
                "The deceased's wealth belongs to the heirs; spending it on unnecessary items is inappropriate.",
                "Instead of excessive spending on the shroud, that wealth should go toward debts or charity.",
                "According to Islamic teachings, the rights of the living take precedence over luxury for the dead."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فنائیتِ دنیا کا سبق",
        "english": "Lesson on the Transience of the World"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفن کا انجام",
              "english": "The Fate of the Shroud"
            },
            "content": {
              "urdu": [
                "حدیث کے الفاظ 'فإنہ یسلب سریعاً' یاد دلاتے ہیں کہ قبر میں کپڑا بہت جلد گل سڑ جاتا ہے۔",
                "جو چیز مٹی ہو جانے والی ہو، اس پر کثیر سرمایہ خرچ کرنا عقل مندی کے خلاف ہے۔",
                "یہ پہلو انسان کو دنیا کی بے ثباتی اور آخرت کی فکر کی طرف مائل کرتا ہے۔"
              ],
              "english": [
                "The words 'it will soon be taken away' remind us that cloth decays very quickly in the grave.",
                "It is against wisdom to spend heavily on something that is destined to become dust.",
                "This aspect inclines a person toward the transience of the world and concern for the hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلی لباس تقویٰ ہے",
              "english": "The Real Garment is Taqwa"
            },
            "content": {
              "urdu": [
                "قبر میں انسان کا قیمتی کفن نہیں بلکہ اس کے نیک اعمال کام آتے ہیں۔",
                "قرآن و حدیث میں تقویٰ کے لباس کو بہترین لباس قرار دیا گیا ہے۔",
                "ظاہری کفن کی قیمت سے زیادہ باطنی ایمان کی قیمت اللہ کے ہاں معتبر ہے۔"
              ],
              "english": [
                "In the grave, it is not an expensive shroud but righteous deeds that benefit a person.",
                "In the Quran and Hadith, the garment of Taqwa is declared the best of all garments.",
                "The value of inner faith is more credible with Allah than the cost of the outer shroud."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و سماجی پہلو",
        "english": "Juristic and Social Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رسم و رواج کی تردید",
              "english": "Refuting Social Customs"
            },
            "content": {
              "urdu": [
                "بہت سے معاشروں میں مہنگا کفن خاندانی وقار کی علامت سمجھا جاتا ہے، جو کہ غلط ہے۔",
                "یہ حدیث ایسے سماجی بوجھ کو ختم کر کے غریب اور امیر کے درمیان فرق مٹاتی ہے۔",
                "اسلامی تدفین میں سادگی معاشرے کے کمزور طبقات کے لیے آسانی پیدا کرتی ہے۔"
              ],
              "english": [
                "In many societies, an expensive shroud is a status symbol, which is incorrect.",
                "This Hadith eliminates such social burdens and erases the gap between rich and poor.",
                "Simplicity in Islamic burial rites creates ease for the weaker sections of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ صحابہ کا نمونہ",
              "english": "The Example of the Sahaba"
            },
            "content": {
              "urdu": [
                "جلیل القدر صحابہ کرام نے بھی سادہ اور معمولی کپڑوں میں تدفین کی وصیت فرمائی تھی۔",
                "سیدنا ابوبکر صدیق رض نے فرمایا تھا کہ 'زندہ کو نئے کپڑے کی مردے سے زیادہ ضرورت ہے'۔",
                "صحابہ کرام کے عمل سے ثابت ہے کہ اصل اہمیت سنت کی پیروی کو حاصل ہے۔"
              ],
              "english": [
                "Great Sahaba requested to be buried in simple and ordinary clothes.",
                "Abu Bakr (RA) said, 'The living have more right to new clothes than the dead.'",
                "The practice of the Sahaba proves that the real importance lies in following the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کفن کی خریداری میں احتیاط",
              "english": "Caution in Buying a Shroud"
            },
            "content": {
              "urdu": [
                "کفن کے لیے سفید سوتی کپڑا استعمال کرنا سنت ہے جو نہ بہت قیمتی ہو نہ بہت گھٹیا۔",
                "ورثاء کو چاہیے کہ وہ جذبات میں آ کر میت کے مال کو فضول کاموں میں ضائع نہ کریں۔",
                "میت کے لیے بہترین تحفہ قیمتی کفن نہیں بلکہ صدقہ و خیرات اور دعائے مغفرت ہے۔"
              ],
              "english": [
                "Using white cotton for the shroud is Sunnah—it should be neither too costly nor too poor.",
                "Heirs should not let emotions lead them to waste the deceased's wealth on vanity.",
                "The best gift for the dead is not a costly shroud but charity and prayers for forgiveness."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث کی سند اور عمل",
              "english": "Hadith Chain and Implementation"
            },
            "content": {
              "urdu": [
                "اگرچہ اس حدیث کی سند ضعیف ہے، لیکن اس کا مضمون قرآن و سنت کے عمومی قواعد کے مطابق ہے۔",
                "فقہاء کے نزدیک کفن میں غلو کرنا 'مکروہ' یا ناپسندیدہ عمل شمار ہوتا ہے۔",
                "دین میں سادگی اختیار کرنا ہی ہر مسلمان کے لیے دنیا و آخرت میں عافیت کا باعث ہے۔"
              ],
              "english": [
                "Although this specific chain is weak, its content aligns with general Quranic/Sunnah rules.",
                "According to jurists, going to extremes in the shroud is considered 'Makruh' (disliked).",
                "Adopting simplicity in religion brings well-being in this world and the hereafter for every Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}