{
  "hadithId": 743,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:4836"
    ],
    "kitabId": 7,
    "inKitabBab": 9,
    "arabicBook": "كتاب البيوع",
    "babId": 50
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أحمد (3/425)، وأبو داود (4836)، وابن ماجه (2287). وصححه الحاكم والذهبي. والسائب هذا هو والد يزيد بن السائب.",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے امام احمد، ابوداؤد اور ابن ماجہ نے روایت کیا ہے۔ امام حاکم اور ذہبی نے اسے صحیح قرار دیا ہے۔ یہ روایت نبی ﷺ کی بعثت سے قبل کی شراکت داری پر دلالت کرتی ہے۔",
    "english": "Hasan. Reported by Ahmad (3/425), Abu Dawud (4836), and Ibn Majah (2287). It was authenticated by Al-Hakim and Adh-Dhahabi."
  },
  "importantWords": [
    {
      "arabic": "شَرِيكَ",
      "english": "Partner",
      "urdu": "شریک / حصہ دار"
    },
    {
      "arabic": "الْبَعْثَةِ",
      "english": "The Mission / Prophet-hood",
      "urdu": "بعثت / نبوت"
    },
    {
      "arabic": "مَرْحَباً",
      "english": "Welcome",
      "urdu": "خوش آمدید"
    },
    {
      "arabic": "أَخِي",
      "english": "My brother",
      "urdu": "میرے بھائی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے اسلام میں شراکت داری (Partnership) کا جواز ثابت ہوتا ہے اور نبی کریم ﷺ کے حسنِ معاملہ اور قدیم دوستوں کے ساتھ وفا کا ثبوت ملتا ہے۔",
    "english": "This Hadith establishes the validity of business partnerships in Islam and highlights the Prophet's (PBUH) excellence in dealings and loyalty to old associates."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4836)",
      "english": "Sunan Abi Dawud (4836)"
    },
    {
      "arabic": "سنن ابن ماجه (2287)",
      "english": "Sunan Ibn Majah (2287)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "السائب بن أبي السائب المخزومي",
        "english": "As-Sa'ib bin Abi As-Sa'ib al-Makhzumi"
      },
      "slug": "as-saib-al-makhzumi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "شراکت داری کا شرعی جواز",
        "english": "Legal Validity of Partnership"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیع و شراکت کی بنیاد",
              "english": "Foundation of Trade and Partnership"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا کسی کو 'میرا شریک' کہنا اس بات کی دلیل ہے کہ شراکت داری ایک جائز اور بابرکت عمل ہے۔",
                "اسلام نے ان تمام تجارتی صورتوں کو برقرار رکھا جو عدل و انصاف پر مبنی تھیں۔",
                "شراکت داری معاشی ترقی اور وسائل کو اکٹھا کرنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet's reference to someone as 'my partner' confirms that business partnership is a valid and blessed practice.",
                "Islam retained all pre-Islamic trade forms that were based on justice and fairness.",
                "Partnership is an excellent means for economic growth and pooling resources."
              ]
            }
          },
          {
            "title": {
              "urdu": "تجارت میں دیانت داری",
              "english": "Integrity in Business"
            },
            "content": {
              "urdu": [
                "سائب رضی اللہ عنہ نے نبی ﷺ کے بارے میں گواہی دی کہ آپ ﷺ ایک بہترین شریک تھے جو نہ جھگڑتے تھے اور نہ ٹال مٹول کرتے تھے۔",
                "کامیاب شراکت داری کی بنیاد باہمی اعتماد اور سچائی پر ہوتی ہے۔",
                "نبی ﷺ نے فرمایا کہ اللہ دو شریکوں کے ساتھ تیسرا ہوتا ہے جب تک وہ ایک دوسرے سے خیانت نہ کریں۔"
              ],
              "english": [
                "As-Sa'ib testified that the Prophet (PBUH) was the best partner, who neither disputed nor procrastinated.",
                "A successful partnership is built on mutual trust and honesty.",
                "The Prophet (PBUH) stated that Allah is the third partner to two as long as they do not betray each other."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کا اخلاق اور وفا",
        "english": "Prophetic Character and Loyalty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قدیم تعلقات کی پاسداری",
              "english": "Maintaining Old Relations"
            },
            "content": {
              "urdu": [
                "فتح مکہ کے موقع پر جب نبی ﷺ ایک فاتح کی حیثیت سے داخل ہوئے، تب بھی اپنے پرانے ساتھیوں کو نہیں بھولے۔",
                "خوش آمدید کہنا اور 'بھائی' کے لقب سے پکارنا آپ ﷺ کی عاجزی اور محبت کو ظاہر کرتا ہے۔",
                "ایک مومن کو چاہیے کہ وہ دنیاوی عہدہ ملنے کے بعد اپنے پرانے مخلص دوستوں کو نظر انداز نہ کرے۔"
              ],
              "english": [
                "Even as a conqueror entering Makkah, the Prophet (PBUH) did not forget his old associates.",
                "Welcoming him and calling him 'brother' demonstrates the Prophet's (PBUH) humility and affection.",
                "A believer should not ignore old sincere friends after gaining worldly status or authority."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ معاملہ",
              "english": "Excellence in Dealings"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نبوت سے پہلے بھی 'صادق' اور 'امین' کے لقب سے مشہور تھے۔",
                "تجارتی شراکت میں حساب کتاب کی صفائی اور وقت کی پابندی آپ ﷺ کا خاصہ تھا۔",
                "معاملات کی درستی ہی وہ چیز ہے جو لوگوں کے دلوں میں اسلام کی محبت پیدا کرتی ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) was known as 'As-Sadiq' and 'Al-Amin' even before his mission.",
                "Clarity in accounts and punctuality were hallmarks of his business dealings.",
                "Correctness in dealings is what inspires love for Islam in people's hearts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی نکات",
        "english": "Juristic and Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شراکت کی اقسام",
              "english": "Types of Partnership"
            },
            "content": {
              "urdu": [
                "فقہاء نے اس حدیث سے 'شرکۃ العنان' (مال اور کام کی شراکت) کے جواز پر استدلال کیا ہے۔",
                "شراکت داری میں نفع اور نقصان کی تقسیم پہلے سے طے شدہ تناسب کے مطابق ہونی چاہیے۔",
                "معاہدے کو لکھ لینا مستقبل کے تنازعات سے بچنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "Jurists use this Hadith to justify 'Shirkat al-Inan' (partnership in capital and labor).",
                "Distribution of profit and loss in a partnership must follow pre-agreed proportions.",
                "Documenting the agreement is essential to avoid future disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعلیٰ ظرفی کا سبق",
              "english": "Lesson in Magnanimity"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے جس طرح اپنے شریک کا استقبال کیا، وہ ہمیں سکھاتا ہے کہ تاجروں کو ایک دوسرے کا احترام کرنا چاہیے۔",
                "تجارت کو صرف نفع کا مقابلہ نہیں بلکہ باہمی تعاون کا ذریعہ بنانا چاہیے۔",
                "اچھے اخلاق ہی اصل سرمایہ ہیں۔"
              ],
              "english": [
                "The way the Prophet (PBUH) welcomed his partner teaches us that merchants should respect each other.",
                "Trade should be seen as a means of cooperation, not just a competition for profit.",
                "Good character is the true capital."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ کلام",
        "english": "Conclusion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاصلِ مطالعہ",
              "english": "Key Takeaway"
            },
            "content": {
              "urdu": [
                "اسلامی معیشت میں شراکت داری ایک مستحسن عمل ہے جو نبی ﷺ کی سنت سے ثابت ہے۔",
                "دیانت داری اور خوش اخلاقی تجارت میں برکت کا باعث بنتی ہے۔",
                "نبی کریم ﷺ کی زندگی کا ہر گوشہ ہمارے لیے مشعلِ راہ ہے۔"
              ],
              "english": [
                "Partnership is a commendable practice in Islamic economics, proven by the Prophet's Sunnah.",
                "Integrity and good manners bring blessings to business.",
                "Every aspect of the Prophet's (PBUH) life serves as a guiding light for us."
              ]
            }
          }
        ]
      }
    }
  ]
}