{
  "hadithId": 1240,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/5"],
    "kitabId": 16,
    "inKitabBab": 1,
    "arabicBook": "الجامع - باب الأدب",
    "babId": 102
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6270)، ومسلم (2177).",
    "urdu": "صحیح۔ اسے امام بخاری (6270) اور امام مسلم (2177) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6270) and Muslim (2177)."
  },
  "importantWords": [
    {
      "arabic": "لَا يُقِيمُ",
      "english": "Do not make get up",
      "urdu": "نہ اٹھائے"
    },
    {
      "arabic": "مَجْلِسِهِ",
      "english": "His seat / place",
      "urdu": "اس کی جگہ / مجلس"
    },
    {
      "arabic": "تَفَسَّحُوا",
      "english": "Make room",
      "urdu": "جگہ دو / کشادہ ہو جاؤ"
    },
    {
      "arabic": "تَوَسَّعُوا",
      "english": "Spread out",
      "urdu": "کھل جاؤ"
    },
    {
      "arabic": "الرَّجُلُ",
      "english": "The man",
      "urdu": "آدمی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سماجی آداب اور دوسروں کے حقوق کے احترام کی تعلیم دیتی ہے کہ کسی کی جگہ پر قبضہ نہ کیا جائے بلکہ مل جل کر جگہ بنائی جائے۔",
    "english": "This Hadith teaches social etiquette and respect for others' rights, prohibiting seizing someone's seat and encouraging sharing space."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الاستئذان، رقم 6270",
      "english": "Sahih al-Bukhari, Book of Asking Permission, No. 6270"
    },
    {
      "arabic": "صحيح مسلم، كتاب السلام، رقم 2177",
      "english": "Sahih Muslim, Book of Greetings, No. 2177"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah ibn Umar ibn al-Khattab"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-C8O-8h_v8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مجلس کے آداب اور احترام",
        "english": "Etiquettes and Respect of Gatherings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جگہ پر حقِ اولیت",
              "english": "Right of Priority to a Seat"
            },
            "content": {
              "urdu": [
                "جو شخص مجلس میں پہلے آکر کہیں بیٹھ جائے، وہ اس جگہ کا زیادہ حقدار ہوتا ہے۔",
                "کسی کو زبردستی اٹھا کر اس کی جگہ لینا اخلاقی گراوٹ اور تکبر کی نشانی ہے۔",
                "اسلام ہر فرد کے ذاتی حق اور سکون کا احترام کرنے کی سختی سے تعلیم دیتا ہے۔"
              ],
              "english": [
                "The person who arrives first and takes a seat has the primary right to that spot.",
                "Forcing someone to get up to take their place is a sign of moral decay and arrogance.",
                "Islam strictly commands respecting the individual rights and comfort of every person."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایثار اور ہمدردی",
              "english": "Altruism and Compassion"
            },
            "content": {
              "urdu": [
                "دوسروں کے لیے جگہ بنانا ایثار کا مظاہرہ ہے جس سے آپسی محبت بڑھتی ہے۔",
                "حدیث میں 'تفسحوا' کا حکم قرآن کی اس آیت کے مطابق ہے جو مجلس میں وسعت کا کہتی ہے۔",
                "جب لوگ ایک دوسرے کو جگہ دیتے ہیں تو اللہ ان کے معاملات میں وسعت پیدا فرماتا ہے۔"
              ],
              "english": [
                "Making room for others is a display of altruism that increases mutual affection.",
                "The command 'make room' aligns with the Quranic verse advising to spread out in assemblies.",
                "When people accommodate one another, Allah creates ease and expansion in their affairs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تکبر کا خاتمہ اور مساوات",
        "english": "Eliminating Arrogance and Promoting Equality"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرتبے کا ناجائز استعمال",
              "english": "Misuse of Social Status"
            },
            "content": {
              "urdu": [
                "دنیاوی عہدے یا مال کی وجہ سے کسی کو اس کی جگہ سے اٹھانا شرعاً ناپسندیدہ ہے۔",
                "مجلس میں سب برابر ہیں اور تقویٰ کے سوا کسی کو کسی پر فوقیت حاصل نہیں ہے۔",
                "یہ اصول معاشرے سے وی آئی پی کلچر اور طبقاتی اونچ نیچ کو ختم کرتا ہے۔"
              ],
              "english": [
                "Moving someone from their place due to worldly rank or wealth is religiously disliked.",
                "Everyone is equal in a gathering, and no one has superiority except through piety.",
                "This principle eradicates 'VIP culture' and class hierarchies within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشگوار معاشرت",
              "english": "Pleasant Social Interaction"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرت کی بنیاد دوسروں کو تکلیف پہنچائے بغیر زندگی گزارنے پر ہے۔",
                "اگر کوئی اپنی مرضی سے جگہ چھوڑ دے تو الگ بات ہے، مگر مجبور کرنا منع ہے۔",
                "ایسے چھوٹے آداب ہی ایک مہذب اور بااخلاق معاشرے کی تشکیل کرتے ہیں۔"
              ],
              "english": [
                "Islamic social life is based on living without causing distress to others.",
                "It is different if someone voluntarily vacates their seat, but compulsion is forbidden.",
                "Such minor etiquettes are what constitute a civilized and moral society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور استثناء",
        "english": "Juristic Rulings and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "واپسی پر حقِ جگہ",
              "english": "Right to the Seat Upon Return"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص عارضی ضرورت سے اپنی جگہ سے اٹھے، تو واپسی پر وہی حقدار ہے۔",
                "دوسری روایات کے مطابق ایسی صورت میں کسی اور کو وہاں نہیں بیٹھنا چاہیے۔",
                "یہ قاعدہ مساجد، تعلیمی اداروں اور عوامی اجتماعات میں نظم و ضبط برقرار رکھتا ہے۔"
              ],
              "english": [
                "If someone leaves their seat for a temporary need, they retain the right to it upon return.",
                "According to other narrations, no one else should occupy that spot in such a case.",
                "This rule maintains discipline in mosques, educational institutions, and public gatherings."
              ]
            }
          },
          {
            "title": {
              "urdu": "کشادہ دلی کی برکت",
              "english": "Blessings of Open-heartedness"
            },
            "content": {
              "urdu": [
                "تنگ جگہ میں سمٹ کر بیٹھنا تاکہ نیا آنے والا سما سکے، بڑی نیکی ہے۔",
                "یہ عمل آنے والے مہمان کی عزت افزائی اور اس کی ضرورت کا احساس دلاتا ہے۔",
                "جو دوسروں کے لیے دل اور جگہ کشادہ کرتا ہے، اللہ اس کے لیے جنت کشادہ کرتا ہے۔"
              ],
              "english": [
                "Squeezing together in a tight space to accommodate a newcomer is a great virtue.",
                "This act honors the incoming guest and shows sensitivity toward their needs.",
                "Whoever opens their heart and space for others, Allah expands Paradise for them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں نفاذ",
        "english": "Implementation in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عوامی مقامات کے آداب",
              "english": "Etiquettes of Public Places"
            },
            "content": {
              "urdu": [
                "یہ حکم بسوں، ٹرینوں اور ہسپتالوں کے انتظار گاہوں پر بھی لاگو ہوتا ہے۔",
                "کسی کمزور یا بوڑھے کو اٹھا کر جگہ چھیننا بدترین اخلاقی جرم ہے۔",
                "ہمیں ہر جگہ دوسروں کی موجودگی کا احساس کرتے ہوئے جگہ دینی چاہیے۔"
              ],
              "english": [
                "This command also applies to buses, trains, and hospital waiting areas.",
                "Forcing a weak or elderly person out of their seat is a severe moral offense.",
                "We must remain mindful of others' presence and offer space wherever possible."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا اسوہ",
              "english": "The Prophet's (ﷺ) Example"
            },
            "content": {
              "urdu": [
                "نبی ﷺ اپنی مجالس میں کبھی ممتاز ہو کر نہیں بیٹھتے تھے بلکہ جہاں جگہ ملتی وہیں تشریف رکھتے۔",
                "آپ ﷺ نے صحابہ کو سکھایا کہ مجلس کا حسن کرسیوں میں نہیں بلکہ دلوں کی وسعت میں ہے۔",
                "سنت کی پیروی ہمیں ایک بہترین اور دوسروں کا خیال رکھنے والا انسان بناتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) never sought a prominent seat but sat wherever space was available.",
                "He taught the Companions that the beauty of a gathering lies in the heart, not the chair.",
                "Following the Sunnah transforms us into better, more considerate human beings."
              ]
            }
          }
        ]
      }
    }
  ]
}