{
  "hadithId": 1062,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/10/89"],
    "kitabId": 10,
    "inKitabBab": 3,
    "arabicBook": "كتاب الحدود",
    "babId": 86
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (26639)، وأبو داود (4394)، والنسائي (4891)، وابن ماجه (2595)، وابن الجارود (828)، والحاكم (4/380) وصححه، والترمذي لم يروه.",
    "urdu": "صحیح۔ اسے احمد (26639)، ابوداؤد (4394)، نسائی (4891)، اور ابن ماجہ (2595) نے روایت کیا ہے۔ ابن جارود اور حاکم نے اسے صحیح قرار دیا ہے۔ ترمذی نے اسے روایت نہیں کیا۔",
    "english": "Sahih. Reported by Ahmad (26639), Abu Dawud (4394), An-Nasa'i (4891), and Ibn Majah (2595). Graded Sahih by Ibn al-Jarud and al-Hakim. Note: Al-Tirmidhi did not record it."
  },
  "importantWords": [
    {
      "arabic": "رِدَاءَهُ",
      "english": "His cloak",
      "urdu": "اس کی چادر"
    },
    {
      "arabic": "فَشَفَعَ",
      "english": "Interceded",
      "urdu": "سفارش کی"
    },
    {
      "arabic": "هَلَّا كَانَ",
      "english": "Why was it not",
      "urdu": "کیوں نہ ہوا"
    },
    {
      "arabic": "قَبْلِ",
      "english": "Before",
      "urdu": "پہلے"
    },
    {
      "arabic": "بِقَطْعِ",
      "english": "Cutting off",
      "urdu": "کاٹنا (ہاتھ)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ جب کوئی معاملہ حاکم تک پہنچ جائے تو حد ساقط نہیں ہوتی، لیکن لانے سے پہلے معاف کرنا جائز ہے۔",
    "english": "This Hadith clarifies that once a case reaches the ruler, the legal penalty (Hadd) cannot be waived, though forgiveness is encouraged before reporting it."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (4394)",
      "english": "Narrated by Abu Dawud (4394)"
    },
    {
      "arabic": "رواه النسائي (4891)",
      "english": "Narrated by An-Nasa'i (4891)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "صفوان بن أمية",
        "english": "Safwan bin Umayyah"
      },
      "slug": "safwan-bin-umayyah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9U0O7zE73U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سفارش اور حدود کا قانون",
        "english": "Intercession and Legal Penalties"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاکم تک معاملہ پہنچنا",
              "english": "Reporting to the Ruler"
            },
            "content": {
              "urdu": [
                "جب چوری کا معاملہ اسلامی عدالت یا حاکم کے سامنے ثابت ہو جائے تو سزا لازمی ہو جاتی ہے۔",
                "ایسی صورت میں کسی بھی قسم کی سفارش یا معافی قانونی طور پر اثر انداز نہیں ہوتی۔",
                "نبی ﷺ نے واضح کیا کہ حاکم کے پاس لانے کے بعد قانون اپنا راستہ خود بنائے گا۔"
              ],
              "english": [
                "Once a theft case is proven before an Islamic court or ruler, the penalty becomes mandatory.",
                "In such instances, any form of intercession or pardon has no legal standing.",
                "The Prophet (ﷺ) clarified that once brought to the ruler, the law must take its course."
              ]
            }
          },
          {
            "title": {
              "urdu": "سفارش کی ممانعت",
              "english": "Prohibition of Intercession"
            },
            "content": {
              "urdu": [
                "اللہ کی مقرر کردہ حدود میں سفارش کرنا اللہ کے حکم کی خلاف ورزی سمجھا جاتا ہے۔",
                "حدود کا نفاذ معاشرے میں عدل و انصاف کی بقا کے لیے ناگزیر ہے۔",
                "سفارش صرف ان معاملات میں ہو سکتی ہے جو ابھی عدالت تک نہ پہنچے ہوں۔"
              ],
              "english": [
                "Interceding in the penalties prescribed by Allah is considered a violation of His commands.",
                "Implementing 'Hudud' is essential for maintaining justice and order in society.",
                "Intercession is only permissible for matters that have not yet reached the court."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاف کرنے کی ترغیب",
        "english": "Encouragement for Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "درگزر کی فضیلت",
              "english": "Excellence of Forbearing"
            },
            "content": {
              "urdu": [
                "اسلام گناہ گار کی اصلاح کے لیے معافی اور درگزر کو پسند کرتا ہے۔",
                "اگر مظلوم حاکم کے پاس جانے سے پہلے چور کو معاف کر دے تو یہ ایک مستحسن عمل ہے۔",
                "آپ ﷺ نے حضرت صفوان کو اسی لیے پہلے معاف نہ کرنے پر توجہ دلائی۔"
              ],
              "english": [
                "Islam favors forgiveness and forbearance as a means to reform the sinner.",
                "It is a commendable act if the victim forgives the thief before reporting to the ruler.",
                "The Prophet (ﷺ) highlighted this by asking Safwan why he didn't forgive him earlier."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلاح کا موقع",
              "english": "Chance for Reformation"
            },
            "content": {
              "urdu": [
                "معاملہ عدالت نہ لے جانے کا مقصد مجرم کو توبہ اور اصلاح کا موقع فراہم کرنا ہے۔",
                "ذاتی معافی معاشرے میں نفرت کے خاتمے اور بھائی چارے کے فروغ کا باعث بنتی ہے۔",
                "لیکن اگر چور عادی مجرم ہو تو اسے قانون کے حوالے کرنا بہتر ہے۔"
              ],
              "english": [
                "Not reporting a case aims to provide the offender a chance for repentance and reform.",
                "Personal forgiveness helps eliminate hatred and promotes brotherhood in society.",
                "However, if the thief is a habitual criminal, handing them to the law is preferable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور نصاب",
        "english": "Juristic Issues and Threshold"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چوری شدہ مال کی قیمت",
              "english": "Value of Stolen Goods"
            },
            "content": {
              "urdu": [
                "اس حدیث سے معلوم ہوتا ہے کہ چادر کی قیمت چوری کے نصاب (تین درہم) سے زیادہ تھی۔",
                "تین درہم یا اس سے زیادہ مال کی چوری پر ہاتھ کاٹنے کی سزا لاگو ہوتی ہے۔",
                "مال کی مالیت کا تعین حد نافذ کرنے کے لیے ایک بنیادی شرط ہے۔"
              ],
              "english": [
                "This Hadith indicates that the cloak's value exceeded the theft threshold (Nisab).",
                "Amputation is applied for the theft of property worth three Dirhams or more.",
                "Determining the value of property is a primary condition for enforcing 'Hadd'."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد میں چوری",
              "english": "Theft in the Mosque"
            },
            "content": {
              "urdu": [
                "مسجد میں بھی اگر مال کسی کی حفاظت میں ہو تو وہاں سے چوری پر حد لگتی ہے۔",
                "حضرت صفوان چادر پر سر رکھ کر سو رہے تھے جو کہ ایک طرح کی حفاظت تھی۔",
                "یہ حدیث ثابت کرتی ہے کہ مساجد کا تقدس چوری کی سزا کو ختم نہیں کرتا۔"
              ],
              "english": [
                "Amputation applies even for theft in a mosque if the property was under protection.",
                "Safwan was sleeping using the cloak as a pillow, which constitutes a form of 'Hirz' (protection).",
                "This Hadith proves that the sanctity of mosques does not waive the penalty for theft."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی سبق",
        "english": "Social Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قانون کی بالادستی",
              "english": "Supremacy of the Law"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست میں قانون سب کے لیے برابر ہے اور اس میں کوئی سمجھوتہ نہیں ہوتا۔",
                "ایک بار حد ثابت ہونے کے بعد کوئی بڑے سے بڑا صحابی بھی اسے نہیں رکوا سکتا تھا۔",
                "یہی وہ عدل تھا جس نے اسلام کو پوری دنیا میں ایک مضبوط نظام کے طور پر پیش کیا۔"
              ],
              "english": [
                "In an Islamic state, the law is equal for everyone and admits no compromises.",
                "Once a penalty was proven, even the most prominent companion could not stop it.",
                "This very justice established Islam as a robust system across the world."
              ]
            }
          },
          {
            "title": {
              "urdu": "رحمت اور حد کا امتزاج",
              "english": "Combination of Mercy and Penalty"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی رحمت اس بات میں تھی کہ آپ نے پہلے معاف کر دینے کی ترغیب دی۔",
                "لیکن اللہ کا قانون نافذ کرنا بھی آپ ﷺ کی منصبی ذمہ داری تھی۔",
                "اسلام ہمیں جرم سے نفرت اور مجرم کے ساتھ انسانی ہمدردی کا متوازن درس دیتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) mercy was evident in encouraging forgiveness beforehand.",
                "However, enforcing Allah's law was also his prophetic and official responsibility.",
                "Islam teaches a balance of hating the crime while maintaining empathy for the offender."
              ]
            }
          }
        ]
      }
    }
  ]
}