{
  "hadithId": 1041,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/10/8"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },

  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1696).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم نے اسے اپنی صحیح میں روایت کیا ہے۔ یہ واقعہ غامدیہ نامی عورت کے واقعے سے ملتا جلتا ہے جو توبہ اور حد کے نفاذ کی عظیم مثال ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (1696). This event, along with the story of the woman from Ghamid, serves as a primary source for the rulings of stoning and the merit of sincere repentance."
  },
  "importantWords": [
    {
      "arabic": "حُبْلَى",
      "english": "Pregnant",
      "urdu": "حاملہ"
    },
    {
      "arabic": "أَحْسِنْ إِلَيْهَا",
      "english": "Treat her well",
      "urdu": "اس کے ساتھ بھلائی کرو"
    },
    {
      "arabic": "فَشُكَّتْ",
      "english": "Tied tightly",
      "urdu": "مضبوطی سے باندھ دیے گئے"
    },
    {
      "arabic": "رُجِمَتْ",
      "english": "Stoned to death",
      "urdu": "سنگسار کر دی گئی"
    },
    {
      "arabic": "جَادَتْ",
      "english": "Sacrificed / Offered",
      "urdu": "سخاوت کی / پیش کر دی"
    },
    {
      "arabic": "تَوْبَةً",
      "english": "Repentance",
      "urdu": "توبہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں حاملہ عورت پر حد کے نفاذ کے لیے بچے کی پیدائش تک تاخیر، مجرمہ کے ساتھ حسن سلوک کی ہدایت اور سچی توبہ کی عظیم فضیلت بیان کی گئی ہے۔",
    "english": "This Hadith highlights the postponement of legal penalties for pregnant women until delivery, the command to treat offenders kindly before punishment, and the immense value of sincere repentance."
  },
  "references": [
    {
      "arabic": "رواه مسلم (1696)",
      "english": "Reported by Muslim (1696)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمران بن حصين",
        "english": "Imran bin Husain"
      },
      "slug": "imran-bin-husain"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=1oD0Wv1pAuo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حاملہ پر حد کا نفاذ",
        "english": "Penalty on a Pregnant Woman"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیدائش تک تاخیر",
              "english": "Delay Until Delivery"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں حاملہ عورت پر حد تب تک نافذ نہیں کی جاتی جب تک بچہ پیدا نہ ہو جائے۔",
                "نبی کریم ﷺ نے اس کے ولی کو حکم دیا کہ وضع حمل تک اس کی دیکھ بھال کرے۔",
                "بچے کی جان معصوم ہے، اس لیے ماں کے جرم کی وجہ سے بچے کو نقصان نہیں پہنچایا جا سکتا۔"
              ],
              "english": [
                "Under Islamic law, a pregnant woman's penalty is postponed until she gives birth.",
                "The Prophet (ﷺ) ordered her guardian to care for her until the delivery of the child.",
                "The child's life is innocent, and it cannot be harmed due to the mother's crime."
              ]
            }
          },
          {
            "title": {
              "urdu": "مجرم کے ساتھ انسانی سلوک",
              "english": "Humanitarian Treatment of Offenders"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے ولی کو حکم دیا کہ اس عورت کے ساتھ 'حسنِ سلوک' کیا جائے۔",
                "جرم ثابت ہونے کے بعد بھی مجرم کی بنیادی انسانی ضروریات اور عزت کا خیال رکھنا ضروری ہے۔",
                "اسلام کا عدل نفرت پر نہیں بلکہ اصلاح اور اللہ کے حکم کی پابندی پر مبنی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) explicitly commanded the guardian to treat the woman with 'Ihsan'.",
                "Even after a crime is proven, an offender's basic human needs and dignity must be respected.",
                "Islamic justice is based on reform and divine law, not on personal hatred."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توبہ کی قبولیت اور فضیلت",
        "english": "Acceptance and Virtue of Repentance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ستر آدمیوں پر بھاری توبہ",
              "english": "Repentance Sufficing for Seventy"
            },
            "content": {
              "urdu": [
                "اس خاتون نے اپنی جان اللہ کے سپرد کر کے سچی توبہ کا اعلیٰ ترین نمونہ پیش کیا۔",
                "نبی ﷺ نے فرمایا کہ اس کی توبہ اتنی وزنی ہے کہ پورے شہر کے لیے کافی ہو سکتی ہے۔",
                "سچی توبہ پچھلے تمام گناہوں کو دھو ڈالتی ہے اور انسان کو پاک کر دیتی ہے۔"
              ],
              "english": [
                "This woman presented the highest form of repentance by surrendering her life to Allah.",
                "The Prophet (ﷺ) stated her repentance was so heavy it could suffice for the whole city.",
                "Sincere repentance washes away all previous sins and purifies the individual."
              ]
            }
          },
          {
            "title": {
              "urdu": "حد کا مقصد پاکیزگی",
              "english": "Goal of Had is Purification"
            },
            "content": {
              "urdu": [
                "دنیا میں حد کے نفاذ کا مقصد مجرم کو آخرت کے عذاب سے بچانا اور پاک کرنا ہے۔",
                "اسی لیے نبی کریم ﷺ نے اس عورت کی نمازِ جنازہ خود پڑھائی۔",
                "سزا پانے کے بعد وہ عورت اللہ کے ہاں ایک برگزیدہ اور پاک مقام پا چکی تھی۔"
              ],
              "english": [
                "The purpose of applying Hudud is to purify the offender from the punishment of the Hereafter.",
                "This is why the Prophet (ﷺ) personally led the funeral prayer for her.",
                "After receiving the penalty, she attained a noble and purified status before Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ستر پوشی اور پردہ",
        "english": "Concealment and Modesty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کپڑوں کو باندھنے کی حکمت",
              "english": "Wisdom in Tying the Clothes"
            },
            "content": {
              "urdu": [
                "رجم کے دوران عورت کے کپڑے مضبوطی سے باندھے گئے تاکہ بے پردگی نہ ہو۔",
                "اسلام نے سزا کے سخت ترین مرحلے میں بھی عورت کے ستر اور حیا کا خیال رکھا ہے۔",
                "یہ حکم قاضی اور انتظامیہ کے لیے ہے کہ وہ مجرم کی حرمت کو پامال نہ ہونے دیں۔"
              ],
              "english": [
                "During stoning, her clothes were tied tightly to prevent any exposure of her body.",
                "Islam maintains the modesty of a woman even during the execution of severe penalties.",
                "This is a directive for authorities to ensure the sanctity of the individual is protected."
              ]
            }
          },
          {
            "title": {
              "urdu": "نمازِ جنازہ کا حق",
              "english": "Right to Funeral Prayer"
            },
            "content": {
              "urdu": [
                "حد کے نتیجے میں مرنے والا مسلمان ہی رہتا ہے اور وہ نمازِ جنازہ کا مستحق ہے۔",
                "حضرت عمر کا سوال ایک طالب علم کے طور پر تھا جس کی آپ ﷺ نے وضاحت فرمائی۔",
                "کسی گناہ کی وجہ سے مسلمان کو دائرہِ اسلام سے خارج نہیں کیا جا سکتا۔"
              ],
              "english": [
                "One who dies due to a legal penalty remains a Muslim and is entitled to a funeral prayer.",
                "Umar's (RA) question was for learning, and the Prophet (ﷺ) provided the clarification.",
                "A Muslim cannot be excluded from the fold of Islam solely due to a major sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و اخلاقی اسباق",
        "english": "Practical and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ خدا کا غلبہ",
              "english": "Prevalence of Fear of Allah"
            },
            "content": {
              "urdu": [
                "اس خاتون کا خود کو سزا کے لیے پیش کرنا اس کے دل میں موجود شدید خوفِ خدا کی علامت ہے۔",
                "ایمان ہمیں دنیاوی نقصان پر آخرت کی کامیابی کو ترجیح دینا سکھاتا ہے۔",
                "جب معاشرے میں تقویٰ عام ہو جائے تو قوانین کا نفاذ آسان ہو جاتا ہے۔"
              ],
              "english": [
                "The woman's self-surrender is a sign of the profound fear of Allah in her heart.",
                "Faith teaches us to prioritize success in the Hereafter over any worldly loss.",
                "When piety becomes common in society, the implementation of laws becomes voluntary."
              ]
            }
          },
          {
            "title": {
              "urdu": "امید اور رحمت",
              "english": "Hope and Mercy"
            },
            "content": {
              "urdu": [
                "یہ حدیث گناہگاروں کے لیے امید کا پیغام ہے کہ توبہ کا دروازہ ہمیشہ کھلا ہے۔",
                "اللہ تعالیٰ کی رحمت اس کے غضب پر غالب ہے، بشرطیکہ توبہ سچی ہو۔",
                "ہمیں دوسروں کی توبہ کو قدر کی نگاہ سے دیکھنا چاہیے نہ کہ انہیں حقیر سمجھنا چاہیے۔"
              ],
              "english": [
                "This Hadith is a message of hope for sinners that the door of repentance is always open.",
                "Allah's mercy prevails over His wrath, provided the repentance is sincere.",
                "We must value the repentance of others rather than looking down upon them."
              ]
            }
          }
        ]
      }
    }
  ]
}