{
  "hadithId": 508,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/508"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (660)، ومسلم (1031). والسياق للبخاري، ومعناه الحث على الإخلاص في الصدقة.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (660) اور امام مسلم (1031) نے روایت کیا ہے۔ اس میں اخلاص کے ساتھ صدقہ کرنے کی ترغیب دی گئی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (660) and Muslim (1031). It emphasizes sincerity and secrecy in acts of charity."
  },
  "importantWords": [
    {
      "arabic": "يُظِلُّهُمُ",
      "english": "Will shade them",
      "urdu": "انہیں سایہ دے گا"
    },
    {
      "arabic": "ظِلِّهِ",
      "english": "His Shade",
      "urdu": "اس کا سایہ"
    },
    {
      "arabic": "أَخْفَاهَا",
      "english": "He hid it",
      "urdu": "اس نے اسے چھپایا"
    },
    {
      "arabic": "شِمَالُهُ",
      "english": "His left hand",
      "urdu": "اس کا بایاں ہاتھ"
    },
    {
      "arabic": "يَمِينُهُ",
      "english": "His right hand",
      "urdu": "اس کا دایاں ہاتھ"
    },
    {
      "arabic": "تَصَدَّقَ",
      "english": "Gave charity",
      "urdu": "صدقہ کیا"
    }
  ],
  "summary": {
    "urdu": "قیامت کی تپش میں اللہ تعالیٰ سات خوش نصیبوں کو اپنے عرش کا سایہ دے گا، جن میں سے ایک وہ شخص ہے جو کمالِ اخلاص کے ساتھ پوشیدہ طور پر اللہ کی راہ میں خرچ کرتا ہے۔",
    "english": "On Judgment Day, Allah will provide shade to seven types of people, including the one who gives charity so secretly that no one knows about it, showing ultimate sincerity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (660)",
      "english": "Sahih al-Bukhari (660)"
    },
    {
      "arabic": "صحيح مسلم (1031)",
      "english": "Sahih Muslim (1031)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة رضي الله عنه",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اخلاص کی اہمیت",
        "english": "Importance of Sincerity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ریا کاری سے بچنا",
              "english": "Avoiding Ostentation"
            },
            "content": {
              "urdu": [
                "چھپا کر صدقہ کرنا دکھاوے اور ریا کاری سے بچنے کا بہترین طریقہ ہے۔",
                "بائیں ہاتھ کو علم نہ ہونے کا مطلب انتہائی درجے کی پوشیدگی ہے۔",
                "یہ عمل اس بات کی دلیل ہے کہ صدقہ صرف اللہ کی رضا کے لیے ہے۔"
              ],
              "english": [
                "Giving charity secretly is the best way to avoid showing off.",
                "The phrase 'left hand not knowing' signifies extreme secrecy.",
                "This act proves that the charity is solely for the sake of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعمال کی قبولیت",
              "english": "Acceptance of Deeds"
            },
            "content": {
              "urdu": [
                "اللہ کے ہاں وہی عمل وزنی ہے جو صرف اس کی خوشنودی کے لیے ہو۔",
                "پوشیدہ صدقہ اللہ کے غصے کو ٹھنڈا کرنے کا ایک بڑا ذریعہ ہے۔",
                "خلوصِ نیت کے بغیر بڑے سے بڑا صدقہ بھی بے وزن ہو سکتا ہے۔"
              ],
              "english": [
                "In Allah's sight, only deeds done for His pleasure carry weight.",
                "Secret charity is a powerful means to extinguish Allah's wrath.",
                "Without sincerity, even the largest charity may become weightless."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کا سایہ",
        "english": "The Shade of Judgment Day"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کا خصوصی انعام",
              "english": "Allah's Special Reward"
            },
            "content": {
              "urdu": [
                "قیامت کے دن سورج قریب ہوگا اور تپش انتہائی زیادہ ہوگی۔",
                "ایسے میں اللہ کا سایہ ایک بہت بڑی نعمت اور تحفظ ہوگا۔",
                "یہ سایہ ان لوگوں کے لیے ہے جنہوں نے دنیا میں نفس پر قابو پایا۔"
              ],
              "english": [
                "On Judgment Day, the sun will be close and heat will be intense.",
                "In such conditions, Allah's shade will be a great blessing and protection.",
                "This shade is reserved for those who controlled their desires in the world."
              ]
            }
          },
          {
            "title": {
              "urdu": "محشر کی ہولناکی سے بچاؤ",
              "english": "Protection from the Horrors of Gathering"
            },
            "content": {
              "urdu": [
                "سایہ ملنا اس بات کی علامت ہے کہ اللہ اس بندے سے راضی ہے۔",
                "صدقہ کرنے والا محشر کے خوف سے پرسکون اور محفوظ رہے گا۔",
                "یہ انعام بندے کے خفیہ نیک اعمال کا صلہ ہے۔"
              ],
              "english": [
                "Receiving shade is a sign that Allah is pleased with the servant.",
                "The one who gives charity will remain calm and safe from fear.",
                "This reward is a return for the servant's hidden good deeds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی پہلو",
        "english": "Social Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غریب کی عزتِ نفس",
              "english": "Dignity of the Recipient"
            },
            "content": {
              "urdu": [
                "چھپا کر دینے سے لینے والے کی عزتِ نفس مجروح نہیں ہوتی۔",
                "اگر صدقہ سرِ عام دیا جائے تو غریب شرمندگی محسوس کر سکتا ہے۔",
                "اسلام غریبوں کی مالی مدد کے ساتھ ان کے وقار کا بھی محافظ ہے۔"
              ],
              "english": [
                "Giving secretly ensures the dignity of the recipient is not hurt.",
                "If charity is given publicly, the poor might feel embarrassed.",
                "Islam protects the dignity of the poor along with providing financial aid."
              ]
            }
          },
          {
            "title": {
              "urdu": "خیر کا خاموش فروغ",
              "english": "Silent Promotion of Good"
            },
            "content": {
              "urdu": [
                "خاموشی سے کی گئی نیکی معاشرے میں حسد کے جذبات کو ختم کرتی ہے۔",
                "یہ دوسروں کو دکھاوے کے بغیر نیکی کرنے کی ترغیب دیتی ہے۔",
                "خفیہ امداد سے معاشرے میں خاموش معاشی استحکام آتا ہے۔"
              ],
              "english": [
                "Good deeds done silently eliminate feelings of envy in society.",
                "It encourages others to do good without seeking fame.",
                "Secret aid brings silent economic stability to the community."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت",
        "english": "Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفس کی اصلاح",
              "english": "Self-Rectification"
            },
            "content": {
              "urdu": [
                "انسان کی فطرت ہے کہ وہ اپنی نیکیوں کا چرچا کرنا چاہتا ہے۔",
                "اس خواہش کو کچل کر خاموشی سے دینا نفس کی بڑی فتح ہے۔",
                "یہ طریقہ کار انسان کو 'مخلصین' کی صف میں شامل کر دیتا ہے۔"
              ],
              "english": [
                "It is human nature to want to talk about one's good deeds.",
                "Suppressing this desire and giving silently is a victory over the self.",
                "This method places a person in the ranks of the 'Sincere Ones'."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ جاریہ کی فکر",
              "english": "Concern for Perpetual Charity"
            },
            "content": {
              "urdu": [
                "ہمیں چاہیے کہ اپنی نیکیوں کو گناہوں کی طرح چھپائیں۔",
                "صرف واجب زکوٰۃ کا اظہار جائز ہے، نفلی صدقہ چھپانا ہی افضل ہے۔",
                "روزانہ کی بنیاد پر چھوٹا لیکن خفیہ عمل اللہ کو بہت پسند ہے۔"
              ],
              "english": [
                "We should strive to hide our good deeds just as we hide our sins.",
                "Publicizing mandatory Zakat is okay, but hiding voluntary charity is better.",
                "Small but secret daily acts are highly beloved to Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}