{
  "hadithId": 1134,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/55"],
    "kitabId": 11,
    "inKitabBab": 3,
    "arabicBook": "كتاب الجهاد - باب السبق والنضال",
    "babId": 91
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1917) في كتاب الإمارة، باب فضل الرمي والحث عليه. وأخرجه أبو داود (2514)، وابن ماجه (2813).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام مسلم نے اپنی صحیح (1917) میں روایت کیا ہے۔ یہ آیت سورہ انفال کی آیت نمبر 60 کا حصہ ہے۔",
    "english": "Sahih. Reported by Muslim (1917) in the Book of Leadership. Also reported by Abu Dawud (2514) and Ibn Majah (2813). This refers to Surah Al-Anfal, verse 60."
  },
  "importantWords": [
    {
      "arabic": "أَعِدُّوا",
      "english": "Prepare / Make ready",
      "urdu": "تیار کرو"
    },
    {
      "arabic": "قُوَّةٍ",
      "english": "Power / Strength",
      "urdu": "قوت"
    },
    {
      "arabic": "الرَّمْيُ",
      "english": "Archery / Throwing",
      "urdu": "تیر اندازی / نشانہ بازی"
    },
    {
      "arabic": "الْمِنْبَرِ",
      "english": "Pulpit",
      "urdu": "منبر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں قرآنی حکم 'قوت کی تیاری' کی تفسیر نشانہ بازی سے کی گئی ہے۔ اس کا مقصد مسلمانوں کو دفاعی مہارت حاصل کرنے اور دشمن پر دور سے ضرب لگانے کی صلاحیت پیدا کرنے کی ترغیب دینا ہے۔",
    "english": "This Hadith interprets the Quranic command to 'prepare power' as archery. It encourages Muslims to master long-range weaponry and defensive skills to deter enemies."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1917)",
      "english": "Sahih Muslim (1917)"
    },
    {
      "arabic": "سنن أبي داود (2514)",
      "english": "Sunan Abi Dawud (2514)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عقبة بن عامر الجهني",
        "english": "Uqbah bin Amir al-Juhani"
      },
      "slug": "uqbah-bin-amir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تفسیرِ نبوی اور دفاعی اہمیت",
        "english": "Prophetic Interpretation and Defense"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قوت سے کیا مراد ہے؟",
              "english": "What is meant by Power?"
            },
            "content": {
              "urdu": [
                "قرآن میں 'قوت' کا لفظ عام ہے، لیکن نبی ﷺ نے اس کی سب سے اہم شکل 'نشانہ بازی' کو قرار دیا۔",
                "تیر اندازی دشمن کو دور سے ہی پسپا کرنے کا بہترین ذریعہ ہے جس میں جانی نقصان کم ہوتا ہے۔",
                "تین بار دہرانا اس فن کی اہمیت اور اس پر توجہ دینے کی تاکید کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "While 'power' is a general term in the Quran, the Prophet (ﷺ) identified archery as its most vital form.",
                "Archery allows for repelling the enemy from a distance, minimizing direct casualties.",
                "The three-fold repetition emphasizes the extreme importance of mastering this skill."
              ]
            }
          },
          {
            "title": {
              "urdu": "دشمن پر رعب",
              "english": "Deterrence against Enemies"
            },
            "content": {
              "urdu": [
                "قوت کی تیاری کا مقصد صرف جنگ نہیں بلکہ دشمن کو حملے سے باز رکھنا بھی ہے۔",
                "جدید دور میں نشانہ بازی سے مراد ہر وہ ٹیکنالوجی ہے جو دور سے ہدف کو نشانہ بنا سکے (میزائل، آرٹلری)۔",
                "اسلام دفاعی خود انحصاری اور مضبوط فوجی نظام کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The purpose of preparing power is not just for war, but to deter enemies from attacking.",
                "In the modern era, 'throwing/archery' includes any technology that strikes from a distance (missiles, artillery).",
                "Islam encourages defensive self-reliance and a strong military infrastructure."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تیر اندازی کی فضیلت",
        "english": "Virtues of Archery"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنتِ نبوی اور کھیل",
              "english": "Sunnah and Sports"
            },
            "content": {
              "urdu": [
                "تیر اندازی ان چند کھیلوں میں سے ہے جسے نبی ﷺ نے 'لہو و لعب' (بے مقصد کھیل) سے مستثنیٰ قرار دیا۔",
                "نبی ﷺ خود صحابہ کو نشانہ بازی کی مشق کرتے دیکھ کر خوش ہوتے اور ان کی حوصلہ افزائی فرماتے۔",
                "اس فن کو سیکھنے کے بعد چھوڑ دینا یا بھول جانا سخت ناپسندیدہ عمل ہے۔"
              ],
              "english": [
                "Archery is one of the few sports exempted by the Prophet (ﷺ) from being considered a 'useless pastime'.",
                "The Prophet (ﷺ) took joy in watching Sahaba practice and would personally encourage them.",
                "Abandoning or forgetting this skill after learning it is highly discouraged in Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی اور ذہنی فوائد",
              "english": "Physical and Mental Benefits"
            },
            "content": {
              "urdu": [
                "اس سے توجہ مرکوز کرنے کی صلاحیت (Focus) اور صبر و تحمل پیدا ہوتا ہے۔",
                "یہ جسمانی توازن اور اعصابی مضبوطی کے لیے بہترین ورزش ہے۔",
                "ایک مومن کو جسمانی طور پر چست اور دفاع کے لیے ہمہ وقت تیار ہونا چاہیے۔"
              ],
              "english": [
                "It develops the ability to focus, along with patience and self-control.",
                "It is an excellent exercise for physical balance and neurological coordination.",
                "A believer must remain physically fit and always ready for defense."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عصری اطلاق (Modern Application)",
        "english": "Modern Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ٹیکنالوجی کا حصول",
              "english": "Acquisition of Technology"
            },
            "content": {
              "urdu": [
                "آج کے دور میں 'قوت' سے مراد ایٹمی طاقت، سائبر سکیورٹی اور جدید اسلحہ ہے۔",
                "مسلمانوں کو سائنس اور ٹیکنالوجی میں دنیا کا مقابلہ کرنے کے لیے تیار رہنا چاہیے۔",
                "علمِ حرب میں مہارت حاصل کرنا وقت کا تقاضا اور دینی فریضہ ہے۔"
              ],
              "english": [
                "In today's context, 'power' translates to nuclear capability, cyber security, and advanced weaponry.",
                "Muslims must be prepared to compete globally in science and technology.",
                "Mastering military sciences is a requirement of the time and a religious duty."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاستی ذمہ داری",
              "english": "State Responsibility"
            },
            "content": {
              "urdu": [
                "آیت کا خطاب حکمرانوں اور ریاست سے ہے کہ وہ دفاعی بجٹ اور وسائل فراہم کریں۔",
                "مضبوط دفاع ہی امنِ عالم کی ضمانت فراہم کرتا ہے۔",
                "امت کی عزت و وقار کا تحفظ مادی اسباب کی تیاری سے وابستہ ہے۔"
              ],
              "english": [
                "The Quranic verse addresses rulers and the state to provide defense budgets and resources.",
                "Strong defense is the ultimate guarantee for global and regional peace.",
                "Preserving the dignity of the Ummah is tied to the preparation of material means."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons for Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقصدیت کی اہمیت",
              "english": "Importance of Purpose"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو اپنی تفریحات کو بھی بامقصد بنانا چاہیے۔",
                "ایسے مشاغل اپنائیں جو آپ کی صحت اور دفاعی صلاحیت کو بہتر بنائیں۔",
                "وقت کا صحیح استعمال اور مہارتوں کا حصول کامیابی کی کنجی ہے۔"
              ],
              "english": [
                "Muslims should ensure even their recreational activities have a higher purpose.",
                "Adopt hobbies that improve your health and defensive capabilities.",
                "Correct use of time and acquisition of skills are the keys to success."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایمانی جذبہ",
              "english": "Spiritual Zeal"
            },
            "content": {
              "urdu": [
                "اللہ کی رضا کے لیے اپنی قوت بڑھانا عبادت ہے۔",
                "ایک مضبوط مومن اللہ کے نزدیک کمزور مومن سے زیادہ بہتر اور پسندیدہ ہے۔",
                "ہمیں ہر میدان میں برتری حاصل کرنے کی مخلصانہ کوشش کرنی چاہیے۔"
              ],
              "english": [
                "Increasing one's strength for the sake of Allah is a form of worship.",
                "A strong believer is better and more beloved to Allah than a weak believer.",
                "We must make sincere efforts to achieve excellence in every field."
              ]
            }
          }
        ]
      }
    }
  ]
}