{
  "hadithId": 796,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/796"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
 
  "takhreej": {
    "arabic": "رواه البزار (1937)، وهو وإن كان ضعيف المسند فهو أحد شواهد الحديث السابق. وله شاهد من حديث أبي هريرة عند الترمذي (2130) بلفظ: «تهادوا فإن الهدية تذهب وحر الصدر».",
    "urdu": "اسے امام بزار (1937) نے روایت کیا ہے۔ اگرچہ اس کی سند میں کچھ ضعف ہے، لیکن یہ پچھلی صحیح حدیث کا شاہد ہے اور امام ترمذی (2130) نے بھی اسے حضرت ابوہریرہ سے روایت کیا ہے جس میں 'سینے کی جلن' دور کرنے کے الفاظ ہیں۔",
    "english": "Reported by Al-Bazzar (1937). Although the chain is weak, it serves as a supporting evidence for the previous Hadith. At-Tirmidhi (2130) reported a similar meaning from Abu Hurairah stating that gifts remove the 'burning heat of the chest' (anger/hatred)."
  },
  "importantWords": [
    {
      "arabic": "تَهَادَوْا",
      "english": "Exchange gifts",
      "urdu": "ایک دوسرے کو ہدیہ دو"
    },
    {
      "arabic": "تَسُلُّ",
      "english": "Extracts / Removes",
      "urdu": "کھینچ نکالتا ہے / دور کرتا ہے"
    },
    {
      "arabic": "اَلسَّخِيمَةَ",
      "english": "Rancor / Malice / Grudge",
      "urdu": "کینہ / دشمنی / سینے کی کھوٹ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ہدیہ دینے کے نفسیاتی اور روحانی فائدے کو بیان کرتی ہے کہ یہ دلوں سے پرانی دشمنیوں اور کینہ و بغض کو ختم کرنے کا ایک بہترین ذریعہ ہے۔",
    "english": "This Hadith highlights the psychological and spiritual benefit of gifting, stating it is an effective tool to eliminate long-standing grudges, malice, and enmity from hearts."
  },
  "references": [
    {
      "arabic": "مسند البزار (1937)",
      "english": "Musnad Al-Bazzar (1937)"
    },
    {
      "arabic": "جامع الترمذي (2130)",
      "english": "Jami' At-Tirmidhi (2130)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "ضعيف (وله شواهد صحيحة)",
    "english": "Weak (but supported by authentic witnesses)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہدیہ: دلوں کی صفائی کا نسخہ",
        "english": "Gifts: A Remedy for Purifying Hearts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخیمہ کا مفہوم",
              "english": "Meaning of Sakhimah"
            },
            "content": {
              "urdu": [
                "سخیمہ سے مراد وہ چھپا ہوا غصہ، کینہ یا حسد ہے جو سینے میں جڑ پکڑ لیتا ہے۔",
                "نبی ﷺ نے ہدیہ کے لیے 'تسلّ' (کھینچ لینا) کا لفظ استعمال کیا جیسے کسی چیز کو گہرائی سے نکالا جاتا ہے۔",
                "ہدیہ کی معمولی قیمت بھی دلوں پر جمی میل کو دھونے کی طاقت رکھتی ہے۔"
              ],
              "english": [
                "Sakhimah refers to hidden anger, malice, or envy that takes root in the chest.",
                "The Prophet (ﷺ) used the word 'Tasullu' (to pull out), implying extracting something from deep within.",
                "The gesture of a gift, regardless of its cost, has the power to wash away internal ill-will."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفرت کا خاتمہ",
              "english": "End of Hatred"
            },
            "content": {
              "urdu": [
                "معاشرتی زندگی میں غلط فہمیاں پیدا ہونا فطری ہے، مگر انہیں دل میں بسائے رکھنا بیماری ہے۔",
                "ہدیہ دشمن کو دوست بنانے اور ناراض رشتہ داروں کو قریب لانے کا پل ہے۔",
                "اسلام میں صلح رحمی اور باہمی تعلقات کی بحالی کے لیے ہدیہ ایک مستحسن عمل ہے۔"
              ],
              "english": [
                "Misunderstandings are natural in social life, but harboring them is a spiritual illness.",
                "Gifting is a bridge to turn enemies into friends and reconcile with estranged relatives.",
                "In Islam, giving gifts is a recommended act for maintaining kinship and restoring relationships."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہدیہ اور نفسیات",
        "english": "Gifting and Psychology"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توجہ اور اعتراف",
              "english": "Attention and Acknowledgement"
            },
            "content": {
              "urdu": [
                "تحفہ اس بات کا اعتراف ہے کہ آپ دوسرے کو اہمیت دیتے ہیں۔",
                "جب کسی کو اچانک تحفہ ملتا ہے تو اس کے دل سے منفی جذبات خود بخود ختم ہونے لگتے ہیں۔",
                "یہ آپس کے اعتماد کو بحال کرنے کا سب سے آسان اور خوبصورت طریقہ ہے۔"
              ],
              "english": [
                "A gift is an acknowledgement that you value the other person.",
                "Receiving an unexpected gift naturally dissolves negative emotions within a person.",
                "It is the simplest and most beautiful way to restore mutual trust."
              ]
            }
          },
          {
            "title": {
              "urdu": "سخاوت بمقابلہ بخیلی",
              "english": "Generosity vs Stinginess"
            },
            "content": {
              "urdu": [
                "ہدیہ دینے کی عادت انسان کو بخیلی اور انا پرستی سے نکالتی ہے۔",
                "ایک سخی انسان کا دل ہمیشہ دوسروں کے لیے صاف رہتا ہے۔",
                "دین اسلام صرف عبادات کا نام نہیں بلکہ حسنِ اخلاق اور بہترین برتاؤ کا نام بھی ہے۔"
              ],
              "english": [
                "The habit of gifting frees a person from stinginess and egoism.",
                "A generous person's heart remains clean and open toward others.",
                "Islam is not just about rituals but also about noble character and excellent conduct."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اطلاق اور احتیاط",
        "english": "Practical Application and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہدیہ میں اعتدال",
              "english": "Moderation in Gifting"
            },
            "content": {
              "urdu": [
                "ہدیہ مہنگا ہونا ضروری نہیں، بلکہ دینے والے کی نیت اور خلوص اہم ہے۔",
                "تحفہ دیتے وقت دوسرے کی عزتِ نفس کا خیال رکھیں تاکہ وہ اسے بوجھ نہ سمجھے۔",
                "موقع کی مناسبت سے چھوٹی چیزیں بھی دل جیت لیتی ہیں۔"
              ],
              "english": [
                "A gift doesn't need to be expensive; the giver's intention and sincerity are what matter.",
                "When gifting, respect the recipient's dignity so they do not feel burdened.",
                "Small things given at the right time can effectively win hearts."
              ]
            }
          },
          {
            "title": {
              "urdu": "رشوت اور ہدیہ میں فرق",
              "english": "Difference between Gift and Bribe"
            },
            "content": {
              "urdu": [
                "ہدیہ صرف محبت کے لیے ہونا چاہیے، کسی ناجائز کام یا عہدے کے فائدے کے لیے نہیں۔",
                "اگر ہدیہ کسی خاص غرض یا بدلے کی توقع پر دیا جائے تو وہ اپنی اخلاقی قدر کھو دیتا ہے۔",
                "صرف اللہ کی رضا کے لیے دیا گیا ہدیہ ہی دلوں کو جوڑتا ہے۔"
              ],
              "english": [
                "A gift should be solely for affection, not for obtaining an illegal favor or official gain.",
                "If a gift is given with an ulterior motive or expectation of return, it loses its moral value.",
                "Only gifts given for Allah's sake truly unite hearts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ سبق",
        "english": "Summary Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رشتوں کی آبیاری",
              "english": "Nurturing Relationships"
            },
            "content": {
              "urdu": [
                "اگر آپ کسی سے ناراض ہیں یا تعلقات میں سرد مہری ہے تو پہل کر کے ہدیہ دیں۔",
                "کینہ دل کو جلا دیتا ہے، جبکہ ہدیہ اس آگ کو ٹھنڈا کرتا ہے۔",
                "سنتِ نبوی کو اپنا کر ہم اپنے معاشرے کو امن اور محبت کا گہوارہ بنا سکتے ہیں۔"
              ],
              "english": [
                "If you are angry with someone or feel coldness in a relationship, take the initiative and give a gift.",
                "Grudges burn the heart, while gifts cool that fire.",
                "By adopting this Prophetic Sunnah, we can make our society a cradle of peace and love."
              ]
            }
          }
        ]
      }
    }
  ]
}