{
  "hadithId": 1067,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/10/96"],
    "kitabId": 10,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحدود",
    "babId": 87
  },
 
  "takhreej": {
    "arabic": "حسن لشواهده. رواه الترمذي (1401)، والحاكم (4/369)، وابن ماجه (2599)، وأبو داود (4490). قال الحافظ ابن حجر في التلخيص الحبير أن له شواهد يتقوى بها.",
    "urdu": "حسن (شواہد کی بنا پر)۔ اسے ترمذی (1401)، حاکم (4/369)، ابن ماجہ (2599) اور ابوداؤد (4490) نے روایت کیا ہے۔ اگرچہ انفرادی اسناد میں کلام ہے، لیکن دیگر شواہد کی وجہ سے یہ حسن کے درجے پر ہے۔",
    "english": "Hasan (due to corroborating evidences). Reported by At-Tirmidhi (1401), Al-Hakim (4/369), Ibn Majah (2599), and Abu Dawud (4490). Al-Hafiz Ibn Hajar mentioned in Al-Talkhis that it has supporting narrations which strengthen its status."
  },
  "importantWords": [
    {
      "arabic": "تُقَامُ",
      "english": "Executed/Established",
      "urdu": "قائم کی جائیں / نافذ کی جائیں"
    },
    {
      "arabic": "اَلْحُدُودُ",
      "english": "Prescribed penalties",
      "urdu": "شرعی سزائیں / حدود"
    },
    {
      "arabic": "اَلْمَسَاجِدِ",
      "english": "Mosques",
      "urdu": "مساجد"
    },
    {
      "arabic": "لَا",
      "english": "Not",
      "urdu": "نہیں"
    },
    {
      "arabic": "رَوَاهُ",
      "english": "Narrated it",
      "urdu": "اسے روایت کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں مساجد کے احترام اور تقدس کو برقرار رکھنے کے لیے وہاں شرعی حدود اور سزائیں نافذ کرنے سے منع کیا گیا ہے۔",
    "english": "This Hadith prohibits the execution of legal penalties within mosques to maintain their sanctity and cleanliness."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1401)",
      "english": "Reported by At-Tirmidhi (1401)"
    },
    {
      "arabic": "رواه ابن ماجه (2599)",
      "english": "Reported by Ibn Majah (2599)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kY6k-tL0fRE",
  "grade": {
    "arabic": "حسن لغيره",
    "english": "Hasan Lighairihi (Good due to external evidence)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مساجد کا احترام اور تقدس",
        "english": "Sanctity of the Mosques"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت گاہ کی صفائی",
              "english": "Cleanliness of Places of Worship"
            },
            "content": {
              "urdu": [
                "مساجد اللہ کی عبادت اور ذکر کے لیے بنائی گئی ہیں۔",
                "سزاؤں کے نفاذ کے دوران شور و غل یا نجاست کا خطرہ ہوتا ہے۔",
                "مسجد کو خون اور گندگی سے پاک رکھنا شرعی طور پر واجب ہے۔"
              ],
              "english": [
                "Mosques are built specifically for the worship and remembrance of Allah.",
                "Executing penalties involves risks of noise, chaos, or bodily impurities.",
                "Keeping the mosque pure from blood and filth is a religious obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "شور و غل سے بچنا",
              "english": "Avoiding Noise and Clamor"
            },
            "content": {
              "urdu": [
                "سزا پاتے وقت مجرم کی چیخ و پکار سے نماز پڑھنے والوں کو خلل پڑتا ہے۔",
                "مساجد میں سکون اور وقار برقرار رکھنا اللہ کے گھر کا ادب ہے۔",
                "سزاؤں کے لیے مساجد کے علاوہ کوئی اور میدان یا جگہ مختص ہونی چاہیے۔"
              ],
              "english": [
                "The cries of the offender during punishment disturb those engaged in prayer.",
                "Maintaining tranquility and dignity is part of respecting the House of Allah.",
                "A separate field or designated area should be used for legal executions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور حدود",
        "english": "Juristic Rulings on Hudud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکم کی نوعیت",
              "english": "Nature of the Command"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک یہ ممانعت تنزیہی ہے تاکہ مسجد کی توہین نہ ہو۔",
                "حدود کا مقصد معاشرے کی اصلاح ہے، لیکن جگہ کا انتخاب اہم ہے۔",
                "اسلامی ریاست میں حدود کے لیے الگ انتظام کرنا حاکم کی ذمہ داری ہے۔"
              ],
              "english": [
                "Jurists consider this prohibition to prevent the desecration of the mosque.",
                "While Hudud aim to reform society, the choice of location is significant.",
                "It is the ruler's duty to arrange separate venues for penalties in an Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "قصاص اور دیگر سزائیں",
              "english": "Retribution and Other Penalties"
            },
            "content": {
              "urdu": [
                "اس حکم میں کوڑے مارنا، ہاتھ کاٹنا اور قصاص لینا سب شامل ہیں۔",
                "ایسی سزائیں جن میں جسمانی ایذا ہو، مسجد سے باہر ہونی چاہئیں۔",
                "تعزیری سزائیں جو مسجد کے تقدس کے خلاف نہ ہوں، ان پر بحث موجود ہے۔"
              ],
              "english": [
                "This ruling includes flogging, amputation, and legal retribution (Qisas).",
                "Penalties involving physical injury must be conducted outside the mosque.",
                "Discretionary punishments that don't violate sanctity are subject to discussion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی پہلو",
        "english": "Social and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امن کا گہوارہ",
              "english": "A Cradle of Peace"
            },
            "content": {
              "urdu": [
                "مسجد کو امن و سلامتی کی جگہ کے طور پر پہچانا جانا چاہیے۔",
                "خوفناک مناظر سے مسجد کے پرامن ماحول پر برا اثر پڑتا ہے۔",
                "اسلامی تعلیمات ہر عمل کو اس کے مناسب مقام پر کرنے کا درس دیتی ہیں۔"
              ],
              "english": [
                "The mosque should be recognized as a place of safety and peace.",
                "Distressing scenes negatively impact the peaceful environment of the mosque.",
                "Islamic teachings instruct us to perform every act in its proper place."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدود کا مقصد",
              "english": "The Objective of Hudud"
            },
            "content": {
              "urdu": [
                "سزا کا مقصد عبرت ہے، لیکن اس میں مسجد کا وقار متاثر نہیں ہونا چاہیے۔",
                "عوامی مقامات پر سزاؤں کا نفاذ لوگوں کے لیے نصیحت کا باعث بنتا ہے۔",
                "مساجد کو صرف روحانی اور تعلیمی سرگرمیوں کے لیے وقف رکھنا چاہیے۔"
              ],
              "english": [
                "The goal of punishment is deterrence, without affecting the mosque's dignity.",
                "Executing penalties in public spaces serves as an admonition for people.",
                "Mosques should be reserved for spiritual and educational activities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انتظامی حکمت",
              "english": "Administrative Wisdom"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کی انتظامی زندگی ہمارے لیے بہترین نمونہ ہے۔",
                "آپ ﷺ نے دینی اور دنیاوی امور کے لیے جگہوں کا تعین فرمایا۔",
                "مساجد کو غیر ضروری شور و غل اور ہنگاموں سے بچانا ہر مسلمان کا فرض ہے۔"
              ],
              "english": [
                "The administrative life of the Prophet (ﷺ) is the best model for us.",
                "He designated specific locations for religious and worldly affairs.",
                "Protecting mosques from unnecessary noise and turmoil is every Muslim's duty."
              ]
            }
          },
          {
            "title": {
              "urdu": "احترامِ شعائر اللہ",
              "english": "Respecting the Symbols of Allah"
            },
            "content": {
              "urdu": [
                "مساجد شعائر اللہ میں سے ہیں، ان کی تعظیم دلوں کا تقویٰ ہے۔",
                "ہر وہ کام جو مسجد کی بے حرمتی کا باعث بنے، اس سے بچنا چاہیے۔",
                "اسلام ہر چیز میں شائستگی اور سلیقے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Mosques are symbols of Allah; respecting them is a sign of piety.",
                "Any action that leads to the desecration of the mosque must be avoided.",
                "Islam teaches grace and proper conduct in all matters."
              ]
            }
          }
        ]
      }
    }
  ]
}