{
  "hadithId": 470,
  "hadithNo": 46,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/46", "abudawud/3221"],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (3221) ، والحاكم (1/370) والبيهقي (4/56) وصححه الحاكم ووافقه الذهبي.",
    "urdu": "صحیح۔ اسے ابوداؤد (3221) اور حاکم نے روایت کیا ہے۔ امام حاکم نے اسے صحیح کہا اور علامہ ذہبی نے ان کی موافقت کی ہے۔",
    "english": "Sahih. Reported by Abu Dawud (3221), Al-Hakim (1/370), and Al-Bayhaqi (4/56). Al-Hakim authenticated it and Adh-Dhahabi agreed with him."
  },
  "importantWords": [
    {
      "arabic": "فَرَغَ",
      "english": "Finished",
      "urdu": "فارغ ہوئے"
    },
    {
      "arabic": "اِسْتَغْفِرُوا",
      "english": "Seek forgiveness",
      "urdu": "تم بخشش مانگو"
    },
    {
      "arabic": "التَّثْبِيتَ",
      "english": "Steadfastness",
      "urdu": "ثابت قدمی"
    },
    {
      "arabic": "يُسْأَلُ",
      "english": "Being questioned",
      "urdu": "اس سے سوال کیا جا رہا ہے"
    },
    {
      "arabic": "وَقَفَ",
      "english": "Stood",
      "urdu": "کھڑے ہوئے"
    }
  ],
  "summary": {
    "urdu": "تدفین کے بعد قبر پر تھوڑی دیر ٹھہرنا، میت کے لیے استغفار کرنا اور منکر نکیر کے سوالات کے وقت ثابت قدمی کی دعا کرنا سنت ہے۔",
    "english": "It is Sunnah to stand by the grave after burial, seek forgiveness for the deceased, and pray for their steadfastness during the questioning."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الجنائز، رقم 3221",
      "english": "Sunan Abi Dawud, Book of Funerals, Hadith 3221"
    },
    {
      "arabic": "المستدرك على الصحيحين للحاكم، رقم 1372",
      "english": "Al-Mustadrak al-Hakim, Hadith 1372"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عثمان بن عفان",
        "english": "Uthman bin Affan"
      },
      "slug": "uthman-bin-affan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_S6pXf2T8E",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تدفین کے بعد کے مسنون اعمال",
        "english": "Recommended Acts After Burial"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبر پر قیام اور دعا",
              "english": "Standing and Praying at the Grave"
            },
            "content": {
              "urdu": [
                "تدفین مکمل ہونے کے بعد قبر پر تھوڑی دیر ٹھہرنا اور میت کے لیے دعا کرنا آپ ﷺ کی مستقل سنت ہے۔",
                "یہ وقت میت کے لیے نہایت نازک ہوتا ہے، اس لیے مسلمانوں کا وہاں موجود رہنا اسے سکون فراہم کرتا ہے۔",
                "قبر پر کھڑے ہو کر انفرادی طور پر یا اجتماعی اشارے کے ساتھ دعا کرنا شریعت میں پسندیدہ عمل ہے۔"
              ],
              "english": [
                "Staying at the grave for a short while after burial and praying is a consistent Sunnah of the Prophet (ﷺ).",
                "This is a critical moment for the deceased, so the presence of fellow Muslims provides spiritual comfort.",
                "Standing by the grave to pray individually or collectively is a recommended practice in Islamic Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "استغفار کی اہمیت",
              "english": "The Importance of Seeking Forgiveness"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے حکم دیا کہ اپنے بھائی کے لیے بخشش مانگو کیونکہ اب اس کا حساب شروع ہو چکا ہے۔",
                "زندہ لوگوں کی مخلصانہ دعائیں میت کے گناہوں کی معافی اور قبر کی تنگی دور کرنے کا سبب بنتی ہیں۔",
                "یہ عمل اسلامی اخوت کا تقاضا ہے کہ ہم اپنے بھائی کو اس مشکل گھڑی میں تنہا نہ چھوڑیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) commanded seeking forgiveness as the deceased's accounting has already commenced.",
                "Sincere prayers from the living can cause the deceased's sins to be pardoned and grave hardships eased.",
                "This act fulfills the duty of Islamic brotherhood by not leaving a brother alone in this difficult hour."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عالمِ برزخ کے سوالات",
        "english": "Questioning in the World of Barzakh"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ثابت قدمی کی التجا",
              "english": "Plea for Steadfastness (Tathbeet)"
            },
            "content": {
              "urdu": [
                "میت سے منکر اور نکیر اس کے رب، دین اور نبی ﷺ کے بارے میں سوالات کرتے ہیں۔",
                "ثابت قدمی کی دعا کا مطلب یہ ہے کہ اللہ میت کو ان سوالات کے درست جوابات دینے کی توفیق عطا فرمائے۔",
                "قبر کی آزمائش پہلی منزل ہے، اگر یہاں ثابت قدمی مل جائے تو آگے کے مراحل آسان ہو جاتے ہیں۔"
              ],
              "english": [
                "Munkar and Nakir question the deceased about their Lord, their religion, and the Prophet (ﷺ).",
                "Praying for steadfastness means asking Allah to enable the deceased to give correct answers.",
                "The trial of the grave is the first stage; if steadfastness is granted here, subsequent stages become easy."
              ]
            }
          },
          {
            "title": {
              "urdu": "فوری بازپرس کی حقیقت",
              "english": "The Reality of Immediate Questioning"
            },
            "content": {
              "urdu": [
                "حدیث کے الفاظ 'فإنه الآن يسأل' واضح کرتے ہیں کہ سوال و جواب کا سلسلہ تدفین کے فوراً بعد شروع ہو جاتا ہے۔",
                "یہ غیب کی ان حقائق میں سے ہے جن پر ایمان لانا ہر مسلمان کے لیے ضروری اور لازمی ہے۔",
                "میت قبر والوں کے قدموں کی چاپ سنتی ہے، اسی لیے اس وقت دعا کی تاثیر بہت زیادہ ہوتی ہے۔"
              ],
              "english": [
                "The phrase 'he is being questioned now' clarifies that the interrogation begins right after burial.",
                "This is among the realities of the unseen (Ghaib) that every Muslim must believe in firmly.",
                "The deceased hears the footsteps of those leaving, which is why prayers at this moment are highly effective."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنتِ صحابہ اور عملی نمونہ",
        "english": "Practice of the Sahaba and Practical Model"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا عثمان رض کی روایت",
              "english": "The Narration of Uthman (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عثمان رض خود قبر کو دیکھ کر بہت روتے تھے اور اس سنت کی اہمیت سے بخوبی واقف تھے۔",
                "صحابہ کرام کا یہ جذبہ ہمیں سکھاتا ہے کہ موت کو یاد رکھنا دل کی نرمی کا باعث بنتا ہے۔",
                "خلفائے راشدین نے نبی ﷺ کے اس حکم کو امت تک پہنچا کر عظیم علمی اور اخلاقی خدمت کی۔"
              ],
              "english": [
                "Uthman (RA) used to weep excessively upon seeing a grave and was well-aware of this Sunnah's importance.",
                "The attitude of the Sahaba teaches us that remembering death leads to the softening of the heart.",
                "The Rightly Guided Caliphs performed a great service by conveying this Prophetic command to the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن خوانی بمقابلہ مسنون دعا",
              "english": "Quran Recitation vs. Sunnah Dua"
            },
            "content": {
              "urdu": [
                "قبر پر بیٹھ کر قرآن خوانی کے بجائے مسنون دعا اور استغفار کرنا سنتِ نبوی کے زیادہ قریب ہے۔",
                "نبی ﷺ اور صحابہ سے قبر پر مخصوص سورتوں کے بجائے میت کے لیے مغفرت کی دعائیں ثابت ہیں۔",
                "ہمیں چاہیے کہ اپنی طرف سے رسومات گھڑنے کے بجائے ثابت شدہ نبوی طریقے پر اکتفا کریں۔"
              ],
              "english": [
                "Seeking forgiveness and making Sunnah prayers at the grave is closer to the Prophet's way than group recitation.",
                "Authentic reports show the Prophet and Sahaba prayed for forgiveness rather than reciting specific Surahs at the grave.",
                "We should suffice with the established Prophetic methods rather than inventing our own rituals."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موت کی یاد دہانی",
              "english": "Reminder of Death"
            },
            "content": {
              "urdu": [
                "دوسروں کو دفناتے وقت ہمیں اپنی موت اور اس کے بعد ہونے والے سوالات کا تصور کرنا چاہیے۔",
                "یہ سنت ہمیں اپنی آخرت کی تیاری اور گناہوں سے توبہ کی طرف مائل کرتی ہے۔",
                "کامیاب وہ ہے جو منکر نکیر کے سوالات کے لیے دنیا ہی میں جوابات (اعمال) تیار کر لے۔"
              ],
              "english": [
                "While burying others, we must envision our own death and the subsequent questioning.",
                "This Sunnah inclines us toward preparing for the Hereafter and repenting from our sins.",
                "Successful is the one who prepares their answers (deeds) for Munkar and Nakir while still in this world."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلمانوں کی خیر خواہی",
              "english": "Well-wishing for Muslims"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کا دوسرے پر حق ہے کہ وہ اس کے جنازے میں شریک ہو اور آخر تک اس کے لیے دعا کرے۔",
                "تدفین کے بعد فوراً بھاگنے کے بجائے چند منٹ میت کے لیے وقف کرنا عظیم ہمدردی ہے۔",
                "ہماری دعا کسی کی قبر کو روشن کرنے اور اس کی آزمائش کو آسان بنانے کا ذریعہ بن سکتی ہے۔"
              ],
              "english": [
                "It is a Muslim's right over another to attend their funeral and pray for them until the very end.",
                "Dedication of a few minutes for the deceased after burial is an act of great compassion.",
                "Our prayers can be the means to enlighten someone's grave and ease their trials."
              ]
            }
          }
        ]
      }
    }
  ]
}