{
  "hadithId": 1268,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/33"],
    "kitabId": 16,
    "inKitabBab": 3,
    "arabicBook": "الجامع - باب الزهد والورع",
    "babId": 104
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6416). والترمذي (2333)، وابن ماجه (4114).",
    "urdu": "صحیح۔ اسے امام بخاری (6416) نے روایت کیا ہے۔ یہ حدیث زہد اور دنیا کی بے ثباتی کے متعلق ایک بنیادی اصل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6416). It is also reported by At-Tirmidhi and Ibn Majah. This Hadith is a foundational text regarding asceticism and the temporary nature of this world."
  },
  "importantWords": [
    {
      "arabic": "غَرِيبٌ",
      "english": "Stranger",
      "urdu": "اجنبی"
    },
    {
      "arabic": "عَابِرُ سَبِيلٍ",
      "english": "Wayfarer / Traveler",
      "urdu": "راہ چلتا مسافر"
    },
    {
      "arabic": "بِمَنْكِبِي",
      "english": "My shoulders",
      "urdu": "میرے کندھے"
    },
    {
      "arabic": "لِسَقَمِكَ",
      "english": "For your sickness",
      "urdu": "اپنی بیماری کے لیے"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ نے اس حدیث میں دنیا کی حقیقت بیان فرمائی کہ یہ مسافر خانہ ہے، لہذا یہاں دل لگانے کے بجائے آخرت کی تیاری کرنی چاہیے اور وقت کو غنیمت سمجھنا چاہیے۔",
    "english": "In this Hadith, the Prophet (ﷺ) described the reality of this world as a temporary station; therefore, one should prepare for the Hereafter instead of becoming attached to it, making the most of one's time."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الرقاق، باب قول النبي صلى الله عليه وسلم كن في الدنيا كأنك غريب، رقم 6416",
      "english": "Sahih al-Bukhari, Book of Heart-Melters, No. 6416"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دنیا میں مسافرانہ زندگی",
        "english": "Living as a Wayfarer in the World"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجنبی اور مسافر کی مثال",
              "english": "The Example of a Stranger and Traveler"
            },
            "content": {
              "urdu": [
                "اجنبی وہ ہوتا ہے جس کا اپنا گھر کہیں اور ہو، وہ عارضی جگہ پر دل نہیں لگاتا۔",
                "مسافر کا مقصد صرف منزل تک پہنچنا ہوتا ہے، وہ راستے کی آسائشوں میں مگن ہو کر سفر نہیں بھولتا۔",
                "مسلمان کو چاہیے کہ وہ دنیا کو عارضی قیام گاہ سمجھے اور اپنی اصل منزل (آخرت) کو یاد رکھے۔"
              ],
              "english": [
                "A stranger is one whose real home is elsewhere; they do not become attached to a temporary place.",
                "A traveler's goal is to reach their destination; they don't forget the journey for the sake of roadside luxuries.",
                "A Muslim should treat the world as a temporary residence and keep the ultimate destination (the Hereafter) in mind."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وقت کی اہمیت اور تیاری",
        "english": "Importance of Time and Preparation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طویل امیدوں کا خاتمہ",
              "english": "Ending Long-term Hopes"
            },
            "content": {
              "urdu": [
                "حضرت ابن عمر رضی اللہ عنہما کی نصیحت کا مطلب یہ ہے کہ انسان کو موت کے لیے ہر وقت تیار رہنا چاہیے۔",
                "شام کے وقت یہ یقین نہ رکھنا کہ صبح نصیب ہوگی، انسان کو گناہوں سے بچاتا اور توبہ پر ابھارتا ہے۔",
                "نیکی کے کاموں میں تاخیر (ٹال مٹول) کرنا شیطان کا سب سے بڑا ہتھیار ہے۔"
              ],
              "english": [
                "Ibn 'Umar's (RA) advice means that a person should be ready for death at all times.",
                "Not expecting the morning in the evening protects one from sins and encourages repentance.",
                "Procrastination in doing good deeds is one of Satan's greatest tools."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تندرستی اور زندگی کی قیمت",
        "english": "Value of Health and Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحت اور فراغت کا فائدہ",
              "english": "Taking Advantage of Health and Leisure"
            },
            "content": {
              "urdu": [
                "انسان کو تندرستی کے ایام میں اتنی عبادت کر لینی چاہیے جو اس کی بیماری کے وقت کی کمی کو پورا کر سکے۔",
                "بیماری میں انسان وہ کام نہیں کر سکتا جو وہ صحت مند ہو کر کر سکتا ہے، لہذا فرصت کو غنیمت جاننا چاہیے۔",
                "زندگی عمل کی جگہ ہے اور موت جزا کی، لہذا موت سے پہلے اپنے لیے زادِ راہ تیار کر لینا دانشمندی ہے۔"
              ],
              "english": [
                "One should perform enough worship during healthy days to compensate for shortcomings during illness.",
                "In sickness, one cannot perform what they could while healthy; therefore, leisure must be cherished.",
                "Life is for action and death is for reward; thus, preparing provisions before death is wisdom."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی پہلو",
        "english": "Educational and Spiritual Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفقتِ نبوی ﷺ",
              "english": "Prophetic Compassion (ﷺ)"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا ابن عمر رضی اللہ عنہ کے کندھے پکڑنا مخاطب کی توجہ حاصل کرنے اور نصیحت کی اہمیت جتانے کا ایک مؤثر انداز تھا۔",
                "یہ اساتذہ اور والدین کے لیے سبق ہے کہ وہ اہم بات سکھاتے وقت محبت اور توجہ کا اظہار کریں۔",
                "اس طرح کی نصیحتیں دل پر گہرا اثر چھوڑتی ہیں اور زندگی بھر کا دستور بن جاتی ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) taking Ibn 'Umar by the shoulders was an effective way to gain attention and signify the importance of the advice.",
                "This is a lesson for teachers and parents to show affection and focus when teaching something vital.",
                "Such personal advice leaves a deep impact on the heart and becomes a lifelong principle."
              ]
            }
          }
        ]
      }
    }
  ]
}