{
  "hadithId": 856,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/46"],
    "kitabId": 8,
    "inKitabBab": 2,
    "arabicBook": "كتاب النكاح",
    "babId": 65
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (1480)، وأخرجه الترمذي (1135)، والنسائي (3245)، وأبو داود (2284)، وابن ماجه (1869).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (1480) نے اسے روایت کیا ہے۔ یہ ایک طویل حدیث کا حصہ ہے جس میں فاطمہ بنت قیس کے نکاح کے مشورے کا ذکر ہے۔",
    "english": "Sahih. Reported by Muslim (1480). Also recorded by At-Tirmidhi, An-Nasa'i, Abu Dawud, and Ibn Majah as part of a longer narration regarding her proposal."
  },
  "importantWords": [
    {
      "arabic": "اِنْكِحِي",
      "english": "Marry / Perform Nikah",
      "urdu": "نکاح کر لو"
    },
    {
      "arabic": "أُسَامَةَ",
      "english": "Usama (bin Zaid)",
      "urdu": "اسامہ بن زید"
    },
    {
      "arabic": "قَالَ لَهَا",
      "english": "He said to her",
      "urdu": "آپ ﷺ نے اس سے فرمایا"
    },
    {
      "arabic": "بِنْتِ قَيْسٍ",
      "english": "Daughter of Qais",
      "urdu": "قیس کی بیٹی"
    },
    {
      "arabic": "رَوَاهُ",
      "english": "Narrated it",
      "urdu": "اسے روایت کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی ﷺ کی طرف سے ایک بیوہ خاتون کو بہترین رشتہ (اسامہ بن زید) منتخب کرنے میں رہنمائی اور مشورے کا ذکر ہے۔",
    "english": "This Hadith highlights the Prophet's (ﷺ) guidance and advice to a woman in choosing the best suitor, specifically recommending Usama bin Zaid."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الطلاق، رقم الحديث ١٤٨٠",
      "english": "Sahih Muslim, Book of Divorce, Hadith No. 1480"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "فاطمة بنت قيس",
        "english": "Fatima bint Qais"
      },
      "slug": "fatima-bint-qais"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أسامة بن زيد",
        "english": "Usama bin Zaid"
      },
      "slug": "usama-bin-zaid"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_Qf8vB7s4M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح میں مشورہ اور رہنمائی",
        "english": "Consultation and Guidance in Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کا مشفقانہ کردار",
              "english": "Prophet's (ﷺ) Compassionate Role"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فاطمہ بنت قیس کو ان کے بہترین مستقبل کے لیے اسامہ بن زید کا نام تجویز فرمایا۔",
                "آپ ﷺ نے دیگر رشتوں کے عیوب بیان کر کے ایک بہترین انتخاب میں ان کی مدد کی۔",
                "یہ اس بات کی دلیل ہے کہ بزرگ اور خیر خواہ نکاح کے معاملے میں رائے دے سکتے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) suggested Usama bin Zaid to Fatima bint Qais for her best future.",
                "He helped her by highlighting the drawbacks of other suitors to ensure a better choice.",
                "This proves that elders and well-wishers can provide their opinions in marriage matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلوص اور دیانت داری",
              "english": "Sincerity and Honesty"
            },
            "content": {
              "urdu": [
                "مشورہ مانگے جانے پر سچ بولنا اور عیب بتانا غیبت کے زمرے میں نہیں آتا بلکہ دیانت داری ہے۔",
                "نبی ﷺ نے امیدواروں کی مالی حالت اور مزاج کے بارے میں کھل کر بتایا۔",
                "نکاح جیسے اہم فیصلے میں حقائق کو چھپانا دھوکہ دہی کے مترادف ہو سکتا ہے۔"
              ],
              "english": [
                "Speaking the truth and revealing faults when asked for advice is not backbiting, but honesty.",
                "The Prophet (ﷺ) openly discussed the financial status and temperaments of the suitors.",
                "Hiding facts in a major decision like marriage can be equivalent to deception."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کفائت (برابری) کا تصور",
        "english": "The Concept of Kafa'ah (Compatibility)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تقویٰ اور سیرت کو ترجیح",
              "english": "Prioritizing Piety and Character"
            },
            "content": {
              "urdu": [
                "سیدہ فاطمہ ایک قریشی خاتون تھیں جبکہ اسامہ بن زید آزاد کردہ غلام کے بیٹے تھے۔",
                "اس مشورے سے ثابت ہوا کہ نکاح میں نسب سے زیادہ دین اور اخلاق کی اہمیت ہے۔",
                "اسلام نے رنگ و نسل اور سماجی حیثیت کے فرق کو نکاح کی راہ میں رکاوٹ نہیں بنایا۔"
              ],
              "english": [
                "Fatima was a Quraishi lady while Usama was the son of a freed slave.",
                "This advice proves that religion and character are more important than lineage in marriage.",
                "Islam did not let race or social status become a barrier in the path of marriage."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوشگوار زندگی کی ضمانت",
              "english": "Guarantee of a Happy Life"
            },
            "content": {
              "urdu": [
                "نبی ﷺ جانتے تھے کہ اسامہ بن زید کے ساتھ ان کی زندگی زیادہ پرسکون گزرے گی۔",
                "بعد میں سیدہ فاطمہ نے خود اعتراف کیا کہ اسامہ کے ساتھ ان کی زندگی بہت خوشگوار رہی۔",
                "اللہ اور اس کے رسول ﷺ کے فیصلوں میں ہی مومن کے لیے اصل خیر پوشیدہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) knew that her life with Usama bin Zaid would be more peaceful.",
                "Fatima herself later admitted that her life with Usama was very happy.",
                "The true good for a believer is hidden in the decrees of Allah and His Messenger (ﷺ)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عورت کی رائے کا احترام",
        "english": "Respecting the Woman's Opinion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشورہ جبراً نہیں ہوتا",
              "english": "Advice is Not Coercion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے صرف مشورہ دیا، ان پر زبردستی اپنا فیصلہ مسلط نہیں فرمایا۔",
                "فاطمہ بنت قیس نے پہلے ہچکچاہٹ دکھائی لیکن پھر خوش دلی سے قبول کر لیا۔",
                "نکاح میں عورت کی دلی رضامندی اور ذہنی ہم آہنگی بے حد ضروری ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) only gave advice; He did not force His decision upon her.",
                "Fatima bint Qais initially hesitated but then accepted with a willing heart.",
                "The woman's sincere consent and mental harmony are extremely vital in marriage."
              ]
            }
          },
          {
            "title": {
              "urdu": "آزادانہ فیصلہ سازی",
              "english": "Independent Decision Making"
            },
            "content": {
              "urdu": [
                "خاتون کو یہ حق حاصل ہے کہ وہ پیش کردہ رشتوں پر غور کرے اور سوال پوچھے۔",
                "اسلام نے عورت کو اپنی زندگی کے اہم فیصلوں میں شریک کرنے کی تعلیم دی ہے۔",
                "والدین کو بھی چاہیے کہ وہ بچوں کی پسند اور ناپسند کا شرعی لحاظ رکھیں۔"
              ],
              "english": [
                "A woman has the right to consider proposed suitors and ask questions.",
                "Islam teaches including women in the significant decisions of their lives.",
                "Parents should also respect the Sharia-compliant likes and dislikes of their children."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیواؤں کا نکاح",
              "english": "Remarriage of Widows"
            },
            "content": {
              "urdu": [
                "یہ حدیث بیوہ اور مطلقہ خواتین کے دوبارہ نکاح کی حوصلہ افزائی کرتی ہے۔",
                "معاشرے میں بیواؤں کو تنہا چھوڑنے کے بجائے انہیں بسانا سنتِ نبوی ہے۔",
                "نبی ﷺ نے خود اس معاملے میں دلچسپی لے کر ایک مثال قائم فرمائی۔"
              ],
              "english": [
                "This Hadith encourages the remarriage of widows and divorcees.",
                "Settling widows in new homes instead of leaving them alone is a Prophetic Sunnah.",
                "The Prophet (ﷺ) set an example by taking a personal interest in this matter."
              ]
            }
          },
          {
            "title": {
              "urdu": "خیر خواہی کا جذبہ",
              "english": "Spirit of Goodwill"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو ایک دوسرے کی خیر خواہی کرنی چاہیے، خاص طور پر رشتہ طے کرتے وقت۔",
                "صحیح مشورہ دینا امانت ہے اور اس میں خیانت نہیں کرنی چاہیے۔",
                "نبی ﷺ کی زندگی ہمارے لیے ہر شعبے میں بہترین نمونہ ہے۔"
              ],
              "english": [
                "Muslims should seek the welfare of one another, especially during marriage proposals.",
                "Giving correct advice is a trust, and one should not be dishonest in it.",
                "The life of the Prophet (ﷺ) is the best example for us in every field."
              ]
            }
          }
        ]
      }
    }
  ]
}