{
  "hadithId": 1137,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/12/3"],
    "kitabId": 12,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأطعمة",
    "babId": 92
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (5495)، ومسلم (1952) في كتاب الصيد والذبائح، باب إباحة الجراد.",
    "urdu": "صحیح۔ اسے امام بخاری (5495) اور امام مسلم (1752) نے روایت کیا ہے۔ یہ حدیث ٹڈی کے حلال ہونے کی واضح دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5495) and Muslim (1952) in the Book of Hunting and Slaughtering."
  },
  "importantWords": [
    {
      "arabic": "غَزَوْنَا",
      "english": "We fought / participated in expeditions",
      "urdu": "ہم نے غزوات لڑے / شرکت کی"
    },
    {
      "arabic": "نَأْكُلُ",
      "english": "We were eating",
      "urdu": "ہم کھاتے تھے"
    },
    {
      "arabic": "الْجَرَادَ",
      "english": "Locusts",
      "urdu": "ٹڈی / ٹڈی دل"
    },
    {
      "arabic": "سَبْعَ",
      "english": "Seven",
      "urdu": "سات"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ ٹڈی حلال ہے اور اسے کھانا شرعاً جائز ہے، کیونکہ صحابہ کرام نے نبی ﷺ کی موجودگی میں اسے کھایا اور آپ ﷺ نے منع نہیں فرمایا۔",
    "english": "This Hadith establishes that locusts are Halal (permissible to eat) in Islam, as the Companions ate them in the presence of the Prophet (ﷺ) without any prohibition."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5495)",
      "english": "Narrated by Al-Bukhari (5495)"
    },
    {
      "arabic": "رواه مسلم (1952)",
      "english": "Narrated by Muslim (1952)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن أبي أوفى",
        "english": "Abdullah bin Abi Awfa"
      },
      "slug": "abdullah-bin-abi-awfa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ٹڈی کے حلال ہونے کا حکم",
        "english": "Ruling on the Permissibility of Locusts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجماعِ امت اور سنت",
              "english": "Consensus and Sunnah"
            },
            "content": {
              "urdu": [
                "تمام فقہاء اور ائمہ کا اس بات پر اتفاق ہے کہ ٹڈی حلال جانور ہے۔",
                "نبی ﷺ کی موجودگی میں صحابہ کا اسے کھانا 'سنتِ تقریری' (خاموش منظوری) کی دلیل ہے۔",
                "ایک اور حدیث کے مطابق، ٹڈی ان دو مرداروں میں سے ہے جنہیں حلال کیا گیا ہے۔"
              ],
              "english": [
                "There is a consensus among jurists that locusts are Halal.",
                "The Companions eating them in the Prophet's (ﷺ) presence is a form of 'Sunnah Taqririya' (silent approval).",
                "According to another Hadith, locusts are one of the two types of 'carrion' that are permissible to eat."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذبح کی ضرورت نہیں",
              "english": "No Need for Slaughtering"
            },
            "content": {
              "urdu": [
                "ٹڈی کو ذبح کرنے کی ضرورت نہیں ہوتی، یہ مچھلی کی طرح بغیر ذبح کے حلال ہے۔",
                "اگر یہ خود بخود مر جائے یا کسی بھی طریقے سے ماری جائے، تو اسے کھایا جا سکتا ہے۔",
                "یہ اسلام کی فراہم کردہ وسعت اور خوراک کی فراہمی میں آسانی کی ایک مثال ہے۔"
              ],
              "english": [
                "Locusts do not require ritual slaughter; they are Halal without it, similar to fish.",
                "Whether they die naturally or are killed by any means, they remain permissible to consume.",
                "This exemplifies the ease and broadness Islam provides in dietary options."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مشکل حالات میں خوراک کا انتظام",
        "english": "Food Provisions in Difficult Times"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنگی مہمات اور زادِ راہ",
              "english": "Expeditions and Provisions"
            },
            "content": {
              "urdu": [
                "غزوات کے دوران اکثر مسلمانوں کو خوراک کی قلت کا سامنا کرنا پڑتا تھا۔",
                "ایسے میں ٹڈی دل کا میسر آنا اللہ کی طرف سے ایک بڑی نعمت اور رزق کا ذریعہ تھا۔",
                "یہ حدیث صحابہ کرام کی جنگی مشقتوں اور ان کے صبر و استقامت کو بھی ظاہر کرتی ہے۔"
              ],
              "english": [
                "During battles, Muslims often faced severe food shortages.",
                "In such times, the arrival of locusts was a blessing and a source of sustenance from Allah.",
                "This Hadith also reflects the hardships and perseverance of the Companions during war."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی اور غذائی پہلو",
              "english": "Medical and Nutritional Aspects"
            },
            "content": {
              "urdu": [
                "ٹڈی پروٹین کا ایک بڑا ذریعہ ہے اور بہت سے صحرائی علاقوں میں اسے پسندیدہ غذا مانا جاتا ہے۔",
                "شریعت نے ان چیزوں کو حلال کیا ہے جو انسانی صحت کے لیے طیب (پاکیزہ) ہوں۔",
                "جدید تحقیق بھی ٹڈی کی غذائی اہمیت کی تائید کرتی ہے۔"
              ],
              "english": [
                "Locusts are a significant source of protein and a traditional food in many desert regions.",
                "Sharia permits items that are 'Tayyib' (wholesome) for human health.",
                "Modern research supports the nutritional value of locusts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کیا ہر قسم کی ٹڈی حلال ہے؟",
              "english": "Is Every Type of Locust Halal?"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک وہ تمام حشرات جو ٹڈی کی جنس سے ہیں، حلال ہیں۔",
                "ان میں رنگ یا علاقے کی تبدیلی سے حکم نہیں بدلتا۔",
                "تاہم، اگر کسی خاص علاقے کی ٹڈی زہریلی ہو، تو اسے طبی بنیادوں پر کھانے سے گریز کرنا چاہیے۔"
              ],
              "english": [
                "Jurists agree that all insects belonging to the locust family are Halal.",
                "Changes in color or region do not alter the legal status.",
                "However, if a specific species is known to be toxic, it should be avoided for health reasons."
              ]
            }
          },
          {
            "title": {
              "urdu": "خاموشی سے استدلال",
              "english": "Inference from Silence"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا کسی عمل کو دیکھ کر خاموش رہنا اس کے جائز ہونے کی قطعی دلیل ہے۔",
                "اگر ٹڈی حرام ہوتی تو آپ ﷺ صحابہ کو سات غزوات تک اسے کھانے نہ دیتے۔",
                "یہ اسلوبِ بیان ہمیں دین کے عملی نفاذ کی اہمیت سکھاتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) silence upon witnessing an act is a definitive proof of its permissibility.",
                "Had locusts been forbidden, he would not have allowed the Companions to eat them across seven expeditions.",
                "This narrative style teaches us the importance of the practical application of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی اور قناعت",
              "english": "Simplicity and Contentment"
            },
            "content": {
              "urdu": [
                "صحابہ کرام عیش و عشرت کے عادی نہیں تھے، وہ دستیاب حلال خوراک پر شکر کرتے تھے۔",
                "دین کی خاطر بڑی سے بڑی تکلیف اور سادہ غذا کو قبول کرنا ایمان کی نشانی ہے۔",
                "آج کے دور میں بھی ہمیں خوراک کے معاملے میں اسراف سے بچنا چاہیے۔"
              ],
              "english": [
                "The Companions were not accustomed to luxury; they were grateful for any available Halal food.",
                "Accepting hardships and simple food for the sake of faith is a sign of true belief.",
                "In modern times, we should also avoid extravagance in our diet."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقائق کی پیروی",
              "english": "Following Facts over Culture"
            },
            "content": {
              "urdu": [
                "بعض لوگ اپنی طبعی ناپسندیدگی کی بنا پر حلال چیز کو بھی برا سمجھتے ہیں۔",
                "اگرچہ کسی کو کوئی چیز ناپسند ہو سکتی ہے، مگر اسے 'حرام' کہنا جائز نہیں ہے۔",
                "دینی احکامات انسانی جذبات کے بجائے وحی اور سنت کے تابع ہوتے ہیں۔"
              ],
              "english": [
                "Some people view a Halal item negatively due to personal cultural distaste.",
                "While one may personally dislike something, calling it 'Haram' is not permissible.",
                "Religious rulings are subject to Revelation and Sunnah, not human emotions."
              ]
            }
          }
        ]
      }
    }
  ]
}