{
  "hadithId": 659,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/nasai:4668"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه النسائي في الكبرى (3/199)، وابن ماجه (2517)، والدارقطني (4/135)، وابن حبان (1215).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے نسائی، ابن ماجہ، اور دارقطنی نے روایت کیا ہے۔ ابن حبان نے اسے صحیح کہا ہے، اور اس کا ایک شاہد صحیح مسلم میں بھی موجود ہے جہاں حضرت عمر کے دور میں اس کی ممانعت کا ذکر ہے۔",
    "english": "Sahih. Reported by An-Nasa'i in al-Kubra (3/199), Ibn Majah (2517), Ad-Daraqutni (4/135), and Ibn Hibban (1215)."
  },
  "importantWords": [
    {
      "arabic": "سَرَارِيَنَا",
      "english": "Our slave-girls",
      "urdu": "ہماری لونڈیاں"
    },
    {
      "arabic": "أُمَّهَاتِ اَلْأَوْلَادِ",
      "english": "Mothers of children",
      "urdu": "وہ لونڈیاں جن سے اولاد ہو جائے"
    },
    {
      "arabic": "حَيٌّ",
      "english": "Alive",
      "urdu": "زندہ"
    },
    {
      "arabic": "بَأْسًا",
      "english": "Harm / Objection",
      "urdu": "حرج / قباحت"
    },
    {
      "arabic": "نَبِيعُ",
      "english": "We sell",
      "urdu": "ہم بیچتے تھے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ عہدِ نبوی میں ابتداً ام ولد لونڈیوں کی خرید و فروخت جائز تھی، تاہم بعد میں حضرت عمر کے دور میں اس پر پابندی لگا دی گئی۔",
    "english": "This Hadith shows that initially, selling slave-girls who had borne children was practiced during the Prophet's time, though it was later restricted during Umar's caliphate."
  },
  "references": [
    {
      "arabic": "رواه النسائي (4668)",
      "english": "Reported by An-Nasa'i (4668)"
    },
    {
      "arabic": "رواه ابن ماجه (2517)",
      "english": "Reported by Ibn Majah (2517)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=N4X8Z6nOqV0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ام ولد کی شرعی حیثیت",
        "english": "Legal Status of Umm al-Walad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ام ولد کی تعریف",
              "english": "Definition of Umm al-Walad"
            },
            "content": {
              "urdu": [
                "ام ولد اس لونڈی کو کہا جاتا ہے جس کے بطن سے اس کے مالک کی اولاد پیدا ہو جائے۔",
                "اسلامی قانون میں ایسی لونڈی کو ایک خاص مقام حاصل ہوتا ہے۔",
                "مالک کی وفات کے بعد وہ خود بخود آزاد ہو جاتی ہے۔"
              ],
              "english": [
                "Umm al-Walad refers to a slave-girl who bears a child for her master.",
                "Under Islamic law, such a woman attains a special legal status.",
                "She becomes automatically free upon the death of her master."
              ]
            }
          },
          {
            "title": {
              "urdu": "عہدِ نبوی کا عمل",
              "english": "Practice During the Prophetic Era"
            },
            "content": {
              "urdu": [
                "حضرت جابر کی روایت بتاتی ہے کہ اس وقت ان کی فروخت عام تھی۔",
                "صحابہ کرام اسے جائز سمجھتے تھے کیونکہ اس پر صریح ممانعت نہیں آئی تھی۔",
                "یہ حکم تدریجی اصلاحات کا حصہ تھا جو غلامی کے خاتمے کی طرف ایک قدم تھا۔"
              ],
              "english": [
                "The narration of Jabir indicates that their sale was common at that time.",
                "The companions considered it permissible as no explicit prohibition had arrived.",
                "This ruling was part of gradual reforms leading towards the end of slavery."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حضرت عمر کا فیصلہ اور اجماع",
        "english": "Umar's Decision and Consensus"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فروخت پر پابندی",
              "english": "Prohibition of Sale"
            },
            "content": {
              "urdu": [
                "حضرت عمر رضی اللہ عنہ نے اپنے دورِ خلافت میں ام ولد کی فروخت سے منع فرمایا۔",
                "انہوں نے صحابہ سے مشورہ کیا اور یہ طے کیا کہ اسے بیچا نہیں جائے گا۔",
                "اس فیصلے کا مقصد اولاد کے حقوق کا تحفظ اور ماں کی تکریم تھا۔"
              ],
              "english": [
                "Umar (R.A) prohibited the sale of Umm al-Walad during his caliphate.",
                "He consulted the companions and established that they should not be sold.",
                "The aim of this decision was to protect the children's rights and honor the mother."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا اتفاق",
              "english": "Consensus of the Companions"
            },
            "content": {
              "urdu": [
                "تمام جلیل القدر صحابہ نے حضرت عمر کے اس فیصلے کو قبول کر لیا۔",
                "جمہور ائمہ بشمول امام ابو حنیفہ، مالک اور شافعی اسی پر عمل پیرا ہیں۔",
                "یہ اجماعِ صحابہ کی ایک اہم مثال ہے جسے شرعی حجت مانا جاتا ہے۔"
              ],
              "english": [
                "All major companions accepted this administrative decision by Umar (R.A).",
                "The majority of Imams, including Abu Hanifa, Malik, and Shafi'i, follow this.",
                "This is a key example of the Consensus of Companions, a source of Sharia law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمتیں",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کا استحکام",
              "english": "Stability of the Family System"
            },
            "content": {
              "urdu": [
                "ام ولد کو بیچنے سے اس کے بچے کی پرورش اور تربیت متاثر ہو سکتی تھی۔",
                "اسلام نے ماں اور بچے کے درمیان تعلق کو برقرار رکھنے کو ترجیح دی۔",
                "اس حکم سے خاندانی وحدت اور سماجی ڈھانچہ مضبوط ہوا۔"
              ],
              "english": [
                "Selling Umm al-Walad could harm the upbringing and care of her child.",
                "Islam prioritized maintaining the bond between a mother and her child.",
                "This ruling strengthened family unity and the social structure."
              ]
            }
          },
          {
            "title": {
              "urdu": "آزادی کی طرف سفر",
              "english": "Journey Towards Freedom"
            },
            "content": {
              "urdu": [
                "فروخت کی ممانعت سے ام ولد کی آزادی یقینی ہو گئی کیونکہ اب وہ صرف مالک کی ملکیت تھی۔",
                "مالک کے مرتے ہی وہ آزاد ہو جاتی، جس سے غلامی کا دائرہ تنگ ہوا۔",
                "یہ شریعت کے ان مقاصد میں سے ہے جو بتدریج انسانی حقوق کو بحال کرتے ہیں۔"
              ],
              "english": [
                "Prohibiting the sale ensured her freedom, as she remained only with the master.",
                "She became free upon the master's death, narrowing the scope of slavery.",
                "This aligns with Sharia's objectives of gradually restoring human rights."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصولی مباحث",
        "english": "Fundamental Discussions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نسخ اور تبدیلی",
              "english": "Abrogation and Change"
            },
            "content": {
              "urdu": [
                "اس حدیث سے معلوم ہوتا ہے کہ بعض احکام ضرورت کے تحت واضح کیے گئے۔",
                "حضرت عمر کا فعل دراصل سنتِ نبوی کی روح کے مطابق اصلاح تھی۔",
                "یہ قانون سازی میں اجتہاد اور مصلحتِ عامہ کی اہمیت کو واضح کرتا ہے۔"
              ],
              "english": [
                "This Hadith shows that some rulings were clarified based on necessity.",
                "Umar's action was an enhancement aligned with the spirit of Prophetic Sunnah.",
                "It highlights the importance of Ijtihad and public interest in legislation."
              ]
            }
          },
          {
            "title": {
              "urdu": "انسانی وقار کا تحفظ",
              "english": "Protection of Human Dignity"
            },
            "content": {
              "urdu": [
                "اولاد کی ماں ہونے کے ناطے اسے ایک عام شے کی طرح بیچنا نامناسب تھا۔",
                "اسلام نے بتدریج ان کے حقوق کو تسلیم کر کے انہیں معاشرے کا حصہ بنایا۔",
                "آج کے دور میں یہ حدیث انسانی حقوق اور خاندانی تحفظ کی بنیاد فراہم کرتی ہے۔"
              ],
              "english": [
                "Being the mother of a child, selling her like common goods was inappropriate.",
                "Islam gradually recognized their rights and integrated them into society.",
                "In the modern era, this Hadith provides a basis for human rights and family protection."
              ]
            }
          }
        ]
      }
    }
  ]
}