{
  "hadithId": 385,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-385"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه الترمذي (802)‏، وأخرجه أبو داود (2324) من حديث أبي هريرة بلفظ: الصوم يوم تصومون... الحديث. وهو حديث صحيح بمجموع طرقه.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ترمذی (802) نے روایت کیا ہے۔ اگرچہ اس سند میں کلام ہے، لیکن ابوہریرہ رضی اللہ عنہ کی شاہد روایت جو ابوداؤد (2324) میں ہے، اس کی تقویت کرتی ہے۔",
    "english": "Sahih. Reported by At-Tirmidhi (802). While this specific chain has some discussion, it is strengthened by the narration of Abu Hurairah in Abu Dawud (2324) with similar meaning, making it authentic overall."
  },
  "importantWords": [
    {
      "arabic": "الْفِطْرُ",
      "english": "Breaking the fast / Eid-ul-Fitr",
      "urdu": "افطار کرنا / عید الفطر"
    },
    {
      "arabic": "الْأَضْحَى",
      "english": "Sacrifice / Eid-ul-Adha",
      "urdu": "قربانی کرنا / عید الاضحی"
    },
    {
      "arabic": "يُفْطِرُ",
      "english": "Break fast",
      "urdu": "افطار کرتے ہیں"
    },
    {
      "arabic": "يُضَحِّي",
      "english": "Offer sacrifice",
      "urdu": "قربانی دیتے ہیں"
    },
    {
      "arabic": "النَّاسُ",
      "english": "The people / Community",
      "urdu": "لوگ / معاشرہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مفہوم یہ ہے کہ عیدین کا تعین انفرادی طور پر نہیں بلکہ اجتماعی طور پر پوری امت یا بستی کے لوگوں کے ساتھ مل کر کیا جائے گا۔",
    "english": "This Hadith emphasizes that the dates for Eid-ul-Fitr and Eid-ul-Adha are determined by the collective action and consensus of the community, not individual decisions."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (802)",
      "english": "Sunan At-Tirmidhi (802)"
    },
    {
      "arabic": "سنن أبي داود (2324)",
      "english": "Sunan Abu Dawud (2324)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=explanation+hadith+eid+day+people+fast+urdu",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Sahih lighairihi (Authentic due to supporting evidences)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اجتماعیت کی اہمیت",
        "english": "Importance of Collectivity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماعت کے ساتھ اتفاق",
              "english": "Agreement with the Community"
            },
            "content": {
              "urdu": [
                "اسلام مسلمانوں کو اتحاد اور اجتماعیت کا درس دیتا ہے۔",
                "عید جیسے بڑے تہواروں میں اکیلے فیصلہ کرنے کے بجائے جماعت کی پیروی کرنی چاہیے۔",
                "اس سے امت میں انتشار اور تفرقہ بازی کا خاتمہ ہوتا ہے۔"
              ],
              "english": [
                "Islam teaches Muslims the lesson of unity and collectivity.",
                "On major festivals like Eid, one should follow the community instead of individual decisions.",
                "This eliminates discord and sectarianism within the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "انفرادی رویت کا حکم",
              "english": "Ruling on Individual Sighting"
            },
            "content": {
              "urdu": [
                "اگر کوئی اکیلا چاند دیکھ لے لیکن حکومت اعلان نہ کرے تو اسے جماعت کا ساتھ دینا چاہیے۔",
                "حدیث کے الفاظ 'جس دن لوگ افطار کریں' اسی اصول کی طرف اشارہ کرتے ہیں۔",
                "انفرادی علم پر اجتماعی مصلحت کو ترجیح دی گئی ہے۔"
              ],
              "english": [
                "If an individual sights the moon but the authorities do not announce it, they should follow the group.",
                "The wording 'the day people break fast' points to this very principle.",
                "Collective welfare is prioritized over individual knowledge in such public matters."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلطی کا ازالہ",
              "english": "Remedy for Mistakes"
            },
            "content": {
              "urdu": [
                "اگر پوری بستی غلطی سے کسی دوسرے دن عید منا لے تو وہ قابل قبول ہے۔",
                "اللہ تعالیٰ نے اجتماعی طور پر کی گئی کوشش میں برکت اور معافی رکھی ہے۔",
                "یہ اصول روزمرہ کے شرعی معاملات میں آسانی پیدا کرتا ہے۔"
              ],
              "english": [
                "If the entire community celebrates Eid on a different day by mistake, it is acceptable.",
                "Allah has placed blessing and forgiveness in collective efforts.",
                "This principle facilitates ease in daily Sharia-related matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "قربانی کا وقت",
              "english": "Time of Sacrifice"
            },
            "content": {
              "urdu": [
                "عید الاضحی کا تعلق بھی لوگوں کے اکٹھے قربانی کرنے سے ہے۔",
                "جب تک عید کی نماز اور لوگوں کا عام رواج شروع نہ ہو، قربانی درست نہیں۔",
                "یہ عمل مسلمانوں کی شان و شوکت اور یکجہتی کا مظہر ہے۔"
              ],
              "english": [
                "Eid-ul-Adha is also tied to the people offering sacrifices together.",
                "Sacrifice is not valid until the Eid prayer and the general custom of the people begin.",
                "This act manifests the glory and solidarity of the Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اثرات",
        "english": "Social Impacts"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تفرقہ بازی سے بچاؤ",
              "english": "Avoiding Sectarianism"
            },
            "content": {
              "urdu": [
                "ایک ہی شہر میں دو الگ الگ دن عید منانا سنت کے خلاف ہے۔",
                "یہ حدیث ہمیں ایک پلیٹ فارم پر جمع ہونے کی ترغیب دیتی ہے۔",
                "معاشرتی ہم آہنگی کے لیے شرعی احکام پر عمل پیرا ہونا ضروری ہے۔"
              ],
              "english": [
                "Celebrating Eid on two different days in the same city is against the Sunnah.",
                "This Hadith encourages us to gather on a single platform.",
                "Adhering to Sharia rulings is essential for social harmony."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی پاسداری",
              "english": "Upholding Discipline"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرے میں نظم و ضبط برقرار رکھنا ایمان کا حصہ ہے۔",
                "عیدین کے ایام کا تعین نظم و ضبط کی بہترین مثال ہے۔",
                "امیر یا کمیٹی کے فیصلے کا احترام کرنا معاشرتی استحکام کا باعث ہے۔"
              ],
              "english": [
                "Maintaining discipline in an Islamic society is part of faith.",
                "The determination of Eid days is a prime example of such discipline.",
                "Respecting the decision of the leader or committee leads to social stability."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بندگی کا مفہوم",
              "english": "Concept of Servitude"
            },
            "content": {
              "urdu": [
                "بندگی کا مطلب اپنی مرضی چھوڑ کر اللہ کے حکم کی پیروی کرنا ہے۔",
                "روزہ رکھنا اور افطار کرنا دونوں اللہ کی رضا کے لیے ہونے چاہئیں۔",
                "عید منانا بھی ایک عبادت ہے جسے سنت کے مطابق ادا کرنا چاہیے۔"
              ],
              "english": [
                "Servitude means leaving one's own will to follow Allah's command.",
                "Both fasting and breaking the fast should be for the sake of Allah.",
                "Celebrating Eid is also a form of worship that must be performed according to Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ کی تعلیمات ہر دور کے لیے مشعلِ راہ ہیں۔",
                "اس حدیث سے ہمیں زندگی کے ہر شعبے میں اعتدال کی تعلیم ملتی ہے۔",
                "دین کو سمجھنے کے لیے مستند احادیث کا مطالعہ ناگزیر ہے۔"
              ],
              "english": [
                "The teachings of the Messenger of Allah (ﷺ) are a guiding light for every era.",
                "This Hadith teaches us moderation in every aspect of life.",
                "Studying authentic Hadiths is indispensable for understanding religion."
              ]
            }
          }
        ]
      }
    }
  ]
}
