{
  "hadithId": 1296,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["muslim:2587"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب البر والصلة والآداب",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2587)، وأبو داود (4894)، والترمذي (1981)، وأحمد (7201).",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (2587) نے اسے روایت کیا ہے۔ اس کا مطلب یہ ہے کہ لڑائی کی ابتدا کرنے والا ہی اصل مجرم ہے جب تک دوسرا فریق بدلہ لیتے ہوئے حد سے نہ گزر جائے۔",
    "english": "Sahih (Authentic). Reported by Muslim (2587), Abu Dawud (4894), and At-Tirmidhi (1981). It establishes that the primary burden of sin lies with the initiator of the verbal abuse."
  },
  "importantWords": [
    {
      "arabic": "الْمُسْتَبَّانِ",
      "english": "The two who abuse each other",
      "urdu": "دو گالی دینے والے"
    },
    {
      "arabic": "الْبَادِئِ",
      "english": "The one who starts",
      "urdu": "ابتداء کرنے والا"
    },
    {
      "arabic": "يَعْتَدِ",
      "english": "Transgresses / Oversteps",
      "urdu": "زیادتی کرے / حد پار کرے"
    },
    {
      "arabic": "الْمَظْلُومُ",
      "english": "The oppressed / The wronged",
      "urdu": "مظلوم"
    },
    {
      "arabic": "مَا قَالَا",
      "english": "Whatever they both said",
      "urdu": "جو کچھ ان دونوں نے کہا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ زبانی لڑائی میں گناہ کا بوجھ اس شخص پر ہوتا ہے جس نے پہل کی، بشرطیکہ دوسرا فریق جواب دیتے ہوئے حد سے نہ بڑھے۔",
    "english": "This Hadith clarifies that in a verbal dispute, the initiator bears the responsibility for the sin unless the victim exceeds the limits of equivalent response."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2587)",
      "english": "Sahih Muslim (2587)"
    },
    {
      "arabic": "سنن أبي داود (4894)",
      "english": "Sunan Abu Dawud (4894)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9NOnXh6g5U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ابتداء کرنے والے کی ذمہ داری",
        "english": "Responsibility of the Initiator"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتنہ کی جڑ",
              "english": "The Root of Discord"
            },
            "content": {
              "urdu": [
                "جو شخص لڑائی یا گالی گلوچ کی ابتدا کرتا ہے وہ شر کا دروازہ کھولتا ہے۔",
                "اسلام میں پہل کرنے والے کو زیادہ گناہگار قرار دیا گیا ہے کیونکہ اسی نے فتنہ اٹھایا۔",
                "اگر ابتدا کرنے والا خاموش رہتا تو لڑائی کی نوبت ہی نہ آتی۔"
              ],
              "english": [
                "The person who starts the abuse opens the door to evil and conflict.",
                "In Islam, the initiator is considered more sinful for inciting the fitnah.",
                "Had the initiator remained silent, the dispute would never have occurred."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہ کا بوجھ",
              "english": "The Burden of Sin"
            },
            "content": {
              "urdu": [
                "دونوں فریقوں کے کہے ہوئے برے کلمات کا بوجھ ابتدا کرنے والے پر پڑتا ہے۔",
                "یہ اس وقت تک ہے جب تک مظلوم صرف برابر کا جواب دے یا خاموش رہے۔",
                "ابتدا کرنا اخلاقی پستی اور بے صبری کی علامت ہے۔"
              ],
              "english": [
                "The burden of all abusive words said by both parties falls on the initiator.",
                "This applies as long as the victim responds proportionately or remains silent.",
                "Initiating abuse is a sign of moral degradation and lack of patience."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مظلوم کے لیے حدود",
        "english": "Limits for the Oppressed"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برابر کا بدلہ",
              "english": "Equivalent Retaliation"
            },
            "content": {
              "urdu": [
                "مظلوم کو اجازت ہے کہ وہ اتنی ہی بات کہے جتنی اسے کہی گئی ہے۔",
                "برائی کا بدلہ اسی جیسی برائی سے دینا عدل کے زمرے میں آتا ہے۔",
                "مگر بہتر یہی ہے کہ انسان خاموشی اختیار کرے اور اللہ پر معاملہ چھوڑ دے۔"
              ],
              "english": [
                "The wronged person is permitted to respond only to the extent they were abused.",
                "Responding to an evil with a similar response falls under the category of justice.",
                "However, it is superior to remain silent and leave the matter to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "زیادتی کی ممانعت",
              "english": "Prohibition of Transgression"
            },
            "content": {
              "urdu": [
                "اگر مظلوم جواب دیتے ہوئے گالیوں میں حد سے بڑھ جائے تو وہ بھی گناہگار ہوگا۔",
                "حد سے گزر جانے کی صورت میں ابتدا کرنے والا بری الذمہ ہو جاتا ہے اور بوجھ مظلوم پر آتا ہے۔",
                "اپنے دفاع میں بھی اخلاقی اقدار کو پامال نہیں کرنا چاہیے۔"
              ],
              "english": [
                "If the victim exceeds the limit in their response, they also become a sinner.",
                "By overstepping, the initiator is relieved of the extra burden, and it shifts to the transgressor.",
                "Even in self-defense, one must not violate moral and ethical values."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح",
        "english": "Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرت میں گالی گلوچ اور بدزبانی کی کوئی جگہ نہیں ہے۔",
                "زبان کا کنٹرول انسان کو بہت سے فتنوں اور گناہوں سے بچاتا ہے۔",
                "مومن کی زبان ہمیشہ پاک اور شائستہ ہونی چاہیے۔"
              ],
              "english": [
                "There is no place for verbal abuse or foul language in an Islamic society.",
                "Controlling the tongue saves a person from numerous trials and sins.",
                "A believer's tongue should always remain pure and polite."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبر اور درگزر",
              "english": "Patience and Forgiveness"
            },
            "content": {
              "urdu": [
                "کسی کی بدتمیزی پر خاموش رہنا بہت بڑی بہادری ہے۔",
                "معاف کر دینے سے اللہ کے ہاں درجات بلند ہوتے ہیں۔",
                "غصے کو پی جانا اور جواب نہ دینا اعلیٰ اخلاق کی پہچان ہے۔"
              ],
              "english": [
                "Remaining silent in the face of someone's rudeness is true bravery.",
                "Forgiving others elevates one's status in the sight of Allah.",
                "Suppressing anger and not retaliating is the hallmark of high character."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اشتعال انگیزی سے بچاؤ",
              "english": "Avoiding Provocation"
            },
            "content": {
              "urdu": [
                "کبھی بھی کسی کے خلاف ایسی بات نہ کہیں جو لڑائی کا سبب بنے۔",
                "اگر کوئی اشتعال دلائے تو اسے نظر انداز کر دینا دانشمندی ہے۔",
                "اپنے عمل سے معاشرے میں امن و سکون کو فروغ دیں۔"
              ],
              "english": [
                "Never say anything against others that could trigger a conflict.",
                "Ignoring provocation is a sign of wisdom and maturity.",
                "Promote peace and tranquility in society through your personal actions."
              ]
            }
          },
          {
            "title": {
              "urdu": "محاسبہ نفس",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "اپنی گفتگو کا روزانہ جائزہ لیں کہ کہیں ہم ابتدا کرنے والے تو نہیں۔",
                "اگر نادانستہ کسی کی دل آزاری ہوئی ہو تو فوراً معافی مانگیں۔",
                "قیامت کے دن زبان کا ایک ایک لفظ حساب میں آئے گا۔"
              ],
              "english": [
                "Review your speech daily to ensure you are not the initiator of harm.",
                "If you unintentionally hurt someone, seek their forgiveness immediately.",
                "Every single word of the tongue will be accounted for on Judgment Day."
              ]
            }
          }
        ]
      }
    }
  ]
}