{
  "hadithId": 124,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["1:124"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "صحيح مرفوعا.  باللفظ الذي ذكره الحافظ فقط.  رواه أبو داود (264) ، والنسائي (153) ، والترمذي (136) ، وابن ماجه (640) ، وأحمد (172) ، والحاكم (172) . وقد ذهب جماعة من العلماء إلى ترجيح وقفه، ولكن المحققون منهم، كابن حبان والحاكم، صححوا رفعه.",
    "urdu": "صحیح مرفوع (نبی ﷺ سے منسوب)۔ صرف اس لفظ کے ساتھ جسے حافظ (ابن حجر) نے ذکر کیا ہے۔ اسے ابو داؤد (264)، نسائی (153)، ترمذی (136)، ابن ماجہ (640)، احمد (172)، اور حاکم (172) نے روایت کیا ہے۔ علماء کی ایک جماعت نے اس کو موقوف (صحابی کا قول) قرار دیا ہے، لیکن ابن حبان اور حاکم جیسے محققین نے اس کے مرفوع ہونے کو صحیح قرار دیا ہے۔",
    "english": "Sahih Marfu' (Authentic, traced back to the Prophet). Only with the wording mentioned by Al-Hafiz (Ibn Hajar). Reported by Abu Dawud (264), An-Nasa'i (153), At-Tirmidhi (136), Ibn Majah (640), Ahmad (172), and Al-Hakim (172). A group of scholars preferred it to be Mawquf, but leading verification scholars like Ibn Hibban and Al-Hakim authenticated its Marfu' status."
  },
  "importantWords": [
    {
      "arabic": "يَأْتِي اِمْرَأَتَهُ",
      "english": "Has sexual intercourse with his wife",
      "urdu": "اپنی بیوی کے پاس جائے"
    },
    {
      "arabic": "وَهِيَ حَائِضٌ",
      "english": "While she is menstruating",
      "urdu": "جبکہ وہ حائضہ ہو"
    },
    {
      "arabic": "يَتَصَدَّقُ",
      "english": "He gives charity",
      "urdu": "وہ صدقہ و خیرات کرے"
    },
    {
      "arabic": "بِدِينَارٍ",
      "english": "With a Dinar (gold coin)",
      "urdu": "ایک دینار"
    },
    {
      "arabic": "نِصْفِ دِينَارٍ",
      "english": "Half a Dinar",
      "urdu": "آدھا دینار"
    },
    {
      "arabic": "رَجَّحَ",
      "english": "Preferred",
      "urdu": "ترجیح دی"
    },
    {
      "arabic": "وَقْفَه",
      "english": "Its Mawquf status",
      "urdu": "اس کا موقوف ہونا"
    }
  ],
  "summary": {
    "urdu": "نبی اکرم ﷺ نے حکم دیا کہ اگر کوئی شخص اپنی بیوی سے حالت حیض میں جماع کر لے تو اسے کفارہ کے طور پر ایک دینار یا نصف دینار صدقہ کرنا چاہیے۔ یہ حکم گناہ کی تلافی اور اس ممنوع فعل کی سنگینی کو ظاہر کرتا ہے۔",
    "english": "The Prophet ﷺ commanded that if a man has sexual intercourse with his wife during her menses, he must give a Dinar or half a Dinar in charity as an expiation (Kaffarah). This ruling highlights the severity of the prohibited act and provides a way for atonement."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (264)",
      "english": "Reported by Abu Dawud (264)"
    },
    {
      "arabic": "رواه الترمذي (136)",
      "english": "Reported by At-Tirmidhi (136)"
    },
    {
      "arabic": "صَحَّحَهُ اَلْحَاكِمُ",
      "english": "Authenticated by Al-Hakim"
    }
  ],
  "narrators": [
    {
      "id": 12401,
      "name": {
        "arabic": "عَبْدُ اَللَّهِ بْنُ عَبَّاسٍ",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح مرفوعاً",
    "english": "Authentic Marfu'"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیض میں جماع کا کفارہ",
        "english": "Expiation for Intercourse During Menses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرام فعل اور کفارہ",
              "english": "Prohibited Act and Expiation"
            },
            "content": {
              "urdu": [
                "حیض میں جماع کرنا حرام ہے، اور اس حدیث میں اس گناہ کی تلافی کے لیے کفارہ مقرر کیا گیا ہے۔",
                "کفارہ میں ایک دینار یا نصف دینار صدقہ کرنے کا اختیار دیا گیا ہے جو حیض کے دورانیے پر مبنی ہے۔",
                "یہ حکم اس بات پر زور دیتا ہے کہ اللہ کی حدود کو توڑنے پر توبہ کے ساتھ ساتھ مالی قربانی بھی ضروری ہے۔"
              ],
              "english": [
                "Sexual intercourse during menses is forbidden, and this Hadith prescribes an expiation for this sin.",
                "The Kaffarah (expiation) gives the option of donating a Dinar or half a Dinar, depending on the stage of the menses.",
                "This ruling emphasizes that breaking Allah's boundaries requires financial sacrifice along with repentance."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینار اور نصف دینار کا فرق",
              "english": "Difference Between Dinar and Half a Dinar"
            },
            "content": {
              "urdu": [
                "فقہاء نے اس اختلاف کی وضاحت میں کہا ہے کہ ایک دینار اس وقت ہے جب جماع حیض کے آغاز میں ہو (جب خون زیادہ ہوتا ہے)۔",
                "نصف دینار اس وقت ہے جب جماع حیض کے اختتام کے قریب ہو (جب خون کم ہو چکا ہو)۔",
                "ایک دینار تقریباً 4.25 گرام خالص سونا ہوتا ہے، جو مالی کفارے کی اہمیت کو واضح کرتا ہے۔"
              ],
              "english": [
                "Jurists explained this option by saying a Dinar is required if intercourse occurs at the beginning of menses (when bleeding is heavy).",
                "Half a Dinar is required if intercourse occurs near the end of menses (when bleeding is less).",
                "One Dinar is equivalent to approximately $4.25$ grams of pure gold, highlighting the gravity of the financial expiation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی حیثیت اور حکم",
        "english": "Status of the Chain and the Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مرفوع اور موقوف کا اختلاف",
              "english": "Disagreement on Marfu' and Mawquf"
            },
            "content": {
              "urdu": [
                "اس روایت کو بعض محدثین نے نبی ﷺ سے مرفوع اور بعض نے ابن عباس کا موقوف قول قرار دیا ہے۔",
                "حاکم اور ابن قطان جیسے محققین کے نزدیک یہ قول مرفوع اور صحیح ہے، اور فقہی حکم کا مستند ذریعہ ہے۔",
                "ایسے مسائل جن میں کفارہ مقرر ہو، وہ عام طور پر قیاس پر مبنی نہیں ہوتے، لہٰذا مرفوع کا حکم غالب ہے۔"
              ],
              "english": [
                "Some Hadith scholars deemed this narration Marfu' (from the Prophet ﷺ), while others considered it Mawquf (statement of Ibn Abbas).",
                "According to verification scholars like Al-Hakim and Ibn Al-Qattan, the statement is Marfu' and Sahih, making it an authentic source for the legal ruling.",
                "Rulings that prescribe expiation are typically not based on analogy (Qiyas), thus supporting the Marfu' status."
              ]
            }
          },
          {
            "title": {
              "urdu": "تمام سنت کا مجموعہ",
              "english": "Total Sunnah Compilation"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حدیث کفارے کو واضح کرتی ہے، یہ جماع کی حرمت کے حکم کی تائید ہے۔",
                "یہ امت کے لیے اللہ کی رحمت ہے کہ گناہ کے بعد توبہ اور کفارے کا دروازہ کھلا رکھا گیا۔",
                "کفارے کا مقصد غریبوں کی مدد اور گناہ کے بوجھ کو ہلکا کرنا ہے۔"
              ],
              "english": [
                "Although this Hadith clarifies the expiation, it affirms the ruling on the prohibition of intercourse during menses.",
                "It is Allah's mercy upon the Ummah that the door of repentance and expiation is kept open after the sin.",
                "The expiation aims to help the poor and lessen the burden of the sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیض کا احترام",
              "english": "Respect for Menses"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسلمانوں کو حیض کے احکام کی سنگینی اور ان کا احترام سکھاتی ہے۔",
                "حیض کے دنوں میں مکمل احتیاط ضروری ہے تاکہ کسی قسم کی شرعی خلاف ورزی نہ ہو۔",
                "میاں بیوی کو چاہیے کہ وہ اپنی ازدواجی زندگی کو شرعی حدود کے اندر رکھیں۔"
              ],
              "english": [
                "This Hadith teaches Muslims the seriousness of the menses rulings and the need to respect them.",
                "Complete caution is necessary during the days of menses to avoid any religious violation.",
                "Spouses must ensure that their marital life remains within the bounds of Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفارے کی ادائیگی",
              "english": "Fulfilling the Expiation"
            },
            "content": {
              "urdu": [
                "اگر بھول چوک سے یا جہالت میں کوئی یہ گناہ کر لے تو فوراً توبہ کرے اور کفارہ ادا کرے۔",
                "حنفی فقہاء نے اس حدیث کو مستحب (پسندیدہ) قرار دیا ہے، جبکہ شافعی اور حنبلی فقہاء نے اسے واجب قرار دیا ہے۔",
                "صدقہ غریبوں کے حق میں ہوتا ہے اور اس کی ادائیگی جلد از جلد کرنی چاہیے۔"
              ],
              "english": [
                "If someone commits this sin by mistake or in ignorance, they must immediately repent and pay the expiation.",
                "Hanafi jurists deemed this Hadith Mustahab (recommended), while Shafi'i and Hanbali jurists considered it Wajib (obligatory).",
                "The charity is for the benefit of the poor and should be paid as soon as possible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور روحانی پہلو",
        "english": "Ethical and Spiritual Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معافی کی امید",
              "english": "Hope for Forgiveness"
            },
            "content": {
              "urdu": [
                "کفارے کا حکم ہونے کے باوجود، اللہ تعالیٰ کی رحمت سے معافی کی امید رہتی ہے۔",
                "گناہ کے بعد شرعی حکم پر عمل کرنا، سچی توبہ اور نیکی کی طرف رجوع کا ذریعہ ہے۔",
                "اس حکم کا مقصد بندے کی اصلاح اور گناہ کے احساس کو زندہ رکھنا ہے۔"
              ],
              "english": [
                "Despite the command for expiation, there remains hope for Allah's forgiveness through His mercy.",
                "Adhering to the legal ruling after a sin is a means of sincere repentance and turning back to goodness.",
                "The purpose of this ruling is the reformation of the person and keeping the awareness of the sin alive."
              ]
            }
          },
          {
            "title": {
              "urdu": "نجاست سے احتیاط",
              "english": "Caution from Impurity"
            },
            "content": {
              "urdu": [
                "حیض کے خون میں جماع کے سخت حکم کی وجہ اس خون کی نجاست اور اس کا طبعی نقصان ہے۔",
                "یہ حکم ہمیں سکھاتا ہے کہ طہارت اور نجاست کے احکام کی پاسداری بہت ضروری ہے۔",
                "میاں بیوی کے لیے ضروری ہے کہ وہ طہارت کے ان اہم احکام کو سیکھیں۔"
              ],
              "english": [
                "The severe ruling for intercourse during menses is due to the impurity of the blood and its potential physical harm.",
                "This ruling teaches us that adherence to the laws of purity and impurity is crucial.",
                "It is necessary for spouses to learn these important rulings concerning purification."
              ]
            }
          }
        ]
      }
    }
  ]
}
