{
  "hadithId": 233,
  "hadithNo": 24,
  "hadithReferences": {
    "sunnah.com": ["Sahih Muslim 477"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه مسلم ( 477 )‏ .‏ هذا الذكر هو من أطول وأشمل الأذكار التي تقال بعد الرفع من الركوع، وهو ثابت في صلاة النبي صلى الله عليه وسلم.",
    "urdu": "صحیح روایت۔ اسے مسلم (477) نے روایت کیا ہے۔ یہ ذکر رکوع سے اٹھنے کے بعد کے اذکار میں سب سے طویل اور جامع ہے، اور یہ نبی اکرم ﷺ کی نماز میں ثابت شدہ ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim (477). This remembrance is one of the longest and most comprehensive supplications recited after rising from Ruku', and it is firmly established in the prayer of the Prophet (ﷺ)."
  },
  "importantWords": [
    {
      "arabic": "مِلْءَ اَلسَّمَوَاتِ",
      "english": "Filling the heavens",
      "urdu": "آسمانوں کو بھر دے"
    },
    {
      "arabic": "أَهْلَ اَلثَّنَاءِ",
      "english": "Worthy of praise",
      "urdu": "ثناء کا مالک"
    },
    {
      "arabic": "اَلْمَجْدِ",
      "english": "Glory/Greatness",
      "urdu": "بزرگی"
    },
    {
      "arabic": "لَا مَانِعَ",
      "english": "None to withhold",
      "urdu": "کوئی روکنے والا نہیں"
    },
    {
      "arabic": "لَا مُعْطِيَ",
      "english": "None to give",
      "urdu": "کوئی دینے والا نہیں"
    },
    {
      "arabic": "ذَا اَلْجَدِّ",
      "english": "The possessor of fortune/grandeur",
      "urdu": "بزرگی والا"
    },
    {
      "arabic": "اَلْجَدُّ",
      "english": "Fortune/Luck/Grandeur",
      "urdu": "بخت یا بزرگی"
    }
  ],
  "summary": {
    "urdu": "نبی اکرم ﷺ رکوع سے اٹھ کر یہ جامع دعا پڑھتے تھے، جو اللہ کی لامحدود حمد و ثنا پر مشتمل ہے اور اس کے بعد اس کی حاکمیت، بادشاہت اور مطلق قدرت کا اقرار ہے۔ یہ دعا اس بات کا اعتراف ہے کہ عزت، مال یا دنیاوی طاقت اللہ کے مقابلے میں کوئی فائدہ نہیں دے سکتی۔",
    "english": "The Prophet (ﷺ) would recite this comprehensive supplication upon rising from Ruku', consisting of boundless praise and glorification of Allah, followed by an affirmation of His absolute sovereignty, dominion, and power. It acknowledges that worldly fortune or grandeur is useless against the will and punishment of Allah."
  },
  "references": [
    {
      "arabic": "رواه مسلم (477)",
      "english": "Reported by Muslim (477)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0f-l8tP8oQ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حمد کی وسعت اور مقدار",
        "english": "Scope and Magnitude of Praise"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسمان و زمین کے برابر حمد",
              "english": "Praise Filling the Heavens and Earth"
            },
            "content": {
              "urdu": [
                "اس دعا میں اللہ کی حمد اس قدر وسیع پیمانے پر کی گئی ہے جو آسمان و زمین کو بھر دے۔",
                "یہ اللہ کے کمالات کے لائق حمد کی مقدار کو بیان کرنے کی ایک استعاراتی کوشش ہے۔",
                "یہ تعبیر بندے کی طرف سے اللہ کے عظمت کے اعتراف کی انتہائی شکل ہے۔"
              ],
              "english": [
                "In this supplication, Allah's praise is sought on a scale vast enough to fill the heavens and the earth.",
                "This is a metaphorical attempt to express the magnitude of praise worthy of Allah’s perfect attributes.",
                "This expression is the highest form of acknowledgment of Allah's greatness from a servant."
              ]
            }
          },
          {
            "title": {
              "urdu": "لا محدود حمد کا اقرار",
              "english": "Affirmation of Boundless Praise"
            },
            "content": {
              "urdu": [
                "حمد کا دائرہ آسمان و زمین سے باہر ہر وہ چیز بھی ہے جسے اللہ چاہے کہ وہ بھر جائے۔",
                "اس سے ظاہر ہوتا ہے کہ بندے کی حمد اللہ کے جلال کے مقابلے میں کبھی کم نہیں ہو سکتی۔",
                "یہ اعتراف اللہ کی کامل حاکمیت اور عظمت کے سامنے عاجزی کی علامت ہے۔"
              ],
              "english": [
                "The scope of praise extends beyond the heavens and earth to fill everything else Allah wills.",
                "This shows that the servant's praise can never fully encompass the glory of Allah's majesty.",
                "This affirmation symbolizes humility before Allah's complete sovereignty and greatness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کی حاکمیت کا بیان",
        "english": "Declaration of Allah's Sovereignty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عطا اور منع پر مکمل اختیار",
              "english": "Absolute Authority in Giving and Withholding"
            },
            "content": {
              "urdu": [
                "دعا کا یہ حصہ 'لَا مَانِعَ لِمَا أَعْطَيْتَ...' اللہ کی کامل قدرت اور وحدانیت کا اقرار ہے۔",
                "اس بات کا یقین کہ تمام خیر و شر کا سرچشمہ صرف اللہ کی ذات ہے۔",
                "یہ اقرار مومن کو دنیاوی کامیابی یا ناکامی میں صرف اللہ پر توکل کرنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "This part of the Du'a ('La mani'a lima a'tayta...') affirms Allah's perfect power and absolute Oneness.",
                "It establishes the conviction that the source of all good and adversity is solely the divine Will of Allah.",
                "This acknowledgment teaches the believer to rely solely on Allah amidst worldly success or failure."
              ]
            }
          },
          {
            "title": {
              "urdu": "دنیاوی شان و شوکت کی بے اثری",
              "english": "Futility of Worldly Grandeur"
            },
            "content": {
              "urdu": [
                "'وَلَا يَنْفَعُ ذَا اَلْجَدِّ مِنْكَ اَلْجَدُّ' اللہ کے عذاب کے مقابلے میں مال و جاہ کی بے فائدہ پن کو ظاہر کرتا ہے۔",
                "مال و دولت، مرتبہ اور بخت، اللہ کی مشیت کے خلاف کوئی فائدہ نہیں دے سکتے۔",
                "یہ مومن کو دنیا کی عارضی شان و شوکت پر فخر کرنے کے بجائے عاجزی کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "'Wa la yanfa'u dhal-jaddi minkal-jaddu' states the uselessness of wealth or status against Allah's punishment.",
                "Fortune, high rank, and worldly success offer no benefit contrary to Allah's decree.",
                "This encourages the believer towards humility instead of boasting about transient worldly grandeur."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسنون اذکار میں اضافہ",
        "english": "Adding to Prescribed Remembrances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذکار میں وسعت",
              "english": "Expanding the Remembrance"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ رکوع سے اٹھنے کے بعد صرف 'ربنا ولک الحمد' ہی کافی نہیں ہے۔",
                "نبی اکرم ﷺ نے خود اس مقام پر جامع اور طویل اذکار کو شامل فرما کر فضیلت کا راستہ دکھایا۔",
                "مومن کو چاہیے کہ وہ اپنی نماز میں صرف کم سے کم اذکار پر اکتفا نہ کرے، بلکہ اضافہ کرے۔"
              ],
              "english": [
                "This Hadith clarifies that merely saying 'Rabbana wa lakal-hamd' after Ruku' is not the only option.",
                "The Prophet (ﷺ) himself showed the path to greater virtue by adding comprehensive, lengthy supplications at this juncture.",
                "The believer should not settle for the bare minimum of remembrance in prayer but should seek to expand it."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرض یا نفل میں پڑھنا",
              "english": "Recitation in Obligatory or Voluntary Prayer"
            },
            "content": {
              "urdu": [
                "یہ دعا فرض اور نفل دونوں نمازوں میں پڑھنا سنت سے ثابت ہے اور جائز ہے۔",
                "اگر امام لمبی قرأت کرتا ہو تو مقتدی بھی پوری دعا پڑھ سکتا ہے، بشرطیکہ وہ امام سے پیچھے نہ رہ جائے۔",
                "یہ عمل خصوصاً تنہا نماز پڑھنے والے (منفرد) کے لیے بہت فضیلت کا حامل ہے۔"
              ],
              "english": [
                "Reciting this Du'a is established and permissible in both obligatory and voluntary prayers.",
                "If the Imam prolongs the recitation, the follower can also recite the full Du'a, provided they do not fall behind the Imam.",
                "This practice carries great virtue, especially for the one praying alone (Munfarid)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمان اور توحید کا عملی اظہار",
        "english": "Practical Expression of Faith and Tawhid"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توکل کا درس",
              "english": "The Lesson of Reliance (Tawakkul)"
            },
            "content": {
              "urdu": [
                "اس دعا کا آخری حصہ 'لَا مَانِعَ...' توحیدِ ربوبیت اور توکل کا عملی درس دیتا ہے۔",
                "بندہ دنیا کی ہر چیز سے منہ موڑ کر صرف اور صرف اللہ کی طرف رجوع کرتا ہے۔",
                "یہ نماز کے ذریعے مومن کو اس بات کا یقین دلاتی ہے کہ طاقت صرف اللہ کے ہاتھ میں ہے۔"
              ],
              "english": [
                "The latter part of the Du'a ('La mani'a...') provides a practical lesson in Tawhid ar-Rububiyyah (Oneness of Lordship) and Tawakkul (reliance).",
                "The servant turns away from everything in the world and directs themselves solely to Allah.",
                "Through prayer, this instills the conviction in the believer that ultimate power rests only in Allah's hands."
              ]
            }
          },
          {
            "title": {
              "urdu": "بزرگی اور فخر کا خاتمہ",
              "english": "Eliminating Pride and Arrogance"
            },
            "content": {
              "urdu": [
                "'وَلَا يَنْفَعُ ذَا اَلْجَدِّ مِنْكَ اَلْجَدُّ' غرور اور تکبر کو جڑ سے ختم کرتا ہے۔",
                "انسان کو یاد دلایا جاتا ہے کہ اس کا مال، عہدہ یا بخت اللہ کے سامنے بے معنی ہے۔",
                "یہ دعا عاجزی پیدا کرتی ہے اور بندے کو حقیقی بڑائی یعنی اللہ کی بڑائی پر غور کرنے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "The phrase 'Wa la yanfa'u dhal-jaddi minkal-jaddu' fundamentally eradicates arrogance and pride.",
                "Man is reminded that his wealth, status, or luck is meaningless before the might of Allah.",
                "This supplication promotes humility and encourages the servant to reflect on true greatness, which belongs to Allah alone."
              ]
            }
          }
        ]
      }
    }
  ]
}
