{
  "hadithId": 793,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/793"],
    "kitabId": 7,
    "inKitabBab": 18,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 59
  },
 
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري ( 2625 )‏ ، ومسلم ( 1625 ). العمرى: هي أن يعطي الرجل غيره داراً مثلاً ويقول: هي لك عمرك، فإذا مت رجعت إليّ، فأبطل النبي صلى الله عليه وسلم هذا الشرط وأثبت الملكية للموهوب له.",
    "urdu": "صحیح۔ اسے امام بخاری (2625) اور امام مسلم (1625) نے روایت کیا ہے۔ 'عمریٰ' یہ تھا کہ ایک شخص دوسرے کو کہتا: 'یہ گھر تمہارا ہے جب تک تم زندہ ہو'۔ نبی ﷺ نے اس عارضی شرط کو باطل قرار دے کر اسے مستقل ملکیت بنا دیا۔",
    "english": "Sahih. Reported by Al-Bukhari (2625) and Muslim (1625). 'Umra was a pre-Islamic practice where a person gave property to another only for their lifetime. The Prophet (ﷺ) invalidated the condition of return and made it a permanent gift."
  },
  "importantWords": [
    {
      "arabic": "اَلْعُمْرَى",
      "english": "Life-long gift",
      "urdu": "عمریٰ (عمر بھر کے لیے ہبہ)"
    },
    {
      "arabic": "لِعَقِبِهِ",
      "english": "His descendants / offspring",
      "urdu": "اس کی اولاد / نسل کے لیے"
    },
    {
      "arabic": "أَمْسِكُوا",
      "english": "Keep / Retain",
      "urdu": "روک کر رکھو"
    },
    {
      "arabic": "لَا تُفْسِدُوهَا",
      "english": "Do not squander / spoil",
      "urdu": "اسے ضائع نہ کرو"
    },
    {
      "arabic": "رُقْبَى",
      "english": "Conditional gift based on survival",
      "urdu": "رقبیٰ (مرنے کے انتظار پر مبنی ہبہ)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں جاہلیت کی ایک رسم 'عمریٰ' (عارضی ہبہ) کی اصلاح کی گئی ہے۔ اسلام کے مطابق اگر کوئی شخص کسی کو عمر بھر کے لیے کوئی چیز ہبہ کرتا ہے، تو وہ اس کی مستقل ملکیت بن جاتی ہے اور اس کے ورثاء کو منتقل ہوتی ہے۔",
    "english": "This Hadith reforms the pre-Islamic practice of 'Umra (temporary gifts). In Islam, if property is gifted for a lifetime, the condition of return is void, and it becomes the permanent property of the recipient and their heirs."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2625)",
      "english": "Reported by Al-Bukhari (2625)"
    },
    {
      "arabic": "رواه مسلم (1625)",
      "english": "Reported by Muslim (1625)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عمریٰ اور رقبیٰ کا مفہوم",
        "english": "Meaning of Umra and Ruqba"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جاہلی رسم کی حقیقت",
              "english": "Reality of the Pre-Islamic Custom"
            },
            "content": {
              "urdu": [
                "زمانہ جاہلیت میں لوگ مکان یا زمین اس شرط پر دیتے تھے کہ جب تک لینے والا زندہ ہے وہ اسے استعمال کرے، پھر وہ واپس مالک کو مل جائے۔",
                "اسے 'عمریٰ' (عمر سے مشتق) کہا جاتا تھا۔",
                "نبی ﷺ نے اس عارضی نظام کو ختم کر کے اسے مستقل صدقہ اور ملکیت قرار دیا۔"
              ],
              "english": [
                "In the pre-Islamic era, people gifted houses/land on the condition that once the recipient died, it returned to the donor.",
                "This was called 'Umra' (derived from 'Umr' or life).",
                "The Prophet (ﷺ) abolished this temporary nature and declared it a permanent transfer of ownership."
              ]
            }
          },
          {
            "title": {
              "urdu": "رقبیٰ کی تعریف",
              "english": "Definition of Ruqba"
            },
            "content": {
              "urdu": [
                "رقبیٰ کا مطلب تھا کہ دو لوگ ایک دوسرے کے مرنے کا انتظار کریں (مراقبہ سے)، جو پہلے مر جائے چیز دوسرے کی ہو جائے۔",
                "اسلام نے اس قسم کے جوا نما اور غیر یقینی معاہدوں سے منع فرمایا۔",
                "شریعت میں ہبہ (تحفہ) وہ ہے جو بغیر کسی واپسی کی شرط کے دیا جائے۔"
              ],
              "english": [
                "Ruqba involved two people waiting for each other to die; the survivor would take the property.",
                "Islam prohibited such uncertain and gambling-like contracts.",
                "In Shariah, a gift (Hiba) must be absolute and without a condition for return."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور ملکیت",
        "english": "Juristic Rulings and Ownership"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرطِ فاسد اور عقدِ صحیح",
              "english": "Invalid Condition and Valid Contract"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک ہبہ میں واپسی کی شرط 'شرطِ فاسد' ہے جو باطل ہو جاتی ہے۔",
                "معاہدہ (عقد) اپنی جگہ صحیح رہتا ہے اور چیز موہوب لہ (لینے والے) کی ملکیت ہو جاتی ہے۔",
                "اب یہ جائیداد لینے والے کے مرنے کے بعد اس کے وارثوں میں تقسیم ہوگی، اصل مالک کو واپس نہیں ملے گی۔"
              ],
              "english": [
                "Most jurists agree that the condition of return in a gift is an 'invalid condition' which is voided.",
                "The contract itself remains valid, making the recipient the full owner.",
                "The property will be inherited by the recipient's heirs after their death, not returned to the original donor."
              ]
            }
          },
          {
            "title": {
              "urdu": "وارثوں کا حق",
              "english": "Rights of the Heirs"
            },
            "content": {
              "urdu": [
                "حدیث کے الفاظ 'حیًا و میتًا ولعقبہ' واضح کرتے ہیں کہ یہ حق ابدی ہے۔",
                "دینے والے کا یہ گمان کہ وہ اسے دوبارہ حاصل کر لے گا، شرعاً غلط ہے۔",
                "یہی وجہ ہے کہ آپ ﷺ نے فرمایا کہ اپنے مال کو ضائع نہ کرو (یعنی اگر نہیں دینا تو اپنے پاس رکھو)۔"
              ],
              "english": [
                "The phrase 'alive, dead, and for descendants' clarifies that the right is perpetual.",
                "The donor's assumption that they can reclaim it is legally incorrect.",
                "This is why the Prophet (ﷺ) advised people to keep their property if they aren't ready to give it permanently."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "استثنائی صورتیں (عاریت)",
        "english": "Exceptions (Ariyat/Lending)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہبہ اور عاریت میں فرق",
              "english": "Difference between Gift and Loan"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص صرف استعمال کے لیے عارضی طور پر کوئی چیز دے (جیسے عاریت)، تو وہ واپس لی جا سکتی ہے۔",
                "مگر جب 'ہبہ' یا 'صدقہ' کا لفظ استعمال کیا جائے، تو واپسی کی گنجائش ختم ہو جاتی ہے۔",
                "الفاظ کا چناؤ شرعی معاملات میں بہت اہمیت رکھتا ہے۔"
              ],
              "english": [
                "If a person gives something temporarily for use (as a loan/Ariyat), it can be reclaimed.",
                "However, when the word 'Hiba' (gift) or 'Sadaqah' is used, there is no room for return.",
                "The choice of words is crucial in Shariah transactions."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام زہری کی تشریح",
              "english": "Imam az-Zuhri's Interpretation"
            },
            "content": {
              "urdu": [
                "اگر دینے والا صاف کہے کہ 'یہ صرف تیرے استعمال کے لیے ہے جب تک تو زندہ ہے'، تو بعض علماء اسے عاریت مانتے ہیں۔",
                "لیکن اگر اسے 'ہبہ' کا نام دیا جائے تو شرط باطل ہوگی۔",
                "نبی ﷺ کا مقصد ملکیت کے تصور کو واضح اور غیر مبہم بنانا تھا۔"
              ],
              "english": [
                "If the donor explicitly says 'This is for your use only while alive,' some scholars treat it as a loan.",
                "But if it is named a 'gift,' the condition is voided.",
                "The Prophet (ﷺ) aimed to make the concept of ownership clear and unambiguous."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سوچ سمجھ کر ہبہ کرنا",
              "english": "Deliberate Gifting"
            },
            "content": {
              "urdu": [
                "تحفہ یا صدقہ دینے سے پہلے مکمل ارادہ کر لیں کہ آپ اس کی ملکیت سے دستبردار ہو رہے ہیں۔",
                "جذباتی ہو کر ایسی چیزیں نہ دیں جن کی بعد میں آپ کو یا آپ کے وارثوں کو ضرورت پڑے۔",
                "مال کی حفاظت اور اس کا صحیح استعمال بھی دینی ذمہ داری ہے۔"
              ],
              "english": [
                "Before giving a gift or charity, make a firm intention to relinquish ownership.",
                "Avoid gifting things emotionally that you or your heirs might need later.",
                "Protecting wealth and using it correctly is also a religious responsibility."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاملات کی صفائی",
              "english": "Clarity in Dealings"
            },
            "content": {
              "urdu": [
                "ہبہ کرتے وقت تحریری ثبوت رکھیں تاکہ بعد میں ورثاء کے درمیان جھگڑا نہ ہو۔",
                "اسلامی قوانین جائیداد کی تقسیم میں ابہام کو ناپسند کرتے ہیں۔",
                "سچائی اور وضاحت باہمی رشتوں میں برکت کا باعث بنتی ہے۔"
              ],
              "english": [
                "Keep written evidence of gifts to prevent disputes among heirs later.",
                "Islamic law dislikes ambiguity in property distribution.",
                "Truth and clarity bring blessings to mutual relationships."
              ]
            }
          }
        ]
      }
    }
  ]
}