{
  "hadithId": 950,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/950"
    ],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5336)‏، ومسلم (1488)‏، وزادا: \" مرتين أو ثلاثا.‏ كل ذلك يقول: لا.‏ ثم قال رسول الله صلى الله عليه وسلم: \"إنما هي أربعة أشهر وعشر، وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول\".‏",
    "urdu": "یہ حدیث صحیح اور متفق علیہ ہے۔ اسے بخاری (5336) اور مسلم (1488) نے روایت کیا ہے۔ روایات میں ہے کہ سائلہ نے دو تین بار سوال دہرایا مگر آپ ﷺ نے ہر بار منع فرمایا اور عدت کی اہمیت واضح کی۔",
    "english": "Sahih. Reported by Al-Bukhari (5336) and Muslim (1488). The Prophet (ﷺ) refused the request multiple times, emphasizing that the mourning period is only four months and ten days compared to the year-long mourning in the pre-Islamic era."
  },
  "importantWords": [
    {
      "arabic": "مَاتَ",
      "english": "Died",
      "urdu": "وفات پا گیا"
    },
    {
      "arabic": "اشْتَكَتْ",
      "english": "Complained / Suffered",
      "urdu": "تکلیف محسوس کی / شکایت کی"
    },
    {
      "arabic": "عَيْنَهَا",
      "english": "Her eye",
      "urdu": "اس کی آنکھ"
    },
    {
      "arabic": "نَكْحُلُهَا",
      "english": "Apply Kohl to her",
      "urdu": "اسے سرمہ لگائیں"
    },
    {
      "arabic": "لَا",
      "english": "No",
      "urdu": "نہیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ وفات کی عدت (احداد) گزارنے والی عورت کے لیے ہر قسم کی زینت، بشمول سرمہ لگانا، ممنوع ہے چاہے وہ تکلیف کی وجہ سے ہی کیوں نہ ہو۔",
    "english": "This Hadith establishes that a woman in her mourning period (Ihdad) is prohibited from all forms of adornment, including applying kohl, even for medical complaints."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5336)",
      "english": "Reported by Al-Bukhari (5336)"
    },
    {
      "arabic": "رواه مسلم (1488)",
      "english": "Reported by Muslim (1488)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة هند بنت أبي أمية",
        "english": "Umm Salamah Hind bint Abi Umayya"
      },
      "slug": "umm-salamah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عدت میں سوگ کی اہمیت",
        "english": "Importance of Mourning in Iddah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احداد (سوگ) کا شرعی حکم",
              "english": "Legal Status of Ihdad"
            },
            "content": {
              "urdu": [
                "بیوہ پر شوہر کی وفات پر چار ماہ دس دن کا سوگ منانا واجب ہے۔",
                "سوگ کا مقصد نکاح کے رشتے کی عظمت اور شوہر کا احترام ظاہر کرنا ہے۔",
                "اس دوران زینت کی تمام چیزیں ترک کرنا تقویٰ کا تقاضا ہے۔"
              ],
              "english": [
                "Mourning for four months and ten days is obligatory for a widow.",
                "The purpose is to honor the marital bond and respect the husband.",
                "Avoiding all forms of adornment is a requirement of piety during this time."
              ]
            }
          },
          {
            "title": {
              "urdu": "زینت کی ممانعت",
              "english": "Prohibition of Adornment"
            },
            "content": {
              "urdu": [
                "سرمہ زینت کا ایک بڑا ذریعہ ہے اس لیے اسے سوگ میں منع کیا گیا۔",
                "بیوہ کو ایسی کسی بھی حالت سے بچنا چاہیے جو نکاح کی رغبت پیدا کرے۔",
                "شریعت نے حدود مقرر کر دی ہیں جن کی پابندی لازمی ہے۔"
              ],
              "english": [
                "Kohl is a significant form of beautification and is thus prohibited.",
                "A widow must avoid anything that might invite marriage proposals during Iddah.",
                "Shariah has set boundaries that must be strictly followed by believers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جاہلیت بمقابلہ اسلام",
        "english": "Jahiliyyah vs Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلامی اصلاحات",
              "english": "Islamic Reforms"
            },
            "content": {
              "urdu": [
                "جاہلیت میں بیوہ کو ایک سال تک گندی کوٹھڑی میں رہنا پڑتا تھا۔",
                "اسلام نے اس سنگین رسم کو ختم کر کے صرف چار ماہ مقرر کیے۔",
                "یہ مدت عورت کی نفسیاتی صحت اور سماجی حقوق کے تحفظ کے لیے ہے۔"
              ],
              "english": [
                "In pre-Islamic times, widows were confined to dark rooms for a year.",
                "Islam abolished this harsh custom and limited the period to four months.",
                "This duration balances psychological needs with social and legal rights."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسان شریعت",
              "english": "Ease in Shariah"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے یاد دلایا کہ یہ مدت جاہلیت کے مقابلے میں بہت تھوڑی ہے۔",
                "مسلمانوں کو اللہ کے حکم پر صبر و شکر کے ساتھ عمل کرنا چاہیے۔",
                "تکلیف کے باوجود شرعی حدود کو پامال نہ کرنا ہی اصل امتحان ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) reminded that this period is brief compared to before.",
                "Muslims should act upon Allah's command with patience and gratitude.",
                "Not violating Shariah limits despite pain is the true spiritual test."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی ضرورت اور استثناء",
        "english": "Medical Necessity and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "علاج اور زینت میں فرق",
              "english": "Medicine vs Beautification"
            },
            "content": {
              "urdu": [
                "اگر آنکھ کی تکلیف ایسی ہو کہ بینائی کا ڈر ہو تو دوا جائز ہے۔",
                "سرمہ یہاں صرف زینت کے طور پر زیرِ بحث تھا جس سے منع کیا گیا۔",
                "جدید ادویات جو زینت میں شمار نہیں ہوتیں، علاج کے لیے استعمال ہو سکتی ہیں۔"
              ],
              "english": [
                "If an eye condition threatens vision, medical treatment is permissible.",
                "Kohl was discussed as a beauty product, hence the strict prohibition.",
                "Modern medications that are not for adornment can be used for healing."
              ]
            }
          },
          {
            "title": {
              "urdu": "رات کے وقت استعمال",
              "english": "Usage During Night"
            },
            "content": {
              "urdu": [
                "بعض فقہاء کے نزدیک اگر سرمہ دوا ہو تو رات کو لگا کر صبح دھو لیں۔",
                "مقصد یہ ہے کہ دن کے وقت عورت کی زینت ظاہر نہ ہو۔",
                "شرعی احکامات میں ضرورت اور حکم کے درمیان توازن موجود ہے۔"
              ],
              "english": [
                "Some jurists allow medicinal kohl at night if washed off by morning.",
                "The goal is to ensure the woman's adornment is not visible during the day.",
                "Shariah rulings provide a balance between necessity and general commands."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی اطاعت",
              "english": "Obedience to the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "صحابہ کرام ہر چھوٹے بڑے معاملے میں نبی ﷺ سے رہنمائی لیتے تھے۔",
                "آپ ﷺ کا فیصلہ حتمی ہے چاہے وہ بظاہر کتنا ہی سخت معلوم ہو۔",
                "رسول کی اطاعت دراصل اللہ تعالیٰ ہی کی اطاعت اور خوشنودی ہے۔"
              ],
              "english": [
                "Companions consulted the Prophet (ﷺ) for every small or large matter.",
                "His decision is final regardless of how difficult it may seem to some.",
                "Obeying the Messenger is inherently obeying and pleasing Allah Himself."
              ]
            }
          },
          {
            "title": {
              "urdu": "صبر کی فضیلت",
              "english": "Virtue of Patience"
            },
            "content": {
              "urdu": [
                "مصائب کے دوران شرعی ضوابط پر قائم رہنا عظیم نیکی ہے۔",
                "بیوہ کو چاہیے کہ وہ اس مشکل وقت میں اللہ سے اجر کی امید رکھے۔",
                "دینِ اسلام ہمیں نظم و ضبط اور صبر کا بہترین سبق سکھاتا ہے۔"
              ],
              "english": [
                "Adhering to Shariah regulations during trials is a great act of virtue.",
                "A widow should hope for Allah's reward during this challenging phase.",
                "The religion of Islam teaches us the best lessons in discipline and patience."
              ]
            }
          }
        ]
      }
    }
  ]
}