{
  "hadithId": 980,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/980"],
    "kitabId": 8,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام - كتاب النكاح",
    "babId": 77
  },
 
  "takhreej": {
    "arabic": "صحيح. أصل الحديث في صحيح مسلم (996) بلفظ: «كفى بالمرء إثما أن يحبس عمن يملك قوته»، ورواه النسائي في الكبرى (9122) وأبو داود (1692) بلفظ «يضيع».",
    "urdu": "یہ حدیث صحیح ہے۔ اس کا اصل صحیح مسلم (996) میں موجود ہے، جبکہ نسائی اور ابوداؤد (1692) نے اسے 'ضائع کرنے' کے الفاظ سے روایت کیا ہے۔",
    "english": "Sahih. The core of the Hadith is in Sahih Muslim (996). An-Nasa'i and Abu Dawud (1692) recorded it with the wording 'neglect/waste'."
  },
  "importantWords": [
    {
      "arabic": "كَفَى",
      "english": "Sufficient",
      "urdu": "کافی ہے"
    },
    {
      "arabic": "إِثْمًا",
      "english": "Sin",
      "urdu": "گناہ"
    },
    {
      "arabic": "يُضَيِّعَ",
      "english": "Neglect / Waste",
      "urdu": "ضائع کرنا / بے سہارا چھوڑنا"
    },
    {
      "arabic": "يَقُوتُ",
      "english": "Provides for",
      "urdu": "روزی دیتا ہے"
    },
    {
      "arabic": "يَحْبِسَ",
      "english": "Withhold",
      "urdu": "روک لینا"
    },
    {
      "arabic": "قُوتَهُ",
      "english": "His sustenance",
      "urdu": "اس کی خوراک"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس شخص کے لیے سخت وعید ہے جو اپنے زیر کفالت افراد (بیوی، بچوں، ملازمین) کے اخراجات اور نان و نفقہ میں کوتاہی کرتا ہے۔",
    "english": "This Hadith warns against neglecting the financial and nutritional needs of those under one's care, such as family and dependents."
  },
  "references": [
    {
      "arabic": "رواه النسائي (٢٩٤)",
      "english": "Reported by An-Nasa'i (294)"
    },
    {
      "arabic": "رواه مسلم (٩٩٦)",
      "english": "Reported by Muslim (996)"
    },
    {
      "arabic": "رواه أبو داود (١٦٩٢)",
      "english": "Reported by Abu Dawud (1692)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin 'Amr bin al-'As"
      },
      "slug": "abdullah-bin-amr-bin-al-as"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YVshx6eR4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کفالت کی ذمہ داری",
        "english": "Responsibility of Maintenance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گناہ کی شدت",
              "english": "The Severity of the Sin"
            },
            "content": {
              "urdu": [
                "کسی شخص کے گنہگار ہونے کے لیے یہی بات کافی ہے کہ وہ ذمہ داری نہ نبھائے۔",
                "اپنے اہل و عیال کو بھوکا چھوڑنا ایک کبیرہ گناہ کے مترادف ہے۔",
                "اللہ تعالیٰ نے مرد کو گھر کا سربراہ اور کفیل بنایا ہے۔"
              ],
              "english": [
                "It is enough of a sin for a person to simply neglect their dependents.",
                "Leaving one's family hungry is considered a major spiritual failure.",
                "Allah has designated the provider as the responsible head of the household."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی اہمیت",
              "english": "Importance of Rights of People"
            },
            "content": {
              "urdu": [
                "اہل و عیال کے حقوق ادا کرنا واجب اور فرض عبادت ہے۔",
                "نوافل سے زیادہ ضروری اپنے زیر کفالت لوگوں کی ضروریات پوری کرنا ہے۔",
                "حقوق العباد میں کوتاہی اللہ کی ناراضگی کا باعث بنتی ہے۔"
              ],
              "english": [
                "Fulfilling the rights of family is an obligatory act of worship.",
                "Meeting dependents' needs is more critical than performing voluntary prayers.",
                "Neglecting human rights leads to the severe displeasure of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی حقوق کا تحفظ",
        "english": "Protection of Economic Rights"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رزق روکنے کی ممانعت",
              "english": "Prohibition of Withholding Food"
            },
            "content": {
              "urdu": [
                "جان بوجھ کر نان و نفقہ روکنا ظلم اور زیادتی ہے۔",
                "اگر کسی کے پاس مال ہو تو اسے خرچ کرنے میں کنجوسی نہیں کرنی چاہیے۔",
                "مسلم کی روایت کے مطابق رزق روکنا انسان کو ہلاکت میں ڈالتا ہے۔"
              ],
              "english": [
                "Intentionally withholding sustenance is a form of oppression and injustice.",
                "If one possesses wealth, they must not be stingy with their family.",
                "According to Muslim's narration, withholding food leads a person to ruin."
              ]
            }
          },
          {
            "title": {
              "urdu": "ملازمین کے حقوق",
              "english": "Rights of Employees/Servants"
            },
            "content": {
              "urdu": [
                "اس حدیث میں خادموں اور ملازمین کے حقوق بھی شامل ہیں۔",
                "ملازم کی تنخواہ اور کھانا وقت پر دینا مالک کی ذمہ داری ہے۔",
                "کسی کی محنت کا صلہ نہ دینا اسے ضائع کرنے کے مترادف ہے۔"
              ],
              "english": [
                "This Hadith also encompasses the rights of servants and employees.",
                "It is the employer's duty to provide wages and food on time.",
                "Failing to compensate someone's labor is equivalent to 'wasting' them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی معاشرت",
        "english": "Islamic Social Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندان کا استحکام",
              "english": "Stability of the Family"
            },
            "content": {
              "urdu": [
                "اسلام ایک مضبوط خاندانی نظام کی بنیاد رکھتا ہے۔",
                "کفالت کے نظام سے معاشرے میں بے راہ روی ختم ہوتی ہے۔",
                "جب سربراہ اپنی ذمہ داری نبھاتا ہے تو گھر امن کا گہوارہ بنتا ہے۔"
              ],
              "english": [
                "Islam builds the foundation of a very strong family system.",
                "A proper maintenance system prevents social instability and chaos.",
                "When the head fulfills his duty, the home becomes a sanctuary of peace."
              ]
            }
          },
          {
            "title": {
              "urdu": "ترجیحات کا تعین",
              "english": "Setting Priorities"
            },
            "content": {
              "urdu": [
                "صدقہ و خیرات سے پہلے گھر کے اخراجات پورے کرنا ضروری ہے۔",
                "بہترین دینار وہ ہے جو انسان اپنی اولاد پر خرچ کرے۔",
                "دوسروں پر خرچ کر کے اپنوں کو بھوکا رکھنا اسلامی تعلیمات کے خلاف ہے۔"
              ],
              "english": [
                "Home expenses must be covered before giving general charity.",
                "The best wealth spent is that which a man spends on his children.",
                "Spending on others while leaving family hungry contradicts Islamic values."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخرت میں جوابدہی",
              "english": "Accountability in the Afterlife"
            },
            "content": {
              "urdu": [
                "قیامت کے دن ہر راعی (نگران) سے اس کی رعیت کا سوال ہوگا۔",
                "اہل و عیال کے نان و نفقہ کا حساب اللہ کے ہاں دینا پڑے گا۔",
                "جو یہاں کوتاہی کرے گا وہ وہاں سخت سزا کا مستحق ٹھہرے گا۔"
              ],
              "english": [
                "Every guardian will be questioned about those under his care on Judgment Day.",
                "Accountability for family sustenance is mandatory before Allah.",
                "Those who fail here will be liable for punishment in the hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "احسان اور شفقت",
              "english": "Excellence and Compassion"
            },
            "content": {
              "urdu": [
                "ذمہ داری کو بوجھ سمجھنے کے بجائے احسان کے ساتھ ادا کریں۔",
                "اہل و عیال پر خرچ کرنا باعث برکت اور ثواب ہے۔",
                "سخاوت کی ابتدا اپنے گھر سے ہونی چاہیے۔"
              ],
              "english": [
                "Duties should be performed with excellence rather than as a burden.",
                "Spending on family brings blessings and immense spiritual rewards.",
                "Generosity must always begin within one's own household."
              ]
            }
          }
        ]
      }
    }
  ]
}