{
  "hadithId": 489,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1573"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (1573)، والبيهقي (4/103). وقد صحح البخاري الرواية الموقوفة، ولكن له شواهد ترفعه للصحة. أما حديث ابن عمر فرواه الترمذي (631) وصحح وقفه.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (1573) نے روایت کیا ہے۔ امام بخاری نے اس کے موقوف ہونے کو صحیح قرار دیا ہے، مگر دیگر شواہد کی بنا پر یہ مرفوعاً بھی ثابت ہے۔ ابن عمر کی روایت ترمذی (631) میں ہے اور اس کا موقوف ہونا ہی درست ہے۔",
    "english": "Sahih. Reported by Abu Dawud (1573). Al-Bukhari authenticated the Muwquf (companion's statement) version, but it has supporting evidences that raise it to Sahih status. The narration of Ibn Umar is in At-Tirmidhi (631) and is correctly identified as Muwquf."
  },
  "importantWords": [
    {
      "arabic": "مِائَتَا دِرْهَمٍ",
      "english": "Two hundred Dirhams",
      "urdu": "دو سو درہم (چاندی)"
    },
    {
      "arabic": "عِشْرُونَ دِينَارًا",
      "english": "Twenty Dinars",
      "urdu": "بیس دینار (سونا)"
    },
    {
      "arabic": "حَالَ اَلْحَوْلُ",
      "english": "A year passes",
      "urdu": "سال گزر گیا"
    },
    {
      "arabic": "فَبِحِسَابِ ذَلِكَ",
      "english": "Calculated accordingly",
      "urdu": "اسی حساب سے"
    },
    {
      "arabic": "اِسْتَفَادَ مَالًا",
      "english": "Acquired wealth",
      "urdu": "مال حاصل کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سونا اور چاندی کی زکوٰۃ کا نصاب (بیس دینار اور دو سو درہم) اور زکوٰۃ کی شرح (2.5%) بیان کی گئی ہے، ساتھ ہی 'حولانِ حول' یعنی مال پر ایک سال گزرنے کی شرط واضح کی گئی ہے۔",
    "english": "This Hadith establishes the Nisab for gold (20 Dinars) and silver (200 Dirhams), the rate of Zakat (2.5%), and the essential condition of 'Hawlan al-Hawl' (possession for one complete lunar year)."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1573)",
      "english": "Sunan Abu Dawud (1573)"
    },
    {
      "arabic": "سنن الترمذي (631)",
      "english": "Sunan at-Tirmidhi (631)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_R_AAnM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سونا اور چاندی کا نصاب",
        "english": "Nisab for Gold and Silver"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چاندی کا نصاب",
              "english": "Threshold for Silver"
            },
            "content": {
              "urdu": [
                "چاندی کا نصاب 200 درہم ہے، جو جدید وزن کے مطابق تقریباً 612 گرام (ساڑھے 52 تولہ) بنتا ہے۔",
                "اس مقدار پر 5 درہم زکوٰۃ واجب ہے، جو کہ کل مال کا 2.5 فیصد بنتا ہے۔",
                "نصاب سے کم مال پر شرعاً کوئی زکوٰۃ لازم نہیں ہے۔"
              ],
              "english": [
                "The Nisab for silver is 200 Dirhams, roughly 612 grams (52.5 tolas) in modern weight.",
                "Zakat due on this is 5 Dirhams, which equates to 2.5% of the total.",
                "Wealth below this threshold is not subject to mandatory Zakat."
              ]
            }
          },
          {
            "title": {
              "urdu": "سونے کا نصاب",
              "english": "Threshold for Gold"
            },
            "content": {
              "urdu": [
                "سونے کا نصاب 20 دینار (مثقال) ہے، جو کہ تقریباً 87.5 گرام (ساڑھے 7 تولہ) بنتا ہے۔",
                "اس پر آدھا دینار زکوٰۃ واجب ہے، جو کہ دوبارہ 2.5 فیصد کی شرح ہی ہے۔",
                "اگر سونا اس مقدار سے کم ہو تو زکوٰۃ فرض نہیں ہوتی۔"
              ],
              "english": [
                "The Nisab for gold is 20 Dinars, which is approximately 87.48 grams (7.5 tolas).",
                "The due Zakat is half a Dinar, maintaining the constant rate of 2.5%.",
                "Zakat is not compulsory if the gold is less than this weight."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سال گزرنے کی شرط (حولانِ حول)",
        "english": "Condition of One Full Year"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی ملکیت کا دورانیہ",
              "english": "Duration of Possession"
            },
            "content": {
              "urdu": [
                "زکوٰۃ صرف اس مال پر ہے جس پر قمری (اسلامی) تقویم کے مطابق ایک مکمل سال گزر جائے۔",
                "اگر مال نصاب تک پہنچنے کے بعد سال مکمل ہونے سے پہلے کم ہو جائے تو زکوٰۃ ساقط ہو جاتی ہے۔",
                "یہ شرط اس لیے ہے تاکہ انسان کی معاشی استحکام کی حالت واضح ہو سکے۔"
              ],
              "english": [
                "Zakat is only due on wealth held for one full lunar year.",
                "If the wealth drops below Nisab before the year ends, the obligation is waived.",
                "This condition ensures that Zakat is taken from established, stable wealth."
              ]
            }
          },
          {
            "title": {
              "urdu": "درمیانِ سال حاصل ہونے والا مال",
              "english": "Wealth Acquired Mid-Year"
            },
            "content": {
              "urdu": [
                "ابن عمر رضی اللہ عنہ کے اثر کے مطابق نئے حاصل ہونے والے مال پر بھی الگ سے سال گزرنا ضروری ہے۔",
                "تاہم، اگر یہ مال پہلے سے موجود مال کی تجارت کا منافع ہو، تو اس کا سال وہی ہوگا جو اصل مال کا تھا۔",
                "عام عطیات یا تنخواہ پر سال گزرنا ضروری ہے، الا یہ کہ وہ پہلے سے موجود نصاب میں شامل ہو جائے۔"
              ],
              "english": [
                "Based on Ibn Umar's report, newly acquired wealth needs its own year to pass.",
                "However, if it's profit from current trade capital, it shares the original wealth's year.",
                "Gifts or salaries require a year to pass unless they merge with existing Nisab-reaching assets."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور حساباتی نکات",
        "english": "Juristic and Calculation Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اضافی مال کا حساب",
              "english": "Calculating Excess Wealth"
            },
            "content": {
              "urdu": [
                "نصاب سے اوپر جتنا بھی مال ہوگا، اس پر اسی 2.5 فیصد کے حساب سے زکوٰۃ نکالی جائے گی۔",
                "امام ابوحنیفہ کے نزدیک اضافی مال پر زکوٰۃ تب ہوگی جب وہ نصاب کے پانچویں حصے تک پہنچے۔",
                "جمہور کے نزدیک ہر ایک درہم یا دینار کے اضافے پر زکوٰۃ کا حساب ہوگا، جو زیادہ راجح ہے۔"
              ],
              "english": [
                "Any wealth exceeding the Nisab is taxed at the same 2.5% rate.",
                "Imam Abu Hanifa requires excess wealth to reach a specific fraction before adding tax.",
                "The majority hold that every increment is calculated proportionally, which is the stronger view."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدید کرنسی پر اطلاق",
              "english": "Application to Modern Currency"
            },
            "content": {
              "urdu": [
                "آج کے دور میں نقدی (Cash) کی زکوٰۃ کے لیے چاندی کے نصاب کو معیار بنایا جاتا ہے۔",
                "جس کے پاس ساڑھے 52 تولہ چاندی کی قیمت کے برابر رقم ہو، اس پر زکوٰۃ فرض ہے۔",
                "اس سے غریبوں کو زیادہ فائدہ پہنچتا ہے اور زکوٰۃ کا دائرہ وسیع ہوتا ہے۔"
              ],
              "english": [
                "In modern times, the silver Nisab is often used as the standard for cash Zakat.",
                "Whoever owns cash equivalent to 52.5 tolas of silver must pay Zakat.",
                "This standard benefits the poor more and widens the base of Zakat givers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط اور دیانت",
              "english": "Discipline and Honesty"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کا نظام انتہائی منظم اور ریاضیاتی حساب کتاب پر مبنی ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنے مال کا درست حساب رکھے تاکہ اللہ کا حق ضائع نہ ہو۔",
                "سال کی تاریخ مقرر کرنا (مثلاً یکم رمضان) حساب میں آسانی پیدا کرتا ہے۔"
              ],
              "english": [
                "The Zakat system is highly organized and based on precise calculations.",
                "A Muslim must keep accurate records of wealth to avoid neglecting Allah's right.",
                "Fixing a yearly date (e.g., 1st Ramadan) simplifies the calculation process."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور توازن",
              "english": "Moderation and Balance"
            },
            "content": {
              "urdu": [
                "اسلام نے زکوٰۃ کی شرح صرف 2.5 فیصد رکھ کر مالداروں کے لیے آسانی پیدا کی ہے۔",
                "یہ تھوڑی سی رقم پورے معاشرے کی غربت ختم کرنے کی طاقت رکھتی ہے۔",
                "زکوٰۃ سے مال کم نہیں ہوتا بلکہ اللہ اس میں برکت عطا فرماتا ہے۔"
              ],
              "english": [
                "By fixing the rate at only 2.5%, Islam has made it easy for the wealthy.",
                "This small percentage has the power to eliminate poverty from the whole society.",
                "Zakat does not decrease wealth; rather, Allah increases its blessings."
              ]
            }
          }
        ]
      }
    }
  ]
}