{
  "hadithId": 989,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/43"],
    "kitabId": 8,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 78
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (2244)‏، والنسائي (3481)‏، والحاكم (2834).‏ وقال الحاكم: حديث صحيح الإسناد ولم يخرجاه ووافقه الذهبي.",
    "urdu": "یہ روایت صحیح ہے۔ اسے ابوداؤد، نسائی اور حاکم نے روایت کیا ہے۔ امام حاکم اور علامہ ذہبی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (2244), An-Nasa'i (3481), and Al-Hakim (2834). Al-Hakim graded it Sahih and Adh-Dhahabi agreed with him."
  },
  "importantWords": [
    {
      "arabic": "أَسْلَمَ",
      "english": "Embraced Islam",
      "urdu": "اسلام لایا"
    },
    {
      "arabic": "أَبَتِ",
      "english": "Refused",
      "urdu": "انکار کر دیا"
    },
    {
      "arabic": "نَاحِيَةً",
      "english": "Corner / Side",
      "urdu": "جانب / گوشہ"
    },
    {
      "arabic": "فَمَالَ",
      "english": "Inclined / Leaned",
      "urdu": "مائل ہو گیا"
    },
    {
      "arabic": "اِهْدِهِ",
      "english": "Guide him",
      "urdu": "اسے ہدایت دے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ اگر والدین میں سے ایک کافر ہو، تو بچے کے دین کے تحفظ کے لیے اسے مسلمان والد کے پاس رکھا جائے گا۔",
    "english": "This Hadith indicates that if one parent remains a non-Muslim, the child's upbringing should prioritize their Islamic identity under the Muslim parent."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2244)",
      "english": "Reported by Abu Dawud (2244)"
    },
    {
      "arabic": "رواه النسائي (3481)",
      "english": "Reported by An-Nasa'i (3481)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رافع بن سنان",
        "english": "Rafi' bin Sinan"
      },
      "slug": "rafi-bin-sinan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Jb-DqIq8X9o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دین کی اہمیت",
        "english": "Importance of Religion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بچے کے دین کا تحفظ",
              "english": "Protection of Child's Faith"
            },
            "content": {
              "urdu": [
                "بچے کی پرورش میں اس کے عقیدے اور دین کا تحفظ سب سے اہم ہے۔",
                "اسلامی فقہ میں بچے کو مسلمان والد کے سپرد کیا جاتا ہے تاکہ وہ اسلام پر بڑھے۔",
                "دینِ حق کی بنیاد پر پرورش بچے کا بنیادی شرعی حق ہے۔"
              ],
              "english": [
                "Protecting the child's faith and creed is paramount in upbringing.",
                "In Islamic law, a child is entrusted to the Muslim parent to ensure an Islamic growth.",
                "Raising a child upon the true religion is their fundamental Shariah right."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی تاثیر",
              "english": "The Power of Supplication"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کی دعا نے بچے کے دل کو صحیح جانب مائل کر دیا۔",
                "والدین کو چاہیے کہ وہ اپنی اولاد کی ہدایت کے لیے مسلسل دعا کریں۔",
                "اللہ تعالیٰ دعاؤں کے ذریعے دلوں کو بدلنے کی قدرت رکھتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) prayer inclined the child's heart toward the right side.",
                "Parents must continuously pray for the guidance of their children.",
                "Allah Almighty has the power to change hearts through supplications."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حضانت کے اصول",
        "english": "Principles of Custody"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیر مسلم ماں کا حق",
              "english": "Right of a Non-Muslim Mother"
            },
            "content": {
              "urdu": [
                "اگر ماں غیر مسلم ہو تو اس کا حقِ حضانت متاثر ہو سکتا ہے۔",
                "بچے کے کفر پر پرورش پانے کا خطرہ ہو تو اسے مسلمان کے پاس رکھا جائے گا۔",
                "شرعی عدالتیں بچے کے دینی مفاد کو انسانی جذبات پر ترجیح دیتی ہیں۔"
              ],
              "english": [
                "A non-Muslim mother's right to custody can be affected by religious disparity.",
                "If there is a risk of the child being raised in disbelief, the child stays with the Muslim.",
                "Shariah courts prioritize the child's religious interest over human emotions."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچے کی ترجیح",
              "english": "Child's Preference"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے بچے کو دونوں کے درمیان بٹھا کر اسے موقع دیا۔",
                "بچے کی فطری رغبت کا بھی پرورش کے معاملے میں اعتبار کیا گیا ہے۔",
                "اسلامی نظامِ عدل میں بچوں کے جذبات کا لحاظ رکھا جاتا ہے۔"
              ],
              "english": [
                "The Messenger (ﷺ) sat the child between parents to allow a choice.",
                "The child's natural inclination is considered in matters of custody.",
                "The Islamic justice system takes the child's feelings into account."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبوی طریقہ کار",
        "english": "Prophetic Methodology"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انصاف کے ساتھ فیصلہ",
              "english": "Decision with Justice"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے فریقین کو برابر جگہ دے کر عدل و انصاف کا مظاہرہ کیا۔",
                "کسی پر جبر کرنے کے بجائے آپ ﷺ نے اللہ سے ہدایت کی دعا مانگی۔",
                "نبوی طریقہ کار ہمیشہ حکمت اور رحمت پر مبنی ہوتا تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) demonstrated justice by giving both parties equal positioning.",
                "Instead of coercion, the Prophet (ﷺ) asked Allah for guidance for the boy.",
                "Prophetic methodology was always based on wisdom and mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسائل کا حل",
              "english": "Solving Disputes"
            },
            "content": {
              "urdu": [
                "خاندانی تنازعات کو حکمتِ عملی اور عدل سے حل کرنا سنت ہے۔",
                "اختلافات کے وقت اللہ کے رسول ﷺ کی سنت سے رہنمائی لینی چاہیے۔",
                "مسلمانوں کے لیے ایمان کا تحفظ ہر رشتے سے زیادہ قیمتی ہے۔"
              ],
              "english": [
                "Resolving family disputes with strategy and justice is a Sunnah.",
                "One must seek guidance from the Sunnah during times of disagreement.",
                "For Muslims, protecting faith is more valuable than any relationship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی پہلو",
        "english": "Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلام پر ثابت قدمی",
              "english": "Steadfastness in Islam"
            },
            "content": {
              "urdu": [
                "رافع بن سنان رضی اللہ عنہ نے اپنی بیوی کے باوجود اسلام کو نہ چھوڑا۔",
                "یہ صحابہ کرام کے مضبوط ایمان اور جذبہِ اسلام کی روشن مثال ہے۔",
                "ایمان کی خاطر خاندانی آزمائشوں پر صبر کرنا بڑے اجر کا کام ہے۔"
              ],
              "english": [
                "Rafi bin Sinan (RA) did not abandon Islam despite his wife's refusal.",
                "This is a shining example of the Companions' strong faith and zeal.",
                "Remaining patient through family trials for faith brings immense reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "معاشرے میں بچوں کی دینی تربیت کی مجموعی ذمہ داری سب پر ہے۔",
                "والدین میں جدائی کی صورت میں بھی بچے کی تربیت متاثر نہیں ہونی چاہیے۔",
                "اسلامی معاشرہ بچوں کو گمراہی سے بچانے کے لیے ڈھال فراہم کرتا ہے۔"
              ],
              "english": [
                "The collective responsibility of religious training for children lies on all.",
                "A child's upbringing should not suffer even if the parents separate.",
                "Islamic society provides a shield to protect children from misguidance."
              ]
            }
          }
        ]
      }
    }
  ]
}