{
  "hadithId": 413,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام",
    "babId": 26
  },
  
  "takhreej": {
    "arabic": "حسن.‏ رواه الدارقطني (2/66)، والحاكم (1/325)، وأحمد في العلل (2/211). صححه الحاكم ووافقه الذهبي.",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے امام حاکم، دارقطنی اور احمد نے العلل میں روایت کیا ہے۔ امام حاکم نے اسے صحیح کہا اور علامہ ذہبی نے ان کی موافقت کی ہے۔",
    "english": "Hasan (Good). Reported by Al-Hakim (1/325), Ad-Daraqutni (2/66), and Ahmad in Al-Ilal. Al-Hakim authenticated it and Adh-Dhahabi agreed."
  },
  "importantWords": [
    {
      "arabic": "يَسْتَسْقِي",
      "english": "Praying for rain",
      "urdu": "بارش طلب کرنا"
    },
    {
      "arabic": "نَمْلَةً",
      "english": "An ant",
      "urdu": "چیونٹی"
    },
    {
      "arabic": "مُسْتَلْقِيَةً",
      "english": "Lying on its back",
      "urdu": "پشت کے بل لیٹی ہوئی"
    },
    {
      "arabic": "قَوَائِمَهَا",
      "english": "Its limbs/legs",
      "urdu": "اس کی ٹانگیں"
    },
    {
      "arabic": "غِنًى",
      "english": "Self-sufficiency",
      "urdu": "بے نیازی / استغنا"
    }
  ],
  "summary": {
    "urdu": "اللہ تعالیٰ اپنی ہر چھوٹی بڑی مخلوق کی دعا سنتا ہے، اور بسا اوقات جانوروں کی عاجزانہ دعاؤں کے صدقے انسانوں کو بھی رزق اور بارش دی جاتی ہے۔",
    "english": "Allah listens to the prayers of all His creations. Sometimes, due to the humble supplications of animals, humans are also blessed with sustenance and rain."
  },
  "references": [
    {
      "arabic": "المستدرك للحاكم (1/325)",
      "english": "Al-Mustadrak al-Hakim (1/325)"
    },
    {
      "arabic": "سنن الدارقطني (2/66)",
      "english": "Sunan Ad-Daraqutni (2/66)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=dua+of+ant+prophet+sulaiman+urdu",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مخلوقِ خدا کا اللہ سے تعلق",
        "english": "Creation's Bond with Allah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیوانات کی تسبیح و دعا",
              "english": "Animals' Glorification and Prayer"
            },
            "content": {
              "urdu": [
                "کائنات کی ہر چیز اپنے اپنے انداز میں اللہ کی تسبیح بیان کرتی ہے۔",
                "چیونٹی جیسی چھوٹی مخلوق کا اللہ کو پکارنا اس کی قدرت کی نشانی ہے۔",
                "جانوروں کا اللہ کی بندگی کرنا انسانوں کے لیے نصیحت کا پہلو رکھتا ہے۔"
              ],
              "english": [
                "Everything in the universe glorifies Allah in its own unique manner.",
                "The prayer of a tiny ant highlights the absolute sovereignty of Allah.",
                "Animals' devotion to their Creator serves as a powerful lesson for humanity."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزق کی محتاجی",
              "english": "Dependency on Sustenance"
            },
            "content": {
              "urdu": [
                "اللہ ہی تمام مخلوقات کو رزق اور پانی فراہم کرنے والا رب ہے۔",
                "کوئی بھی جاندار اللہ کی رحمت کے بغیر زندہ نہیں رہ سکتا۔",
                "چیونٹی کے الفاظ اللہ کے حضور سراسر عاجزی اور بندگی کا مظہر ہیں۔"
              ],
              "english": [
                "Allah alone is the Provider of sustenance and water to all beings.",
                "No living creature can survive without the continuous mercy of Allah.",
                "The ant's words represent total humility and submission before the Lord."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کی قبولیت کے اسباب",
        "english": "Reasons for Acceptance of Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاجزی اور خلوص",
              "english": "Humility and Sincerity"
            },
            "content": {
              "urdu": [
                "چیونٹی کا الٹا لیٹ کر ہاتھ اٹھانا اس کی انتہائی بے بسی کا اظہار تھا۔",
                "اللہ تعالیٰ عاجزی کے ساتھ مانگی گئی دعاؤں کو بہت پسند فرماتا ہے۔",
                "خلوصِ دل سے نکلی ہوئی پکار اللہ کے عرش کو ہلا دیتی ہے۔"
              ],
              "english": [
                "The ant's posture of lying back expressed its utter helplessness.",
                "Allah Almighty loves supplications made with sincere humility and grace.",
                "A call made with a sincere heart reaches the Throne of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "بے زبانوں کی دعا",
              "english": "Prayers of the Voiceless"
            },
            "content": {
              "urdu": [
                "اللہ بے زبان جانوروں کی پکار کو خاص اہمیت دیتا ہے۔",
                "بسا اوقات انسانوں کے گناہوں کی وجہ سے بارش ان کے صدقے ہوتی ہے۔",
                "جانوروں پر رحم کرنا اللہ کی رحمت کو متوجہ کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Allah gives special importance to the cries of voiceless animals.",
                "Sometimes, rain is granted because of them despite human transgressions.",
                "Showing mercy to animals is a way to attract the mercy of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا سلیمانؑ کا مقام",
        "english": "Status of Prophet Sulaiman (AS)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "چرند و پرند کی زبان",
              "english": "Language of Birds and Beasts"
            },
            "content": {
              "urdu": [
                "اللہ نے سلیمان علیہ السلام کو جانوروں کی زبان سمجھنے کا معجزہ دیا۔",
                "چیونٹی کی پکار سن کر آپؑ نے اللہ کی حکمت کا مشاہدہ کیا۔",
                "یہ واقعہ سلیمان علیہ السلام کی نبوت اور فراست کی دلیل ہے۔"
              ],
              "english": [
                "Allah gifted Prophet Sulaiman the miracle of understanding animal speech.",
                "By hearing the ant's plea, he witnessed the divine wisdom of Allah.",
                "This event is a proof of Sulaiman's (AS) prophethood and insight."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ پر کامل بھروسہ",
              "english": "Perfect Trust in Allah"
            },
            "content": {
              "urdu": [
                "سلیمان علیہ السلام نے چیونٹی کی دعا پر یقین کرتے ہوئے واپسی کا حکم دیا۔",
                "آپؑ کو معلوم تھا کہ اللہ اپنے محتاج بندوں کی دعا ضرور سنے گا۔",
                "ایک نبی کا یقین عام انسانوں کے لیے مشعلِ راہ ہوتا ہے۔"
              ],
              "english": [
                "Prophet Sulaiman ordered the return, trusting the ant's sincere prayer.",
                "He knew Allah would surely answer the plea of His needy creation.",
                "A Prophet's certainty serves as a guiding light for ordinary people."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تربیتی سبق",
        "english": "Educational and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکبر سے بچاؤ",
              "english": "Avoidance of Arrogance"
            },
            "content": {
              "urdu": [
                "انسان کو کبھی یہ نہیں سمجھنا چاہیے کہ وہ اپنی کوشش سے سب پاتا ہے۔",
                "بسا اوقات ایک حقیر نظر آنے والی مخلوق ہم سے زیادہ مقرب ہوتی ہے۔",
                "اللہ کے دربار میں رتبہ تقویٰ اور بندگی کی بنیاد پر ملتا ہے۔"
              ],
              "english": [
                "Humans should never think they achieve everything through their own efforts.",
                "Sometimes, a creature considered insignificant is closer to Allah than us.",
                "Status in the court of Allah is based on piety and sincere devotion."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی طاقت",
              "english": "The Power of Supplication"
            },
            "content": {
              "urdu": [
                "دعا تقدیر کو بدلنے اور اللہ کی رحمت کو لانے کا سب سے بڑا ہتھیار ہے۔",
                "ہر حال میں اللہ ہی سے مانگنا بندگی کی اصل معراج ہے۔",
                "اس حدیث سے ہمیں دعا میں اصرار اور عاجزی کا سبق ملتا ہے۔"
              ],
              "english": [
                "Dua is the greatest tool to change destiny and invite Allah's mercy.",
                "Asking only from Allah in every state is the true peak of servitude.",
                "This Hadith teaches us the lesson of persistence and humility in prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
