{
  "hadithId": 886,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/76"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
  
  "takhreej": {
    "arabic": "ضعيف مرفوعاً وصحيح موقوفاً . رواه أبو داود (2110). في إسناده موسى بن مسلم بن رومان وهو ضعيف، وأبو الزبير مدلس وقد عنعنه. والراجح أنه من قول جابر رضي الله عنه وليس مرفوعاً للنبي صلى الله عليه وسلم.",
    "urdu": "یہ روایت مرفوعاً (نبی ﷺ کے قول کے طور پر) ضعیف ہے کیونکہ اس کی سند میں موسیٰ بن مسلم ضعیف ہے اور ابوزبیر مدلس ہیں۔ تاہم، یہ سیدنا جابر رضی اللہ عنہ کے اپنے قول کے طور پر ثابت اور صحیح ہے۔",
    "english": "Weak as a Prophetic saying (Marfu') but authentic as a statement of the companion (Mauquf). Reported by Abu Dawud (2110). Its chain contains Musa bin Muslim, who is weak, and Abu al-Zubayr, who is a Mudallis. The correct view is that it is the statement of Jabir (RA)."
  },
  "importantWords": [
    {
      "arabic": "صَدَاقِ",
      "english": "Dower / Mahr",
      "urdu": "مہر"
    },
    {
      "arabic": "سَوِيقًا",
      "english": "Mush / Barley flour",
      "urdu": "ستو"
    },
    {
      "arabic": "تَمْرًا",
      "english": "Dates",
      "urdu": "کھجوریں"
    },
    {
      "arabic": "اسْتَحَلَّ",
      "english": "Made lawful",
      "urdu": "حلال کر لیا"
    },
    {
      "arabic": "وَقْفِهِ",
      "english": "Mauquf (Companion's statement)",
      "urdu": "موقوف (صحابی کا قول)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ مہر کی کوئی خاص کم سے کم مقدار متعین نہیں ہے؛ معمولی چیز جیسے ستو یا کھجوریں بھی مہر کے طور پر دے کر نکاح کیا جا سکتا ہے۔",
    "english": "This Hadith indicates that there is no fixed minimum amount for Mahr; even something simple like dates or barley flour can suffice to make the marriage lawful."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب النكاح، رقم الحديث ٢١١٠",
      "english": "Sunan Abi Dawud, Book of Marriage, Hadith No. 2110"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S-tS_V6X2Yw",
  "grade": {
    "arabic": "ضعيف مرفوعاً / صحيح موقوفاً",
    "english": "Da'if Marfu' / Sahih Mauquf"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہر کی کم سے کم مقدار",
        "english": "Minimum Amount of Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فقہی مذاہب کی رائے",
              "english": "Juristic Opinions"
            },
            "content": {
              "urdu": [
                "امام شافعی، امام احمد اور امام مالک (ایک قول کے مطابق) کے نزدیک مہر کی کوئی کم سے کم حد مقرر نہیں، ہر وہ چیز جو مال کہلائے مہر بن سکتی ہے۔",
                "امام ابوحنیفہ کے نزدیک مہر کی کم سے کم مقدار دس درہم ہے۔",
                "یہ حدیث امام شافعی اور اہل الحدیث کے موقف کی تائید کرتی ہے کہ معمولی مال بھی مہر ہو سکتا ہے۔"
              ],
              "english": [
                "Imams Shafi'i, Ahmad, and Malik (in one view) believe there is no minimum limit for Mahr; anything of value can be given.",
                "Imam Abu Hanifa sets the minimum Mahr at ten Dirhams.",
                "This Hadith supports the view that even a small amount of wealth can validate the marriage contract."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی اور سہولت",
              "english": "Ease and Facility"
            },
            "content": {
              "urdu": [
                "اسلام غریب اور نادار افراد کے لیے بھی نکاح کو آسان بنانا چاہتا ہے۔",
                "اگر مہر کی مقدار بہت زیادہ مقرر کر دی جائے تو بہت سے لوگ گناہ کی طرف مائل ہو سکتے ہیں۔",
                "نکاح کی اصل روح مہر کی قیمت نہیں بلکہ ایجاب و قبول اور رضا مندی ہے۔"
              ],
              "english": [
                "Islam aims to make marriage accessible even for the poor and needy.",
                "Setting an excessively high Mahr could lead people toward sinful alternatives.",
                "The essence of marriage lies in mutual consent and the contract, not the market value of the Mahr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مہر کی نوعیت (نقدی یا اشیاء)",
        "english": "Nature of Mahr (Cash or Commodities)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی ہر صورت جائز ہے",
              "english": "Any Form of Property is Permissible"
            },
            "content": {
              "urdu": [
                "مہر صرف نقدی (پیسوں) کی صورت میں ہونا ضروری نہیں بلکہ کھجور، اناج یا کوئی بھی مفید چیز ہو سکتی ہے۔",
                "قدیم دور میں ستو اور کھجوریں بنیادی غذائی اجناس تھیں جنہیں مال سمجھا جاتا تھا۔",
                "جدید دور میں بھی کوئی بھی قیمتی شے (سونا، مکان، جائیداد) مہر کے طور پر دی جا سکتی ہے۔"
              ],
              "english": [
                "Mahr does not have to be in cash; it can be dates, grain, or any useful commodity.",
                "In ancient times, dates and barley flour were staple commodities considered as wealth.",
                "In the modern era, any valuable item (gold, house, property) can be designated as Mahr."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیمی مہر",
              "english": "Educational Mahr"
            },
            "content": {
              "urdu": [
                "دیگر صحیح روایات سے ثابت ہے کہ قرآن کی تعلیم دینا بھی مہر کے طور پر قبول کیا گیا ہے۔",
                "یہ ظاہر کرتا ہے کہ مہر کا مقصد عورت کو کوئی فائدہ پہنچانا ہے، خواہ وہ مادی ہو یا علمی۔",
                "مہر کی ادائیگی شوہر پر واجب ہے اور اسے خوش دلی سے ادا کرنا چاہیے۔"
              ],
              "english": [
                "Other Sahih narrations prove that teaching the Quran was also accepted as Mahr.",
                "This shows the purpose of Mahr is to benefit the woman, whether materially or intellectually.",
                "The payment of Mahr is obligatory upon the husband and should be fulfilled willingly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت کا علمی مقام",
        "english": "Scholarly Standing of the Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موقوف روایت کی اہمیت",
              "english": "Importance of Mauquf Reports"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد نے صراحت کی ہے کہ یہ سیدنا جابر کا اپنا فتویٰ ہے جو انہوں نے نبی ﷺ کے عہد کی تعلیمات کی روشنی میں دیا۔",
                "صحابہ کرام کے اقوال و افعال سنت کی تشریح میں بہت اہمیت رکھتے ہیں۔",
                "محدثین کے نزدیک اگرچہ یہ مرفوع نہیں، مگر اس کا مفہوم دیگر صحیح روایات کے موافق ہے۔"
              ],
              "english": [
                "Abu Dawud clarified that this is Jabir's (RA) own verdict based on teachings from the Prophet's era.",
                "The sayings and actions of the Companions carry great weight in interpreting the Sunnah.",
                "Scholars agree that while it may not be Marfu', its meaning aligns with other authentic traditions."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحقیق کی ضرورت",
              "english": "Necessity of Research"
            },
            "content": {
              "urdu": [
                "مہر کے مسائل میں ہمیں صرف ایک ضعیف روایت پر تکیہ نہیں کرنا چاہیے۔",
                "قرآن و سنت کے مجموعی مزاج کو دیکھنا چاہیے جو نکاح میں آسانی کی ترغیب دیتا ہے۔",
                "دین میں غلو (سختی) کے بجائے اعتدال کی راہ اختیار کرنا ہی سنت ہے۔"
              ],
              "english": [
                "In matters of Mahr, we should not rely solely on a single weak narration.",
                "One must look at the overall spirit of the Quran and Sunnah, which encourages ease in marriage.",
                "Following the path of moderation rather than extremism (rigidity) is the true Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح کا پیغام",
        "english": "Message of Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خرید و فروخت سے ممانعت",
              "english": "Avoiding Commercialization"
            },
            "content": {
              "urdu": [
                "مہر کو عورت کی 'قیمت' سمجھنا ایک جاہلانہ تصور ہے جس کی اسلام نفی کرتا ہے۔",
                "یہ ایک شرعی حق ہے جو شوہر کی طرف سے بیوی کے احترام کے طور پر دیا جاتا ہے۔",
                "معاشرے میں مہر کے نام پر ہونے والی نمود و نمائش کو ختم کرنا وقت کی ضرورت ہے۔"
              ],
              "english": [
                "Thinking of Mahr as a 'price' for the woman is an ignorant concept refuted by Islam.",
                "It is a Shariah right given as a mark of respect from the husband to the wife.",
                "Ending the show-off associated with high Mahr amounts is a necessity for social reform."
              ]
            }
          },
          {
            "title": {
              "urdu": "نوجوانوں کی حوصلہ افزائی",
              "english": "Encouraging the Youth"
            },
            "content": {
              "urdu": [
                "یہ حدیث نوجوانوں کو پیغام دیتی ہے کہ غربت نکاح کی راہ میں رکاوٹ نہیں ہونی چاہیے۔",
                "اگر نیت صاف ہو اور اخلاق اچھے ہوں تو معمولی مہر پر بھی برکت والا گھر بسایا جا سکتا ہے۔",
                "اللہ تعالیٰ نکاح کرنے والوں کو اپنے فضل سے غنی کر دیتا ہے۔"
              ],
              "english": [
                "This Hadith sends a message to youth that poverty should not be a barrier to marriage.",
                "If intentions are pure and character is good, a blessed home can be built even with a small Mahr.",
                "Allah Almighty enriches through His grace those who seek to marry for the sake of virtue."
              ]
            }
          }
        ]
      }
    }
  ]
}