{
  "hadithId": 521,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/521"],
    "kitabId": 4,
    "inKitabBab": 4,
    "arabicBook": "كتاب الزكاة",
    "babId": 32
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (4/224)، وأبو داود (1633)، والنسائي (5/99-100). قال الإمام أحمد عن هذا الحديث: \"ما أجوده من حديث\".",
    "urdu": "یہ حدیث صحیح ہے۔ اسے احمد (4/224)، ابوداؤد (1633) اور نسائی نے روایت کیا ہے۔ امام احمد نے اس کی سند کو بہترین قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (4/224), Abu Dawud (1633), and An-Nasa'i (5/99). Imam Ahmad praised the quality of its chain."
  },
  "importantWords": [
    {
      "arabic": "فَقَلَّبَ",
      "english": "Looked up and down",
      "urdu": "الٹ پلٹ کر دیکھا / نظر دوڑائی"
    },
    {
      "arabic": "جَلْدَيْنِ",
      "english": "Strong / Healthy",
      "urdu": "دو طاقتور / توانا"
    },
    {
      "arabic": "لَا حَظَّ",
      "english": "No share / No right",
      "urdu": "کوئی حصہ نہیں"
    },
    {
      "arabic": "مُكْتَسِبٍ",
      "english": "Able to earn",
      "urdu": "کمانے والا / کمانے کی صلاحیت رکھنے والا"
    },
    {
      "arabic": "قَوِيٍّ",
      "english": "Strong person",
      "urdu": "طاقتور"
    },
    {
      "arabic": "اَلْبَصَرَ",
      "english": "Vision / Sight",
      "urdu": "نظر"
    }
  ],
  "summary": {
    "urdu": "زکوٰۃ صرف ضرورت مندوں کے لیے ہے؛ تندرست، طاقتور اور کمانے کی صلاحیت رکھنے والے شخص کے لیے زکوٰۃ کا مال وصول کرنا شرعاً جائز نہیں۔",
    "english": "Zakat is exclusively for the needy; it is not permissible for a wealthy person or a physically fit individual capable of earning to take from Zakat funds."
  },
  "references": [
    {
      "arabic": "مسند أحمد (4/224)",
      "english": "Musnad Ahmad (4/224)"
    },
    {
      "arabic": "سنن أبي داود (1633)",
      "english": "Sunan Abi Dawud (1633)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبيد الله بن عدي",
        "english": "Ubaidullah bin Adi"
      },
      "slug": "ubaidullah-bin-adi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A_0uX2J9Sj8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ کے اصل مستحقین",
        "english": "True Recipients of Zakat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی صحت اور سوال",
              "english": "Physical Health and Begging"
            },
            "content": {
              "urdu": [
                "جس شخص کے پاس ہاتھ پاؤں سلامت ہوں اور وہ کام کر سکتا ہو، اس کے لیے زکوٰۃ مانگنا منع ہے۔",
                "نبی ﷺ نے سائلین کی ظاہری حالت دیکھ کر انہیں ان کی ذمہ داری کا احساس دلایا۔",
                "صحت مند افراد کا زکوٰۃ پر بوجھ بننا معاشرے کے حقیقی ضرورت مندوں کی حق تلفی ہے۔"
              ],
              "english": [
                "A person who is physically sound and capable of working is prohibited from asking for Zakat.",
                "The Prophet (ﷺ) observed the physical state of the askers to remind them of their responsibility.",
                "Healthy individuals relying on Zakat deprive the truly needy of their rightful share."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا طرزِ تربیت",
              "english": "Prophetic Method of Education"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے سائلین کو براہ راست منع کرنے کے بجائے شرعی اصول واضح کر کے ان کی غیرت کو جھنجھوڑا۔",
                "آپ ﷺ نے مال دینے کی پیشکش تو کی مگر ساتھ ہی یہ بھی بتا دیا کہ یہ تمہارے لیے حلال نہیں۔",
                "یہ اسلوب سائل کو خودداری اور محنت کی طرف راغب کرنے کے لیے بہترین ہے۔"
              ],
              "english": [
                "Instead of flatly refusing, the Prophet (ﷺ) clarified Shariah principles to awaken their sense of honor.",
                "He offered to give but simultaneously informed them that it was not rightfully theirs.",
                "This style is excellent for encouraging askers toward self-respect and hard work."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشی خود انحصاری",
        "english": "Economic Self-Reliance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محنت کی عظمت",
              "english": "The Dignity of Labor"
            },
            "content": {
              "urdu": [
                "اسلام گداگری کے بجائے محنت مزدوری کر کے رزق کمانے کی تلقین کرتا ہے۔",
                "طاقتور انسان کا دوسروں کے مال پر نظر رکھنا اس کی اخلاقی پستی کی دلیل ہے۔",
                "کماؤ آدمی اگر زکوٰۃ لے گا تو وہ اپنے چہرے کی آبرو کھو دے گا۔"
              ],
              "english": [
                "Islam encourages earning a livelihood through labor rather than through beggary.",
                "A strong person eyeing others' wealth is a sign of moral degradation.",
                "An able-bodied person taking Zakat loses the dignity and respect of their face."
              ]
            }
          },
          {
            "title": {
              "urdu": "زکوٰۃ کا سماجی مقصد",
              "english": "Social Purpose of Zakat"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کا نظام معذور، بیوہ اور بے سہارا لوگوں کی مدد کے لیے وضع کیا گیا ہے۔",
                "اگر ہر طاقتور شخص زکوٰۃ لینا شروع کر دے تو یہ نظام ناکام ہو جائے گا۔",
                "یہ مال صرف ان کے لیے ہے جو واقعی کمانے سے معذور یا قاصر ہوں۔"
              ],
              "english": [
                "The Zakat system is designed to help the disabled, widows, and the helpless.",
                "If every strong individual starts taking Zakat, the entire social welfare system will fail.",
                "This wealth is exclusively for those who are genuinely unable or hindered from earning."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور انتظامی نکات",
        "english": "Juristic and Administrative Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی ضرورت",
              "english": "Need for Verification"
            },
            "content": {
              "urdu": [
                "زکوٰۃ دینے والے کو چاہیے کہ وہ سائل کی ظاہری صحت اور معاشی حالت کا اندازہ کرے۔",
                "طاقتور سائل کو نصیحت کرنا اور اسے کام کی ترغیب دینا سنتِ نبوی ہے۔",
                "بغیر تحقیق کے زکوٰۃ بانٹنا مستحقین کے حق میں کمی کا باعث بن سکتا ہے۔"
              ],
              "english": [
                "The Zakat giver should evaluate the physical health and economic state of the asker.",
                "Advising a strong asker and encouraging them to work is a Sunnah of the Prophet (ﷺ).",
                "Distributing Zakat without verification may lead to a shortage for the truly deserving."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرام مال سے بچنا",
              "english": "Avoiding Prohibited Wealth"
            },
            "content": {
              "urdu": [
                "مالدار یا کماؤ شخص کے لیے زکوٰۃ کا مال 'آگ' کے مترادف ہے۔",
                "جس مال میں حق نہ ہو اسے لینا برکت کو ختم کر دیتا ہے۔",
                "انسان کو چاہیے کہ وہ تھوڑی حلال کمائی پر قناعت کرے بجائے حرام صدقے کے۔"
              ],
              "english": [
                "For a rich or able person, Zakat money is equivalent to taking 'fire'.",
                "Taking wealth to which one has no right destroys all blessings.",
                "One should be content with a small Halal income rather than taking prohibited charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا پیغام",
        "english": "Message for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیرت اور خودداری",
              "english": "Honor and Self-Respect"
            },
            "content": {
              "urdu": [
                "سچا مومن وہی ہے جو سخت حالات میں بھی اپنی غیرت کا سودا نہیں کرتا۔",
                "ہاتھ پھیلانے کے بجائے ہاتھ سے کام کرنا اللہ کو بے حد پسند ہے۔",
                "معاشرے میں خودداری کے کلچر کو عام کرنا وقت کی اہم ضرورت ہے۔"
              ],
              "english": [
                "A true believer is one who does not trade their honor even in difficult times.",
                "Working with one's hands is far more beloved to Allah than stretching them out to ask.",
                "Promoting a culture of self-respect in society is a vital need of our time."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ اور معاشرتی اصلاح",
              "english": "Sadaqah and Social Reform"
            },
            "content": {
              "urdu": [
                "اگر لوگ اس حدیث پر عمل کریں تو پیشہ ورانہ گداگری کا خاتمہ ہو سکتا ہے۔",
                "حکومت اور اداروں کو چاہیے کہ وہ تندرست لوگوں کو روزگار کے مواقع فراہم کریں۔",
                "زکوٰۃ کا صحیح استعمال ہی غربت کے خاتمے کا واحد حل ہے۔"
              ],
              "english": [
                "If people act upon this Hadith, professional beggary can be eradicated.",
                "Governments and institutions should provide employment opportunities to healthy people.",
                "The correct utilization of Zakat is the only solution for the eradication of poverty."
              ]
            }
          }
        ]
      }
    }
  ]
}