{
  "hadithId": 519,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["bulugh/519"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه الترمذي (681) وقال: حسن صحيح، وأبو داود (1639)، والنسائي (5/97)، وأحمد (5/10). والكد: هو الخدش أو الأثر القبيح.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام ترمذی (681) نے حسن صحیح کہا ہے، نیز ابو داؤد (1639) اور نسائی نے بھی اسے روایت کیا ہے۔ 'الکد' سے مراد خراش یا زخم ہے۔",
    "english": "Sahih. Reported by At-Tirmidhi (681) who graded it Hasan Sahih, Abu Dawud (1639), and An-Nasa'i (5/97). 'Kad' refers to a scratch or an injury that disfigures."
  },
  "importantWords": [
    {
      "arabic": "اَلْمَسْأَلَةُ",
      "english": "Begging / Asking",
      "urdu": "سوال کرنا / مانگنا"
    },
    {
      "arabic": "كَدٌّ",
      "english": "Scratch / Wound",
      "urdu": "زخم / خراش"
    },
    {
      "arabic": "يَكُدُّ",
      "english": "Scratches",
      "urdu": "زخمی کرتا ہے"
    },
    {
      "arabic": "سُلْطَانًا",
      "english": "Ruler / Authority",
      "urdu": "بادشاہ / حاکمِ وقت"
    },
    {
      "arabic": "لَا بُدَّ مِنْهُ",
      "english": "Inevitability / Necessity",
      "urdu": "جس کے بغیر چارہ نہ ہو"
    },
    {
      "arabic": "وَجْهَهُ",
      "english": "His face",
      "urdu": "اس کا چہرہ"
    }
  ],
  "summary": {
    "urdu": "بغیر ضرورت کے لوگوں سے مانگنا انسانی وقار اور چہرے کی آبرو کو زخمی کرنے کے مترادف ہے، البتہ حکومت سے اپنا حق مانگنا یا شدید مجبوری میں سوال کرنا جائز ہے۔",
    "english": "Begging without need disfigures a person's dignity, symbolized as a wound on the face, except when seeking one's right from the state or in extreme necessity."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (681)",
      "english": "Sunan At-Tirmidhi (681)"
    },
    {
      "arabic": "سنن أبي داود (1639)",
      "english": "Sunan Abi Dawud (1639)"
    },
    {
      "arabic": "سنن النسائي (2594)",
      "english": "Sunan An-Nasa'i (2594)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب رضي الله عنه",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6VfX_7Kk",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سوال کی ممانعت اور وجہ",
        "english": "Prohibition and Reason for Begging"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقار کی پامالی",
              "english": "Destruction of Dignity"
            },
            "content": {
              "urdu": [
                "سوال کرنا انسانی شخصیت کے وقار اور خودداری کو ختم کر دیتا ہے۔",
                "حدیث میں اسے 'خراش' سے تشبیہ دی گئی ہے جو چہرے کی خوبصورتی بگاڑ دیتی ہے۔",
                "بلا ضرورت مانگنے والا اپنی عزت کو لوگوں کے سامنے نیلام کرتا ہے۔"
              ],
              "english": [
                "Begging destroys the dignity and self-respect of a human personality.",
                "The Hadith likens it to a 'scratch' that disfigures the beauty of the face.",
                "One who asks without need auctions off his honor before the people."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی اثرات",
              "english": "Moral Impact"
            },
            "content": {
              "urdu": [
                "مانگنے کی عادت انسان کو ذہنی طور پر دوسروں کا غلام بنا دیتی ہے۔",
                "یہ اللہ کے بجائے مخلوق پر بھروسہ کرنے کی علامت ہے۔",
                "مسلسل سوال کرنے سے انسان میں محنت کرنے کا جذبہ ختم ہو جاتا ہے۔"
              ],
              "english": [
                "The habit of begging makes a person mentally enslaved to others.",
                "It is a sign of relying on the creation instead of the Creator.",
                "Persistent begging kills the motivation for hard work in an individual."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جائز سوال کی صورتیں",
        "english": "Permissible Forms of Asking"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمران سے سوال",
              "english": "Asking the Ruler"
            },
            "content": {
              "urdu": [
                "ریاست سے اپنا شرعی حق یا بیت المال سے مدد مانگنا جائز ہے۔",
                "حکمران سے مانگنا عام لوگوں سے مانگنے کی طرح ذلت نہیں ہے۔",
                "یہ عوامی خزانے میں غریبوں کے مقررہ حق کے مطالبے کے زمرے میں آتا ہے۔"
              ],
              "english": [
                "Asking the state for one's legal right or help from the treasury is allowed.",
                "Asking a ruler is not considered humiliating like begging from common people.",
                "This falls under demanding a designated right for the poor in public funds."
              ]
            }
          },
          {
            "title": {
              "urdu": "شدید مجبوری",
              "english": "Extreme Necessity"
            },
            "content": {
              "urdu": [
                "ایسی حالت جہاں جان کا خطرہ ہو یا کوئی دوسرا راستہ نہ رہے، مانگنا جائز ہے۔",
                "مجبوری کی حالت میں سوال کرنا چہرے کے لیے 'زخم' نہیں بنتا۔",
                "شریعت نے ضرورت اور مجبوری کے مواقع پر نرمی رکھی ہے۔"
              ],
              "english": [
                "In situations of life-threatening danger or no alternatives, begging is permissible.",
                "Asking out of absolute necessity does not count as a 'wound' for the face.",
                "Shariah provides concessions in cases of dire need and emergencies."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی ذمہ داری",
        "english": "Social Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سفید پوشوں کی تلاش",
              "english": "Searching for the Dignified Needy"
            },
            "content": {
              "urdu": [
                "معاشرے کو چاہیے کہ ان لوگوں کی مدد کرے جو خودداری کی وجہ سے نہیں مانگتے۔",
                "اصل حقدار وہ ہے جو زخمی چہرے (سوال) کے ساتھ لوگوں کے پاس نہیں جاتا۔",
                "خاموشی سے ضرورت مندوں کی حاجت روائی کرنا بہترین نیکی ہے۔"
              ],
              "english": [
                "Society should help those who do not ask due to their self-respect.",
                "The truly deserving is one who doesn't go to people with a disfigured face (begging).",
                "Quietly fulfilling the needs of the underprivileged is a superior virtue."
              ]
            }
          },
          {
            "title": {
              "urdu": "گداگری کی حوصلہ شکنی",
              "english": "Discouraging Beggary"
            },
            "content": {
              "urdu": [
                "پیشہ ور بھکاریوں کو دینے سے معاشرے میں یہ برائی جڑ پکڑتی ہے۔",
                "ان کی حوصلہ شکنی سے واقعی ضرورت مندوں تک مال پہنچنے کی راہ ہموار ہوتی ہے۔",
                "اسلام ہاتھ پاؤں توڑ کر بیٹھنے کے بجائے محنت کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Giving to professional beggars allows this evil to take root in society.",
                "Discouraging them paves the way for wealth to reach the truly needy.",
                "Islam encourages hard work instead of remaining idle and dependent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قناعت اور توکل",
              "english": "Contentment and Trust"
            },
            "content": {
              "urdu": [
                "اللہ کی دی ہوئی روزی پر قناعت کرنا چہرے کی رونق برقرار رکھتا ہے۔",
                "استغناء (بے نیازی) پیدا کرنا مومن کا اخلاقی کمال ہے۔",
                "صبر اور محنت سے اللہ تبارک و تعالیٰ غیبی مدد فرماتا ہے۔"
              ],
              "english": [
                "Being content with Allah's provision maintains the radiance of the face.",
                "Developing self-sufficiency (Istighna) is a moral perfection for a believer.",
                "Through patience and hard work, Allah provides divine assistance."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کا مطالبہ",
              "english": "Demanding Rights"
            },
            "content": {
              "urdu": [
                "اپنے جائز حقوق کے لیے متعلقہ اداروں سے رجوع کرنا ذلت نہیں ہے۔",
                "دین نے آبرو بچانے کے لیے راستے فراہم کیے ہیں۔",
                "ذاتی سوال اور اجتماعی حقوق کے مطالبے میں فرق سمجھنا ضروری ہے۔"
              ],
              "english": [
                "Approaching relevant authorities for one's legitimate rights is not humiliating.",
                "Religion has provided paths to preserve one's honor.",
                "It is essential to distinguish between personal begging and demanding collective rights."
              ]
            }
          }
        ]
      }
    }
  ]
}