{
  "hadithId": 677,
  "hadithNo": 30,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh:677"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
 
  "takhreej": {
    "arabic": "حسن بشواهده. رواه أحمد (5/412)، والترمذي (1283)، والحاكم (2/55). وفي سنده حيي بن عبد الله المعافري، وثقه ابن معين وغيره، وله شاهد من حديث عبادة بن الصامت.",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر حسن ہے۔ اسے احمد، ترمذی اور حاکم نے روایت کیا ہے۔ اگرچہ اس کی سند میں حیی بن عبد اللہ کی وجہ سے کلام ہے، لیکن ابن معین نے انہیں ثقہ قرار دیا ہے اور اس کا شاہد بھی موجود ہے۔",
    "english": "Hasan due to supporting evidences. Reported by Ahmad (5/412), At-Tirmidhi (1283), and Al-Hakim (2/55). Although there is some discussion regarding its chain, it is strengthened by other narrations."
  },
  "importantWords": [
    {
      "arabic": "فَرَّقَ",
      "english": "Separated",
      "urdu": "جدائی ڈالی"
    },
    {
      "arabic": "وَالِدَةٍ",
      "english": "Mother",
      "urdu": "ماں"
    },
    {
      "arabic": "وَلَدِهَا",
      "english": "Her child",
      "urdu": "اس کا بچہ"
    },
    {
      "arabic": "أَحِبَّتِهِ",
      "english": "His loved ones",
      "urdu": "اس کے پیارے"
    },
    {
      "arabic": "الْقِيَامَةِ",
      "english": "Resurrection",
      "urdu": "قیامت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ماں اور بچے کے درمیان جدائی ڈالنے کی سخت مذمت کی گئی ہے اور اسے قیامت کے دن اپنوں سے محرومی کا سبب قرار دیا گیا ہے۔",
    "english": "This Hadith strictly condemns separating a mother from her child and states it will lead to being separated from one's own loved ones on the Day of Judgment."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (1283)",
      "english": "Reported by At-Tirmidhi (1283)"
    },
    {
      "arabic": "رواه أحمد (5/412)",
      "english": "Reported by Ahmad (5/412)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو أيوب الأنصاري",
        "english": "Abu Ayyub al-Ansari"
      },
      "slug": "abu-ayyub-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FqS_tP7R0sM",
  "grade": {
    "arabic": "حسن بشواهده",
    "english": "Hasan (Good) due to witnesses"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انسانی جذبات کا احترام",
        "english": "Respect for Human Emotions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماں اور بچے کا رشتہ",
              "english": "Mother-Child Bond"
            },
            "content": {
              "urdu": [
                "اسلام میں ماں اور بچے کے درمیان فطری تعلق کو بہت اہمیت دی گئی ہے۔",
                "کسی بھی تجارتی معاملے میں ان کو الگ کرنا انسانیت کے خلاف عمل ہے۔",
                "یہ حدیث لونڈیوں اور غلاموں کے دور میں ان کے حقوق کے تحفظ کے لیے آئی۔"
              ],
              "english": [
                "Islam places immense value on the natural bond between a mother and her child.",
                "Separating them in any transaction is considered an act against humanity.",
                "This Hadith protected the rights of mothers and children during the era of slavery."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم کی مذمت",
              "english": "Condemnation of Oppression"
            },
            "content": {
              "urdu": [
                "ماں سے اس کا بچہ چھیننا ایک بدترین قلبی اذیت اور ظلم ہے۔",
                "شریعت نے ایسے کسی بھی نفع کو حرام قرار دیا ہے جو کسی کی تکلیف کا سبب بنے۔",
                "یہ اصول آج کے دور میں بھی خاندانی بکھراؤ کو روکنے کے لیے رہنمائی دیتا ہے۔"
              ],
              "english": [
                "Taking a child away from their mother is a form of severe emotional torture and oppression.",
                "Sharia forbids any profit gained at the expense of causing such deep pain.",
                "This principle remains a guide for preventing family disintegration in modern times."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مکافاتِ عمل کا قانون",
        "english": "The Law of Retribution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جیسا کرو گے ویسا بھرو گے",
              "english": "As You Sow, So Shall You Reap"
            },
            "content": {
              "urdu": [
                "جو شخص دنیا میں دوسروں کے خاندان اجاڑتا ہے، اس کی سزا قیامت میں ملے گی۔",
                "قیامت کے دن ایسے شخص کو اس کے اپنے پیاروں اور دوستوں سے الگ کر دیا جائے گا۔",
                "یہ سزا اس کے جرم کی نوعیت کے عین مطابق (جنسِ عمل سے) ہوگی۔"
              ],
              "english": [
                "One who destroys other families in this world will face punishment in the hereafter.",
                "On Resurrection Day, such a person will be isolated from their own kin and friends.",
                "The punishment is perfectly aligned with the nature of the crime committed."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیامت کی ہولناکی",
              "english": "Horrors of the Resurrection"
            },
            "content": {
              "urdu": [
                "اپنے پیاروں سے جدائی کا دکھ قیامت کی سختیوں میں مزید اضافہ کر دے گا۔",
                "یہ وعید اس لیے ہے تاکہ انسان کسی کے خاندانی حقوق پامال نہ کرے۔",
                "اللہ تعالیٰ رحیم ہے اور وہ اپنے بندوں پر رحم نہ کرنے والوں کو پسند نہیں کرتا۔"
              ],
              "english": [
                "The pain of separation from loved ones adds to the terrors of the Day of Judgment.",
                "This warning ensures that people do not violate the domestic rights of others.",
                "Allah is Merciful and does not favor those who lack mercy toward His creation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام و حدِ عمر",
        "english": "Juristic Rulings and Age Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جدائی کب جائز ہے؟",
              "english": "When is Separation Allowed?"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک بچے کے سنِ شعور (تقریباً 7 سال) تک اسے ماں سے الگ نہیں کیا جا سکتا۔",
                "کچھ علماء کے نزدیک بلوغت تک ماں اور بچے کو اکٹھا رکھنا ضروری ہے۔",
                "اگر بچہ ماں کا محتاج نہ رہے تو تب ان کی الگ الگ فروخت جائز ہو سکتی ہے۔"
              ],
              "english": [
                "Jurists state a child cannot be separated from the mother until the age of discernment (around 7).",
                "Some scholars believe they must stay together until the child reaches puberty.",
                "Separation or separate sale is only allowed once the child is no longer dependent on the mother."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقسیمِ وراثت اور ہبہ",
              "english": "Inheritance and Gifting"
            },
            "content": {
              "urdu": [
                "یہ حکم صرف بیع (فروخت) تک محدود نہیں بلکہ ہبہ اور تقسیم میں بھی لاگو ہوتا ہے۔",
                "تقسیمِ وراثت کے وقت بھی ماں اور چھوٹے بچے کو ایک ہی وارث کے حصے میں دینا چاہیے۔",
                "اسلامی قانون معاشرے کے کمزور طبقات کے جذبات کا مکمل تحفظ کرتا ہے۔"
              ],
              "english": [
                "This ruling applies not only to sales but also to gifting and distribution.",
                "During inheritance, a mother and her young child should be given to the same heir.",
                "Islamic law fully protects the emotions of the vulnerable sectors of society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رحم دلی کی اہمیت",
              "english": "Importance of Mercy"
            },
            "content": {
              "urdu": [
                "سیدنا ابو ایوب انصاری نے اس حدیث پر عمل کرتے ہوئے روتی ہوئی عورت کی مدد کی۔",
                "صحابہ کرام کے نزدیک علم محض جاننے کا نہیں بلکہ عمل کا نام تھا۔",
                "دوسروں کے دکھ کو محسوس کرنا اور اسے دور کرنا بہترین عبادت ہے۔"
              ],
              "english": [
                "Abu Ayyub al-Ansari practiced this Hadith by helping a weeping mother in distress.",
                "For the Companions, knowledge was not just about information but about action.",
                "Feeling the pain of others and striving to alleviate it is a superior form of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ تجارت میں بھی اخلاقیات کا دامن نہیں چھوڑنا چاہیے۔",
                "حقوق العباد کی پامالی انسان کو اللہ کی رحمت سے دور کر دیتی ہے۔",
                "معاشرے میں محبت اور تعلقات کو جوڑنا دینِ اسلام کا بنیادی مقصد ہے۔"
              ],
              "english": [
                "This Hadith teaches that ethics should never be abandoned, even in business.",
                "Violating the rights of fellow beings distances a person from Allah's mercy.",
                "The core objective of Islam is to foster love and preserve relationships in society."
              ]
            }
          }
        ]
      }
    }
  ]
}