{
  "hadithId": 56,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 4 (Chapter 5)"],
    "kitabId": 1,
    "inKitabBab": 5,
    "arabicBook": "كتاب توقيت المسح على الخفين",
    "babId": 5
  },

  "takhreej": {
    "arabic": "حسن.  رواه النسائي (1/83 -84) ، والترمذي (96) ، وابن خزيمة (196) ، وقال الترمذي: حسن صحيح.  ",
    "urdu": "حسن (درجہ)۔ اسے نسائی (1/83-84)، ترمذی (96) اور ابن خزیمہ (196) نے روایت کیا ہے۔ اور ترمذی نے اسے **حسن صحیح** کہا ہے۔",
    "english": "Ḥasan (Good). Narrated by An-Nasā’ī (1/83-84), At-Tirmidhī (96), and Ibn Khuzaymah (196). At-Tirmidhī graded it as **Ḥasan Ṣaḥīḥ** (Good and Authentic)."
  },
  "importantWords": [
    {
      "arabic": "سَفْرًا",
      "english": "Travelling",
      "urdu": "مسافر"
    },
    {
      "arabic": "لَا نَنْزِعَ",
      "english": "Not to remove",
      "urdu": "نہ اتاریں"
    },
    {
      "arabic": "خِفَافَنَا",
      "english": "Our Khuffayn (socks)",
      "urdu": "ہمارے موزے"
    },
    {
      "arabic": "ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ",
      "english": "Three days and nights",
      "urdu": "تین دن اور تین راتیں"
    },
    {
      "arabic": "جَنَابَةٍ",
      "english": "Major impurity (Janābah)",
      "urdu": "حالت جنابت"
    },
    {
      "arabic": "غَائِطٍ, وَبَوْلٍ, وَنَوْمٍ",
      "english": "Defecation, urine, and sleep",
      "urdu": "بیت الخلاء، پیشاب، اور نیند"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث موزوں پر مسح کی مدت اور اس کے موانع کو بیان کرتی ہے، جس میں مسافر کے لیے تین دن اور تین راتوں کی رخصت دی گئی ہے اور واضح کیا گیا ہے کہ حدث اصغر (چھوٹی ناپاکی) کی صورت میں موزے اتارنا ضروری نہیں، صرف **جنابت (بڑی ناپاکی)** کی صورت میں اتارنا لازم ہے۔",
    "english": "This Hadith clarifies the permissible duration for wiping over Khuffayn: **three days and nights for the traveler** (and one day and night for the resident). It stipulates that only **Janābah** (major impurity) requires removing the socks for Ghusl, while minor impurities (defecation, urine, sleep) only require a fresh wipe."
  },
  "references": [
    {
      "arabic": "سنن النسائي، كتاب الطهارة، رقم 1/83-84",
      "english": "Sunan An-Nasā’ī, The Book of Purification, Hadith 1/83-84"
    },
    {
      "arabic": "جامع الترمذي، كتاب الطهارة، رقم 96",
      "english": "Jami' At-Tirmidhī, The Book of Purification, Hadith 96"
    },
    {
      "arabic": "صحيح ابن خزيمة، رقم 196",
      "english": "Sahih Ibn Khuzaymah, Hadith 196"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "صَفْوَانَ بْنِ عَسَّالٍ اَلْمُرَادِيِّ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Ṣafwān ibn ʿAssāl al-Murādī (May Allah be pleased with him)"
      },
      "slug": "safwan-ibn-assal"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-34-duration-of-wiping",
  "grade": {
    "arabic": "حسن صحيح",
    "english": "Ḥasan Ṣaḥīḥ (Good and Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسح کی مدت اور اس کا آغاز",
        "english": "Duration of Wiping and Its Commencement"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسافر کے لیے مدت",
              "english": "Duration for the Traveler"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر مسافر (سفرًا) کے لیے موزوں پر مسح کی مدت **تین دن اور تین راتیں** مقرر کرتی ہے، جو اسلام کی ایک اہم رخصت ہے۔",
                "مسح کی مدت کا آغاز **موزے پہننے سے نہیں** بلکہ موزے پہننے کے بعد **پہلی بار وضو ٹوٹنے (حدث)** کے وقت سے ہوتا ہے اور گھڑی وہیں سے شروع ہوتی ہے۔",
                "مقصد یہ ہے کہ مسافر طویل راستوں اور سرد موسم میں آسانی سے طہارت کو برقرار رکھ سکے، جو مشقت کو دور کرتا ہے۔"
              ],
              "english": [
                "This Hadith explicitly sets the duration for wiping over the socks for a traveler (*safaran*) to **three days and three nights**, which is a significant concession in Islam.",
                "The counting of this period begins not from the time the socks are worn, but from the moment the **first event that breaks Wudu (ḥadath)** occurs after wearing them.",
                "The purpose is to allow travelers to easily maintain ritual purity over long distances and potentially in cold conditions, thus alleviating hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقیم کے لیے مدت",
              "english": "Duration for the Resident"
            },
            "content": {
              "urdu": [
                "اگرچہ حدیث میں صرف مسافر کا ذکر ہے، لیکن دیگر صحیح روایات سے یہ ثابت ہے کہ مقیم (غیر مسافر) کے لیے مسح کی مدت **ایک دن اور ایک رات** ہے۔",
                "دونوں صورتوں میں، مدت کا تعین پہلی بار وضو ٹوٹنے سے شروع ہوتا ہے اور اس دوران جتنے وضو ٹوٹیں، سب کے لیے موزوں پر مسح کافی ہے۔",
                "یہ فرق اس بات کی دلیل ہے کہ سفر میں مشقت زیادہ ہوتی ہے، اس لیے وہاں زیادہ مدت کی رخصت دی گئی ہے۔"
              ],
              "english": [
                "Although the Hadith only mentions the traveler, other authentic narrations establish that the period for a resident (non-traveler) is **one day and one night**.",
                "In both cases, the time starts from the first Wudu-breaking event, and wiping is sufficient for all subsequent Wudu needs within that period.",
                "This distinction proves that greater hardship during travel warrants a longer duration for the concession."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "موزے اتارنے کے موانع اور مجبوری",
        "english": "Conditions Requiring Removal of Khuffayn"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "موزے اتارنے کی مجبوری (جنابت)",
              "english": "Necessity of Removal (Janābah)"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے واضح فرما دیا کہ موزے صرف حالت **جنابت (بڑی ناپاکی)** میں اتارے جائیں گے، کیونکہ جنابت کے لیے غسل کرنا فرض ہے جس میں پاؤں دھونا لازم ہے۔",
                "جنابت میں پاؤں پر مسح کافی نہیں ہوتا، بلکہ انہیں اتار کر پورے جسم کے ساتھ دھونا ضروری ہوتا ہے تاکہ طہارت کامل ہو سکے۔",
                "جنابت کے علاوہ کسی بھی بڑی ناپاکی (جیسے حیض یا نفاس) میں بھی غسل فرض ہوتا ہے اور اس کے لیے بھی موزے اتارنے ہوں گے۔"
              ],
              "english": [
                "The Prophet (ﷺ) explicitly stated that the socks must only be removed in the case of **Janābah (major impurity)**, because Ghusl (ritual bath) is obligatory in this state, requiring the washing of the feet.",
                "Wiping over the feet is insufficient for Janābah; they must be washed along with the entire body to achieve complete purification (Ghusl).",
                "This rule also applies to any other major impurities (like menstruation or postnatal bleeding), which likewise necessitate the removal of the socks for the obligatory Ghusl."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدث اصغر کی صورتیں",
              "english": "Cases of Minor Impurity (Hadath Asghar)"
            },
            "content": {
              "urdu": [
                "حدیث میں واضح کیا گیا کہ **غائط، بول (پیشاب) اور نیند** (جو حدث اصغر ہیں) کی صورت میں موزے اتارنا ضروری نہیں، بلکہ مسح کافی ہے۔",
                "حدث اصغر (چھوٹی ناپاکی) صرف وضو کو توڑتی ہے، جس کے لیے پاؤں پر دوبارہ مسح کر لینا ہی کافی ہو جاتا ہے۔",
                "یہ حکم اس بات کی دلیل ہے کہ مسح علی الخفین صرف حدث اصغر کے لیے ہی رخصت ہے، نہ کہ حدث اکبر (بڑی ناپاکی) کے لیے۔"
              ],
              "english": [
                "The Hadith clarifies that minor impurities like **defecation, urination, and sleep** (which break Wudu) do not require the removal of the socks, as wiping is sufficient.",
                "Minor impurity (*ḥadath aṣghar*) only necessitates Wudu, for which simply wiping over the socks is enough, thus preserving the concession.",
                "This rule confirms that *Masḥ alā al-Khuffayn* is strictly a concession for *ḥadath aṣghar*, and does not apply to *ḥadath akbar* (major impurity)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی اصول اور حدیث کا درجہ",
        "english": "Legal Principle and Hadith Grading"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رخصت کا وجوب",
              "english": "The Obligation of the Concession"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسح کی رخصت پر عمل کرنے کے جواز کو نہ صرف ثابت کرتی ہے بلکہ نبی ﷺ کا **حکم** (يَأْمُرُنَا) بیان کر کے اس کی اہمیت کو بھی اجاگر کرتی ہے۔",
                "چونکہ یہ حکم نبی ﷺ کی سنت سے ثابت ہے، لہٰذا اس پر عمل کرنا درست ہے، اور بعض علماء نے تو سفر میں موزے نہ اتارنا ہی افضل سمجھا ہے۔",
                "یہ اس بات کا ثبوت ہے کہ شریعت میں جو کام آسانیاں پیدا کرنے کے لیے دیے گئے ہیں، ان پر عمل کرنا اللہ کی رضا کے قریب ہے۔"
              ],
              "english": [
                "The Hadith not only establishes the permissibility of this concession but also highlights its importance by stating the Prophet (ﷺ) **commanded** (*ya'murunā*) them to practice it.",
                "Since this is established by the Prophet's Sunnah, acting upon it is correct, and some scholars even consider keeping the socks on while traveling to be superior.",
                "This proves that adhering to the facilitations granted in the Sharia, like this wiping, is an act pleasing to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسن صحیح کا درجہ",
              "english": "The Grade of Ḥasan Ṣaḥīḥ"
            },
            "content": {
              "urdu": [
                "اس حدیث کو امام ترمذی نے **حسن صحیح** اور ابن خزیمہ نے **صحیح** قرار دیا، جس سے اس کے حکم کی قوت یقینی ہو جاتی ہے۔",
                "اس درجہ کی احادیث فقہی احکام کے لیے بنیادی دلیل کا کام کرتی ہیں اور ان پر عمل کرنا تمام مسلمانوں کے لیے واجب العمل ہے۔",
                "اس روایت کی صحت موزوں پر مسح کی مدت اور اس کے موانع کے بارے میں فقہ اسلامی کا قطعی اصول متعین کرتی ہے۔"
              ],
              "english": [
                "This Hadith was graded as **Ḥasan Ṣaḥīḥ (Good and Authentic)** by Imām At-Tirmidhī and **Sahih** by Ibn Khuzaymah, confirming its strong authenticity.",
                "Ahadith of this grade serve as fundamental proofs for Islamic legal rulings, making their implementation mandatory for all Muslims.",
                "The authenticity of this narration firmly establishes the definitive rule in Islamic Fiqh regarding the duration and limitations of wiping over the socks."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سفر کی آسانی اور فضیلت",
        "english": "Ease and Virtue of Travel"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سفر میں آسانی",
              "english": "Ease During Travel"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے یہ آسانی خاص طور پر **سفر** کے لیے دی، کیونکہ سفر میں وضو اور طہارت کی پابندی مشکل ہو سکتی ہے، اور سردی کا موسم بھی ہو سکتا ہے۔",
                "سفر میں موزے اتارنا اور پہننا، اور پاؤں کو دھونا بوجھ بن سکتا ہے، اس لیے رخصت دی گئی تاکہ عبادت میں کوئی کمی نہ آئے۔",
                "یہ حکم اسلام کے اس اصول کو ظاہر کرتا ہے کہ **سفر خود ایک مشقت ہے**، اس لیے اس میں کئی عبادات میں آسانی دی گئی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) granted this ease specifically for **travel** because maintaining Wudu and purity can be difficult during movement or in harsh weather.",
                "Removing and wearing socks repeatedly, along with washing the feet, can become burdensome during a journey, hence the extended duration of the concession.",
                "This instruction reflects the Islamic legal maxim that **travel itself is a source of hardship**, thus justifying concessions in various acts of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "صفوان بن عسالؓ کا راوی ہونا",
              "english": "Ṣafwān ibn ʿAssāl as Narrator"
            },
            "content": {
              "urdu": [
                "سیدنا صفوان بن عسال رضی اللہ عنہ ان صحابہ میں سے ہیں جنہوں نے نبی ﷺ کے ساتھ سفر کیا اور آپ کے عملی احکام کو بغور محفوظ کیا۔",
                "ان کی روایت سے یہ حکم نہ صرف ثابت ہوتا ہے بلکہ یہ بھی معلوم ہوتا ہے کہ نبی ﷺ سفر میں اپنے ساتھیوں کو اس رخصت پر عمل کرنے کا **حکم** دیتے تھے۔",
                "یہ اس بات کی دلیل ہے کہ صحابہ کرام نے دین کی تعلیم کو نہ صرف قبول کیا بلکہ اس پر عمل بھی کیا۔"
              ],
              "english": [
                "Sayyiduna Ṣafwān ibn ʿAssāl (RA) is among the Companions who traveled with the Prophet (ﷺ) and meticulously preserved his practical rulings.",
                "His narration not only confirms the ruling but also informs us that the Prophet (ﷺ) **commanded** his companions to utilize this concession while traveling.",
                "This highlights the diligence of the Companions in not only accepting the teachings but also implementing and propagating them for the benefit of the Ummah."
              ]
            }
          }
        ]
      }
    }
  ]
}
