{
  "hadithId": 1329,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": [
      "abudawud:4918"
    ],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "كتاب الجامع",
    "babId": 106
  },
 
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (4918)، والترمذي (1929)، والبخاري في الأدب المفرد (238). وصححه الألباني في صحيح الجامع (6656).",
    "urdu": "یہ حدیث حسن ہے۔ اسے امام ابوداؤد (4918)، امام ترمذی (1929) اور امام بخاری نے الادب المفرد میں روایت کیا ہے۔ علامہ البانی نے اسے صحیح الجامع میں صحیح قرار دیا ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (4918), At-Tirmidhi (1929), and Al-Bukhari in Al-Adab al-Mufrad. Authenticated by Al-Albani in Sahih al-Jami' (6656)."
  },
  "importantWords": [
    {
      "arabic": "مِرْآةُ",
      "english": "Mirror",
      "urdu": "آئینہ"
    },
    {
      "arabic": "يَكُفُّ",
      "english": "Restrains / Protects",
      "urdu": "روکتا ہے / حفاظت کرتا ہے"
    },
    {
      "arabic": "ضَيْعَتَهُ",
      "english": "His loss / property",
      "urdu": "اس کا نقصان / ضیاع"
    },
    {
      "arabic": "يَحُوطُهُ",
      "english": "Guards him / surrounds him",
      "urdu": "اس کی پہرہ داری کرتا ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مومنوں کے باہمی تعلق کی خوبصورت مثال پیش کرتی ہے کہ جیسے آئینہ بلا مبالغہ عیب دکھاتا ہے، ویسے ہی مومن کو دوسرے کی خیر خواہی کرتے ہوئے اس کی اصلاح کرنی چاہیے۔",
    "english": "This Hadith presents a beautiful metaphor for the relationship between believers: just as a mirror reflects reality without exaggeration, a believer should help rectify their fellow brother with sincerity."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4918)",
      "english": "Sunan Abu Dawud (4918)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آئینے کی خصوصیات اور مومن کا کردار",
        "english": "Characteristics of a Mirror and the Believer's Role"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانتداری اور سچائی",
              "english": "Integrity and Truthfulness"
            },
            "content": {
              "urdu": [
                "آئینہ عیب کو ویسا ہی دکھاتا ہے جیسا وہ ہے، نہ کم نہ زیادہ۔",
                "مومن کو چاہیے کہ جب وہ اپنے بھائی کی اصلاح کرے تو مبالغہ آرائی سے کام نہ لے۔",
                "خیر خواہی کا تقاضا ہے کہ تنقید برائے تنقید کے بجائے مقصد صرف درستی ہو۔"
              ],
              "english": [
                "A mirror shows a fault exactly as it is, without addition or subtraction.",
                "A believer should not exaggerate when trying to rectify a fellow brother's mistake.",
                "Sincere counsel requires that the goal be improvement, not mere criticism."
              ]
            }
          },
          {
            "title": {
              "urdu": "پردہ پوشی اور تنہائی",
              "english": "Privacy and Concealment"
            },
            "content": {
              "urdu": [
                "آئینہ عیب صرف اس وقت دکھاتا ہے جب انسان اس کے سامنے ہو، پیٹھ پیچھے نہیں۔",
                "مومن کو چاہیے کہ وہ اپنے بھائی کو نصیحت تنہائی میں کرے، لوگوں کے سامنے رسوا نہ کرے۔",
                "آئینہ عیب کو محفوظ نہیں رکھتا، بلکہ سامنے سے ہٹتے ہی اسے چھپا لیتا ہے۔"
              ],
              "english": [
                "A mirror only reveals a fault when the person is in front of it, not behind their back.",
                "A believer should advise his brother privately, not humiliate him in public.",
                "A mirror does not store the image of the fault; it conceals it as soon as the person moves away."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "باہمی تعاون اور تحفظ",
        "english": "Mutual Cooperation and Protection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان سے بچانا",
              "english": "Protection from Loss"
            },
            "content": {
              "urdu": [
                "حدیث کے اگلے حصے کے مطابق مومن اپنے بھائی کو ضائع ہونے سے بچاتا ہے۔",
                "وہ اس کے مال، جان اور آبرو کا محافظ بن کر رہتا ہے۔",
                "سچا دوست وہی ہے جو برائی کے راستے پر کانٹا بن کر کھڑا ہو جائے تاکہ بھائی گناہ سے بچ جائے۔"
              ],
              "english": [
                "According to the rest of the Hadith, a believer prevents his brother from being ruined.",
                "He acts as a guardian of his brother's wealth, life, and honor.",
                "A true friend is one who stands as an obstacle on the path of evil to save his brother from sin."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیر موجودگی میں دفاع",
              "english": "Defense in Absence"
            },
            "content": {
              "urdu": [
                "مومن اپنے بھائی کی غیر موجودگی میں اس کی عزت کا دفاع کرتا ہے۔",
                "وہ اپنے بھائی کے لیے ایک مضبوط قلعے کی مانند ہے جو اسے دشمنوں کے شر سے بچاتا ہے۔",
                "اسلامی اخوت کا تقاضا ہے کہ ہم ایک دوسرے کی کمزوریوں کو سہارا دیں۔"
              ],
              "english": [
                "A believer defends the honor of his brother even in his absence.",
                "He is like a fortified fortress for his brother, protecting him from the evil of enemies.",
                "Islamic brotherhood requires us to support each other's weaknesses."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اصلاحِ معاشرہ کا نبوی طریقہ",
        "english": "Prophetic Method of Social Reform"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نرمی اور محبت",
              "english": "Gentleness and Love"
            },
            "content": {
              "urdu": [
                "آئینہ ٹھنڈا اور صاف ہوتا ہے، اسی طرح مومن کا رویہ بھی نرم ہونا چاہیے۔",
                "سخت کلامی سے نصیحت اثر کھو دیتی ہے اور ضد پیدا کرتی ہے۔",
                "خلوصِ نیت کے ساتھ کی گئی بات ہی دلوں میں جگہ بناتی ہے۔"
              ],
              "english": [
                "A mirror is cool and clear; similarly, a believer's attitude should be gentle.",
                "Harsh speech makes advice lose its impact and breeds stubbornness.",
                "Only words spoken with sincere intention find a place in the heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعمیری تنقید کی عادت",
              "english": "Habit of Constructive Criticism"
            },
            "content": {
              "urdu": [
                "جب کسی میں کوئی برائی دیکھیں تو اسے آئینے کی طرح خاموشی سے اور تنہائی میں بتائیں۔",
                "دوسروں کی اصلاح سے پہلے اپنے آئینے (کردار) کو صاف رکھیں تاکہ عکس درست نظر آئے۔",
                "معاشرے میں ایک دوسرے کا بوجھ بانٹنے والے اور خیر خواہ بنیں۔"
              ],
              "english": [
                "When you see an evil in someone, inform them privately and calmly like a mirror.",
                "Keep your own 'mirror' (character) clean before correcting others so the reflection is accurate.",
                "Be well-wishers who share each other's burdens in society."
              ]
            }
          }
        ]
      }
    }
  ]
}