{
  "hadithId": 83,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bukhari:153", "muslim:267"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": "صحيح. رواه البخاري (153) ، ومسلم (267) (63) ",
    "urdu": "یہ حدیث **صحیح** ہے۔ اسے بخاری (153) اور مسلم (267، 63) نے روایت کیا ہے۔ یہ اسلام کی متفقہ احادیث میں سے ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (153) and Muslim (267) (63). This is one of the firmly established and agreed-upon Ahadith (Muttafaq Alayh)."
  },
  "importantWords": [
    {
      "arabic": "يُمْسِكَنَّ",
      "english": "He should hold",
      "urdu": "وہ نہ چھوئے / نہ پکڑے"
    },
    {
      "arabic": "ذَكَرَهُ",
      "english": "His male organ",
      "urdu": "اپنا عضو مخصوص"
    },
    {
      "arabic": "بِيَمِينِهِ",
      "english": "With his right hand",
      "urdu": "دائیں ہاتھ سے"
    },
    {
      "arabic": "يَبُولُ",
      "english": "He is urinating",
      "urdu": "پیشاب کر رہا ہو"
    },
    {
      "arabic": "يَتَمَسَّحْ",
      "english": "He should cleanse/wipe himself",
      "urdu": "وہ استنجاء کرے"
    },
    {
      "arabic": "يَتَنَفَّسْ",
      "english": "He breathes",
      "urdu": "سانس لے"
    },
    {
      "arabic": "اَلْإِنَاءِ",
      "english": "The vessel (for drinking)",
      "urdu": "برتن میں"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon (Bukhari & Muslim)",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "نَهْي",
      "english": "Prohibition",
      "urdu": "ممانعت"
    },
    {
      "arabic": "أَدَب",
      "english": "Etiquette / Manner",
      "urdu": "آداب"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث طہارت اور کھانے پینے کے تین اہم آداب بیان کرتی ہے: **قضائے حاجت کے دوران دائیں ہاتھ سے عضو کو چھونا یا استنجاء کرنا حرام ہے**، اور **پینے کے دوران برتن میں سانس لینا منع ہے**۔",
    "english": "This Hadith establishes three essential etiquettes related to purity and consumption: **it is forbidden to touch the private parts or perform Istinja' with the right hand** while relieving oneself, and **it is prohibited to breathe into the drinking vessel.**"
  },
  "references": [
    {
      "arabic": "رواه البخاري (153)",
      "english": "Reported by Al-Bukhari (No. 153)"
    },
    {
      "arabic": "رواه مسلم (267)",
      "english": "Reported by Muslim (No. 267)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي قَتَادَةَ  - رضى الله عنه",
        "english": "Abu Qatadah (May Allah be pleased with him)"
      },
      "slug": "abu-qatadah"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih Muttafaq Alayh (Agreed upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دائیں ہاتھ کی ممانعت کا حکم",
        "english": "The Prohibition of Using the Right Hand"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پیشاب میں عضو کو چھونا",
              "english": "Touching the Organ during Urination"
            },
            "content": {
              "urdu": [
                "حدیث میں سب سے پہلے **پیشاب کے دوران عضو کو دائیں ہاتھ سے پکڑنے یا چھونے سے سختی سے منع** کیا گیا ہے۔",
                "یہ حکم اس لیے ہے تاکہ دائیں ہاتھ کو نجاست اور گندگی سے پاک رکھا جا سکے، کیونکہ یہ ہاتھ کھانے پینے اور مبارک کاموں کے لیے مخصوص ہے۔",
                "عضو کو سنبھالنے یا چھونے کے لیے ہمیشہ **بایاں ہاتھ** استعمال کرنا چاہیے، جو نجاست کی صفائی کے لیے مختص ہے۔"
              ],
              "english": [
                "The Hadith first **strictly prohibits touching or holding the private organ with the right hand while urinating**.",
                "This command is given to keep the right hand clean from impurity, as this hand is designated for eating, drinking, and honorable deeds.",
                "The **left hand** must always be used for handling or touching the private organ, as it is designated for cleansing impurities."
              ]
            }
          },
          {
            "title": {
              "urdu": "استنجاء میں ممانعت",
              "english": "Prohibition in Istinja' (Cleansing)"
            },
            "content": {
              "urdu": [
                "دوسرا حکم یہ ہے کہ **قضائے حاجت کے بعد دائیں ہاتھ سے استنجاء یا صفائی بالکل نہ کی جائے**۔",
                "نجاست کو زائل کرنے کا عمل بائیں ہاتھ سے کرنا فرض ہے تاکہ دائیں ہاتھ کی پاکیزگی برقرار رہے۔",
                "یہ اصول آج بھی تمام فقہی مسالک میں متفقہ ہے کہ طہارت کی صفائی کے لیے صرف بائیں ہاتھ کا استعمال ضروری ہے۔"
              ],
              "english": [
                "The second ruling is the **absolute prohibition of performing Istinja' or cleansing with the right hand** after answering the call of nature.",
                "The act of removing impurity must be performed with the left hand to maintain the purity and sacred role of the right hand.",
                "This principle remains a unanimously agreed-upon rule across all schools of jurisprudence: use the left hand exclusively for cleaning impurities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دائیں اور بائیں ہاتھ کا شرعی اصول",
        "english": "The Shari'ah Principle of Right and Left Hand"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تفریق کا معیار",
              "english": "Standard of Differentiation"
            },
            "content": {
              "urdu": [
                "اسلام میں دائیں اور بائیں ہاتھ کے استعمال میں واضح **تفریق اور اصول** موجود ہیں جو تعظیم پر مبنی ہے۔",
                "دایاں ہاتھ ہر اس کام کے لیے استعمال ہوتا ہے جو **عزت اور شرافت** والا ہو، جیسے کھانا، پینا، مصافحہ اور سلام کرنا۔",
                "بایاں ہاتھ ہر اس کام کے لیے مختص ہے جو **نجاست، گندگی یا حقیر** سمجھا جاتا ہو، جیسے استنجاء کرنا اور ناک صاف کرنا۔"
              ],
              "english": [
                "Islam maintains clear **differentiation and rules** for using the right and left hands, based on respect (Ta'zim).",
                "The right hand is reserved for every act that is **honorable and respectable**, such as eating, drinking, shaking hands, and greeting.",
                "The left hand is designated for every act associated with **impurity, filth, or deemed undesirable**, such as Istinja' and clearing the nose."
              ]
            }
          },
          {
            "title": {
              "urdu": "وجوب یا کراہت",
              "english": "Obligation vs. Dislike (Karahah)"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک قضائے حاجت میں دائیں ہاتھ سے چھونا یا استنجاء کرنا **تحریماً مکروہ** ہے، یعنی حرام کے قریب ہے۔",
                "یہ حکم اس لیے سخت ہے کیونکہ یہ عمومی اسلامی آداب اور نبی صلی اللہ علیہ وسلم کی واضح ممانعت کے خلاف ہے۔",
                "اگر کوئی مجبوری یا عذر ہو (جیسے دایاں ہاتھ مفلوج ہو) تو دائیں ہاتھ کا استعمال جائز ہے، ورنہ اس سے بچنا واجب ہے۔"
              ],
              "english": [
                "According to the majority of jurists, touching the private organ or performing Istinja' with the right hand is **Tahrīman Makrūh** (disliked to the point of being forbidden).",
                "This ruling is strict because it violates general Islamic etiquette and the clear prohibition of the Prophet (PBUH).",
                "If there is a necessity or excuse (e.g., the left hand is paralyzed), then using the right hand is permissible, otherwise, avoiding it is mandatory."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پینے کے آداب اور حفظان صحت",
        "english": "Etiquette of Drinking and Hygiene"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "برتن میں سانس لینے سے ممانعت",
              "english": "Prohibition of Breathing into the Vessel"
            },
            "content": {
              "urdu": [
                "حدیث کا تیسرا حصہ یہ حکم دیتا ہے کہ **پیتے وقت برتن میں سانس نہ لی جائے**، جو ایک اہم اخلاقی اور طبی اصول ہے۔",
                "برتن میں سانس لینے سے اس میں بوندیں اور جراثیم منتقل ہوتے ہیں، جس سے پانی پینے والے دوسروں کے لیے ناگوار یا مضر صحت ہو سکتا ہے۔",
                "سنت یہ ہے کہ پینے سے پہلے برتن کو منہ سے ہٹا کر باہر سانس لی جائے اور ایسا عمل تین سانسوں میں مکمل کیا جائے۔"
              ],
              "english": [
                "The third part of the Hadith commands **not to breathe into the vessel while drinking**, a key ethical and hygienic principle.",
                "Breathing into the vessel transfers droplets and germs, which can make the water unpleasant or unhealthy for others who drink from it.",
                "The Sunnah is to remove the vessel from the mouth, breathe outside, and complete the drinking process in three separate breaths."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی آداب اور نظافت",
              "english": "Social Etiquette and Cleanliness"
            },
            "content": {
              "urdu": [
                "پانی کے برتن میں سانس لینے سے ممانعت کا حکم **عوامی نظافت** اور **شریک استعمال کی جانے والی چیزوں کے تقدس** کو ظاہر کرتا ہے۔",
                "یہ دوسروں کے ساتھ اشتراک اور مہمان نوازی کے اسلامی آداب کا حصہ ہے تاکہ ہر شخص کو پاک اور صاف پانی میسر ہو۔",
                "یہ حکم اس بات پر زور دیتا ہے کہ اسلامی آداب صرف فرد کی صفائی نہیں بلکہ **اجتماعی صحت اور حسنِ سلوک** کا بھی حصہ ہیں۔"
              ],
              "english": [
                "The prohibition on breathing into the vessel underscores **public cleanliness** and the **sanctity of shared utensils**.",
                "This is part of the Islamic etiquette of sharing and hospitality, ensuring that pure and clean water is available to everyone.",
                "This ruling emphasizes that Islamic manners encompass not only individual cleanliness but also **public health and good social conduct**."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی جامعیت اور صحت",
        "english": "Comprehensiveness and Authenticity of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحت اور جامعیت",
              "english": "Authenticity and Comprehensiveness"
            },
            "content": {
              "urdu": [
                "یہ حدیث 'متفق علیہ' ہے، جس کی سند بے عیب ہے اور اس کے احکام **وجوب اور استحباب** کے درمیان آتے ہیں۔",
                "یہ ایک ہی حدیث طہارت، حفظان صحت اور کھانے پینے کے تین اہم اور مختلف شعبوں کے آداب کو جامعیت کے ساتھ بیان کرتی ہے۔",
                "اس کے احکام پر عمل کرنا نبی صلی اللہ علیہ وسلم کی سنت کی کامل پیروی اور اعلیٰ اخلاق کا مظہر ہے۔"
              ],
              "english": [
                "This Hadith is 'Muttafaq Alayh' (Agreed upon), possessing an impeccable chain, and its rulings fall between **obligation and recommendation**.",
                "It comprehensively covers etiquette in three important and distinct fields: purity, hygiene, and consumption.",
                "Adhering to its commands is a sign of complete adherence to the Prophet's Sunnah and the manifestation of high moral character."
              ]
            }
          },
          {
            "title": {
              "urdu": "عام حیاء کا اصول",
              "english": "General Principle of Modesty (Haya)"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک عمومی اصول فراہم کرتی ہے کہ **نجاست کا معاملہ ہمیشہ بائیں ہاتھ سے** اور **عزت کا معاملہ دائیں ہاتھ سے** کیا جائے۔",
                "یہ تفریق اسلامی زندگی میں نظم و ضبط اور فطری حیاء کی عکاس ہے، جسے ہر مسلمان کو اپنانا چاہیے۔",
                "جو شخص اس حکم کی خلاف ورزی کرتا ہے، وہ صرف سنت نہیں چھوڑتا بلکہ اسلامی معاشرتی آداب کے معیار کو بھی مجروح کرتا ہے۔"
              ],
              "english": [
                "The Hadith establishes the general rule that **matters of impurity should always be handled with the left hand** and **matters of honor with the right hand**.",
                "This distinction reflects the order and innate modesty (Fitrah) within the Islamic way of life, which every Muslim must adopt.",
                "One who violates this command not only neglects a Sunnah but also degrades the standard of Islamic social etiquette."
              ]
            }
          }
        ]
      }
    }
  ]
}
