{
  "hadithId": 556,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/50"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "حسن. رواه النسائي (2422)، والترمذي (761)، وابن حبان (3647). قال الترمذي: 'هذا حديث حسن'.",
    "urdu": "حسن روایت۔ اسے امام نسائی، ترمذی اور ابن حبان نے روایت کیا ہے۔ امام ترمذی نے اسے حسن قرار دیا ہے اور دیگر شواہد اس کی تائید کرتے ہیں۔",
    "english": "Hasan (Good). Reported by an-Nasa'i (2422), at-Tirmidhi (761), and Ibn Hibban (3647). At-Tirmidhi graded it as Hasan."
  },
  "importantWords": [
    {
      "arabic": "أَمَرَنَا",
      "english": "Commanded us",
      "urdu": "ہمیں حکم دیا"
    },
    {
      "arabic": "نَصُومَ",
      "english": "To fast",
      "urdu": "ہم روزہ رکھیں"
    },
    {
      "arabic": "اَلشَّهْرِ",
      "english": "The month",
      "urdu": "مہینہ"
    },
    {
      "arabic": "ثَلَاثَةَ أَيَّامٍ",
      "english": "Three days",
      "urdu": "تین دن"
    },
    {
      "arabic": "ثَلَاثَ عَشْرَةَ",
      "english": "Thirteenth",
      "urdu": "تیرہ"
    }
  ],
  "summary": {
    "urdu": "ہر قمری مہینے کی 13، 14 اور 15 تاریخ کو روزے رکھنا سنتِ موکدہ ہے، جنہیں 'ایامِ بیض' کے روزے کہا جاتا ہے۔",
    "english": "It is a confirmed Sunnah to fast on the 13th, 14th, and 15th of every lunar month, known as 'Ayyam al-Beed' (The White Days)."
  },
  "references": [
    {
      "arabic": "رواه النسائي (2422)",
      "english": "Reported by an-Nasa'i (2422)"
    },
    {
      "arabic": "رواه الترمذي (761)",
      "english": "Reported by at-Tirmidhi (761)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو ذر الغفاري",
        "english": "Abu Dharr al-Ghifari"
      },
      "slug": "abu-dharr-al-ghifari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0_u6uB2n7e8",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ایامِ بیض کی اہمیت",
        "english": "Significance of Ayyam al-Beed"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سفید دنوں کے روزے",
              "english": "Fasts of the White Days"
            },
            "content": {
              "urdu": [
                "انہیں ایامِ بیض اس لیے کہا جاتا ہے کیونکہ ان راتوں میں چاند مکمل اور روشن ہوتا ہے۔",
                "نبی ﷺ نے ان مخصوص ایام میں روزہ رکھنے کی خاص تلقین فرمائی ہے۔",
                "یہ ایام روحانی طور پر خود کو منور کرنے کا بہترین موقع فراہم کرتے ہیں۔"
              ],
              "english": [
                "They are called Ayyam al-Beed because the moon is full and bright during these nights.",
                "The Prophet (ﷺ) specifically encouraged fasting on these particular days.",
                "These days provide an excellent opportunity to spiritually enlighten oneself."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا مستقل معمول",
              "english": "The Prophet's Regular Practice"
            },
            "content": {
              "urdu": [
                "احادیث سے معلوم ہوتا ہے کہ آپ ﷺ سفر اور حضر میں یہ روزے نہیں چھوڑتے تھے۔",
                "یہ عمل اللہ کے قرب اور سنت کی پیروی کا بہترین نمونہ ہے۔",
                "صحابہ کرام بھی اس حکم پر سختی سے عمل پیرا رہنے کی کوشش کرتے تھے۔"
              ],
              "english": [
                "Hadiths indicate that the Prophet (ﷺ) did not skip these fasts whether traveling or at home.",
                "This practice is a prime example of seeking closeness to Allah and following the Sunnah.",
                "The Companions also strove to strictly adhere to this command."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر و ثواب کی وسعت",
        "english": "Magnitude of Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پورے سال کے روزوں کا ثواب",
              "english": "Reward of Fasting the Whole Year"
            },
            "content": {
              "urdu": [
                "ایک نیکی کا اجر دس گنا ہوتا ہے، اس طرح تین روزے تیس دنوں کے برابر ہیں۔",
                "ہر ماہ تین روزے رکھنے والا گویا پوری زندگی روزے رکھنے کا ثواب پاتا ہے۔",
                "یہ اللہ تعالیٰ کا اپنی امت پر خاص فضل اور احسان ہے۔"
              ],
              "english": [
                "The reward for one good deed is tenfold, so three days equal thirty days.",
                "One who fasts three days every month earns the reward of fasting a lifetime.",
                "This is a special grace and favor from Allah upon this Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی اور روحانی صفائی",
              "english": "Physical and Spiritual Cleansing"
            },
            "content": {
              "urdu": [
                "روزہ رکھنے سے انسان کے نفس کی پاکیزگی اور تقویٰ حاصل ہوتا ہے۔",
                "جدید تحقیق کے مطابق ماہانہ روزے جسمانی صحت کے لیے بھی مفید ہیں۔",
                "یہ عمل انسان کو گناہوں کی آلائشوں سے پاک رکھنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "Fasting achieves the purification of the soul and the attainment of piety.",
                "According to modern research, monthly fasting is beneficial for physical health.",
                "This practice helps keep a person clean from the impurities of sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات اور لچک",
        "english": "Juristic Rulings and Flexibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تاریخوں کا تعین",
              "english": "Fixing the Dates"
            },
            "content": {
              "urdu": [
                "اگرچہ 13، 14 اور 15 تاریخ افضل ہیں، لیکن مہینے میں کوئی سے بھی تین روزے رکھے جا سکتے ہیں۔",
                "شریعت نے نفلی عبادات میں وسعت اور آسانی رکھی ہے۔",
                "اصل مقصد ماہانہ بنیادوں پر روزے کی عادت ڈالنا ہے۔"
              ],
              "english": [
                "While the 13th, 14th, and 15th are best, any three days in a month can be fasted.",
                "Sharia has provided breadth and ease in voluntary acts of worship.",
                "The primary goal is to establish the habit of fasting on a monthly basis."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلسل یا متفرق روزے",
              "english": "Consecutive or Separate Fasts"
            },
            "content": {
              "urdu": [
                "بہتر یہ ہے کہ یہ تینوں روزے لگاتار رکھے جائیں جیسا کہ حدیث میں ہے۔",
                "اگر کوئی عذر ہو تو الگ الگ دنوں میں بھی رکھے جا سکتے ہیں۔",
                "نیت کا خلوص اور سنت کی اتباع اجر کی بنیاد ہے۔"
              ],
              "english": [
                "It is preferable to fast these three days consecutively as mentioned in the Hadith.",
                "If there is an excuse, they may also be kept on separate days.",
                "Sincerity of intention and following the Sunnah are the basis of the reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی تربیت",
              "english": "Training in Discipline"
            },
            "content": {
              "urdu": [
                "ماہانہ روزے انسان کی زندگی میں نظم و ضبط پیدا کرتے ہیں۔",
                "یہ ہمیں اپنی خواہشات پر قابو پانے کی مشق کرواتے ہیں۔",
                "مومن کی زندگی میں عبادات کا ایک باقاعدہ نظام ہونا ضروری ہے۔"
              ],
              "english": [
                "Monthly fasts instill discipline in a person's life.",
                "They provide practice in controlling one's desires and impulses.",
                "It is essential for a believer's life to have a regular system of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیکی کے مواقع کی تلاش",
              "english": "Seeking Opportunities for Good"
            },
            "content": {
              "urdu": [
                "ہمیں سنتِ نبوی کے مطابق نیکی کے چھوٹے چھوٹے مواقع تلاش کرنے چاہئیں۔",
                "ایامِ بیض کے روزے رکھنا ایک آسان لیکن نہایت با اجر عمل ہے۔",
                "دوسروں کو بھی اس سنت کی یاد دہانی کروانا صدقہ جاریہ ہے۔"
              ],
              "english": [
                "We should seek small opportunities for good according to the Prophetic Sunnah.",
                "Fasting Ayyam al-Beed is an easy yet highly rewarding deed.",
                "Reminding others of this Sunnah is a form of ongoing charity (Sadaqah Jariyah)."
              ]
            }
          }
        ]
      }
    }
  ]
}