{
  "hadithId": 339,
  "hadithNo": 26,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 2,
    "inKitabBab": 10,
    "arabicBook": "كتاب الصلاة",
    "babId": 20
  },
 
  "takhreej": {
    "arabic": "ضعيف جداً أو موضوع. رواه الدارقطني (2/56)، والطبراني في الكبير (12/272). قال الحافظ ابن حجر في بلوغ المرام: \"بإسناد ضعيف\"، وقال الألباني في ضعيف الجامع (3510): \"موضوع\". ففي أسانيده مجاهيل ومتروكون.",
    "urdu": "یہ روایت سخت ضعیف یا موضوع (من گھڑت) ہے۔ اسے دارقطنی (2/56) اور طبرانی نے روایت کیا ہے۔ حافظ ابن حجر نے اسے 'ضعیف' کہا ہے، جبکہ علامہ البانی نے اسے 'موضوع' قرار دیا ہے کیونکہ اس کی تمام سندیں نہایت واہی اور کمزور ہیں۔",
    "english": "Very weak or fabricated (Mawdu'). Reported by ad-Daraqutni (2/56) and at-Tabarani. Al-Hafiz Ibn Hajar mentioned its chain is weak, while Al-Albani graded it as 'Fabricated' in Da'if al-Jami' (3510) due to unknown and abandoned narrators in its chains."
  },
  "importantWords": [
    {
      "arabic": "صَلُّوا عَلَى",
      "english": "Pray over (Funeral)",
      "urdu": "نماز جنازہ پڑھو"
    },
    {
      "arabic": "صَلُّوا خَلْفَ",
      "english": "Pray behind (Imamate)",
      "urdu": "پیچھے نماز پڑھو"
    },
    {
      "arabic": "لَا إِلَهَ إِلَّا اَللَّهُ",
      "english": "The Kalimah of Tawheed",
      "urdu": "کلمہ توحید"
    }
  ],
  "summary": {
    "urdu": "اگرچہ اس خاص حدیث کی سند ضعیف ہے، لیکن اس کا مفہوم اہل سنت کے عمومی اصول کی عکاسی کرتا ہے کہ ہر کلمہ گو مسلمان کا جنازہ پڑھا جائے گا اور کسی مسلمان امام کے پیچھے (چاہے وہ گنہگار ہی کیوں نہ ہو) نماز ادا کرنا جائز ہے۔",
    "english": "Although the chain of this specific Hadith is weak, its meaning reflects the general principle of Ahl al-Sunnah: a funeral prayer is offered for every Muslim, and praying behind any Muslim Imam (even if he is a sinner) is permissible."
  },
  "references": [
    {
      "arabic": "سنن الدارقطني (2/56)",
      "english": "Sunan ad-Daraqutni (2/56)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "ضعيف جداً",
    "english": "Very Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اہلِ قبلہ کا احترام",
        "english": "Respecting the People of Qibla"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نمازِ جنازہ کا حق",
              "english": "The Right to Funeral Prayer"
            },
            "content": {
              "urdu": [
                "ہر وہ شخص جو ظاہری طور پر کلمہ توحید کا اقرار کرتا ہے، اس کے وفات پانے پر اس کا جنازہ پڑھنا مسلمانوں پر فرضِ کفایہ ہے۔",
                "کسی کلمہ گو کو اس کے گناہوں کی وجہ سے اسلام سے خارج قرار دے کر اس کا جنازہ ترک کرنا اہل سنت کا طریقہ نہیں ہے۔",
                "صرف وہی شخص جنازے سے محروم ہوگا جس کا کفر یا شرک صریح طور پر ثابت ہو چکا ہو۔"
              ],
              "english": [
                "It is a communal obligation (Fard al-Kifayah) for Muslims to offer funeral prayers for anyone who outwardly professes the Kalimah.",
                "It is not the way of Ahl al-Sunnah to excommunicate a Muslim due to their sins and refuse their funeral prayer.",
                "Only those whose disbelief (Kufr) or polytheism (Shirk) is explicitly proven are excluded from the funeral prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گنہگار امام کے پیچھے نماز",
        "english": "Praying Behind a Sinful Imam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماعت کا اتحاد",
              "english": "Unity of the Congregation"
            },
            "content": {
              "urdu": [
                "مسلمانوں میں اتحاد برقرار رکھنے کے لیے ضروری ہے کہ کسی کلمہ گو امام کے پیچھے نماز پڑھنے میں تردد نہ کیا جائے۔",
                "اگر امام فاسق یا گنہگار ہو تو اس کا گناہ اس کی اپنی ذات تک ہے، مقتدیوں کی نماز صحیح ہو جاتی ہے۔",
                "صحابہ کرام رضی اللہ عنہم نے حجاج بن یوسف جیسے ظالم امراء کے پیچھے بھی نمازیں ادا کی ہیں تاکہ مسلمانوں کی صفوں میں انتشار نہ آئے۔"
              ],
              "english": [
                "To maintain unity among Muslims, one should not hesitate to pray behind any Muslim Imam who professes the Kalimah.",
                "If the Imam is a sinner or transgressor, his sin is personal; the prayers of the followers remain valid.",
                "The Companions (RAA) offered prayers behind oppressive rulers like Hajjaj bin Yusuf to prevent division among Muslims."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی فنی حیثیت",
        "english": "Technical Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعیف روایت سے استدلال",
              "english": "Inference from a Weak Narration"
            },
            "content": {
              "urdu": [
                "اس حدیث کی سند میں عثمان بن عبد الرحمن نامی راوی ہے جسے محدثین نے متروک یا کذاب قرار دیا ہے۔",
                "اگرچہ یہ خاص روایت ضعیف ہے، مگر دیگر صحیح احادیث اور اجماعِ امت سے ثابت ہے کہ کلمہ گو کے حقوق ادا کیے جائیں گے۔",
                "اصولی طور پر یہ حدیث ایک اہم اسلامی ضابطے کی طرف اشارہ کرتی ہے کہ ایمان کا فیصلہ ظاہر پر کیا جاتا ہے۔"
              ],
              "english": [
                "The chain contains a narrator named Uthman bin Abdul Rahman, whom scholars of Hadith have graded as abandoned or a liar.",
                "While this specific narration is weak, other authentic Hadiths and the consensus of the Ummah confirm that the rights of a Muslim must be fulfilled.",
                "Principally, this Hadith points toward an important Islamic rule: faith is judged by outward profession."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تفرقہ بازی سے گریز",
              "english": "Avoiding Sectarianism"
            },
            "content": {
              "urdu": [
                "ہمیں بلاوجہ مسلمانوں کی تکفیر (کافر قرار دینے) سے بچنا چاہیے کیونکہ کلمہ توحید بہت بڑی پناہ گاہ ہے۔",
                "اختلافات کے باوجود مسلمانوں کے اجتماعی حقوق (جنازہ، امامت) کو تسلیم کرنا چاہیے۔",
                "معاشرتی ہم آہنگی کے لیے ایک دوسرے کے پیچھے نماز پڑھنے کو فروغ دینا چاہیے۔"
              ],
              "english": [
                "We must avoid unnecessarily declaring Muslims as disbelievers (Takfir), as the Kalimah of Tawheed is a great sanctuary.",
                "Despite differences, the collective rights of Muslims (funeral, imamate) must be recognized.",
                "To promote social harmony, the practice of praying behind one another should be encouraged."
              ]
            }
          }
        ]
      }
    }
  ]
}