{
  "hadithId": 1290,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["muslim:2577"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب البر والصلة والآداب",
    "babId": 105
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2577)، وأحمد (21371)، والبيهقي في الشعب (7088). وهو حديث قدسي عظيم الشأن.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (2577) نے اسے اپنی صحیح میں روایت کیا ہے۔ یہ ایک 'حدیث قدسی' ہے جس میں اللہ تعالیٰ براہ راست کلام فرما رہا ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (2577), Ahmad (21371), and Al-Baihaqi. It is a profound Hadith Qudsi where Allah speaks directly."
  },
  "importantWords": [
    {
      "arabic": "حَرَّمْتُ",
      "english": "I have forbidden",
      "urdu": "میں نے حرام کر دیا"
    },
    {
      "arabic": "الظُّلْمَ",
      "english": "Oppression / Injustice",
      "urdu": "ظلم / ناانصافی"
    },
    {
      "arabic": "عِبَادِي",
      "english": "My servants",
      "urdu": "اے میرے بندو"
    },
    {
      "arabic": "نَفْسِي",
      "english": "Myself",
      "urdu": "میری ذات / نفس"
    },
    {
      "arabic": "تَظَّالَمُوا",
      "english": "Oppress one another",
      "urdu": "ایک دوسرے پر ظلم کرو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث قدسی میں اللہ تعالیٰ نے اپنی ذات کو ظلم سے پاک قرار دیا ہے اور انسانوں کو بھی ایک دوسرے پر ظلم کرنے سے سختی سے منع فرمایا ہے۔",
    "english": "In this Hadith Qudsi, Allah declares Himself free from injustice and strictly prohibits human beings from committing oppression against one another."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2577)",
      "english": "Sahih Muslim (2577)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو ذر الغفاري",
        "english": "Abu Dharr al-Ghifari"
      },
      "slug": "abu-dharr-al-ghifari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9NOnXh6g5U",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اللہ کی عدل و انصاف کی صفت",
        "english": "Allah's Attribute of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذاتِ الٰہی کا ظلم سے پاک ہونا",
              "english": "Allah is Free from Injustice"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ قادرِ مطلق ہے مگر اس نے اپنی مشیت سے خود پر ظلم حرام کیا ہے۔",
                "کائنات کا پورا نظام عدل اور توازن پر قائم ہے جس میں ذرہ برابر ناانصافی نہیں۔",
                "اللہ کسی پر اس کی ہمت سے زیادہ بوجھ نہیں ڈالتا اور نہ کسی کی نیکی ضائع کرتا ہے۔"
              ],
              "english": [
                "Allah is Almighty, yet by His will, He has forbidden injustice for Himself.",
                "The entire universe is established on justice and balance without any flaw.",
                "Allah does not burden any soul beyond its capacity or waste any good deed."
              ]
            }
          },
          {
            "title": {
              "urdu": "بندوں کے لیے الٰہی حکم",
              "english": "Divine Command for Servants"
            },
            "content": {
              "urdu": [
                "جب اللہ خود ظلم نہیں کرتا تو بندوں کو بھی اس سے بچنے کا حکم ہے۔",
                "ظلم کرنا انسانیت کی تذلیل اور الٰہی منشا کی صریح خلاف ورزی ہے۔",
                "یہ حکم زندگی کے تمام شعبوں، خواہ وہ معاشی ہوں یا معاشرتی، پر محیط ہے۔"
              ],
              "english": [
                "Since Allah does not oppress, He commands His servants to abstain from it too.",
                "Oppression is a degradation of humanity and a clear violation of Divine will.",
                "This command covers all aspects of life, whether economic or social."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ظلم کی ممانعت اور اقسام",
        "english": "Prohibition and Types of Oppression"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق العباد میں ظلم",
              "english": "Injustice in Human Rights"
            },
            "content": {
              "urdu": [
                "کسی کا مال ہڑپ کرنا، کسی کو ناحق مارنا یا گالی دینا ظلم کی بڑی اقسام ہیں۔",
                "ظلم صرف جسمانی نہیں بلکہ ذہنی اور لسانی طور پر بھی ہو سکتا ہے۔",
                "اسلام ہر مظلوم کی حمایت اور ہر ظالم کی مخالفت کا درس دیتا ہے۔"
              ],
              "english": [
                "Usurping wealth, illegal striking, or verbal abuse are major forms of oppression.",
                "Oppression is not only physical; it can be mental or linguistic as well.",
                "Islam teaches supporting the oppressed and opposing every oppressor."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس پر ظلم",
              "english": "Oppression Against the Self"
            },
            "content": {
              "urdu": [
                "گناہ کرنا اور اللہ کی نافرمانی کرنا درحقیقت اپنے ہی نفس پر ظلم ہے۔",
                "شرک کرنا سب سے بڑا ظلم ہے کیونکہ یہ خالق کی حق تلفی ہے۔",
                "اپنے آپ کو اللہ کے عذاب کا مستحق بنانا بدترین ناانصافی ہے۔"
              ],
              "english": [
                "Committing sins and disobeying Allah is actually oppressing one's own soul.",
                "Shirk is the greatest injustice as it denies the rights of the Creator.",
                "Making oneself deserving of Allah's punishment is the worst unfairness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی امن اور عدل",
        "english": "Social Peace and Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی تعلقات کی بنیاد",
              "english": "Basis of Mutual Relationships"
            },
            "content": {
              "urdu": [
                "معاشرے میں امن صرف اسی صورت ممکن ہے جب کوئی کسی پر ظلم نہ کرے۔",
                "ظلم معاشرے میں نفرت، انتقام اور بے چینی پیدا کرتا ہے۔",
                "عدل و انصاف کی فراہمی سے ہی قومیں ترقی اور خوشحالی پاتی ہیں۔"
              ],
              "english": [
                "Peace in society is only possible when no one oppresses another person.",
                "Injustice creates hatred, revenge, and restlessness within the community.",
                "Nations achieve progress and prosperity only through the provision of justice."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظلم کے خلاف بیداری",
              "english": "Awareness Against Oppression"
            },
            "content": {
              "urdu": [
                "ظلم کو دیکھ کر خاموش رہنا ظالم کی مدد کرنے کے مترادف ہے۔",
                "مسلمانوں کو ایک دوسرے کی ڈھال بن کر ظلم کا راستہ روکنا چاہیے۔",
                "مظلوم کی پکار اللہ تک براہ راست پہنچتی ہے جس سے ڈرنا چاہیے۔"
              ],
              "english": [
                "Remaining silent while witnessing oppression is equivalent to helping the tyrant.",
                "Muslims must act as shields for one another to block the path of injustice.",
                "The cry of the oppressed reaches Allah directly, a fact that should be feared."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خود احتسابی",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "ہمیں ہر وقت اپنے معاملات کا جائزہ لینا چاہیے کہ کہیں ہم ظالم تو نہیں۔",
                "معافی مانگنے اور تلافی کرنے میں کبھی دیر نہیں کرنی چاہیے۔",
                "دوسروں کے ساتھ وہی معاملہ کریں جو آپ اپنے لیے پسند کرتے ہیں۔"
              ],
              "english": [
                "We must constantly review our dealings to ensure we are not oppressors.",
                "One should never delay in seeking forgiveness and making restitution.",
                "Treat others in the same manner that you would like to be treated."
              ]
            }
          },
          {
            "title": {
              "urdu": "تقویٰ اور عدل",
              "english": "Piety and Equity"
            },
            "content": {
              "urdu": [
                "تقویٰ کا تقاضا ہے کہ انسان دشمن کے ساتھ بھی عدل و انصاف کرے۔",
                "عدل کرنا اللہ کے قرب کا سب سے بڑا ذریعہ ہے۔",
                "قیامت کے دن ظالموں کے لیے کوئی حمایتی اور مددگار نہیں ہوگا۔"
              ],
              "english": [
                "Piety requires a person to be just even with their enemies.",
                "Practicing equity is one of the greatest means to gain proximity to Allah.",
                "On the Day of Resurrection, there will be no supporter for the oppressors."
              ]
            }
          }
        ]
      }
    }
  ]
}