{
  "hadithId": 843,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/20"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النکاح",
    "babId": 64
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أحمد (3/301)، وأبو داود (2078)، والترمذي (1111) من طريق عبد الله بن محمد بن عقيل. وصححه الترمذي وابن حبان.",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے امام احمد، ابوداؤد اور ترمذی نے عبداللہ بن محمد بن عقیل کے واسطے سے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح کہا ہے۔",
    "english": "Hasan. Reported by Ahmad (3/301), Abu Dawud (2078), and At-Tirmidhi (1111) via Abdullah bin Muhammad bin Aqeel. Authenticated by At-Tirmidhi and Ibn Hibban."
  },
  "importantWords": [
    {
      "arabic": "أَيُّمَا",
      "english": "Whichever / Any",
      "urdu": "جو کوئی بھی"
    },
    {
      "arabic": "عَبْدٍ",
      "english": "Slave",
      "urdu": "غلام"
    },
    {
      "arabic": "إِذْنِ",
      "english": "Permission",
      "urdu": "اجازت"
    },
    {
      "arabic": "مَوَالِيهِ",
      "english": "His masters",
      "urdu": "اس کے مالک"
    },
    {
      "arabic": "عَاهِرٌ",
      "english": "Fornicator / Sinner",
      "urdu": "زانی / گناہ گار"
    }
  ],
  "summary": {
    "urdu": "غلام کے لیے نکاح کرنے سے پہلے اپنے مالک کی اجازت لینا شرعی طور پر ضروری ہے، ورنہ اس کا نکاح معتبر نہیں ہوگا۔",
    "english": "It is legally mandatory for a slave to obtain permission from his master before marrying; otherwise, the marriage is considered invalid and sinful."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1111)",
      "english": "Sunan at-Tirmidhi (1111)"
    },
    {
      "arabic": "سنن أبي داود (2078)",
      "english": "Sunan Abi Dawud (2078)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غلام کے نکاح کے احکام",
        "english": "Rulings on Slave's Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالک کی اجازت کی شرط",
              "english": "Condition of Master's Consent"
            },
            "content": {
              "urdu": [
                "غلام چونکہ اپنے مالک کی ملکیت میں ہوتا ہے، اس لیے اس کے اہم فیصلے مالک کی رضا کے مرہونِ منت ہیں۔",
                "بغیر اجازت نکاح کرنے سے مالک کے حقوق متاثر ہوتے ہیں، اس لیے اسے سختی سے روکا گیا ہے۔",
                "شریعت نے سماجی نظم و ضبط برقرار رکھنے کے لیے یہ پابندی عائد کی ہے۔"
              ],
              "english": [
                "Since a slave is under the ownership of his master, his major life decisions depend on the master's consent.",
                "Marrying without permission infringes upon the master's rights, which is why it is strictly forbidden.",
                "Sharia imposes this restriction to maintain social order and protect legal rights within the household."
              ]
            }
          },
          {
            "title": {
              "urdu": "لفظ 'عاہر' کی وضاحت",
              "english": "Explanation of the term 'Aahir'"
            },
            "content": {
              "urdu": [
                "حدیث میں 'عاہر' (زانی) کا لفظ مغلظہ طور پر استعمال ہوا ہے تاکہ گناہ کی شدت واضح ہو۔",
                "اس کا مطلب یہ ہے کہ ایسا نکاح شرعی طور پر نافذ نہیں ہوتا اور تعلق حرام شمار ہوتا ہے۔",
                "یہ لفظ غلام کو حکمِ رسول ﷺ کی نافرمانی سے ڈرانے کے لیے بولا گیا ہے۔"
              ],
              "english": [
                "The word 'Aahir' (fornicator) is used emphatically in the Hadith to show the severity of the sin.",
                "It implies that such a marriage is not legally recognized, making the relationship prohibited.",
                "The term serves as a warning to slaves against disobeying the Prophetic command regarding legal procedures."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مالک کی ذمہ داری",
        "english": "Responsibility of the Master"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلام کی عفت کا تحفظ",
              "english": "Protecting Slave's Chastity"
            },
            "content": {
              "urdu": [
                "مالک پر اخلاقی ذمہ داری ہے کہ وہ اپنے غلام کی ضرورت محسوس کرتے ہوئے اسے نکاح کی اجازت دے۔",
                "اسلام نے مالکوں کو ترغیب دی ہے کہ وہ اپنے ماتحتوں کی نکاح میں مدد کریں۔",
                "اجازت دینے سے معاشرے میں برائی کا خاتمہ اور پاکیزگی کا فروغ ہوتا ہے۔"
              ],
              "english": [
                "A master has a moral duty to grant permission for marriage if the slave feels the need.",
                "Islam encourages masters to facilitate the marriage process for those under their authority.",
                "Granting permission helps eliminate immorality and promotes purity within the social fabric."
              ]
            }
          },
          {
            "title": {
              "urdu": "مہر اور نفقہ کی ذمہ داری",
              "english": "Responsibility of Mahr and Maintenance"
            },
            "content": {
              "urdu": [
                "غلام کے نکاح کی صورت میں مہر اور نفقہ کے مسائل مالک کی اجازت سے جڑے ہوتے ہیں۔",
                "اجازت کا مطلب یہ بھی ہے کہ مالک ان اخراجات یا ذمہ داریوں کو قبول کر رہا ہے۔",
                "بغیر اجازت نکاح معاشی پیچیدگیاں پیدا کرتا ہے جن سے بچنا ضروری ہے۔"
              ],
              "english": [
                "In a slave's marriage, issues of Mahr and maintenance are directly linked to the master's consent.",
                "Consent implies that the master acknowledges and accepts the resulting legal responsibilities.",
                "Marriage without permission creates economic complications that the Sharia aims to prevent."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی و فقہی باریکیاں",
        "english": "Legal and Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کا فسخ ہونا",
              "english": "Annulment of Marriage"
            },
            "content": {
              "urdu": [
                "اگر غلام بغیر اجازت نکاح کر لے تو مالک کو اسے ختم کرنے کا مکمل حق حاصل ہے۔",
                "زیادہ تر فقہاء کے نزدیک ایسا نکاح سرے سے منعقد ہی نہیں ہوتا (باطل ہے)۔",
                "یہ حکم اس بات کی دلیل ہے کہ اسلام میں 'ولایت' اور 'اجازت' کی کتنی اہمیت ہے۔"
              ],
              "english": [
                "If a slave marries without permission, the master holds the full right to annul the contract.",
                "Most jurists consider such a marriage contract void (Batil) from the very beginning.",
                "This ruling demonstrates the immense importance of 'Guardianship' and 'Consent' in Islamic law."
              ]
            }
          },
          {
            "title": {
              "urdu": "آزاد مرد پر قیاس",
              "english": "Analogy for Free Men"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حکم غلام کے لیے ہے، لیکن یہ سرپرستوں کی اہمیت کو عام نکاحوں میں بھی واضح کرتا ہے۔",
                "انسان کو اپنی زندگی کے بڑے فیصلے اپنے بزرگوں اور سرپرستوں کے علم میں لانے چاہئیں۔",
                "یہ عمل خاندانی جڑوں کو مضبوط کرتا ہے اور مستقبل کے تنازعات سے بچاتا ہے۔"
              ],
              "english": [
                "Although this specific ruling is for slaves, it underscores the value of guardians in all marriages.",
                "Individuals should keep their elders and guardians informed about major life decisions.",
                "This practice strengthens family ties and provides protection against future legal or social conflicts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی پاسداری",
              "english": "Upholding Discipline"
            },
            "content": {
              "urdu": [
                "اسلام ہر معاملے میں نظم و ضبط اور قانونی طریقے کو اپنانے کی تعلیم دیتا ہے۔",
                "اپنی حدود سے تجاوز کرنا معاشرے میں بگاڑ کا سبب بنتا ہے۔",
                "سنتِ نبوی ﷺ کی پیروی ہی تمام مسائل کا واحد اور بہترین حل ہے۔"
              ],
              "english": [
                "Islam teaches the adoption of discipline and legal procedures in every matter of life.",
                "Exceeding one's legal or social boundaries causes corruption and disorder in society.",
                "Following the Prophetic Sunnah is the only and best solution for all human complications."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی ادائیگی",
              "english": "Fulfillment of Rights"
            },
            "content": {
              "urdu": [
                "یہ حدیث دوسروں کے حقوق (خواہ وہ مالک ہو یا سرپرست) کا خیال رکھنے کی ترغیب دیتی ہے۔",
                "بندہ مومن وہ ہے جو کسی کے حق پر ڈاکہ نہ ڈالے اور امانتدار رہے۔",
                "تعلقات کی بنیاد سچائی اور اجازت پر ہونی چاہیے نہ کہ چھپ چھپا کر کیے گئے کاموں پر۔"
              ],
              "english": [
                "This Hadith encourages respecting the rights of others, whether they are masters or guardians.",
                "A true believer is one who does not infringe upon rights and remains trustworthy.",
                "Relationships should be built on truth and transparency rather than secret actions."
              ]
            }
          }
        ]
      }
    }
  ]
}