{
  "hadithId": 418,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2919"],
    "kitabId": 2,
    "inKitabBab": 17,
    "arabicBook": "كتاب اللباس",
    "babId": 27
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2919)‏، ومسلم (2076)‏.",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم کی متفق علیہ روایت ہے۔ امام بخاری نے اسے کتاب الجہاد اور کتاب اللباس میں مختلف مقامات پر روایت کیا ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (2919) and Muslim (2076). It is a Muttafaqun 'Alayh (Agreed Upon) narration."
  },
  "importantWords": [
    {
      "arabic": "رَخَّصَ",
      "english": "Permitted / Granted Concession",
      "urdu": "رخصت دی / اجازت دی"
    },
    {
      "arabic": "الْحَرِيرِ",
      "english": "Silk",
      "urdu": "ریشم"
    },
    {
      "arabic": "حَكَّةٍ",
      "english": "Itching / Scabies",
      "urdu": "خارش"
    },
    {
      "arabic": "قَمِيصِ",
      "english": "Shirt",
      "urdu": "قمیص"
    },
    {
      "arabic": "سَفَرٍ",
      "english": "Journey",
      "urdu": "سفر"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed Upon",
      "urdu": "متفق علیہ"
    }
  ],
  "summary": {
    "urdu": "مردوں کے لیے ریشم حرام ہے، لیکن شدید خارش یا طبی ضرورت کی صورت میں اس کے استعمال کی شرعی رخصت موجود ہے۔",
    "english": "While silk is forbidden for men, Islamic law provides a concession for its use in cases of severe itching or medical necessity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2919)",
      "english": "Sahih al-Bukhari (2919)"
    },
    {
      "arabic": "صحيح مسلم (2076)",
      "english": "Sahih Muslim (2076)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك الأنصاري",
        "english": "Anas bin Malik Al-Ansari"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=5rL9E2Xm-x0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "طبی ضرورت اور رخصت",
        "english": "Medical Necessity and Concession"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیماری میں ریشم کا استعمال",
              "english": "Use of Silk in Illness"
            },
            "content": {
              "urdu": [
                "ریشم اپنی نرمی اور ٹھنڈک کی وجہ سے خارش زدہ جلد کے لیے آرام دہ ہوتا ہے۔",
                "نبی کریم ﷺ نے عبدالرحمن بن عوف اور زبیر بن عوام کو تکلیف کی وجہ سے رخصت دی۔",
                "یہ اصول طے ہوا کہ طبی ضرورت حرام چیز کو عارضی طور پر مباح کر دیتی ہے۔"
              ],
              "english": [
                "Silk is soothing for itchy skin due to its softness and cooling properties.",
                "The Prophet (PBUH) granted a concession to the companions due to their distress.",
                "This establishes the rule that medical necessity can temporarily permit the forbidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "مردوں کے لیے عمومی حکم",
              "english": "General Ruling for Men"
            },
            "content": {
              "urdu": [
                "عام حالات میں ریشم پہننا مردوں کے لیے قطعی طور پر حرام ہے۔",
                "یہ رخصت صرف اس وقت تک ہے جب تک وہ بیماری یا ضرورت باقی رہے۔",
                "بغیر کسی شرعی عذر کے ریشم پہننا گناہِ کبیرہ اور جنت کے لباس سے محرومی ہے۔"
              ],
              "english": [
                "Under normal circumstances, wearing silk is strictly forbidden for men.",
                "This concession lasts only as long as the illness or necessity persists.",
                "Wearing silk without a legal excuse is a major sin and leads to deprivation in the afterlife."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و شرعی فوائد",
        "english": "Juristic and Sharia Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلام میں تنگی نہیں ہے",
              "english": "No Hardship in Islam"
            },
            "content": {
              "urdu": [
                "دین اسلام انسانی جان کی حفاظت اور راحت کو اہمیت دیتا ہے۔",
                "شریعت کے احکام میں ضرورت کے وقت لچک (Ease) موجود ہے۔",
                "اللہ تعالیٰ اپنے بندوں کے لیے آسانی چاہتا ہے اور مشقت کو ناپسند کرتا ہے۔"
              ],
              "english": [
                "Islam prioritizes the protection and comfort of human life.",
                "Sharia rulings contain flexibility (Ease) during times of genuine need.",
                "Allah desires ease for His servants and does not like undue hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرام اشیاء سے علاج",
              "english": "Treatment with Forbidden Items"
            },
            "content": {
              "urdu": [
                "اگر کوئی حلال متبادل موجود نہ ہو تو حرام سے علاج کی گنجائش نکلتی ہے۔",
                "ریشم کا پہننا علاج کی ایک صورت تھی جسے آپ ﷺ نے منظور فرمایا۔",
                "فقہاء نے اس حدیث سے 'الضرورات تبیح المحظورات' کا اصول اخذ کیا ہے۔"
              ],
              "english": [
                "If no halal alternative is available, treatment with forbidden items may be allowed.",
                "Wearing silk was a form of treatment approved by the Prophet (PBUH).",
                "Jurists derived the principle 'Necessities permit the forbidden' from this Hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سفر اور خصوصی حالات",
        "english": "Journey and Special Conditions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دورانِ سفر سہولت",
              "english": "Convenience During Travel"
            },
            "content": {
              "urdu": [
                "سفر میں بیماریاں زیادہ مشقت کا باعث بنتی ہیں، اس لیے وہاں رخصت زیادہ واضح ہے۔",
                "صحابہ کرام نے اپنی بیماری کو نبی ﷺ کے سامنے پیش کر کے حکم معلوم کیا۔",
                "دین کے معاملے میں شرمانے کے بجائے مستند رہنمائی حاصل کرنا ضروری ہے۔"
              ],
              "english": [
                "Illnesses cause more hardship during travel, making concessions more vital.",
                "The companions presented their condition to the Prophet (PBUH) to seek a ruling.",
                "It is essential to seek authentic guidance rather than feeling shy about religious matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کی فضیلت",
              "english": "Virtue of the Companions"
            },
            "content": {
              "urdu": [
                "عبدالرحمن بن عوف اور زبیر بن عوام عشرہ مبشرہ میں سے عظیم صحابہ ہیں۔",
                "ان کی تقویٰ اور اتباعِ سنت کا عالم یہ تھا کہ حرام چیز سے بچنے کے لیے سوال کیا۔",
                "ان کو دی گئی رخصت پوری امت کے لیے ایک شرعی مثال بن گئی۔"
              ],
              "english": [
                "Abdur-Rahman and Az-Zubair are among the ten promised Paradise.",
                "Their piety was such that they sought permission even for a medical necessity.",
                "The concession granted to them became a legal precedent for the entire Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال اور اتباع",
              "english": "Moderation and Following"
            },
            "content": {
              "urdu": [
                "ہمیں اللہ کے احکامات کی حدود کو پہچاننا چاہیے اور ان کا احترام کرنا چاہیے۔",
                "رخصت کا فائدہ صرف حقیقی ضرورت کے وقت اٹھانا چاہیے، عیاشی کے لیے نہیں۔",
                "اسلامی احکامات انسانی فطرت اور ضروریات کے عین مطابق ہیں۔"
              ],
              "english": [
                "We must recognize the boundaries of Allah's commands and respect them.",
                "Concessions should only be used for genuine needs, not for luxury.",
                "Islamic rulings are in perfect harmony with human nature and needs."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء سے مشورہ",
              "english": "Consulting Scholars"
            },
            "content": {
              "urdu": [
                "طبی مسائل میں شرعی حکم معلوم کرنے کے لیے علماء اور مفتیان سے رجوع کریں۔",
                "اپنی مرضی سے حرام چیزوں کو حلال کر لینا گمراہی کا راستہ ہے۔",
                "نبی کریم ﷺ کی سنت ہر مشکل کا بہترین حل فراہم کرتی ہے۔"
              ],
              "english": [
                "Consult scholars and jurists to understand Sharia rulings on medical issues.",
                "Making forbidden things permissible by one's own will leads to misguidance.",
                "The Sunnah of the Prophet (PBUH) provides the best solution for every difficulty."
              ]
            }
          }
        ]
      }
    }
  ]
}
