{
  "hadithId": 1358,
  "hadithNo": 27,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/126"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6406)، ومسلم (2694).",
    "urdu": "صحیح۔ اسے امام بخاری (6406) اور امام مسلم (2694) نے روایت کیا ہے۔ یہ حدیث صحیح بخاری کی آخری حدیث ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (6406) and Muslim (2694). This is notably the final Hadith in Sahih al-Bukhari."
  },
  "importantWords": [
    {
      "arabic": "حَبِيبَتَانِ",
      "english": "Beloved (two)",
      "urdu": "دو پیارے / محبوب"
    },
    {
      "arabic": "خَفِيفَتَانِ",
      "english": "Light (two)",
      "urdu": "دو ہلکے / آسان"
    },
    {
      "arabic": "ثَقِيلَتَانِ",
      "english": "Heavy (two)",
      "urdu": "دو بھاری / وزنی"
    },
    {
      "arabic": "الْمِيزَانِ",
      "english": "The Scale",
      "urdu": "میزان / ترازو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اللہ کی تسبیح و حمد کے ان مختصر کلمات کی غیر معمولی فضیلت بیان کی گئی ہے جو اللہ کو بے حد پسند ہیں اور آخرت میں کامیابی کا بڑا ذریعہ ہیں۔",
    "english": "This Hadith highlights the immense virtue of these short phrases of glorification and praise, which are deeply loved by Allah and serve as a significant means of success in the Hereafter."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الدعوات، رقم 6406",
      "english": "Sahih al-Bukhari, Book of Supplications, No. 6406"
    },
    {
      "arabic": "صحيح مسلم، كتاب الذكر والدعاء، رقم 2694",
      "english": "Sahih Muslim, Book of Remembrance and Supplication, No. 2694"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "کلمات کی خصوصیات",
        "english": "Characteristics of the Phrases"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی محبت کا موجب",
              "english": "A Cause for Allah's Love"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ان کلمات کو 'حبیبتان الی الرحمن' کہا، جو ظاہر کرتا ہے کہ اللہ کو اپنی تسبیح و تقدیس سننا کتنا پسند ہے۔",
                "یہاں اللہ کی صفت 'الرحمن' کا ذکر خاص طور پر اللہ کی رحمت اور فضل کو ظاہر کرنے کے لیے کیا گیا ہے جو معمولی عمل پر بڑا اجر دیتا ہے۔",
                "یہ کلمات بندے اور خالق کے درمیان تعلق کو مضبوط کرنے کا بہترین ذریعہ ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) called these phrases 'beloved to the Most Merciful,' showing how much Allah loves to hear His glorification.",
                "The use of the attribute 'Ar-Rahman' (The Most Merciful) highlights Allah's grace in giving massive rewards for simple actions.",
                "These phrases are an excellent means to strengthen the bond between the servant and the Creator."
              ]
            }
          },
          {
            "title": {
              "urdu": "ادائیگی میں آسانی",
              "english": "Ease of Recitation"
            },
            "content": {
              "urdu": [
                "یہ کلمات زبان پر بہت ہلکے ہیں، یعنی انہیں یاد کرنا اور دہرانا ہر انسان کے لیے بہت آسان ہے۔",
                "یہ اللہ کی طرف سے امتِ محمدیہ کے لیے ایک بڑی رعایت ہے کہ کم محنت میں زیادہ اجر سمیٹ سکیں۔",
                "ان کی ادائیگی کے لیے کوئی خاص وقت یا جگہ مخصوص نہیں، چلتے پھرتے بھی کہے جا سکتے ہیں۔"
              ],
              "english": [
                "The phrases are very 'light' on the tongue, meaning they are easy to memorize and repeat for everyone.",
                "This is a great concession from Allah for the Ummah of Muhammad (ﷺ) to gather huge rewards with little effort.",
                "There is no specific time or place required; they can be recited while walking or working."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "میزان میں وزن",
        "english": "Weight in the Scales"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال کی سنگینی",
              "english": "The Gravity of Deeds"
            },
            "content": {
              "urdu": [
                "قیامت کے دن جب اعمال تولے جائیں گے تو یہ مختصر کلمات نیکیوں کے پلڑے کو جھکا دیں گے۔",
                "ان کا وزن ان کے اندر موجود 'توحید' اور 'پاکیزگی' کے عظیم معانی کی وجہ سے ہے۔",
                "یہ اس بات کی یاد دہانی ہے کہ اللہ کے ہاں معیار صرف مقدار (Quantity) نہیں بلکہ معیار (Quality) اور اخلاص بھی ہے۔"
              ],
              "english": [
                "When deeds are weighed on Judgment Day, these short phrases will tip the scales in favor of good deeds.",
                "Their weight stems from the magnificent meanings of 'Monotheism' and 'Purity' they contain.",
                "This serves as a reminder that with Allah, the standard is not just quantity, but quality and sincerity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کلمات کے معانی پر غور",
        "english": "Reflecting on the Meanings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تسبیح اور حمد کا مجموعہ",
              "english": "Combination of Glorification and Praise"
            },
            "content": {
              "urdu": [
                "'سبحان اللہ' کا مطلب اللہ کو ہر عیب، کمزوری اور شریک سے پاک قرار دینا ہے۔",
                "'وبحمدہ' کے ذریعے بندہ اللہ کی تمام کمالات اور نعمتوں پر اس کا شکر ادا کرتا ہے۔",
                "'العظیم' اللہ کی بے پناہ بڑائی اور اقتدار کا اعتراف ہے جس کے سامنے ہر چیز ہیچ ہے۔"
              ],
              "english": [
                "'Subhan-Allah' means declaring Allah free from all defects, weaknesses, and partners.",
                "Through 'wa bihamdihi,' the servant thanks Allah for all His perfections and blessings.",
                "'Al-'Azim' is an acknowledgment of Allah's immense greatness and sovereignty, before which everything is insignificant."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکر کا مستقل معمول",
              "english": "A Constant Habit of Dhikr"
            },
            "content": {
              "urdu": [
                "ہمیں ان کلمات کو اپنی زبان پر جاری رکھنا چاہیے، خاص طور پر فارغ اوقات یا کام کے دوران۔",
                "امام بخاریؒ نے اپنی عظیم کتاب کا اختتام ان کلمات پر کر کے ہمیں یہ سبق دیا ہے کہ زندگی کا آخری عمل بھی اللہ کی تسبیح ہونا چاہیے۔",
                "یہ ذکر دل کو سکون پہنچاتا ہے اور انسان کو غفلت سے بچاتا ہے۔"
              ],
              "english": [
                "We should keep these words flowing on our tongues, especially during free time or while working.",
                "Imam Al-Bukhari ended his great book with these words to teach us that the final act of life should also be Allah's glorification.",
                "This remembrance brings peace to the heart and protects a person from heedlessness."
              ]
            }
          }
        ]
      }
    }
  ]
}