{
  "hadithId": 254,
  "hadithNo": 45,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/45"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (2822)، وفي رواية أخرى أن سعداً كان يعلمها أبناءه كما يُعلّم المُعلم الغلمان الكتابة.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (2822) نے اسے روایت کیا ہے۔ ایک روایت میں یہ بھی ہے کہ سیدنا سعدؓ اپنے بچوں کو یہ کلمات اس طرح سکھاتے تھے جیسے استاد بچوں کو لکھنا سکھاتا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2822). Another narration mentions that Sa'd (RA) used to teach these words to his children as a teacher teaches children how to write."
  },
  "importantWords": [
    {
      "arabic": "يَتَعَوَّذُ",
      "english": "Seeking refuge",
      "urdu": "پناہ مانگتے تھے"
    },
    {
      "arabic": "اَلْبُخْلِ",
      "english": "Miserliness",
      "urdu": "بخل / کنجوسی"
    },
    {
      "arabic": "اَلْجُبْنِ",
      "english": "Cowardice",
      "urdu": "بزدلی"
    },
    {
      "arabic": "أَرْذَلِ اَلْعُمُرِ",
      "english": "Miserable old age",
      "urdu": "ناکارہ عمر"
    },
    {
      "arabic": "فِتْنَةِ اَلدُّنْيَا",
      "english": "Trials of the world",
      "urdu": "دنیا کا فتنہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں پانچ ایسی مہلک چیزوں سے پناہ مانگنے کا ذکر ہے جو انسان کے دین، دنیا اور آخرت کو تباہ کر سکتی ہیں۔",
    "english": "This Hadith mentions seeking refuge from five destructive things that can ruin a person's faith, worldly life, and the hereafter."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2822)",
      "english": "Sahih Al-Bukhari (2822)"
    },
    {
      "arabic": "سنن النسائي (5447)",
      "english": "Sunan an-Nasa'i (5447)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعد بن أبي وقاص",
        "english": "Sa'd bin Abi Waqqas"
      },
      "slug": "sad-bin-abi-waqqas"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=Dua+against+miserliness+and+cowardice+Urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اخلاقی برائیوں سے تحفظ",
        "english": "Protection from Moral Vices"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بخل اور بزدلی",
              "english": "Miserliness and Cowardice"
            },
            "content": {
              "urdu": [
                "بخل انسان کو اللہ کے راستے میں خرچ کرنے سے روکتا ہے اور دل کو تنگ کرتا ہے۔",
                "بزدلی حق بات کہنے اور دین کی سربلندی کے لیے جدوجہد سے محروم کر دیتی ہے۔",
                "یہ دونوں صفات ایک مومن کی شخصیت کے شایانِ شان نہیں ہیں۔"
              ],
              "english": [
                "Miserliness prevents a person from spending for Allah and narrows the heart.",
                "Cowardice deprives one of speaking the truth and striving for the faith.",
                "Both of these traits are unbecoming of a true believer's character."
              ]
            }
          },
          {
            "title": {
              "urdu": "ارذل العمر کی حقیقت",
              "english": "Reality of Miserable Old Age"
            },
            "content": {
              "urdu": [
                "ارذل العمر وہ عمر ہے جس میں انسان دوسروں کا محتاج اور عقل و حواس کھو دیتا ہے۔",
                "نبی ﷺ نے ایسی بے بسی کی حالت سے اللہ کی پناہ مانگی ہے۔",
                "دعا کا مقصد یہ ہے کہ آخری وقت تک ایمان اور صحت سلامت رہے۔"
              ],
              "english": [
                "Miserable old age is a stage where one becomes dependent and loses senses.",
                "The Prophet (PBUH) sought refuge from such a state of helplessness.",
                "The goal of this Dua is to maintain faith and health until the very end."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فتنوں سے بچاؤ",
        "english": "Avoiding Trials"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دنیا کا فتنہ",
              "english": "Trials of the World"
            },
            "content": {
              "urdu": [
                "دنیا کے فتنے سے مراد مال، جاہ اور باطل نظریات کی گمراہی ہے۔",
                "یہ فتنہ انسان کو آخرت کی تیاری سے غافل کر دیتا ہے۔",
                "اللہ کی پناہ ہی ان چمک دمک والی آزمائشوں سے بچا سکتی ہے۔"
              ],
              "english": [
                "Trials of the world refer to wealth, status, and misleading ideologies.",
                "This trial makes a person heedless of preparing for the Hereafter.",
                "Only Allah's refuge can protect one from these glittering temptations."
              ]
            }
          },
          {
            "title": {
              "urdu": "عذابِ قبر سے پناہ",
              "english": "Refuge from Grave Punishment"
            },
            "content": {
              "urdu": [
                "قبر کا عذاب برزخی زندگی کی پہلی ہولناک آزمائش ہے۔",
                "نبی کریم ﷺ کا اس سے پناہ مانگنا اس کی سنگینی کو ظاہر کرتا ہے۔",
                "یہ دعا مومن کو گناہوں سے بچنے اور توبہ کرنے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "Punishment in the grave is the first terrifying trial of the Barzakh life.",
                "The Prophet's seeking refuge from it shows its extreme severity.",
                "This Dua encourages the believer to avoid sins and seek repentance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی پہلو",
        "english": "Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اولاد کی تربیت",
              "english": "Training of Children"
            },
            "content": {
              "urdu": [
                "سیدنا سعدؓ کا اپنے بچوں کو یہ کلمات سکھانا والدین کے لیے نمونہ ہے۔",
                "بچوں کو بچپن ہی سے مسنون دعاؤں کا عادی بنانا چاہیے تاکہ ان کا عقیدہ پختہ ہو۔",
                "دعا سکھانا لکھنا سکھانے جتنا ہی اہم اور ضروری عمل ہے۔"
              ],
              "english": [
                "Sa'd's (RA) teaching of these words to his children is a model for parents.",
                "Children should be accustomed to Masnoon prayers to strengthen their faith.",
                "Teaching supplications is as important as teaching them how to write."
              ]
            }
          },
          {
            "title": {
              "urdu": "مداومت کی اہمیت",
              "english": "Importance of Consistency"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا ان کلمات کو ہر نماز کے بعد پڑھنا ان کی اہمیت بتاتا ہے۔",
                "مداومت سے دعا مانگنا اللہ کو بہت پسند ہے اور یہ بندگی کا تقاضا ہے۔",
                "ہر نماز کے بعد یہ پناہ مانگنا ایک روحانی حصار کا کام کرتا ہے۔"
              ],
              "english": [
                "The Prophet's (PBUH) recitation after every prayer shows their significance.",
                "Consistency in supplication is loved by Allah and is a mark of servitude.",
                "Seeking this refuge after every Salah acts as a spiritual fortress."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذہنی اور جسمانی صحت",
              "english": "Mental and Physical Health"
            },
            "content": {
              "urdu": [
                "دعا میں خیر کے ساتھ ساتھ بری حالت سے بچاؤ کی طلب موجود ہے۔",
                "ایک صحت مند مومن کمزور مومن سے بہتر اور اللہ کو محبوب ہے۔",
                "اللہ سے ایسی لمبی عمر مانگنی چاہیے جو اس کی اطاعت میں گزرے۔"
              ],
              "english": [
                "The Dua includes seeking good and protection from evil conditions.",
                "A strong believer is better and more beloved to Allah than a weak one.",
                "One should ask Allah for a long life that is spent in His obedience."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا بطور ہتھیار",
              "english": "Dua as a Weapon"
            },
            "content": {
              "urdu": [
                "یہ دعا انسان کو باطنی کمزوریوں اور بیرونی فتنوں کے خلاف طاقت دیتی ہے۔",
                "مومن کو کبھی بھی دعا مانگنے سے تھکنا نہیں چاہیے کیونکہ یہ عبادت ہے۔",
                "ان کلمات کو اپنی روزمرہ کی زندگی کا حصہ بنانا کامیابی کی کنجی ہے۔"
              ],
              "english": [
                "This Dua gives strength against internal weaknesses and external trials.",
                "A believer should never tire of supplicating as it is an act of worship.",
                "Making these words part of daily life is a key to ultimate success."
              ]
            }
          }
        ]
      }
    }
  ]
}
