{
  "hadithId": 692,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/60"],
    "kitabId": 7,
    "inKitabBab": 2,
    "arabicBook": "كتاب البيوع",
    "babId": 43
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2112)، ومسلم (1531). والحديث أصل في ثبوت خيار المجلس.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2112) اور امام مسلم (1531) نے روایت کیا ہے۔ یہ حدیث 'خیارِ مجلس' کے ثبوت میں بنیادی دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2112) and Muslim (1531). This Hadith is the primary evidence for the 'Option of the Session' (Khiyar al-Majlis)."
  },
  "importantWords": [
    {
      "arabic": "بِالْخِيَارِ",
      "english": "With the option",
      "urdu": "اختیار رکھنا"
    },
    {
      "arabic": "يَتَفَرَّقَا",
      "english": "They separate",
      "urdu": "وہ دونوں جدا ہو جائیں"
    },
    {
      "arabic": "وَجَبَ",
      "english": "Became binding",
      "urdu": "لازم یا پختہ ہو گیا"
    },
    {
      "arabic": "يُخَيِّرُ",
      "english": "Gives choice",
      "urdu": "اختیار دیتا ہے"
    },
    {
      "arabic": "تَبَايَعَا",
      "english": "Entered a transaction",
      "urdu": "آپس میں بیع کی"
    },
    {
      "arabic": "يَتْرُكْ",
      "english": "Cancel / Leave",
      "urdu": "چھوڑ دے یا فسخ کرے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں 'خیارِ مجلس' کا قانون بیان کیا گیا ہے، جس کے مطابق سودا کرنے والے جب تک ایک جگہ موجود ہیں، انہیں سودا منسوخ کرنے کا حق حاصل ہے جب تک کہ وہ جدا نہ ہو جائیں یا صراحتاً اختیار ختم نہ کر دیں۔",
    "english": "This Hadith establishes the 'Option of the Session,' meaning both buyer and seller retain the right to cancel a deal as long as they are still physically present together, unless they finalize it explicitly before separating."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب البيوع",
      "english": "Sahih Muslim, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah ibn Umar al-Khattab"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خیارِ مجلس کی حقیقت",
        "english": "Reality of the Option of Session"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اختیارِ فسخ کا دورانیہ",
              "english": "Duration of Cancellation Right"
            },
            "content": {
              "urdu": [
                "جب تک خریدار اور بیچنے والا ایک ہی مجلس میں موجود ہیں، سودا کچا رہتا ہے۔",
                "دونوں میں سے کوئی بھی بلا وجہ سودا ختم کرنے کا حق رکھتا ہے۔",
                "یہ حق اس لیے دیا گیا ہے تاکہ انسان جلد بازی کے فیصلے پر نظر ثانی کر سکے۔"
              ],
              "english": [
                "The deal remains non-binding as long as both parties are in the same session.",
                "Either party has the right to revoke the transaction without providing a reason.",
                "This right is granted to allow individuals to reconsider hasty decisions."
              ]
            }
          },
          {
            "title": {
              "urdu": "جدائی کی تعریف",
              "english": "Definition of Separation"
            },
            "content": {
              "urdu": [
                "جسمانی طور پر ایک دوسرے سے الگ ہو جانا اختیار کو ختم کر دیتا ہے۔",
                "اگر ایک شخص دکان سے باہر نکل جائے تو اب سودا پختہ تصور ہوگا۔",
                "عرفِ عام میں جدائی کا جو مطلب لیا جاتا ہے، وہی یہاں معتبر ہوگا۔"
              ],
              "english": [
                "Physically parting from one another terminates the option to cancel.",
                "If one person leaves the shop, the transaction is considered finalized.",
                "The customary understanding of 'separation' is what holds legal weight here."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سودا پختہ ہونے کی صورتیں",
        "english": "Conditions for a Binding Sale"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صریح رضامندی",
              "english": "Explicit Agreement"
            },
            "content": {
              "urdu": [
                "اگر مجلس کے دوران ہی ایک کہے کہ 'میں نے اختیار ختم کیا' تو بیع لازم ہو گئی۔",
                "ایک دوسرے کو اختیار دینے کا مطلب سودے کو حتمی شکل دینا ہے۔",
                "زبان سے اقرار کر لینے کے بعد جدائی کا انتظار ضروری نہیں رہتا۔"
              ],
              "english": [
                "The sale becomes binding if a party says 'I waive my option' during the session.",
                "Giving each other the choice means finalizing the deal explicitly.",
                "After verbal finalization, waiting for physical separation is not required."
              ]
            }
          },
          {
            "title": {
              "urdu": "سکوت اور جدائی",
              "english": "Silence and Separation"
            },
            "content": {
              "urdu": [
                "اگر کسی نے فسخ نہیں کیا اور دونوں جدا ہو گئے، تب بھی بیع لازم ہے۔",
                "جدا ہونے کا عمل خاموشی کے ساتھ سودے کی توثیق قرار پاتا ہے۔",
                "اسلامی قانون میں اعمال کا نتیجہ ان کے اختتام پر مبنی ہوتا ہے۔"
              ],
              "english": [
                "If neither cancels and they part ways, the sale becomes legally binding.",
                "The act of separating serves as a silent confirmation of the deal.",
                "In Islamic law, the outcome of actions is based on their conclusion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور انسانی فطرت",
        "english": "Juristic Wisdom and Human Nature"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پچھتاوے سے بچاؤ",
              "english": "Avoiding Regret"
            },
            "content": {
              "urdu": [
                "انسان بسا اوقات دباؤ یا جذبات میں آ کر سودا کر لیتا ہے۔",
                "خیارِ مجلس اسے تھوڑا وقت دیتی ہے کہ وہ اپنی مالی حالت دیکھ لے۔",
                "یہ رعایت اسلامی تجارت میں ہمدردی اور مروت کی عکاسی کرتی ہے۔"
              ],
              "english": [
                "Humans sometimes enter deals under pressure or due to emotions.",
                "The session option gives time to re-evaluate one's financial standing.",
                "This concession reflects compassion and chivalry in Islamic commerce."
              ]
            }
          },
          {
            "title": {
              "urdu": "دھوکہ دہی کا سدِ باب",
              "english": "Preventing Deception"
            },
            "content": {
              "urdu": [
                "اگر چیز میں فوری کوئی عیب نظر آ جائے تو وہیں سودا ختم کیا جا سکتا ہے۔",
                "یہ قانون خریدار کو بیچنے والے کی عجلت پسندی سے تحفظ فراہم کرتا ہے۔",
                "شفافیت ہی برکت والے کاروبار کی بنیاد ہے۔"
              ],
              "english": [
                "If a defect is spotted immediately, the deal can be cancelled on the spot.",
                "This law protects the buyer from a seller's attempts to rush the process.",
                "Transparency is the foundation of a blessed business transaction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فیصلہ سازی میں تدبر",
              "english": "Deliberation in Decision Making"
            },
            "content": {
              "urdu": [
                "تجارت میں جلد بازی شیطان کی طرف سے اور بردباری اللہ کی طرف سے ہے۔",
                "سودا کرتے وقت تمام پہلوؤں پر غور کرنا سنتِ نبوی کے مطابق ہے۔",
                "مسلمان کو اپنے مالی فیصلے سوچ سمجھ کر کرنے چاہئیں۔"
              ],
              "english": [
                "Haste in trade is from Satan, while deliberation is from Allah.",
                "Considering all aspects during a deal aligns with Prophetic Sunnah.",
                "A Muslim should make financial decisions with careful thought."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی رویہ",
              "english": "Ethical Conduct"
            },
            "content": {
              "urdu": [
                "بیچنے والے کو چاہیے کہ وہ خریدار کو فیصلہ کرنے کا پورا موقع دے۔",
                "زبردستی سودا تھوپنا یا خریدار کو بھاگنے پر مجبور کرنا غیر اخلاقی ہے۔",
                "نرمی اور خیر خواہی سے کی گئی تجارت میں زیادہ برکت ہوتی ہے۔"
              ],
              "english": [
                "A seller should allow the buyer ample opportunity to decide.",
                "Forcing a deal or making the buyer feel trapped is unethical.",
                "Trade conducted with gentleness and goodwill carries more blessings."
              ]
            }
          }
        ]
      }
    }
  ]
}