{
  "hadithId": 70,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 9 (Chapter 6)"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب الوضوء من لحم الإبل",
    "babId": 6
  },

  "takhreej": {
    "arabic": "صحيح.  رواه مسلم (360)  ",
    "urdu": "صحیح (درجہ)۔ اسے مسلم (360) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Muslim (360)."
  },
  "importantWords": [
    {
      "arabic": "لُحُومِ اَلْغَنَمِ",
      "english": "Sheep meat",
      "urdu": "بکری کا گوشت"
    },
    {
      "arabic": "إِنْ شِئْتَ",
      "english": "If you wish",
      "urdu": "اگر دل چاہے تو"
    },
    {
      "arabic": "لُحُومِ اَلْإِبِلِ",
      "english": "Camel meat",
      "urdu": "اونٹ کا گوشت"
    },
    {
      "arabic": "نَعَمْ",
      "english": "Yes",
      "urdu": "ہاں"
    },
    {
      "arabic": "أَتَوَضَّأُ",
      "english": "Should I perform Wudu",
      "urdu": "کیا میں وضو کروں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ **اونٹ کا گوشت** کھانے سے **وضو کرنا واجب** ہے، جبکہ **بکری کا گوشت** (یا دیگر حلال جانوروں کا گوشت) کھانے سے وضو کرنا صرف **مستحب یا اختیاری** ہے، اور یہ حکم وضو کو توڑنے والے اسباب کے بارے میں ایک اہم فقہی اصول ہے۔",
    "english": "This Hadith clarifies that eating **camel meat necessitates Wudu** (making it obligatory/Wajib), while eating **sheep meat** (or other permissible meats) only makes Wudu **recommended or optional**, thus establishing a unique cause for Wudu invalidation."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الحيض، رقم 360",
      "english": "Sahih Muslim, The Book of Menstruation, Hadith 360"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جَابِرِ بْنِ سَمُرَةَ رَضِيَ اَللَّهُ عَنْهُمَا",
        "english": "Jābir ibn Samurah (May Allah be pleased with them both)"
      },
      "slug": "jabir-ibn-samurah"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-48-wudu-camel-meat",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اونٹ کے گوشت کا خصوصی حکم",
        "english": "The Specific Ruling on Camel Meat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضو کا وجوب",
              "english": "Obligation of Wudu"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا اونٹ کے گوشت کے بارے میں **\"نَعَمْ\"** (ہاں) فرمانا اس بات کی دلیل ہے کہ اسے کھانے سے وضو **واجب** ہو جاتا ہے، اور یہ ایک خاص شرعی حکم ہے۔",
                "یہ حکم اس عمومی قاعدہ سے **مستثنیٰ** ہے کہ کھانا پینا وضو کو نہیں توڑتا، اور یہ اس بات کی دلیل ہے کہ وضو کو توڑنے کے لیے کوئی خاص حکمت ضروری نہیں، بلکہ حکمِ وحی ہی کافی ہے۔",
                "امام احمد بن حنبل اور بعض دیگر فقہاء کے نزدیک یہ حکم لازمی ہے، جبکہ جمہور فقہاء (مالکی، شافعی، حنفی) اسے صرف مستحب قرار دیتے ہیں، لیکن احتیاط واجب میں ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) explicit 'Yes' concerning camel meat proves that eating it **mandates Wudu** (makes it Wājib), establishing a unique legal ruling.",
                "This ruling is an **exception** to the general rule that eating and drinking does not nullify Wudu, indicating that divine command suffices without relying on perceived wisdom.",
                "Imam Ahmad ibn Hanbal and some jurists consider this ruling compulsory, while the majority (Mālikī, Shāfiʿī, Ḥanafī) deem it merely recommended, but caution lies in treating it as obligatory."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ حکم",
              "english": "Wisdom Behind the Ruling"
            },
            "content": {
              "urdu": [
                "علماء نے اس کی حکمت یہ بیان کی ہے کہ اونٹ کے گوشت میں **شیطانیت** اور **غصہ** زیادہ ہوتا ہے، اور وضو اس اثر کو زائل کر کے سکون پیدا کرتا ہے۔",
                "دوسری رائے یہ ہے کہ یہ ایک **تعبدی** حکم ہے، یعنی ہمیں اس کی حکمت پر غور کیے بغیر صرف نبی ﷺ کے فرمان کی تعمیل کرنی چاہیے۔",
                "اس حکم پر عمل کرنا نبی ﷺ کی سنت کی کامل اتباع اور اللہ کے حکم کے سامنے تسلیم ہونے کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "Scholars cite the wisdom that camel meat is thought to contain an element of **devilishness** and **anger**, which Wudu removes by restoring calmness.",
                "Another view holds that this is a **devotional command (Ta'abbudi)**, meaning we must obey the Prophet's (ﷺ) instruction without needing to fully grasp the underlying reason.",
                "Acting upon this ruling demonstrates perfect adherence to the Sunnah and complete submission to the command of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بکری کے گوشت کا حکم",
        "english": "The Ruling on Sheep Meat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اختیاری سنت",
              "english": "Optional Sunnah"
            },
            "content": {
              "urdu": [
                "بکری کے گوشت کے بارے میں نبی ﷺ کا فرمان **\"إِنْ شِئْتَ\"** (اگر دل چاہے تو کر لو) اس بات کی دلیل ہے کہ یہ عمل صرف **مستحب** یا **اختیاری** ہے۔",
                "جمہور کے نزدیک ہر حلال جانور کا گوشت کھانے کے بعد وضو ٹوٹتا نہیں، سوائے اونٹ کے گوشت کے، لہٰذا یہ وضو صرف منہ کی صفائی کے لیے ہے۔",
                "یہ حکم اس بات کی ترغیب دیتا ہے کہ مسلمان کھانے کے بعد منہ کی صفائی کے لیے بھی ایک سادہ وضو کر لے، جو نفاست اور سنت ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) phrase **'If you wish'** regarding sheep meat shows that Wudu in this case is only **recommended (Mustaḥabb)** or optional, not compulsory.",
                "The majority holds that Wudu is not broken by eating any lawful meat except camel meat; therefore, this ablution is merely for cleansing the mouth.",
                "This ruling encourages Muslims to perform a simple Wudu after eating for the sake of cleanliness and following the prophetic tradition (Sunnah)."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمومی حکم",
              "english": "General Ruling"
            },
            "content": {
              "urdu": [
                "بکری کا گوشت کھانے کے بعد وضو کرنے کا حکم اس عام سنت کو واضح کرتا ہے کہ کھانے پینے کے بعد وضو کرنا افضل ہے، اگرچہ ضروری نہیں ہے۔",
                "یہ عام حکم تمام حلال گوشت پر لاگو ہوتا ہے، جس سے مسلمان کھانے کے بعد روحانی اور جسمانی طور پر پاکیزگی حاصل کرے۔",
                "یہ نبی ﷺ کی امت کے لیے آسانی اور شریعت کی وسعت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The ruling about Wudu after sheep meat clarifies the general Sunnah that it is better (Afḍal) to perform Wudu after eating, though not strictly required.",
                "This general principle applies to all lawful meats, allowing a Muslim to attain spiritual and physical purification after consuming food.",
                "This demonstrates the ease provided by the Prophet (ﷺ) for his Ummah and the comprehensive nature of Islamic law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وضو کا ٹوٹنا اور عدم ٹوٹنا",
        "english": "Wudu Invalidation and Non-Invalidation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ناقضِ وضو کا اصول",
              "english": "The Principle of Wudu Nullifiers"
            },
            "content": {
              "urdu": [
                "وضو کے ناقضِ وضو اعمال کی فہرست اس حدیث سے بڑھ کر ہے، لیکن یہ حدیث ایک **منصوص (textual)** ناقض کا اضافہ کرتی ہے جو عام قاعدہ کے خلاف ہے۔",
                "فقہی طور پر، اونٹ کا گوشت کھانے سے وضو ٹوٹنے کا حکم اس بات کی دلیل ہے کہ شریعت میں بعض چیزیں صرف وحی سے ہی معلوم ہوتی ہیں، عقل سے نہیں۔",
                "یہ حکم مسلمانوں کو یہ تعلیم دیتا ہے کہ وہ احکامِ شرعیہ میں صرف نبی ﷺ کے فرمان کی پیروی کریں۔"
              ],
              "english": [
                "The list of Wudu nullifiers is broader than this Hadith suggests, but this text adds a **textually confirmed (manṣūṣ)** nullifier that opposes the common rules.",
                "Jurisprudentially, the command to perform Wudu after camel meat proves that certain Sharia rulings are known only through revelation (waḥy) and not through human reasoning.",
                "This ruling instructs Muslims to follow only the Prophet's (ﷺ) explicit commands in matters of sacred law."
              ]
            }
          },
          {
            "title": {
              "urdu": "پکانے کا حکم",
              "english": "Ruling on Cooking"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک، صرف اونٹ کا **گوشت** کھانے سے وضو واجب ہوتا ہے، جبکہ اس کا **شوربہ** یا **دودھ** پینے سے وضو واجب نہیں ہوتا۔",
                "یہ فرق اس بات کی دلیل ہے کہ حکم صرف گوشت کے خاص اثرات سے متعلق ہے، نہ کہ اونٹ کے وجود سے متعلق۔",
                "لہٰذا، مسلمان کو چاہیے کہ وہ اس حکم کی پابندی کرے، تاکہ اس کی عبادت مکمل ہو۔"
              ],
              "english": [
                "According to jurists, Wudu is only obligated after eating the camel **meat** itself, but not after drinking its **broth** or **milk**.",
                "This distinction proves that the ruling is specific to the particular effect of the meat, and not generally related to the entire existence of the camel.",
                "Therefore, a Muslim must adhere to the precise application of this ruling to ensure their act of worship is complete and valid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی اور حدیث کی سند",
        "english": "Narrator and Hadith Authenticity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جابر بن سمرہؓ کا مقام",
              "english": "The Status of Jābir ibn Samurah (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا جابر بن سمرہ رضی اللہ عنہ کی یہ روایت صحیح مسلم میں ہونے کی وجہ سے **صحیح** ہے اور اس کی قوت بہت زیادہ ہے۔",
                "یہ حدیث وضو کے ناقضین کے بارے میں ایک واضح اور حتمی اصول فراہم کرتی ہے۔",
                "مسلمان کو چاہیے کہ وہ اس صحیح حدیث پر عمل کرے اور اونٹ کا گوشت کھانے کے بعد وضو کو تازہ کرے۔"
              ],
              "english": [
                "This narration from Jābir ibn Samurah (RA) is considered **authentic (Ṣaḥīḥ)** due to its presence in Ṣaḥīḥ Muslim, giving it immense strength.",
                "This Hadith provides a clear and definitive principle regarding the nullifiers of Wudu, which is crucial for determining purity.",
                "A Muslim must act upon this authentic Hadith and renew their Wudu after consuming camel meat."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت میں احتیاط",
              "english": "Precaution in Worship"
            },
            "content": {
              "urdu": [
                "اونٹ کا گوشت کھانے کے بعد وضو کرنا عبادت میں احتیاط اور کمال کے اصول کو ظاہر کرتا ہے۔",
                "چونکہ اونٹ کے گوشت سے متعلق حکم قطعی ہے، اس لیے اس پر عمل کرنے میں کوئی شک نہیں ہونا چاہیے۔",
                "یہ حکم مسلمانوں کو ہر عمل میں اللہ اور اس کے رسول ﷺ کی مرضی کو جاننے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Performing Wudu after eating camel meat illustrates the principle of precaution and seeking perfection in acts of worship.",
                "Since the ruling concerning camel meat is definitive (Qaṭ'ī), there should be no doubt about the necessity of acting upon it.",
                "This ruling encourages Muslims to seek the pleasure of Allah and His Messenger (ﷺ) in every single action they undertake."
              ]
            }
          }
        ]
      }
    }
  ]
}
