{
  "hadithId": 1320,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/90"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "الجامع - باب السيرة والجهاد",
    "babId": 106
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (3483، 6120).‏",
    "urdu": "صحیح۔ اسے امام بخاری نے اپنی صحیح میں دو مقامات (3483، 6120) پر روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (3483, 6120)."
  },
  "importantWords": [
    {
      "arabic": "أَدْرَكَ",
      "english": "Obtained / Reached",
      "urdu": "پایا / حاصل کیا"
    },
    {
      "arabic": "اَلنُّبُوَّةِ اَلْأُولَى",
      "english": "The First Prophecy",
      "urdu": "پہلی نبوت / سابقہ انبیاء"
    },
    {
      "arabic": "تَسْتَحِ",
      "english": "Feel shame / Have modesty",
      "urdu": "حیا کرے / شرم کرے"
    },
    {
      "arabic": "فَاصْنَعْ",
      "english": "Then do / act",
      "urdu": "پس کر ڈال"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث حیا کی اہمیت کو اجاگر کرتی ہے۔ حیا انسان کے لیے ایک اخلاقی ڈھال ہے، جب یہ ختم ہو جائے تو انسان ہر قسم کی برائی اور بے راہ روی کا شکار ہو جاتا ہے۔",
    "english": "This Hadith highlights the importance of modesty (Haya). It acts as a moral shield for humans; once it is lost, a person becomes susceptible to all kinds of evil and immorality."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب أحاديث الأنبياء، رقم 3484",
      "english": "Sahih al-Bukhari, Book of Stories of the Prophets, No. 3484"
    },
    {
      "arabic": "صحيح البخاري، كتاب الأدب، باب إذا لم تستحي فاصنع ما شئت، رقم 6120",
      "english": "Sahih al-Bukhari, Book of Manners, No. 6120"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو مسعود البدري",
        "english": "Abu Mas'ud al-Badri"
      },
      "slug": "abu-masud-al-badri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیا: قدیم نبوی تعلیم",
        "english": "Modesty: An Ancient Prophetic Teaching"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبوتِ اولیٰ کا کلام",
              "english": "Words of the First Prophecy"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ حیا کی اہمیت تمام سابقہ انبیاء کی تعلیمات کا حصہ رہی ہے۔",
                "یہ ایسی اخلاقی قدر ہے جو انسانی فطرت کا حصہ ہے اور وقت کے ساتھ تبدیل نہیں ہوئی۔",
                "نبی کریم ﷺ نے اس قدیم حکمت کو دہرا کر اس کی دائمی اہمیت واضح فرمائی۔"
              ],
              "english": [
                "This means that the importance of modesty has been a part of the teachings of all previous Prophets.",
                "It is a moral value inherent in human nature that has not changed over time.",
                "The Prophet (ﷺ) reiterated this ancient wisdom to clarify its eternal significance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کے مفہوم کی تشریح",
        "english": "Interpretation of the Hadith's Meaning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دھمکی یا اجازت؟",
              "english": "Threat or Permission?"
            },
            "content": {
              "urdu": [
                "اس حدیث کا مطلب برائی کی اجازت دینا نہیں بلکہ یہ ایک سخت انتباہ اور دھمکی ہے۔",
                "مطلب یہ ہے کہ اگر تم میں حیا نہیں رہی تو تم اللہ کے عذاب سے نہیں ڈرتے، اب تم جو چاہو کر لو، انجام خود دیکھ لوگے۔",
                "دوسرا مفہوم یہ ہے کہ جس کام میں شرم و حیا نہ ہو (یعنی وہ کام جائز ہو)، صرف وہی کام کیا جائے۔"
              ],
              "english": [
                "This Hadith does not grant permission for evil; rather, it is a stern warning and threat.",
                "It means that if you have no shame and do not fear Allah's punishment, then do whatever you want and face the consequences.",
                "A second meaning is: if an action is not shameful (i.e., it is permissible), only then should you do it."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا ایک رکاوٹ ہے",
              "english": "Modesty as a Deterrent"
            },
            "content": {
              "urdu": [
                "حیا وہ صفت ہے جو انسان کو گناہوں اور گھٹیا کاموں سے روک کر رکھتی ہے۔",
                "جب حیا کا پردہ چاک ہو جاتا ہے، تو انسان کے لیے گناہ کرنا آسان ہو جاتا ہے۔",
                "نبی ﷺ نے فرمایا: 'حیا ایمان کا ایک بڑا حصہ ہے۔'"
              ],
              "english": [
                "Modesty is the quality that restrains a person from sins and base actions.",
                "Once the veil of modesty is torn, committing sins becomes easy for a person.",
                "The Prophet (ﷺ) said: 'Modesty is a significant branch of faith.'"
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حیا کی اقسام",
        "english": "Types of Modesty"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ سے حیا اور مخلوق سے حیا",
              "english": "Shame before Allah and before Creation"
            },
            "content": {
              "urdu": [
                "اللہ سے حیا کا مطلب یہ ہے کہ انسان تنہائی میں بھی گناہ نہ کرے کیونکہ اللہ دیکھ رہا ہے۔",
                "مخلوق سے حیا کا مطلب معاشرتی آداب کا خیال رکھنا اور بے ہودگی سے بچنا ہے۔",
                "حقیقی حیا یہ ہے کہ انسان اپنے دماغ، پیٹ اور خیالات کی پاکیزگی کی حفاظت کرے۔"
              ],
              "english": [
                "Modesty before Allah means not sinning even in private because Allah is watching.",
                "Modesty before creation involves observing social etiquettes and avoiding obscenity.",
                "True modesty is for a person to guard the purity of their mind, stomach, and thoughts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کردار کی مضبوطی",
              "english": "Strength of Character"
            },
            "content": {
              "urdu": [
                "معاشرے میں فحاشی اور بے حیائی کو روکنا ہر مسلمان کی ذمہ داری ہے۔",
                "ہمیں اپنے لباس، گفتگو اور سوشل میڈیا کے استعمال میں حیا کو ملحوظ خاطر رکھنا چاہیے۔",
                "جس معاشرے سے حیا ختم ہو جائے، وہاں انسانیت کا جنازہ نکل جاتا ہے۔"
              ],
              "english": [
                "Preventing obscenity and immodesty in society is the responsibility of every Muslim.",
                "We must maintain modesty in our attire, speech, and social media usage.",
                "In a society where modesty vanishes, humanity suffers a moral death."
              ]
            }
          }
        ]
      }
    }
  ]
}