{
  "hadithId": 1121,
  "hadithNo": 42,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/42"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (2758)، والنسائي (7/205)، وأحمد (6/8)، وابن حبان (4863). والقصة أن أبا رافع جاء قاصداً من قريش فأسلم، فأراد البقاء، فأمره النبي صلى الله عليه وسلم بالرجوع لوفاء العهد.",
    "urdu": "صحیح۔ اسے ابو داؤد (2758)، نسائی (7/205) اور احمد نے روایت کیا ہے، اور ابن حبان نے اسے صحیح قرار دیا ہے۔ اس حدیث کا پس منظر یہ ہے کہ ابورافع قریش کے قاصد بن کر آئے اور اسلام لانے کے بعد واپس نہیں جانا چاہتے تھے، مگر آپ ﷺ نے انہیں عہد کی پاسداری کے لیے واپس بھیجا۔",
    "english": "Sahih. Reported by Abu Dawud (2758), An-Nasa'i (7/205), Ahmad (6/8), and Ibn Hibban (4863). The context is that Abu Rafi' came as an envoy for Quraysh, embraced Islam, and wanted to stay, but the Prophet (ﷺ) ordered him to return to fulfill the diplomatic protocol."
  },
  "importantWords": [
    {
      "arabic": "لَا أَخِيسُ",
      "english": "I do not break / betray",
      "urdu": "میں دھوکہ نہیں دیتا / عہد نہیں توڑتا"
    },
    {
      "arabic": "الْعَهْدِ",
      "english": "Covenant / Pledge",
      "urdu": "عہد / وعدہ"
    },
    {
      "arabic": "لَا أَحْبِسُ",
      "english": "I do not detain / imprison",
      "urdu": "میں قید نہیں کرتا / نہیں روکتا"
    },
    {
      "arabic": "الرُّسُلَ",
      "english": "Messengers / Envoys",
      "urdu": "قاصد / سفیر"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اسلامی سفارت کاری کے دو بنیادی اصول بیان ہوئے ہیں: پہلا یہ کہ ریاستوں کے درمیان کیے گئے معاہدوں کی پاسداری لازمی ہے، اور دوسرا یہ کہ سفیروں کو سفارتی تحفظ حاصل ہے، انہیں قید نہیں کیا جا سکتا۔",
    "english": "This Hadith highlights two fundamental principles of Islamic diplomacy: the obligation to fulfill international covenants and the granting of diplomatic immunity to envoys."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2758)",
      "english": "Narrated by Abu Dawud (2758)"
    },
    {
      "arabic": "رواه النسائي (4486)",
      "english": "Narrated by An-Nasa'i (4486)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو رافع",
        "english": "Abu Rafi'"
      },
      "slug": "abu-rafi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عہد کی پاسداری",
        "english": "Fulfilling Covenants"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسلامی اخلاقیات اور معاہدے",
              "english": "Islamic Ethics and Treaties"
            },
            "content": {
              "urdu": [
                "اسلام میں وعدے کی خلاف ورزی منافقت کی علامت قرار دی گئی ہے۔",
                "ریاستی سطح پر کیے گئے معاہدوں کی پاسداری دشمن کے ساتھ بھی لازمی ہے۔",
                "نبی کریم ﷺ نے ہمیشہ امن کے معاہدوں کو جنگی فوائد پر فوقیت دی۔"
              ],
              "english": [
                "In Islam, breaking a promise is considered a sign of hypocrisy.",
                "Adhering to state-level treaties is mandatory, even with enemies.",
                "The Prophet (ﷺ) always prioritized peace treaties over immediate military advantages."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابورافع کا واقعہ اور سبق",
              "english": "The Incident of Abu Rafi'"
            },
            "content": {
              "urdu": [
                "ابورافع قریش کی طرف سے قاصد بن کر آئے اور اسلام کے گرویدہ ہو گئے۔",
                "انہوں نے مکہ واپس جانے سے انکار کیا، مگر آپ ﷺ نے سفارتی ضابطے کی بنا پر انہیں واپس بھیجا۔",
                "آپ ﷺ نے واضح کیا کہ قاصد کو واپس بھیجنا عہد کا حصہ ہے، چاہے وہ مسلمان ہی کیوں نہ ہو جائے۔"
              ],
              "english": [
                "Abu Rafi' came as an envoy of the Quraysh and was attracted to Islam.",
                "He refused to return to Makkah, but the Prophet (ﷺ) sent him back due to diplomatic protocols.",
                "The Prophet (ﷺ) clarified that returning an envoy is part of the pledge, regardless of their conversion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سفارتی تحفظ (Diplomatic Immunity)",
        "english": "Diplomatic Immunity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قاصدوں کی حفاظت",
              "english": "Protection of Envoys"
            },
            "content": {
              "urdu": [
                "سفیر یا قاصد کو جنگ و امن دونوں حالتوں میں مکمل تحفظ حاصل ہوتا ہے۔",
                "سفیر کو قید کرنا یا اسے قتل کرنا بین الاقوامی اسلامی قوانین کی سنگین خلاف ورزی ہے۔",
                "یہ اصول ریاستوں کے درمیان ابلاغ اور بات چیت کا راستہ کھلا رکھتا ہے۔"
              ],
              "english": [
                "Envoys and messengers enjoy full protection during both war and peace.",
                "Detaining or killing an ambassador is a grave violation of international Islamic law.",
                "This principle keeps the channels of communication open between states."
              ]
            }
          },
          {
            "title": {
              "urdu": "بات چیت کے ذریعے حل",
              "english": "Resolution Through Dialogue"
            },
            "content": {
              "urdu": [
                "قاصدوں کو نہ روکنے کی حکمت یہ ہے کہ مسائل جنگ کے بجائے مذاکرات سے حل ہوں۔",
                "اسلام دشمن کے سفیر کی بات سننے اور اسے باحفاظت رخصت کرنے کا حکم دیتا ہے۔",
                "یہ سنت موجودہ دور کے 'سفارتی تحفظ' کے عالمی قوانین کی بنیاد ہے۔"
              ],
              "english": [
                "The wisdom in not detaining envoys is to resolve issues through negotiation rather than war.",
                "Islam commands listening to the enemy's envoy and granting them safe passage.",
                "This Sunnah is the foundation of modern international diplomatic immunity laws."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور سیاسی پہلو",
        "english": "Juristic and Political Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمران کے لیے رہنمائی",
              "english": "Guidance for Rulers"
            },
            "content": {
              "urdu": [
                "ایک مسلمان حکمران کو اپنے قول و فعل میں دیانت دار ہونا چاہیے۔",
                "مصلحت کے نام پر معاہدوں کو توڑنا اسلامی سیاست کا شیوہ نہیں ہے۔",
                "عالمی تعلقات میں اعتماد کی بحالی کے لیے اخلاقیات سب سے مقدم ہیں۔"
              ],
              "english": [
                "A Muslim ruler must be honest in both word and deed.",
                "Breaking treaties in the name of political expediency is not the way of Islamic politics.",
                "Ethics are paramount in restoring trust in international relations."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلام کا عالمی تشخص",
              "english": "Islam's Global Image"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ اسلام امن اور ضابطوں کا دین ہے۔",
                "مسلمانوں کی ساکھ ان کے اعلیٰ کردار اور وفائے عہد سے بنتی ہے۔",
                "دشمن کے ساتھ بھی انصاف کرنا قرآن و سنت کا واضح حکم ہے۔"
              ],
              "english": [
                "This Hadith proves that Islam is a religion of peace and regulations.",
                "The credibility of Muslims is built on their high character and fulfillment of pledges.",
                "Being just even with enemies is a clear command of the Quran and Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانت داری کی اہمیت",
              "english": "Importance of Honesty"
            },
            "content": {
              "urdu": [
                "ہمیں اپنی روزمرہ زندگی میں وعدوں کی پابندی کرنی چاہیے۔",
                "دھوکہ دہی سے حاصل کیا گیا فائدہ عارضی اور باعثِ وبال ہوتا ہے۔",
                "نبی ﷺ کی زندگی کا ہر لمحہ ہمارے لیے نمونۂ کامل ہے۔"
              ],
              "english": [
                "We must adhere to our promises in our daily lives.",
                "Gains obtained through deception are temporary and bring divine punishment.",
                "Every moment of the Prophet's (ﷺ) life is a perfect model for us."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظم و ضبط کی پاسداری",
              "english": "Adherence to Discipline"
            },
            "content": {
              "urdu": [
                "ریاستی اور سماجی ضوابط کا احترام کرنا ہر شہری کی ذمہ داری ہے۔",
                "جذبات میں آکر قانونی حدود کو پار نہیں کرنا چاہیے۔",
                "اسلامی تعلیمات ایک منظم اور پرامن معاشرے کی بنیاد رکھتی ہیں۔"
              ],
              "english": [
                "Respecting state and social regulations is the responsibility of every citizen.",
                "One should not cross legal boundaries based on emotions.",
                "Islamic teachings lay the foundation for an organized and peaceful society."
              ]
            }
          }
        ]
      }
    }
  ]
}