{
  "hadithId": 845,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/22"],
    "kitabId": 8,
    "inKitabBab": 1,
    "arabicBook": "كتاب النكاح",
    "babId": 64
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1409)، وأبو داود (1841)، والترمذي (840)، والنسائي (3283)، وابن ماجه (1966). وزيادة ابن حبان (1274).",
    "urdu": "صحیح۔ اسے مسلم (1409)، ابوداؤد (1841)، ترمذی (840)، نسائی (3283) اور ابن ماجہ (1966) نے روایت کیا ہے۔ ابن حبان کی اضافہ شدہ روایت بھی مستند ہے۔",
    "english": "Sahih. Reported by Muslim (1409), Abu Dawud (1841), At-Tirmidhi (840), An-Nasa'i (3283), and Ibn Majah (1966). The addition is found in Ibn Hibban (1274)."
  },
  "importantWords": [
    {
      "arabic": "اَلْمُحْرِمُ",
      "english": "One in Ihram",
      "urdu": "احرام والا"
    },
    {
      "arabic": "لَا يَنْكِحُ",
      "english": "Shall not marry",
      "urdu": "نکاح نہ کرے"
    },
    {
      "arabic": "يُنْكَحُ",
      "english": "Be married off",
      "urdu": "نکاح کرایا جائے"
    },
    {
      "arabic": "يَخْطُبُ",
      "english": "Propose",
      "urdu": "پیغام بھیجنا"
    },
    {
      "arabic": "يُخْطَبُ",
      "english": "Be proposed to",
      "urdu": "پیغام وصول کرنا"
    }
  ],
  "summary": {
    "urdu": "حالتِ احرام میں نکاح کرنا، کروانا یا رشتے کا پیغام بھیجنا منع ہے؛ یہ پابندی حج و عمرہ کے تقدس اور مکمل توجہ عبادت کی طرف رکھنے کے لیے ہے۔",
    "english": "In the state of Ihram, marrying, performing a marriage for others, or proposing is forbidden to maintain the sanctity of Hajj/Umrah and focus solely on worship."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1409)",
      "english": "Sahih Muslim (1409)"
    },
    {
      "arabic": "صحيح ابن حبان (1274)",
      "english": "Sahih Ibn Hibban (1274)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عثمان بن عفان",
        "english": "Uthman bin Affan"
      },
      "slug": "uthman-bin-affan"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3L0f6LpB3M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "احرام میں نکاح کی ممانعت",
        "english": "Prohibition of Marriage in Ihram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نکاح کا انعقاد",
              "english": "Execution of Marriage"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک حالتِ احرام میں کیا گیا نکاح باطل اور کالعدم ہوتا ہے۔",
                "احرام کی حالت میں انسان کو دنیاوی لذتوں سے دور رہ کر اللہ کی طرف متوجہ ہونا چاہیے۔",
                "یہ ممانعت مرد اور عورت دونوں کے لیے یکساں طور پر لاگو ہوتی ہے۔"
              ],
              "english": [
                "According to the majority of jurists, a marriage contract made in the state of Ihram is void.",
                "In Ihram, a person must distance themselves from worldly pleasures and focus on Allah.",
                "This prohibition applies equally to both men and women during their pilgrimage."
              ]
            }
          },
          {
            "title": {
              "urdu": "پیغامِ نکاح (رشتہ) بھیجنا",
              "english": "Proposing Marriage"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے نہ صرف نکاح بلکہ رشتے کی بات کرنے سے بھی منع فرمایا ہے۔",
                "اس کا مقصد یہ ہے کہ انسان کا ذہن رشتہ داریوں کے بجائے مکمل طور پر حج یا عمرہ کے مناسک میں رہے۔",
                "رشتہ طے کرنا یا منگنی کرنا بھی احرام کے تقدس کے منافی قرار دیا گیا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) forbade not only the marriage contract but also the proposal itself.",
                "The goal is to keep the pilgrim's mind focused on rituals rather than social ties.",
                "Settling a proposal or engaging in betrothal is deemed contrary to the sanctity of Ihram."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دوسروں کا نکاح کروانا",
        "english": "Performing Marriage for Others"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ولی بننا",
              "english": "Acting as a Guardian"
            },
            "content": {
              "urdu": [
                "ایک محرم شخص کسی دوسری عورت کا ولی بن کر اس کا نکاح بھی نہیں کروا سکتا۔",
                "ولایت کے فرائض انجام دینا بھی نکاح کے زمرے میں آتا ہے جو احرام میں منع ہے۔",
                "اگر کوئی محرم نکاح پڑھائے گا تو وہ شرعی طور پر معتبر نہیں مانا جائے گا۔"
              ],
              "english": [
                "A person in Ihram cannot act as a guardian (Wali) to marry off another woman.",
                "Performing the duties of guardianship falls under the category of marriage-related acts forbidden in Ihram.",
                "If a Muhrim conducts a marriage, it will not be considered legally valid in Sharia."
              ]
            }
          },
          {
            "title": {
              "urdu": "نکاح خواں اور گواہ",
              "english": "Officiant and Witnesses"
            },
            "content": {
              "urdu": [
                "اہلِ علم کے مطابق نکاح میں گواہی دینے یا نکاح پڑھانے سے بھی بچنا چاہیے۔",
                "اگرچہ بعض فقہاء نے گواہی کی گنجائش دی ہے، مگر احتیاط اسی میں ہے کہ اس سے دور رہا جائے۔",
                "احرام کی حالت میں ہر ایسی چیز سے اجتناب ضروری ہے جو شہوانی یا دنیاوی رغبت کا باعث ہو۔"
              ],
              "english": [
                "Scholars suggest avoiding acting as a witness or officiating a marriage while in Ihram.",
                "While some jurists allow witnessing, it is more cautious to abstain from it entirely.",
                "Avoidance of anything leading to worldly or sexual desire is essential during Ihram."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی حکمت اور مقصد",
        "english": "Legal Wisdom and Objective"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت کا خلوص",
              "english": "Sincerity of Worship"
            },
            "content": {
              "urdu": [
                "حج اور عمرہ ایک بڑی قربانی ہے جس میں بندہ اپنے رب کے لیے سب کچھ چھوڑ دیتا ہے۔",
                "نکاح جیسی سرگرمیوں کو روک کر بندے کو روحانی ارتقاء کا موقع دیا جاتا ہے۔",
                "یہ پابندی عارضی ہے اور احرام کھلتے ہی ختم ہو جاتی ہے۔"
              ],
              "english": [
                "Hajj and Umrah are great sacrifices where a servant leaves everything for their Lord.",
                "By halting activities like marriage, the servant is given a chance for spiritual growth.",
                "This restriction is temporary and ends as soon as the state of Ihram is terminated."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی اور قلبی طہارت",
              "english": "Physical and Spiritual Purity"
            },
            "content": {
              "urdu": [
                "احرام کی حالت میں خوشبو، سلے ہوئے کپڑے اور نکاح کی پابندی انسان کو عاجزی سکھاتی ہے۔",
                "دل کو دنیاوی شہوات سے پاک رکھنا حجِ مبرور کی بنیادی شرط ہے۔",
                "نکاح کے معاملات سے دوری انسان کو قلبی سکون اور توجہ فراہم کرتی ہے۔"
              ],
              "english": [
                "Restrictions on perfume, stitched clothes, and marriage in Ihram teach humility.",
                "Purifying the heart from worldly desires is a fundamental condition for an accepted Hajj.",
                "Staying away from marriage affairs provides the person with inner peace and focus."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی حدود کا احترام",
              "english": "Respect for Sharia Limits"
            },
            "content": {
              "urdu": [
                "ایک مومن کو چاہیے کہ وہ ہر حال میں اللہ کی مقرر کردہ حدود کا پاس رکھے۔",
                "عبادات کے دوران شرعی پابندیوں کی خلاف ورزی عمل کو ضائع کر سکتی ہے۔",
                "سنتِ نبوی ﷺ پر عمل کرنا ہی نجات اور کامیابی کا راستہ ہے۔"
              ],
              "english": [
                "A believer must respect the limits set by Allah in every situation.",
                "Violating Sharia restrictions during worship can render the deeds void.",
                "Following the Sunnah of the Prophet (ﷺ) is the only path to salvation and success."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور نظم و ضبط",
              "english": "Moderation and Discipline"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں وقت اور مقام کی اہمیت کے مطابق عمل کرنے کا نظم و ضبط سکھاتا ہے۔",
                "حج کا سفر محض سیر و سیاحت نہیں بلکہ ایک پاکیزہ تربیتی کورس ہے۔",
                "ہمیں اپنے معاملات کو شریعت کے مطابق ڈھالنے کی عادت ڈالنی چاہیے۔"
              ],
              "english": [
                "Islam teaches us the discipline to act according to the importance of time and place.",
                "The journey of Hajj is not just tourism but a pure spiritual training course.",
                "We must form the habit of aligning our affairs with the requirements of Sharia."
              ]
            }
          }
        ]
      }
    }
  ]
}