{
  "hadithId": 887,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/86"],
    "kitabId": 8,
    "inKitabBab": 4,
    "arabicBook": "كتاب النكاح",
    "babId": 67
  },
  
  "takhreej": {
    "arabic": "منكر بهذا الإسناد. رواه الترمذي (1113)، وابن ماجه (1888) من طريق عاصم بن عبيد الله، وهو ضعيف. وصححه الترمذي، لكن ضعفه البخاري وأبو حاتم والذهبي لضعف عاصم بن عبيد الله.",
    "urdu": "یہ روایت اس سند کے ساتھ 'منکر' ہے۔ اسے ترمذی اور ابن ماجہ نے عاصم بن عبید اللہ کے واسطے سے روایت کیا ہے جو کہ ضعیف راوی ہیں۔ امام ترمذی نے اسے حسن صحیح کہا ہے مگر امام بخاری، ابو حاتم اور علامہ ذہبی نے عاصم کی وجہ سے اسے منکر اور ضعیف قرار دیا ہے۔",
    "english": "Munkar (Rejected) with this chain. Reported by At-Tirmidhi (1113) and Ibn Majah (1888) via 'Asim bin 'Ubaidullah, who is weak. While At-Tirmidhi graded it Sahih, Al-Bukhari, Abu Hatim, and Adh-Dhahabi disagreed due to the weakness of 'Asim."
  },
  "importantWords": [
    {
      "arabic": "أَجَازَ",
      "english": "Approved / Permitted",
      "urdu": "جائز قرار دیا"
    },
    {
      "arabic": "نَعْلَيْنِ",
      "english": "Two sandals / shoes",
      "urdu": "دو جوتیاں"
    },
    {
      "arabic": "خُولِفَ",
      "english": "Disputed / Opposed",
      "urdu": "اختلاف کیا گیا"
    },
    {
      "arabic": "صَدَاق",
      "english": "Dower (Mahr)",
      "urdu": "حق مہر"
    }
  ],
  "summary": {
    "urdu": "اگرچہ اس خاص روایت کی سند میں کلام ہے، لیکن اس کا مفہوم (کہ مہر کم سے کم بھی ہو سکتا ہے) دیگر صحیح احادیث سے ثابت ہے کہ مہر کی کوئی کم از کم مقدار مقرر نہیں ہے۔",
    "english": "Although this specific chain is weak, its meaning—that there is no minimum fixed amount for Mahr and it can be small—is supported by other authentic narrations."
  },
  "references": [
    {
      "arabic": "جامع الترمذي (1113)",
      "english": "Jami' at-Tirmidhi (1113)"
    },
    {
      "arabic": "سنن ابن ماجه (1888)",
      "english": "Sunan Ibn Majah (1888)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عامر بن ربيعة",
        "english": "Amir bin Rabi'ah"
      },
      "slug": "amir-bin-rabiah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI7lT3w0",
  "grade": {
    "arabic": "منكر / ضعيف",
    "english": "Munkar / Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مہر کی کم از کم مقدار",
        "english": "Minimum Amount of Mahr"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی اور آسانی",
              "english": "Simplicity and Ease"
            },
            "content": {
              "urdu": [
                "اس روایت سے معلوم ہوتا ہے کہ مہر کا بہت زیادہ ہونا نکاح کی شرط نہیں ہے۔",
                "اگر عورت معمولی مہر پر راضی ہو جائے تو نکاح شرعاً منعقد ہو جاتا ہے۔",
                "اسلام نے نکاح کو اتنا آسان بنایا ہے کہ جوتوں کا جوڑا بھی مہر بن سکتا ہے۔"
              ],
              "english": [
                "This narration suggests that an expensive dower is not a prerequisite for marriage.",
                "If a woman agrees to a minimal dower, the marriage is legally valid in Sharia.",
                "Islam made marriage simple enough that even a pair of sandals can suffice as Mahr."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی مذاہب کی رائے",
              "english": "Opinions of Juristic Schools"
            },
            "content": {
              "urdu": [
                "امام شافعی، احمد اور اسحاق بن راہویہ کے نزدیک مہر کی کوئی کم از کم حد مقرر نہیں ہے۔",
                "امام ابو حنیفہ کے نزدیک کم از کم مہر 10 درہم اور امام مالک کے نزدیک 3 درہم ہے۔",
                "جمہور کے نزدیک ہر وہ چیز مہر بن سکتی ہے جس کی کوئی مالی قیمت (خواہ تھوڑی ہو) موجود ہو۔"
              ],
              "english": [
                "Imams Shafi'i, Ahmad, and Ishaq believe there is no fixed minimum limit for Mahr.",
                "According to Imam Abu Hanifa, the minimum is 10 dirhams, and for Imam Malik, it is 3 dirhams.",
                "The majority hold that anything with financial value (no matter how small) can be Mahr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت کی اسنادی حیثیت",
        "english": "Authenticity of the Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاصم بن عبید اللہ پر جرح",
              "english": "Criticism of 'Asim bin 'Ubaidullah"
            },
            "content": {
              "urdu": [
                "اس روایت کے راوی عاصم بن عبید اللہ حفظ کے اعتبار سے ضعیف مانے جاتے ہیں۔",
                "امام بخاری اور امام ابو حاتم نے اس روایت کو 'منکر' یعنی ناقابلِ قبول قرار دیا ہے۔",
                "ترمذی کی 'تصحیح' پر دیگر ائمہ حدیث نے اسی بنا پر تعاقب کیا ہے۔"
              ],
              "english": [
                "The narrator 'Asim bin 'Ubaidullah is considered weak in terms of memory.",
                "Imam Al-Bukhari and Abu Hatim categorized this specific narration as 'Munkar' (rejected).",
                "Other Hadith scholars disagreed with At-Tirmidhi's authentication due to this narrator."
              ]
            }
          },
          {
            "title": {
              "urdu": "شواہد کی روشنی میں مفہوم",
              "english": "Meaning in Light of Corroboration"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ خاص قصہ ضعیف ہے، مگر صحیح بخاری کی 'لوہے کی انگوٹھی' والی حدیث اس کی تائید کرتی ہے۔",
                "نبی کریم ﷺ نے ایک صحابی کو 'لوہے کی انگوٹھی' لانے کا حکم دیا تھا جو مہر کی کمی پر دلیل ہے۔",
                "لہذا مہر کی قلت نکاح کے باطل ہونے کا سبب نہیں بنتی۔"
              ],
              "english": [
                "While this specific story is weak, the Sahih Bukhari Hadith about an 'iron ring' supports its core meaning.",
                "The Prophet (ﷺ) asked a companion to find even an iron ring, proving Mahr can be small.",
                "Therefore, a low amount of Mahr does not invalidate the marriage contract."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی پیغام",
        "english": "Social Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال و دولت پر تقویٰ کی ترجیح",
              "english": "Piety Over Wealth"
            },
            "content": {
              "urdu": [
                "اسلام مہر کو عورت کی قیمت نہیں بلکہ ایک علامتی تحفہ قرار دیتا ہے۔",
                "رشتہ طے کرتے وقت اخلاق اور دین داری کو مادی مال پر فوقیت دینی چاہیے۔",
                "بھاری مہروں کے رواج نے معاشرے میں نکاح کو مشکل اور زنا کو آسان بنا دیا ہے۔"
              ],
              "english": [
                "Islam views Mahr not as a price for the woman but as a symbolic gift.",
                "When finalizing a marriage, character and piety should outweigh material wealth.",
                "The custom of heavy dowries has made marriage difficult and immorality easy in society."
              ]
            }
          },
          {
            "title": {
              "urdu": "خواتین کا ایثار",
              "english": "Sacrifice of Women"
            },
            "content": {
              "urdu": [
                "اس روایت میں مذکور خاتون کی رضامندی عورتوں کے ایثار اور دین دوستی کو ظاہر کرتی ہے۔",
                "صحابہ کرام کے دور میں خواتین دنیاوی ساز و سامان کے بجائے نیک شوہر کو ترجیح دیتی تھیں۔",
                "قناعت اور سادگی ہی گھریلو برکت کا اصل ذریعہ ہیں۔"
              ],
              "english": [
                "The consent of the woman mentioned shows the selflessness and religious devotion of women.",
                "During the Sahaba's era, women prioritized a righteous husband over worldly goods.",
                "Contentment and simplicity are the true sources of domestic blessings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال کی راہ",
              "english": "The Path of Moderation"
            },
            "content": {
              "urdu": [
                "مہر نہ اتنا کم ہو کہ عورت کی تحقیر ہو اور نہ اتنا زیادہ کہ مرد کی کمر ٹوٹ جائے۔",
                "بہترین مہر وہ ہے جو شوہر کی استطاعت کے مطابق اور باہمی خوشی سے طے ہو۔",
                "سنتِ نبوی ﷺ پر عمل کرنا ہی تمام معاشرتی بگاڑ کا واحد حل ہے۔"
              ],
              "english": [
                "Mahr should neither be so low as to insult the woman nor so high as to break the man.",
                "The best Mahr is that which matches the husband's capacity and is agreed upon happily.",
                "Adhering to the Sunnah is the only solution to all social corruptions."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحقیقِ حدیث کی اہمیت",
              "english": "Importance of Hadith Research"
            },
            "content": {
              "urdu": [
                "یہ حدیث سکھاتی ہے کہ صرف 'ترمذی' یا کسی کتاب میں ہونا کافی نہیں، اسناد کی پرکھ ضروری ہے۔",
                "محدثین کا باہمی اختلاف علمی باریکیوں اور دیانت داری کا ثبوت ہے۔",
                "ہمیں مستند احکام کے لیے ثقہ علماء اور محدثین کی تحقیقات پر اعتماد کرنا چاہیے۔"
              ],
              "english": [
                "This Hadith teaches that being in a book is not enough; critical analysis of chains is vital.",
                "Disagreements among scholars prove their academic depth and intellectual honesty.",
                "We must rely on the research of trustworthy scholars for authentic religious rulings."
              ]
            }
          }
        ]
      }
    }
  ]
}