{
  "hadithId": 127,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["1:127"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": "صحيح.  رواه أبو داود (213)  وتضعيف أبي داود رحمه الله في محله، ولكنه ينصب على حديث معاذ، إذ إسناده ضعيف، وفيه زيادة وهي قوله: \"والتعفف عن ذلك أفضل\" وهي زيادة منكرة.  وتصحيحي للحديث إنما هو للجملة التي ذكرها الحافظ فقط، إذ يوجد ما يشهد لها كما هو مذكور \"بالأصل\".  والله أعلم. والرواية الصحيحة هي حديث عائشة (123).",
    "urdu": "صحیح (درست) ہے۔ اسے ابو داؤد (213) نے روایت کیا ہے۔ ابو داؤد کا اسے ضعیف قرار دینا اپنی جگہ درست ہے، لیکن یہ حکم صرف معاذ کی حدیث پر لاگو ہوتا ہے، کیونکہ اس کی سند ضعیف ہے اور اس میں ایک اضافہ ہے \"والتعفف عن ذلك أفضل\" (اور اس سے مکمل پرہیز کرنا بہتر ہے)، جو کہ منکر اضافہ ہے۔ اور اس حدیث کو میں نے صرف حافظ (ابن حجر) کی ذکر کردہ جملہ کی بنا پر صحیح کہا ہے، کیونکہ اس کی شاہد (مضبوط دلیل) موجود ہے جیسا کہ اصل میں مذکور ہے۔ اور صحیح روایت وہ ہے جو سیدہ عائشہ کی حدیث (123) میں ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (213). Abu Dawud's grading of it as weak is correct, but applies specifically to the Hadith of Mu'adh because its chain is weak and contains a rejected addition: 'And abstaining from that is better.' My grading of the Hadith as Sahih is only for the specific phrase mentioned by Al-Hafiz, as it has supporting evidence (Shahid) from other sources (like Aishah's Hadith 123). The authentic ruling is established by the Hadith of Aishah (123)."
  },
  "importantWords": [
    {
      "arabic": "يَحِلُّ",
      "english": "Is lawful/permissible",
      "urdu": "حلال ہے"
    },
    {
      "arabic": "حَائِضٌ",
      "english": "Menstruating",
      "urdu": "حائضہ"
    },
    {
      "arabic": "مَا فَوْقَ اَلْإِزَارِ",
      "english": "What is above the Izar",
      "urdu": "تہبند سے اوپر کا حصہ"
    },
    {
      "arabic": "اَلْإِزَارِ",
      "english": "The Izar (waist-wrapper)",
      "urdu": "تہبند/پاجامہ"
    },
    {
      "arabic": "وَضَعَّفَه",
      "english": "He graded it weak",
      "urdu": "اسے ضعیف قرار دیا"
    }
  ],
  "summary": {
    "urdu": "سیدنا معاذ رضی اللہ عنہ کے سوال کے جواب میں نبی اکرم ﷺ نے فرمایا کہ حیض کی حالت میں شوہر کے لیے بیوی کے جسم کا وہ حصہ حلال ہے جو تہبند یا پاجامے کے اوپر ہو۔ یہ حد بندی حیض کے دوران جماع سے بچنے کی ایک عملی صورت ہے۔",
    "english": "In response to Mu'adh's question, the Prophet ﷺ stated that during menses, the part of the wife's body that is above the waist-wrapper (Izar) is permissible for the husband. This demarcation provides a practical boundary to avoid sexual intercourse during menstruation."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (213)",
      "english": "Reported by Abu Dawud (213)"
    },
    {
      "arabic": "ضعفه أبو داود",
      "english": "Graded weak by Abu Dawud"
    }
  ],
  "narrators": [
    {
      "id": 12701,
      "name": {
        "arabic": "مُعَاذُ بْنُ جَبَلٍ",
        "english": "Mu'adh ibn Jabal"
      },
      "slug": "muadh-ibn-jabal"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیض میں قربت کی حدود",
        "english": "Boundaries of Closeness During Menses"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحریم کا علاقہ",
              "english": "The Area of Prohibition"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ حیض کے دوران تہبند یا پاجامے کے نیچے والا حصہ (ناف سے گھٹنوں تک) جماع کے لیے ممنوع ہے۔",
                "نبی ﷺ نے 'ما فوق الإزار' (تہبند سے اوپر) کے حصے کو جائز قرار دیا، جو سینہ، پیٹ کا اوپر کا حصہ، ہاتھ اور چہرہ شامل ہے۔",
                "یہ حکم اس بات کو یقینی بناتا ہے کہ زوجین ایک دوسرے سے لطف اندوز ہوں مگر حرام فعل سے بچیں۔"
              ],
              "english": [
                "This Hadith clarifies that the area below the Izar (navel to knees) is prohibited for sexual intercourse during menses.",
                "The Prophet ﷺ permitted 'Ma Fawqa al-Izar' (above the waist-wrapper), which includes the chest, upper abdomen, hands, and face.",
                "This ruling ensures that spouses enjoy each other's company while avoiding the forbidden act."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماع اور اتفاق",
              "english": "Consensus and Agreement"
            },
            "content": {
              "urdu": [
                "اگرچہ معاذ کی حدیث کی سند ضعیف ہے، اس کا حکم صحیح ہے اور سیدہ عائشہ کی حدیث سے اس کی تائید ہوتی ہے۔",
                "فقہاء کا اجماع ہے کہ جماع کے علاوہ تمام قسم کا میل جول اور لطف اندوزی حلال ہے۔",
                "تہبند یا پاجامہ باندھنے کا حکم نجاست اور غلطی سے بچنے کی ایک عملی تدبیر ہے۔"
              ],
              "english": [
                "Although the chain of Mu'adh's Hadith is weak, its ruling is sound and supported by Aishah's Hadith.",
                "There is a consensus among jurists that all forms of intimacy and enjoyment, except intercourse, are lawful.",
                "The command to wear the Izar is a practical measure to avoid impurity and accidental transgression."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی حکمت",
        "english": "Juristic and Educational Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت میں اعتدال",
              "english": "Moderation in Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلام کے اعتدال کو ظاہر کرتی ہے، جو یہودی اور عیسائی انتہا پسندی کے درمیان ہے۔",
                "اسلام نے زوجین کے تعلقات کو قائم رکھا تاکہ بیوی کو جسمانی یا جذباتی طور پر تنہا محسوس نہ ہو۔",
                "یہ اعتدال دین میں آسانی کا اصول ہے جو اللہ کو پسند ہے۔"
              ],
              "english": [
                "This Hadith demonstrates the moderation of Islam, positioned between Jewish and Christian extremes.",
                "Islam maintained the relationship between spouses so that the wife does not feel physically or emotionally isolated.",
                "This moderation is the principle of ease in religion that is beloved by Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط کا درجہ",
              "english": "Degree of Precaution"
            },
            "content": {
              "urdu": [
                "بعض علماء نے 'والتعفف عن ذلك أفضل' (مکمل پرہیز افضل ہے) کے قول کو منکر قرار دیا، کیونکہ یہ نبی ﷺ کے عمل کے خلاف ہے۔",
                "نبی ﷺ کا خود تہبند باندھ کر مباشرت کرنا سنت ہے، اور اس میں کوئی کراہت نہیں۔",
                "اصل مسئلہ جماع سے بچنا ہے، نہ کہ دیگر جائز تعلقات سے مکمل کنارہ کشی اختیار کرنا۔"
              ],
              "english": [
                "Some scholars rejected the phrase 'abstaining from that is better' because it contradicts the Prophet's own practice.",
                "The Prophet's act of fondling with an Izar on is Sunnah, and there is nothing disliked about it.",
                "The primary issue is avoiding intercourse, not completely isolating oneself from other permissible acts of closeness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آداب اور رہنمائی",
        "english": "Etiquette and Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسان شرعی تعلیم",
              "english": "Easy Legal Education"
            },
            "content": {
              "urdu": [
                "معاذ رضی اللہ عنہ کا سوال زوجین کے لیے عملی زندگی کی واضح رہنمائی حاصل کرنے کی ترغیب ہے۔",
                "نبی ﷺ نے واضح حد بندی مقرر فرما کر عورتوں کے فطری تقاضوں کو پورا کرنے کا راستہ دیا۔",
                "زوجین کو چاہیے کہ وہ اس شرعی رخصت کا استعمال کریں۔"
              ],
              "english": [
                "Mu'adh's inquiry encourages spouses to seek clear practical guidance for their life together.",
                "The Prophet ﷺ established a clear boundary, allowing for the fulfillment of natural needs within limits.",
                "Spouses should utilize this legal concession."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیض کی حالت",
              "english": "State of Menses"
            },
            "content": {
              "urdu": [
                "حیض کی وجہ سے عورت نجس نہیں ہوتی، صرف شرمگاہ کا حصہ اس نجاست سے متاثر ہوتا ہے۔",
                "یہ حکم طہارت اور نجاست کے مابین فرق کو بھی واضح کرتا ہے۔",
                "یہ مسئلہ ازدواجی زندگی میں صبر، محبت اور شرعی تعلیمات پر عمل کی اہمیت سکھاتا ہے۔"
              ],
              "english": [
                "The woman is not rendered impure by menses; only the genital area is affected by the impurity.",
                "This ruling also clarifies the distinction between ritual purity and impurity.",
                "This issue teaches the importance of patience, affection, and adherence to Sharia in married life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اطاعت اور امتثال",
        "english": "Obedience and Compliance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکم پر یقین",
              "english": "Belief in the Command"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے حکم کو شک و شبہ کے بغیر تسلیم کرنا ہر مسلمان پر واجب ہے۔",
                "سیدہ عائشہ کا عمل (حدیث 123) اس حکم کے نفاذ کی بہترین عملی دلیل ہے۔",
                "حیض کے ایام میں جماع سے پرہیز تقویٰ اور اللہ کی حدود کی پاسداری ہے۔"
              ],
              "english": [
                "Accepting the Prophet's command without doubt or skepticism is obligatory for every Muslim.",
                "Aishah's action (Hadith 123) is the best practical proof of the implementation of this ruling.",
                "Abstaining from intercourse during menses is an act of piety and adherence to Allah's boundaries."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت کا درجہ",
              "english": "Status of Worship"
            },
            "content": {
              "urdu": [
                "اللہ کے ممنوع کردہ افعال سے اجتناب بھی دراصل ایک بڑی عبادت ہے۔",
                "حیض کے احکام پر عمل کرنے میں عورت کی اطاعت شامل ہے، جو اجر کا باعث ہے۔",
                "اس طرح کی رخصتیں شریعت کی آسانی اور بندوں کے لیے اللہ کی رحمت کو ظاہر کرتی ہیں۔"
              ],
              "english": [
                "Abstaining from actions forbidden by Allah is also considered a great act of worship.",
                "Compliance with the rulings of menses involves the obedience of the woman, which earns reward.",
                "Such concessions demonstrate the ease of Sharia and Allah's mercy toward His servants."
              ]
            }
          }
        ]
      }
    }
  ]
}
