{
  "hadithId": 778,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/778"],
    "kitabId": 7,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 57
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2370). والحمى هو مكان يحمى من الناس لترعى فيه نعم الصدقة وخيل الجهاد.",
    "urdu": "صحیح۔ اسے امام بخاری (2370) نے روایت کیا ہے۔ 'حمیٰ' اس جگہ کو کہتے ہیں جسے عوام کے بجائے خاص طور پر صدقہ کے جانوروں اور جہاد کے گھوڑوں کے لیے محفوظ کر لیا جائے۔",
    "english": "Sahih. Reported by Al-Bukhari (2370). 'Hima' refers to a private pasture or protected land reserved for state purposes such as Zakat animals or horses for Jihad."
  },
  "importantWords": [
    {
      "arabic": "حِمَى",
      "english": "Private Pasture / Sanctuary",
      "urdu": "محفوظ چراگاہ"
    },
    {
      "arabic": "إِلَّا",
      "english": "Except",
      "urdu": "سوائے"
    },
    {
      "arabic": "رَسُولِهِ",
      "english": "His Messenger",
      "urdu": "اس کے رسول"
    },
    {
      "arabic": "الْمَرَافِقُ",
      "english": "Public Utilities",
      "urdu": "عوامی سہولیات"
    },
    {
      "arabic": "الصَّعْبَ",
      "english": "As-Sa'b (Narrator)",
      "urdu": "صعب (راوی)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مقصد طاقتور لوگوں کو عوامی چراگاہوں اور زمینوں پر ذاتی قبضہ کرنے سے روکنا ہے۔ صرف اسلامی ریاست ہی عوامی مفاد (جیسے زکوٰۃ کے جانور) کے لیے زمین مخصوص کر سکتی ہے۔",
    "english": "This Hadith aims to prevent powerful individuals from monopolizing public pastures. Only the Islamic State can reserve land for public welfare (such as Zakat livestock)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2370)",
      "english": "Reported by Al-Bukhari (2370)"
    },
    {
      "arabic": "سنن أبي داود (3083)",
      "english": "Sunan Abi Dawud (3083)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "ابن عباس",
        "english": "Ibn Abbas"
      },
      "slug": "ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "الصعب بن جثامة",
        "english": "As-Sa'b bin Jaththama"
      },
      "slug": "as-sab-bin-jaththama"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حمیٰ (محفوظ چراگاہ) کا مفہوم",
        "english": "Understanding the Concept of Hima"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جاہلانہ دور کا طریقہ کار",
              "english": "Pre-Islamic Practices"
            },
            "content": {
              "urdu": [
                "زمانہ جاہلیت میں قبائل کے سردار زبردستی زمینوں کو گھیر لیتے تھے۔",
                "وہاں کسی عام شخص کو اپنے جانور چرانے کی اجازت نہیں ہوتی تھی۔",
                "نبی ﷺ نے اس انفرادی قبضے اور عوامی وسائل کے استحصال کو ختم فرمایا۔"
              ],
              "english": [
                "In the pre-Islamic era, tribal chiefs would forcibly occupy fertile lands.",
                "Common people were prohibited from grazing their livestock in those areas.",
                "The Prophet (ﷺ) abolished this individual monopoly and exploitation of public resources."
              ]
            }
          },
          {
            "title": {
              "urdu": "اسلامی ریاست کا اختیار",
              "english": "Authority of the Islamic State"
            },
            "content": {
              "urdu": [
                "صرف اللہ اور اس کے رسول (یعنی ریاست) کو زمین مخصوص کرنے کا حق ہے۔",
                "یہ زمین کسی ذاتی فائدے کے لیے نہیں بلکہ عوامی مفاد کے لیے ہوتی ہے۔",
                "مثلاً بیت المال کے جانوروں، جہاد کے گھوڑوں اور نادار لوگوں کے مویشیوں کے لیے۔"
              ],
              "english": [
                "Only Allah and His Messenger (the state) have the right to reserve land.",
                "This land is not for personal profit but for the welfare of the public.",
                "Examples include pastures for Zakat livestock, horses for Jihad, and cattle of the poor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عوامی وسائل اور مساوات",
        "english": "Public Resources and Equality"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تین چیزوں میں شراکت",
              "english": "Partnership in Three Things"
            },
            "content": {
              "urdu": [
                "اسلامی قانون کے مطابق پانی، آگ اور چراگاہ تمام انسانوں کی مشترکہ ملکیت ہیں۔",
                "ان قدرتی وسائل پر کسی ایک شخص کی اجارہ داری قائم نہیں ہو سکتی۔",
                "ریاست کا فرض ہے کہ وہ طاقتور کو کمزور کا حق مارنے سے روکے۔"
              ],
              "english": [
                "According to Islamic law, water, fire, and pastures are common property of all humans.",
                "Monopoly over these natural resources by a single person is not permitted.",
                "It is the state's duty to prevent the powerful from usurping the rights of the weak."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدنا عمر رضی اللہ عنہ کا عمل",
              "english": "Practice of Umar (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا عمر نے 'ربذہ' کے مقام پر سرکاری چراگاہ بنائی تھی۔",
                "انہوں نے اپنے نگران کو حکم دیا کہ غریبوں کے جانوروں کو جگہ دیں مگر امیروں کو نہیں۔",
                "ان کا مقصد وسائل کی منصفانہ تقسیم اور عوامی فلاح و بہبود تھا۔"
              ],
              "english": [
                "Umar (RA) established a state-protected pasture at a place called 'Rabdha'.",
                "He instructed the supervisor to allow the cattle of the poor but not of the wealthy.",
                "His objective was the fair distribution of resources and public welfare."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات",
        "english": "Juristic Details"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرائطِ حمیٰ",
              "english": "Conditions for Hima"
            },
            "content": {
              "urdu": [
                "ریاست جو جگہ مخصوص کرے وہ لوگوں کے لیے ضرورت سے زائد ہونی چاہیے۔",
                "اس سے مقامی آبادی کو تنگی یا نقصان نہیں پہنچنا چاہیے۔",
                "اگر زمین مخصوص کرنے سے لوگوں کو نقصان ہو تو حاکمِ وقت اسے ختم کرنے کا پابند ہے۔"
              ],
              "english": [
                "The land reserved by the state must be surplus to the people's immediate needs.",
                "It must not cause hardship or harm to the local population.",
                "If reserving land causes harm, the ruler is obligated to nullify the protection."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناجائز قبضے کی ممانعت",
              "english": "Prohibition of Illegal Occupation"
            },
            "content": {
              "urdu": [
                "کسی طاقتور فرد کا عوامی زمین پر 'باڑ' لگانا غصب اور ظلم ہے۔",
                "ایسی چراگاہ سے دوسرے لوگوں کو روکنا گناہِ کبیرہ ہے۔",
                "حکومت کو حق حاصل ہے کہ وہ ایسے ناجائز قبضے ختم کروا کر زمین عوام کے لیے کھول دے۔"
              ],
              "english": [
                "A powerful individual fencing off public land is considered usurpation and oppression.",
                "Preventing others from using such pastures is a major sin.",
                "The government has the right to terminate such illegal occupations and open the land for the public."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور معاشی اثرات",
        "english": "Social and Economic Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غربت کا خاتمہ",
              "english": "Eradication of Poverty"
            },
            "content": {
              "urdu": [
                "عوامی چراگاہوں کی بدولت چھوٹے زمینداروں اور چرواہوں کو معاشی سہارا ملتا ہے۔",
                "وسائل کی عوامی دستیابی طبقاتی فرق کو کم کرنے میں مدد دیتی ہے۔",
                "یہ نظام معاشرے کے محروم طبقوں کو ترقی کے مواقع فراہم کرتا ہے۔"
              ],
              "english": [
                "Public pastures provide economic support to small landowners and shepherds.",
                "Universal access to resources helps reduce class disparity.",
                "This system provides opportunities for development to the deprived sectors of society."
              ]
            }
          },
          {
            "title": {
              "urdu": "ماحولیاتی توازن",
              "english": "Environmental Balance"
            },
            "content": {
              "urdu": [
                "ریاست کی نگرانی میں چراگاہوں کا انتظام زمین کی زرخیزی برقرار رکھتا ہے۔",
                "یہ نظام بے جا چرواہی اور زمین کے کٹاؤ کو روکنے میں مدد دیتا ہے۔",
                "اسلامی تعلیمات فطرت اور وسائل کے پائیدار استعمال پر زور دیتی ہیں۔"
              ],
              "english": [
                "Management of pastures under state supervision maintains soil fertility.",
                "This system helps prevent overgrazing and soil erosion.",
                "Islamic teachings emphasize the sustainable use of nature and resources."
              ]
            }
          }
        ]
      }
    }
  ]
}