{
  "hadithId": 504,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["bulugh/4/22"],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (3061) ، والبيهقي (4/148). والحديث أخرجه أبو داود في كتاب الخراج والإمارة والفيء، وليس في كتاب الزكاة، وهو مرسل وضعيف الإسناد، لكن العمل عليه عند كثير من أهل العلم.",
    "urdu": "ضعیف۔ اسے ابوداؤد (3061) اور بیہقی (4/148) نے روایت کیا ہے۔ اس کی سند میں انقطاع ہے اور یہ مرسل ہونے کی وجہ سے ضعیف ہے، تاہم معدنیات پر زکوٰۃ کا تصور دیگر دلائل سے ثابت ہے۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (3061) and Al-Bayhaqi (4/148). It is narrated as a Mursal (disconnected) Hadith. However, the concept of Zakat on minerals is practiced by many scholars based on general principles."
  },
  "importantWords": [
    {
      "arabic": "اَلْمَعَادِنِ",
      "english": "Mines / Minerals",
      "urdu": "معدنیات / کانیں"
    },
    {
      "arabic": "اَلْقَبَلِيَّةِ",
      "english": "Al-Qabaliyah (Place name)",
      "urdu": "القبلیہ (ایک مقام کا نام)"
    },
    {
      "arabic": "اَلصَّدَقَةَ",
      "english": "Zakat / Alms",
      "urdu": "زکوٰۃ / صدقہ واجبہ"
    },
    {
      "arabic": "أَخَذَ",
      "english": "He took / Collected",
      "urdu": "وصول کی / لی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ زمین سے نکلنے والی معدنیات پر بھی زکوٰۃ واجب ہے، جسے اسلامی ریاست وصول کرنے کا حق رکھتی ہے۔",
    "english": "This Hadith indicates that minerals extracted from the earth are subject to Zakat, which the Islamic state is authorized to collect."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الخراج والإمارة والفيء، رقم 3061",
      "english": "Sunan Abi Dawud, Book of Tribute, Rulership and Spoils, Hadith 3061"
    },
    {
      "arabic": "السنن الكبرى للبيهقي، رقم 7590",
      "english": "As-Sunan al-Kubra by al-Bayhaqi, Hadith 7590"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "بلال بن الحارث",
        "english": "Bilal bin al-Harith"
      },
      "slug": "bilal-bin-al-harith"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=SREkR5YtOsk",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "معدنیات پر زکوٰۃ کا شرعی حکم",
        "english": "Juristic Ruling on Zakat from Minerals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فرضیت اور مقدار",
              "english": "Obligation and Amount"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک زمین سے نکلنے والی معدنیات (جیسے سونا، چاندی، پٹرول) پر زکوٰۃ واجب ہے۔",
                "امام شافعی کے نزدیک اس کی مقدار ڈھائی فیصد (2.5%) ہے، جبکہ احناف کے نزدیک یہ 'خمس' (20%) کے حکم میں ہے۔",
                "نبی کریم ﷺ کا بلال بن حارث سے زکوٰۃ وصول کرنا اس کی شرعی حیثیت پر دلالت کرتا ہے۔"
              ],
              "english": [
                "The majority of jurists agree that minerals extracted from the earth (e.g., gold, silver, oil) are subject to Zakat.",
                "Imam Shafi'i rules the amount as 2.5%, while Hanafis treat it as 'Khums' (20%).",
                "The Prophet's (ﷺ) collection of Zakat from Bilal bin al-Harith points toward its religious legitimacy."
              ]
            }
          },
          {
            "title": {
              "urdu": "نصاب کی شرط",
              "english": "Condition of Nisab"
            },
            "content": {
              "urdu": [
                "معدنیات پر زکوٰۃ تب واجب ہوتی ہے جب وہ نصاب (ساڑھے باون تولہ چاندی یا ساڑھے سات تولہ سونا) کی مالیت کو پہنچ جائے۔",
                "عام زکوٰۃ کے برعکس، معدنیات کے لیے ایک سال تک قبضے میں رہنے کی شرط ضروری نہیں ہے۔",
                "جونہی معدن سے مال نکلے، اس کا حق نکالنا واجب ہو جاتا ہے۔"
              ],
              "english": [
                "Zakat on minerals is due when the value reaches the Nisab (threshold for gold or silver).",
                "Unlike standard Zakat, the condition of holding the asset for one full lunar year (Hawl) does not apply here.",
                "As soon as the minerals are extracted, the due amount must be paid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ریاستی ذمہ داری اور عوامی فلاح",
        "english": "State Responsibility and Public Welfare"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکومت کی وصولی",
              "english": "Collection by the State"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ کا زکوٰۃ وصول کرنا ظاہر کرتا ہے کہ معدنیات کے ذخائر حکومت کی نگرانی میں ہونے چاہئیں۔",
                "ان وسائل سے حاصل ہونے والی آمدنی غریبوں اور معاشرتی ضروریات پر خرچ کی جانی چاہیے۔",
                "یہ نظام دولت کی منصفانہ تقسیم اور معاشی استحکام کو یقینی بناتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of collecting shows that mineral resources should be under state supervision.",
                "The income generated from these resources should be spent on the poor and social needs.",
                "This system ensures fair distribution of wealth and economic stability."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی مفاد",
              "english": "Collective Interest"
            },
            "content": {
              "urdu": [
                "اسلامی ریاست معدنیات کی آمدنی کو عوامی سہولیات، جیسے تعلیم اور صحت کے لیے استعمال کر سکتی ہے۔",
                "یہ انفرادی دولت کے بجائے قوم کے اجتماعی مفاد کو ترجیح دینے کا درس دیتا ہے۔",
                "معدنی وسائل کا فائدہ پوری کمیونٹی تک پہنچنا اسلامی معیشت کا خاصہ ہے۔"
              ],
              "english": [
                "The Islamic state can use mineral revenue for public facilities such as education and health.",
                "It teaches prioritizing the collective interest of the nation over individual wealth.",
                "Ensuring the benefit of mineral resources reaches the entire community is a hallmark of Islamic economics."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقلی اور معاشی حکمت",
        "english": "Rational and Economic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی عطا",
              "english": "Gift from Allah"
            },
            "content": {
              "urdu": [
                "معدنیات وہ خزانے ہیں جو بغیر انسانی محنت کے زمین میں پیدا کیے گئے ہیں، اس لیے اس میں اللہ کا حق زیادہ ہے۔",
                "شکر گزاری کا تقاضا ہے کہ اللہ کی دی ہوئی اس نعمت سے معاشرے کے پسماندہ طبقے کو نوازا جائے۔",
                "زکوٰۃ کی ادائیگی مال کو پاک کرتی ہے اور اس میں برکت کا باعث بنتی ہے۔"
              ],
              "english": [
                "Minerals are treasures created in the earth without human labor; thus, Allah's right in them is significant.",
                "Gratitude demands that the underprivileged sections of society benefit from this blessing provided by Allah.",
                "Paying Zakat purifies the wealth and leads to an increase in blessings."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذخیرہ اندوزی کا خاتمہ",
              "english": "Eliminating Hoarding"
            },
            "content": {
              "urdu": [
                "معدنیات پر زکوٰۃ عائد کرنے سے وسائل کے انجماد اور ذخیرہ اندوزی کی حوصلہ شکنی ہوتی ہے۔",
                "یہ نظام سرمایہ کاروں کو مجبور کرتا ہے کہ وہ دولت کو گردش میں رکھیں تاکہ معیشت فعال رہے۔",
                "اسلامی معاشی نظام کا ہدف ہی یہ ہے کہ دولت چند ہاتھوں میں سمٹ کر نہ رہ جائے۔"
              ],
              "english": [
                "Imposing Zakat on minerals discourages the freezing of resources and hoarding.",
                "This system compels investors to keep wealth in circulation to maintain a functional economy.",
                "The goal of the Islamic economic system is to prevent wealth from circulating only among the rich."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانت داری",
              "english": "Honesty and Integrity"
            },
            "content": {
              "urdu": [
                "کاروباری حضرات کو چاہیے کہ وہ اپنی آمدنی کے تمام ذرائع پر شرعی احکامات کو مدنظر رکھیں۔",
                "معدنیات یا قدرتی وسائل سے منسلک افراد کو زکوٰۃ کی ادائیگی میں تساہل نہیں کرنا چاہیے۔",
                "حقوق اللہ اور حقوق العباد کی ادائیگی ہی اخروی نجات کی ضامن ہے۔"
              ],
              "english": [
                "Businessmen should consider Sharia rulings regarding all sources of their income.",
                "Individuals involved with minerals or natural resources should not be negligent in paying Zakat.",
                "Fulfilling the rights of Allah and the rights of people is the guarantee for salvation in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعاون اور ہمدردی",
              "english": "Cooperation and Sympathy"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں معاشرے کے ضرورت مند افراد کے ساتھ تعاون کا درس دیتی ہے۔",
                "مساوات اور بھائی چارے کا قیام ہی ایک مثالی اسلامی معاشرے کی بنیاد ہے۔",
                "ہمیں اللہ کی دی ہوئی نعمتوں کو بانٹنے کی عادت اپنانی چاہیے۔"
              ],
              "english": [
                "This Hadith teaches us to cooperate with the needy members of society.",
                "Establishing equality and brotherhood is the foundation of an ideal Islamic society.",
                "We should adopt the habit of sharing the blessings bestowed upon us by Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}