{
  "hadithId": 118,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["1:118"],
    "kitabId": 1,
    "inKitabBab": 10,
    "arabicBook": "كتاب الطهارة",
    "babId": 10
  },

  "takhreej": {
    "arabic": " حسن.  رواه أبو داود (286) ، والنسائي (185) ، وابن حبان (1348) ، والحاكم (174)  وزادوا خلا ابن حبان: \"فإنما هو عرق\".   صحيح.  رواه أبو داود (296) ، عن أسماء بنت عميس، قالت: قلت: يا رسول الله.  إن فاطمة بنت أبي حبيش استحيضت منذ كذا وكذا، فلم تصل، فقال رسول الله صلى الله عليه وسلم: \"سبحان الله! هذا من الشيطان، لتجلس. . . \" الحديث. ",
    "urdu": "حسن (اچھا) روایت۔ اسے ابو داؤد (286)، نسائی (185)، ابن حبان (1348)، اور حاکم (174) نے روایت کیا ہے۔ اور ان سب نے، سوائے ابن حبان کے، یہ اضافہ کیا ہے: \"فإنما هو عرق\" (یہ تو ایک رگ کا خون ہے)۔ صحیح روایت۔ اسے ابو داؤد (296) نے اسماء بنت عمیس سے روایت کیا ہے، جنہوں نے فرمایا: میں نے عرض کیا: یا رسول اللہ! فاطمہ بنت ابی حُبیش کو اتنے عرصے سے استحاضہ ہو رہا ہے اور انہوں نے نماز نہیں پڑھی۔ تو رسول اللہ ﷺ نے فرمایا: \"سبحان اللہ! یہ تو شیطان کی طرف سے ہے، وہ بیٹھے (اور عمل کرے)۔۔۔\" مکمل حدیث۔",
    "english": "Hasan (Good) narration. Reported by Abu Dawud (286), An-Nasa'i (185), Ibn Hibban (1348), and Al-Hakim (174). All of them, except Ibn Hibban, added the phrase: 'It is only a vein (bleeding).' Sahih (Authentic) narration. Reported by Abu Dawud (296) from Asma bint Umays, who said: I said, 'O Messenger of Allah, Fatimah bint Abi Hubaysh has been bleeding Istihadah for so long and has not prayed.' The Messenger of Allah (PBUH) said: 'Subhan Allah! This is from Satan. She should sit (and act accordingly)...' The rest of the Hadith."
  },
  "importantWords": [
    {
      "arabic": "تُسْتَحَاضُ",
      "english": "Suffered from Istihadah",
      "urdu": "استحاضہ کی شکایت تھی"
    },
    {
      "arabic": "اَلْحَيْضِ",
      "english": "Menses/Menstruation",
      "urdu": "حیض"
    },
    {
      "arabic": "دَمٌ أَسْوَدُ",
      "english": "Dark blood",
      "urdu": "سیاہ خون"
    },
    {
      "arabic": "يُعْرَفُ",
      "english": "Is recognizable/known",
      "urdu": "پہچانا جاتا ہے"
    },
    {
      "arabic": "فَأَمْسِكِي",
      "english": "Stop/Refrain",
      "urdu": "رک جاؤ"
    },
    {
      "arabic": "فَتَوَضَّئِي",
      "english": "Perform Wudu",
      "urdu": "وضو کرو"
    },
    {
      "arabic": "مِرْكَنٍ",
      "english": "Tub/Basin",
      "urdu": "برتن/مرکن"
    },
    {
      "arabic": "صُفْرَةً",
      "english": "Yellowness/Yellow color",
      "urdu": "زردی/زرد رنگ"
    },
    {
      "arabic": "عِرْق",
      "english": "Vein",
      "urdu": "رگ"
    }
  ],
  "summary": {
    "urdu": "نبی اکرم ﷺ نے فاطمہ بنت ابی حُبیش کو حیض اور استحاضہ کے خون میں فرق کرنے کا طریقہ سکھایا: حیض کا خون سیاہ اور پہچانا جانے والا ہوتا ہے جس میں نماز منع ہے۔ استحاضہ (عام خون) کے دوران، ہر نماز کے لیے وضو کر کے نماز پڑھنی چاہیے، البتہ بعض روایات میں مخصوص نمازوں کے لیے غسل کا حکم بھی موجود ہے۔",
    "english": "The Prophet ﷺ taught Fatimah bint Abi Hubaysh how to differentiate between menstrual (Hayd) and non-menstrual (Istihadah) bleeding: menstrual blood is dark and recognizable, necessitating stopping prayer. During Istihadah, one should perform Wudu for each prayer and pray. Some narrations also suggest combining certain prayers with a single Ghusl."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (286)",
      "english": "Reported by Abu Dawud (286)"
    },
    {
      "arabic": "رواه النسائي (185)",
      "english": "Reported by An-Nasa'i (185)"
    },
    {
      "arabic": "صَحَّحَهُ اِبْنُ حِبَّانَ (1348)",
      "english": "Authenticated by Ibn Hibban (1348)"
    }
  ],
  "narrators": [
    {
      "id": 11801,
      "name": {
        "arabic": "عَائِشَةَ بِنْتِ أَبِي بَكْرٍ",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "حسن",
    "english": "Good (Hasan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حیض اور استحاضہ میں فرق",
        "english": "Distinction Between Hayd and Istihadah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون کی پہچان",
              "english": "Identifying the Blood"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے عورتوں کو خون کی نوعیت سے حیض اور استحاضہ میں فرق کرنے کی تعلیم دی۔",
                "حیض کا خون (دم اسود) گاڑھا، بدبودار اور سیاہ رنگ کا ہوتا ہے جو پہچانا جاتا ہے۔",
                "استحاضہ کا خون (آخری) عام خون ہوتا ہے جو ہلکا، سرخ اور رگ (عرق) سے نکلتا ہے۔"
              ],
              "english": [
                "The Prophet ﷺ taught women to distinguish between menses and non-menstrual bleeding based on the nature of the blood.",
                "Menstrual blood (dark blood) is thick, recognizable by its smell, and dark in color.",
                "Istihadah blood (the other) is ordinary blood, lighter, red, and flows from a vein ('Irq)."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی حکم کی بنیاد",
              "english": "Basis of the Legal Ruling"
            },
            "content": {
              "urdu": [
                "جب تک عورت کو حیض کا خون آئے، اس پر نماز اور روزہ چھوڑنا فرض ہے۔",
                "استحاضہ کی حالت میں، عورت نماز اور روزہ جاری رکھے گی، کیونکہ یہ ایک بیماری کی حیثیت رکھتا ہے۔",
                "یہ حکم ان عورتوں کے لیے ہے جن کی ماہواری کا کوئی مقررہ وقت نہ ہو۔"
              ],
              "english": [
                "As long as a woman sees menstrual blood, she is obligated to stop praying and fasting.",
                "In the state of Istihadah, the woman continues to pray and fast, as it is considered a form of illness.",
                "This ruling is specifically for women who do not have a fixed pattern for their menstrual cycle."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مستحاضہ کے لیے طہارت کا حکم",
        "english": "Purity Rules for the Mustahadah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضو کا طریقہ",
              "english": "Method of Wudu"
            },
            "content": {
              "urdu": [
                "استحاضہ والی عورت کو ہر نماز کے وقت (یا اس کے قریب) نیا وضو کرنا چاہیے۔",
                "یہ وضو صرف اس وقت تک صحیح رہتا ہے جب تک نماز کا وقت موجود ہو۔",
                "مسئلہ عذر کی وجہ سے ہے، اس لیے ہر نماز کے لیے طہارت کو نئے سرے سے کرنا ضروری ہے۔"
              ],
              "english": [
                "A woman suffering from Istihadah must perform a new Wudu at (or near) the time of every prayer.",
                "This Wudu remains valid only as long as the time for that specific prayer is present.",
                "Since the issue is due to a continuous excuse, renewal of purity for each prayer is necessary."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل کا حکم",
              "english": "Ruling on Ghusl"
            },
            "content": {
              "urdu": [
                "اسماء بنت عمیس کی حدیث میں مخصوص نمازوں کے لیے غسل کو جمع کرنے کا حکم دیا گیا ہے۔",
                "یہ حکم استحاضہ کے آغاز پر یا زیادہ خون آنے کی صورت میں احتیاط کے لیے ہو سکتا ہے۔",
                "بعد کی روایات کے مطابق، استحاضہ والی عورت کے لیے ہر نماز کے لیے وضو کرنا ہی غالب حکم ہے۔"
              ],
              "english": [
                "The Hadith of Asma bint Umays commands combining Ghusl for specific pairs of prayers.",
                "This ruling may be for the beginning of Istihadah or for caution when bleeding is heavy.",
                "According to later narrations, performing Wudu for every prayer is the predominant ruling for a woman with Istihadah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور ترجیح",
        "english": "Juristic Differences and Preference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فاطمہ کی حدیث کی ترجیح",
              "english": "Preference for Fatimah's Hadith"
            },
            "content": {
              "urdu": [
                "فاطمہ بنت ابی حُبیش کی حدیث (خون کی پہچان) کو اکثر فقہاء نے ترجیح دی ہے۔",
                "یہ حدیث واضح حکم دیتی ہے کہ فطرت کو دیکھ کر حیض اور استحاضہ کا فرق کیا جائے۔",
                "یہ طریقہ ان عورتوں کے لیے سب سے زیادہ مفید ہے جن کی عادت (عادت) مقرر نہ ہو۔"
              ],
              "english": [
                "The Hadith of Fatimah bint Abi Hubaysh (blood distinction) is preferred by most jurists.",
                "This Hadith provides a clear ruling to differentiate Hayd and Istihadah based on the nature of the discharge.",
                "This method is most helpful for women whose menstrual pattern is not fixed."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسئلہ میں وسعت",
              "english": "Breadth in the Issue"
            },
            "content": {
              "urdu": [
                "استحاضہ کے بارے میں نبی ﷺ نے متعدد احکام دیئے، جو حالات کی نوعیت پر مبنی تھے۔",
                "فقہاء نے مختلف روایات کو جمع کر کے مختلف عورتوں (عادت والی، ممتازہ، محیرہ) کے لیے اصول وضع کیے۔",
                "شریعت میں آسانی کی وجہ سے، مستحاضہ کو عام پاک عورتوں کی طرح نماز اور دیگر عبادات کی اجازت ہے۔"
              ],
              "english": [
                "The Prophet ﷺ gave multiple rulings regarding Istihadah, depending on the nature of the cases.",
                "Jurists combined different narrations to establish rules for different types of women (those with fixed habits, discerning, or confused).",
                "Due to the ease of Sharia, the woman with Istihadah is allowed to perform prayers and other acts of worship like pure women."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اور تربیتی نتائج",
        "english": "Practical and Educational Outcomes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسلسل عبادت کی اہمیت",
              "english": "Importance of Continuous Worship"
            },
            "content": {
              "urdu": [
                "استحاضہ کا خون بہنے کے باوجود عبادت سے رکنا نہیں چاہیے، کیونکہ یہ حیض نہیں۔",
                "نبی ﷺ کا مقصد یہ تھا کہ بیماری کو عبادت میں رکاوٹ نہ بنایا جائے۔",
                "صبر، علم اور عمل کے ساتھ اس مشکل حالت میں بھی اللہ کی رضا حاصل کی جا سکتی ہے۔"
              ],
              "english": [
                "Worship should not be stopped due to Istihadah bleeding, as it is not menses.",
                "The Prophet's intention was that sickness should not be made an obstacle to worship.",
                "With patience, knowledge, and action, Allah's pleasure can be attained even in this difficult situation."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی اور شرعی مشورہ",
              "english": "Medical and Legal Advice"
            },
            "content": {
              "urdu": [
                "ایسے حالات میں عورت کو طبی علاج کے ساتھ ساتھ شرعی احکام پر بھی عمل کرنا چاہیے۔",
                "خون کی نوعیت کا تعین خود کرنا ممکن نہ ہو تو عادت یا طبی مشورے کی پیروی کی جاتی ہے۔",
                "یہ مسئلہ شریعت کی باریکیوں اور عورتوں کے احکام میں تفصیل کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "In such circumstances, a woman should pursue medical treatment along with adhering to legal rulings.",
                "If determining the blood type is difficult, she should follow her habit or medical advice.",
                "This issue demonstrates the subtle details of Sharia and the comprehensive rulings concerning women."
              ]
            }
          }
        ]
      }
    }
  ]
}
