{
  "hadithId": 369,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:857b"],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "صحيح مسلم - كتاب الجمعة",
    "babId": 22
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (857)‏ (27)‏.",
    "urdu": "صحیح مسلم (857)، یہ حدیث بالکل صحیح اور مستند ہے۔",
    "english": "Sahih. Reported by Muslim (857) (27)."
  },
  "importantWords": [
    {
      "arabic": "اغْتَسَلَ",
      "english": "Took a bath",
      "urdu": "غسل کیا"
    },
    {
      "arabic": "أَنْصَتَ",
      "english": "Remained silent / Listened attentively",
      "urdu": "خاموش رہا / توجہ سے سنا"
    },
    {
      "arabic": "مَا قُدِّرَ لَهُ",
      "english": "What was decreed for him",
      "urdu": "جو اس کے مقدر میں تھا (نفل نماز)"
    },
    {
      "arabic": "يَفْرُغَ",
      "english": "Finishes / Completes",
      "urdu": "فارغ ہو جائے"
    },
    {
      "arabic": "غُفِرَ لَهُ",
      "english": "Forgiven for him",
      "urdu": "اس کے لیے معاف کر دیے گئے"
    }
  ],
  "summary": {
    "urdu": "جمعہ کے دن غسل کرنا، مسجد آکر نفل پڑھنا، خاموشی سے خطبہ سننا اور باجماعت نماز ادا کرنا دس دن کے گناہوں کا کفارہ بن جاتا ہے۔",
    "english": "Performing Ghusl for Jumu'ah, praying voluntary prayers, listening silently to the sermon, and praying with the Imam results in forgiveness of sins for ten days."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (857)",
      "english": "Sahih Muslim (857)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Sj8mE_S56tU",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کی تیاری اور غسل",
        "english": "Preparation and Ghusl for Jumu'ah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غسلِ جمعہ کی اہمیت",
              "english": "Importance of Jumu'ah Ghusl"
            },
            "content": {
              "urdu": [
                "جمعہ کے دن غسل کرنا سنتِ مؤکدہ اور طہارت کا بہترین ذریعہ ہے۔",
                "یہ غسل انسان کو جسمانی پاکیزگی اور روحانی تازگی عطا کرتا ہے۔",
                "مسجد میں اجتماع کی وجہ سے صفائی کا خاص اہتمام کرنا ضروری ہے۔"
              ],
              "english": [
                "Taking a bath on Friday is a stressed Sunnah and a great means of purity.",
                "This Ghusl provides physical cleanliness and spiritual refreshment to a person.",
                "Due to the large gathering in the mosque, special care for hygiene is necessary."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد میں نفل نماز",
              "english": "Voluntary Prayer in the Mosque"
            },
            "content": {
              "urdu": [
                "امام کے آنے سے پہلے جتنے نفل ہو سکیں پڑھنا مستحب عمل ہے۔",
                "اسے 'تحیۃ المسجد' اور عام نفل کے طور پر ادا کیا جاتا ہے۔",
                "یہ وقت دعا اور اللہ کے ذکر میں گزارنا بہت فضیلت رکھتا ہے۔"
              ],
              "english": [
                "It is recommended to pray as many voluntary prayers as possible before the Imam arrives.",
                "This is performed as Tahiyat al-Masjid or general voluntary (Nafil) prayers.",
                "Spending this time in supplication and remembrance of Allah holds great virtue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خطبہ سننے کے آداب",
        "english": "Etiquettes of Listening to the Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاموشی اور توجہ",
              "english": "Silence and Attentiveness"
            },
            "content": {
              "urdu": [
                "خطبہ کے دوران گفتگو کرنا یا کسی کو چپ کرانا بھی منع ہے۔",
                "مکمل خاموشی کے ساتھ امام کی نصیحت کو سننا واجب کے قریب ہے۔",
                "توجہ سے خطبہ سننا ہی جمعہ کی روح اور اصل مقصد ہے۔"
              ],
              "english": [
                "Speaking during the sermon or even telling someone to be quiet is prohibited.",
                "Listening to the Imam's advice with complete silence is near obligatory.",
                "Listening attentively is the soul and primary purpose of Jumu'ah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطبہ ضائع کرنے کا وبال",
              "english": "The Consequence of Neglecting the Sermon"
            },
            "content": {
              "urdu": [
                "جو شخص خطبہ کے دوران لہو و لعب میں مصروف رہے، اس کا جمعہ ضائع ہو جاتا ہے۔",
                "موبائل فون یا دیگر اشیاء کا استعمال خطبہ کی برکات سے محروم کر دیتا ہے۔",
                "خطبہ کے آداب کا خیال نہ رکھنے والا بڑے اجر سے محروم رہتا ہے۔"
              ],
              "english": [
                "Whoever engages in idle play during the sermon, his Jumu'ah is nullified in reward.",
                "Using mobile phones or other objects deprives one of the blessings of the sermon.",
                "Those who disregard the etiquettes of the Khutbah lose out on a massive reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گناہوں کی معافی کا ضابطہ",
        "english": "The Principle of Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دس دن کے گناہوں کا کفارہ",
              "english": "Atonement for Ten Days of Sins"
            },
            "content": {
              "urdu": [
                "سات دن ہفتے کے اور تین دن زائد، کل دس دن کے گناہ معاف ہوتے ہیں۔",
                "اس سے مراد صغیرہ گناہ ہیں جو انسان سے نادانستہ سرزد ہوتے ہیں۔",
                "کبیرہ گناہوں کے لیے سچی توبہ اور حقوق العباد کی ادائیگی شرط ہے۔"
              ],
              "english": [
                "The seven days of the week plus three extra make ten days of forgiveness.",
                "This refers to minor sins that a person commits inadvertently.",
                "For major sins, sincere repentance and fulfilling the rights of people are required."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی رحمت کی وسعت",
              "english": "The Vastness of Allah's Mercy"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ معمولی نیک اعمال پر بہت بڑی بخشش عطا فرماتا ہے۔",
                "جمعہ کا دن مومن کے لیے ہفتہ وار عید اور مغفرت کا دن ہے۔",
                "یہ حدیث مسلمانوں کو نیکیوں کی طرف راغب کرنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Allah grants immense forgiveness for seemingly small righteous deeds.",
                "Friday is a weekly Eid and a day of forgiveness for the believer.",
                "This Hadith serves as a great motivation for Muslims toward good deeds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Lessons for Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی پابندی",
              "english": "Punctuality"
            },
            "content": {
              "urdu": [
                "جمعہ کے لیے جلد نکلنا اور امام سے پہلے پہنچنا افضل ہے۔",
                "وقت کی قدر کرنا اور عبادات کو ان کے وقت پر ادا کرنا ضروری ہے۔",
                "آخری لمحات میں پہنچنے والے بہت سے فضائل سے محروم رہ جاتے ہیں۔"
              ],
              "english": [
                "Leaving early for Jumu'ah and arriving before the Imam is superior.",
                "Valuing time and performing acts of worship on schedule is vital.",
                "Those who arrive at the last moment miss out on many virtues."
              ]
            }
          },
          {
            "title": {
              "urdu": "جماعتی نظم و ضبط",
              "english": "Congregational Discipline"
            },
            "content": {
              "urdu": [
                "امام کے ساتھ نماز ادا کرنا اجتماعی نظم و ضبط کی علامت ہے۔",
                "مسجد میں خاموشی برقرار رکھنا دوسروں کے احترام کی دلیل ہے۔",
                "یہ عمل معاشرے میں سکون اور باہمی احترام کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Praying with the Imam is a sign of communal discipline.",
                "Maintaining silence in the mosque demonstrates respect for others.",
                "This practice promotes peace and mutual respect within society."
              ]
            }
          }
        ]
      }
    }
  ]
}