{
  "hadithId": 783,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/783"],
    "kitabId": 7,
    "inKitabBab": 16,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 57
  },
  
  "takhreej": {
    "arabic": "ضعيف .‏ رواه أبو داود ( 3072 )‏ من طريق عبد الرحمن بن عيينة عن عمر بن الزبير عن عروة بن الزبير عن ابن عمر. وعبد الرحمن بن عيينة ضعفه أبو حاتم وغيره. والحديث أصله في البخاري (2332) لكن دون قصة الكرباج والسوط.",
    "urdu": "ضعیف۔ اسے ابوداؤد (3072) نے روایت کیا ہے۔ اس کی سند میں عبدالرحمن بن عیینہ ضعیف راوی ہے۔ اگرچہ زبیر رضی اللہ عنہ کو زمین دینے کی اصل بات صحیح بخاری (2332) میں موجود ہے، مگر کوڑا پھینکنے والی تفصیل صرف اسی ضعیف سند سے مروی ہے۔",
    "english": "Weak. Reported by Abu Dawud (3072). The chain contains Abdur Rahman bin Uyainah, who is weak. The core event of granting land to az-Zubair is in Bukhari (2332), but the specific detail of the whip is only in this weak narration."
  },
  "importantWords": [
    {
      "arabic": "أَقْطَعَ",
      "english": "Allotted / Granted land",
      "urdu": "جاگیر عطا فرمائی"
    },
    {
      "arabic": "حُضْرَ فَرَسِهِ",
      "english": "Run of his horse",
      "urdu": "گھوڑے کی دوڑ کی حد"
    },
    {
      "arabic": "فَأَجْرَى",
      "english": "So he made it run",
      "urdu": "پس اس نے دوڑایا"
    },
    {
      "arabic": "سَوْطَهُ",
      "english": "His whip",
      "urdu": "اپنا کوڑا"
    },
    {
      "arabic": "رَمَى",
      "english": "He threw",
      "urdu": "اس نے پھینکا"
    },
    {
      "arabic": "حَيْثُ بَلَغَ",
      "english": "Where it reached",
      "urdu": "جہاں تک پہنچا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ نبی ﷺ نے سیدنا زبیر کو ان کے گھوڑے کی دوڑ کی مسافت کے برابر زمین عطا فرمائی۔ یہ واقعہ اقطاع (سرکاری زمین کی الاٹمنٹ) کی ایک خاص اور تاریخی مثال ہے۔",
    "english": "This Hadith illustrates a historical instance of land allotment (Iqta') where the Prophet (ﷺ) granted land to az-Zubair based on the distance his horse could run."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (3072)",
      "english": "Reported by Abu Dawud (3072)"
    },
    {
      "arabic": "نيل الأوطار (5/334)",
      "english": "Nayl al-Awtar (5/334)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjI8_GfLpIs",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اقطاع کی وسعت اور حد بندی",
        "english": "Extent and Demarcation of Land Grants"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گھوڑے کی دوڑ بطور پیمانہ",
              "english": "Horse Run as a Measure"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے زمین کی پیمائش کے لیے ایک عملی طریقہ (گھوڑے کی دوڑ) اختیار فرمایا۔",
                "یہ اس وقت کی ضرورت اور عربوں کے عرف کے مطابق زمین کی حد بندی کا ایک سادہ طریقہ تھا۔",
                "اس سے ثابت ہوتا ہے کہ حاکمِ وقت اپنی صوابدید پر زمین کی مقدار طے کر سکتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) adopted a practical method (horse run) for land measurement.",
                "This was a simple way to demarcate land according to the needs and customs of the Arabs.",
                "It proves that the ruler can determine the amount of granted land at his discretion."
              ]
            }
          },
          {
            "title": {
              "urdu": "کوڑا پھینکنے کی حکمت",
              "english": "Wisdom of Throwing the Whip"
            },
            "content": {
              "urdu": [
                "زبیر رضی اللہ عنہ نے گھوڑے کے رکنے پر کوڑا پھینک کر آخری حد متعین کرنے کی کوشش کی۔",
                "نبی ﷺ نے ان کی اس کوشش کو قبول کر کے ان کے حق کو مزید وسعت عطا فرمائی۔",
                "یہ عمل صحابہ کی تالیفِ قلب اور ان کی خدمات کے اعتراف کا ایک انداز تھا۔"
              ],
              "english": [
                "Az-Zubair (RA) threw his whip after the horse stopped to mark the final boundary.",
                "The Prophet (ﷺ) accepted this gesture, extending the grant to that point.",
                "This action reflected the recognition of the Companions' services and winning their hearts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خدماتِ صحابہ اور سرکاری انعامات",
        "english": "Services of Companions and State Rewards"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدنا زبیر کی فضیلت",
              "english": "Excellence of az-Zubair"
            },
            "content": {
              "urdu": [
                "سیدنا زبیر بن عوام 'حواریِ رسول' تھے اور انہوں نے اسلام کے لیے بڑی قربانیاں دیں۔",
                "انہیں زمین کا اقطاع دراصل ان کی ان تھک محنت اور وفاداری کا سرکاری صلہ تھا۔",
                "اسلامی ریاست اپنے مخلص خادموں کی معاشی کفالت کا خاص خیال رکھتی ہے۔"
              ],
              "english": [
                "Az-Zubair bin al-Awwam was the 'Disciple of the Messenger' and made great sacrifices.",
                "The land grant was an official reward for his tireless efforts and loyalty.",
                "The Islamic state ensures the economic support of its sincere and dedicated servants."
              ]
            }
          },
          {
            "title": {
              "urdu": "مملکت کی بنجر زمینوں کا انتظام",
              "english": "Management of State Barren Lands"
            },
            "content": {
              "urdu": [
                "یہ زمینیں عام طور پر بنجر یا غیر آباد (موات) ہوتی تھیں جنہیں آباد کرنے کے لیے دیا جاتا تھا۔",
                "ایسی الاٹمنٹ سے ریاست کا بنجر رقبہ پیداواری بن جاتا اور معیشت کو فائدہ ہوتا۔",
                "نبی ﷺ کا مقصد زمین کو بیکار چھوڑنے کے بجائے اسے استعمال میں لانا تھا۔"
              ],
              "english": [
                "These lands were typically barren or unclaimed, granted to be developed.",
                "Such allotments made state land productive, thereby benefiting the economy.",
                "The Prophet's (ﷺ) goal was to utilize the land rather than leaving it idle."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور حدیث کی حیثیت",
        "english": "Juristic Aspects and Status of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کے ضعف کا اثر",
              "english": "Effect of the Chain's Weakness"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ خاص روایت ضعیف ہے، مگر اقطاع کا اصل تصور صحیح بخاری سے ثابت ہے۔",
                "فقہاء کے نزدیک اقطاع کے لیے پیمائش کا کوئی بھی منصفانہ طریقہ اپنایا جا سکتا ہے۔",
                "ضعف کے باوجود یہ واقعہ اقطاع کی تاریخ اور وسعت کو سمجھنے میں معاون ہے۔"
              ],
              "english": [
                "Although this specific narration is weak, the core concept of Iqta' is proven in Sahih Bukhari.",
                "Jurists hold that any fair method of measurement can be adopted for land grants.",
                "Despite the weakness, this event helps in understanding the history and scale of Iqta'."
              ]
            }
          },
          {
            "title": {
              "urdu": "اقطاع کی قانونی شرائط",
              "english": "Legal Conditions of Iqta'"
            },
            "content": {
              "urdu": [
                "اقطاع صرف اسی زمین کا ہو سکتا ہے جو پہلے سے کسی کی نجی ملکیت نہ ہو۔",
                "جسے زمین دی جائے اسے اسے آباد کرنا ہوتا ہے، ورنہ حکومت اسے واپس لے سکتی ہے۔",
                "اجارہ داری قائم کرنے کے لیے زمین گھیرنا شرعاً ممنوع اور جرم ہے۔"
              ],
              "english": [
                "Iqta' is only valid for land that is not already under private ownership.",
                "The recipient must cultivate it, otherwise, the government can reclaim the land.",
                "Hoarding land to establish a monopoly is religiously prohibited and a legal offense."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کوشش اور برکت",
              "english": "Effort and Blessing"
            },
            "content": {
              "urdu": [
                "سیدنا زبیر نے گھوڑا دوڑا کر اپنی محنت کا مظاہرہ کیا، جس پر انہیں صلہ ملا۔",
                "رزقِ حلال کے حصول کے لیے بھاگ دوڑ کرنا سنتِ صحابہ ہے۔",
                "انسان کو وہی ملتا ہے جس کے لیے وہ کوشش کرتا ہے۔"
              ],
              "english": [
                "Az-Zubair demonstrated effort by running his horse and was rewarded for it.",
                "Striving to attain Halal provision is a tradition of the Companions.",
                "Man receives that for which he puts in the effort."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق کی ادائیگی میں نرمی",
              "english": "Leniency in Granting Rights"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے کوڑے کی حد تک زمین دے کر فیاضی اور سخاوت کا مظاہرہ فرمایا۔",
                "حکام کو چاہیے کہ وہ اپنے ماتحتوں اور شہریوں کے جائز مطالبات میں نرمی برتیں۔",
                "خوش اخلاقی اور سخاوت معاشرے میں محبت اور استحکام پیدا کرتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) showed generosity by granting land up to the whip's reach.",
                "Authorities should be lenient and generous regarding the legitimate needs of citizens.",
                "Good character and generosity foster love and stability within society."
              ]
            }
          }
        ]
      }
    }
  ]
}