{
  "hadithId": 873,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/72"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (4528) ومسلم (1435). والآية نزلت لبيان جواز وضعيات الجماع بشرط أن يكون في القبل.",
    "urdu": "صحیح۔ اسے بخاری (4528) اور مسلم (1435) نے روایت کیا ہے۔ یہ آیت جماع کی مختلف وضعیات کے جواز میں نازل ہوئی بشرطیکہ وہ اگلی شرمگاہ میں ہو۔",
    "english": "Sahih. Reported by Al-Bukhari (4528) and Muslim (1435). The verse was revealed to clarify the permissibility of different positions for intercourse as long as it is in the vagina."
  },
  "importantWords": [
    {
      "arabic": "حَرْثٌ",
      "english": "Tilth / Plantation",
      "urdu": "کھیتی"
    },
    {
      "arabic": "أَنَّى شِئْتُمْ",
      "english": "Howsoever you will",
      "urdu": "جس طرح چاہو"
    },
    {
      "arabic": "أَحْوَلَ",
      "english": "Cross-eyed / Squint",
      "urdu": "بھینگا"
    },
    {
      "arabic": "قُبُلِهَا",
      "english": "Vagina (Front)",
      "urdu": "آگے کا راستہ"
    },
    {
      "arabic": "دُبُرِهَا",
      "english": "Backside / Rear",
      "urdu": "پیچھے کی جانب"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح کرتی ہے کہ میاں بیوی جماع کے لیے کوئی بھی پوزیشن اپنا سکتے ہیں بشرطیکہ مقامِ جماع صرف اگلی شرمگاہ ہو جہاں سے اولاد پیدا ہوتی ہے۔",
    "english": "This Hadith clarifies that spouses may adopt any position for intercourse as long as it is performed in the vagina, the place of procreation."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (4528)",
      "english": "Sahih al-Bukhari (4528)"
    },
    {
      "arabic": "صحيح مسلم (1435)",
      "english": "Sahih Muslim (1435)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T0E69_Lmo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نزولِ آیت کا پس منظر",
        "english": "Background of Revelation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یہودیوں کے توہمات",
              "english": "Jewish Superstitions"
            },
            "content": {
              "urdu": [
                "مدینہ کے یہودی یہ سمجھتے تھے کہ پچھلی طرف سے بیٹھ کر جماع کرنے سے بچہ معذور ہوتا ہے۔",
                "اسلام نے اس بے بنیاد توہم پرستی کو ختم کر کے مسلمانوں کو ذہنی سکون عطا کیا۔",
                "یہ آیت جاہلانہ رسومات اور غیر فطری عقائد کی نفی کے لیے نازل کی گئی۔"
              ],
              "english": [
                "The Jews of Madinah believed that having intercourse from behind would result in a deformed child.",
                "Islam eradicated this baseless superstition to provide mental peace to the believers.",
                "The verse was revealed to negate ignorant customs and unnatural beliefs."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھیتی سے تشبیہ کی حکمت",
              "english": "Wisdom of the Tilth Metaphor"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے عورت کو 'کھیتی' سے تشبیہ دی ہے کیونکہ وہ نسلِ انسانی کی آبیاری کرتی ہے۔",
                "جس طرح کسان اپنی کھیتی میں بیج بونے کے لیے مختلف طریقے اپناتا ہے، میاں بیوی کو بھی اختیار ہے۔",
                "شرط صرف یہ ہے کہ بیج وہیں بویا جائے جہاں سے فصل (اولاد) اگتی ہے، یعنی قبل (اگلا راستہ)۔"
              ],
              "english": [
                "Allah compared women to a 'tilth' because they are the means of human procreation.",
                "Just as a farmer has various ways to sow seeds, spouses have flexibility in their intimacy.",
                "The condition is that the seed must be sown where the harvest grows, meaning the vagina."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جائز اور ناجائز کی حدود",
        "english": "Boundaries of Permissibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضعیات کی آزادی",
              "english": "Freedom of Positions"
            },
            "content": {
              "urdu": [
                "کھڑے ہو کر، بیٹھ کر یا لیٹ کر جماع کرنا سب جائز ہے بشرطیکہ وہ مقامِ ولادت میں ہو۔",
                "لفظ 'انی شئتم' کا مطلب ہے کہ جس انداز یا طریقے سے بھی تم چاہو، یہ عمل کر سکتے ہو۔",
                "اسلام ایک فطری دین ہے جو ازدواجی زندگی میں جائز لذتوں اور آسانیوں کی حوصلہ افزائی کرتا ہے۔"
              ],
              "english": [
                "Performing intercourse while standing, sitting, or lying is permissible as long as it is in the procreative path.",
                "The phrase 'An-na Shi'tum' means you can engage in this act in any manner you prefer.",
                "Islam is a natural religion that encourages permissible pleasures and ease in marital life."
              ]
            }
          },
          {
            "title": {
              "urdu": "دبر کی ممانعت کا استدلال",
              "english": "Deduction of Anal Prohibition"
            },
            "content": {
              "urdu": [
                "اس آیت سے ثابت ہوتا ہے کہ پچھلے راستے (دبر) میں جماع کرنا حرام ہے کیونکہ وہ کھیتی نہیں ہے۔",
                "کھیتی وہ جگہ ہوتی ہے جہاں سے پیداوار ممکن ہو، اور دبر سے اولاد پیدا نہیں ہوتی۔",
                "نبی کریم ﷺ نے دیگر احادیث میں دبر میں جماع کرنے والے پر لعنت فرمائی ہے۔"
              ],
              "english": [
                "This verse proves that anal intercourse is forbidden as that part is not a 'tilth'.",
                "A tilth is a place where production is possible, and children are not born from the rectum.",
                "The Prophet (ﷺ) explicitly cursed those who perform anal sex in other narrations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی اور سائنسی پہلو",
        "english": "Medical and Scientific Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بھینگے پن کا تعلق",
              "english": "Relation to Squinting"
            },
            "content": {
              "urdu": [
                "بھینگا پن ایک موروثی یا طبی حالت ہے جس کا جماع کی پوزیشن سے کوئی تعلق نہیں۔",
                "سائنس نے ثابت کیا ہے کہ یہودی عقیدہ محض ایک وہم اور من گھڑت نظریہ تھا۔",
                "قرآن و حدیث نے چودہ سو سال پہلے ہی ان سائنسی غلطیوں کی تصحیح فرما دی تھی۔"
              ],
              "english": [
                "Strabismus (squinting) is a hereditary or medical condition unrelated to sexual positions.",
                "Science has proven that the Jewish belief was merely a myth and a fabricated notion.",
                "The Quran and Hadith corrected these scientific inaccuracies over 1400 years ago."
              ]
            }
          },
          {
            "title": {
              "urdu": "فطری توازن",
              "english": "Natural Balance"
            },
            "content": {
              "urdu": [
                "اسلام انسانی جسم کے افعال کو ان کے صحیح مقام پر رکھنے کی تعلیم دیتا ہے۔",
                "فطری راستوں کا استعمال صحت اور صفائی کے اصولوں کے عین مطابق ہے۔",
                "غیر فطری طریقوں سے اجتناب ہی انسانی وقار اور تندرستی کی ضمانت ہے۔"
              ],
              "english": [
                "Islam teaches keeping human bodily functions within their proper designated places.",
                "Utilizing natural paths is in total harmony with principles of health and hygiene.",
                "Abstaining from unnatural methods guarantees human dignity and physical well-being."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توہم پرستی کا خاتمہ",
              "english": "Ending Superstitions"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ اپنی زندگی کے معاملات میں صرف وحی الہی پر بھروسہ کریں۔",
                "معاشرتی افواہوں اور بے تکی باتوں کو دین کا حصہ بننے سے روکنا ضروری ہے۔",
                "علمِ نافع حاصل کرنا ہی انسان کو جہالت کے اندھیروں سے نجات دلاتا ہے۔"
              ],
              "english": [
                "Muslims should rely solely on Divine Revelation for their life affairs.",
                "It is essential to prevent social rumors and nonsensical talk from becoming part of religion.",
                "Gaining beneficial knowledge is what saves a person from the darkness of ignorance."
              ]
            }
          },
          {
            "title": {
              "urdu": "ازدواجی خوشحالی",
              "english": "Marital Prosperity"
            },
            "content": {
              "urdu": [
                "میاں بیوی کا رشتہ باہمی رضامندی اور خوشی پر مبنی ہونا چاہیے۔",
                "شرعی حدود کے اندر رہتے ہوئے ہر وہ عمل جائز ہے جو محبت میں اضافے کا باعث بنے۔",
                "دینِ اسلام زندگی کے ہر نازک موڑ پر بہترین اور متوازن راہنمائی فراہم کرتا ہے۔"
              ],
              "english": [
                "The relationship between spouses should be based on mutual consent and happiness.",
                "Within Sharia limits, any act that increases mutual love is considered permissible.",
                "Islam provides the best and most balanced guidance at every delicate stage of life."
              ]
            }
          }
        ]
      }
    }
  ]
}