{
  "hadithId": 942,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/942"
    ],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },
  
  "takhreej": {
    "arabic": "صحيح بشواهده.‏ رواه أبو داود (2263)‏، والنسائي (3481)‏، وابن ماجه (2743)‏، وابن حبان (4108)‏. وبالرغم من أن الحافظ قال عنه ضعيف في التلخيص، إلا أن له شواهد تقويه، وقد صححه الحاكم والذهبي والألباني في صحيح الجامع (2719).‏",
    "urdu": "یہ حدیث اپنے شواہد کی بنا پر صحیح ہے۔ اسے ابوداؤد (2263)، نسائی (3481) اور ابن ماجہ (2743) نے روایت کیا ہے۔ اگرچہ بعض محدثین نے اس کی سند پر کلام کیا ہے لیکن امام ابن حبان، حاکم اور علامہ البانی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih due to supporting evidences. Reported by Abu Dawud (2263), An-Nasa'i (3481), Ibn Majah (2743), and Ibn Hibban (4108). Scholars like Al-Hakim, Az-Zahabi, and Al-Albani authenticated it."
  },
  "importantWords": [
    {
      "arabic": "أَدْخَلَتْ",
      "english": "Introduced / Inserted",
      "urdu": "داخل کیا (نسب میں)"
    },
    {
      "arabic": "جَحَدَ",
      "english": "Denied / Disowned",
      "urdu": "انکار کیا"
    },
    {
      "arabic": "وَلَدَهُ",
      "english": "His child",
      "urdu": "اس کا بیٹا"
    },
    {
      "arabic": "اِحْتَجَبَ",
      "english": "Veiled Himself / Remained hidden",
      "urdu": "پردہ فرما لے گا"
    },
    {
      "arabic": "فَضَحَهُ",
      "english": "Exposed / Disgraced him",
      "urdu": "اسے رسوا کرے گا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نسب کے ساتھ کھلواڑ کرنے والوں کے لیے سخت وعید ہے؛ عورت کے لیے غیر کا بچہ شوہر کے نسب میں شامل کرنا اور مرد کے لیے اپنے حقیقی بچے کا انکار کرنا جہنم اور رسوائی کا باعث ہے۔",
    "english": "This Hadith warns against tampering with lineage; a woman attributing an illegitimate child to her husband or a man disowning his biological child leads to exclusion from Paradise and public disgrace."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2263)",
      "english": "Reported by Abu Dawud (2263)"
    },
    {
      "arabic": "رواه النسائي (3481)",
      "english": "Reported by An-Nasa'i (3481)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نسب کی حفاظت اور عورت کی ذمہ داری",
        "english": "Protection of Lineage and Woman's Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلط نسب کی آمیزش",
              "english": "Mixing False Lineage"
            },
            "content": {
              "urdu": [
                "عورت کے لیے بدکاری کر کے غیر کا بچہ شوہر کے خاندان میں داخل کرنا بدترین خیانت ہے۔",
                "ایسا کرنے سے وراثت، محرمات اور نسب کے تمام شرعی ضابطے بگاڑ کا شکار ہو جاتے ہیں۔",
                "نبی ﷺ نے اسے اتنا بڑا گناہ قرار دیا کہ ایسی عورت کا اللہ سے تعلق ختم ہو جاتا ہے۔"
              ],
              "english": [
                "It is a grave betrayal for a woman to introduce an illegitimate child into her husband's family.",
                "Doing so corrupts the Shariah laws regarding inheritance, prohibited marriages, and lineage.",
                "The Prophet (ﷺ) declared this sin so severe that such a woman loses her connection with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنت سے محرومی",
              "english": "Exclusion from Paradise"
            },
            "content": {
              "urdu": [
                "نسب میں ملاوٹ کرنے والی عورت کے لیے جنت کی دائمی محرومی کی وعید سنائی گئی ہے۔",
                "یہ وعید اس گناہ کی سنگینی کو ظاہر کرتی ہے جو پورے معاشرے کے لیے ناسور ہے۔",
                "اسلام خاندانی پاکیزگی کو ہر حال میں برقرار رکھنے کا حکم دیتا ہے۔"
              ],
              "english": [
                "A woman who tampers with lineage is warned of eternal exclusion from Paradise.",
                "This warning highlights the gravity of a sin that acts as a cancer for the entire society.",
                "Islam commands the preservation of family purity under all circumstances."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بچے کے انکار کی سنگینی",
        "english": "Severity of Disowning a Child"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باپ کا جرم",
              "english": "The Father's Crime"
            },
            "content": {
              "urdu": [
                "اپنے حقیقی بچے کا محض شک یا غصے کی بنیاد پر انکار کرنا ظلمِ عظیم ہے۔",
                "بچہ معصوم ہوتا ہے اور باپ کا انکار اس کی پوری زندگی اور شناخت برباد کر دیتا ہے۔",
                "حدیث میں 'بچے کا باپ کی طرف دیکھنا' اس کی بے بسی اور جذباتی تعلق کی علامت ہے۔"
              ],
              "english": [
                "Disowning a biological child based on mere suspicion or anger is a great injustice.",
                "A child is innocent, and a father's denial ruins the child's entire life and identity.",
                "The phrase 'child looking at him' signifies the child's helplessness and emotional bond."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کا حجاب اور ناراضگی",
              "english": "Allah's Veil and Displeasure"
            },
            "content": {
              "urdu": [
                "جو باپ دنیا میں اپنے بچے کو نہیں دیکھتا، اللہ قیامت میں اسے اپنا دیدار نہیں کرائے گا۔",
                "اللہ کا بندے سے پردہ فرما لینا اس کی شدید ناراضگی اور عذاب کی نشانی ہے۔",
                "یہ سزا اس شخص کے دنیاوی رویے کا عین بدلہ ہوگی۔"
              ],
              "english": [
                "A father who ignores his child in this world will be denied the vision of Allah in the hereafter.",
                "Allah veiling Himself from a servant is a sign of His severe wrath and punishment.",
                "This punishment will be a direct reflection of the person's worldly conduct."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کی رسوائی",
        "english": "Disgrace on the Day of Resurrection"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عام مجمع میں رسوائی",
              "english": "Public Humiliation"
            },
            "content": {
              "urdu": [
                "نسب کا انکار کرنے والے کو اولین و آخرین کے سامنے ذلیل و خوار کیا جائے گا۔",
                "جس نے دنیا میں اپنے نسب کو چھپایا، اللہ اس کا سارا پول سب کے سامنے کھول دے گا۔",
                "یہ رسوائی دنیاوی سزا کے مقابلے میں کہیں زیادہ تکلیف دہ اور دائمی ہوگی۔"
              ],
              "english": [
                "One who denies his lineage will be disgraced in front of all generations of mankind.",
                "Whoever tried to hide the truth of his lineage will find Allah exposing his secrets publicly.",
                "This humiliation will be far more painful and lasting than any worldly punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدلِ الہی کا ظہور",
              "english": "Manifestation of Divine Justice"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ مظلوم بچے کا حق اس کے ظالم باپ سے ضرور وصول فرمائے گا۔",
                "دنیا کی عدالت سے بچنے والے اللہ کی پکڑ سے کسی صورت نہیں بچ سکتے۔",
                "قیامت کا دن ہر چھپی ہوئی سچائی کے ظاہر ہونے کا دن ہے۔"
              ],
              "english": [
                "Allah will surely take the right of the oppressed child from the oppressive father.",
                "Those escaping worldly courts can by no means escape the grip of Allah.",
                "The Day of Resurrection is the day when every hidden truth shall be revealed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی سبق",
        "english": "Social and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندان کا تحفظ",
              "english": "Safeguarding the Family"
            },
            "content": {
              "urdu": [
                "اسلام میں خاندان کی بنیاد سچائی اور پاکیزگی پر رکھی گئی ہے۔",
                "جھوٹے الزامات اور مشکوک نسب معاشرے میں فساد کا سب سے بڑا ذریعہ ہیں۔",
                "مومن کو چاہیے کہ وہ اپنی نسلوں کی حفاظت کے لیے شرعی حدود کی پابندی کرے۔"
              ],
              "english": [
                "In Islam, the foundation of a family is built on truthfulness and purity.",
                "False accusations and suspicious lineages are major sources of social corruption.",
                "A believer must adhere to Shariah limits to protect his future generations."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط اور تقویٰ",
              "english": "Caution and Piety"
            },
            "content": {
              "urdu": [
                "زبان سے کوئی بھی کلمہ نکالنے سے پہلے اس کے انجام پر غور کرنا ضروری ہے۔",
                "نسب جیسے حساس معاملے میں ذرا سی لاپرواہی آخرت کی تباہی کا باعث بن سکتی ہے۔",
                "اللہ سے ڈرنے والا ہی اپنے اہل و عیال کے حقوق صحیح معنوں میں ادا کر سکتا ہے۔"
              ],
              "english": [
                "One must consider the consequences before uttering any word regarding lineage.",
                "Slight negligence in sensitive matters like lineage can lead to ruin in the hereafter.",
                "Only those who fear Allah can truly fulfill the rights of their families."
              ]
            }
          }
        ]
      }
    }
  ]
}