{
  "hadithId": 401,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-401"],
    "kitabId": 2,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام",
    "babId": 25
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1043)‏، ومسلم (915)، ورواية أبي بكرة عند البخاري (1040).",
    "urdu": "یہ حدیث صحیح ہے اور بخاری ومسلم کی متفق علیہ روایت ہے۔ بخاری میں ابوبکرہ رضی اللہ عنہ سے بھی اسی مفہوم کی روایت موجود ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1043) and Muslim (915). The narration of Abu Bakrah is also in Al-Bukhari (1040)."
  },
  "importantWords": [
    {
      "arabic": "اِنْكَسَفَتِ",
      "english": "Eclipsed",
      "urdu": "گرہن لگ گیا"
    },
    {
      "arabic": "آيَتَانِ",
      "english": "Two signs",
      "urdu": "دو نشانیاں"
    },
    {
      "arabic": "مَوْتِ",
      "english": "Death",
      "urdu": "موت"
    },
    {
      "arabic": "تَنْكَشِفَ",
      "english": "Clear up / End",
      "urdu": "کھل جائے / ختم ہو جائے"
    },
    {
      "arabic": "تَنْجَلِي",
      "english": "Be clarified / Shine",
      "urdu": "روشن ہو جائے"
    }
  ],
  "summary": {
    "urdu": "سورج اور چاند گرہن قدرتی نشانیاں ہیں جن کا کسی کی موت یا زندگی سے تعلق نہیں۔ ایسی صورت میں نماز اور دعا کا حکم ہے۔",
    "english": "Solar and lunar eclipses are natural signs of Allah and not related to anyone's life or death. Prayer and supplication are commanded during these events."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1043)",
      "english": "Sahih al-Bukhari (1043)"
    },
    {
      "arabic": "صحيح مسلم (915)",
      "english": "Sahih Muslim (915)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "المغيرة بن شعبة",
        "english": "Al-Mughira bin Shu'ba"
      },
      "slug": "al-mughira-bin-shuba"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو بكرة الثقفي",
        "english": "Abu Bakrah Al-Thaqafi"
      },
      "slug": "abu-bakrah"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=salat+ul+kusuf+hadith+explanation+urdu",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "توہم پرستی کا خاتمہ",
        "english": "End of Superstition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کائناتی حقائق کی وضاحت",
              "english": "Clarification of Cosmic Realities"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے واضح فرمایا کہ کائناتی مظاہر کسی کی موت یا زندگی کے پابند نہیں ہیں۔",
                "عربوں میں یہ قدیم وہم تھا کہ بڑے آدمی کی موت پر سورج اداس ہوتا ہے۔",
                "آپ ﷺ نے اپنے بیٹے کی وفات کے موقع پر بھی حق بات بیان کر کے شرک کی جڑ کاٹ دی۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that cosmic phenomena are not bound by human life or death.",
                "There was an ancient Arab superstition that the sun mourns the death of great men.",
                "Even on the day of his son's death, he spoke the truth to uproot polytheistic beliefs."
              ]
            }
          },
          {
            "title": {
              "urdu": "عقیدہ توحید کی پختگی",
              "english": "Strengthening Monotheism"
            },
            "content": {
              "urdu": [
                "سورج اور چاند اللہ کی مخلوق ہیں اور اس کے حکم کے تابع ہیں۔",
                "کائنات کا ہر ذرہ اللہ کی ربوبیت اور اس کی قدرت کی گواہی دیتا ہے۔",
                "مسلمانوں کو ہر قسم کے وہم اور غیر اسلامی عقائد سے دور رہنا چاہیے۔"
              ],
              "english": [
                "The sun and moon are creations of Allah and subject to His command.",
                "Every atom in the universe testifies to Allah's Lordship and Power.",
                "Muslims must stay away from all forms of superstition and un-Islamic beliefs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازِ کسوف کا حکم",
        "english": "Ruling on the Eclipse Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا اور نماز کی تاکید",
              "english": "Emphasis on Prayer and Dua"
            },
            "content": {
              "urdu": [
                "گرہن کے وقت گھبرانے یا وہم کرنے کے بجائے اللہ کی طرف رجوع کرنا چاہیے۔",
                "نبی ﷺ نے اس موقع پر طویل نماز اور گریہ و زاری کا حکم دیا ہے۔",
                "یہ نماز اللہ کے غضب سے بچنے اور اس کی رحمت مانگنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Instead of panicking or obsessing, one should turn to Allah during an eclipse.",
                "The Prophet (ﷺ) commanded long prayers and supplication during this event.",
                "This prayer is a means to seek refuge from Allah's wrath and ask for His mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کا دورانیہ",
              "english": "Duration of the Prayer"
            },
            "content": {
              "urdu": [
                "حدیث کے الفاظ 'حتی تنکشف' سے معلوم ہوتا ہے کہ نماز گرہن ختم ہونے تک ہونی چاہیے۔",
                "اگر نماز جلدی ختم ہو جائے تو باقی وقت دعا اور استغفار میں گزارنا چاہیے۔",
                "یہ وقت اللہ کی قدرت پر غور و فکر اور توبہ کا بہترین موقع ہوتا ہے۔"
              ],
              "english": [
                "The words 'until it clears' suggest the prayer should last until the eclipse ends.",
                "If the prayer ends early, the remaining time should be spent in Dua and Istighfar.",
                "This time is a prime opportunity for reflecting on Allah's power and repentance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سائنسی اور شرعی توازن",
        "english": "Scientific and Sharia Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قدرتی نشانیاں",
              "english": "Natural Signs"
            },
            "content": {
              "urdu": [
                "گرہن کا لگنا سائنسی طور پر ایک فلکیاتی عمل ہے لیکن شرعی طور پر ایک تنبیہ ہے۔",
                "اللہ تعالیٰ ان نشانیوں کے ذریعے اپنے بندوں کو اپنی قدرت یاد دلاتا ہے۔",
                "سائنسی علم حاصل کرنا درست ہے مگر اصل مقصد اللہ کی معرفت ہونی چاہیے۔"
              ],
              "english": [
                "An eclipse is scientifically an astronomical event but religiously a warning.",
                "Allah reminds His servants of His power through these natural signs.",
                "Seeking scientific knowledge is correct, but the goal should be knowing Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوفِ خدا کا اظہار",
              "english": "Expressing Fear of Allah"
            },
            "content": {
              "urdu": [
                "گرہن کے وقت آپ ﷺ پر خوف طاری ہوتا تھا کہ کہیں یہ قیامت کی علامت نہ ہو۔",
                "مومن کو کائناتی تبدیلیوں سے اللہ کی عظمت کا احساس حاصل کرنا چاہیے۔",
                "غفلت میں رہنے کے بجائے استغفار اور صدقہ و خیرات کی طرف متوجہ ہونا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) would feel fear during eclipses, lest they be signs of the Hour.",
                "A believer should derive a sense of Allah's greatness from cosmic changes.",
                "Instead of remaining heedless, one should focus on Istighfar and charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی سبق",
        "english": "Educational and Training Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق گوئی کی اہمیت",
              "english": "Importance of Speaking the Truth"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے ذاتی صدمے کے باوجود عوام کی غلط فہمی کی فوری اصلاح کی۔",
                "دین کی تبلیغ میں مصلحت کے بجائے ہمیشہ سچائی کو مقدم رکھنا چاہیے۔",
                "یہ ایک مثالی لیڈر اور اللہ کے سچے رسول ﷺ کا بہترین نمونہ ہے۔"
              ],
              "english": [
                "Despite personal grief, the Prophet (ﷺ) corrected the public's misunderstanding.",
                "Truth should always be prioritized over convenience in preaching religion.",
                "This is a perfect example of an ideal leader and a true Messenger of Allah (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمل کی ترغیب",
              "english": "Encouragement to Action"
            },
            "content": {
              "urdu": [
                "مشکل یا غیر معمولی حالات میں بہترین حل 'نماز' اور 'دعا' ہے۔",
                "اسلام ہمیں مسائل کا سامنا صبر اور بندگی کے ساتھ کرنے کا درس دیتا ہے۔",
                "نمازِ کسوف سنتِ مؤکدہ ہے اور اسے جماعت کے ساتھ ادا کرنا افضل ہے۔"
              ],
              "english": [
                "The best solution in difficult or unusual circumstances is 'Prayer' and 'Dua'.",
                "Islam teaches us to face problems with patience and devotion.",
                "Salat al-Kusuf is a stressed Sunnah and is best performed in congregation."
              ]
            }
          }
        ]
      }
    }
  ]
}
