{
  "hadithId": 627,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["bulugh/627"],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام - كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1749)، ومسلم (1296).",
    "urdu": "صحیح۔ اسے امام بخاری (1749) اور امام مسلم (1296) نے روایت کیا ہے۔ یہ حدیث جمرہ عقبہ کی رمی کے مسنون طریقے کی وضاحت کرتی ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1749) and Muslim (1296). It clarifies the Sunnah positioning for stoning Jamrat al-Aqaba."
  },
  "importantWords": [
    {
      "arabic": "جَعَلَ اَلْبَيْتَ",
      "english": "Positioned the Ka'bah",
      "urdu": "بیت اللہ کو رکھا"
    },
    {
      "arabic": "يَسَارِهِ",
      "english": "On his left",
      "urdu": "اس کے بائیں جانب"
    },
    {
      "arabic": "يَمِينِهِ",
      "english": "On his right",
      "urdu": "اس کے دائیں جانب"
    },
    {
      "arabic": "رَمَى",
      "english": "Threw / Pelted",
      "urdu": "رجم کیا / کنکریاں ماریں"
    },
    {
      "arabic": "مَقَامُ",
      "english": "Standing place",
      "urdu": "کھڑے ہونے کی جگہ"
    }
  ],
  "summary": {
    "urdu": "جمرہ عقبہ (بڑے شیطان) کو کنکریاں مارتے وقت اس طرح کھڑا ہونا سنت ہے کہ مکہ بائیں طرف اور منیٰ دائیں طرف ہو، اور کنکریاں مارتے وقت تکبیر کہنی چاہیے۔",
    "english": "It is Sunnah to stand for stoning Jamrat al-Aqaba in a way that Makkah is to the left and Mina is to the right, reciting Takbir with each of the seven pebbles."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1749)",
      "english": "Reported by Al-Bukhari (1749)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah bin Mas'ud"
      },
      "slug": "abdullah-bin-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_fGj9kO4_Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمرہ عقبہ کی رمی کا مسنون طریقہ",
        "english": "The Sunnah Method of Stoning Jamrat al-Aqaba"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھڑے ہونے کی سمت",
              "english": "Positioning and Direction"
            },
            "content": {
              "urdu": [
                "جمرہ عقبہ کی رمی کے لیے وادی کے نشیب میں کھڑا ہونا افضل ہے جہاں سے مکہ بائیں اور منیٰ دائیں طرف ہو۔",
                "یہ وہی جگہ ہے جہاں کھڑے ہو کر نبی ﷺ نے رمی فرمائی تھی، اس لیے اسے 'مقامِ مصطفیٰ ﷺ' کہا جاتا ہے۔",
                "آج کے دور میں کثیر منزلہ پلوں کی وجہ سے کسی بھی رخ سے رمی کرنا جائز ہے، لیکن یہ سمت سنتِ مؤکدہ ہے۔"
              ],
              "english": [
                "It is best to stand in the valley for stoning Jamrat al-Aqaba such that Makkah is on the left and Mina on the right.",
                "This is the specific spot where the Prophet (ﷺ) stood, often referred to as the place of the Chosen One.",
                "While modern multi-story bridges allow stoning from any direction, this specific positioning remains the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "کنکریوں کی تعداد اور تکبیر",
              "english": "Number of Pebbles and Takbir"
            },
            "content": {
              "urdu": [
                "جمرہ عقبہ کو سات کنکریاں ماری جاتی ہیں، اور ہر کنکری کے ساتھ 'اللہ اکبر' کہنا مسنون ہے۔",
                "کنکر مارنے کا مقصد اللہ کی بڑائی بیان کرنا اور شیطان کی دشمنی کا اظہار ہے۔",
                "کنکری کا سائز چنے یا لوبیے کے دانے کے برابر ہونا چاہیے، بڑے پتھر مارنا منع ہے۔"
              ],
              "english": [
                "Seven pebbles are thrown at Jamrat al-Aqaba, and reciting 'Allahu Akbar' with each throw is Sunnah.",
                "The purpose is to glorify Allah and express enmity towards Satan.",
                "Pebbles should be the size of a chickpea or bean; using large stones is prohibited."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا ابن مسعود کا اتباعِ سنت",
        "english": "Ibn Mas'ud's Adherence to Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جذبہِ اتباع",
              "english": "Spirit of Emulation"
            },
            "content": {
              "urdu": [
                "سیدنا ابن مسعود نے نہ صرف سنت پر عمل کیا بلکہ اسے دوسروں کو سکھایا بھی۔",
                "ان کا یہ کہنا کہ 'یہ وہ مقام ہے جہاں صاحبِ سورہ بقرہ کھڑے ہوئے تھے' ان کی گہری علمی بصیرت ظاہر کرتا ہے۔",
                "وہ چاہتے تھے کہ امت کو پتہ چلے کہ ہر چھوٹی ادا بھی وحیِ الہی کی منشا کے مطابق ہے۔"
              ],
              "english": [
                "Ibn Mas'ud (RA) not only practiced the Sunnah but actively taught it to others.",
                "His statement regarding the 'one to whom Surah al-Baqarah was revealed' shows his deep scholarly insight.",
                "He wanted the Ummah to realize that even small gestures in Hajj are aligned with Divine Will."
              ]
            }
          },
          {
            "title": {
              "urdu": "سورہ بقرہ کی تخصیص",
              "english": "Specification of Surah al-Baqarah"
            },
            "content": {
              "urdu": [
                "سیدنا ابن مسعود نے نبی ﷺ کے لیے 'صاحبِ سورہ بقرہ' کا لقب استعمال کیا کیونکہ اس سورہ میں حج کے تفصیلی احکام موجود ہیں۔",
                "یہ لقب آپ ﷺ کی عظمت اور قرآن کے ساتھ ان کے گہرے تعلق کو واضح کرتا ہے۔",
                "اس سے یہ بھی معلوم ہوتا ہے کہ صحابہ قرآن کی سورتوں کے ناموں سے مسائل اخذ کرتے تھے۔"
              ],
              "english": [
                "He referred to the Prophet (ﷺ) as the 'one to whom Surah al-Baqarah was revealed' because that Surah contains detailed Hajj rulings.",
                "This title highlights the Prophet's greatness and his profound connection with the Quran.",
                "It also shows that the Sahaba associated specific Surahs with legal and ritual contexts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و انتظامی نکات",
        "english": "Juristic and Administrative Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رمی کا وقت",
              "english": "Timing of Ramy"
            },
            "content": {
              "urdu": [
                "10 ذوالحجہ کو جمرہ عقبہ کی رمی کا مسنون وقت سورج نکلنے کے بعد (چاشت کے وقت) شروع ہوتا ہے۔",
                "کمزوروں اور عورتوں کے لیے فجر سے پہلے بھی اجازت ہے جیسا کہ دیگر احادیث سے ثابت ہے۔",
                "رمی کے ساتھ ہی حج کا ایک بڑا حصہ مکمل ہو جاتا ہے اور 'تحللِ اول' حاصل ہو جاتا ہے۔"
              ],
              "english": [
                "The Sunnah time for stoning Jamrat al-Aqaba on the 10th begins after sunrise (Duha time).",
                "For the weak and women, earlier stoning is permitted as proven by other narrations.",
                "Upon stoning, a major part of Hajj is completed, achieving the first partial exit (Tahallul)."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہجوم اور حفاظتی تدابیر",
              "english": "Crowds and Safety Measures"
            },
            "content": {
              "urdu": [
                "رمی کے دوران دوسروں کو دھکا دینا یا اذیت پہنچانا گناہ ہے اور حج کی روح کے خلاف ہے۔",
                "اگر سنت طریقے سے کھڑا ہونا ہجوم کی وجہ سے ممکن نہ ہو تو جہاں جگہ ملے وہیں سے رمی کر لینی چاہیے۔",
                "شریعت نے جان کی حفاظت کو سنت کی ظاہری ہیئت پر مقدم رکھا ہے۔"
              ],
              "english": [
                "Pushing or harming others during stoning is a sin and contradicts the spirit of Hajj.",
                "If standing in the Sunnah position is impossible due to crowds, one should stone from any available spot.",
                "Shariah prioritizes the preservation of life over the external form of a Sunnah act."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی اہمیت",
              "english": "Importance of Discipline"
            },
            "content": {
              "urdu": [
                "عبادت میں مخصوص جگہوں اور سمتوں کا تعین ہمیں زندگی میں نظم و ضبط سکھاتا ہے۔",
                "ایک مومن کو چاہیے کہ وہ اپنے ہر کام کو ترتیب اور سلیقے سے انجام دے۔",
                "سنت کی اتباع انسان کے اندر وقار اور سکون پیدا کرتی ہے۔"
              ],
              "english": [
                "The designation of specific spots and directions in worship teaches us discipline in life.",
                "A believer should strive to perform every task with order and refinement.",
                "Following the Sunnah instills dignity and tranquility within an individual."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم و تربیت",
              "english": "Education and Training"
            },
            "content": {
              "urdu": [
                "سیدنا ابن مسعود کا طریقہ بتاتا ہے کہ بزرگوں کو چاہیے کہ وہ چھوٹوں کو نیکی کا صحیح طریقہ سکھائیں۔",
                "عمل کے ساتھ ساتھ اس کی تاریخی اور شرعی بنیاد بیان کرنا زیادہ موثر ہوتا ہے۔",
                "دین کی صحیح معلومات کو عام کرنا ہر عالم اور سمجھدار مسلمان کی ذمہ داری ہے۔"
              ],
              "english": [
                "Ibn Mas'ud's method shows that elders should teach the correct way of performing good deeds to the younger ones.",
                "Explaining the historical and legal basis along with the action is more effective.",
                "Spreading correct religious knowledge is the responsibility of every scholar and informed Muslim."
              ]
            }
          }
        ]
      }
    }
  ]
}