{
  "hadithId": 512,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/512"],
    "kitabId": 4,
    "inKitabBab": 3,
    "arabicBook": "كتاب الزكاة",
    "babId": 31
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (2/358)، وأبو داود (1677)، وابن خزيمة (2444)، وابن حبان (3335)، والحاكم (1/414) وصححه على شرط مسلم.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے احمد (2/358)، ابوداؤد (1677)، ابن خزیمہ (2444)، اور ابن حبان (3335) نے روایت کیا ہے۔ امام حاکم نے اسے مسلم کی شرط پر صحیح کہا ہے۔",
    "english": "Sahih. Reported by Ahmad (2/358), Abu Dawud (1677), Ibn Khuzaymah (2444), Ibn Hibban (3335), and Al-Hakim (1/414) who graded it Sahih based on Muslim's criteria."
  },
  "importantWords": [
    {
      "arabic": "أَفْضَلُ",
      "english": "Most excellent / Best",
      "urdu": "سب سے افضل"
    },
    {
      "arabic": "جُهْدُ",
      "english": "Effort / Struggle",
      "urdu": "کوشش / محنت"
    },
    {
      "arabic": "الْمُقِلِّ",
      "english": "One with little wealth",
      "urdu": "کم مال والا / غریب"
    },
    {
      "arabic": "ابْدَأْ",
      "english": "Start / Begin",
      "urdu": "شروع کرو"
    },
    {
      "arabic": "تَعُولُ",
      "english": "You support / Dependents",
      "urdu": "تم کفالت کرتے ہو"
    }
  ],
  "summary": {
    "urdu": "اللہ کے ہاں سب سے قیمتی صدقہ وہ ہے جو تنگی کے باوجود محنت سے دیا جائے، اور صدقہ میں سب سے پہلا حق گھر والوں اور زیرِ کفالت افراد کا ہے۔",
    "english": "The most virtuous charity is that given by a person of modest means through their struggle, and the priority of giving belongs to one's own family."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1677)",
      "english": "Sunan Abi Dawud (1677)"
    },
    {
      "arabic": "مسند أحمد (2/358)",
      "english": "Musnad Ahmad (2/358)"
    },
    {
      "arabic": "صحيح ابن حبان (3335)",
      "english": "Sahih Ibn Hibban (3335)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0i4lX87SjS4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "افضل صدقہ کی حقیقت",
        "english": "The Reality of Best Charity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنگی میں ایثار",
              "english": "Sacrifice in Hardship"
            },
            "content": {
              "urdu": [
                "افضل صدقہ وہ ہے جو انسان اپنی تنگی اور ضرورت کے باوجود کرے۔",
                "اللہ کے ہاں مال کی کثرت سے زیادہ نیت اور ایثار کی اہمیت ہے۔",
                "کم مال والے کا تھوڑا صدقہ غنی کے بڑے صدقے سے بڑھ سکتا ہے۔"
              ],
              "english": [
                "The best charity is that given despite personal need and hardship.",
                "In Allah's sight, sincerity and sacrifice matter more than the amount.",
                "A small gift from a poor man can outweigh a large one from the rich."
              ]
            }
          },
          {
            "title": {
              "urdu": "محنت کی کمائی",
              "english": "Earning through Struggle"
            },
            "content": {
              "urdu": [
                "اپنی محنت اور مشقت سے کمائے ہوئے مال سے صدقہ کرنا افضل ہے۔",
                "یہ عمل بندے کے اللہ پر کامل توکل اور بھروسے کی علامت ہے۔",
                "مشقت اٹھا کر دینا نفس کی پاکیزگی اور تربیت کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Giving from wealth earned through hard labor and struggle is superior.",
                "This act signifies a servant's complete trust and reliance on Allah.",
                "Giving while facing difficulty is the best way to purify the soul."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انفاق کی ترتیب",
        "english": "The Order of Spending"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہل و عیال کا حق",
              "english": "Rights of the Family"
            },
            "content": {
              "urdu": [
                "صدقہ کی شروعات ہمیشہ اپنے زیرِ کفالت افراد سے کرنی چاہیے۔",
                "گھر والوں کی ضروریات کو نظر انداز کر کے باہر دینا پسندیدہ نہیں۔",
                "بیوی بچوں پر خرچ کرنا بھی اجر و ثواب کے لحاظ سے صدقہ ہے۔"
              ],
              "english": [
                "Charity should always begin with those for whom you are responsible.",
                "Neglecting family needs to give elsewhere is not recommended in Islam.",
                "Spending on one's spouse and children is also rewarded as charity."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمہ داری کا احساس",
              "english": "Sense of Responsibility"
            },
            "content": {
              "urdu": [
                "اسلام ہمیں حقوق العباد کی ادائیگی میں ترتیب سکھاتا ہے۔",
                "سب سے پہلے واجب حقوق ادا کریں پھر نفلی صدقات کی طرف جائیں۔",
                "گھر والوں کی کفالت ایک فرض ہے جسے صدقہ پر مقدم رکھا گیا ہے۔"
              ],
              "english": [
                "Islam teaches us the correct order in fulfilling the rights of people.",
                "Fulfill obligatory rights first before moving to voluntary donations.",
                "Supporting the family is a duty that takes precedence over extra charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی توازن",
        "english": "Social Balance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخاوت کا عام ہونا",
              "english": "Universal Generosity"
            },
            "content": {
              "urdu": [
                "سخاوت صرف مالداروں کے لیے مخصوص نہیں بلکہ ہر مسلمان کے لیے ہے۔",
                "کم مال والے کا صدقہ معاشرے میں ہمدردی کا جذبہ پیدا کرتا ہے۔",
                "ہر شخص اپنی استطاعت کے مطابق خیر کے کاموں میں حصہ لے سکتا ہے۔"
              ],
              "english": [
                "Generosity is not limited to the rich; it is for every Muslim.",
                "Charity from those with less wealth fosters a spirit of empathy.",
                "Every individual can participate in good works according to their means."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقر سے بچاؤ",
              "english": "Prevention of Poverty"
            },
            "content": {
              "urdu": [
                "اپنے قریبی لوگوں کی مدد کرنا معاشرے سے فقر کے خاتمے کا پہلا زینہ ہے۔",
                "اگر ہر کوئی اپنے رشتہ داروں کا خیال رکھے تو کوئی بھوکا نہ رہے۔",
                "یہ طریقہ کار سماجی تحفظ کا ایک مربوط اور مستحکم نظام فراہم کرتا ہے۔"
              ],
              "english": [
                "Helping close relatives is the first step to eradicating poverty.",
                "If everyone cared for their kin, hunger would be eliminated.",
                "This approach provides a stable and integrated system of social safety."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قناعت اور شکر",
              "english": "Contentment and Gratitude"
            },
            "content": {
              "urdu": [
                "تنگی میں دینا انسان کو قناعت اور شکر گزاری کی دولت دیتا ہے۔",
                "یہ عمل دل سے دنیا کی محبت نکال کر اللہ کی محبت بھر دیتا ہے۔",
                "بندہ یہ سیکھتا ہے کہ رزق کا مالک صرف اللہ ہے وہی دینے والا ہے۔"
              ],
              "english": [
                "Giving in hardship grants the treasures of contentment and gratitude.",
                "This act removes worldly love from the heart and fills it with Allah's love.",
                "The believer learns that Allah is the sole Provider and Owner of all."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمتِ انفاق",
              "english": "Wisdom of Spending"
            },
            "content": {
              "urdu": [
                "دین ہمیں جزباتی فیصلوں کے بجائے حکمت اور ترتیب سکھاتا ہے۔",
                "صدقہ صرف مال دینا نہیں بلکہ ایک منظم فکری رویہ ہے۔",
                "صحیح وقت اور صحیح جگہ پر خرچ کرنا ہی اصل دانشمندی ہے۔"
              ],
              "english": [
                "Religion teaches us wisdom and order rather than emotional decisions.",
                "Charity is not just giving money; it is an organized mental attitude.",
                "The real wisdom lies in spending at the right time and right place."
              ]
            }
          }
        ]
      }
    }
  ]
}