{
  "hadithId": 1338,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/108"],
    "kitabId": 16,
    "inKitabBab": 6,
    "arabicBook": "الجامع - باب الذكر والدعاء",
    "babId": 107
  },

  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2726).",
    "urdu": "صحیح۔ اسے امام مسلم (2726) نے روایت کیا ہے۔ اس حدیث میں ذکرِ الہی کے ایک ایسے جامع صیغے کی تعلیم دی گئی ہے جو تھوڑی سی مشقت میں عظیم ترین اجر فراہم کرتا ہے۔",
    "english": "Sahih. Reported by Muslim (2726). This Hadith teaches a comprehensive formula of Dhikr that yields immense reward with minimal effort."
  },
  "importantWords": [
    {
      "arabic": "عَدَدَ خَلْقِهِ",
      "english": "Number of His creation",
      "urdu": "اس کی مخلوق کی تعداد کے برابر"
    },
    {
      "arabic": "رِضَا نَفْسِهِ",
      "english": "Pleasure of His Self",
      "urdu": "اس کی اپنی ذات کی خوشنودی"
    },
    {
      "arabic": "زِنَةَ عَرْشِهِ",
      "english": "Weight of His Throne",
      "urdu": "اس کے عرش کے وزن کے برابر"
    },
    {
      "arabic": "مِدَادَ كَلِمَاتِهِ",
      "english": "Ink for His words",
      "urdu": "اس کے کلمات کی سیاہی کے برابر"
    }
  ],
  "summary": {
    "urdu": "رسول اللہ ﷺ نے سیدہ جویریہ رضی اللہ عنہا کو ایک ایسا جامع ذکر سکھایا جس کا اجر و ثواب مقدار اور وقت کے لحاظ سے بہت زیادہ ہے، جو اللہ کی لامحدود عظمت کا اعتراف ہے۔",
    "english": "The Prophet (ﷺ) taught Juwayriyah (RA) a comprehensive form of remembrance whose reward outweighs long hours of chanting, embodying an acknowledgment of Allah's infinite greatness."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الذكر والدعاء والتوبة، رقم 2726",
      "english": "Sahih Muslim, Book of Remembrance, Supplication, Repentance and Seeking Forgiveness, No. 2726"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جويرية بنت الحارث",
        "english": "Juwayriyah bint al-Harith"
      },
      "slug": "juwayriyah-bint-al-harith"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر اور جوامع الکلم",
        "english": "Background and Concise Speech"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سیدہ جویریہ کی عبادت",
              "english": "Juwayriyah's Worship"
            },
            "content": {
              "urdu": [
                "سیدہ جویریہ رضی اللہ عنہا فجر کے بعد سے چاشت کے وقت تک مسلسل ذکر و تسبیح میں مصروف رہتی تھیں۔",
                "آپ ﷺ نے انہیں وہ کلمات سکھائے جو وقت کم لیتے ہیں مگر اجر میں طویل گھنٹوں کی تسبیح پر بھاری ہیں۔",
                "یہ نبی کریم ﷺ کے 'جوامع الکلم' (مختصر مگر جامع الفاظ) کا بہترین نمونہ ہے۔"
              ],
              "english": [
                "Juwayriyah (RA) used to spend hours from Fajr until mid-morning in continuous Dhikr.",
                "The Prophet (ﷺ) taught her words that take little time but outweigh long hours of chanting in reward.",
                "This is a perfect example of the Prophet's 'Jawami' al-Kalim' (concise yet comprehensive speech)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کلمات کے معانی کی گہرائی",
        "english": "Depth of the Meanings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لامحدود تعداد کا ذکر",
              "english": "Mentioning Infinite Counts"
            },
            "content": {
              "urdu": [
                "اللہ کی مخلوق (انسان، فرشتے، جِن، چرند پرند) اتنی زیادہ ہے کہ اسے صرف اللہ ہی جانتا ہے، ان کی تعداد کے برابر تسبیح کا ثواب عظیم ہے۔",
                "عرشِ الہی کائنات کی سب سے بڑی اور بھاری مخلوق ہے، اس کے وزن کے برابر تسبیح اللہ کی عظمت کا اعتراف ہے۔",
                "اللہ کے کلمات (علم و حکمت) اتنے زیادہ ہیں کہ اگر سمندر سیاہی بن جائیں تو بھی وہ ختم نہیں ہو سکتے۔"
              ],
              "english": [
                "Allah's creation is so vast that only He knows the count; seeking reward equal to their number is immense.",
                "The Throne (Arsh) is the largest and heaviest of creations; praising Allah equal to its weight acknowledges His majesty.",
                "Allah's words (knowledge/wisdom) are so many that even if oceans were ink, they would run dry before His words ended."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ذکر کے فوائد",
        "english": "Benefits of the Remembrance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی بچت اور اجر کی کثرت",
              "english": "Time Efficiency and Reward Abundance"
            },
            "content": {
              "urdu": [
                "یہ ذکر مصروف لوگوں کے لیے اللہ کا خاص تحفہ ہے جو چند سیکنڈ میں کروڑوں تسبیحوں کا ثواب سمیٹنا چاہتے ہیں۔",
                "اس سے انسان کے دل میں اللہ کی ہیبت، قدرت اور اس کی وسعت کا احساس پیدا ہوتا ہے۔",
                "یہ کلمات پڑھنے والے کے میزانِ عمل کو بہت تیزی سے وزنی کر دیتے ہیں۔"
              ],
              "english": [
                "This Dhikr is a gift for busy people who wish to gather the reward of millions of praises in seconds.",
                "It instills a sense of Allah's awe, power, and vastness within the heart.",
                "These words rapidly increase the weight of one's scale of deeds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے لیے سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صبح و شام کا معمول",
              "english": "Morning and Evening Routine"
            },
            "content": {
              "urdu": [
                "سنت نبوی کے مطابق ان کلمات کو روزانہ صبح تین بار پڑھنا چاہیے (جیسا کہ سنن نسائی وغیرہ کی روایات میں ہے)۔",
                "صرف زبان سے کہنا کافی نہیں بلکہ ان الفاظ کی وسعت کا تصور بھی دل میں لانا چاہیے۔",
                "ذکرِ الہی میں 'کوالٹی' (اخلاص و گہرائی) 'کوانٹیٹی' (تعداد) سے زیادہ اہم ہو سکتی ہے۔"
              ],
              "english": [
                "Following the Sunnah, these words should be recited three times every morning (as noted in other narrations like An-Nasa'i).",
                "Uttering them with the tongue is not enough; one should visualize the vastness of these words in the heart.",
                "In the remembrance of Allah, 'quality' (sincerity/depth) can be more significant than 'quantity'."
              ]
            }
          }
        ]
      }
    }
  ]
}