{
  "hadithId": 994,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1144"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (4353)، والنسائي (4020)، والحاكم (4/367). وأصله في الصحيحين من حديث ابن مسعود.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (4353)، نسائی (4020) اور حاکم نے روایت کیا ہے۔ اس کی اصل صحیحین میں ابن مسعود رضی اللہ عنہ سے مروی ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (4353), An-Nasa'i (4020), and Al-Hakim (4/367). Its origin is in Bukhari and Muslim from the narration of Ibn Mas'ud."
  },
  "importantWords": [
    {
      "arabic": "لَا يَحِلُّ",
      "english": "Not Lawful",
      "urdu": "حلال نہیں"
    },
    {
      "arabic": "خِصَالٍ",
      "english": "Qualities / Cases",
      "urdu": "خصلتیں / صورتیں"
    },
    {
      "arabic": "زَانٍ مُحْصَنٌ",
      "english": "Married Adulterer",
      "urdu": "شادی شدہ زانی"
    },
    {
      "arabic": "مُتَعَمِّدًا",
      "english": "Intentionally",
      "urdu": "دیدہ دانستہ"
    },
    {
      "arabic": "يُصْلَبُ",
      "english": "Crucified",
      "urdu": "سولی دیا جائے"
    },
    {
      "arabic": "يُنْفَى",
      "english": "Exiled / Banished",
      "urdu": "جلا وطن کیا جائے"
    }
  ],
  "summary": {
    "urdu": "اسلام میں انسانی جان کی حرمت بہت زیادہ ہے، صرف تین مخصوص بڑے جرائم (زنا، قتلِ عمد، اور ارتداد و بغاوت) پر ہی قانونی سزا کے طور پر جان لی جا سکتی ہے۔",
    "english": "Human life is sacred in Islam; capital punishment is reserved only for three major crimes: adultery by a married person, intentional murder, and apostasy involving rebellion."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (4353)",
      "english": "Sunan Abu Dawud (4353)"
    },
    {
      "arabic": "سنن النسائي (4020)",
      "english": "Sunan An-Nasa'i (4020)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=M5uNn_o7Muo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انسانی جان کی حرمت",
        "english": "Sanctity of Human Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جان کی حفاظت کا اصول",
              "english": "Principle of Protecting Life"
            },
            "content": {
              "urdu": [
                "اسلام میں ایک مسلمان کی جان، مال اور عزت کو مکمل تحفظ حاصل ہے۔",
                "بلاوجہ کسی کا خون بہانا پوری انسانیت کے قتل کے برابر قرار دیا گیا ہے۔",
                "قانون کی گرفت صرف ان صورتوں میں ہوتی ہے جہاں معاشرتی امن داؤ پر ہو۔"
              ],
              "english": [
                "In Islam, a Muslim's life, property, and honor are fully protected.",
                "Shedding blood without cause is equivalent to killing all of humanity.",
                "Legal action is only taken when social peace and stability are at stake."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزائے موت کے حدود",
              "english": "Limits of Capital Punishment"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ سزائے موت صرف مخصوص سنگین جرائم پر ہے۔",
                "ان سزاؤں کا مقصد معاشرے میں عبرت پیدا کرنا اور برائی کو روکنا ہے۔",
                "اسلامی ریاست کے علاوہ کسی فرد کو قانون ہاتھ میں لینے کی اجازت نہیں۔"
              ],
              "english": [
                "This Hadith clarifies that the death penalty is limited to specific grave crimes.",
                "These punishments aim to deter crime and maintain social morality.",
                "No individual is allowed to take the law into their own hands outside the state."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قتلِ عمد اور قصاص",
        "english": "Intentional Murder and Retaliation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدل کا تقاضا",
              "english": "Requirement of Justice"
            },
            "content": {
              "urdu": [
                "جان کے بدلے جان کا اصول معاشرے میں امن کی ضمانت فراہم کرتا ہے۔",
                "جب قاتل کو معلوم ہوگا کہ اسے قتل کیا جائے گا، تو وہ باز رہے گا۔",
                "قصاص کا قانون مقتول کے ورثاء کو انصاف کی فراہمی یقینی بناتا ہے۔"
              ],
              "english": [
                "The principle of 'a life for a life' guarantees peace in society.",
                "When a murderer knows they face death, they are deterred from the act.",
                "The law of Qisas ensures justice for the victim's family."
              ]
            }
          },
          {
            "title": {
              "urdu": "معافی کی گنجائش",
              "english": "Room for Forgiveness"
            },
            "content": {
              "urdu": [
                "اگرچہ قصاص حق ہے، مگر قرآن نے معاف کرنے کو افضل قرار دیا ہے۔",
                "ورثاء دیت (خون بہا) لے کر یا فی سبیل اللہ معاف کر سکتے ہیں۔",
                "یہ پہلو اسلامی قانون میں رحم اور اصلاح کے دروازے کھولتا ہے۔"
              ],
              "english": [
                "While Qisas is a right, the Quran encourages forgiveness as superior.",
                "Heirs can accept Diyat (blood money) or forgive for the sake of Allah.",
                "This aspect opens doors for mercy and reform within Islamic law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عصمت دری اور فتنہ",
        "english": "Adultery and Social Mischief"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی نظام کی حفاظت",
              "english": "Protection of the Family System"
            },
            "content": {
              "urdu": [
                "شادی شدہ ہونے کے باوجود زنا کرنا خاندانی بنیادوں کو ہلا دیتا ہے۔",
                "رجم کی سزا کا مقصد نسب کی حفاظت اور معاشرتی پاکیزگی ہے۔",
                "یہ سزا اس وقت لاگو ہوتی ہے جب جرم مکمل طور پر ثابت ہو جائے۔"
              ],
              "english": [
                "Committing adultery while married shatters the foundations of the family.",
                "The punishment of stoning aims to protect lineage and social purity.",
                "This penalty is applied only when the crime is proven beyond doubt."
              ]
            }
          },
          {
            "title": {
              "urdu": "سخت سزا کی حکمت",
              "english": "Wisdom Behind Severe Punishment"
            },
            "content": {
              "urdu": [
                "سخت سزا کا خوف فحاشی کے سیلاب کو روکنے کے لیے ضروری ہے۔",
                "اسلام گناہ سے پہلے اس کے اسباب کو روکنے پر زور دیتا ہے۔",
                "معاشرے کی اخلاقی صحت برقرار رکھنے کے لیے یہ حدود لازم ہیں۔"
              ],
              "english": [
                "The fear of severe punishment is necessary to stop the spread of immorality.",
                "Islam emphasizes blocking the paths leading to sin before it occurs.",
                "These limits are essential to maintain the moral health of society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ارتداد اور بغاوت",
        "english": "Apostasy and Rebellion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ریاست کے خلاف جنگ",
              "english": "War Against the State"
            },
            "content": {
              "urdu": [
                "حدیث میں 'محاربہ' (اللہ اور رسول سے لڑنا) کا ذکر بغاوت کی عکاسی کرتا ہے۔",
                "جو شخص دین چھوڑ کر اسلامی ریاست کے خلاف ہتھیار اٹھائے وہ واجب القتل ہے۔",
                "اس سزا کا مقصد ریاست کی سالمیت اور فتنہ و فساد کا خاتمہ ہے۔"
              ],
              "english": [
                "The mention of 'Muharabah' reflects rebellion against Islamic authority.",
                "One who leaves the faith and takes up arms against the state faces execution.",
                "The goal is to preserve state integrity and eliminate civil strife."
              ]
            }
          },
          {
            "title": {
              "urdu": "سزاؤں کا تنوع",
              "english": "Diversity of Penalties"
            },
            "content": {
              "urdu": [
                "جرم کی نوعیت کے لحاظ سے قتل، سولی یا جلا وطنی کی سزائیں ہیں۔",
                "جلا وطنی کا مقصد مجرم کو معاشرے سے دور کر کے فتنہ روکنا ہے۔",
                "یہ سزائیں حاکمِ وقت کی صوابدید پر جرم کی شدت کے مطابق ہوتی ہیں۔"
              ],
              "english": [
                "Penalties include death, crucifixion, or exile depending on the crime's nature.",
                "Exile serves to stop mischief by removing the criminal from society.",
                "These sentences are applied by the ruler based on the severity of the act."
              ]
            }
          }
        ]
      }
    }
  ]
}