{
  "hadithId": 451,
  "hadithNo": 27,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1331",
      "https://sunnah.com/muslim:964"
    ],
    "kitabId": 3,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجنائز",
    "babId": 28
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1331)، ومسلم (964). واللفظ يوضح السنة في موقف الإمام من جنازة المرأة.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (1331) اور امام مسلم (964) نے روایت کیا ہے۔ یہ حدیث عورت کے جنازے میں امام کے کھڑے ہونے کی جگہ کی وضاحت کرتی ہے۔",
    "english": "Authentic. Reported by Al-Bukhari (1331) and Muslim (964). The wording clarifies the Sunnah regarding the Imam's position during the funeral prayer for a woman."
  },
  "importantWords": [
    {
      "arabic": "صَلَّيْتُ",
      "english": "I prayed",
      "urdu": "میں نے نماز پڑھی"
    },
    {
      "arabic": "وَرَاءَ",
      "english": "Behind",
      "urdu": "پیچھے"
    },
    {
      "arabic": "نِفَاسِهَا",
      "english": "Childbirth / Post-natal",
      "urdu": "اس کا نفاس (زچگی)"
    },
    {
      "arabic": "وَسْطَهَا",
      "english": "Her waist / middle",
      "urdu": "اس کے درمیان میں"
    },
    {
      "arabic": "فَقَامَ",
      "english": "He stood",
      "urdu": "وہ کھڑے ہوئے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ جب نبی کریم ﷺ نے ایک ایسی عورت کا جنازہ پڑھایا جو زچگی کے دوران فوت ہوئی تھی، تو آپ ﷺ اس کے جسم کے درمیانی حصے (کمر) کے سامنے کھڑے ہوئے۔",
    "english": "This Hadith states that when the Prophet (ﷺ) led the funeral prayer for a woman who died in childbirth, he stood opposite the middle of her body (the waist)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1331)",
      "english": "Sahih al-Bukhari (1331)"
    },
    {
      "arabic": "صحيح مسلم (964)",
      "english": "Sahih Muslim (964)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FOf6TfN1Kic",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "امام کے کھڑے ہونے کی جگہ",
        "english": "The Imam's Position in Janazah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عورت کے جنازے کا طریقہ",
              "english": "Procedure for a Woman's Funeral"
            },
            "content": {
              "urdu": [
                "سنت یہ ہے کہ عورت کے جنازے میں امام اس کے درمیان (کمر) کے سامنے کھڑا ہو۔",
                "یہ طریقہ مرد کے جنازے سے مختلف ہے جہاں امام میت کے سر کے پاس کھڑا ہوتا ہے۔",
                "اس نبوی عمل کی پیروی کرنا تمام مسلمانوں کے لیے باعثِ برکت اور اتباعِ سنت ہے۔"
              ],
              "english": [
                "The Sunnah is for the Imam to stand opposite the waist of a woman's body.",
                "This differs from a man's funeral where the Imam stands near the head.",
                "Following this Prophetic action brings blessings and fulfills the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "ستر اور پردہ داری",
              "english": "Privacy and Modesty"
            },
            "content": {
              "urdu": [
                "عورت کے درمیان میں کھڑے ہونے کی ایک حکمت اس کی پردہ پوشی اور ستر کا لحاظ ہے۔",
                "اسلام نے زندگی اور موت دونوں حالتوں میں عورت کی پردہ داری کی اہمیت پر زور دیا ہے۔",
                "امام کا یہ مقام میت کے جسم کی ساخت کو صفوں سے چھپانے میں مددگار ہوتا ہے۔"
              ],
              "english": [
                "One wisdom behind standing in the middle is to ensure modesty for the deceased.",
                "Islam emphasizes the privacy of a woman in both life and death.",
                "This position of the Imam helps in obscuring the body's form from the rows."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حالتِ نفاس میں وفات",
        "english": "Death During Childbirth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شہادت کا درجہ",
              "english": "Rank of Martyrdom"
            },
            "content": {
              "urdu": [
                "جو عورت زچگی یا نفاس کی حالت میں فوت ہو جائے اسے شہید کا درجہ ملتا ہے۔",
                "نبی کریم ﷺ نے ایسی عورتوں کے لیے بڑی فضیلت اور اجر کی خوشخبری سنائی ہے۔",
                "اگرچہ وہ حکمی شہید ہے، مگر اس کا غسل اور نمازِ جنازہ عام میت کی طرح ہوگا۔"
              ],
              "english": [
                "A woman who dies during childbirth or post-natal period is considered a martyr.",
                "The Prophet (ﷺ) announced great virtues and rewards for such women.",
                "Though she is a legal martyr, she is still washed and prayed over like others."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی رحمت کا ظہور",
              "english": "Manifestation of Allah's Mercy"
            },
            "content": {
              "urdu": [
                "اسلام نے ماں کے درجے کو اس کی قربانیوں کی وجہ سے بہت بلند کیا ہے۔",
                "بچے کی پیدائش کے عمل میں جان دینا اللہ کے ہاں انتہائی قدر والا عمل ہے۔",
                "ایسی میت پر نمازِ جنازہ ان کے بلند درجات کی دعا اور شفاعت کا ذریعہ ہے۔"
              ],
              "english": [
                "Islam has elevated the status of mothers due to their immense sacrifices.",
                "Giving one's life during childbirth is highly valued in the sight of Allah.",
                "The funeral prayer for her is a means of intercession for her high ranks."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل و ابحاث",
        "english": "Juristic Issues and Discussions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف ائمہ کی آراء",
              "english": "Opinions of Different Imams"
            },
            "content": {
              "urdu": [
                "امام شافعی، احمد اور اسحاق بن راہویہ اسی حدیث کے مطابق عمل کے قائل ہیں۔",
                "ان کے نزدیک مرد کے سر کے پاس اور عورت کے درمیان میں کھڑا ہونا سنت ہے۔",
                "یہ تفریق سنتِ نبوی سے ثابت ہے اور اسی پر عمل کرنا افضل ہے۔"
              ],
              "english": [
                "Imams Shafi'i, Ahmad, and Ishaq act according to this specific Hadith.",
                "They hold that standing by the man's head and the woman's waist is Sunnah.",
                "This distinction is proven by Prophetic practice and is the superior way."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنازے کی ترتیب",
              "english": "Order of the Funeral"
            },
            "content": {
              "urdu": [
                "اگر مرد اور عورت کے جنازے ایک ساتھ ہوں تو مرد کو امام کے قریب رکھا جائے گا۔",
                "عورت کے جنازے کو قبلہ کی طرف مرد کے آگے رکھا جاتا ہے۔",
                "امام مرد کے سر اور عورت کی کمر کی سیدھ میں کھڑا ہو کر نماز پڑھائے گا۔"
              ],
              "english": [
                "If male and female funerals are combined, the male is placed near the Imam.",
                "The female body is placed further towards the Qiblah in front of the male.",
                "The Imam stands aligned with the man's head and the woman's waist."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی و اخلاقی پہلو",
        "english": "Educational and Moral Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اتباعِ سنت کا جذبہ",
              "english": "Zeal for Following the Sunnah"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے نبی ﷺ کی ہر حرکت اور مقام کا باریک بینی سے مشاہدہ کیا۔",
                "سمرہ بن جندب رضی اللہ عنہ کا یہ بیان سنت کو محفوظ کرنے کی کوشش ہے۔",
                "مسلمانوں کو چاہیے کہ وہ ہر عبادت میں سنتِ صحیحہ کے مطابق عمل کریں۔"
              ],
              "english": [
                "The Companions minutely observed every action and position of the Prophet (ﷺ).",
                "This report by Samurah (RA) is an effort to preserve the authentic Sunnah.",
                "Muslims should strive to perform every act of worship according to the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کی تیاری اور دعا",
              "english": "Preparation for Death and Prayer"
            },
            "content": {
              "urdu": [
                "موت کسی بھی وقت آسکتی ہے، اس لیے نیک اعمال کی فکر کرنی چاہیے۔",
                "جنازے میں شرکت کرنا میت کے حق میں دعا اور زندہ کے لیے عبرت ہے۔",
                "اسلامی طریقے سے جنازہ پڑھنا میت کے حقوق کی ادائیگی کا اہم جز ہے۔"
              ],
              "english": [
                "Death can come at any time, so one must focus on righteous deeds.",
                "Attending a funeral is a prayer for the dead and a lesson for the living.",
                "Performing the Janazah in the Islamic way is vital for fulfilling the dead's rights."
              ]
            }
          }
        ]
      }
    }
  ]
}