{
  "hadithId": 877,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/76"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1442)، وأحمد (6/434)، وأبو داود (3881)، والترمذي (2087)، والنسائي (3328)، وابن ماجه (2011).",
    "urdu": "صحیح۔ اسے امام مسلم (1442) نے روایت کیا ہے۔ اس کے علاوہ احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے بھی اسے نقل کیا ہے۔",
    "english": "Sahih. Reported by Muslim (1442), Ahmad, Abu Dawud, At-Tirmidhi, An-Nasa'i, and Ibn Majah."
  },
  "importantWords": [
    {
      "arabic": "الْغِيلَةِ",
      "english": "Lactation Intercourse",
      "urdu": "دورانِ رضاعت ہمبستری"
    },
    {
      "arabic": "هَمَمْتُ",
      "english": "I intended",
      "urdu": "میں نے ارادہ کیا"
    },
    {
      "arabic": "يُغِيلُونَ",
      "english": "Practice Ghalah",
      "urdu": "وہ غیلہ کرتے ہیں"
    },
    {
      "arabic": "الْعَزْلِ",
      "english": "Coitus interruptus",
      "urdu": "عزل / باہر انزال کرنا"
    },
    {
      "arabic": "الْوَأْدُ",
      "english": "Burying alive",
      "urdu": "زندہ درگور کرنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں دورانِ رضاعت ہمبستری کے جواز اور عزل (مانع حمل طریقے) کے بارے میں نبوی نقطہ نظر بیان کیا گیا ہے۔",
    "english": "This Hadith discusses the permissibility of intercourse during lactation and the Prophet's perspective on coitus interruptus as a hidden form of preventing life."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1442)",
      "english": "Sahih Muslim (1442)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جذامة بنت وهب الأسدية",
        "english": "Judamah bint Wahb al-Asadiyyah"
      },
      "slug": "judamah-bint-wahb"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T0E69_Lmo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "غیلہ کا تصور اور حکم",
        "english": "Concept and Ruling of Ghalah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غیلہ کی تعریف",
              "english": "Definition of Ghalah"
            },
            "content": {
              "urdu": [
                "غیلہ سے مراد وہ ہمبستری ہے جو اس وقت کی جائے جب بیوی بچے کو دودھ پلا رہی ہو۔",
                "قدیم عربوں کا خیال تھا کہ اس سے دودھ خراب ہوتا ہے اور بچہ کمزور ہو جاتا ہے۔",
                "نبی کریم ﷺ نے اس وہم کو دور کیا کہ یہ عمل بچے کے لیے نقصان دہ ہے۔"
              ],
              "english": [
                "Ghalah refers to having intercourse with a wife while she is still breastfeeding a child.",
                "Ancient Arabs believed this spoiled the milk and physically weakened the nursing infant.",
                "The Prophet (ﷺ) debunked this myth by observing that other nations practiced it without harm."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر اقوام کا مشاہدہ",
              "english": "Observation of Other Nations"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے روم اور فارس کی مثال دی کہ وہ یہ عمل کرتے ہیں اور ان کی اولاد مضبوط ہے۔",
                "اس سے معلوم ہوا کہ طب اور صحت کے معاملات میں تجربات اور مشاہدات کی اہمیت ہے۔",
                "اسلام نے صرف ان چیزوں سے روکا ہے جو حقیقتاً انسانیت کے لیے مضر ہوں۔"
              ],
              "english": [
                "The Prophet (ﷺ) cited the Romans and Persians, noting their healthy children despite the practice.",
                "This indicates the importance of empirical observation and experience in health-related matters.",
                "Islam only prohibits matters that are genuinely harmful to human life or well-being."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عزل کے احکام",
        "english": "Rulings on Azl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خفیہ زندہ درگور کرنا",
              "english": "Hidden Burying Alive"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے عزل کو 'خفیہ زندہ درگور کرنا' فرمایا کیونکہ اس سے استقرارِ حمل کو روکا جاتا ہے۔",
                "یہ الفاظ عزل کی ناپسندیدگی کی طرف اشارہ کرتے ہیں مگر یہ قطعی حرام نہیں ہے۔",
                "زمانہ جاہلیت میں پیدا ہونے والی بچیوں کو قتل کیا جاتا تھا، عزل اس کا ایک معنوی متبادل ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) termed Azl as 'hidden burying alive' as it prevents the potential for life.",
                "These words indicate a level of dislike (Karahah) although it is not strictly prohibited.",
                "In Jahiliyyah, daughters were physically buried; Azl is metaphorically linked to preventing birth."
              ]
            }
          },
          {
            "title": {
              "urdu": "عزل کی گنجائش",
              "english": "Permissibility of Azl"
            },
            "content": {
              "urdu": [
                "دیگر احادیث کی روشنی میں عزل کی اجازت ضرورت کے وقت دی گئی ہے۔",
                "اگر بیوی کی صحت کا مسئلہ ہو یا کوئی اور معقول عذر ہو تو اسے اپنایا جا سکتا ہے۔",
                "تاہم، اولاد کی کثرت کو اسلام میں پسندیدہ عمل قرار دیا گیا ہے۔"
              ],
              "english": [
                "In light of other narrations, Azl is permitted when there is a valid necessity.",
                "It can be adopted if the wife's health is at risk or for other legitimate reasons.",
                "However, having many children is generally encouraged and preferred in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طبی و شرعی حکمت",
        "english": "Medical and Sharia Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ماں اور بچے کی صحت",
              "english": "Health of Mother and Child"
            },
            "content": {
              "urdu": [
                "دورانِ رضاعت حمل ٹھہرنے سے دودھ کی مقدار اور معیار پر اثر پڑ سکتا ہے۔",
                "شریعت نے مرد کو حکم دیا ہے کہ وہ اپنی خواہش کے ساتھ ساتھ بیوی کی صحت کا بھی لحاظ رکھے۔",
                "بچوں کے درمیان مناسب وقفہ ان کی بہتر پرورش کے لیے مفید ثابت ہوتا ہے۔"
              ],
              "english": [
                "Becoming pregnant while breastfeeding may affect the quality and quantity of the milk.",
                "Sharia commands the husband to consider his wife's health alongside his own desires.",
                "Appropriate spacing between children is beneficial for their proper physical upbringing."
              ]
            }
          },
          {
            "title": {
              "urdu": "توہم پرستی کا رد",
              "english": "Refutation of Superstition"
            },
            "content": {
              "urdu": [
                "عربوں کا یہ عقیدہ کہ غیلہ سے بچہ 'گھوڑے سے گر جائے گا' محض وہم تھا۔",
                "اسلام نے عقل اور مشاہدے کی بنیاد پر غلط عقائد کی اصلاح فرمائی۔",
                "دینِ فطرت ہونے کی وجہ سے اسلام بلاوجہ کی سختیوں کو ختم کرتا ہے۔"
              ],
              "english": [
                "The Arab belief that Ghalah causes a child to 'fall off a horse' later in life was a myth.",
                "Islam corrected false beliefs based on reasoning and actual human observation.",
                "As a religion of nature, Islam removes unnecessary hardships and false restrictions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سائنسی مشاہدے کی اہمیت",
              "english": "Importance of Scientific Observation"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا دیگر اقوام کے تجربات سے فائدہ اٹھانا مسلمانوں کے لیے ایک بڑی دلیل ہے۔",
                "مسلمانوں کو دنیا کے مفید علوم اور تجربات سے پیچھے نہیں رہنا چاہیے۔",
                "حق بات جہاں سے بھی ملے اسے قبول کرنا مومن کی صفت ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) use of other nations' experiences is a significant precedent for Muslims.",
                "Muslims should not lag behind in acquiring beneficial worldy knowledge and sciences.",
                "Accepting truth regardless of its source is a primary characteristic of a believer."
              ]
            }
          },
          {
            "title": {
              "urdu": "نکاح کے مقاصد",
              "english": "Objectives of Marriage"
            },
            "content": {
              "urdu": [
                "نکاح کا ایک بڑا مقصد نسلِ انسانی کا تسلسل اور صالح اولاد کا حصول ہے۔",
                "بلاوجہ مانع حمل طریقے اپنانا اسلامی مزاج کے خلاف ہے۔",
                "خاندانی منصوبہ بندی صرف حقیقی طبی ضرورت کی بنیاد پر ہونی چاہیے۔"
              ],
              "english": [
                "A major objective of marriage is the continuity of the human race and raising righteous offspring.",
                "Adopting birth control without a valid reason goes against the Islamic spirit.",
                "Family planning should be based primarily on genuine medical or physical necessity."
              ]
            }
          }
        ]
      }
    }
  ]
}