{
  "hadithId": 363,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/2/417"
    ],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
  
  "takhreej": {
    "arabic": "حديث ابن عباس ضعيف لضعف مجالد بن سعيد، لكن معناه صحيح وتؤيده رواية أبي هريرة المتفق عليها (البخاري 934، مسلم 851).",
    "urdu": "ابن عباس کی روایت مجالد بن سعید کی وجہ سے ضعیف ہے، مگر اس کا مفہوم صحیح ہے جس کی تائید بخاری (934) اور مسلم (851) کی ابوہریرہ والی صحیح حدیث سے ہوتی ہے۔",
    "english": "The narration of Ibn 'Abbas is weak due to Mujalid bin Sa'id, but its meaning is supported by the authentic Hadith of Abu Hurayrah in Bukhari (934) and Muslim (851)."
  },
  "importantWords": [
    {
      "arabic": "يَخْطُبُ",
      "english": "Delivering sermon",
      "urdu": "خطبہ دے رہا ہو"
    },
    {
      "arabic": "أَسْفَارًا",
      "english": "Large books",
      "urdu": "بڑی کتابیں"
    },
    {
      "arabic": "أَنْصِتْ",
      "english": "Be quiet / Listen",
      "urdu": "خاموش رہو"
    },
    {
      "arabic": "لَغَوْتَ",
      "english": "Engaged in idle talk",
      "urdu": "لغو کام کیا"
    },
    {
      "arabic": "الْحِمَارِ",
      "english": "Donkey",
      "urdu": "گدھا"
    }
  ],
  "summary": {
    "urdu": "خطبہ جمعہ کے دوران بات کرنا یا دوسروں کو خاموش کرانے کے لیے زبان استعمال کرنا منع ہے، ایسا کرنے سے جمعہ کا ثواب ضائع ہو جاتا ہے۔",
    "english": "Talking during the Friday sermon or using speech to silence others is forbidden; doing so invalidates the special reward of the Jumu'ah prayer."
  },
  "references": [
    {
      "arabic": "مسند أحمد (2033)",
      "english": "Musnad Ahmad (2033)"
    },
    {
      "arabic": "صحيح البخاري (934)",
      "english": "Sahih Bukhari (934)"
    },
    {
      "arabic": "صحيح مسلم (851)",
      "english": "Sahih Muslim (851)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس رضي الله عنهما",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=7u3C8M0kO78",
  "grade": {
    "arabic": "صحيح (بشواهده)",
    "english": "Sahih (With corroborating evidence)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خطبہ کے دوران خاموشی کا حکم",
        "english": "Obligation of Silence during Khutbah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بات کرنے کی ممانعت",
              "english": "Prohibition of Speaking"
            },
            "content": {
              "urdu": [
                "امام جب خطبہ دے رہا ہو تو ہر قسم کی گفتگو کرنا حرام ہے۔",
                "ایسا کلام جو عام حالات میں جائز ہو وہ بھی خطبہ میں منع ہے۔",
                "خاموشی کا مقصد خطبہ کو مکمل توجہ اور غور سے سننا ہے۔"
              ],
              "english": [
                "It is forbidden to engage in any form of talk while the Imam is preaching.",
                "Even speech that is permissible otherwise is prohibited during the Khutbah.",
                "The purpose of silence is to listen to the sermon with full focus and care."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوسروں کو خاموش کرانا",
              "english": "Silencing Others Verbally"
            },
            "content": {
              "urdu": [
                "اگر کوئی دوسرا بات کرے تو اسے زبان سے روکنا بھی منع ہے۔",
                "روکنے والے کو چاہیے کہ وہ صرف اشارے سے خاموش ہونے کا کہے۔",
                "زبان کا استعمال کرنے والا خود لغو کام کرنے والا قرار دیا جاتا ہے۔"
              ],
              "english": [
                "If someone else speaks, silencing them with words is also prohibited.",
                "One should use only gestures or signs to signal someone to be quiet.",
                "Using words to silence others makes the person an engager in idle talk."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لغو اور بے فائدہ عمل کی وعید",
        "english": "Warning against Idle Actions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گدھے کی مثال کی حکمت",
              "english": "Wisdom of the Donkey Metaphor"
            },
            "content": {
              "urdu": [
                "بات کرنے والا اس گدھے کی طرح ہے جو کتابیں اٹھائے فائدہ نہیں پاتا۔",
                "وہ مجلسِ علم میں موجود تو ہے مگر علم سے محروم رہتا ہے۔",
                "یہ مثال انسان کو اپنی حالت پر غور کرنے کی دعوت دیتی ہے۔"
              ],
              "english": [
                "The speaker is likened to a donkey carrying books without gaining benefit.",
                "They are present in a gathering of knowledge but remain deprived of it.",
                "This metaphor invites humans to reflect deeply on their own state."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمعہ کے ثواب کی محرومی",
              "english": "Deprivation of Jumu'ah Reward"
            },
            "content": {
              "urdu": [
                "لغو بات کرنے سے جمعہ کا مخصوص اور کامل ثواب ختم ہو جاتا ہے۔",
                "اس کی نمازِ جمعہ تو ہو جائے گی مگر وہ فضیلت نہیں پائے گا۔",
                "عبادت کے آداب کی خلاف ورزی اجر و ثواب میں کمی لاتی ہے۔"
              ],
              "english": [
                "Engaging in idle talk destroys the specific and complete reward of Jumu'ah.",
                "The prayer will be valid, but the person loses the spiritual excellence.",
                "Violating the etiquettes of worship leads to a reduction in divine reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور باریکیاں",
        "english": "Juristic Aspects and Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لغو کا معنی و مفہوم",
              "english": "Meaning of Laghw (Idle Talk)"
            },
            "content": {
              "urdu": [
                "لغو سے مراد ہر وہ کلام ہے جو خطبہ کی سماعت میں مخل ہو۔",
                "فقہاء کے نزدیک اس میں کنکریاں ہلانا یا موبائل استعمال کرنا بھی شامل ہے۔",
                "ہر وہ عمل لغو ہے جو انسان کی توجہ امام کے کلام سے ہٹا دے۔"
              ],
              "english": [
                "Laghw refers to any speech that interferes with listening to the Khutbah.",
                "Scholars include playing with pebbles or using phones in this category.",
                "Any action that distracts the listener from the Imam's words is idle talk."
              ]
            }
          },
          {
            "title": {
              "urdu": "سلام اور چھینک کا جواب",
              "english": "Responding to Salam and Sneezing"
            },
            "content": {
              "urdu": [
                "خطبہ کے دوران سلام کا جواب دینا بھی بعض علماء کے نزدیک منع ہے۔",
                "اسی طرح چھینکنے والے کو 'یرحمک اللہ' کہنا بھی خاموشی کے خلاف ہے۔",
                "احتیاط اسی میں ہے کہ خطبہ کے دوران مکمل سکوت اختیار کیا جائے۔"
              ],
              "english": [
                "Responding to Salam during the Khutbah is prohibited according to many.",
                "Similarly, saying 'YarhamukAllah' to a sneezer violates the required silence.",
                "Precaution lies in maintaining absolute silence during the entire sermon."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور تربیت",
        "english": "Practical Lessons and Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی تربیت",
              "english": "Training in Discipline"
            },
            "content": {
              "urdu": [
                "جمعہ کا دن مسلمانوں کے لیے ہفتہ وار تربیتی اور اصلاحی دن ہے۔",
                "خاموشی کی پابندی سے انسان کے اندر ضبطِ نفس پیدا ہوتا ہے۔",
                "یہ عمل ہمیں دوسروں کے حقوق اور اجتماعیت کا احترام سکھاتا ہے۔"
              ],
              "english": [
                "Friday is a weekly training and reformation day for all Muslims.",
                "Adhering to silence helps develop self-discipline within a person.",
                "This practice teaches us to respect the rights of others and the assembly."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطبہ کی اہمیت کا ادراک",
              "english": "Realizing the Importance of Khutbah"
            },
            "content": {
              "urdu": [
                "خطبہ ذکر اللہ ہے، اس کی بے ادبی سے بچنا ہر مومن پر لازم ہے۔",
                "باتیں کرنے سے نہ صرف اپنا بلکہ دوسروں کا بھی حرج ہوتا ہے۔",
                "اللہ کے کلام اور نصیحت کو پوری عظمت کے ساتھ سننا ایمان ہے۔"
              ],
              "english": [
                "The sermon is a form of Dhikr; avoiding its disrespect is mandatory.",
                "Talking causes a loss not only for oneself but also for those nearby.",
                "Listening to Allah's words and advice with full reverence is true faith."
              ]
            }
          }
        ]
      }
    }
  ]
}