{
  "hadithId": 77,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [
      "abudawud:19",
      "tirmidhi:1746",
      "nisa'i:178",
      "ibnmajah:303"
    ],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": " منكر . رواه أبو داود (19) ، والترمذي (1746) ، والنسائي (1/178) ، وابن ماجه (303) . وقد حكم عليه بالنكارة والضعف الأئمة لعلة تتعلق بلفظ اسم الله على الخاتم.",
    "urdu": "یہ روایت **منکر (ناقابل قبول)** ہے۔ اسے ابوداؤد (19)، ترمذی (1746)، نسائی (1/178)، اور ابن ماجہ (303) نے روایت کیا ہے۔ ائمہ حدیث نے اس انگوٹھی پر اللہ کا نام کندہ ہونے کی وجہ سے اسے ضعیف اور منکر قرار دیا ہے۔",
    "english": "Munkar (Rejected/Very Weak). Reported by Abu Dawud (19), At-Tirmidhi (1746), An-Nasa'i (1/178), and Ibn Majah (303). Leading Imams ruled it as Munkar and weak due to a hidden defect (Illah) relating to the engraving of Allah's Name on the ring."
  },
  "importantWords": [
    {
      "arabic": "دَخَلَ",
      "english": "He entered",
      "urdu": "داخل ہوئے"
    },
    {
      "arabic": "اَلْخَلَاءَ",
      "english": "The toilet/lavatory",
      "urdu": "قضائے حاجت کی جگہ"
    },
    {
      "arabic": "وَضَعَ",
      "english": "He removed/put down",
      "urdu": "اتار دیا"
    },
    {
      "arabic": "خَاتَمَهُ",
      "english": "His ring",
      "urdu": "اپنی انگوٹھی"
    },
    {
      "arabic": "مَعْلُول",
      "english": "Defective (Hadith term)",
      "urdu": "علت والا / ضعیف"
    },
    {
      "arabic": "اَلْأَرْبَعَةُ",
      "english": "The Four (Sunan compilers)",
      "urdu": "سنن کے چار ائمہ"
    },
    {
      "arabic": "اَلنَّجَاسَة",
      "english": "Impurity",
      "urdu": "نجاست"
    },
    {
      "arabic": "اَلطَّهَارَة",
      "english": "Purity",
      "urdu": "طہارت"
    },
    {
      "arabic": "أَدَب",
      "english": "Etiquette",
      "urdu": "ادب"
    },
    {
      "arabic": "لَفْظِ",
      "english": "Wording/Phrase",
      "urdu": "لفظ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے لیے بیت الخلاء میں داخل ہونے سے پہلے انگوٹھی اتارنے کے آداب سے متعلق ہے، جس کا مقصد اللہ کے نام کی توہین سے بچنا تھا جو انگوٹھی پر کندہ تھا۔",
    "english": "This Hadith addresses the etiquette of removing one's ring before entering the lavatory, primarily to avoid disrespecting the Name of Allah, which was engraved on the Prophet's (PBUH) ring."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (19)",
      "english": "Reported by Abu Dawud (No. 19)"
    },
    {
      "arabic": "رواه الترمذي (1746)",
      "english": "Reported by At-Tirmidhi (No. 1746)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَنَسِ بْنِ مَالِكٍ  - رضى الله عنه",
        "english": "Anas ibn Malik (May Allah be pleased with him)"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "منكر / معلول",
    "english": "Munkar (Rejected) / Defective"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا حکم اور علت کا سبب",
        "english": "The Ruling of the Hadith and Reason for its Defect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انگوٹھی اتارنے کی وجہ",
              "english": "Reason for Removing the Ring"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی پر 'محمد رسول اللہ' کندہ تھا، جس میں اللہ کا نام موجود تھا۔",
                "یہ عمل اس بات کے ادب میں تھا کہ اللہ کا نام نجاست کی جگہ پر نہ لے جایا جائے، تاکہ تقدس برقرار رہے۔",
                "یہ حکم صرف اس انگوٹھی کے لیے تھا جس پر اللہ کا نام یا کوئی مقدس تحریر درج ہو، عام انگوٹھی کے لیے نہیں۔"
              ],
              "english": [
                "The Prophet's (PBUH) ring was engraved with 'Muhammad Rasool Allah', containing the Name of Allah.",
                "This action was an act of etiquette, ensuring the Name of Allah was not taken into a place of impurity, thus maintaining its sanctity.",
                "This ruling applies only to rings engraved with Allah's Name or sacred texts, not to plain rings."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث کا درجہ: معلول/منکر",
              "english": "Hadith Grade: Defective/Rejected"
            },
            "content": {
              "urdu": [
                "بڑے محدثین نے اس روایت کو ضعیف یا 'منکر' (شدید ضعیف) قرار دیا ہے، جیسا کہ امام ابوداؤد نے خود اس کی علت بیان کی۔",
                "اس روایت میں بنیادی علت یہ ہے کہ ایک راوی نے اسے غلطی سے موقوف (صحابی کا قول) کے بجائے مرفوع (نبی کا قول) بنا دیا ہے۔",
                "صحیح قول یہ ہے کہ یہ ایک صحابی یا تابعی کا قول ہو سکتا ہے، نہ کہ نبی صلی اللہ علیہ وسلم کی حتمی سنت۔"
              ],
              "english": [
                "Major scholars of Hadith have ruled this narration weak or 'Munkar' (severely weak/rejected), as acknowledged by some of its narrators.",
                "The primary defect is that a narrator mistakenly attributed it to the Prophet (Marfu') when it may have been a saying of a Companion or Tabi'i (Mawquf).",
                "The correct view is that this advice likely stems from a Companion's or Successor's practice, not a firm Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور احتیاط",
        "english": "Juristic Disagreement and Precaution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیت الخلاء میں نامِ خدا",
              "english": "Allah's Name in the Lavatory"
            },
            "content": {
              "urdu": [
                "اس حدیث سے یہ عمومی اصول نکالا گیا کہ اللہ کے نام والی کوئی بھی چیز بیت الخلاء میں لے جانے سے پرہیز کرنا چاہیے۔",
                "اگرچہ یہ حدیث خود ضعیف ہے، لیکن اکثر فقہاء (جیسے حنفیہ) نے ادب اور احتیاط کے طور پر اس حکم کو اختیار کیا ہے۔",
                "تاہم، اگر انگوٹھی پر نامِ خدا غلاف میں یا ہاتھ کی ہتھیلی میں چھپا ہو تو علماء نے اسے جائز قرار دیا ہے۔"
              ],
              "english": [
                "A general principle is derived from this Hadith: anything bearing the Name of Allah should be avoided inside the toilet/lavatory.",
                "Although the Hadith itself is weak, most jurists (like the Hanafis) adopted this ruling as a measure of respect and precaution.",
                "However, scholars permit carrying the Name of Allah if it is covered (e.g., in a purse) or concealed in the palm of the hand."
              ]
            }
          },
          {
            "title": {
              "urdu": "انگوٹھی کے ساتھ نماز",
              "english": "Praying with the Ring"
            },
            "content": {
              "urdu": [
                "اگرچہ بیت الخلاء میں اسے اتارنا ادب کا تقاضا ہے، لیکن نماز میں اس انگوٹھی کو پہننے میں کوئی حرج نہیں ہے۔",
                "رسول اللہ صلی اللہ علیہ وسلم انگوٹھی پہنتے تھے اور اس کے ساتھ نماز بھی ادا کرتے تھے، اس لیے یہ سنت سے ثابت ہے۔",
                "یہی وجہ ہے کہ حکمِ وجوب کو چھوڑ کر، اسے مستحب یا ترکِ ادب سے بچنے کا عمل قرار دیا جاتا ہے۔"
              ],
              "english": [
                "While removing it in the lavatory is a matter of etiquette, there is no harm in wearing the ring while performing the prayer.",
                "The Prophet (PBUH) wore his ring and prayed with it, a practice confirmed by the Sunnah.",
                "This is why the act is considered recommended (Mustahabb) or an avoidance of disrespect, rather than an obligation (Wajib)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی کا ادب اور طہارت",
        "english": "Prophetic Etiquette and Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کے نام کی تعظیم",
              "english": "Reverence for Allah's Name"
            },
            "content": {
              "urdu": [
                "اس روایت کا بنیادی سبق یہ ہے کہ اللہ کے نام اور اس کے کلام کی ہر حال میں بے حد تعظیم کی جائے۔",
                "آپ صلی اللہ علیہ وسلم نے نجاست کی جگہ میں داخل ہونے سے پہلے بھی اس ادب کا لحاظ رکھا۔",
                "یہ سنت ہمیں سکھاتی ہے کہ دنیاوی استعمال کی چیزوں پر بھی دینی احترامات کو فوقیت دی جائے۔"
              ],
              "english": [
                "The core lesson of this narration is the immense reverence that must be shown to the Name of Allah and His Word in all circumstances.",
                "The Prophet (PBUH) observed this etiquette even before entering a place of impurity.",
                "This Sunnah teaches us to prioritize religious respect over all items of worldly use."
              ]
            }
          },
          {
            "title": {
              "urdu": "آدابِ خلاء کی اہمیت",
              "english": "Importance of Toilet Etiquette"
            },
            "content": {
              "urdu": [
                "طہارت اور نظافت اسلامی تعلیمات کا بنیادی جزو ہیں، جس کے آداب بہت تفصیل سے بیان کیے گئے ہیں۔",
                "قضائے حاجت کے دوران انگوٹھی اتارنا، اگرچہ ضعیف ہے، طہارت کے عمومی اصول کو تقویت دیتا ہے۔",
                "مسلمان کو اپنی روزمرہ کی زندگی میں بھی ان اسلامی آداب پر عمل پیرا ہونے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "Purity and cleanliness are fundamental components of Islamic teachings, with detailed etiquette provided for all aspects.",
                "Removing the ring during defecation, though weak, reinforces the general principle of ritual cleanliness.",
                "A Muslim should strive to adhere to these Islamic manners even in the most private aspects of daily life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دور حاضر کا اطلاق",
        "english": "Contemporary Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فون اور کاغذات",
              "english": "Phones and Papers"
            },
            "content": {
              "urdu": [
                "اس اصول کا اطلاق موبائل فونز یا دیگر کاغذات پر بھی ہوتا ہے جن پر قرآنی آیات یا اسماء حسنیٰ درج ہوں۔",
                "ان چیزوں کو بیت الخلاء میں لے جانے سے پرہیز کرنا ادب کا تقاضا ہے، خاص کر اگر وہ کھلے ہوں۔",
                "اگر کوئی چیز جیب میں محفوظ ہو اور ضرورت ہو تو علماء نے اس کی گنجائش دی ہے، مگر احتیاط افضل ہے۔"
              ],
              "english": [
                "This principle extends to modern objects like mobile phones or papers containing Qur'anic verses or the Names of Allah.",
                "It is a matter of etiquette to avoid taking such items into the lavatory, especially if they are exposed.",
                "If an item is securely covered in a pocket and necessary, scholars permit it, but precaution is best."
              ]
            }
          },
          {
            "title": {
              "urdu": "کمزور روایت پر عمل",
              "english": "Acting on a Weak Narration"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حدیث ضعیف ہے، فضائلِ اعمال (اعمال کی فضیلت) کے باب میں ضعیف حدیث پر عمل کی گنجائش موجود ہے۔",
                "یہ حکم طہارت کی شرط نہیں، بلکہ ادب اور فضیلت سے متعلق ہے، لہٰذا عمل کرنے میں کوئی حرج نہیں۔",
                "مسلمان کو اپنے رب کے نام کی تعظیم کے لیے ہر ممکن کوشش کرنی چاہیے، یہ ایمان کا حصہ ہے۔"
              ],
              "english": [
                "Even though this Hadith is weak, acting upon weak Ahadith is permissible in matters of *Fada'il al-A'mal* (virtues of deeds).",
                "Since this ruling pertains to etiquette and virtue, not obligatory purity, there is no harm in following it.",
                "A Muslim should strive to honor the Name of their Lord in every way possible, as this is part of faith."
              ]
            }
          }
        ]
      }
    }
  ]
}
