{
  "hadithId": 267,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1036",
      "https://sunnah.com/ibnmajah:1208"
    ],
    "kitabId": 2,
    "inKitabBab": 8,
    "arabicBook": "سنن أبي داود / سنن ابن ماجه",
    "babId": 18
  },
  
  "takhreej": {
    "arabic": "ضعيف جدا بهذا السند، لكن الحديث صححه الألباني بشواهده. مدار الحديث في سنن أبي داود (1036) وابن ماجه (1208) على جابر الجعفي وهو متروك. لكن وجد له متابع عند الطحاوي بسند صحيح كما ذكر الشيخ الألباني في 'الإرواء' وصححه.",
    "urdu": "اس سند کے ساتھ یہ ضعیف ہے کیونکہ اس کا دارومدار جابر الجعفی پر ہے جو متروک ہے۔ تاہم شیخ البانی نے طحاوی میں اس کا صحیح شاہد پایا ہے جس کی بنا پر یہ حدیث صحیح قرار پاتی ہے۔",
    "english": "Weak with this specific chain due to Jabir Al-Ju'fi. However, Sheikh Al-Albani found a supporting authentic chain (Mutabi') in Tahawi and classified the Hadith as Sahih (Authentic) based on supporting evidences."
  },
  "importantWords": [
    {
      "arabic": "فَاسْتَتَمَّ",
      "english": "Stood fully upright",
      "urdu": "مکمل سیدھا کھڑا ہو گیا"
    },
    {
      "arabic": "فَلْيَمْضِ",
      "english": "Let him proceed",
      "urdu": "وہ جاری رکھے"
    },
    {
      "arabic": "لَمْ يَسْتَتِمْ",
      "english": "Not fully upright",
      "urdu": "مکمل سیدھا نہیں ہوا"
    },
    {
      "arabic": "فَلْيَجْلِسْ",
      "english": "Let him sit",
      "urdu": "وہ بیٹھ جائے"
    },
    {
      "arabic": "لَا سَهْوَ",
      "english": "No Sahw (Prostration)",
      "urdu": "کوئی سجدہ سہو نہیں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث درمیانی تشہد بھول جانے کا حکم بیان کرتی ہے: اگر نمازی مکمل کھڑا ہو جائے تو واپس نہ لوٹے بلکہ سجدہ سہو کرے، اور اگر ابھی سیدھا نہ ہوا ہو تو بیٹھ جائے اور سجدہ سہو نہ کرے۔",
    "english": "This Hadith explains the rule for forgetting the middle Tashahhud: if fully standing, do not return but perform Sujud Sahw; if not fully standing, sit back down without Sujud Sahw."
  },
  "references": [
    {
      "arabic": "رواه أبو دَاوُد (1036)",
      "english": "Reported by Abu Dawud (1036)"
    },
    {
      "arabic": "رواه ابن ماجه (1208)",
      "english": "Reported by Ibn Majah (1208)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "الْمُغِيرَةِ بْنِ شُعْبَةَ",
        "english": "Al-Mughirah bin Shu'bah"
      },
      "slug": "al-mughirah-bin-shubah"
    }
  ],
  "ytLink": "https://youtu.be/pNs5-Y9uHNY?si=hC2y8rXyD_tT8U8R",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "درمیانی تشہد کا حکم",
              "english": "Rule of Middle Tashahhud"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص دوسری رکعت کے بعد بیٹھنا بھول جائے تو یہ حدیث رہنمائی کرتی ہے۔",
                "دو حالتیں ہیں: یا تو وہ مکمل کھڑا ہو چکا ہوگا یا ابھی اٹھ رہا ہوگا۔",
                "دونوں حالتوں کا حکم الگ الگ بیان کیا گیا ہے۔"
              ],
              "english": [
                "This Hadith guides one who forgets to sit after the second Rak'ah.",
                "There are two states: either he has stood up fully or is still rising.",
                "Usually, a separate ruling is given for both states."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیام اور قعود کا فرق",
              "english": "Difference between Standing and Sitting"
            },
            "content": {
              "urdu": [
                "اگر پیٹھ سیدھی ہو گئی تو وہ قیام میں داخل ہو گیا۔",
                "اگر ابھی پیٹھ سیدھی نہیں ہوئی تو وہ قعود (بیٹھنے) کے قریب ہے۔",
                "قیام فرض ہے اور تشہد واجب، فرض شروع کرنے بعد واجب کے لیے واپس نہیں آتے۔"
              ],
              "english": [
                "If the back is straight, he has entered Qiyam (Standing).",
                "If the back is not yet straight, he is closer to sitting.",
                "Standing is Fard and Tashahhud is Wajib; one does not leave a Fard to return to a Wajib."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی ترتیب",
              "english": "Order of Prayer"
            },
            "content": {
              "urdu": [
                "جب نمازی اگلے رکن (قیام) میں پہنچ جائے تو پچھلا رکن فوت ہو جاتا ہے۔",
                "واپس لوٹنا نماز کی ترتیب کو خراب کرتا ہے۔",
                "اس لیے شریعت نے آگے بڑھنے اور سجدہ سہو کرنے کا حکم دیا۔"
              ],
              "english": [
                "When a worshiper reaches the next pillar (Standing), the previous one is missed.",
                "Returning disturbs the order of the prayer.",
                "Therefore, Shariah commands to proceed and perform Sujud Sahw."
              ]
            }
          },
          {
            "title": {
              "urdu": "سجدہ سہو کی شرط",
              "english": "Condition for Sujud Sahw"
            },
            "content": {
              "urdu": [
                "اگر وہ واپس بیٹھ گیا تو اس نے کوئی رکن نہیں چھوڑا، اس لیے سجدہ سہو نہیں۔",
                "اگر کھڑا ہو گیا تو واجب چھوٹ گیا، اس لیے تلافی کے لیے سجدہ سہو ہے۔",
                "یہ اصول نماز کی حفاظت اور تکمیل کے لیے ہے۔"
              ],
              "english": [
                "If he sat back down, he missed no pillar, hence no Sujud Sahw.",
                "If he stood up, he missed a Wajib, so Sujud Sahw compensates for it.",
                "This principle is for the protection and completion of prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام کی پیروی",
              "english": "Following the Imam"
            },
            "content": {
              "urdu": [
                "اگر امام بھول کر کھڑا ہو جائے تو مقتدی 'سبحان اللہ' کہیں۔",
                "اگر امام کھڑا ہو چکا ہو تو وہ واپس نہ بیٹھے، مقتدی بھی اس کے ساتھ کھڑے ہو جائیں۔",
                "امام کو زبردستی بٹھانے کی کوشش نہ کریں اگر وہ قیام میں پہنچ چکا ہے۔"
              ],
              "english": [
                "If Imam forgets and stands, followers should say 'Subhan Allah'.",
                "If Imam has stood up fully, he should not sit; followers must stand with him.",
                "Do not try to force the Imam to sit if he has reached standing."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذہنی حاضر باشی",
              "english": "Presence of Mind"
            },
            "content": {
              "urdu": [
                "نماز میں توجہ رکھنا ضروری ہے تاکہ ارکان ادا ہوں۔",
                "اگر غلطی ہو جائے تو گھبرائیں نہیں، شرعی حل موجود ہے۔",
                "اپنے عمل پر یقین رکھیں اور شک کو دور کریں۔"
              ],
              "english": [
                "Attention in prayer is necessary to fulfill the pillars.",
                "If a mistake occurs, do not panic; there is a Shariah solution.",
                "Have confidence in your action and remove doubt."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت اور واجب کا فرق",
              "english": "Difference b/w Sunnah & Wajib"
            },
            "content": {
              "urdu": [
                "حدیث سے معلوم ہوا کہ درمیانی تشہد واجب ہے، فرض نہیں۔",
                "اگر یہ فرض ہوتا تو چھوٹ جانے پر نماز باطل ہو جاتی۔",
                "واجب چھوٹنے پر سجدہ سہو سے نماز درست ہو جاتی ہے۔"
              ],
              "english": [
                "The Hadith shows Middle Tashahhud is Wajib, not Fard.",
                "If it were Fard, the prayer would be invalid upon missing it.",
                "Missing a Wajib is corrected by Sujud Sahw."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین کی حکمت",
              "english": "Wisdom of Religion"
            },
            "content": {
              "urdu": [
                "اسلام ہر مشکل صورتحال کا عملی حل پیش کرتا ہے۔",
                "نماز توڑنے کے بجائے اسے مکمل کرنے کا طریقہ سکھایا گیا۔",
                "یہ اللہ کی رحمت ہے کہ چھوٹی بھول پر بڑی مشقت نہیں ڈالی۔"
              ],
              "english": [
                "Islam provides practical solutions for every difficult situation.",
                "Instead of breaking prayer, a method to complete it is taught.",
                "It is Allah's mercy that minor forgetfulness does not cause major hardship."
              ]
            }
          }
        ]
      }
    }
  ]
}
