{
  "hadithId": 29,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 1 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب السواك",
    "babId": 4
  },

  "takhreej": {
    "arabic": " صحيح.  علقه البخاري (458/فتح)  بصيغة الجزم، وعنده لفظ \"عند\" بدل \"مع\".  ورواه أحمد (2 /460 و 517) ، والنسائي في \"الكبرى\" (298) ، وابن خزيمة (140) .  وللحديث ألفاظ وطرق أخرى في \"الصحيحين\" وغيرهما، وقد ذكرتها \"بالأصل\". ",
    "urdu": "صحیح (درجہ)۔ اسے بخاری نے (458/فتح الباری) میں صیغہ جزم کے ساتھ تعلیقاً روایت کیا ہے، اور ان کے ہاں 'مع' کے بجائے 'عند' کا لفظ ہے۔ اسے احمد (2/460 اور 517)، نسائی نے 'الکبریٰ' (298) اور ابن خزیمہ (140) نے بھی روایت کیا ہے۔ اس حدیث کے دیگر الفاظ اور طرق 'صحیحین' اور دیگر کتب میں بھی موجود ہیں۔",
    "english": "Sahih (Authentic). Al-Bukhari cited it (458/Fath) in a firm tone (Ta'līq Mu'allaq), using the word 'ʿinda' (at/before) instead of 'maʿa' (with). It was also narrated by Ahmad (2/460 and 517), An-Nasa'i in 'Al-Kubra' (298), and Ibn Khuzaymah (140). The Hadith has numerous other wordings and chains in Al-Bukhari, Muslim, and other collections."
  },
  "importantWords": [
    {
      "arabic": "لَوْلَا",
      "english": "Were it not for",
      "urdu": "اگر نہ ہوتا"
    },
    {
      "arabic": "أَشُقَّ",
      "english": "Place a burden/hardship",
      "urdu": "مشقت میں ڈالتا"
    },
    {
      "arabic": "أُمَّتِي",
      "english": "My Ummah/community",
      "urdu": "میری امت"
    },
    {
      "arabic": "بِالسِّوَاكِ",
      "english": "With the Siwāk (tooth-stick)",
      "urdu": "مسواک"
    },
    {
      "arabic": "أَمَرْتُهُمْ",
      "english": "I would have commanded them",
      "urdu": "میں حکم دیتا"
    },
    {
      "arabic": "وُضُوءٍ",
      "english": "Wudu/Ablution",
      "urdu": "وضو"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسواک کی عظیم فضیلت اور اہمیت کو بیان کرتی ہے، اور یہ واضح کرتی ہے کہ اگر مسلمانوں پر مشقت کا خوف نہ ہوتا تو نبی اکرم ﷺ مسواک کو ہر وضو کے ساتھ فرض کر دیتے۔",
    "english": "This Hadith expresses the great virtue and importance of using the Siwāk (tooth-stick), indicating that if it were not for the fear of imposing hardship, the Prophet (ﷺ) would have made its use mandatory with every single ritual ablution (Wudu)."
  },
  "references": [
    {
      "arabic": "موطأ الإمام مالك، كتاب الطهارة، رقم 104",
      "english": "Al-Muwatta of Imam Malik, The Book of Purification, Hadith 104"
    },
    {
      "arabic": "مسند أحمد، رقم 8426",
      "english": "Musnad Ahmad, Hadith 8426"
    },
    {
      "arabic": "سنن النسائي، كتاب الطهارة، رقم 298 (في الكبرى)",
      "english": "Sunan An-Nasa'i, The Book of Purification, Hadith 298 (in Al-Kubra)"
    },
    {
      "arabic": "صحيح ابن خزيمة، رقم 140",
      "english": "Sahih Ibn Khuzaymah, Hadith 140"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Abu Hurayrah (May Allah be pleased with him)"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-7-siwak-wudu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مسواک کی فضیلت اور حکم",
        "english": "The Virtue and Status of the Siwāk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہر وضو کے ساتھ مسواک",
              "english": "Siwāk with Every Wudu"
            },
            "content": {
              "urdu": [
                "یہ حدیث مسواک کو ہر وضو کے ساتھ سنتِ مؤکدہ یا مستحب قرار دینے کی بنیادی دلیل ہے، کیونکہ یہ اللہ کی رضا کا سبب ہے۔",
                "نبی اکرم ﷺ کے فرمان کا انداز یہ بتاتا ہے کہ مسواک آپ ﷺ کو کس قدر محبوب تھی اور آپ اس عمل کو کتنا ضروری سمجھتے تھے۔",
                "مسواک کا حکم نہ دینے کی وجہ یہ تھی کہ دن میں پانچ فرض نمازوں کے لیے پانچ بار وضو کرنا اور ہر بار مسواک کرنا امت کے لیے مشقت نہ بن جائے۔"
              ],
              "english": [
                "This Hadith is the primary evidence for considering the use of Siwāk with every Wudu as a highly emphasized Sunnah (Sunnah Mu'akkadah) or recommended act.",
                "The tone of the Prophet's statement shows how beloved the Siwāk was to him and how essential he considered this act of cleanliness to be.",
                "The reason for not commanding it was the concern that performing Wudu five times a day, plus using the Siwāk each time, might become too burdensome for the Muslim community."
              ]
            }
          },
          {
            "title": {
              "urdu": "دین میں آسانی کا اصول",
              "english": "The Principle of Ease in Religion"
            },
            "content": {
              "urdu": [
                "حدیث کا اہم ترین فقہی نکتہ یہ ہے کہ دین اسلام **آسانی** پر مبنی ہے اور احکام کی فرضیت میں امت کی آسانی کا خیال رکھا گیا ہے۔",
                "نبی ﷺ نے اپنے قول و فعل سے یہ واضح کیا کہ آپ ایسے احکام فرض کرنے سے گریز کرتے تھے جو امت پر غیر ضروری **مشقت (شق)** کا باعث بنیں۔",
                "یہ اس قرآنی اصول کی تائید ہے کہ اللہ تعالیٰ کسی جان پر اس کی طاقت سے بڑھ کر بوجھ نہیں ڈالتے۔"
              ],
              "english": [
                "The most important jurisprudential point is that Islam is founded upon the principle of **ease (Takhfīf)**, and the feasibility for the Ummah was considered when establishing obligatory rulings.",
                "The Prophet (ﷺ) demonstrated that he avoided making mandatory rulings that would cause undue **hardship (Shaqq)** upon the community.",
                "This supports the Qur'anic principle that Allah does not burden any soul beyond what it can bear."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسواک کی فضیلت کے مواقع",
        "english": "Occasions for Siwāk Use"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فقہی اختلاف اور سنت کا مقام",
              "english": "Fiqh Difference and the Status of Sunnah"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ فرض نہیں کیا گیا، لیکن اس حدیث کی وجہ سے فقہاء نے مسواک کو **ہر وضو کے لیے قوی سنت** قرار دیا ہے۔",
                "بعض علماء کے نزدیک مسواک کا استعمال منہ کی بدبو، نماز کے لیے کھڑے ہونے، یا نیند سے بیدار ہونے پر **واجب** کے قریب کی سنت ہے۔",
                "اگر کوئی مسلمان ہر وضو کے ساتھ مسواک کی سنت پر عمل کرتا ہے، تو وہ عظیم اجر اور نبی ﷺ کی پوری محبت کا مستحق ٹھہرتا ہے۔"
              ],
              "english": [
                "Even though it was not made obligatory, this Hadith leads jurists to regard the Siwāk as a **highly emphasized Sunnah for every Wudu**.",
                "According to some scholars, the use of Siwāk is a near-Wajib (mandatory) Sunnah when the mouth smells bad, upon standing for prayer, or waking up from sleep.",
                "A Muslim who practices the Sunnah of Siwāk with every Wudu is deserving of great reward and the full blessing inherent in following the Prophet (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو سے تعلق",
              "english": "Connection to Ablution (Wudu)"
            },
            "content": {
              "urdu": [
                "مسواک کا حکم طہارت اور نماز کی تیاری سے گہرا تعلق رکھتا ہے، جو اس کی اہمیت کو صرف صفائی سے بڑھ کر عبادت کا درجہ دیتا ہے۔",
                "وضو سے پہلے مسواک کرنا نماز کی تیاری کا حصہ ہے، کیونکہ یہ منہ کو پاک کرتا ہے جس سے قرآن کی تلاوت اور اللہ سے مناجات کی جاتی ہے۔",
                "یہ اس بات کی طرف اشارہ ہے کہ اللہ کے حضور کھڑے ہونے سے پہلے اپنے آپ کو اندرونی اور بیرونی طور پر پاکیزہ کرنا چاہیے۔"
              ],
              "english": [""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مسواک کے فوائد اور حکمت",
        "english": "Benefits and Wisdom of Siwāk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صفائی اور جسمانی فائدہ",
              "english": "Cleanliness and Physical Benefit"
            },
            "content": {
              "urdu": [
                "مسواک کا بنیادی فائدہ منہ اور دانتوں کی صفائی ہے، جو اس وقت صحت اور حفظانِ صحت کا ایک مؤثر ذریعہ تھا۔",
                "نبی ﷺ نے ایک دوسری حدیث میں فرمایا کہ مسواک منہ کو پاک کرنے اور اللہ کی رضا حاصل کرنے کا ذریعہ ہے۔",
                "جدید سائنس نے بھی مسواک کی لکڑی (خاص طور پر اراک) میں موجود جراثیم کش اور صاف کرنے والی خصوصیات کو تسلیم کیا ہے۔"
              ],
              "english": [
                "The primary benefit of the Siwāk is the cleaning of the mouth and teeth, which was an effective means of hygiene and health at that time.",
                "The Prophet (ﷺ) stated in another Hadith that the Siwāk purifies the mouth and pleases the Lord (Rabb).",
                "Modern science has also acknowledged the natural antibacterial and cleansing properties found in the wood of the Siwāk (particularly the Arak tree)."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا آخری عمل",
              "english": "The Prophet's Final Practice"
            },
            "content": {
              "urdu": [
                "اس کی اہمیت اس بات سے بھی ظاہر ہوتی ہے کہ نبی اکرم ﷺ کی زندگی کا آخری عمل مسواک کرنا تھا، جیسا کہ صحیح احادیث سے ثابت ہے۔",
                "اس سے معلوم ہوتا ہے کہ نبی ﷺ نے اپنی امت کو اس عمل کی ترغیب دی اور اپنے آخری لمحات میں بھی اس سنت کو نہ چھوڑا۔",
                "یہ اس بات کا ثبوت ہے کہ مسواک کرنا نہ صرف دنیاوی صفائی ہے بلکہ ایک روحانی عمل بھی ہے جو آخرت میں نفع دے گا۔"
              ],
              "english": [
                "The significance of the Siwāk is also highlighted by the fact that the last action the Prophet (ﷺ) performed before passing away was using the Siwāk, as proven in Sahih Ahadith.",
                "This confirms that the Prophet (ﷺ) encouraged this practice for his Ummah and did not neglect this Sunnah even in his final moments.",
                "It serves as evidence that using the Siwāk is not only a matter of worldly cleanliness but also a spiritual act that yields rewards in the Hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مشقت کا مفہوم اور فقہی تفریع",
        "english": "Meaning of Hardship and Fiqh Derivation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشقت سے مراد",
              "english": "Definition of Hardship ('Ashuqqa')"
            },
            "content": {
              "urdu": [
                "حدیث میں 'اشق' (مشقت) سے مراد یہ ہے کہ ایسا حکم فرض کر دیا جائے جسے مستقل بنیادوں پر انجام دینا تمام مسلمانوں کے لیے مشکل ہو۔",
                "اگرچہ مسواک ایک آسان عمل ہے، لیکن دن میں کم از کم پانچ بار، سال میں 1800 سے زائد بار اسے فرض کرنا عام لوگوں کے لیے بوجھ بن سکتا تھا۔",
                "نبی ﷺ نے جان بوجھ کر سنت کو فرضیت کے درجے تک نہیں پہنچایا تاکہ امت کو اجر حاصل کرنے میں آسانی رہے اور گناہ کا خوف نہ ہو۔"
              ],
              "english": [
                "The term 'Ashuqqa' (hardship) in the Hadith refers to making an act mandatory that would be difficult for all Muslims to perform consistently on a regular basis.",
                "Although using the Siwāk is easy, making it obligatory more than 1800 times a year (five times a day) might have become a burden for ordinary people.",
                "The Prophet (ﷺ) deliberately kept the act at the level of Sunnah, allowing the Ummah to gain reward easily without the fear of sin for omission."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو کے ساتھ یا پہلے؟",
              "english": "With Wudu or Before Wudu?"
            },
            "content": {
              "urdu": [
                "حدیث میں 'مع کل وضوء' (ہر وضو کے ساتھ) کا لفظ موجود ہے، جبکہ بخاری میں 'عند' (پہلے) ہے۔ فقہاء نے زیادہ تر اسے وضو سے **پہلے** کرنے کو مستحب قرار دیا ہے۔",
                "اس کی حکمت یہ ہے کہ وضو، نماز کے لیے طہارت کا عمل ہے، اور مسواک منہ کو پاک کر کے اس طہارت کو مکمل کرتی ہے۔",
                "پس، بہترین عمل یہ ہے کہ وضو شروع کرنے سے پہلے یا کلی کرتے وقت مسواک کی جائے تاکہ منہ کی ناپاکی دور ہو جائے۔"
              ],
              "english": [
                "The Hadith uses the phrase 'maʿa kulli wuḍū’' (with every Wudu), while Al-Bukhari uses 'ʿinda' (at/before). Most jurists recommend performing the Siwāk **before** Wudu or during the rinsing of the mouth.",
                "The wisdom behind this is that Wudu is the act of purity for prayer, and the Siwāk completes this purity by cleaning the mouth.",
                "Therefore, the best practice is to use the Siwāk before starting Wudu or while rinsing the mouth (Maḍmaḍah) to ensure the mouth is purified."
              ]
            }
          }
        ]
      }
    }
  ]
}
