{
  "hadithId": 566,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/5/60"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "ضعيف. رواه أبو داود (2440)، والنسائي في الكبرى (2830)، وابن ماجه (1732)، وأحمد (2/304). فيه حوشب بن عقيل، ضعفه العقيلي، والراجح أن النهي ثابت من حيث المعنى لفعله ﷺ.",
    "urdu": "ضعیف۔ اسے ابوداؤد (2440) اور ابن ماجہ (1732) نے روایت کیا ہے۔ اگرچہ اس کی سند میں کلام ہے، لیکن مفہوم کے اعتبار سے یہ ثابت ہے کیونکہ نبی ﷺ نے خود حج کے دوران عرفہ کا روزہ نہیں رکھا تھا۔",
    "english": "Da'if (Weak). Reported by Abu Dawud (2440) and Ibn Majah (1732). Its chain contains Hawshab bin 'Aqil, whom Al-Uqayli graded as weak. However, the meaning is supported by the Prophet's (ﷺ) own practice during Hajj."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Forbade",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "عَرَفَةَ",
      "english": "Arafah (Day)",
      "urdu": "عرفہ کا دن"
    },
    {
      "arabic": "بِعَرَفَةَ",
      "english": "At Arafat (Place)",
      "urdu": "میدانِ عرفات میں"
    },
    {
      "arabic": "صَوْمِ",
      "english": "Fasting",
      "urdu": "روزہ"
    },
    {
      "arabic": "اسْتَنْكَرَهُ",
      "english": "Considered it Munkar",
      "urdu": "اسے منکر قرار دیا"
    }
  ],
  "summary": {
    "urdu": "حاجیوں کے لیے میدانِ عرفات میں عرفہ کے دن روزہ رکھنا منع ہے تاکہ وہ دعا اور حج کے ارکان کے لیے جسمانی توانائی برقرار رکھ سکیں۔",
    "english": "It is prohibited for pilgrims to fast on the Day of Arafah while at Arafat, ensuring they have the strength for supplication and Hajj rituals."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2440)",
      "english": "Reported by Abu Dawud (2440)"
    },
    {
      "arabic": "رواه ابن ماجه (1732)",
      "english": "Reported by Ibn Majah (1732)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=3u_M0zI6MWA",
  "grade": {
    "arabic": "ضعيف (سنداً) / صحيح (معنىً)",
    "english": "Weak (Chain) / Authentic (Meaning)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حاجی کے لیے عرفہ کا روزہ",
        "english": "Fasting Arafah for the Pilgrim"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممانعت کی شرعی حیثیت",
              "english": "Sharia Status of Prohibition"
            },
            "content": {
              "urdu": [
                "حاجی کے لیے عرفہ کے دن روزہ رکھنا مکروہ یا ممنوع قرار دیا گیا ہے۔",
                "یہ حکم صرف ان لوگوں کے لیے ہے جو میدانِ عرفات میں موجود ہوں۔",
                "نبی ﷺ نے خود حجۃ الوداع کے موقع پر سب کے سامنے پانی پی کر روزہ نہ ہونا ظاہر فرمایا۔"
              ],
              "english": [
                "It is considered disliked or prohibited for a pilgrim to fast on the day of Arafah.",
                "This ruling specifically applies to those present at the plain of Arafat.",
                "During the Farewell Pilgrimage, the Prophet (ﷺ) drank water publicly to show he was not fasting."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقام اور غیر مقام کا فرق",
              "english": "Difference between Place and Non-Pilgrims"
            },
            "content": {
              "urdu": [
                "غیر حاجیوں کے لیے عرفہ کا روزہ پچھلے اور اگلے سال کے گناہوں کا کفارہ ہے۔",
                "حاجی کے لیے اس دن کی اصل عبادت 'ذکر اور دعا' ہے۔",
                "جگہ کی تبدیلی سے عبادت کی نوعیت اور فضیلت بدل جاتی ہے۔"
              ],
              "english": [
                "For non-pilgrims, fasting Arafah expiates sins for the past and coming year.",
                "For the pilgrim, the primary worship on this day is Dhikr and supplication.",
                "The nature and virtue of worship change based on the location of the person."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جسمانی قوت اور دعا کی اہمیت",
        "english": "Importance of Strength for Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ارکانِ حج کی ادائیگی",
              "english": "Performing Hajj Rituals"
            },
            "content": {
              "urdu": [
                "وقوفِ عرفات حج کا سب سے بڑا اور اہم رکن ہے۔",
                "روزہ رکھنے سے حاجی کو کمزوری لاحق ہو سکتی ہے جو دعا میں حائل ہو۔",
                "شریعت نے آسانی دی ہے تاکہ انسان تندہی سے گریہ و زاری کر سکے۔"
              ],
              "english": [
                "Standing at Arafat is the greatest and most pivotal ritual of Hajj.",
                "Fasting might cause weakness to the pilgrim, hindering their prayers.",
                "Sharia provides ease so that one can focus intently on crying out to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "بہترین عبادت کا انتخاب",
              "english": "Choosing the Best Worship"
            },
            "content": {
              "urdu": [
                "کبھی کبھار ایک نیکی (روزہ) کو دوسری بڑی نیکی (دعا) کے لیے چھوڑا جاتا ہے۔",
                "عرفہ کے دن کی دعا سب سے افضل دعا قرار دی گئی ہے۔",
                "قوت برقرار رکھنا تاکہ شام تک وقوف کیا جا سکے، حاجی کے لیے ضروری ہے۔"
              ],
              "english": [
                "Sometimes a good deed (fasting) is left for a greater one (supplication).",
                "The supplication of the Day of Arafah is described as the best of all prayers.",
                "Maintaining energy to sustain the standing until sunset is vital for the pilgrim."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی بحث اور حدیث کی صحت",
        "english": "Juristic Debate and Hadith Authenticity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محدثین کا اختلاف",
              "english": "Disagreement Among Scholars"
            },
            "content": {
              "urdu": [
                "امام حاکم اور ابن خزیمہ نے اس سند کو صحیح قرار دیا ہے۔",
                "امام عقیلی اور دیگر نے اسے 'منکر' کہا ہے کیونکہ اس کے راوی منفرد ہیں۔",
                "لیکن تمام ائمہ کا اتفاق ہے کہ سنتِ نبوی روزہ نہ رکھنے میں ہی ہے۔"
              ],
              "english": [
                "Imam Al-Hakim and Ibn Khuzaymah considered the chain to be authentic.",
                "Al-Uqayli and others called it Munkar due to isolation in its narration.",
                "However, all Imams agree that the Prophetic Sunnah is to refrain from fasting."
              ]
            }
          },
          {
            "title": {
              "urdu": "رخصت یا ممانعت؟",
              "english": "Permission or Prohibition?"
            },
            "content": {
              "urdu": [
                "کچھ فقہاء اسے حرام کہتے ہیں جبکہ اکثر اسے مکروہ قرار دیتے ہیں۔",
                "اگر کوئی حاجی روزہ رکھنے کے باوجود تھکاوٹ محسوس نہ کرے، تب بھی سنت کی پیروی بہتر ہے۔",
                "اللہ کی دی ہوئی رخصت کو قبول کرنا بھی اللہ کو پسند ہے۔"
              ],
              "english": [
                "Some jurists deem it forbidden while most classify it as disliked (Makruh).",
                "Even if a pilgrim feels no fatigue, following the Sunnah is still superior.",
                "Allah loves for His servants to accept the concessions He has granted."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں اعتدال",
              "english": "Moderation in Worship"
            },
            "content": {
              "urdu": [
                "دین میں سختی کے بجائے وہ راستہ اختیار کریں جو اللہ کے نزدیک محبوب ہو۔",
                "مقصد صرف جسم کو بھوکا رکھنا نہیں بلکہ روح کو حاضر رکھنا ہے۔",
                "موقع و محل کی مناسبت سے عمل کی فضیلت بدلتی رہتی ہے۔"
              ],
              "english": [
                "In religion, choose the path most beloved to Allah rather than mere hardship.",
                "The goal is not just to keep the body hungry but to keep the soul present.",
                "The virtue of an action varies based on time, place, and context."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتباعِ سنت کا معیار",
              "english": "Standard of Following Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے ہر عمل اور ممانعت میں گہری حکمت پوشیدہ ہے۔",
                "اپنی مرضی سے نیکی کے کام کرنا بندگی نہیں بلکہ اتباع اصل ہے۔",
                "حاجی کو چاہیے کہ وہ عرفات میں ذکر اور استغفار کو ترجیح دے۔"
              ],
              "english": [
                "Profound wisdom is hidden in every action and prohibition of the Prophet (ﷺ).",
                "Performing good deeds by one's own whim is not servitude; following is key.",
                "A pilgrim should prioritize Dhikr and seeking forgiveness while at Arafat."
              ]
            }
          }
        ]
      }
    }
  ]
}