{
  "hadithId": 359,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/muslim:862b"
    ],
    "kitabId": 2,
    "inKitabBab": 12,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 22
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (862) (35)، وأبو داود (1094)، والنسائي (1416).",
    "urdu": "صحیح روایت ہے۔ اسے امام مسلم نے اپنی صحیح (862) میں روایت کیا ہے، نیز ابو داؤد اور نسائی میں بھی موجود ہے۔",
    "english": "Sahih. Reported by Muslim (862), Abu Dawud (1094), and an-Nasa'i (1416)."
  },
  "importantWords": [
    {
      "arabic": "يَخْطُبُ",
      "english": "Delivering sermon",
      "urdu": "خطبہ دینا"
    },
    {
      "arabic": "قَائِمًا",
      "english": "Standing",
      "urdu": "کھڑے ہو کر"
    },
    {
      "arabic": "يَجْلِسُ",
      "english": "Sits",
      "urdu": "بیٹھنا"
    },
    {
      "arabic": "يَقُومُ",
      "english": "Stands up",
      "urdu": "کھڑا ہونا"
    },
    {
      "arabic": "أَنْبَأَكَ",
      "english": "Informed you",
      "urdu": "تمہیں خبر دی"
    },
    {
      "arabic": "كَذَبَ",
      "english": "Lied",
      "urdu": "جھوٹ بولا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دونوں خطبے کھڑے ہو کر دیتے تھے اور ان کے درمیان بیٹھ کر وقفہ فرماتے تھے۔",
    "english": "This Hadith confirms that the Prophet (ﷺ) delivered both Friday sermons while standing, with a short sitting interval between them."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (862)",
      "english": "Sahih Muslim (862)"
    },
    {
      "arabic": "سنن أبي داود (1094)",
      "english": "Sunan Abi Dawud (1094)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن سمرة رضي الله عنه",
        "english": "Jabir bin Samurah"
      },
      "slug": "jabir-bin-samurah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3n0_i9D6pU",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خطبہ جمعہ کی ہیئت",
        "english": "Manner of the Friday Sermon"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھڑے ہو کر خطبہ دینا",
              "english": "Delivering Khutbah Standing"
            },
            "content": {
              "urdu": [
                "رسول اللہ صلی اللہ علیہ وسلم کا مستقل معمول کھڑے ہو کر خطبہ دینا تھا۔",
                "یہ طریقہ سامعین کی توجہ حاصل کرنے اور آواز پہنچانے میں مؤثر ہے۔",
                "بلا عذر بیٹھ کر خطبہ دینا سنتِ نبوی کے خلاف تصور کیا جاتا ہے۔"
              ],
              "english": [
                "It was the constant practice of the Prophet (ﷺ) to deliver sermons while standing.",
                "This method is effective for capturing the audience's attention and projecting the voice.",
                "Delivering the sermon sitting without a valid excuse is considered contrary to the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "دو خطبوں کے درمیان وقفہ",
              "english": "Interval Between Two Sermons"
            },
            "content": {
              "urdu": [
                "نبی کریم صلی اللہ علیہ وسلم دو خطبوں کے درمیان تھوڑی دیر بیٹھتے تھے۔",
                "اس نشست کا مقصد دونوں خطبوں کے درمیان واضح فرق پیدا کرنا ہے۔",
                "یہ مختصر وقفہ خطیب کے لیے آرام اور سکون کا باعث بھی بنتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used to sit for a short duration between the two sermons.",
                "The purpose of this sitting is to clearly distinguish between the first and second parts.",
                "This brief interval also provides a moment of rest and composure for the preacher."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت کی اہمیت اور دفاع",
        "english": "Importance and Defense of Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلط بیانی کی تردید",
              "english": "Refutation of Misinformation"
            },
            "content": {
              "urdu": [
                "سیدنا جابر بن سمرہ نے بیٹھ کر خطبہ دینے کی سختی سے تردید فرمائی۔",
                "صحابہ کرام سنتِ نبوی کے معاملے میں نہایت حساس اور چوکنا رہتے تھے۔",
                "دین میں کسی بھی غلط بات کی نسبت کرنا ایک سنگین جرم اور جھوٹ ہے۔"
              ],
              "english": [
                "Jabir bin Samurah strictly refuted the claim of delivering the sermon while sitting.",
                "The Companions were extremely sensitive and alert regarding the Prophet's (ﷺ) Sunnah.",
                "Attributing incorrect practices to the religion is a serious offense and a lie."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کی عینی شہادت",
              "english": "Eyewitness Testimony of Sahaba"
            },
            "content": {
              "urdu": [
                "جابر بن سمرہ فرماتے ہیں کہ میں نے آپ کے ساتھ دو ہزار سے زائد نمازیں پڑھیں۔",
                "یہ کثرتِ مشاہدہ ان کی بات کو قطعی اور یقینی بنا دیتی ہے۔",
                "صحابہ کا عمل اور بیان ہی ہم تک دین کی صحیح صورت پہنچانے کا ذریعہ ہے۔"
              ],
              "english": [
                "Jabir bin Samurah mentions having prayed over two thousand prayers with the Prophet (ﷺ).",
                "This frequent observation makes his testimony definitive and certain.",
                "The actions and narrations of the Sahaba are the primary means of reaching the true Deen."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام و مسائل",
        "english": "Juristic Rulings and Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قیام کی شرعی حیثیت",
              "english": "Legal Status of Standing"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک خطبہ جمعہ میں قیام (کھڑا ہونا) واجب یا سنتِ مؤکدہ ہے۔",
                "اگر خطیب معذور ہو تو وہ بیٹھ کر خطبہ دے سکتا ہے، یہ جائز ہے۔",
                "بغیر عذر کے بیٹھ کر خطبہ دینا ناپسندیدہ ہے کیونکہ یہ سنت کے خلاف ہے۔"
              ],
              "english": [
                "Most jurists consider standing during the Friday sermon as obligatory or an emphasized Sunnah.",
                "If the preacher has a disability, delivering the sermon while sitting is permissible.",
                "Sitting without a valid reason is disliked as it deviates from the established Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "خطبہ کے آداب",
              "english": "Etiquettes of the Sermon"
            },
            "content": {
              "urdu": [
                "خطبہ کے دوران سامعین کا خاموشی سے سننا اور خطیب کی طرف متوجہ ہونا ضروری ہے۔",
                "خطیب کو چاہیے کہ وہ سنت کے مطابق مختصر اور جامع خطاب کرے۔",
                "دونوں خطبوں میں توازن برقرار رکھنا سنتِ نبوی کا حصہ ہے۔"
              ],
              "english": [
                "It is essential for the audience to listen silently and face the preacher during the sermon.",
                "The preacher should deliver a concise and comprehensive address in line with the Sunnah.",
                "Maintaining a balance between the two sermons is part of the Prophetic guidance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی اسباق",
        "english": "Educational and Reformative Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جھوٹ سے بچنے کی تاکید",
              "english": "Emphasis on Avoiding Lies"
            },
            "content": {
              "urdu": [
                "حدیث میں جھوٹ بولنے والے کی سخت مذمت کی گئی ہے، خصوصاً دین کے معاملے میں۔",
                "مسلمان کو بات کرنے سے پہلے اس کی تحقیق کر لینی چاہیے۔",
                "بغیر علم کے کوئی بھی دینی بات منسوب کرنا گمراہی کا راستہ ہے۔"
              ],
              "english": [
                "The Hadith strongly condemns lying, especially regarding religious matters.",
                "A Muslim must verify information before speaking or relaying it to others.",
                "Attributing religious claims without knowledge is a path toward misguidance."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی میں برکت",
              "english": "Blessings in Following the Sunnah"
            },
            "content": {
              "urdu": [
                "عبادات کی وہی شکل اللہ کے ہاں مقبول ہے جو رسول اللہ صلی اللہ علیہ وسلم نے دکھائی۔",
                "سنت پر عمل کرنے سے امت میں اتحاد اور یکسانیت پیدا ہوتی ہے۔",
                "ظاہری اعمال میں اتباعِ سنت باطنی نور اور ایمان کی پختگی کا باعث ہے۔"
              ],
              "english": [
                "Worship is only acceptable to Allah in the manner demonstrated by the Prophet (ﷺ).",
                "Following the Sunnah creates unity and consistency within the Ummah.",
                "Adhering to the Sunnah in outward actions brings inner light and strengthens faith."
              ]
            }
          }
        ]
      }
    }
  ]
}