{
  "hadithId": 1280,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["muslim:2578", "bulugh:1480"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2578)، وأحمد (14441)، والبيهقي في الشعب (3256).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام مسلم نے اپنی صحیح (2578) میں روایت کیا ہے۔ اس میں مزید الفاظ ہیں کہ بخیلی نے لوگوں کو خون ریزی اور حرام کو حلال کرنے پر اکسایا۔",
    "english": "Sahih (Authentic). Reported by Muslim (2578). In the full version, the Prophet (ﷺ) added that greed led previous nations to shed blood and violate sanctities."
  },
  "importantWords": [
    {
      "arabic": "اتَّقُوا",
      "english": "Beware / Fear",
      "urdu": "بچو / ڈرو"
    },
    {
      "arabic": "الظُّلْمَ",
      "english": "Injustice / Oppression",
      "urdu": "ظلم"
    },
    {
      "arabic": "ظُلُمَاتٌ",
      "english": "Darkness / Gloom",
      "urdu": "اندھیرے / تاریکیاں"
    },
    {
      "arabic": "الشُّحَّ",
      "english": "Greed / Stinginess",
      "urdu": "بخیلی / حرص"
    },
    {
      "arabic": "أَهْلَكَ",
      "english": "Destroyed",
      "urdu": "ہلاک کر دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث دو بڑے معاشرتی گناہوں، ظلم اور بخیلی کی مذمت کرتی ہے، جو آخرت میں تاریکی اور دنیا میں قوموں کی ہلاکت کا باعث بنتے ہیں۔",
    "english": "This Hadith condemns two major social evils: injustice, which brings darkness in the hereafter, and greed, which leads to the worldly destruction of nations."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (2578)",
      "english": "Sahih Muslim (2578)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله الأنصاري",
        "english": "Jabir bin Abdullah al-Ansari"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ظلم کے سنگین نتائج",
        "english": "Grave Consequences of Injustice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخرت کی تاریکی",
              "english": "Darkness of the Hereafter"
            },
            "content": {
              "urdu": [
                "ظلم کا بدلہ قیامت کے دن شدید اندھیروں کی صورت میں ملے گا۔",
                "مظلوم کا حق مارنے والا اس دن کوئی روشنی نہیں پائے گا۔",
                "دنیا کی عارضی چودھراہٹ آخرت کی دائمی تاریکی بن جائے گی۔"
              ],
              "english": [
                "The punishment for injustice will manifest as literal darkness on Judgment Day.",
                "Those who violate the rights of others will find no guiding light then.",
                "Temporary worldly power through oppression leads to eternal gloom."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی ناپسندیدگی",
              "english": "Displeasure of Allah"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے اپنے اوپر بھی ظلم کو حرام قرار دیا ہے۔",
                "مظلوم کی بددعا اور اللہ کے درمیان کوئی پردہ نہیں ہوتا۔",
                "ظلم کرنے والوں کو اللہ کبھی ہدایت اور فلاح نہیں دیتا۔"
              ],
              "english": [
                "Allah has forbidden injustice even upon His Divine Self.",
                "There is no veil between the prayer of the oppressed and Allah.",
                "Allah never grants guidance or success to the oppressors."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بخیلی اور حرص کی تباہ کاری",
        "english": "Destruction Caused by Greed"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سابقہ قوموں کا عبرت ناک انجام",
              "english": "The Fate of Previous Nations"
            },
            "content": {
              "urdu": [
                "حرص و طمع کی وجہ سے پرانی قومیں آپس میں لڑ کر مٹ گئیں۔",
                "مال کی ہوس انسان کو قتل و غارت گری پر اکساتی ہے۔",
                "بخیلی دل کو سخت کر دیتی ہے اور رحم و کرم ختم کرتی ہے۔"
              ],
              "english": [
                "Greed led previous civilizations to internal conflict and eventual ruin.",
                "Obsession with wealth incites humans toward violence and bloodshed.",
                "Stinginess hardens the heart and eliminates mercy and compassion."
              ]
            }
          },
          {
            "title": {
              "urdu": "حرام کو حلال کرنا",
              "english": "Sanctifying the Forbidden"
            },
            "content": {
              "urdu": [
                "بخیلی انسان کو اخلاقی گراوٹ کی آخری حد تک لے جاتی ہے۔",
                "مال کی محبت میں انسان اللہ کی حدود کو توڑنے لگتا ہے۔",
                "معاشرتی بگاڑ کا سب سے بڑا سبب مال جمع کرنے کی حرص ہے۔"
              ],
              "english": [
                "Greed drives individuals to the lowest depths of moral decay.",
                "Love for wealth makes humans violate the sacred limits of Allah.",
                "The primary cause of social corruption is the greed for accumulation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اصلاح اور عدل",
        "english": "Social Reform and Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق کی ادائیگی",
              "english": "Fulfillment of Rights"
            },
            "content": {
              "urdu": [
                "اسلام ہر شخص کو اس کا جائز حق دینے کی تاکید کرتا ہے۔",
                "عدل و انصاف ہی معاشرے میں امن کی ضمانت فراہم کرتا ہے۔",
                "دوسروں کے مال اور عزت کی حفاظت کرنا ہر مسلمان کا فرض ہے۔"
              ],
              "english": [
                "Islam emphasizes giving every individual their rightful dues.",
                "Justice and fairness provide the guarantee for social peace.",
                "Protecting others' wealth and honor is obligatory for every Muslim."
              ]
            }
          },
          {
            "title": {
              "urdu": "سخاوت کی اہمیت",
              "english": "Importance of Generosity"
            },
            "content": {
              "urdu": [
                "سخاوت اللہ کے غصے کو ٹھنڈا کرتی اور مال میں برکت لاتی ہے۔",
                "دوسروں کی ضرورت کو اپنی ضرورت پر ترجیح دینا اعلیٰ صفت ہے۔",
                "بخیلی سے نجات پا کر ہی انسان روحانی ترقی کر سکتا ہے۔"
              ],
              "english": [
                "Generosity cools Allah's anger and brings blessings to wealth.",
                "Prioritizing others' needs over one's own is an exalted trait.",
                "Spiritual growth is only possible after freeing oneself from stinginess."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اپنا محاسبہ",
              "english": "Self-Accountability"
            },
            "content": {
              "urdu": [
                "ہمیں روزانہ دیکھنا چاہیے کہ ہم کسی کا حق تو نہیں مار رہے۔",
                "نادانستہ کیے گئے ظلم پر فوراً معافی اور تلافی کرنی چاہیے۔",
                "مال خرچ کرتے وقت دل میں تنگی پیدا نہ ہونے دیں۔"
              ],
              "english": [
                "We must daily ensure we are not violating anyone's rights.",
                "Seek immediate forgiveness and restitution for unintentional wrongs.",
                "Do not allow tightness in the heart when spending on good causes."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی بیداری",
              "english": "Social Awareness"
            },
            "content": {
              "urdu": [
                "ظلم کے خلاف آواز اٹھانا اور مظلوم کی مدد کرنا سنت ہے۔",
                "معاشرے میں سخاوت اور ہمدردی کے کلچر کو عام کریں۔",
                "حرص و طمع کے بجائے قناعت اور شکر کو اپنا شعار بنائیں۔"
              ],
              "english": [
                "Raising voice against injustice and helping the weak is a Sunnah.",
                "Promote a culture of generosity and empathy within the community.",
                "Adopt contentment and gratitude instead of greed and desire."
              ]
            }
          }
        ]
      }
    }
  ]
}