{
  "hadithId": 729,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:1556"],
    "kitabId": 7,
    "inKitabBab": 6,
    "arabicBook": "كتاب البيوع",
    "babId": 47
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (1556). وأخرجه أيضاً أبو داود (3469)، والترمذي (655)، والنسائي (7/264)، وابن ماجه (2356).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام مسلم (1556) نے روایت کیا ہے۔ یہ حدیث دیوالیہ پن (Bankruptcy) کے مسائل میں ایک کلیدی حیثیت رکھتی ہے۔",
    "english": "Sahih. Reported by Muslim (1556). Also reported by Abu Dawud (3469), At-Tirmidhi (655), An-Nasa'i (7/264), and Ibn Majah (2356)."
  },
  "importantWords": [
    {
      "arabic": "أُصِيبَ",
      "english": "Suffered a loss / Afflicted",
      "urdu": "نقصان ہوا / آفت پہنچی"
    },
    {
      "arabic": "ثِمَارٍ",
      "english": "Fruits",
      "urdu": "پھل"
    },
    {
      "arabic": "تَصَدَّقُوا",
      "english": "Give charity",
      "urdu": "صدقہ کرو / مالی مدد کرو"
    },
    {
      "arabic": "غُرَمَائِهِ",
      "english": "His creditors",
      "urdu": "اس کے قرض خواہ"
    },
    {
      "arabic": "وَفَاءَ",
      "english": "Full payment / Fulfillment",
      "urdu": "ادائیگی / پورا ہونا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں بتایا گیا ہے کہ اگر کوئی تاجر ناگہانی نقصان کی وجہ سے دیوالیہ ہو جائے تو اسلامی ریاست اور معاشرے کو اس کی مدد کرنی چاہیے، اور قرض خواہوں کو اس کے موجودہ اثاثوں پر ہی اکتفا کرنا چاہیے۔",
    "english": "This Hadith teaches that if a trader goes bankrupt due to unforeseen losses, the community should help him, and creditors must settle for whatever assets are currently available."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1556)",
      "english": "Sahih Muslim (1556)"
    },
    {
      "arabic": "جامع الترمذي (655)",
      "english": "Jami' At-Tirmidhi (655)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id al-Khudri"
      },
      "slug": "abu-sa-id-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دیوالیہ پن (افلاس) کا شرعی حل",
        "english": "Sharia Solution for Insolvency"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی تعاون کا حکم",
              "english": "Command for Social Cooperation"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ایک مقروض صحابی کی مشکل دیکھ کر لوگوں کو ان کی مالی مدد (صدقہ) کرنے کی ترغیب دی۔",
                "اسلامی معاشرے میں ایک دوسرے کی معاشی مدد کرنا محض احسان نہیں بلکہ ایک سماجی ذمہ داری ہے۔",
                "اگر کوئی دیانتدار تاجر غیر متوقع حالات کی وجہ سے بیٹھ جائے، تو اسے دوبارہ کھڑا کرنا پوری کمیونٹی کا کام ہے۔"
              ],
              "english": [
                "Seeing a companion in debt, the Prophet (PBUH) encouraged the people to give him Sadaqah.",
                "In an Islamic society, supporting one another financially is a social responsibility, not just a favor.",
                "If an honest merchant fails due to unforeseen events, rehabilitating them is a community duty."
              ]
            }
          },
          {
            "title": {
              "urdu": "موجود اثاثوں کی تقسیم",
              "english": "Distribution of Available Assets"
            },
            "content": {
              "urdu": [
                "جب صدقہ جمع ہونے کے بعد بھی قرض پورا نہ ہوا، تو نبی ﷺ نے فیصلہ دیا کہ قرض خواہ موجودہ مال ہی لے لیں۔",
                "قرض خواہ اس شخص کو قید کرنے یا مزید تنگ کرنے کا حق نہیں رکھتے تھے کیونکہ وہ حقیقی معنوں میں نادار ہو چکا تھا۔",
                "یہ اصول آج کے دور کے دیوالیہ پن کے قوانین (Insolvency Laws) کی بنیاد فراہم کرتا ہے۔"
              ],
              "english": [
                "When collected charity was insufficient, the Prophet (PBUH) ruled that creditors must accept whatever was present.",
                "Creditors did not have the right to imprison or further harass him as he was genuinely destitute.",
                "This principle provides the foundation for modern-day insolvency and bankruptcy laws."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرض خواہوں کے حقوق اور حدود",
        "english": "Rights and Limits of Creditors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقِ مطالبہ کی حد",
              "english": "Limit of the Right to Demand"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا فرمان 'تمہارے لیے اس کے سوا کچھ نہیں' اس وقت ہے جب مقروض کے پاس واقعی کچھ نہ بچا ہو۔",
                "قرض خواہ کا حق صرف مقروض کے موجودہ مال پر ہوتا ہے، اس کی جان یا خاندان پر نہیں۔",
                "اگر مقروض مستقبل میں دوبارہ مالدار ہو جائے، تو جمہور فقہاء کے نزدیک بقیہ قرض کی ادائیگی اخلاقی و شرعی طور پر باقی رہتی ہے۔"
              ],
              "english": [
                "The phrase 'you will have nothing more than that' applies when the debtor truly has nothing left.",
                "The creditor's right is over the debtor's assets, not over his person or family.",
                "If the debtor becomes wealthy again in the future, most jurists hold that the remaining debt obligation remains."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل اور نرمی",
              "english": "Justice and Leniency"
            },
            "content": {
              "urdu": [
                "قرآن کا حکم ہے: 'اگر قرض دار تنگدست ہو تو اسے آسانی تک مہلت دو'۔",
                "نبی ﷺ نے اس معاملے میں عملی طور پر عدل قائم کیا کہ نہ مقروض پر ناقابلِ برداشت بوجھ رہے اور نہ قرض خواہوں کا سارا مال ڈوبے۔",
                "مصیبت کے وقت ایک دوسرے کے ساتھ رعایت کرنا اللہ کی رحمت کا باعث بنتا ہے۔"
              ],
              "english": [
                "The Quran commands: 'If the debtor is in difficulty, then let there be postponement until ease'.",
                "The Prophet (PBUH) practically established justice, ensuring no unbearable burden on the debtor nor total loss for creditors.",
                "Showing leniency toward each other during times of calamity attracts Allah's mercy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی ابعاد",
        "english": "Juristic and Legal Dimensions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حاکمِ وقت کا کردار",
              "english": "The Role of the Ruler"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ حاکمِ وقت کو مالی تنازعات میں مداخلت اور فیصلے کا پورا حق ہے۔",
                "ریاست کی ذمہ داری ہے کہ وہ نادہندگان اور قرض خواہوں کے درمیان توازن پیدا کرے۔",
                "اگر ضرورت پڑے تو بیت المال (سرکاری خزانہ) سے بھی ایسے لوگوں کی مدد کی جا سکتی ہے۔"
              ],
              "english": [
                "This Hadith proves that the ruler has the right to intervene and adjudicate in financial disputes.",
                "It is the state's responsibility to balance the interests of defaulters and creditors.",
                "If needed, assistance can be provided to such individuals from the public treasury (Bayt al-Mal)."
              ]
            }
          },
          {
            "title": {
              "urdu": "پھلوں کی بیع اور رسک",
              "english": "Fruit Sales and Risk"
            },
            "content": {
              "urdu": [
                "پھلوں کی تجارت میں قدرتی آفات کا خطرہ ہمیشہ رہتا ہے (جیسے جائحہ)۔",
                "اگر بڑے پیمانے پر نقصان ہو جائے تو شریعت بیچنے والے کو قیمت میں کمی یا واپسی کی ترغیب دیتی ہے۔",
                "کاروباری معاہدوں میں ان ناگہانی خطرات کا لحاظ رکھنا 'تقویٰ' کا تقاضا ہے۔"
              ],
              "english": [
                "Fruit trading always carries the risk of natural calamities (Blights/Jaih'ah).",
                "In cases of massive loss, Sharia encourages the seller to reduce or refund the price.",
                "Considering unforeseen risks in business contracts is a requirement of 'Taqwa'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہمدردی اور ایثار",
              "english": "Compassion and Altruism"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ اپنے پریشان حال بھائیوں کے لیے اپنے دل اور جیب کھلے رکھیں۔",
                "مشکل وقت میں دی گئی تھوڑی سی مدد بھی کسی کی زندگی بچا سکتی ہے۔",
                "اللہ تعالیٰ اس وقت تک بندے کی مدد میں رہتا ہے جب تک بندہ اپنے بھائی کی مدد میں ہوتا ہے۔"
              ],
              "english": [
                "Muslims should keep their hearts and pockets open for their brothers in distress.",
                "Even small assistance during hard times can save someone's livelihood.",
                "Allah continues to help a servant as long as the servant is helping his brother."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "اسلامی معیشت صرف نفع کمانے کا نام نہیں بلکہ یہ عدل، ہمدردی اور تعاون پر مبنی ہے۔",
                "قرض کی ادائیگی میں سچائی اور وصولی میں نرمی ہی برکت کا راستہ ہے۔",
                "ایک مثالی معاشرہ وہی ہے جہاں کوئی شخص معاشی بوجھ تلے دب کر تنہا نہ رہ جائے۔"
              ],
              "english": [
                "Islamic economics is not just about profit; it is based on justice, empathy, and cooperation.",
                "Integrity in repayment and leniency in collection is the path to blessing.",
                "An ideal society is one where no individual is left alone to crumble under economic burdens."
              ]
            }
          }
        ]
      }
    }
  ]
}