{
  "hadithId": 248,
  "hadithNo": 39,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/39"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (6/18)، وأبو داود (1481)، والنسائي (3/44)، والترمذي (3477)، وصححه ابن حبان (1960) والحاكم (1/230).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد، نسائی اور ترمذی نے روایت کیا ہے۔ ترمذی، ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (6/18), Abu Dawud (1481), An-Nasa'i (3/44), and At-Tirmidhi (3477). Graded authentic by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "يَدْعُو",
      "english": "Supplicating",
      "urdu": "دعا کر رہا ہے"
    },
    {
      "arabic": "لَمْ يَحْمَدِ",
      "english": "Did not praise",
      "urdu": "حمد نہیں کی"
    },
    {
      "arabic": "عَجِلَ",
      "english": "Was hasty",
      "urdu": "جلدی کی"
    },
    {
      "arabic": "بِتَحْمِيدِ",
      "english": "By praising",
      "urdu": "حمد کے ساتھ"
    },
    {
      "arabic": "الثَّنَاءِ",
      "english": "Glorification",
      "urdu": "ثنا / تعریف"
    },
    {
      "arabic": "يُصَلِّي",
      "english": "Invoke blessings",
      "urdu": "درود بھیجنا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں دعا مانگنے کا صحیح اسلامی طریقہ اور آداب سکھائے گئے ہیں، جس میں اللہ کی حمد اور نبی ﷺ پر درود کو دعا کی قبولیت کے لیے لازمی قرار دیا گیا ہے۔",
    "english": "This Hadith teaches the proper Islamic etiquette of supplication, making the praise of Allah and blessings upon the Prophet (PBUH) prerequisites for acceptance."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1481)",
      "english": "Sunan Abu Dawud (1481)"
    },
    {
      "arabic": "جامع الترمذي (3477)",
      "english": "Jami' at-Tirmidhi (3477)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "فضالة بن عبيد الأنصاري",
        "english": "Fadalah bin 'Ubaid al-Ansari"
      },
      "slug": "fadalah-bin-ubaid"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=dua+mangne+ka+sahi+tareeka+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعا کے آدابِ نبوی",
        "english": "Prophetic Etiquettes of Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی حمد سے آغاز",
              "english": "Starting with Praise of Allah"
            },
            "content": {
              "urdu": [
                "دعا شروع کرنے کا بہترین طریقہ یہ ہے کہ پہلے اللہ کی بڑائی بیان کی جائے۔",
                "بندے کو چاہیے کہ وہ اللہ کی نعمتوں کا اقرار اور اس کی ثنا کرے۔",
                "یہ عمل بندے کی عاجزی اور اللہ کی عظمت کے اعتراف کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The best way to start a supplication is by glorifying the greatness of Allah.",
                "The servant should acknowledge Allah's blessings and express His praises.",
                "This act demonstrates the servant's humility and recognition of Allah's majesty."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ پر درود کی اہمیت",
              "english": "Importance of Salawat on Prophet (PBUH)"
            },
            "content": {
              "urdu": [
                "دعا میں درود شریف شامل کرنا قبولیت کی ضمانت اور برکت کا باعث ہے۔",
                "وہ دعا ادھوری سمجھی جاتی ہے جس میں نبی کریم ﷺ پر درود نہ ہو۔",
                "درود پڑھنے سے دعا زمین اور آسمان کے درمیان معلق نہیں رہتی۔"
              ],
              "english": [
                "Including Salawat in Dua is a guarantee for acceptance and a source of blessing.",
                "A supplication is considered incomplete without blessings upon the Prophet (PBUH).",
                "Salawat ensures that the Dua does not remain suspended between heaven and earth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا میں عجلت کی ممانعت",
        "english": "Prohibition of Hastiness in Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جلدی بازی کا مطلب",
              "english": "Meaning of Hastiness"
            },
            "content": {
              "urdu": [
                "آداب کو نظر انداز کر کے براہِ راست اپنی حاجت بیان کرنا عجلت کہلاتا ہے۔",
                "اللہ کے دربار میں حاضری کے لیے آدابِ شاہی کا خیال رکھنا ضروری ہے۔",
                "نبی ﷺ نے اس شخص کو 'عجلت پسند' قرار دے کر صحیح راہ دکھائی۔"
              ],
              "english": [
                "Stating one's needs directly while ignoring etiquettes is defined as hastiness.",
                "It is necessary to observe protocol when presenting oneself in the court of Allah.",
                "The Prophet (PBUH) labeled the man 'hasty' to guide him to the right path."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم اور نرمی کا انداز",
              "english": "Teaching with Gentleness"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے اس شخص کو غصہ کرنے کے بجائے محبت سے بلا کر سمجھایا۔",
                "یہ حدیث مبلغین کے لیے بہترین سبق ہے کہ غلطی پر اصلاح کیسے کریں۔",
                "نرمی سے دی گئی نصیحت دلوں پر زیادہ اثر انداز ہوتی ہے۔"
              ],
              "english": [
                "Instead of showing anger, the Prophet (PBUH) called the man kindly to explain.",
                "This Hadith is a great lesson for preachers on how to correct mistakes.",
                "Advice given with gentleness has a more profound impact on the heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبولیتِ دعا کے شرائط",
        "english": "Conditions for Acceptance of Dua"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترتیب کی پابندی",
              "english": "Adherence to Sequence"
            },
            "content": {
              "urdu": [
                "پہلے حمد، پھر درود اور آخر میں اپنی حاجت مانگنا مسنون ترتیب ہے۔",
                "اس ترتیب پر عمل کرنے سے دعا کی تاثیر اور قوت بڑھ جاتی ہے۔",
                "یہ طریقہ کار اللہ کی محبت اور رسول ﷺ کی اتباع کا مجموعہ ہے۔"
              ],
              "english": [
                "The Sunnah sequence is praise first, then Salawat, and finally the request.",
                "Following this order increases the effectiveness and power of the Dua.",
                "This procedure combines the love of Allah and the following of the Messenger."
              ]
            }
          },
          {
            "title": {
              "urdu": "مانگنے کی آزادی",
              "english": "Freedom of Request"
            },
            "content": {
              "urdu": [
                "آداب پورے کرنے کے بعد بندہ اللہ سے کچھ بھی جائز چیز مانگ سکتا ہے۔",
                "اللہ سے مانگنے میں کسی قسم کی ہچکچاہٹ یا کنجوسی نہیں کرنی چاہیے۔",
                "بندہ جتنا بڑا سوال کرے گا، اللہ کی رحمت اتنی ہی وسیع ہے۔"
              ],
              "english": [
                "After fulfilling the etiquettes, a servant can ask Allah for anything permissible.",
                "One should not hesitate or be stingy when asking from Allah Almighty.",
                "The greater the request made by the servant, the vaster is Allah's mercy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کے اندر دعا",
              "english": "Dua Within Prayer"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ نماز کے آخر میں تشہد کے بعد دعا مانگنا سنت ہے۔",
                "نماز اللہ سے گفتگو کا بہترین ذریعہ ہے، اس میں آداب کا خاص خیال رکھیں۔",
                "فرض نمازوں کے بعد اور دورانِ نماز دعائیں قبولیت کے قریب ہوتی ہیں۔"
              ],
              "english": [
                "This Hadith proves that supplicating at the end of prayer after Tashahhud is Sunnah.",
                "Prayer is the best medium for talking to Allah; observe its etiquettes carefully.",
                "Supplications during and after obligatory prayers are close to acceptance."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم و تربیت کا جذبہ",
              "english": "Spirit of Education and Training"
            },
            "content": {
              "urdu": [
                "ہمیں دوسروں کی اصلاح کے لیے ہمیشہ تیار اور مستعد رہنا چاہیے۔",
                "غلطی کی نشاندہی کے ساتھ درست طریقہ بتانا بھی ضروری ہے۔",
                "علم پھیلانا صدقہ جاریہ ہے اور سنتِ نبوی ﷺ کا اہم حصہ ہے۔"
              ],
              "english": [
                "We must always be ready and prepared to reform and help others.",
                "It is necessary to show the correct way along with pointing out the mistake.",
                "Spreading knowledge is a continuous charity and a vital part of the Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
