{
  "hadithId": 714,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/7/82"],
    "kitabId": 7,
    "inKitabBab": 4,
    "arabicBook": "كتاب البيوع",
    "babId": 45
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2194)، ومسلم (1534). واللفظ للبخاري، وفي رواية مسلم زيادة توضح معنى الصلاح.",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری (2194) اور امام مسلم (1534) نے روایت کیا ہے۔ یہ روایت پھلوں کی بیع کے حوالے سے ایک اہم ضابطہ بیان کرتی ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2194) and Muslim (1534). The wording is primarily from Bukhari, with Muslim's version providing additional clarity on the definition of 'ripening'."
  },
  "importantWords": [
    {
      "arabic": "الثِّمَارِ",
      "english": "Fruits",
      "urdu": "پھل"
    },
    {
      "arabic": "يَبْدُوَ",
      "english": "Appears / Becomes apparent",
      "urdu": "ظاہر ہو جائے"
    },
    {
      "arabic": "صَلَاحُهَا",
      "english": "Their ripening / fitness",
      "urdu": "ان کا پکنا یا درست ہونا"
    },
    {
      "arabic": "الْمُبْتَاعَ",
      "english": "The buyer",
      "urdu": "خریدار"
    },
    {
      "arabic": "عَاهَتُهُ",
      "english": "Blight / Pestilence",
      "urdu": "آفت یا بیماری"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں پھلوں کو درخت پر پکنے کی علامات ظاہر ہونے سے پہلے فروخت کرنے کی ممانعت ہے، تاکہ غیر یقینی صورتحال (غرر) اور مالی نقصان کی وجہ سے ہونے والے جھگڑوں سے بچا جا سکے۔",
    "english": "This Hadith prohibits selling fruit on trees before signs of ripening appear, aiming to eliminate uncertainty (Gharar) and prevent financial disputes caused by unexpected crop failure."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب البيوع",
      "english": "Sahih al-Bukhari, Book of Sales"
    },
    {
      "arabic": "صحيح مسلم، كتاب البيوع",
      "english": "Sahih Muslim, Book of Sales"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R41_fUv9C3I",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "بیعِ ثمار کا شرعی ضابطہ",
        "english": "Sharia Rule on Fruit Sales"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پکنے سے پہلے بیع کی ممانعت",
              "english": "Prohibition Before Ripening"
            },
            "content": {
              "urdu": [
                "پھلوں کا سودا اس وقت تک جائز نہیں جب تک ان کا پکنا یقینی نہ ہو جائے۔",
                "پھل کچے ہوں تو ان پر موسمی آفات (اولے، بیماری) کا خطرہ زیادہ ہوتا ہے۔",
                "ایسا سودا بیعِ غرر (دھوکے والی بیع) کی ایک صورت ہے جس سے اسلام روکتا ہے۔"
              ],
              "english": [
                "Selling fruit is not permissible until its maturity is certain.",
                "Immature fruits are highly susceptible to weather calamities or pests.",
                "Such a sale is a form of 'Gharar' (uncertain transaction) which Islam forbids."
              ]
            }
          },
          {
            "title": {
              "urdu": "صلاح (پکنے) کی علامات",
              "english": "Signs of Ripening"
            },
            "content": {
              "urdu": [
                "کھجوروں میں صلاح کا مطلب ان کا سرخ یا زرد ہونا ہے۔",
                "دیگر پھلوں میں ان کا میٹھا ہونا یا کھانے کے قابل ہونا مراد ہے۔",
                "بنیادی مقصد یہ ہے کہ پھل اس مرحلے پر پہنچ جائے جہاں وہ عموماً محفوظ ہو جاتا ہے۔"
              ],
              "english": [
                "In dates, ripening is signaled by turning red or yellow.",
                "In other fruits, it means becoming sweet or edible.",
                "The core objective is the fruit reaching a stage where it is generally safe from destruction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ممانعت کی حکمت اور مقاصد",
        "english": "Wisdom and Objectives of Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنازعات کا خاتمہ",
              "english": "Eliminating Disputes"
            },
            "content": {
              "urdu": [
                "اگر کچے پھل بیچ دیے جائیں اور پھر وہ آفت سے ضائع ہو جائیں تو خریدار رقم واپس مانگتا ہے۔",
                "اس سے بیچنے والے اور خریدار کے درمیان شدید جھگڑے پیدا ہوتے تھے۔",
                "اسلامی قانون کا مقصد معاشرے میں امن اور مالی تحفظ کو یقینی بنانا ہے۔"
              ],
              "english": [
                "If immature fruits are sold and then destroyed by blight, the buyer demands a refund.",
                "This historically led to severe animosity between trading parties.",
                "Islamic law aims to ensure peace and financial security within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیچنے والے اور خریدار دونوں کو ممانعت",
              "english": "Prohibition for Both Parties"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے صرف بیچنے والے کو نہیں بلکہ خریدار کو بھی منع فرمایا۔",
                "تاکہ کوئی بھی فریق دوسرے کے لیے یا اپنے لیے خطرہ مول نہ لے۔",
                "یہ حکم مسلمانوں کو سٹہ بازی اور جوئے جیسی صورتحال سے بچانے کے لیے ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) forbade both the seller and the buyer from this practice.",
                "This ensures neither party incurs or causes unnecessary risk.",
                "The ruling protects Muslims from speculative practices akin to gambling."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آفت کی صورت میں رعایت",
        "english": "Concession in Case of Blight"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضعِ جائحات کا اصول",
              "english": "Principle of Offsetting Calamities"
            },
            "content": {
              "urdu": [
                "دیگر احادیث کے مطابق اگر سودا ہونے کے بعد آفت آ جائے تو قیمت واپس ہونی چاہیے۔",
                "بیچنے والے کے لیے یہ حلال نہیں کہ وہ اپنے بھائی کا مال بغیر کسی عوض کے کھائے۔",
                "عدل کا تقاضا ہے کہ نقصان کا بوجھ صرف خریدار پر نہ ڈالا جائے۔"
              ],
              "english": [
                "Other Hadiths state that if blight strikes after a valid sale, the price should be adjusted.",
                "It is not lawful for a seller to consume his brother's wealth for nothing.",
                "Justice requires that the burden of total loss should not fall solely on the buyer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروبار میں شفافیت",
              "english": "Transparency in Business"
            },
            "content": {
              "urdu": [
                "ایماندار تاجر کو چاہیے کہ وہ مال کے معیار اور مقدار کا صحیح اندازہ ہونے پر سودا کرے۔",
                "نامعلوم نتائج پر مبنی سرمایہ کاری سے بچنا تقویٰ کا حصہ ہے۔",
                "برکت ہمیشہ ان سودوں میں ہوتی ہے جو واضح اور یقینی ہوں۔"
              ],
              "english": [
                "An honest merchant should trade only when quality and quantity are identifiable.",
                "Avoiding investments based on unknown outcomes is part of piety.",
                "Blessings reside in transactions that are clear and certain."
              ]
            }
          }
        ]
      }
    }
  ]
}