{
  "hadithId": 1098,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/19"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (4031)، ومسلم (1746). وزادا: وهي البويرة. فأنزل الله عز وجل: {مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ}.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (4031) اور امام مسلم (1746) نے روایت کیا ہے۔ اس مقام کا نام 'بویرہ' تھا۔ اس پر اللہ تعالیٰ نے سورہ الحشر کی آیت نمبر 5 نازل فرمائی کہ جو درخت تم نے کاٹے یا چھوڑ دیے وہ اللہ کے حکم سے تھا۔",
    "english": "Sahih. Reported by Al-Bukhari (4031) and Muslim (1746). They added: The place was called Al-Buwayrah. Regarding this, Allah revealed: 'What you cut down of [their] palm trees or left them standing on their trunks - it was by permission of Allah' (59:5)."
  },
  "importantWords": [
    {
      "arabic": "حَرَقَ",
      "english": "Burnt",
      "urdu": "جلا دیا"
    },
    {
      "arabic": "نَخْلَ",
      "english": "Date-palms",
      "urdu": "کھجور کے درخت"
    },
    {
      "arabic": "بَنِي اَلنَّضِيرِ",
      "english": "Banu al-Nadir",
      "urdu": "بنو نضیر (یہودی قبیلہ)"
    },
    {
      "arabic": "قَطَعَ",
      "english": "Cut down",
      "urdu": "کاٹ دیا"
    },
    {
      "arabic": "لِينَةٍ",
      "english": "Fine palm tree",
      "urdu": "کھجور کا عمدہ درخت"
    }
  ],
  "summary": {
    "urdu": "بنو نضیر کی بدعہدی اور غداری کے بعد ان کے قلعے کے محاصرے کے دوران جنگی مصلحت کے تحت ان کے باغات کو جلانے اور کاٹنے کا حکم دیا گیا، جسے اللہ تعالیٰ نے قرآن میں جائز قرار دیا۔",
    "english": "Following the treachery of Banu al-Nadir, their orchards were burnt and cut down during the siege as a strategic military move, which Allah subsequently validated in the Quran."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (4031)",
      "english": "Sahih al-Bukhari (4031)"
    },
    {
      "arabic": "صحيح مسلم (1746)",
      "english": "Sahih Muslim (1746)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah bin Umar"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F7iS_Gg0B_4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جنگی مصلحت اور تخریب",
        "english": "Military Necessity and Destruction"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دشمن پر نفسیاتی دباؤ",
              "english": "Psychological Pressure on Enemy"
            },
            "content": {
              "urdu": [
                "بنو نضیر نے معاہدہ توڑ کر نبی ﷺ کو قتل کرنے کی سازش کی تھی۔",
                "ان کے باغات کاٹنا انہیں قلعہ بند رہنے کے بجائے باہر نکلنے پر مجبور کرنا تھا۔",
                "یہ عمل دشمن کے معاشی وسائل کو کمزور کرنے کی ایک جنگی حکمت عملی تھی۔"
              ],
              "english": [
                "Banu al-Nadir violated their treaty and conspired to assassinate the Prophet (ﷺ).",
                "Cutting their orchards was intended to force them out of their fortified positions.",
                "This action served as a strategic military move to weaken the enemy's economic resources."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرعی استثناء اور حدود",
              "english": "Shariah Exception and Limits"
            },
            "content": {
              "urdu": [
                "عام حالات میں پھلدار درختوں کو کاٹنا اور آگ لگانا اسلام میں منع ہے۔",
                "لیکن جب جنگی ضرورت اور فتنے کے خاتمے کا معاملہ ہو تو یہ جائز ہو جاتا ہے۔",
                "یہ حدیث ثابت کرتی ہے کہ اسلام میں جنگ کے قوانین ضرورت کے تابع ہوتے ہیں۔"
              ],
              "english": [
                "In normal circumstances, cutting fruit-bearing trees or burning them is forbidden in Islam.",
                "However, it becomes permissible when it serves a direct military necessity or ends mischief.",
                "This Hadith proves that laws of war in Islam are subject to strategic necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرآنی تائید اور حکمت",
        "english": "Quranic Validation and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کے حکم کی توثیق",
              "english": "Validation of Allah's Command"
            },
            "content": {
              "urdu": [
                "یہود نے درخت کاٹنے پر طعنہ دیا کہ اسلام تو فساد سے منع کرتا ہے۔",
                "اس پر اللہ نے سورہ الحشر کی آیت نازل فرمائی کہ یہ سب اللہ کے اذن سے تھا۔",
                "یہ وحی صحابہ کے اس عمل پر مہرِ تصدیق تھی کہ یہ فساد نہیں بلکہ جہاد تھا۔"
              ],
              "english": [
                "The Jews mocked the Muslims for cutting trees, claiming Islam forbids corruption.",
                "Allah responded by revealing verses in Surah Al-Hashr, stating it was by His permission.",
                "This revelation confirmed that the action was a legitimate part of Jihad, not corruption."
              ]
            }
          },
          {
            "title": {
              "urdu": "فاسقوں کی ذلت",
              "english": "Humiliation of the Transgressors"
            },
            "content": {
              "urdu": [
                "قرآن کے مطابق اس کا ایک مقصد غداروں اور فاسقوں کو رسوا کرنا تھا۔",
                "باغات کا کٹنا ان کی طاقت اور غرور کے خاتمے کی علامت تھا۔",
                "اللہ تعالیٰ اپنے رسول کی نصرت کے لیے ایسے اسباب پیدا فرماتا ہے۔"
              ],
              "english": [
                "According to the Quran, one purpose was to humiliate the rebellious transgressors.",
                "The destruction of the orchards symbolized the end of their power and pride.",
                "Allah creates such means to grant victory and support to His Messenger."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مستقل جنگی قوانین",
        "english": "Permanent Laws of Warfare"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حالات کی تبدیلی کا اثر",
              "english": "Impact of Changing Circumstances"
            },
            "content": {
              "urdu": [
                "خلفائے راشدین نے بعد کی جنگوں میں عموماً درخت کاٹنے سے منع فرمایا۔",
                "بنو نضیر کا واقعہ ایک خاص مصلحت اور حکمِ الٰہی کے تحت پیش آیا۔",
                "مسلم سپہ سالار کو حالات کے مطابق بہترین فیصلہ کرنے کا اختیار حاصل ہے۔"
              ],
              "english": [
                "The Rightly Guided Caliphs generally forbade cutting trees in subsequent wars.",
                "The Banu al-Nadir incident occurred under specific necessity and Divine command.",
                "A Muslim commander has the authority to make the best decision based on context."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیر ضروری نقصان سے بچنا",
              "english": "Avoiding Unnecessary Damage"
            },
            "content": {
              "urdu": [
                "اسلامی جنگ کا مقصد زمین کی آباد کاری ہے نہ کہ اسے اجاڑنا۔",
                "صرف وہی درخت کاٹے گئے جو جنگی رکاوٹ تھے یا جن سے دشمن کو فائدہ پہنچ رہا تھا۔",
                "بلا ضرورت سبزہ اور باغات کو تباہ کرنا اب بھی اسلام میں ناپسندیدہ ہے۔"
              ],
              "english": [
                "The ultimate goal of Islamic warfare is reform, not the destruction of the earth.",
                "Only trees that were tactical obstacles or provided cover to the enemy were cut.",
                "Destroying greenery and orchards without necessity remains disliked in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ایمانی اور دعوتی سبق",
        "english": "Faith and Preaching Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غداری کا انجام",
              "english": "Consequence of Treachery"
            },
            "content": {
              "urdu": [
                "بنو نضیر کو ان کی غداری کی وجہ سے نہ صرف باغات بلکہ وطن سے بھی ہاتھ دھونا پڑے۔",
                "اللہ کے رسول سے کیے گئے عہد کی خلاف ورزی دنیا میں بھی رسوائی کا باعث ہے۔",
                "تاریخ بتاتی ہے کہ مکر و فریب کرنے والے کبھی کامیاب نہیں ہوتے۔"
              ],
              "english": [
                "Banu al-Nadir lost not only their orchards but their homeland due to treachery.",
                "Violating a covenant made with the Messenger of Allah leads to disgrace in this world.",
                "History shows that those who rely on deception and plots never truly succeed."
              ]
            }
          },
          {
            "title": {
              "urdu": "اطاعتِ رسول کی اہمیت",
              "english": "Importance of Obedience"
            },
            "content": {
              "urdu": [
                "صحابہ نے آپ ﷺ کے حکم پر وہ درخت بھی کاٹ دیے جو انہیں بہت عزیز تھے۔",
                "نبی کریم ﷺ کے فیصلے پر سرِ تسلیم خم کرنا ہی ایمان کا خاصہ ہے۔",
                "مسلمانوں کی کامیابی کا راز اللہ اور اس کے رسول کی مکمل فرمانبرداری میں ہے۔"
              ],
              "english": [
                "The Sahaba cut down trees they cherished based solely on the Prophet's (ﷺ) command.",
                "Submitting to the decisions of the Prophet (ﷺ) is the hallmark of true faith.",
                "The secret of Muslim success lies in complete obedience to Allah and His Messenger."
              ]
            }
          }
        ]
      }
    }
  ]
}