{
  "hadithId": 395,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-2/hadith-395"],
    "kitabId": 2,
    "inKitabBab": 14,
    "arabicBook": "بلوغ المرام",
    "babId": 24
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (1151)‏، والترمذي في العلل (1/288) وصححه البخاري فيما نقله الترمذي، وله شواهد من حديث عائشة وابن عباس تقويه.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد نے روایت کیا اور امام بخاری نے اسے صحیح قرار دیا ہے۔ حضرت عائشہ اور ابن عباس سے مروی دیگر روایات اس کی تائید کرتی ہیں۔",
    "english": "Sahih. Reported by Abu Dawud (1151). At-Tirmidhi narrated that Al-Bukhari authenticated it. It is supported by several other narrations from Aisha and Ibn Abbas."
  },
  "importantWords": [
    {
      "arabic": "اَلتَّكْبِيرُ",
      "english": "Saying Allahu Akbar",
      "urdu": "تکبیر کہنا"
    },
    {
      "arabic": "سَبْعٌ",
      "english": "Seven",
      "urdu": "سات"
    },
    {
      "arabic": "خَمْسٌ",
      "english": "Five",
      "urdu": "پانچ"
    },
    {
      "arabic": "اَلْآخِرَةِ",
      "english": "The second (last)",
      "urdu": "دوسری (آخری)"
    },
    {
      "arabic": "اَلْقِرَاءَةُ",
      "english": "Recitation",
      "urdu": "قرآت"
    }
  ],
  "summary": {
    "urdu": "عید کی نماز میں زائد تکبیرات کا مسنون طریقہ پہلی رکعت میں سات اور دوسری میں پانچ ہے، جو قرآت سے پہلے کہی جائیں گی۔",
    "english": "The Sunnah for Eid prayer is to say seven Takbirs in the first rak'a and five in the second, both performed before the recitation."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1151)",
      "english": "Sunan Abu Dawud (1151)"
    },
    {
      "arabic": "سنن الترمذي (العلل 1/288)",
      "english": "Sunan At-Tirmidhi (Al-Ilal 1/288)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah ibn Amr ibn al-Aas"
      },
      "slug": "abdullah-ibn-amr"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=eid+prayer+takbeerat+sunnah+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تکبیراتِ عید کی تعداد",
        "english": "Number of Eid Takbirat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنون تعداد کا ثبوت",
              "english": "Evidence for the Sunnah Number"
            },
            "content": {
              "urdu": [
                "نبی ﷺ سے عیدین میں زائد تکبیرات کہنا کثرت سے ثابت ہے۔",
                "پہلی رکعت میں سات اور دوسری میں پانچ تکبیرات اکثر صحابہ کا عمل رہا ہے۔",
                "یہ زائد تکبیرات عید کی نماز کو دیگر نمازوں سے ممتاز کرتی ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) frequently said extra Takbirat during the two Eids.",
                "Seven Takbirat in the first and five in the second was the practice of most Sahaba.",
                "These extra Takbirat distinguish the Eid prayer from other regular prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبیرِ تحریمہ اور رکوع کی تکبیر",
              "english": "Takbir-e-Tahrimah and Ruku Takbir"
            },
            "content": {
              "urdu": [
                "پہلی رکعت کی سات تکبیرات میں تکبیرِ تحریمہ بھی شامل کی جاتی ہے۔",
                "دوسری رکعت کی پانچ تکبیرات سجدے سے اٹھنے کے بعد کہی جاتی ہیں۔",
                "مختلف فقہی آراء کے باوجود اس حدیث پر عمل کرنا سنت کے قریب ترین ہے۔"
              ],
              "english": [
                "The seven Takbirat of the first rak'a often include the Takbir-e-Tahrimah.",
                "The five Takbirat of the second rak'a are said after rising from prostration.",
                "Despite varying juristic views, acting on this Hadith is closest to the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرآت اور تکبیرات کی ترتیب",
        "english": "Order of Recitation and Takbirat"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکبیرات پہلے کہنا",
              "english": "Saying Takbirat First"
            },
            "content": {
              "urdu": [
                "سنت طریقہ یہ ہے کہ تکبیرات کہنے کے بعد سورہ فاتحہ شروع کی جائے۔",
                "اگر امام بھول کر قرآت شروع کر دے تو تکبیرات فوت نہیں ہوتیں۔",
                "تکبیرات کے درمیان اللہ کی حمد و ثنا کرنا مستحب عمل ہے۔"
              ],
              "english": [
                "The Sunnah method is to begin Surah Al-Fatihah after completing the Takbirat.",
                "If the Imam begins recitation by mistake, the Takbirat are still performed.",
                "Praising Allah between each Takbir is a recommended and virtuous act."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی خوبصورتی",
              "english": "Beauty of the Prayer"
            },
            "content": {
              "urdu": [
                "تکبیرات کی بلند آواز مسلمانوں میں جوش اور ایمانی روح پیدا کرتی ہے۔",
                "یہ ترتیب اللہ کی بڑائی اور عظمت کے اعتراف کا بہترین ذریعہ ہے۔",
                "عید کی نماز کا یہ منفرد طریقہ بندگی کے جذبے کو جلا بخشتا ہے۔"
              ],
              "english": [
                "The loud Takbirat create enthusiasm and a spiritual spirit among Muslims.",
                "This sequence is an excellent way to acknowledge Allah's greatness.",
                "This unique method of Eid prayer revives the passion for servitude."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور وسعت",
        "english": "Juristic Differences and Scope"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیگر فقہی مذاہب",
              "english": "Other Juristic Schools"
            },
            "content": {
              "urdu": [
                "احناف کے نزدیک چھ زائد تکبیرات (تین پہلی اور تین دوسری میں) کہی جاتی ہیں۔",
                "یہ اختلاف روایات کے تنوع اور صحابہ کے مختلف عمل کی بنیاد پر ہے۔",
                "تمام معتبر فقہی مذاہب کا احترام کرنا اور اتحاد برقرار رکھنا ضروری ہے۔"
              ],
              "english": [
                "The Hanafis perform six extra Takbirat (three in the first, three in the second).",
                "This difference is based on the diversity of narrations and Sahaba's practices.",
                "It is essential to respect all valid juristic schools and maintain unity."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحادِ امت کی ترجیح",
              "english": "Priority of Ummah's Unity"
            },
            "content": {
              "urdu": [
                "تکبیرات کی تعداد کے مسئلے کو تفرقہ بازی کا ذریعہ نہیں بنانا چاہیے۔",
                "مقتدی کو چاہیے کہ وہ اپنے امام کی پیروی کرے تاکہ اختلاف پیدا نہ ہو۔",
                "دین میں آسانی اور وسعت اللہ کی طرف سے ایک بڑی رحمت ہے۔"
              ],
              "english": [
                "The issue of the number of Takbirat should not be a cause for sectarianism.",
                "The follower should follow their Imam to prevent any communal discord.",
                "Ease and scope within the religion are great mercies from Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تربیتی پہلو",
        "english": "Educational and Training Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحقیق کی اہمیت",
              "english": "Importance of Research"
            },
            "content": {
              "urdu": [
                "محدثین نے ان روایات کی صحت کو جانچنے کے لیے غیر معمولی محنت کی ہے۔",
                "امام بخاری کی تصحیح اس حدیث کی علمی قوت پر مہرِ تصدیق ہے۔",
                "ہمیں مستند ذرائع سے دین سیکھنے کا اہتمام کرنا چاہیے۔"
              ],
              "english": [
                "Hadith scholars put extraordinary effort into verifying these narrations.",
                "Al-Bukhari's authentication confirms the academic strength of this Hadith.",
                "We should ensure we learn our religion from authentic and reliable sources."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعمال کی روح",
              "english": "Spirit of Actions"
            },
            "content": {
              "urdu": [
                "تکبیرات کا مقصد صرف گنتی پوری کرنا نہیں بلکہ دل سے اللہ کی بڑائی بیان کرنا ہے۔",
                "عید کا دن تکبیر، تحمید اور تسبیح کے ذریعے اللہ کو یاد کرنے کا دن ہے۔",
                "سنت پر عمل پیرا ہونا ہی بندگی کا اصل کمال اور کامیابی ہے۔"
              ],
              "english": [
                "The goal of Takbirat is not just counting but praising Allah from the heart.",
                "Eid is a day to remember Allah through Takbir, Tahmid, and Tasbih.",
                "Adhering to the Sunnah is the true perfection of servitude and success."
              ]
            }
          }
        ]
      }
    }
  ]
}
