{
  "hadithId": 567,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["bulugh/567"],
    "kitabId": 5,
    "inKitabBab": 2,
    "arabicBook": "بلوغ المرام - كتاب الصيام",
    "babId": 34
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1977)، ومسلم (1159). ورواية أبي قتادة عند مسلم (1162).",
    "urdu": "صحیح۔ اسے بخاری (1977) اور مسلم (1159) نے روایت کیا ہے۔ صومِ دہر (ہمیشہ روزہ رکھنے) کی ممانعت میں یہ ایک بنیادی روایت ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1977) and Muslim (1159). The narration of Abu Qatadah is in Muslim (1162)."
  },
  "importantWords": [
    {
      "arabic": "لَا صَامَ",
      "english": "Has not fasted",
      "urdu": "روزہ نہیں رکھا"
    },
    {
      "arabic": "اَلْأَبَدَ",
      "english": "Perpetually / Forever",
      "urdu": "ہمیشہ / سارا سال"
    },
    {
      "arabic": "أَفْطَرَ",
      "english": "Broke the fast",
      "urdu": "افطار کیا"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "بِلَفْظِ",
      "english": "With the wording",
      "urdu": "ان الفاظ کے ساتھ"
    }
  ],
  "summary": {
    "urdu": "سارا سال بلا ناغہ روزہ رکھنا (صومِ دہر) شرعی طور پر ناپسندیدہ ہے کیونکہ یہ سنت کے خلاف ہے اور اس سے جسمانی قوت زائل ہوتی ہے۔",
    "english": "Fasting every single day of the year (perpetual fasting) is discouraged as it contradicts the Sunnah and leads to physical exhaustion."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1977)",
      "english": "Reported by Al-Bukhari (1977)"
    },
    {
      "arabic": "رواه مسلم (1159)",
      "english": "Reported by Muslim (1159)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-As"
      },
      "slug": "abdullah-bin-amr-bin-al-as"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abu Qatadah al-Ansari"
      },
      "slug": "abu-qatadah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYI7H7_nO6o",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ہمیشہ روزہ رکھنے کی شرعی حیثیت",
        "english": "Legal Status of Perpetual Fasting"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صومِ دہر کی ممانعت",
              "english": "Prohibition of Saum al-Dahr"
            },
            "content": {
              "urdu": [
                "صومِ دہر سے مراد وہ روزہ ہے جو سارا سال رکھا جائے اور اس میں کوئی ناغہ نہ ہو۔",
                "نبی ﷺ نے اسے ناپسند فرمایا کیونکہ یہ انسانی فطرت اور جسمانی حقوق کے خلاف ہے۔",
                "مسلسل روزہ رکھنے سے انسان دیگر فرائض اور سماجی حقوق کی ادائیگی سے قاصر ہو سکتا ہے۔"
              ],
              "english": [
                "Saum al-Dahr refers to fasting every day of the year without any break.",
                "The Prophet (ﷺ) disliked this as it goes against human nature and bodily rights.",
                "Continuous fasting can make a person unable to fulfill other religious and social duties."
              ]
            }
          },
          {
            "title": {
              "urdu": "نہ روزہ، نہ افطار کا مفہوم",
              "english": "Meaning of 'Neither Fasted Nor Broken'"
            },
            "content": {
              "urdu": [
                "اس جملے کا مطلب یہ ہے کہ ایسا شخص روزے کے اجر سے محروم رہتا ہے۔",
                "اس کا بدن روزے کا عادی ہو جاتا ہے اور اسے بھوک پیاس کی وہ مشقت محسوس نہیں ہوتی جو مقصود ہے۔",
                "یہ عمل سنت کے خلاف ہونے کی وجہ سے مقبولیت کے درجے تک نہیں پہنچ پاتا۔"
              ],
              "english": [
                "This phrase implies that such a person is deprived of the spiritual reward of fasting.",
                "The body becomes so accustomed to it that the intended hardship of hunger is no longer felt.",
                "Since the action contradicts the Sunnah, it does not achieve the level of divine acceptance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عبادت میں میانہ روی کی اہمیت",
        "english": "Importance of Moderation in Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعتدال پسندانہ راستہ",
              "english": "The Moderate Path"
            },
            "content": {
              "urdu": [
                "اسلام ہر معاملے میں میانہ روی اور اعتدال کی تعلیم دیتا ہے۔",
                "نفلی عبادات اتنی ہی ہونی چاہئیں جو زندگی کے دیگر معاملات میں خلل نہ ڈالیں۔",
                "نبی ﷺ نے فرمایا کہ تمہارے جسم کا بھی تم پر حق ہے۔"
              ],
              "english": [
                "Islam teaches moderation and balance in every aspect of life.",
                "Voluntary worship should not be so excessive that it disrupts daily life responsibilities.",
                "The Prophet (ﷺ) reminded us that 'Your body has a right over you'."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی کی پیروی",
              "english": "Following the Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "بہترین روزہ 'صومِ داؤدی' ہے جس میں ایک دن روزہ رکھا جاتا ہے اور ایک دن ناغہ۔",
                "نبی ﷺ خود بھی روزے رکھتے تھے اور چھوڑتے بھی تھے تاکہ توازن برقرار رہے۔",
                "سنت کے مطابق کی گئی تھوڑی عبادت، خلافِ سنت کی گئی بہت زیادہ مشقت سے بہتر ہے۔"
              ],
              "english": [
                "The best fast is that of Prophet Dawud (AS)—fasting one day and not the next.",
                "The Prophet (ﷺ) himself fasted some days and ate on others to maintain balance.",
                "A small act of worship according to Sunnah is better than great hardship against it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور مستثنیات",
        "english": "Juristic Aspects and Exceptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرام ایام کے روزے",
              "english": "Fasting on Forbidden Days"
            },
            "content": {
              "urdu": [
                "صومِ دہر کی ممانعت کی ایک بڑی وجہ یہ بھی ہے کہ اس میں عیدین اور ایامِ تشریق شامل ہو جاتے ہیں۔",
                "ان پانچ دنوں میں روزہ رکھنا شرعاً حرام ہے۔",
                "ہمیشہ روزہ رکھنے والا شخص نادانستہ طور پر ان حرام ایام میں بھی روزہ رکھ لیتا ہے۔"
              ],
              "english": [
                "A major reason for the prohibition is that it includes the days of Eid and Tashriq.",
                "Fasting on these five specific days of the year is strictly forbidden (Haram).",
                "One who fasts perpetually inadvertently fasts on these forbidden days as well."
              ]
            }
          },
          {
            "title": {
              "urdu": "قوتِ ایمانی اور ہمت",
              "english": "Spiritual Strength and Capacity"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص ان حرام دنوں کو چھوڑ کر روزہ رکھے اور اسے نقاہت نہ ہو تو بعض علماء اسے جائز کہتے ہیں۔",
                "مگر پسندیدہ عمل وہی ہے جس کی ترغیب نبی ﷺ نے اپنے اقوال سے دی ہے۔",
                "دین میں غلو (حد سے بڑھنا) ہمیشہ گمراہی یا نقصان کا باعث بنتا ہے۔"
              ],
              "english": [
                "If someone excludes forbidden days and remains strong, some scholars permit it.",
                "However, the most preferred practice is what the Prophet (ﷺ) explicitly encouraged.",
                "Religious extremism (Ghuluw) always leads to misguidance or personal harm."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقصدِ عبادت",
              "english": "Purpose of Worship"
            },
            "content": {
              "urdu": [
                "عبادت کا مقصد تقویٰ کا حصول ہے، نہ کہ محض جسم کو پیاسا رکھنا۔",
                "روزے کا احساس تب ہی زندہ رہتا ہے جب درمیان میں افطار کے دن بھی ہوں۔",
                "انسان کو اپنی روحانی ترقی کے لیے مسنون طریقوں پر اکتفا کرنا چاہیے۔"
              ],
              "english": [
                "The purpose of worship is attaining Taqwa, not just keeping the body thirsty.",
                "The spiritual awareness of fasting remains alive only when there are breaks.",
                "An individual should rely on Sunnah-based methods for their spiritual growth."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفس کی اصلاح",
              "english": "Reforming the Soul"
            },
            "content": {
              "urdu": [
                "نفس کو مشقت میں ڈالنا تبھی مفید ہے جب وہ شریعت کے تابع ہو۔",
                "اپنی طرف سے گھڑی گئی سختیاں نیکی کے بجائے غرور کا باعث بن سکتی ہیں۔",
                "سنت کی پیروی عاجزی پیدا کرتی ہے جو کہ بندگی کا اصل جوہر ہے۔"
              ],
              "english": [
                "Straining the soul is only beneficial when it follows the Shariah.",
                "Self-imposed hardships can lead to arrogance instead of genuine righteousness.",
                "Following the Sunnah breeds humility, which is the true essence of servitude."
              ]
            }
          }
        ]
      }
    }
  ]
}