{
  "hadithId": 1328,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/98"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 106
  },
  
  "takhreej": {
    "arabic": "ضعيف جداً. رواه أبو يعلى (11/113) والبزار (رقم 3097 - كشف الأستار) والحاكم (1/171). في سنده عبد الله بن سعيد المقبري، وهو متروك عند المحدثين.",
    "urdu": "سخت ضعیف۔ اسے ابویعلیٰ اور حاکم نے روایت کیا ہے۔ اس کی سند میں عبداللہ بن سعید المقبری ہے جسے محدثین نے متروک قرار دیا ہے۔ البتہ اس کا مفہوم دیگر صحیح احادیث (مثلاً: نیکی کو حقیر نہ سمجھنا چاہے مسکرا کر ملنا ہو) سے ثابت ہے۔",
    "english": "Very weak. Reported by Abu Ya'la and Al-Hakim. Its chain includes Abdullah bin Sa'id al-Maqburi, who is rejected (matruk) by scholars of Hadith. However, its meaning is supported by other authentic narrations regarding the virtue of a smiling face."
  },
  "importantWords": [
    {
      "arabic": "لَا تَسَعُونَ",
      "english": "You cannot encompass/satisfy",
      "urdu": "تم گنجائش نہیں رکھ سکتے / احاطہ نہیں کر سکتے"
    },
    {
      "arabic": "بَسْطُ اَلْوَجْهِ",
      "english": "Cheerful face / Smiling face",
      "urdu": "خندہ پیشانی / مسکراتا ہوا چہرہ"
    },
    {
      "arabic": "حُسْنُ اَلْخُلُقِ",
      "english": "Good character",
      "urdu": "اچھا اخلاق"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ مال و دولت محدود ہوتی ہے، مگر حسنِ اخلاق اور مسکراہٹ وہ خزانے ہیں جن سے ہر انسان کا دل جیتا جا سکتا ہے۔",
    "english": "This Hadith teaches that while wealth is limited, good character and a cheerful countenance are treasures that can win over anyone's heart."
  },
  "references": [
    {
      "arabic": "مسند أبي يعلى، رقم 6550",
      "english": "Musnad Abu Ya'la, No. 6550"
    },
    {
      "arabic": "مستدرك الحاكم، رقم 428",
      "english": "Mustadrak al-Hakim, No. 428"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "ضعيف جداً",
    "english": "Very Weak"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مال کی محدودیت اور اخلاق کی وسعت",
        "english": "The Limitation of Wealth and Vastness of Character"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال سب کے لیے کافی نہیں",
              "english": "Wealth Cannot Suffice Everyone"
            },
            "content": {
              "urdu": [
                "دنیا کا کتنا ہی مال کیوں نہ ہو، وہ ہر انسان کی ضرورت یا خواہش پوری نہیں کر سکتا۔",
                "اگر آپ مال کے ذریعے لوگوں کو اپنا بنانا چاہیں گے تو مال ختم ہوتے ہی تعلق بھی ختم ہو جائے گا۔",
                "صرف مادی اشیاء سے سماجی ہم آہنگی پیدا نہیں کی جا سکتی۔"
              ],
              "english": [
                "No matter how much wealth there is in the world, it cannot fulfill every person's needs or desires.",
                "If you try to win people through money, the relationship will end once the money is gone.",
                "Material goods alone cannot create true social harmony."
              ]
            }
          },
          {
            "title": {
              "urdu": "خندہ پیشانی کی طاقت",
              "english": "The Power of a Cheerful Face"
            },
            "content": {
              "urdu": [
                "مسکرا کر ملنا ایک ایسی نیکی ہے جس پر کوئی خرچ نہیں آتا لیکن اس کا اثر بہت گہرا ہوتا ہے۔",
                "خندہ پیشانی سے ملنا دوسرے کے دل میں آپ کی محبت اور عزت پیدا کرتا ہے۔",
                "اسلام نے مسکراہٹ کو بھی صدقہ قرار دیا ہے تاکہ غریب انسان بھی اجر کما سکے۔"
              ],
              "english": [
                "Greeting others with a smile is a virtue that costs nothing but has a profound impact.",
                "A cheerful countenance creates love and respect for you in others' hearts.",
                "Islam has classified a smile as Sadaqah (charity) so that even the poor can earn spiritual rewards."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حسنِ اخلاق: ایک غیر ختم ہونے والا خزانہ",
        "english": "Good Character: An Everlasting Treasure"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاق سے دل جیتنا",
              "english": "Winning Hearts Through Manners"
            },
            "content": {
              "urdu": [
                "نرم گفتگو اور اچھا برتاؤ وہ کنجی ہے جس سے ہر سخت دل کو موم کیا جا سکتا ہے۔",
                "حسنِ اخلاق کا دائرہ اتنا وسیع ہے کہ یہ دشمنوں کو بھی دوست بنا دیتا ہے۔",
                "ایک مومن اپنے اچھے اخلاق کی وجہ سے ان لوگوں کے درجات پا لیتا ہے جو کثرت سے روزے رکھتے اور نمازیں پڑھتے ہیں۔"
              ],
              "english": [
                "Soft speech and kind behavior are keys that can melt the hardest hearts.",
                "The scope of good character is so vast that it can turn enemies into friends.",
                "A believer attains the ranks of those who fast and pray frequently simply through their good manners."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی زندگی میں اطلاق",
        "english": "Application in Social Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توازن برقرار رکھنا",
              "english": "Maintaining Balance"
            },
            "content": {
              "urdu": [
                "اگر آپ کسی کی مالی مدد نہیں کر سکتے تو کم از کم اس سے اچھے طریقے سے بات کریں۔",
                "اپنے رویے میں تکبر کے بجائے عاجزی پیدا کریں تاکہ لوگ آپ کے قریب آنے میں جھجھک محسوس نہ کریں۔",
                "نبوی تعلیم یہ ہے کہ انسان کا ظاہر اور باطن دونوں دوسروں کے لیے باعثِ راحت ہوں۔"
              ],
              "english": [
                "If you cannot help someone financially, at least speak to them in a kind manner.",
                "Cultivate humility instead of arrogance in your behavior so people don't hesitate to approach you.",
                "Prophetic teaching dictates that both a person's outward and inward self should be a source of comfort for others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ اور سبق",
        "english": "Summary and Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کردار کی اہمیت",
              "english": "Significance of Character"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں مادہ پرستی سے نکال کر اخلاقیات کی طرف مائل کرتی ہے۔",
                "معاشرے میں عزت مال سے نہیں بلکہ کردار سے حاصل ہوتی ہے۔",
                "سچا مسلمان وہ ہے جو اپنی مسکراہٹ اور اخلاق سے لوگوں کے لیے آسانیاں پیدا کرے۔"
              ],
              "english": [
                "This Hadith steers us away from materialism and toward ethics.",
                "Honor in society is earned through character, not wealth.",
                "A true Muslim is one who creates ease for others through their smile and manners."
              ]
            }
          }
        ]
      }
    }
  ]
}