{
  "hadithId": 745,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:3632"
    ],
    "kitabId": 7,
    "inKitabBab": 9,
    "arabicBook": "كتاب البيوع",
    "babId": 50
  },
 
  "takhreej": {
    "arabic": "رواه أبو داود (3632) وصححه، وأخرجه الدارقطني (3/45). وفي سنده محمد بن إسحاق وفيه مقال، لكن الحديث حسن لشواهده، ويدل على مشروعية التوكيل.",
    "urdu": "اسے امام ابوداؤد (3632) نے روایت کیا اور صحیح کہا ہے۔ اگرچہ اس کی سند میں محمد بن اسحاق کی وجہ سے کلام ہے، لیکن دیگر شواہد کی بنا پر اسے حسن تسلیم کیا گیا ہے۔ یہ حدیث 'وکالت' (Agency) کے جواز کی ایک اہم دلیل ہے۔",
    "english": "Reported by Abu Dawud (3632) and authenticated by him. Though Muhammad bin Ishaq is in the chain, the Hadith is considered Hasan due to supporting evidences, establishing the legality of 'Wakalah' (Agency)."
  },
  "importantWords": [
    {
      "arabic": "وَكِيلِي",
      "english": "My agent / representative",
      "urdu": "میرا وکیل / نمائندہ"
    },
    {
      "arabic": "خَيْبَرَ",
      "english": "Khaibar (a city)",
      "urdu": "خیبر (ایک بستی کا نام)"
    },
    {
      "arabic": "وَسْقًا",
      "english": "Wasaqs (unit of volume)",
      "urdu": "وسق (ایک شرعی پیمانہ)"
    },
    {
      "arabic": "أَرَدْتُ اَلْخُرُوجَ",
      "english": "I intended to go out",
      "urdu": "میں نے جانے کا ارادہ کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ کسی دوسرے شخص کو اپنے مالی معاملات میں وکیل بنانا یا نمائندہ مقرر کرنا جائز ہے، اور وکیل کے ذریعے لین دین شرعی طور پر معتبر ہوتا ہے۔",
    "english": "This Hadith proves the permissibility of appointing an agent (Wakil) to handle financial affairs and confirms that transactions made through a representative are legally valid."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3632)",
      "english": "Sunan Abi Dawud (3632)"
    },
    {
      "arabic": "سنن الدارقطني (3/45)",
      "english": "Sunan al-Daraqutni (3/45)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R_iUuN3Pz_M",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وکالت (Agency) کا شرعی تصور",
        "english": "The Concept of Agency (Wakalah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وکالت کی تعریف اور اہمیت",
              "english": "Definition and Importance"
            },
            "content": {
              "urdu": [
                "وکالت سے مراد اپنا کوئی جائز کام کسی دوسرے کے سپرد کرنا ہے تاکہ وہ آپ کی طرف سے اسے انجام دے۔",
                "نبی ﷺ نے خیبر میں اپنا وکیل مقرر کر رکھا تھا جو وہاں کے معاملات اور پیداوار کی تقسیم سنبھالتا تھا۔",
                "یہ طریقہ انسانی زندگی میں آسانی پیدا کرتا ہے، خاص طور پر جب انسان خود وہ کام نہ کر سکتا ہو۔"
              ],
              "english": [
                "Wakalah refers to delegating a permissible task to someone else to act on your behalf.",
                "The Prophet (PBUH) had an agent in Khaibar to manage affairs and distribute produce.",
                "This practice brings ease to human life, especially when one cannot personally attend to tasks."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالی معاملات میں وکالت",
              "english": "Agency in Financial Matters"
            },
            "content": {
              "urdu": [
                "خریدو فروخت، ادائیگی اور وصولی کے لیے وکیل مقرر کرنا سنت سے ثابت ہے۔",
                "وکیل کے ہاتھ سے لیا ہوا مال ایسا ہی ہے جیسے اصل مالک کے ہاتھ سے لیا گیا ہو۔",
                "اسلامی معیشت میں وکیل (Representative) کا کردار بہت کلیدی ہے۔"
              ],
              "english": [
                "Appointing agents for buying, selling, payments, and receipts is proven from the Sunnah.",
                "Receiving goods from an agent is legally the same as receiving them from the owner.",
                "The role of a representative is pivotal in the Islamic economic system."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وکیل کی ذمہ داریاں اور حدود",
        "english": "Agent's Responsibilities and Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانت داری کی شرط",
              "english": "Condition of Trustworthiness"
            },
            "content": {
              "urdu": [
                "وکیل کے پاس مالک کا مال 'امانت' ہوتا ہے، اسے پوری دیانت سے ذمہ داری نبھانی چاہیے۔",
                "وکیل کو صرف ان حدود میں کام کرنا چاہیے جو اسے اصل مالک نے بتائی ہوں۔",
                "اگر وکیل غفلت برتے تو وہ نقصان کا ذمہ دار ہوگا، ورنہ نہیں۔"
              ],
              "english": [
                "The assets held by an agent are a trust (Amanah); he must handle them with absolute integrity.",
                "The agent must operate strictly within the boundaries set by the principal owner.",
                "If the agent is negligent, he is liable for losses; otherwise, he is not."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضاحت اور شفافیت",
              "english": "Clarity and Transparency"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے پندرہ وسق کی معین مقدار بتا کر یہ سکھایا کہ وکالت میں ابہام نہیں ہونا چاہیے۔",
                "وکیل کو چاہیے کہ وہ ادائیگی یا وصولی کا مکمل ریکارڈ رکھے تاکہ کوئی جھگڑا نہ ہو۔",
                "واضح ہدایات فریقین کے درمیان اعتماد کو مضبوط کرتی ہیں۔"
              ],
              "english": [
                "By specifying 'fifteen Wasaqs', the Prophet (PBUH) taught that agency should be free of ambiguity.",
                "Agents should maintain complete records of transactions to prevent future disputes.",
                "Clear instructions strengthen the trust between all parties involved."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خیبر اور پندرہ وسق کی حکمت",
        "english": "Wisdom of Khaibar and 15 Wasaqs"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خیبر کی پیداوار کا انتظام",
              "english": "Management of Khaibar's Produce"
            },
            "content": {
              "urdu": [
                "خیبر کی زمین مسلمانوں کی ملکیت تھی جہاں سے غلہ اور کھجوریں حاصل ہوتی تھیں۔",
                "نبی ﷺ اس پیداوار سے اپنی ازواج اور مہمانوں کی ضرورتیں پوری فرماتے تھے۔",
                "یہ حدیث حکومتی سطح پر وسائل کی تقسیم کے منظم طریقے کو ظاہر کرتی ہے۔"
              ],
              "english": [
                "The lands of Khaibar were Muslim property, providing grain and dates.",
                "The Prophet (PBUH) used this produce to meet the needs of his family and guests.",
                "This Hadith illustrates a systematic method of resource distribution at a state level."
              ]
            }

          },
          {
            "title": {
              "urdu": "وصولی کا طریقہ کار",
              "english": "Protocol for Receipt"
            },
            "content": {
              "urdu": [
                "حضرت جابر کو وکیل کے پاس بھیجنا یہ بتاتا ہے کہ کسی کے حق کی ادائیگی براہِ راست یا وکیل کے ذریعے ہو سکتی ہے۔",
                "وصول کرنے والے کو بھی چاہیے کہ وہ مقررہ مقدار سے زائد کا مطالبہ نہ کرے۔",
                "عدل و انصاف کا تقاضا ہے کہ لین دین میں پیمانوں کی پابندی کی جائے۔"
              ],
              "english": [
                "Sending Jabir to the agent shows that fulfilling a right can be done personally or via a representative.",
                "The recipient should not demand more than the specified amount.",
                "Justice requires strict adherence to measurements and weights in transactions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور میں اطلاق",
        "english": "Modern Day Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بزنس ایجنسی اور پاور آف اٹارنی",
              "english": "Business Agency and Power of Attorney"
            },
            "content": {
              "urdu": [
                "موجودہ دور کے ایجنسی معاہدات اور 'پاور آف اٹارنی' (Power of Attorney) کی بنیاد یہی نبوی اصول ہے۔",
                "بینکوں اور کمپنیوں میں نمائندوں کے ذریعے ہونے والے تمام معاہدے اسی زمرے میں آتے ہیں۔",
                "اسلامی معاشرے میں وکالت کو دھوکہ دہی سے پاک رکھنا شرعی فریضہ ہے۔"
              ],
              "english": [
                "Modern agency contracts and 'Power of Attorney' are rooted in this Prophetic principle.",
                "All corporate and banking contracts made through authorized representatives fall under this category.",
                "In an Islamic society, keeping agency free from fraud is a religious obligation."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلاصہ کلام",
              "english": "Conclusion"
            },
            "content": {
              "urdu": [
                "وکالت ایک شرعی سہولت ہے جو نظامِ زندگی کو رواں رکھنے میں مدد دیتی ہے۔",
                "نبی ﷺ کے ارشادات ہمیں زندگی کے ہر چھوٹے بڑے معاملے میں نظم و ضبط سکھاتے ہیں۔",
                "برکت ہمیشہ سچائی اور امانت داری کی پیروی میں ہی پوشیدہ ہے۔"
              ],
              "english": [
                "Wakalah is a Sharia-based convenience that helps keep life's affairs running smoothly.",
                "The Prophet's (PBUH) teachings provide discipline for every matter, large or small.",
                "Blessing always lies in the path of truth and trustworthiness."
              ]
            }
          }
        ]
      }
    }
  ]
}