{
  "hadithId": 610,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh-al-maram/6/30"
    ],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "كتاب الحج",
    "babId": 40
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1577)، ومسلم (1258).‏ وأعلاها: طريق كداء (بفتح الكاف) من جهة المعلاة، وأسفلها: كُدَی (بضم الكاف) من جهة الشبيكة.",
    "urdu": "صحیح۔ اسے امام بخاری (1577) اور امام مسلم (1258) نے روایت کیا ہے۔ مکہ کا بالائی حصہ 'کداء' (کاف کے زبر کے ساتھ) کہلاتا ہے جو قبرستان معلا کی جانب ہے، اور نچلا حصہ 'کدی' (کاف کے پیش کے ساتھ) کہلاتا ہے جو جرول اور باب الشبیکہ کی طرف ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1577) and Muslim (1258). The 'upper side' refers to the route of Kada' (near Al-Mu'alla), and the 'lower side' refers to the route of Kuda (towards Ash-Shubaika)."
  },
  "importantWords": [
    {
      "arabic": "أَعْلَاهَا",
      "english": "Its upper part",
      "urdu": "اس کا بالائی حصہ"
    },
    {
      "arabic": "أَسْفَلِهَا",
      "english": "Its lower part",
      "urdu": "اس کا نچلا حصہ"
    },
    {
      "arabic": "دَخَلَهَا",
      "english": "Entered it",
      "urdu": "اس میں داخل ہوئے"
    },
    {
      "arabic": "خَرَجَ",
      "english": "Exited / Left",
      "urdu": "نکلے"
    }
  ],
  "summary": {
    "urdu": "نبی کریم ﷺ کی سنت یہ تھی کہ مکہ میں داخل ہونے اور وہاں سے رخصت ہونے کے لیے الگ الگ راستے اختیار فرماتے، بالائی راستے سے داخلہ اور زیریں راستے سے روانگی فرماتے۔",
    "english": "It was the Sunnah of the Prophet (ﷺ) to use different routes for entering and leaving Makkah, specifically entering from the upper part and exiting from the lower part."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1577)",
      "english": "Sahih al-Bukhari (1577)"
    },
    {
      "arabic": "صحيح مسلم (1258)",
      "english": "Sahih Muslim (1258)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مکہ میں داخلے اور خروج کی سنت",
        "english": "Sunnah of Entering and Exiting Makkah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راستوں کی تبدیلی",
              "english": "Changing the Routes"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا یہ مبارک معمول تھا کہ آپ ﷺ مکہ میں بالائی جانب (کداء) سے داخل ہوتے تھے۔",
                "واپسی کے وقت آپ ﷺ نچلے راستے (کدی) کا انتخاب فرماتے تھے۔",
                "یہ عمل عیدین کی نماز کے لیے جاتے وقت راستہ بدلنے کی سنت کے مشابہ ہے۔"
              ],
              "english": [
                "It was the blessed habit of the Prophet (ﷺ) to enter Makkah from the upper route (Kada').",
                "Upon departure, he (ﷺ) would choose the lower route (Kuda).",
                "This practice is similar to the Sunnah of changing routes when going for the Eid prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "جغرافیائی تشریح",
              "english": "Geographic Illustration"
            },
            "content": {
              "urdu": [
                "بالائی حصہ (کداء) مدینہ منورہ کی طرف سے آنے والے مسافروں کے لیے بلند مقام پر واقع تھا۔",
                "نچلا حصہ (کدی) یمن اور جدہ کی طرف جانے والے راستوں پر واقع تھا۔",
                "مکہ کی جغرافیائی ساخت کے مطابق یہ راستے مسافروں کے لیے سہولت اور سنت کی ادائیگی کا ذریعہ تھے۔"
              ],
              "english": [
                "The upper part (Kada') was located at a higher elevation for travelers arriving from the direction of Madinah.",
                "The lower part (Kuda) was situated on the routes leading toward Yemen and Jeddah.",
                "Given Makkah's geography, these paths provided convenience and a means to fulfill the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت کی حکمتیں",
        "english": "Wisdoms of the Sunnah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شعائرِ اسلام کا اظہار",
              "english": "Manifestation of Islamic Symbols"
            },
            "content": {
              "urdu": [
                "مختلف راستے اختیار کرنے سے زیادہ سے زیادہ لوگوں کو اسلام کی شان و شوکت اور نبوی آمد کا پتہ چلتا تھا۔",
                "اس سے زمین کے زیادہ سے زیادہ حصوں پر اللہ کا ذکر بلند ہوتا تھا۔",
                "یہ طریقہ کار ایک فاتحانہ اور پروقار داخلے کی علامت بھی تھا۔"
              ],
              "english": [
                "Taking different routes allowed more people to witness the glory of Islam and the Prophet's arrival.",
                "It ensured that Allah's remembrance (Dhikr) was raised over more parts of the land.",
                "This method also symbolized a dignified and victorious entry."
              ]
            }
          },
          {
            "title": {
              "urdu": "توازن اور سہولت",
              "english": "Balance and Convenience"
            },
            "content": {
              "urdu": [
                "مکہ میں بھیڑ اور رش سے بچنے کے لیے الگ راستے استعمال کرنا انتظامی لحاظ سے بھی بہتر تھا۔",
                "یہ عمل سکھاتا ہے کہ عبادات میں نظم و ضبط اور منصوبہ بندی کی اہمیت ہے۔",
                "نبی ﷺ کی ہر سنت میں دنیا اور آخرت دونوں کی بھلائی پوشیدہ ہے۔"
              ],
              "english": [
                "Using separate routes was administratively sound to avoid overcrowding in Makkah.",
                "This practice teaches the importance of discipline and planning in acts of worship.",
                "Every Sunnah of the Prophet (ﷺ) contains goodness for both this world and the hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی پہلو",
        "english": "Juristic and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استحباب کا حکم",
              "english": "Recommendation (Istihbab)"
            },
            "content": {
              "urdu": [
                "علماء کے نزدیک ان مخصوص راستوں سے داخل ہونا اور نکلنا 'سنتِ مستحبہ' ہے۔",
                "اگر کوئی کسی اور راستے سے بھی داخل ہو جائے تو اس کا حج یا عمرہ مکمل طور پر صحیح ہے۔",
                "تاہم، جہاں تک ممکن ہو اتباعِ رسول ﷺ میں ان راستوں کی پیروی کرنا زیادہ باعثِ ثواب ہے۔"
              ],
              "english": [
                "Scholars consider entering and exiting through these specific routes as a 'Recommended Sunnah'.",
                "If someone enters through a different route, their Hajj or Umrah remains perfectly valid.",
                "However, following these paths in imitation of the Prophet (ﷺ) brings more reward where possible."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتباعِ سنت کا جذبہ",
              "english": "Spirit of Following the Sunnah"
            },
            "content": {
              "urdu": [
                "صحابہ کرام اور ازواجِ مطہرات نبی ﷺ کے ہر چھوٹے بڑے عمل کو یاد رکھتے اور اس پر عمل کرتے تھے۔",
                "سیدہ عائشہ کا اس باریک تفصیل کو بیان کرنا ان کی علمی گہرائی اور محبتِ رسول ﷺ کی دلیل ہے۔",
                "محبت کا تقاضا ہے کہ انسان محبوب کے نقشِ قدم پر چلنے کی کوشش کرے۔"
              ],
              "english": [
                "The companions and the Mothers of the Believers remembered and practiced every detail of the Prophet's actions.",
                "Aishah's description of this detail proves her intellectual depth and love for the Prophet (ﷺ).",
                "The demand of love is to strive to walk in the footsteps of the beloved."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرم کی تعظیم",
              "english": "Venerating the Sanctuary"
            },
            "content": {
              "urdu": [
                "مکہ مکرمہ میں داخلہ صرف ایک سفر نہیں بلکہ ایک روحانی حاضری ہے۔",
                "سنت راستوں کی تلاش ہمیں اس شہر کی مقدس تاریخ سے جوڑتی ہے۔",
                "حاجی کو چاہیے کہ وہ مکہ کی گلیوں میں بھی ادب اور ذکر و اذکار کا دامن نہ چھوڑے۔"
              ],
              "english": [
                "Entering Makkah is not just a journey but a spiritual audience.",
                "Seeking the Sunnah routes connects us with the sacred history of the city.",
                "The pilgrim should maintain etiquette and Dhikr even while walking through the streets of Makkah."
              ]
            }
          },
          {
            "title": {
              "urdu": "تبدیلی اور تنوع",
              "english": "Change and Variety"
            },
            "content": {
              "urdu": [
                "راستوں کی تبدیلی زندگی میں تازگی اور مختلف مشاہدات کا موقع دیتی ہے۔",
                "نیکی کے کاموں میں مختلف طریقے اور راستے اختیار کرنا برکت کا باعث ہے۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ دینِ اسلام فطرت کے تقاضوں کے عین مطابق ہے۔"
              ],
              "english": [
                "Changing routes provides freshness and the opportunity for different observations in life.",
                "Adopting various methods and paths in righteous deeds is a source of blessing.",
                "This Hadith teaches us that Islam is perfectly aligned with the requirements of human nature."
              ]
            }
          }
        ]
      }
    }
  ]
}