{
  "hadithId": 1090,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/11/11"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2947)، ومسلم (2769). ومعنى 'ورّى': أي ستر وجهته الحقيقية وأظهر أنه يريد غيرها للمصلحة الحربية.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری (2947) اور امام مسلم (2769) نے روایت کیا ہے۔ 'ورّٰی' کا مطلب ہے کہ آپ ﷺ اپنی اصل منزل کو خفیہ رکھتے اور جنگی مصلحت کی بنا پر کسی اور جگہ کا تاثر دیتے۔",
    "english": "Sahih. Reported by Al-Bukhari (2947) and Muslim (2769). The term 'Warra' means he concealed his true destination and hinted at another for strategic military reasons."
  },
  "importantWords": [
    {
      "arabic": "أَرَادَ",
      "english": "Intended",
      "urdu": "ارادہ کیا"
    },
    {
      "arabic": "غَزْوَةً",
      "english": "Expedition/Battle",
      "urdu": "غزوہ / جنگی مہم"
    },
    {
      "arabic": "وَرَّى",
      "english": "Concealed/Camouflaged",
      "urdu": "توریہ کیا / راز رکھا"
    },
    {
      "arabic": "بِغَيْرِهَا",
      "english": "With another (destination)",
      "urdu": "کسی اور کے ساتھ"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon",
      "urdu": "بخاری و مسلم کی متفقہ روایت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے جنگی مصلحت کے تحت راز کو خفیہ رکھنا اور دشمن کو دھوکہ دینے کے لیے توریہ (ذومعنی کلام) کرنا جائز ثابت ہوتا ہے۔",
    "english": "This Hadith establishes the permissibility of maintaining secrecy and using camouflage (Tauriya) in war to mislead the enemy for strategic advantage."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2947)",
      "english": "Sahih al-Bukhari (2947)"
    },
    {
      "arabic": "صحيح مسلم (2769)",
      "english": "Sahih Muslim (2769)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "كعب بن مالك",
        "english": "Ka'b bin Malik"
      },
      "slug": "kab-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kx8iG8uW4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "توریہ اور جنگی حکمت عملی",
        "english": "Camouflage and Military Strategy"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "راز کی حفاظت",
              "english": "Protection of Secrets"
            },
            "content": {
              "urdu": [
                "جنگ میں کامیابی کا دارومدار نقل و حرکت کو خفیہ رکھنے پر ہوتا ہے۔",
                "نبی کریم ﷺ دشمن کے جاسوسوں سے بچنے کے لیے اپنا راستہ خفیہ رکھتے تھے۔",
                "اس سے مسلمانوں کی جان و مال کا تحفظ اور دشمن کی ناگہانی شکست یقینی ہوتی ہے۔"
              ],
              "english": [
                "Success in war often depends on keeping movements and plans strictly confidential.",
                "The Prophet (ﷺ) kept his routes hidden to evade the enemy's intelligence and spies.",
                "This ensures the safety of Muslim lives and leads to a sudden defeat of the enemy."
              ]
            }
          },
          {
            "title": {
              "urdu": "توریہ کا شرعی حکم",
              "english": "Shariah Ruling on Tauriya"
            },
            "content": {
              "urdu": [
                "توریہ کا مطلب ایسی بات کرنا ہے جس کے دو معنی ہوں اور مخاطب دوسرا معنی سمجھے۔",
                "جنگ میں توریہ کرنا جھوٹ نہیں بلکہ ایک جائز حیلہ اور حکمت عملی ہے۔",
                "رسول اللہ ﷺ نے فرمایا کہ 'جنگ نام ہی دھوکہ دہی (حکمت عملی) کا ہے'۔"
              ],
              "english": [
                "Tauriya means using words with double meanings where the listener infers something else.",
                "In war, Tauriya is not considered lying but a permissible tactic and strategy.",
                "The Prophet (ﷺ) stated that 'War is indeed a game of deception (strategy)'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غزوہ تبوک کا استثناء",
        "english": "Exception of the Battle of Tabuk"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلانِ عام کی ضرورت",
              "english": "Need for Public Announcement"
            },
            "content": {
              "urdu": [
                "غزوہ تبوک میں سفر طویل اور سخت تھا، اس لیے آپ ﷺ نے اس کا پہلے ہی اعلان کر دیا۔",
                "مقصد یہ تھا کہ صحابہ کرام اپنی تیاری مکمل کر لیں اور زادِ راہ کا انتظام کریں۔",
                "حالات کے تقاضوں کے مطابق حکمت عملی میں تبدیلی لانا عین سنتِ نبوی ہے۔"
              ],
              "english": [
                "In the Battle of Tabuk, the journey was long and hard, so he (ﷺ) announced it beforehand.",
                "The aim was for the Sahaba to complete their preparations and arrange provisions.",
                "Changing strategy according to the needs of the situation is perfectly in line with Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنگی تیاری اور نظم و ضبط",
              "english": "War Preparation and Discipline"
            },
            "content": {
              "urdu": [
                "توریہ کے باوجود آپ ﷺ لشکر کی تیاری میں کوئی کسر نہیں چھوڑتے تھے۔",
                "نظم و ضبط کی خاطر سپہ سالار کو تمام معلومات عام کرنا ضروری نہیں ہوتا۔",
                "یہ طرز عمل ثابت کرتا ہے کہ قیادت کو فیصلے کرنے میں مکمل خود مختاری حاصل ہے۔"
              ],
              "english": [
                "Despite the camouflage, he (ﷺ) left no stone unturned in preparing the army.",
                "For the sake of discipline, a commander is not required to share all information with everyone.",
                "This conduct proves that the leadership has complete autonomy in making strategic decisions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور اخلاقی باریکیاں",
        "english": "Juristic and Ethical Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سچائی اور مصلحت کا توازن",
              "english": "Balance of Truth and Expediency"
            },
            "content": {
              "urdu": [
                "اسلام سچائی کا دین ہے، مگر جہاں انسانی جانوں کا مسئلہ ہو وہاں مصلحت جائز ہے۔",
                "توریہ صریح جھوٹ سے بچنے کا ایک بہترین اخلاقی راستہ فراہم کرتا ہے۔",
                "عام حالات میں جھوٹ بولنا حرام ہے، لیکن جنگ اور صلح کے لیے توریہ درست ہے۔"
              ],
              "english": [
                "Islam is a religion of truth, but expediency is allowed when human lives are at stake.",
                "Tauriya provides an ethical way to avoid blatant lies while serving a greater good.",
                "Lying is forbidden in normal times, but Tauriya is valid for war and reconciliation."
              ]
            }
          },
          {
            "title": {
              "urdu": "جاسوسی کا سدِ باب",
              "english": "Preventing Espionage"
            },
            "content": {
              "urdu": [
                "دشمن کو غلط معلومات فراہم کرنا ان کی جاسوسی کے نظام کو ناکام بناتا ہے۔",
                "اس سے دشمن کو مسلمانوں کی اصل طاقت اور ارادوں کا علم نہیں ہو پاتا۔",
                "موجودہ دور میں انٹیلی جنس اور کاؤنٹر انٹیلی جنس کی بنیاد یہی اصول ہیں۔"
              ],
              "english": [
                "Providing false impressions to the enemy foils their espionage and intelligence networks.",
                "It prevents the enemy from knowing the true strength and intentions of the Muslims.",
                "Modern intelligence and counter-intelligence are fundamentally based on these principles."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور اطلاق",
        "english": "Practical Lesson and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینی کاموں میں حکمت",
              "english": "Wisdom in Religious Work"
            },
            "content": {
              "urdu": [
                "دین کی خدمت اور دعوت میں بھی بعض اوقات حکمت اور خاموشی ضروری ہوتی ہے۔",
                "ہر بات ہر شخص کو بتانا ضروری نہیں، بلکہ موقع اور محل کا لحاظ رکھنا چاہیے۔",
                "حکمت عملی کے بغیر کی گئی محنت اکثر اوقات مطلوبہ نتائج نہیں دیتی۔"
              ],
              "english": [
                "In the service and invitation to religion, wisdom and silence are sometimes necessary.",
                "It is not required to tell everyone everything; one must consider the time and place.",
                "Efforts made without a sound strategy often fail to yield the desired results."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیادت کی اطاعت",
              "english": "Obedience to Leadership"
            },
            "content": {
              "urdu": [
                "صحابہ کرام آپ ﷺ کے فیصلوں پر مکمل اعتماد کرتے تھے چاہے انہیں وجہ معلوم نہ ہو۔",
                "نظم و ضبط کے لیے قیادت پر بھروسہ کرنا کامیابی کی پہلی سیڑھی ہے۔",
                "مسلمانوں کو اپنے قائدین کی جائز جنگی چالوں اور رازوں کی حفاظت کرنی چاہیے۔"
              ],
              "english": [
                "The Sahaba had complete trust in the Prophet's (ﷺ) decisions even without knowing the reasons.",
                "Trusting leadership is the first step toward success and effective discipline.",
                "Muslims must protect the legitimate war tactics and secrets of their leaders."
              ]
            }
          }
        ]
      }
    }
  ]
}