{
  "hadithId": 1196,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["bulugh/14/9"],
    "kitabId": 14,
    "inKitabBab": 1,
    "arabicBook": "كتاب القضاء",
    "babId": 97
  },
 
  "takhreej": {
    "arabic": "ضعيف. رواه ابن حبان (1563)، وأحمد (6/75)، والبيهقي (10/96). في سنده ابن لهيعة، وهو ضعيف الحفظ.",
    "urdu": "ضعیف۔ اسے ابن حبان (1563) اور احمد نے روایت کیا ہے۔ اس کی سند میں ابن لہیعہ ہیں جو ضعیف الحفظ ہیں، تاہم اس کا مفہوم ذمہ داری کی سنگینی پر دلالت کرتا ہے۔",
    "english": "Da'if (Weak). Reported by Ibn Hibban (1563), Ahmad (6/75), and al-Bayhaqi. Its chain contains Ibn Lahi'ah, who is weak in memory."
  },
  "importantWords": [
    {
      "arabic": "يُدْعَى",
      "english": "Will be called / Summoned",
      "urdu": "بلایا جائے گا"
    },
    {
      "arabic": "الْعَادِلِ",
      "english": "The Just / Fair",
      "urdu": "انصاف کرنے والا"
    },
    {
      "arabic": "شِدَّةِ",
      "english": "Severity / Intensity",
      "urdu": "سختی / شدت"
    },
    {
      "arabic": "يَتَمَنَّى",
      "english": "He will wish / Long for",
      "urdu": "وہ تمنا کرے گا"
    },
    {
      "arabic": "تَمْرَةٍ",
      "english": "A single date (fruit)",
      "urdu": "ایک کھجور"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث عدل و انصاف کی کرسی پر بیٹھنے کی سنگین ذمہ داری اور قیامت کے دن اس کے باریک بین حساب سے ڈراتی ہے، یہاں تک کہ عادل قاضی بھی اس دن کی ہولناکی سے کانپ اٹھے گا۔",
    "english": "This Hadith emphasizes the heavy responsibility of judicial authority and the terrifying scrutiny of the Day of Judgment, making even a just judge wish they had avoided the role entirely."
  },
  "references": [
    {
      "arabic": "صحيح ابن حبان، كتاب إخبار النبي صلى الله عليه وسلم عن مناقب الصحابة، رقم 1563",
      "english": "Sahih Ibn Hibban, Hadith No. 1563"
    },
    {
      "arabic": "مسند أحمد بن حنبل، مسند النساء، رقم 24502",
      "english": "Musnad Ahmad bin Hanbal, No. 24502"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=GAn7rI7Xh0o",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حسابِ آخرت کی ہولناکی",
        "english": "The Severity of the Afterlife Reckoning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عادل قاضی کا خوف",
              "english": "The Fear of a Just Judge"
            },
            "content": {
              "urdu": [
                "قیامت کے دن اللہ تعالی کی عدالت میں حساب اتنا سخت ہوگا کہ نیک لوگ بھی ڈریں گے۔",
                "ایک قاضی جس نے دنیا میں انصاف کیا ہوگا، وہ بھی حساب کے مراحل دیکھ کر لرز جائے گا۔",
                "یہ اس بات کی طرف اشارہ ہے کہ اللہ کے ہاں ہر چھوٹے بڑے فیصلے کی بازپرس ہوگی۔"
              ],
              "english": [
                "The reckoning in Allah's court on Judgment Day will be so intense that even the righteous will be afraid.",
                "A judge who practiced justice in the world will still tremble upon seeing the stages of the reckoning.",
                "This indicates that Allah will question every single decision, no matter how small or large."
              ]
            }
          },
          {
            "title": {
              "urdu": "حساب کی باریک بینی",
              "english": "The Precision of the Account"
            },
            "content": {
              "urdu": [
                "اللہ تعالی ذرے ذرے کا حساب لینے والا ہے اور کسی پر ظلم نہیں کیا جائے گا۔",
                "قاضی کو اپنے ہر فیصلے کی نیت، دلیل اور اثرات کا جواب دینا ہوگا۔",
                "اسی وجہ سے عادل شخص بھی تمنا کرے گا کہ کاش وہ اس بھاری ذمہ داری سے بچا رہتا۔"
              ],
              "english": [
                "Allah Almighty will take account of every atom's weight, and no one will be wronged.",
                "A judge must answer for the intention, evidence, and consequences of every verdict passed.",
                "For this reason, even a just person will wish they had avoided this heavy responsibility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منصبِ قضا کی ذمہ داری",
        "english": "The Responsibility of Judicial Office"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لوگوں کے حقوق کا بوجھ",
              "english": "The Burden of People's Rights"
            },
            "content": {
              "urdu": [
                "لوگوں کے درمیان فیصلے کرنا آگ کا کھیل ہے کیونکہ اس میں حقوق العباد شامل ہیں۔",
                "کسی ایک کا حق دوسرے کو دے دینا، چاہے انجانے میں ہو، ایک بہت بڑا بوجھ ہے۔",
                "اسلام میں عہدے کی طلب سے منع کیا گیا ہے کیونکہ یہ دنیا و آخرت میں آزمائش ہے۔"
              ],
              "english": [
                "Judging between people is like playing with fire because it involves the rights of human beings.",
                "Giving one person's right to another, even unintentionally, carries a massive burden.",
                "In Islam, seeking high positions is discouraged because it is a trial in both worlds."
              ]
            }
          },
          {
            "title": {
              "urdu": "معمولی اشیاء کا فیصلہ",
              "english": "Deciding on Minor Matters"
            },
            "content": {
              "urdu": [
                "حدیث میں 'کھجور' کا ذکر اس لیے ہے کہ چھوٹی سے چھوٹی چیز کا فیصلہ بھی اہمیت رکھتا ہے۔",
                "انصاف صرف بڑے مالی جھگڑوں میں نہیں بلکہ ہر معاملے میں ضروری ہے۔",
                "معمولی چیزوں میں ناانصافی بھی اللہ کے ہاں سخت گرفت کا باعث بن سکتی ہے۔"
              ],
              "english": [
                "The mention of a 'date fruit' in the Hadith signifies that even the smallest decision matters.",
                "Justice is not only required in major financial disputes but in every single affair.",
                "Injustice in minor things can also lead to severe questioning by Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خوفِ خدا اور حکمرانی",
        "english": "Fear of Allah and Governance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فیصلہ کرنے میں احتیاط",
              "english": "Caution in Decision Making"
            },
            "content": {
              "urdu": [
                "یہ حدیث قاضیوں کو متنبہ کرتی ہے کہ وہ ہر فیصلہ کرتے وقت اللہ کو حاضر ناظر جانیں۔",
                "جلد بازی اور سطحی معلومات پر مبنی فیصلے آخرت میں شرمندگی کا باعث بنیں گے۔",
                "تقویٰ کا تقاضا ہے کہ انسان منصبِ قضا پر بیٹھ کر اپنے آپ کو اللہ کا جوابدہ سمجھے۔"
              ],
              "english": [
                "This Hadith warns judges to keep Allah in mind as the ultimate witness during every verdict.",
                "Decisions based on haste or superficial information will lead to regret in the Hereafter.",
                "Piety requires that one sitting in a judicial position considers themselves accountable to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "عہدے کی حرص کا خاتمہ",
              "english": "Eliminating Greed for Power"
            },
            "content": {
              "urdu": [
                "اگر انسان کو حساب کی سختی کا اندازہ ہو جائے تو وہ کبھی بڑے عہدوں کی تمنا نہ کرے۔",
                "سلف صالحین عہدہ قضا سے بھاگتے تھے تاکہ کہیں ان سے غلطی سرزد نہ ہو جائے۔",
                "یہ حدیث اقتدار اور منصب کی ہوس کو ختم کرنے کے لیے بہترین درس ہے۔"
              ],
              "english": [
                "If a person realized the severity of the reckoning, they would never crave high office.",
                "The pious predecessors used to flee from judicial roles to avoid falling into error.",
                "This Hadith is a profound lesson for eliminating the greed for authority and status."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عادل قاضی کی فضیلت اور تنبیہ",
        "english": "Virtue and Warning for the Just Judge"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "انصاف کا عظیم درجہ",
              "english": "The Great Status of Justice"
            },
            "content": {
              "urdu": [
                "اگرچہ حساب سخت ہے، لیکن عادل قاضی کو اللہ کے سائے میں جگہ ملے گی۔",
                "یہ حدیث ڈرانے کے لیے ہے تاکہ انصاف کرنے میں کوئی کمی نہ رہ جائے۔",
                "سختی صرف اس لیے دکھائی گئی ہے تاکہ ذمہ داری کا احساس پوری طرح بیدار رہے۔"
              ],
              "english": [
                "Although the account is severe, a just judge will find a place under Allah's shade.",
                "This Hadith serves as a warning to ensure no deficiency remains in practicing justice.",
                "The severity is shown specifically to keep the sense of responsibility fully awake."
              ]
            }
          },
          {
            "title": {
              "urdu": "امت کے لیے عملی نصیحت",
              "english": "Practical Advice for the Ummah"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے روزمرہ کے چھوٹے بڑے فیصلوں میں بھی عدل کا دامن نہیں چھوڑنا چاہیے۔",
                "دوسروں کے معاملات میں مداخلت اور فیصلے کرنے سے پہلے اپنی اہلیت دیکھ لینی چاہیے۔",
                "قیامت کی رسوائی سے بچنے کا واحد راستہ دنیا میں حق اور سچائی پر قائم رہنا ہے۔"
              ],
              "english": [
                "We must not abandon justice even in our daily minor decisions and interactions.",
                "Before interfering or deciding in others' affairs, one must evaluate their own capability.",
                "The only way to avoid humiliation on Judgment Day is to stand by truth and reality in this life."
              ]
            }
          }
        ]
      }
    }
  ]
}