{
  "hadithId": 815,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/815"],
    "kitabId": 7,
    "inKitabBab": 20,
    "arabicBook": "بلوغ المرام",
    "babId": 61
  },
 
  "takhreej": {
    "arabic": "حسن . رواه أبو داود (2917)، والنسائي في الكبرى (4/75)، وابن ماجه (2732). وصححه علي بن المديني وابن عبد البر.",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے ابوداؤد (2917)، نسائی اور ابن ماجہ نے روایت کیا ہے، جبکہ امام علی بن المدینی اور ابن عبدالبر نے اسے صحیح قرار دیا ہے۔",
    "english": "Hasan (Good). Reported by Abu Dawud (2917), An-Nasa'i, and Ibn Majah. Authenticated by Ali ibn al-Madini and Ibn 'Abd al-Barr."
  },
  "importantWords": [
    {
      "arabic": "أَحْرَزَ",
      "english": "Acquired / Gathered",
      "urdu": "حاصل کیا / جمع کیا"
    },
    {
      "arabic": "اَلْوَالِدُ",
      "english": "The father",
      "urdu": "باپ"
    },
    {
      "arabic": "اَلْوَلَدُ",
      "english": "The son / child",
      "urdu": "بیٹا / اولاد"
    },
    {
      "arabic": "لِعَصَبَتِهِ",
      "english": "For his agnates",
      "urdu": "اس کے عصبہ کے لیے"
    },
    {
      "arabic": "وَلَاء",
      "english": "Loyalty / Clientage",
      "urdu": "ولاء (غلام آزاد کرنے کا حق)"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مفہوم یہ ہے کہ اگر کوئی شخص فوت ہو جائے اور اس کا ترکہ یا اس کے آزاد کردہ غلاموں کا حقِ وراثت (ولاء) منتقل ہونا ہو، تو وہ اس کے عصبہ (قریبی مرد رشتہ داروں) کو ملے گا۔",
    "english": "This Hadith clarifies that assets or the rights of clientage (Wala') acquired by a person are inherited by their agnates ('Asabah) upon their death."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2917)",
      "english": "Sunan Abu Dawud (2917)"
    },
    {
      "arabic": "سنن ابن ماجه (2732)",
      "english": "Sunan Ibn Majah (2732)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عصبہ کی وراثت کا ضابطہ",
        "english": "Rule of Agnate Inheritance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عصبہ سے کیا مراد ہے؟",
              "english": "Who are the 'Asabah?"
            },
            "content": {
              "urdu": [
                "عصبہ وہ مرد رشتہ دار ہیں جو میت کے ساتھ براہ راست مرد کے واسطے سے جڑے ہوں۔",
                "وراثت کی تقسیم میں مقررہ حصے دینے کے بعد بقیہ سارا مال عصبہ کو ملتا ہے۔",
                "اس حدیث نے واضح کیا کہ باپ یا بیٹے کا حاصل کردہ مال ان کے عصبہ کی ملکیت بنتا ہے۔"
              ],
              "english": [
                "'Asabah refers to male relatives connected to the deceased through males.",
                "In inheritance, after fixed shares are paid, the residue goes to the 'Asabah.",
                "This Hadith clarifies that wealth acquired by a father or son belongs to their agnates."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقِ ولاء کی منتقلی",
              "english": "Transfer of the Right of Wala'"
            },
            "content": {
              "urdu": [
                "ولاء اس تعلق کو کہتے ہیں جو ایک آقا اور اس کے آزاد کردہ غلام کے درمیان ہوتا ہے۔",
                "اگر آزاد کردہ غلام کا کوئی وارث نہ ہو، تو اس کا مال اس کے سابقہ آقا کو ملتا ہے۔",
                "یہ حدیث بتاتی ہے کہ آقا کی وفات کے بعد یہ حق اس کے عصبہ کو منتقل ہو جائے گا۔"
              ],
              "english": [
                "Wala' is the bond between a master and his manumitted (freed) slave.",
                "If a freed slave dies without heirs, his estate goes to his former master.",
                "This Hadith states that after the master dies, this right transfers to his agnates."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و قانونی باریکیاں",
        "english": "Juristic and Legal Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قریبی عصبہ کی ترجیح",
              "english": "Priority of Closer Agnates"
            },
            "content": {
              "urdu": [
                "وراثت میں 'الاقرب فالاقرب' کا اصول کارفرما ہوتا ہے یعنی قریب ترین کو پہلے دیا جاتا ہے۔",
                "اگر بیٹا موجود ہو تو وہ سب سے بڑا عصبہ ہے، اس کے بعد باپ اور پھر بھائی آتے ہیں۔",
                "یہ حدیث اس نظام کی بنیاد فراہم کرتی ہے کہ مال خاندان کے اندر ہی گردش کرے۔"
              ],
              "english": [
                "Inheritance follows the rule of 'closest first' in the family hierarchy.",
                "A son is the primary agnate, followed by the father and then brothers.",
                "This Hadith lays the foundation for keeping wealth within the direct family line."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت سے ثابت حکم کی اہمیت",
              "english": "Importance of Rulings Proven by Sunnah"
            },
            "content": {
              "urdu": [
                "ولاء اور عصبہ کے کئی پیچیدہ مسائل قرآن میں مجمل تھے جنہیں سنت نے واضح کیا۔",
                "حضرت عمر فاروق رضی اللہ عنہ نے اس حدیث کے ذریعے وراثت کے جھگڑے طے کیے۔",
                "یہ اس بات کی دلیل ہے کہ سنت کے بغیر وراثت کی مکمل فہم ممکن نہیں۔"
              ],
              "english": [
                "Many complex issues of Wala' and agnates were general in the Quran and clarified by Sunnah.",
                "Umar (RA) used this specific Hadith to resolve inheritance disputes.",
                "This proves that a complete understanding of inheritance is impossible without the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی عدل و انصاف",
        "english": "Social Justice and Fairness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی حقوق کا تحفظ",
              "english": "Protection of Family Rights"
            },
            "content": {
              "urdu": [
                "یہ نظام یقینی بناتا ہے کہ کسی کا مال ضائع نہ ہو بلکہ اس کے مستحق رشتہ داروں تک پہنچے۔",
                "عصبہ کو حق دینے سے خاندان میں معاشی مضبوطی اور باہمی تعاون پیدا ہوتا ہے۔",
                "اسلامی معاشرت میں رشتہ داری کی بنیاد پر حقوق کا تعین عدل کی علامت ہے۔"
              ],
              "english": [
                "This system ensures that assets are not lost but reach rightful relatives.",
                "Giving rights to agnates fosters economic strength and mutual family support.",
                "Defining rights based on kinship is a sign of justice in Islamic society."
              ]
            }
          },
          {
            "title": {
              "urdu": "نزاعات کا نبوی حل",
              "english": "Prophetic Solution to Conflicts"
            },
            "content": {
              "urdu": [
                "تقسیمِ مال میں جذبات کے بجائے نبوی اصولوں کو ترجیح دینا ہی ایمان ہے۔",
                "حدیث میں 'من کان' (خواہ کوئی بھی ہو) کے الفاظ سے جانبداری کا خاتمہ کیا گیا ہے۔",
                "جب اصول واضح ہوں تو لوگوں کے درمیان کینہ اور لڑائی کے امکانات ختم ہو جاتے ہیں۔"
              ],
              "english": [
                "Prioritizing Prophetic principles over emotions in asset distribution is true faith.",
                "The phrase 'whoever they may be' eliminates favoritism in legal rulings.",
                "Clear principles reduce the chances of malice and fighting among relatives."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وراثت کے علم کی اہمیت",
              "english": "Importance of Inheritance Knowledge"
            },
            "content": {
              "urdu": [
                "وراثت کے مسائل پچیدہ ہو سکتے ہیں، اس لیے علمِ فرائض حاصل کرنا ضروری ہے۔",
                "کسی کے حق کو پامال کرنا یا عصبہ کا حصہ روکنا سخت گناہ ہے۔",
                "مستند علماء سے مشورہ کر کے وراثت کے معاملات طے کرنے چاہئیں۔"
              ],
              "english": [
                "Inheritance matters can be complex, so learning the science of shares is essential.",
                "Usurping someone's right or withholding an agnate's share is a grave sin.",
                "Consult authentic scholars to settle inheritance and estate matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق اللہ اور حقوق العباد",
              "english": "Rights of Allah and Rights of People"
            },
            "content": {
              "urdu": [
                "وراثت کی صحیح تقسیم حقوق العباد کی ادائیگی کا ایک بڑا ذریعہ ہے۔",
                "اللہ کے مقرر کردہ حصوں میں کمی بیشی کرنا اپنی عاقبت خراب کرنا ہے۔",
                "دیانت داری سے مال کی منتقلی معاشرے میں برکت کا باعث بنتی ہے۔"
              ],
              "english": [
                "Correct distribution of inheritance is a major way to fulfill people's rights.",
                "Altering the shares fixed by Allah ruins one's success in the hereafter.",
                "The honest transfer of wealth brings blessings to the entire community."
              ]
            }
          }
        ]
      }
    }
  ]
}