{
  "hadithId": 492,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1497",
      "https://sunnah.com/muslim:1078"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (1497)، ومسلم (1078). وفي رواية البخاري أن أبا أوفى أتى بصدقته فقال النبي صلى الله عليه وسلم: \"اللهم صل على آل أبي أوفى\". واللفظ يدل على مشروعية الدعاء لمن دفع الزكاة.",
    "urdu": "یہ حدیث صحیح ہے اور اسے بخاری (1497) اور مسلم (1078) نے روایت کیا ہے۔ اس روایت کا پس منظر یہ ہے کہ جب راوی کے والد ابو اوفی اپنی زکوٰۃ لے کر آئے تو آپ ﷺ نے خصوصی طور پر ان کے لیے دعا فرمائی۔ یہ حدیث زکوٰۃ دینے والے کے لیے دعا کرنے کے استحباب پر دلیل ہے۔",
    "english": "Authentic. Reported by Al-Bukhari (1497) and Muslim (1078). In Bukhari's version, when Abi Awfa brought his Zakat, the Prophet (ﷺ) said, \"O Allah, bless the family of Abi Awfa.\" It highlights the recommendation of praying for the person who pays Zakat."
  },
  "importantWords": [
    {
      "arabic": "أَتَاهُ",
      "english": "Came to him",
      "urdu": "ان کے پاس آئے"
    },
    {
      "arabic": "صَدَقَتِهِمْ",
      "english": "Their Zakat / Charity",
      "urdu": "ان کی زکوٰۃ"
    },
    {
      "arabic": "صَلِّ عَلَيْهِمْ",
      "english": "Bless them / Send Mercy",
      "urdu": "ان پر رحمت نازل فرما"
    },
    {
      "arabic": "قَوْمٌ",
      "english": "A people / Group",
      "urdu": "کچھ لوگ / قوم"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے معلوم ہوتا ہے کہ زکوٰۃ وصول کرنے والے کو چاہیے کہ وہ زکوٰۃ دینے والے کے حق میں برکت اور رحمت کی دعا کرے، جیسا کہ نبی کریم ﷺ کا مبارک معمول تھا۔",
    "english": "This Hadith teaches that the Zakat collector or the recipient should pray for the person paying the Zakat, following the blessed practice of the Prophet (ﷺ)."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (1497)",
      "english": "Sahih al-Bukhari (1497)"
    },
    {
      "arabic": "صحيح مسلم (1078)",
      "english": "Sahih Muslim (1078)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن أبي أوفى",
        "english": "Abdullah bin Abi Awfa"
      },
      "slug": "abdullah-bin-abi-awfa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_rOun7K5bY",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زکوٰۃ دہندہ کے لیے دعا کا حکم",
        "english": "Ruling on Praying for the Zakat Payer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استحباب اور سنت",
              "english": "Recommendation and Sunnah"
            },
            "content": {
              "urdu": [
                "قرآن کریم میں اللہ تعالیٰ نے فرمایا: 'ان کے اموال سے صدقہ لیجیے اور ان کے لیے دعا کیجیے' (التوبہ: 103)۔",
                "نبی ﷺ کا یہ عمل قرآن کے اسی حکم کی عملی تشریح ہے۔",
                "جمہور فقہاء کے نزدیک زکوٰۃ وصول کرنے والے کے لیے دعا کرنا مستحب (پسندیدہ) ہے۔"
              ],
              "english": [
                "Allah says in the Quran: 'Take charity from their wealth... and pray for them' (At-Tawbah: 103).",
                "The Prophet's (ﷺ) action is a practical implementation of this Quranic command.",
                "The majority of jurists consider it highly recommended (Mustahabb) for the collector to pray for the payer."
              ]
            }
          },
          {
            "title": {
              "urdu": "لفظ 'صلوٰۃ' کا مفہوم",
              "english": "Meaning of the word 'Salat'"
            },
            "content": {
              "urdu": [
                "جب اللہ کی طرف سے بندوں پر 'صلوٰۃ' ہو تو اس سے مراد رحمت کا نزول ہے۔",
                "جب بندے ایک دوسرے کے لیے یہ لفظ استعمال کریں تو اس کا مطلب دعا اور استغفار ہے۔",
                "نبی ﷺ کا 'صلِّ علیہم' کہنا ان کے لیے اللہ کی خاص رحمت کی درخواست تھی۔"
              ],
              "english": [
                "When 'Salat' is from Allah upon His servants, it means the descent of Mercy.",
                "When used by humans for one another, it means supplication and seeking forgiveness.",
                "The Prophet's (ﷺ) prayer was a request for Allah's special mercy upon the donors."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعوت اور تربیت کا پہلو",
        "english": "Dawah and Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دلجوئی اور حوصلہ افزائی",
              "english": "Encouragement and Consolation"
            },
            "content": {
              "urdu": [
                "دعا کرنے سے زکوٰۃ دینے والے کے دل میں خوشی اور اطمینان پیدا ہوتا ہے۔",
                "اس سے یہ احساس اجاگر ہوتا ہے کہ اس کی مالی قربانی کو قدر کی نگاہ سے دیکھا گیا ہے۔",
                "یہ طرزِ عمل معاشرے میں سخاوت اور خیر خواہی کے جذبے کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Praying for the donor creates happiness and tranquility in their heart.",
                "It highlights that their financial sacrifice is valued and recognized.",
                "This conduct promotes a spirit of generosity and goodwill within society."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبت اور تعلق کی مضبوطی",
              "english": "Strengthening Bonds of Love"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کا نظام صرف معاشی نہیں بلکہ سماجی تعلقات کو بھی بہتر بناتا ہے۔",
                "حاکم اور رعایا کے درمیان دعا کا رشتہ ایک مثالی اسلامی معاشرے کی علامت ہے۔",
                "نبی ﷺ اپنے صحابہ کی چھوٹی سے چھوٹی نیکی پر بھی انہیں دعاؤں سے نوازتے تھے۔"
              ],
              "english": [
                "The Zakat system improves social relationships, not just the economy.",
                "The bond of prayer between the leader and the subjects marks an ideal Islamic society.",
                "The Prophet (ﷺ) would bless his companions with prayers even for their smallest good deeds."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی نکات",
        "english": "Juristic and Practical Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کے الفاظ",
              "english": "Words of Supplication"
            },
            "content": {
              "urdu": [
                "لازم نہیں کہ وہی الفاظ کہے جائیں جو حدیث میں ہیں، کسی بھی اچھے کلمات سے دعا دی جا سکتی ہے۔",
                "مثلاً 'اللہ تمہارے مال اور اہل و عیال میں برکت دے' وغیرہ۔",
                "دعا میں اخلاص اور میت و زندوں کی خیر خواہی بنیادی شرط ہے۔"
              ],
              "english": [
                "It is not mandatory to use the exact words; any good supplication is valid.",
                "For example: 'May Allah bless your wealth and family,' etc.",
                "Sincerity and wishing well for the living and the dead is the primary condition."
              ]
            }
          },
          {
            "title": {
              "urdu": "انفرادی اور اجتماعی دعا",
              "english": "Individual and Collective Prayer"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کبھی پورے قبیلے کے لیے اور کبھی کسی خاص فرد (جیسے آلِ ابی اوفی) کے لیے دعا فرماتے تھے۔",
                "یہ اس بات کی دلیل ہے کہ نیکی کرنے والے کی انفرادی طور پر حوصلہ افزائی کرنا سنت ہے۔",
                "آج کے دور میں اداروں کو بھی چاہیے کہ وہ اپنے ڈونرز کا شکریہ اور ان کے لیے نیک تمناؤں کا اظہار کریں۔"
              ],
              "english": [
                "The Prophet (ﷺ) would pray for entire tribes or specific individuals (like the family of Abi Awfa).",
                "This proves that encouraging a doer of good individually is part of the Sunnah.",
                "Modern institutions should also express gratitude and good wishes to their donors."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اثرات",
        "english": "Spiritual Impact"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال میں برکت کا حصول",
              "english": "Attaining Blessings in Wealth"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی دعا اللہ کے ہاں یقینی طور پر قبول ہونے والی تھی۔",
                "زکوٰۃ دینے سے مال کم نہیں ہوتا بلکہ دعا کی برکت سے اس میں اضافہ ہوتا ہے۔",
                "اللہ تعالیٰ صدقہ کرنے والوں کے رزق کی حفاظت فرماتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) prayer was guaranteed to be accepted by Allah.",
                "Zakat does not decrease wealth; it increases it through the blessing of prayer.",
                "Allah Almighty protects the provision of those who give in charity."
              ]
            }
          },
          {
            "title": {
              "urdu": "تزکیہ نفس",
              "english": "Purification of the Soul"
            },
            "content": {
              "urdu": [
                "زکوٰۃ کا عمل اور اس پر ملنے والی دعا انسان کے نفس کو بخل سے پاک کرتی ہے۔",
                "یہ عمل بندے کو اللہ کے قریب کرتا ہے اور اس کے گناہوں کا کفارہ بنتا ہے۔",
                "نبی ﷺ کی شفقت اور دعا مومن کے لیے سب سے بڑا اعزاز ہے۔"
              ],
              "english": [
                "The act of Zakat and the subsequent prayer purify the soul from greed.",
                "This process brings the servant closer to Allah and expiates their sins.",
                "The Prophet's (ﷺ) compassion and prayer are the greatest honors for a believer."
              ]
            }
          }
        ]
      }
    }
  ]
}