{
  "hadithId": 278,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": ["urn:1269"],
    "kitabId": 2,
    "inKitabBab": 8,
    "arabicBook": "Bulugh al-Maram",
    "babId": 18
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (1/191)، والحاكم (1/550).",
    "urdu": "صحیح۔ اسے احمد (1/191) اور حاکم (1/550) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Ahmad (1/191) and Al-Hakim (1/550)."
  },
  "importantWords": [
    {
      "arabic": "أطال",
      "english": "Prolonged",
      "urdu": "لمبا کیا"
    },
    {
      "arabic": "بشرني",
      "english": "Gave me glad tidings",
      "urdu": "مجھے خوشخبری دی"
    },
    {
      "arabic": "سجدت",
      "english": "I prostrated",
      "urdu": "میں نے سجدہ کیا"
    },
    {
      "arabic": "شكرا",
      "english": "In gratitude",
      "urdu": "شکر کے طور پر"
    },
    {
      "arabic": "آتاني",
      "english": "Came to me",
      "urdu": "میرے پاس آیا"
    },
    {
      "arabic": "رفع رأسه",
      "english": "Raised his head",
      "urdu": "اپنا سر اٹھایا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سجدہ شکر کی مشروعیت پر دلالت کرتی ہے۔ جب انسان کو کوئی بڑی نعمت ملے یا مصیبت ٹل جائے تو اللہ کے حضور سجدہ شکر کرنا سنت ہے۔",
    "english": "This Hadith proves the legitimacy of Sujud ash-Shukr (Prostration of Gratitude). When one receives a blessing or is relieved of a hardship, it is Sunnah to prostrate to Allah in gratitude."
  },
  "references": [
    {
      "arabic": "رواه أحمد (1664)",
      "english": "Reported by Ahmad (1664)"
    },
    {
      "arabic": "رواه الحاكم (1/550)",
      "english": "Reported by Al-Hakim (1/550)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الرحمن بن عوف",
        "english": "Abdur-Rahman bin Awf"
      },
      "slug": "abdur-rahman-bin-awf"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=EXAMPLE_ID_SUJUD_SHUKR",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر",
        "english": "Context of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جبرائیل کی بشارت",
              "english": "Glad tidings of Jibril"
            },
            "content": {
              "urdu": [
                "دوسری روایات سے معلوم ہوتا ہے کہ یہ بشارت درود شریف کے بارے میں تھی۔",
                "کہ جو شخص آپ ﷺ پر ایک بار درود پڑھے گا، اللہ اس پر دس رحمتیں بھیجے گا۔",
                "اتنی بڑی خوشخبری سن کر آپ ﷺ نے فوراً سجدہ کیا۔"
              ],
              "english": [
                "Other narrations indicate this news was regarding Salawat upon the Prophet.",
                "That whoever sends blessings on him once, Allah will send ten blessings on him.",
                "Upon hearing such great news, he (ﷺ) immediately prostrated."
              ]
            }
          },
          {
            "title": {
              "urdu": "طویل سجدہ",
              "english": "Prolonged Prostration"
            },
            "content": {
              "urdu": [
                "خوشی کے موقع پر اللہ کے سامنے عاجزی کرنا انبیاء کا شیوہ ہے۔",
                "آپ ﷺ نے سجدہ اتنا لمبا کیا کہ صحابہ کو فکر ہونے لگی۔",
                "شکر کا بہترین اظہار زبان کے ساتھ ساتھ عمل (سجدہ) سے بھی ہوتا ہے۔"
              ],
              "english": [
                "Showing humility to Allah during joy is the way of the Prophets.",
                "He (ﷺ) prolonged the prostration so much that Companions got worried.",
                "The best expression of gratitude is through action (Sujud) along with speech."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل",
        "english": "Juristic Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سجدہ شکر کا حکم",
              "english": "Ruling on Sujud ash-Shukr"
            },
            "content": {
              "urdu": [
                "جمہور علماء (شافعیہ، حنابلہ) کے نزدیک سجدہ شکر مستحب ہے۔",
                "امام مالک اور امام ابو حنیفہ کے نزدیک یہ مکروہ یا غیر مسنون ہے (مشہور روایت میں)۔",
                "تاہم صحیح احادیث اور صحابہ کا عمل اس کے جواز اور استحباب پر قوی دلیل ہے۔"
              ],
              "english": [
                "According to the majority (Shafi'is, Hanbalis), Sujud ash-Shukr is recommended.",
                "According to Imam Malik and Abu Hanifa, it is disliked or not Sunnah (in famous view).",
                "However, authentic Hadiths and actions of Companions are strong evidence for it."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرائطِ سجدہ",
              "english": "Conditions of Prostration"
            },
            "content": {
              "urdu": [
                "اکثر علماء کے نزدیک اس کے لیے وضو شرط ہے جیسے نماز کے لیے۔",
                "بعض محققین (جیسے ابن تیمیہ) کے نزدیک اچانک خبر پر بغیر وضو بھی سجدہ جائز ہے۔",
                "بہتر یہی ہے کہ باوضو ہو کر قبلہ رخ سجدہ کیا جائے۔"
              ],
              "english": [
                "Most scholars consider Wudu a condition for it, like prayer.",
                "Some researchers (like Ibn Taymiyyah) say it is permissible without Wudu for sudden news.",
                "It is better to be in a state of Wudu and face the Qiblah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی",
        "english": "Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نعمت پر ردعمل",
              "english": "Reaction to Blessings"
            },
            "content": {
              "urdu": [
                "جب کوئی اچھی خبر (اولاد، کامیابی، صحت) ملے تو 'الحمدللہ' کہہ کر سجدہ کریں۔",
                "یہ عمل انسان کو تکبر سے بچاتا ہے اور نعمت میں برکت ڈالتا ہے۔",
                "آج کل لوگ خوشی میں غیر شرعی کام کرتے ہیں، ہمیں سنت زندہ کرنی چاہیے۔"
              ],
              "english": [
                "When receiving good news (child, success, health), say 'Alhamdulillah' and prostrate.",
                "This action saves one from arrogance and adds blessings to the favor.",
                "Nowadays people do un-Islamic acts in joy; we should revive the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی طرف رجوع",
              "english": "Turning to Allah"
            },
            "content": {
              "urdu": [
                "ہر کامیابی کو اپنی محنت نہیں بلکہ اللہ کا فضل سمجھنا چاہیے۔",
                "سجدہ شکر اس بات کا اعتراف ہے کہ دینے والی ذات صرف اللہ ہے۔",
                "نبی ﷺ کا عمل ہمیں اللہ سے جوڑنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Success should be attributed to Allah's grace, not just personal effort.",
                "Sujud ash-Shukr is an acknowledgment that the Giver is only Allah.",
                "The Prophet's (ﷺ) action is the best means to connect us with Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کا عمل",
        "english": "Practice of Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابوبکر صدیقؓ کا سجدہ",
              "english": "Prostration of Abu Bakr"
            },
            "content": {
              "urdu": [
                "جب مسیلمہ کذاب کے قتل کی خبر ملی تو سیدنا ابوبکرؓ نے سجدہ شکر کیا۔",
                "یہ فتنہ ختم ہونے پر اللہ کا شکر ادا کرنے کا طریقہ تھا۔",
                "خلفائے راشدین نے اس سنت کو زندہ رکھا۔"
              ],
              "english": [
                "When the news of Musaylimah the Liar's death came, Abu Bakr (RA) prostrated.",
                "This was a way to thank Allah for the end of that tribulation.",
                "The Rightly Guided Caliphs kept this Sunnah alive."
              ]
            }
          },
          {
            "title": {
              "urdu": "علیؓ کا سجدہ",
              "english": "Prostration of Ali"
            },
            "content": {
              "urdu": [
                "سیدنا علیؓ نے جب ذوالثدیہ (خوارج کا لیڈر) کی لاش دیکھی تو سجدہ کیا۔",
                "یہ اس بات پر شکر تھا کہ وہ حق پر ہیں اور پیشین گوئی پوری ہوئی۔",
                "مشکل وقت کے ٹل جانے پر بھی سجدہ کرنا ثابت ہے۔"
              ],
              "english": [
                "When Ali (RA) saw the body of Dhul-Thudayyah (Kharijite leader), he prostrated.",
                "This was gratitude that he was on the truth and the prophecy was fulfilled.",
                "Prostrating upon the removal of difficulty is also established."
              ]
            }
          }
        ]
      }
    }
  ]
}
