{
  "hadithId": 803,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/803"],
    "kitabId": 7,
    "inKitabBab": 19,
    "arabicBook": "بلوغ المرام",
    "babId": 60
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه مسلم في صحيحه (1724)، كتاب اللقطة.",
    "urdu": "یہ حدیث صحیح ہے، اسے امام مسلم نے اپنی صحیح (1724) میں روایت کیا ہے۔",
    "english": "Sahih. Recorded by Muslim in his Sahih (1724), in the Book of Lost Property."
  },
  "importantWords": [
    {
      "arabic": "نَهَى",
      "english": "Prohibited",
      "urdu": "منع فرمایا"
    },
    {
      "arabic": "لُقَطَةِ",
      "english": "Lost property",
      "urdu": "گری پڑی چیز"
    },
    {
      "arabic": "الْحَاجِّ",
      "english": "The pilgrim",
      "urdu": "حاجی"
    },
    {
      "arabic": "تَمْلِيك",
      "english": "Ownership",
      "urdu": "مالک بننا"
    },
    {
      "arabic": "تَعْرِيف",
      "english": "Announcement",
      "urdu": "اعلان کرنا"
    }
  ],
  "summary": {
    "urdu": "حرم مکہ اور حجاج کرام کی گری پڑی اشیاء کے لیے خاص احکام ہیں؛ انہیں صرف اس نیت سے اٹھایا جا سکتا ہے کہ ان کا ہمیشہ اعلان کیا جائے، نہ کہ وہ کبھی پانے والے کی ملکیت بن سکیں۔",
    "english": "There are special rulings for items lost by pilgrims; they may only be picked up with the intention of perpetual announcement, never becoming the finder's property."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1724)",
      "english": "Sahih Muslim (1724)"
    },
    {
      "arabic": "بلوغ المرام (803)",
      "english": "Bulugh al-Maram (803)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الرحمن بن عثمان التيمي",
        "english": "Abdur-Rahman bin Uthman at-Taimi"
      },
      "slug": "abdur-rahman-bin-uthman-at-taimi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9j6Q3bU_I8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرم کی لقطہ کے خاص احکام",
        "english": "Specific Rulings for Haram's Lost Property"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عام لقطہ اور حرم کی لقطہ میں فرق",
              "english": "Difference Between General and Haram Items"
            },
            "content": {
              "urdu": [
                "عام جگہوں کی گری پڑی چیز ایک سال اعلان کے بعد پانے والے کی ہو سکتی ہے۔",
                "لیکن حرم مکہ یا حاجی کی گری ہوئی چیز کبھی پانے والے کی ملکیت نہیں بنتی۔",
                "اسے صرف وہی شخص اٹھائے جو اسے ہمیشہ کے لیے سنبھالنے کی طاقت رکھتا ہو۔"
              ],
              "english": [
                "General lost property can become the finder's after a year of announcement.",
                "However, property lost in Haram or by a pilgrim never becomes the finder's property.",
                "Only those who have the capacity for perpetual announcement should pick it up."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی وجہ",
              "english": "Reason for the Prohibition"
            },
            "content": {
              "urdu": [
                "حجاج کی سہولت اور ان کے اموال کی حفاظت اسلام میں بہت اہم ہے۔",
                "اگر لوگ چیزیں نہیں اٹھائیں گے تو حاجی واپس آکر اپنی چیز خود پا لے گا۔",
                "یہ حکم مکہ مکرمہ کی حرمت اور تقدس کو برقرار رکھنے کے لیے دیا گیا ہے۔"
              ],
              "english": [
                "Protecting pilgrims' property and ensuring their convenience is vital in Islam.",
                "If people leave the items, the pilgrim is more likely to find them upon returning.",
                "This ruling is given to maintain the sanctity and safety of Makkah al-Mukarramah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی بصیرت",
        "english": "Juristic Insight"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعلان کی مدت",
              "english": "Duration of Announcement"
            },
            "content": {
              "urdu": [
                "حرم کی چیز کا اعلان ایک سال تک محدود نہیں بلکہ ہمیشہ کے لیے ہے۔",
                "پانے والا اسے استعمال نہیں کر سکتا خواہ وہ کتنا ہی وقت کیوں نہ گزر جائے۔",
                "اگر مالک نہ ملے تو اسے سرکاری بیت المال یا لقطہ سینٹر میں جمع کرانا چاہیے۔"
              ],
              "english": [
                "The announcement for Haram items is not limited to a year but is perpetual.",
                "The finder cannot utilize the item regardless of how much time passes by.",
                "If the owner isn't found, it should be handed to the official lost and found centers."
              ]
            }
          },
          {
            "title": {
              "urdu": "اٹھانے والے کی ذمہ داری",
              "english": "Responsibility of the Finder"
            },
            "content": {
              "urdu": [
                "اگر نیت ملکیت کی ہے تو ایسی چیز اٹھانا سخت گناہ اور حرام ہے۔",
                "صرف وہی شخص اٹھائے جس کا مقصد حاجی پر احسان اور چیز کی حفاظت ہو۔",
                "جدید دور میں مکہ میں موجود سرکاری دفاتر میں اسے جمع کرانا ہی بہتر ہے۔"
              ],
              "english": [
                "Picking up such an item with the intent of ownership is a grave sin.",
                "It should only be picked up by someone intending to protect it for the pilgrim.",
                "In modern times, the best practice is to hand it over to Makkah's official offices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حجاج کی خدمت",
              "english": "Serving the Pilgrims"
            },
            "content": {
              "urdu": [
                "حجاج کرام اللہ کے مہمان ہیں اور ان کا احترام ہم پر واجب ہے۔",
                "ان کے مال کی حفاظت کرنا درحقیقت اللہ کے مہمانوں کی خدمت ہے۔",
                "اسلام ہمیں ایثار اور خیر خواہی کا درس دیتا ہے نہ کہ دوسروں کے مال پر نظر کا۔"
              ],
              "english": [
                "Pilgrims are the guests of Allah, and respecting them is obligatory for us.",
                "Protecting their property is, in reality, serving the guests of Allah.",
                "Islam teaches altruism and goodwill rather than eyeing others' belongings."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت اور دیانت",
              "english": "Trust and Integrity"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک مومن کے اعلیٰ کردار اور امانت داری کی تربیت کرتی ہے۔",
                "گری پڑی چیز کو دیکھ کر لالچ میں نہ آنا تقویٰ کی نشانی ہے۔",
                "مسلمانوں کا ایک دوسرے کے مال کے بارے میں امین ہونا ضروری ہے۔"
              ],
              "english": [
                "This Hadith trains a believer in high character and trustworthiness.",
                "Not succumbing to greed upon seeing lost property is a sign of piety.",
                "It is essential for Muslims to be guardians of each other's wealth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرم میں گری ہوئی چیز پانے پر کیا کریں؟",
              "english": "What to do if an item is found in Haram?"
            },
            "content": {
              "urdu": [
                "اگر آپ حفاظت کی ذمہ داری نہیں اٹھا سکتے تو اسے وہیں رہنے دیں۔",
                "بہترین عمل یہ ہے کہ اسے قریبی پولیس اہلکار یا لقطہ دفتر کے حوالے کریں۔",
                "خود پاس رکھ کر بھول جانا یا اعلان نہ کرنا حاجی کے حق میں خیانت ہے۔"
              ],
              "english": [
                "If you cannot take responsibility for its protection, leave it where it is.",
                "The best action is to hand it to a nearby police officer or lost property office.",
                "Keeping it and failing to announce it is a breach of the pilgrim's trust."
              ]
            }
          },
          {
            "title": {
              "urdu": "سماجی بیداری",
              "english": "Social Awareness"
            },
            "content": {
              "urdu": [
                "لوگوں کو حج و عمرہ پر جانے سے پہلے ان احکام سے واقف ہونا چاہیے۔",
                "حرم کی زمین کے آداب باقی زمینوں سے مختلف اور زیادہ سخت ہیں۔",
                "ایک ذمہ دار شہری بن کر قوانین کی پابندی کرنا شرعی تقاضا بھی ہے۔"
              ],
              "english": [
                "People should be aware of these rulings before departing for Hajj or Umrah.",
                "The etiquette of Haram land is different and more strict than other lands.",
                "Abiding by regulations as a responsible citizen is also a Shariah requirement."
              ]
            }
          }
        ]
      }
    }
  ]
}