{
  "hadithId": 2,
  "hadithNo": 2,

  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 1,
    "inKitabBab": 1,
    "arabicBook": "",
    "babId": 1
  },
  "takhreej": {
    "arabic": "صحيح: رواه أبو داود (66)، والنسائي (174)، والترمذي (66) عن أبي سعيد الخدري، قال: قيل: يا رسول الله (!) أنتوضأ من بئر بضاعة، وهي بئر يلقى فيها الحيض، ولحوم الكلاب، والنتن؟! فقال رسول الله صلى الله عليه وسلم: «إن الماء طهور لا ينجسه شيء». قلت: وهو حديث صحيح، وإن أُعل بجهالة أحد رواته، لكن له طرق وشواهد أخرى يصح بها الحديث، كما تجد ذلك مفصلاً في الأصل. فائدة: قوله في الحديث: \"وهي بئر يلقى فيها الحيض، ولحوم الكلاب، والنتن\"، قال الخطابي في معالم السنن (1/37): يتوهم كثير من الناس إذا سمع هذا الحديث أن هذا كان منهم عادة، وهذا لا يجوز أن يظن بذمي فضلاً عن مسلم، وإنما كانت السيول تكسح الأقذار فتلقيها فيها، والماء لكثرته لا يتأثر.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابو داود (66)، نسائی (174) اور ترمذی (66) نے روایت کیا ہے۔ ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ کہا گیا: اے اللہ کے رسول ﷺ! کیا ہم بئر بضاعة کے پانی سے وضو کریں، حالانکہ اس میں حیض کے کپڑے، کتوں کا گوشت اور بدبو دار چیزیں پھینکی جاتی ہیں؟ تو رسول اللہ ﷺ نے فرمایا: 'پانی پاک ہے، اسے کوئی چیز ناپاک نہیں کرتی'۔ اس کی سند میں ایک راوی کی جہالت کی وجہ سے علت بیان کی گئی ہے، لیکن دیگر طرق سے یہ حدیث صحیح ثابت ہوتی ہے۔",
    "english": "Sahih: Reported by Abu Dawood (66), an-Nasa’i (174), and at-Tirmidhi (66) from Abu Sa’eed al-Khudri. It was said: 'O Messenger of Allah! Shall we perform wudu from the well of Budha’ah, which people throw menstrual cloths, dog flesh, and filth into?' The Prophet ﷺ replied: 'Water is pure; nothing makes it impure.' Though one of its narrators was criticized for being unknown, the hadith is authentic due to supporting chains and evidences."
  },
  "importantWords": [
    {
      "arabic": "طَهُورٌ",
      "english": "Pure and purifying",
      "urdu": "پاک اور پاک کرنے والا"
    },
    {
      "arabic": "يُنَجِّسُهُ",
      "english": "Makes it impure",
      "urdu": "ناپاک کرنا"
    },
    {
      "arabic": "بئر بضاعة",
      "english": "Well of Budha’ah",
      "urdu": "بئر بضاعہ (مدینہ منورہ کی ایک مشہور کنواں)"
    }
  ],
  "summary": {
    "urdu": "رسول اللہ ﷺ نے فرمایا کہ پانی بذات خود پاک ہے اور کوئی چیز اسے ناپاک نہیں کرتی جب تک کہ اس کے رنگ، بو یا ذائقہ میں تبدیلی نہ ہو۔ یہ اصول اسلام میں طہارت کا بنیادی قاعدہ ہے۔",
    "english": "The Prophet ﷺ declared that water is pure by nature and nothing can make it impure unless its color, smell, or taste changes. This is a foundational rule in Islamic purification."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، باب ما جاء في الماء لا ينجسه شيء، حديث رقم 66",
      "english": "Sunan Abu Dawood, Book of Purification, Chapter: Water does not become impure, Hadith No. 66"
    },
    {
      "arabic": "سنن الترمذي، كتاب الطهارة، باب ما جاء أن الماء طهور لا ينجسه شيء، حديث رقم 66",
      "english": "Jami‘ at-Tirmidhi, Book of Purification, Hadith No. 66"
    },
    {
      "arabic": "سنن النسائي، كتاب الطهارة، باب الماء لا ينجسه شيء، حديث رقم 174",
      "english": "Sunan an-Nasa’i, Book of Purification, Hadith No. 174"
    },
    {
      "arabic": "سنن ابن ماجه، كتاب الطهارة وسننها، باب الماء لا ينجسه شيء، حديث رقم 521",
      "english": "Sunan Ibn Majah, Book of Purification and its Sunnah, Hadith No. 521"
    },
    {
      "arabic": "مسند أحمد بن حنبل، حديث رقم 11703",
      "english": "Musnad Ahmad, Hadith No. 11703"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa‘eed al-Khudri (may Allah be pleased with him)"
      },
      "slug": "abu-saeed-al-khudri"
    },
    {
      "id": 2,
      "name": {
        "arabic": "رسول الله ﷺ",
        "english": "Prophet Muhammad ﷺ"
      },
      "slug": "prophet-muhammad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=8m-PO50_c6Q",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی کی فطری پاکیزگی",
              "english": "Natural Purity of Water"
            },
            "content": {
              "urdu": [
                "پانی بذات خود پاک چیز ہے۔",
                "اگر اس میں ناپاکی گر بھی جائے تو وہ پاک رہتا ہے جب تک اس کے رنگ، بو یا ذائقہ میں تبدیلی نہ ہو۔",
                "اسلامی قانون میں یہ قاعدہ طہارت کے اصولوں کی بنیاد ہے۔"
              ],
              "english": [
                "Water is inherently pure.",
                "It remains pure even if impurity falls into it, as long as its color, taste, or smell are unchanged.",
                "This is a fundamental principle of Islamic jurisprudence regarding purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "بئر بضاعہ کا پس منظر",
              "english": "Background of the Well of Budha’ah"
            },
            "content": {
              "urdu": [
                "بئر بضاعہ مدینہ میں ایک مشہور کنواں تھا۔",
                "لوگوں نے سوال کیا کیونکہ اس میں بارش اور سیلاب کے ذریعے کچھ گندگی آجاتی تھی۔",
                "نبی ﷺ نے وضاحت فرمائی کہ پانی کی کثرت کی وجہ سے وہ ناپاک نہیں ہوتا۔"
              ],
              "english": [
                "The Well of Budha’ah was a well in Madinah.",
                "People questioned its purity because some filth was washed into it by floods.",
                "The Prophet ﷺ explained that the large volume of water prevents impurity from affecting it."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی فوائد",
        "english": "Jurisprudential Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی کے ناپاک ہونے کا اصول",
              "english": "Rule for Water Becoming Impure"
            },
            "content": {
              "urdu": [
                "پانی تب ہی ناپاک ہوتا ہے جب ناپاکی اس کے رنگ، بو یا ذائقے میں اثر ڈال دے۔",
                "اگر اثر ظاہر نہ ہو تو وہ پاک رہتا ہے۔",
                "یہی رائے جمہور علماء کی ہے۔"
              ],
              "english": [
                "Water only becomes impure when impurity changes its color, taste, or smell.",
                "If no change occurs, the water remains pure.",
                "This is the opinion of the majority of scholars."
              ]
            }
          },
          {
            "title": {
              "urdu": "کثرتِ پانی کا اثر",
              "english": "Effect of Water Quantity"
            },
            "content": {
              "urdu": [
                "بڑے ذخیرے کا پانی معمولی ناپاکی سے متاثر نہیں ہوتا۔",
                "نبی ﷺ نے اسی اصول کی بنیاد پر بئر بضاعہ کے پانی کو پاک قرار دیا۔",
                "فقہاء نے اس سے بڑے اور چھوٹے پانی کے احکام اخذ کیے۔"
              ],
              "english": [
                "Large bodies of water are not affected by minor impurities.",
                "The Prophet ﷺ declared the well’s water pure on this basis.",
                "Scholars derived rulings differentiating large and small quantities of water from this hadith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عقیدتی و روحانی سبق",
        "english": "Spiritual Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پاکیزگی ایمان کا حصہ ہے",
              "english": "Purity is Part of Faith"
            },
            "content": {
              "urdu": [
                "اسلام میں طہارت ایمان کا لازمی حصہ ہے۔",
                "باطنی (دل کی) اور ظاہری (جسم کی) دونوں صفائیاں مطلوب ہیں۔",
                "اللہ تعالیٰ پاکیزگی پسند کرتا ہے۔"
              ],
              "english": [
                "In Islam, purification is part of faith.",
                "Both inner (spiritual) and outer (physical) cleanliness are essential.",
                "Allah loves those who are pure and clean."
              ]
            }
          },
          {
            "title": {
              "urdu": "وسوسوں سے بچاؤ",
              "english": "Avoiding Unnecessary Doubts"
            },
            "content": {
              "urdu": [
                "یہ حدیث انسان کو وضو اور طہارت میں غیر ضروری وسوسوں سے بچاتی ہے۔",
                "جب تک واضح ناپاکی نہ دکھائی دے، پانی کو پاک سمجھنا چاہیے۔",
                "یہ اسلام کی آسانی اور سہولت کی تعلیم ہے۔"
              ],
              "english": [
                "This hadith protects believers from unnecessary doubts in purification.",
                "One should assume water is pure unless impurity is visible or perceptible.",
                "It reflects the ease and balance in Islamic law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اسباق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی کا احترام",
              "english": "Respect for Water"
            },
            "content": {
              "urdu": [
                "پانی کو پاکیزگی اور زندگی کا ذریعہ سمجھنا چاہیے۔",
                "اسے فضول خرچی یا آلودگی سے بچانا ضروری ہے۔",
                "اسلامی معاشرہ صفائی اور فطرت کی حفاظت پر مبنی ہے۔"
              ],
              "english": [
                "Water is a source of purity and life.",
                "We must avoid wasting or polluting it.",
                "An Islamic society values cleanliness and environmental care."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی رحمت کا مظہر",
              "english": "Sign of Allah’s Mercy"
            },
            "content": {
              "urdu": [
                "اللہ نے پاکیزگی کے احکام میں آسانی رکھی ہے۔",
                "پانی کو ناپاک قرار دینے میں شدت نہیں بلکہ اعتدال ہے۔",
                "یہ امت کے لیے اللہ کی رحمت کا اظہار ہے۔"
              ],
              "english": [
                "Allah has made the laws of purification easy.",
                "Declaring water impure is based on clarity, not excessive strictness.",
                "This shows Allah’s mercy toward His servants."
              ]
            }
          }
        ]
      }
    }
  ]
}
