{
  "hadithId": 606,
  "hadithNo": 14,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/6/28"],
    "kitabId": 6,
    "inKitabBab": 4,
    "arabicBook": "كتاب الحج",
    "babId": 39
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (1870)، ومسلم (1370).‏ وقوله صلى الله عليه وسلم: 'المدينة حرم' أي لا ينفر صيدها ولا يقطع شجرها كما هو الحال في حرم مكة.",
    "urdu": "صحیح۔ اسے امام بخاری (1870) اور امام مسلم (1370) نے روایت کیا ہے۔ یہاں 'حرم' سے مراد یہ ہے کہ مدینہ کے حدود میں بھی شکار کرنا اور درخت کاٹنا ممنوع ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (1870) and Muslim (1370). The declaration of Al-Madinah as a sanctuary means that its game must not be molested and its trees must not be cut, similar to Makkah."
  },
  "importantWords": [
    {
      "arabic": "حَرَمٌ",
      "english": "Sanctuary / Sacred",
      "urdu": "حرم / قابلِ احترام جگہ"
    },
    {
      "arabic": "عَيْر",
      "english": "'Ayr (Mountain name)",
      "urdu": "عیر (مدینہ کا ایک پہاڑ)"
    },
    {
      "arabic": "ثَوْر",
      "english": "Thawr (Mountain name)",
      "urdu": "ثور (مدینہ کا ایک پہاڑ)"
    }
  ],
  "summary": {
    "urdu": "جس طرح مکہ مکرمہ حرم ہے، اسی طرح نبی ﷺ نے مدینہ منورہ کو بھی حرم قرار دیا ہے جس کی حدود عیر اور ثور پہاڑ کے درمیان واقع ہیں۔",
    "english": "Just as Makkah is a sanctuary, the Prophet (ﷺ) declared Madinah as a sanctuary as well, defining its boundaries between the mountains of 'Ayr and Thawr."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (1370)",
      "english": "Sahih Muslim (1370)"
    },
    {
      "arabic": "صحيح البخاري (1870)",
      "english": "Sahih al-Bukhari (1870)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F0f5u4L8Nl8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرمِ مدینہ کی حقیقت",
        "english": "The Reality of Madinah's Sanctuary"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی دعا",
              "english": "The Prophet's (ﷺ) Supplication"
            },
            "content": {
              "urdu": [
                "جس طرح سیدنا ابراہیم علیہ السلام نے مکہ کو حرم بنایا، نبی ﷺ نے مدینہ کو حرم قرار دیا۔",
                "آپ ﷺ نے مدینہ کی برکت، اس کے پھلوں اور پیمانوں (صاع اور مد) کے لیے خصوصی دعا فرمائی۔",
                "یہ شہر وحی کا مرکز اور اسلام کا قلعہ بنا۔"
              ],
              "english": [
                "Just as Prophet Ibrahim made Makkah a sanctuary, Prophet Muhammad (ﷺ) declared Madinah one.",
                "The Prophet (ﷺ) made specific prayers for the blessings of Madinah, its fruits, and its measures (Sa' and Mudd).",
                "This city became the center of Revelation and the fortress of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدودِ حرم کی وضاحت",
              "english": "Clarification of Boundaries"
            },
            "content": {
              "urdu": [
                "عیر اور ثور مدینہ کے دو پہاڑ ہیں جو شمال اور جنوب کی حدود متعین کرتے ہیں۔",
                "ان حدود کے اندر کسی قسم کی خونریزی یا فتنہ و فساد کی سخت ممانعت ہے۔",
                "مدینہ کے حرم کا تقدس قائم رکھنا ہر مسلمان پر لازم ہے۔"
              ],
              "english": [
                "'Ayr and Thawr are two mountains in Madinah defining the North and South boundaries.",
                "Any bloodshed, fitnah, or mischief within these limits is strictly forbidden.",
                "Upholding the sanctity of Madinah's sanctuary is obligatory for every Muslim."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ممنوعہ افعال",
        "english": "Prohibited Actions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شکار اور درختوں کی کٹائی",
              "english": "Hunting and Cutting Trees"
            },
            "content": {
              "urdu": [
                "حرمِ مدینہ میں جنگلی جانوروں کا شکار کرنا ممنوع ہے۔",
                "یہاں کے خود رو سبزے اور درختوں کو بلا ضرورت کاٹنے کی اجازت نہیں ہے۔",
                "ان احکامات کا مقصد امن کی فضا اور قدرتی حسن کو برقرار رکھنا ہے۔"
              ],
              "english": [
                "Hunting wild animals within the sanctuary of Madinah is prohibited.",
                "Cutting naturally growing vegetation and trees without necessity is not allowed.",
                "These rulings aim to maintain an atmosphere of peace and preserve natural beauty."
              ]
            }
          },
          {
            "title": {
              "urdu": "فتنہ گری کی سزا",
              "english": "Punishment for Inciting Fitnah"
            },
            "content": {
              "urdu": [
                "اسی حدیث کے طویل سیاق میں ہے کہ جو مدینہ میں کوئی فتنہ پیدا کرے اس پر اللہ کی لعنت ہے۔",
                "بدعت ایجاد کرنے والوں یا مجرموں کو پناہ دینے والوں کے لیے سخت وعید آئی ہے۔",
                "مدینہ کا امن پورے عالمِ اسلام کے امن سے وابستہ ہے۔"
              ],
              "english": [
                "In the longer context of this Hadith, the curse of Allah is upon whoever initiates a mischief in Madinah.",
                "Severe warnings are issued for those who innovate in religion or harbor criminals there.",
                "The peace of Madinah is linked to the peace of the entire Islamic world."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مکہ اور مدینہ کے حرم میں فرق",
        "english": "Difference Between Makkah and Madinah Sanctuaries"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فقہی موازنہ",
              "english": "Juristic Comparison"
            },
            "content": {
              "urdu": [
                "مکہ میں شکار کرنے پر فدیہ (جزا) واجب ہے، جبکہ مدینہ کے شکار پر اکثر فقہاء کے نزدیک گناہ ہے مگر مالی فدیہ نہیں۔",
                "مکہ میں مشرکین کا داخلہ ممنوع ہے، جبکہ مدینہ میں ضرورت کے تحت غیر مسلموں کے داخلے پر گنجائش ہے۔",
                "حرمِ مکہ کی حرمت زیادہ موکد اور سخت ہے۔"
              ],
              "english": [
                "Hunting in Makkah requires an expiation (Jaza), while in Madinah, it is a sin without a financial penalty according to most.",
                "Non-Muslims are strictly barred from Makkah, while there is some scope for entry into Madinah for necessity.",
                "The sanctity of the Makkah sanctuary is more emphasized and rigorous."
              ]
            }
          },
          {
            "title": {
              "urdu": "درختوں کا استعمال",
              "english": "Use of Trees"
            },
            "content": {
              "urdu": [
                "مدینہ میں ضرورت کے تحت (مثلاً اونٹوں کے چارے کے لیے) پتے جھاڑنے کی بعض صورتوں میں اجازت دی گئی ہے۔",
                "مکہ کے معاملے میں یہ احکام زیادہ سخت ہیں۔",
                "یہ تفاوت دونوں شہروں کی جغرافیائی اور شرعی حیثیت کے فرق کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "In Madinah, shaking leaves for necessity (e.g., camel fodder) is allowed in some cases.",
                "In Makkah, these rulings are much stricter.",
                "This variance shows the difference in the geographic and legal status of the two cities."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادبِ مدینہ",
              "english": "Etiquettes of Madinah"
            },
            "content": {
              "urdu": [
                "مدینہ منورہ میں قیام کے دوران نہایت ادب اور خاموشی اختیار کرنی چاہیے۔",
                "یہ وہ شہر ہے جس نے ہجرت کے وقت اسلام کو پناہ دی اور جہاں نبی ﷺ آرام فرما ہیں۔",
                "یہاں کی زمین اور اس کے باشندوں کا احترام ایمان کا حصہ ہے۔"
              ],
              "english": [
                "Extreme respect and quietude should be observed while staying in Madinah.",
                "This is the city that sheltered Islam during Hijrah and where the Prophet (ﷺ) rests.",
                "Respecting its land and inhabitants is a part of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "امن پسندی کا درس",
              "english": "Lesson of Peace"
            },
            "content": {
              "urdu": [
                "اسلام نے جانوروں اور پودوں تک کو امن فراہم کرنے کے لیے 'حرم' کا تصور دیا۔",
                "ایک مومن سے توقع کی جاتی ہے کہ وہ ہر جاندار کے لیے سلامتی کا پیغام بنے۔",
                "شہروں کا تقدس ہمیں نظم و ضبط اور قانون کی پاسداری سکھاتا ہے۔"
              ],
              "english": [
                "Islam introduced the concept of 'Haram' to provide safety even to animals and plants.",
                "A believer is expected to be a messenger of safety for every living being.",
                "The sanctity of cities teaches us discipline and adherence to the law."
              ]
            }
          }
        ]
      }
    }
  ]
}