{
  "hadithId": 802,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/802"],
    "kitabId": 7,
    "inKitabBab": 19,
    "arabicBook": "بلوغ المرام",
    "babId": 60
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أحمد (4/261)، وأبو داود (1709)، والنسائي في الكبرى (3/418)، وابن ماجه (2505)، وصححه ابن خزيمة وابن حبان.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد (1709)، نسائی اور ابن ماجہ نے روایت کیا ہے، اور ابن خزیمہ، ابن الجارود اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad (4/261), Abu Dawud (1709), An-Nasa'i in Al-Kubra (3/418), and Ibn Majah (2505). Authenticated by Ibn Khuzaymah and Ibn Hibban."
  },
  "importantWords": [
    {
      "arabic": "لُقَطَةً",
      "english": "Lost property",
      "urdu": "گری پڑی چیز"
    },
    {
      "arabic": "ذَوَيْ عَدْلٍ",
      "english": "Two just witnesses",
      "urdu": "دو عادل گواہ"
    },
    {
      "arabic": "عِفَاصَهَا",
      "english": "Its container",
      "urdu": "اس کا برتن/تھیلی"
    },
    {
      "arabic": "وِكَاءَهَا",
      "english": "Its string/binding",
      "urdu": "اس کا تسمہ/بندھن"
    },
    {
      "arabic": "لَا يَكْتُمْ",
      "english": "Do not conceal",
      "urdu": "نہ چھپائے"
    },
    {
      "arabic": "رَبُّهَا",
      "english": "Its owner",
      "urdu": "اس کا مالک"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں گری پڑی چیز پانے کے آداب بیان ہوئے ہیں، جن میں گواہ بنانا، نشانیوں کو یاد رکھنا اور مالک کے نہ ملنے پر اسے اللہ کا عطیہ سمجھنا شامل ہے۔",
    "english": "This Hadith outlines the etiquette of finding lost property, including taking witnesses, noting its description, and considering it a gift from Allah if no owner appears."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1709)",
      "english": "Reported by Abu Dawud (1709)"
    },
    {
      "arabic": "رواه ابن ماجه (2505)",
      "english": "Reported by Ibn Majah (2505)"
    },
    {
      "arabic": "صحيح ابن حبان (1169)",
      "english": "Sahih Ibn Hibban (1169)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عياض بن حمار",
        "english": "Iyad bin Himar"
      },
      "slug": "iyad-bin-himar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0uS8zXj0v4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تحفظ اور گواہی",
        "english": "Protection and Witnessing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گواہ بنانے کی حکمت",
              "english": "Wisdom of Witnesses"
            },
            "content": {
              "urdu": [
                "گری پڑی چیز پاتے ہی دو عادل گواہ بنانا دیانت داری کی علامت ہے۔",
                "یہ عمل انسان کو شیطان کے وسوسوں اور خیانت سے محفوظ رکھتا ہے۔",
                "بوقت ضرورت گواہ اس بات کی تصدیق کر سکتے ہیں کہ پانے والے کی نیت نیک تھی۔"
              ],
              "english": [
                "Appointing two just witnesses upon finding an item is a sign of integrity.",
                "This action protects the finder from Satanic whispers and potential dishonesty.",
                "Witnesses can testify to the finder's good intentions if a dispute arises later."
              ]
            }
          },
          {
            "title": {
              "urdu": "نشانیوں کا حفظ کرنا",
              "english": "Memorizing Descriptions"
            },
            "content": {
              "urdu": [
                "چیز کے تھیلے، بندھن اور بیرونی علامات کو اچھی طرح یاد رکھنا واجب ہے۔",
                "یہ اس لیے ہے تاکہ جب کوئی دعویدار آئے تو اس کی سچائی پرکھی جا سکے۔",
                "بغیر مکمل نشانیوں کی تصدیق کے چیز کسی کے حوالے کرنا جائز نہیں ہے۔"
              ],
              "english": [
                "It is mandatory to memorize the container, binding, and external features of the item.",
                "This allows the finder to verify the truthfulness of any future claimant.",
                "Handing over the item without confirming accurate descriptions is not permissible."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ضابطے",
        "english": "Legal Framework"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالک کا حقِ ترجیح",
              "english": "Owner's Right of Priority"
            },
            "content": {
              "urdu": [
                "اصل مالک جب بھی آ جائے، وہ اپنی چیز واپس لینے کا پورا حق رکھتا ہے۔",
                "پانے والے پر لازم ہے کہ وہ چیز یا اس کی قیمت مالک کو لوٹائے۔",
                "اسلام میں شخصی ملکیت کا احترام ہر حال میں مقدم رکھا گیا ہے۔"
              ],
              "english": [
                "The original owner has the full right to reclaim their property whenever they appear.",
                "The finder is obligated to return the actual item or its equivalent value to the owner.",
                "Respect for private property is prioritized under all circumstances in Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالِ اللہ کا مفہوم",
              "english": "Meaning of 'Property of Allah'"
            },
            "content": {
              "urdu": [
                "اگر تلاش کے باوجود مالک نہ ملے تو وہ مال پانے والے کے لیے حلال ہو جاتا ہے۔",
                "اسے 'اللہ کا مال' اس لیے کہا گیا کہ یہ بغیر مشقت کے حاصل ہوا عطیہ ہے۔",
                "اس صورت میں پانے والا اسے اپنی ضرورت میں استعمال کر سکتا ہے۔"
              ],
              "english": [
                "If the owner is not found after searching, the property becomes lawful for the finder.",
                "It is called 'Property of Allah' because it is a gift received without labor.",
                "In this case, the finder is permitted to use it for their own personal needs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی پہلو",
        "english": "Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عدمِ اخفاء (چھپانے کی ممانعت)",
              "english": "Prohibition of Concealment"
            },
            "content": {
              "urdu": [
                "حدیث میں چیز کو چھپانے یا غائب کرنے سے سختی سے روکا گیا ہے۔",
                "خفیہ طور پر چیز رکھ لینا چوری کے مشابہ عمل قرار دیا گیا ہے۔",
                "مومن کا شیوہ ہے کہ وہ ہر معاملے میں شفافیت اور سچائی کو اپنائے۔"
              ],
              "english": [
                "The Hadith strictly prohibits concealing or hiding the found object.",
                "Keeping the item secretly is considered an act similar to theft.",
                "It is the character of a believer to adopt transparency and truth in all matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیانت اور امانت",
              "english": "Honesty and Trust"
            },
            "content": {
              "urdu": [
                "امانت داری صرف رکھے ہوئے مال میں نہیں بلکہ ملی ہوئی چیز میں بھی ہے۔",
                "یہ حکم معاشرے کے افراد میں ایک دوسرے کا سہارا بننے کا جذبہ پیدا کرتا ہے۔",
                "دیانت داری سے کام لینے والے کے مال و جان میں اللہ برکت عطا فرماتا ہے۔"
              ],
              "english": [
                "Trustworthiness applies not only to kept deposits but also to found items.",
                "This ruling fosters a spirit of mutual support among community members.",
                "Allah grants blessings in the wealth and life of those who act with honesty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی اسباق",
        "english": "Educational and Reformative Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی ذمہ داری",
              "english": "Social Responsibility"
            },
            "content": {
              "urdu": [
                "گری پڑی چیز اٹھانا ایک سماجی خدمت ہے بشرطیکہ حق ادا کیا جائے۔",
                "لوگوں کو لقطہ کے احکام سے آگاہ کرنا علماء اور والدین کی ذمہ داری ہے۔",
                "اس سے معاشرے میں ایک محفوظ اور بااعتماد ماحول پروان چڑھتا ہے۔"
              ],
              "english": [
                "Picking up a lost item is a social service, provided its rights are fulfilled.",
                "Educating people on the rules of Luqatah is the duty of scholars and parents.",
                "This nurtures a secure and trustworthy environment within the society."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی عطا پر شکر",
              "english": "Gratitude for Allah's Provision"
            },
            "content": {
              "urdu": [
                "اگر مالک نہ ملے تو اس مال کو اللہ کی طرف سے رزق سمجھنا چاہیے۔",
                "رزقِ حلال کی طلب اور حرام سے بچنا ایمان کا بنیادی تقاضا ہے۔",
                "ہر نعمت پر اللہ کا شکر ادا کرنا بندے کے درجات بلند کرتا ہے۔"
              ],
              "english": [
                "If the owner is not found, the wealth should be viewed as provision from Allah.",
                "Seeking lawful Rizq and avoiding Haram is a fundamental requirement of faith.",
                "Expressing gratitude to Allah for every blessing elevates a person's status."
              ]
            }
          }
        ]
      }
    }
  ]
}