{
  "hadithId": 1097,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["bulugh-al-maram/11/18"],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "كتاب الجهاد",
    "babId": 89
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (2512)، والترمذي (2972) واللفظ له، والنسائي في الكبرى (11004)، وابن حبان (4667)، والحاكم (2/275).",
    "urdu": "صحیح۔ اسے ابو داؤد (2512)، ترمذی (2972) اور نسائی نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح غریب کہا ہے، جبکہ ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Abu Dawud (2512), At-Tirmidhi (2972), An-Nasa'i in Al-Kubra (11004), Ibn Hibban (4667), and Al-Hakim (2/275). At-Tirmidhi graded it Hasan Sahih."
  },
  "importantWords": [
    {
      "arabic": "التَّهْلُكَةِ",
      "english": "Destruction",
      "urdu": "ہلاکت / بربادی"
    },
    {
      "arabic": "حَمَلَ",
      "english": "Charged / Attacked",
      "urdu": "حملہ کیا"
    },
    {
      "arabic": "صَفِ",
      "english": "Rank / Line",
      "urdu": "صف"
    },
    {
      "arabic": "أَنْكَرَ",
      "english": "Criticized / Denied",
      "urdu": "اعتراض کیا / برا مانا"
    },
    {
      "arabic": "مَعْشَرَ",
      "english": "Community / Group",
      "urdu": "گروہ / جماعت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں آیتِ 'ہلاکت' کی صحیح تفسیر بیان کی گئی ہے کہ ہلاکت سے مراد دشمن پر حملہ کرنا نہیں بلکہ جہاد چھوڑ کر دنیا داری میں مشغول ہو جانا ہے۔",
    "english": "This Hadith clarifies the true meaning of the verse regarding 'destruction', explaining that it refers to abandoning Jihad for worldly gains, not brave military charges."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (2972)",
      "english": "Narrated by At-Tirmidhi (2972)"
    },
    {
      "arabic": "رواه أبو داود (2512)",
      "english": "Narrated by Abu Dawud (2512)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو أيوب الأنصاري",
        "english": "Abu Ayyub al-Ansari"
      },
      "slug": "abu-ayyub-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3Xn89gA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آیت کا پس منظر اور مفہوم",
        "english": "Background and Meaning of the Verse"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقیقی ہلاکت کیا ہے؟",
              "english": "What is True Destruction?"
            },
            "content": {
              "urdu": [
                "صحابہ کے مطابق ہلاکت کا مطلب جہاد کو چھوڑ کر مال و دولت کی فکر میں لگ جانا ہے۔",
                "جب انصار نے سوچا کہ اب اسلام غالب آگیا ہے اور ہمیں زراعت سنبھالنی چاہیے، تب یہ آیت اتری۔",
                "دین کی خدمت سے کنارہ کشی اختیار کرنا ہی انسان کو اخروی تباہی کی طرف لے جاتا ہے۔"
              ],
              "english": [
                "According to the Companions, destruction means abandoning Jihad to focus solely on wealth.",
                "When the Ansar thought Islam had prevailed and they should return to farming, this verse was revealed.",
                "Withdrawing from the service of religion is what leads a person to eternal ruin."
              ]
            }
          },
          {
            "title": {
              "urdu": "شجاعت اور خودکشی میں فرق",
              "english": "Bravery vs. Suicide"
            },
            "content": {
              "urdu": [
                "دشمن کی صفوں میں تنہا گھسنا شہادت کی تڑپ اور بہادری ہے، ہلاکت نہیں ہے۔",
                "اسلامی تاریخ میں ایسے کئی واقعات ہیں جہاں مجاہدین نے جان کی پرواہ کیے بغیر حملے کیے۔",
                "اگر نیت اعلائے کلمۃ اللہ ہو تو ایسا عمل اللہ کے ہاں انتہائی پسندیدہ اور اجر کا باعث ہے۔"
              ],
              "english": [
                "Charging alone into enemy ranks is a display of bravery and longing for martyrdom, not self-destruction.",
                "Islamic history is full of incidents where warriors attacked without fear for their own lives.",
                "If the intention is to raise Allah's Word, such an act is highly beloved and rewarded by Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انصارِ مدینہ کی قربانی",
        "english": "The Sacrifice of the Ansar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مالی ایثار کی دعوت",
              "english": "Call for Financial Sacrifice"
            },
            "content": {
              "urdu": [
                "اس آیت کا سیاق و سباق اللہ کی راہ میں مال خرچ کرنے سے متعلق ہے۔",
                "بخل کرنا اور اللہ کے دین کے لیے مال نہ نکالنا معاشرتی ہلاکت کا سبب بنتا ہے۔",
                "انصار نے اپنی تمام تر توانائیاں اور وسائل اسلام کی اشاعت کے لیے وقف کر دیے تھے۔"
              ],
              "english": [
                "The context of this verse is related to spending wealth in the cause of Allah.",
                "Miserliness and refusing to spend for the faith cause societal and spiritual destruction.",
                "The Ansar dedicated all their energies and resources to the propagation of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "دنیا پرستی کی مذمت",
              "english": "Condemnation of Worldliness"
            },
            "content": {
              "urdu": [
                "کھیتی باڑی اور تجارت میں اس طرح غرق ہونا کہ فرائض بھول جائیں، ہلاکت ہے۔",
                "اسلام دنیا کمانے سے نہیں روکتا بلکہ اسے مقصدِ حیات بنانے سے منع کرتا ہے۔",
                "سیدنا ابو ایوب انصاری نے اس آیت کے ذریعے امت کی ترجیحات درست فرمائیں۔"
              ],
              "english": [
                "Becoming so absorbed in farming or trade that obligations are forgotten is destruction.",
                "Islam does not forbid earning wealth but prohibits making it the ultimate life goal.",
                "Abu Ayyub al-Ansari used this verse to correct the priorities of the Ummah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عسکری پہلو",
        "english": "Juristic and Military Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنہا حملے کی شرعی حیثیت",
              "english": "Legality of Charging Alone"
            },
            "content": {
              "urdu": [
                "اگر تنہا حملے سے دشمن پر رعب پڑے یا مسلمانوں کو فائدہ ہو تو یہ جائز ہے۔",
                "فقہاء نے اس حدیث سے استدلال کیا ہے کہ جان جوکھوں میں ڈالنا ہمیشہ ممنوع نہیں ہوتا۔",
                "بڑی مصلحت اور دینی فائدے کے لیے جان کی بازی لگانا عین سعادت ہے۔"
              ],
              "english": [
                "If charging alone intimidates the enemy or benefits Muslims, it is permissible.",
                "Jurists derive from this Hadith that putting one's life at risk is not always prohibited.",
                "Risking one's life for a greater cause or religious benefit is a source of great honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن فہمی میں صحابہ کا مقام",
              "english": "The Status of Companions in Quranic Understanding"
            },
            "content": {
              "urdu": [
                "آیت کا صحیح مطلب وہی ہے جو ان لوگوں نے سمجھا جن پر وہ نازل ہوئی۔",
                "صحابہ کرام کی تشریح کے بغیر قرآن کی مراد تک پہنچنا ناممکن ہے۔",
                "سیدنا ابو ایوب انصاری نے غلط فہمی دور کر کے آیت کا اصل رخ واضح کیا۔"
              ],
              "english": [
                "The correct meaning of a verse is what was understood by those to whom it was revealed.",
                "Reaching the true intent of the Quran is impossible without the Companions' explanations.",
                "Abu Ayyub al-Ansari cleared the misconception and clarified the actual target of the verse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترجیحات کا تعین",
              "english": "Setting Priorities"
            },
            "content": {
              "urdu": [
                "ایک مسلمان کو اپنی زندگی میں دین کو دنیا پر فوقیت دینی چاہیے۔",
                "جب دین خطرے میں ہو تو معاشی مفادات کو قربان کر دینا ہی عقلمندی ہے۔",
                "اللہ کی راہ میں نکلا ہوا ہر قدم انسان کو دائمی زندگی کے قریب کرتا ہے۔"
              ],
              "english": [
                "A Muslim must prioritize religion over worldly matters in his life.",
                "When faith is at risk, sacrificing economic interests is the path of wisdom.",
                "Every step taken in Allah's way brings a person closer to eternal life."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی بیداری",
              "english": "Social Awareness"
            },
            "content": {
              "urdu": [
                "امت کی خاموشی اور سستی ہی اس کی ذلت و ہلاکت کا اصل سبب ہے۔",
                "حق کے لیے آواز اٹھانا اور قربانی کے لیے تیار رہنا زندگی کی علامت ہے۔",
                "ہمیں ہر اس طرزِ زندگی سے بچنا چاہیے جو ہمیں مقصدِ تخلیق سے دور کر دے۔"
              ],
              "english": [
                "The silence and laziness of the Ummah are the primary causes of its humiliation.",
                "Raising one's voice for truth and being ready for sacrifice are signs of life.",
                "We must avoid any lifestyle that distances us from our purpose of creation."
              ]
            }
          }
        ]
      }
    }
  ]
}