{
  "hadithId": 190,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["2", "5"],
    "kitabId": 2,
    "inKitabBab": 5,
    "arabicBook": "كتاب الصلاة",
    "babId": 15
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (751) عن عائشة رضي الله عنها. أما رواية أنس: رواه الترمذي (589) وهي ضعيفة. وقد بين الألباني وغيره ضعف هذه الرواية المشتملة على لفظ 'هلاك'.",
    "urdu": "پہلی روایت سیدہ عائشہ رضی اللہ عنہا سے صحیح ہے اور اسے بخاری (751) نے روایت کیا ہے۔ جبکہ حضرت انس رضی اللہ عنہ کی دوسری روایت (الترمزدی 589) ضعیف ہے۔ علامہ البانی اور دیگر محققین نے 'ہلاکت' والے الفاظ کی اس روایت کو ضعیف قرار دیا ہے۔",
    "english": "The first narration from 'Aishah (may Allah be pleased with her) is Sahih (Authentic), reported by Al-Bukhari (751). As for the narration of Anas: Reported by At-Tirmidhi (589), it is Da'if (Weak). Al-Albani and other scholars have clarified the weakness of this specific narration which contains the word 'destruction/ruin'."
  },
  "importantWords": [
    {
      "arabic": "الالتفات",
      "english": "Turning/Looking around",
      "urdu": "ادھر اُدھر دیکھنا"
    },
    {
      "arabic": "اختلاس",
      "english": "Snatching/Stealing away",
      "urdu": "جھپٹا/چوری"
    },
    {
      "arabic": "الشيطان",
      "english": "Satan/Devil",
      "urdu": "شیطان"
    },
    {
      "arabic": "صلاة العبد",
      "english": "Worshipper's prayer",
      "urdu": "بندے کی نماز"
    },
    {
      "arabic": "هلاك",
      "english": "Destruction/Ruin",
      "urdu": "ہلاکت/تباہی"
    },
    {
      "arabic": "فلا بد",
      "english": "If it must be",
      "urdu": "اگر ضروری ہو"
    },
    {
      "arabic": "التطوع",
      "english": "Voluntary prayers",
      "urdu": "نفلی نماز"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں دائیں بائیں دیکھنے کی ممانعت کو بیان کرتی ہے، اور اسے خشوع میں کمی اور شیطان کی مداخلت قرار دیتی ہے۔ یہ عمل دراصل نماز کے ثواب کو کم کر دیتا ہے، لہٰذا خشوع کو مکمل رکھنے کے لیے ہر قسم کے التفات سے بچنا ضروری ہے۔",
    "english": "This Hadith clarifies the prohibition of looking around during prayer, describing it as a deficiency in concentration (Khushu') and an act of Satan snatching away the reward of the prayer. It is essential to avoid any distraction to maintain the completeness and reward of the prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري، كتاب الأذان، باب الالتفات في الصلاة (751)",
      "english": "Reported by Al-Bukhari, Book of Adhan, Chapter: Turning around during prayer (751)"
    },
    {
      "arabic": "رواه الترمذي، كتاب الصلاة، باب ما جاء في كراهية الالتفات في الصلاة (589) (ضعيف)",
      "english": "Reported by At-Tirmidhi, Book of Prayer, Chapter: Dislike of turning around during prayer (589) (Weak)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Malik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=J3mS_xL7h-8",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خشوع اور شیطان کا وار",
        "english": "Khushu' and Satan's Attack"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں ادھر ادھر دیکھنا",
              "english": "Looking Around During Prayer"
            },
            "content": {
              "urdu": [
                "نماز میں نظر کا دائیں بائیں یا اوپر اٹھانا خشوع کے منافی اور ناپسندیدہ فعل ہے۔",
                "نبی اکرم صلی اللہ علیہ وسلم نے اسے 'شیطان کا جھپٹا' قرار دیا ہے جو نماز کے اجر کو چُرا لیتا ہے۔",
                "اس سے مراد یہ ہے کہ وہ شخص نماز سے اپنا دھیان ہٹا کر شیطان کو موقع دیتا ہے۔"
              ],
              "english": [
                "Lifting the gaze or looking sideways in prayer is against Khushu' and a disliked act.",
                "The Prophet (PBUH) called it a 'snatching away' by Satan, who steals the reward of the prayer.",
                "This implies that the person shifts their focus from the prayer, giving Satan an opportunity."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظر کی چوری کی تعریف",
              "english": "Definition of the Snatching Away"
            },
            "content": {
              "urdu": [
                "شیطان کا جھپٹا (اختلاس) سے مراد یہ ہے کہ وہ بندے کی توجہ اللہ سے ہٹا کر اسے غفلت میں ڈالتا ہے۔",
                "یہ جسمانی طور پر چوری نہیں بلکہ روحانی اور اجر کے لحاظ سے نقصان دہ عمل ہے۔",
                "نمازی کی نظر صرف اس کی سجدہ گاہ پر مرکوز ہونی چاہیے تاکہ یکسوئی برقرار رہے۔"
              ],
              "english": [
                "The snatching away (Ikhtilas) by Satan means he diverts the servant's attention from Allah, leading to negligence.",
                "This is not a physical theft but a spiritually damaging act that reduces the reward.",
                "The worshipper's gaze should be fixed only on their place of prostration to maintain concentration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام اور جواز",
        "english": "Juristic Rulings and Permissibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "التفات کا حکم",
              "english": "The Ruling on Turning Around"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک بغیر عذر سر گھما کر دیکھنا مکروہ تحریمی (شدید ناپسندیدہ) فعل ہے۔",
                "اگر نمازی صرف آنکھوں کے گوشوں سے دیکھے تو نماز تو برقرار رہے گی مگر ثواب کم ہو جائے گا۔",
                "اگر شدید مجبوری ہو جیسے کسی خطرے سے آگاہی، تو سر کو تھوڑا سا گھمانا جائز ہو سکتا ہے۔"
              ],
              "english": [
                "According to jurists, turning the head without a valid reason is 'Makruh Tahrimi' (severely disliked).",
                "If the worshipper only looks with the corners of their eyes, the prayer remains valid but the reward is diminished.",
                "If there is a dire necessity, like warning of danger, slightly turning the head may be permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفلی نماز میں سہولت",
              "english": "Leniency in Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "ترمذی کی روایت کے مطابق نوافل میں ناگزیر صورت میں التفات کی گنجائش زیادہ ہے۔",
                "فرض نماز میں زیادہ سختی ہے کیونکہ اس کی اہمیت اور فضیلت زیادہ ہے۔",
                "تاہم، مکمل خشوع اور توجہ کا اہتمام ہر قسم کی نماز میں مستحب ہے۔"
              ],
              "english": [
                "According to the Tirmidhi narration, there is more allowance for turning around in voluntary prayers in case of necessity.",
                "There is greater strictness in obligatory prayers because of their higher importance and virtue.",
                "However, maintaining complete Khushu' and focus is highly recommended in all types of prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ہلاکت کا مفہوم",
        "english": "The Meaning of Destruction (Halakah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجر کی ہلاکت",
              "english": "Destruction of the Reward"
            },
            "content": {
              "urdu": [
                "حضرت انس کی روایت میں 'ہلاکت' سے مراد نماز کے کامل اجر کا ضائع ہو جانا ہے۔",
                "یہ شرعی ہلاکت یا نماز کا باطل ہو جانا نہیں، بلکہ اجر و ثواب میں کمی ہے۔",
                "شیطان اسی طرح نمازی کو مشغول کر کے اس کا قیمتی وقت اور ثواب برباد کرتا ہے۔"
              ],
              "english": [
                "The 'destruction' (Halakah) in Anas's narration refers to the loss of the complete reward of the prayer.",
                "It does not mean nullification of the prayer itself, but a reduction in its reward.",
                "Satan distracts the worshipper in this manner to waste their precious time and rewards."
              ]
            }
          },
          {
            "title": {
              "urdu": "غفلت سے بچاؤ",
              "english": "Protection from Negligence"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں نماز کو غفلت اور دنیاوی خیالات سے محفوظ رکھنے کی تعلیم دیتی ہے۔",
                "اللہ کے سامنے کھڑے ہونے کا احساس نمازی کو التفات سے روکتا ہے۔",
                "کامل نماز وہی ہے جس میں دل، دماغ اور جسم کی مکمل یکسوئی حاصل ہو۔"
              ],
              "english": [
                "This Hadith teaches us to safeguard our prayers from negligence and worldly thoughts.",
                "The consciousness of standing before Allah prevents the worshipper from turning away.",
                "A perfect prayer is one where the heart, mind, and body achieve complete concentration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Application in Daily Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عادت پر قابو",
              "english": "Controlling the Habit"
            },
            "content": {
              "urdu": [
                "نمازی کو چاہیے کہ وہ جان بوجھ کر ادھر اُدھر دیکھنے کی عادت کو ترک کرے۔",
                "نماز شروع کرنے سے پہلے دنیاوی امور کو ذہن سے نکالنے کی کوشش کرنی چاہیے۔",
                "اس طرح کی چھوٹی عادات سے اجتناب خشوع کی راہ ہموار کرتا ہے۔"
              ],
              "english": [
                "The worshipper must consciously abandon the habit of deliberately looking around.",
                "One should try to clear their mind of worldly matters before starting the prayer.",
                "Avoiding such minor habits paves the way for deeper concentration (Khushu')."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان کے فتنوں سے حفاظت",
              "english": "Protection from Satan's Traps"
            },
            "content": {
              "urdu": [
                "نماز میں التفات شیطان کے فتنوں میں سے ایک ہے جس سے ہوشیار رہنا ضروری ہے۔",
                "یہ حدیث ہمیں نماز کی ہر رکعت میں اللہ کی طرف مکمل رجوع کی تلقین کرتی ہے۔",
                "نماز کی حفاظت، دراصل اپنے ثواب اور نجات کی حفاظت ہے۔"
              ],
              "english": [
                "Turning around in prayer is one of Satan's tricks, which must be guarded against.",
                "This Hadith encourages us to turn fully toward Allah in every unit of prayer.",
                "Protecting one's prayer is, in essence, protecting one's reward and salvation."
              ]
            }
          }
        ]
      }
    }
  ]
}
