{
  "hadithId": 229,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["Sunan Abi Dawud 871", "Jami` at-Tirmidhi 262"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  
  "takhreej": {
    "arabic": "صحيح .‏ رواه أبو داود (871)‏ ، والنسائي (3/225-226)‏ ، والترمذي (262)‏ ، وابن ماجه (1351)‏ ، وأحمد (5/382)‏. وأصل الحديث في صحيح مسلم (772) بلفظ أطول يذكر فيه وقوفه وتفاعله مع آيات التسبيح والسؤال والتعوذ، وهو أصح الألفاظ.",
    "urdu": "صحیح روایت۔ اسے ابو داؤد (871)، نسائی (225/3)، ترمذی (262)، ابن ماجہ (1351)، اور احمد (382/5) نے روایت کیا ہے۔ اس حدیث کا اصل مفہوم صحیح مسلم (772) میں بھی تفصیلی الفاظ کے ساتھ موجود ہے جس میں آپ ﷺ کا اللہ کی رحمت مانگنے اور عذاب سے پناہ چاہنے کا ذکر ہے۔",
    "english": "Authentic (Sahih). Reported by Abu Dawud (871), An-Nasa'i (3/225-226), At-Tirmidhi (262), Ibn Majah (1351), and Ahmad (5/382). The core narration is also found in Sahih Muslim (772) with a longer text detailing his interaction with the verses of glorification (Tasbih), asking (Suaal), and seeking refuge (Ta'awwudh)."
  },
  "importantWords": [
    {
      "arabic": "آيَةُ رَحْمَةٍ",
      "english": "Verse of Mercy",
      "urdu": "رحمت کی آیت"
    },
    {
      "arabic": "يَسْأَلُ",
      "english": "He asks (for mercy)",
      "urdu": "آپ طلب کرتے"
    },
    {
      "arabic": "آيَةُ عَذَابٍ",
      "english": "Verse of Punishment",
      "urdu": "عذاب کی آیت"
    },
    {
      "arabic": "تَعَوَّذَ",
      "english": "He sought refuge",
      "urdu": "آپ پناہ مانگتے"
    },
    {
      "arabic": "وَقَفَ",
      "english": "He paused/stopped",
      "urdu": "آپ ٹھہر جاتے"
    },
    {
      "arabic": "صَلَّيْتُ",
      "english": "I prayed",
      "urdu": "میں نے نماز پڑھی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی کریم صلی اللہ علیہ وسلم کے نماز میں قرأت کے دوران قرآن کے ساتھ روحانی تعامل کو بیان کرتی ہے۔ آپ ﷺ رحمت کی آیات پر اللہ سے رحمت طلب کرتے اور عذاب کی آیات پر عذاب سے پناہ مانگتے تھے، جو اس بات کی دلیل ہے کہ نماز میں غور و فکر اور خشوع ضروری ہے۔",
    "english": "This Hadith describes the Prophet's profound spiritual interaction with the Qur'an during prayer recitation. He would pause at verses of Mercy to supplicate for it and pause at verses of Punishment to seek refuge from it, proving the necessity of deep reflection and devotion (Khushu') in prayer."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (871)",
      "english": "Reported by Abu Dawud (871)"
    },
    {
      "arabic": "رواه الترمذي (262)",
      "english": "Reported by At-Tirmidhi (262)"
    },
    {
      "arabic": "صحيح مسلم (772)",
      "english": "Sahih Muslim (772)"
    },
    {
      "arabic": "رواه النسائي (3/225-226)",
      "english": "Reported by An-Nasa'i (3/225-226)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "حذيفة بن اليمان",
        "english": "Hudhaifah ibn Al-Yaman"
      },
      "slug": "hudhaifah-ibn-al-yaman"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj7n0PZ3xXg",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں خشوع کی روح",
        "english": "The Spirit of Khushu' in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آیات کے ساتھ تعامل",
              "english": "Interaction with the Verses"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا نماز میں آیاتِ قرآن کے مفہوم کے مطابق عمل کرنا، خشوع کی بہترین مثال ہے۔",
                "یہ صرف زبانی تلاوت نہیں تھی، بلکہ قرآن کے معانی کو دل میں اتار کر اسے ایک عمل بنانا تھا۔",
                "مسلمان کو چاہیے کہ وہ نماز میں قرآن پر غور و فکر (تدبر) کرے اور اسے اپنی دعا کا حصہ بنائے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) practice of reacting according to the meaning of the verses is the pinnacle of Khushu' (devotion).",
                "This was not mere verbal recitation but internalizing the meaning of the Qur'an and translating it into action.",
                "A Muslim should reflect upon the Qur'an during prayer and incorporate its themes into their supplications."
              ]
            }
          },
          {
            "title": {
              "urdu": "رحمت و عذاب سے دعا",
              "english": "Supplication at Mercy and Punishment"
            },
            "content": {
              "urdu": [
                "آیتِ رحمت کے وقت رحمت طلب کرنا اور عذاب پر پناہ مانگنا، اللہ تعالیٰ سے تعلق کی مضبوطی ظاہر کرتا ہے۔",
                "یہ اس بات کا ثبوت ہے کہ نماز میں بندہ براہ راست اپنے رب سے مخاطب ہوتا ہے۔",
                "اس طرح کی دعا نماز کو صرف ایک رسمی عمل نہیں، بلکہ ایک زندہ عبادت بنا دیتی ہے۔"
              ],
              "english": [
                "Seeking mercy at a verse of mercy and refuge at a verse of punishment demonstrates a strong connection with Allah.",
                "It proves that in prayer, a servant is directly addressing their Lord and communicating with Him.",
                "This type of supplication transforms the prayer from a mere ritual into a lively and responsive act of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی حکم",
        "english": "Juristic and Practical Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفل نماز میں جواز",
              "english": "Permissibility in Nafl (Voluntary) Prayer"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک یہ عمل نماز کے دوران، بالخصوص نفل نماز میں، مستحب ہے۔",
                "یہ حدیث تہجد کی لمبی نماز کے بارے میں ہے، جہاں یہ عمل کرنا آسان ہوتا ہے۔",
                "امام شافعی کے نزدیک فرض نماز میں بھی یہ عمل جائز ہے، جب تک رکوع میں تاخیر نہ ہو۔"
              ],
              "english": [
                "According to the majority of jurists, this practice is recommended during prayer, especially in voluntary (Nafl) prayers.",
                "This Hadith describes the lengthy Tahajjud prayer, where such an action is easily implemented.",
                "In the Shafi'i school, this is permissible even in obligatory prayers, provided it does not unduly delay the bowing (Ruku')."
              ]
            }
          },
          {
            "title": {
              "urdu": "جماعت اور تخفیف",
              "english": "Congregation and Brevity"
            },
            "content": {
              "urdu": [
                "امام کو چاہیے کہ وہ جماعت کی نماز میں تخفیف کرے اور لوگوں پر مشقت نہ ڈالے۔",
                "اگر امام لمبی قرأت کرتا ہے تو وہ یہ عمل آہستہ اور مختصر دعا کے ساتھ کر سکتا ہے۔",
                "مالکی اور حنفی فقہاء فرض نماز میں اس عمل کو ترک کرنے کی رائے دیتے ہیں تاکہ مقتدیوں کو شبہ نہ ہو۔"
              ],
              "english": [
                "The Imam should keep the congregational prayer brief and not impose hardship upon the people.",
                "If the Imam recites a long portion, he may perform this act quickly with a brief supplication.",
                "Maliki and Hanafi jurists advise against this practice in obligatory prayers to avoid confusion for the followers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی نتائج",
        "english": "Educational Outcomes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن سے جذباتی تعلق",
              "english": "Emotional Connection with the Qur'an"
            },
            "content": {
              "urdu": [
                "حدیث اس بات کی تعلیم دیتی ہے کہ قرآن صرف پڑھنے کی کتاب نہیں، بلکہ عمل اور جذباتی تعلق کا ذریعہ ہے۔",
                "آیات پر غور کرنے سے دل میں خوف اور امید (خوف و رجاء) پیدا ہوتی ہے۔",
                "یہ عمل مسلمان کو اپنی روزمرہ کی زندگی میں تقویٰ اختیار کرنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The Hadith teaches that the Qur'an is not just a book for reading, but a source for action and emotional connection.",
                "Reflecting on the verses generates both fear and hope (Khawf wa Raja') in the heart.",
                "This practice motivates the Muslim to adopt piety (Taqwa) in their daily lives."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا کمال بندگی",
              "english": "The Prophet's Perfect Servitude"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کی نمازیں آپ کے کمال بندگی اور اللہ سے گہرے تعلق کا اظہار ہیں۔",
                "آپ ﷺ کا یہ عمل امت کے لیے ایک اعلیٰ نمونہ ہے کہ نماز کو کیسے مکمل طور پر ادا کیا جائے۔",
                "آپ ﷺ کی اتباع کر کے ہی ہم اپنی عبادات میں اخلاص اور کمال حاصل کر سکتے ہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) prayers were an expression of his perfect servitude and deep connection with Allah.",
                "His action sets a high standard for the Ummah on how to perform the prayer completely and meaningfully.",
                "Only by following his example can we achieve sincerity and perfection in our acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تدبر کی اہمیت",
        "english": "The Importance of Reflection (Tadabbur)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن کا مقصد",
              "english": "The Purpose of the Qur'an"
            },
            "content": {
              "urdu": [
                "قرآن کا بنیادی مقصد لوگوں کو تدبر کی طرف لانا اور ان کی زندگی کو بدلنا ہے۔",
                "نبی ﷺ کے عمل سے یہ بات واضح ہوتی ہے کہ تدبر نماز کے اجزاء میں سے ہے۔",
                "جو شخص قرآن پر تدبر کرتا ہے، اس کے دل میں اللہ کا خوف بڑھ جاتا ہے۔"
              ],
              "english": [
                "The primary purpose of the Qur'an is to lead people to reflection (Tadabbur) and transform their lives.",
                "The Prophet's (ﷺ) action clarifies that reflection is an inherent part of the prayer.",
                "A person who reflects upon the Qur'an will naturally find their fear of Allah increasing."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفل اور فرض کا فرق",
              "english": "Difference between Nafl and Obligatory"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ عمل نفل نماز میں زیادہ آسانی سے ہوتا ہے، لیکن فرض نماز میں بھی دل سے یہی کیفیت ہونی چاہیے۔",
                "نفل نماز میں کھلے عام دعا کی جاتی ہے، جبکہ فرض میں دل میں دعا کی جا سکتی ہے۔",
                "نماز کا مقصد دونوں صورتوں میں ایک ہی ہے: دل کی حضوری اور اللہ سے مناجات۔"
              ],
              "english": [
                "Although this act is easier in voluntary prayers, the same spiritual state should be maintained in obligatory prayers.",
                "In Nafl prayer, open supplication is done, whereas in Fard (obligatory), it can be done silently in the heart.",
                "The goal of prayer remains the same in both cases: presence of the heart and intimate conversation (Munajah) with Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
