{
  "hadithId": 113,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["1:113"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب الطهارة",
    "babId": 9
  },

  "takhreej": {
    "arabic": "صحيح.  رواه أبو داود (338) ، والنسائي (113) .  ",
    "urdu": "صحیح (درست) روایت۔ اسے ابو داؤد (338) اور نسائی (113) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (338) and An-Nasa'i (113)."
  },
  "importantWords": [
    {
      "arabic": "سفر",
      "english": "Journey/Travel",
      "urdu": "سفر"
    },
    {
      "arabic": "فَتَيَمَّمَا",
      "english": "They performed Tayammum",
      "urdu": "انہوں نے تیمم کیا"
    },
    {
      "arabic": "صَعِيدًا طَيِّبًا",
      "english": "Clean earth/dust",
      "urdu": "پاک مٹی"
    },
    {
      "arabic": "وَجَدَا اَلْمَاءَ",
      "english": "They found water",
      "urdu": "انہوں نے پانی پایا"
    },
    {
      "arabic": "أَعَادَ",
      "english": "Repeated/Reoffered",
      "urdu": "دوبارہ کی"
    },
    {
      "arabic": "أَجْزَأَتْكَ",
      "english": "Was sufficient for you",
      "urdu": "تمہارے لیے کافی ہو گئی"
    },
    {
      "arabic": "اَلسُّنَّةَ",
      "english": "The Sunnah/Prophetic Way",
      "urdu": "سنت"
    },
    {
      "arabic": "اَلْأَجْرُ مَرَّتَيْنِ",
      "english": "Double the reward",
      "urdu": "دو گنا اجر"
    }
  ],
  "summary": {
    "urdu": "دو مسافروں نے پانی نہ ملنے پر تیمم سے نماز ادا کی۔ بعد میں پانی ملنے پر ایک نے نماز دہرائی اور دوسرے نے نہیں۔ نبی ﷺ نے نہ دہرانے والے کو سنت پر عمل کرنے والا قرار دیا اور دہرانے والے کو دوہرا اجر کی بشارت دی۔",
    "english": "Two travelers performed Tayammum (dry ablution) and prayed due to lack of water. Upon finding water within the time, one repeated the prayer while the other did not. The Prophet ﷺ declared the one who did not repeat it as having followed the Sunnah, and promised the one who repeated it a double reward."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (338)",
      "english": "Reported by Abu Dawud (338)"
    },
    {
      "arabic": "رواه النسائي (113)",
      "english": "Reported by An-Nasa'i (113)"
    }
  ],
  "narrators": [
    {
      "id": 11301,
      "name": {
        "arabic": "أَبُو سَعِيدٍ اَلْخُدْرِيِّ",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تیمم اور نماز کی صحت",
        "english": "Validity of Tayammum and Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیمم کی شرعی حیثیت",
              "english": "Legal Status of Tayammum"
            },
            "content": {
              "urdu": [
                "جب پانی دستیاب نہ ہو، تو تیمم شرعی طور پر وضو کا متبادل ہے۔",
                "تیمم کے بعد ادا کی گئی نماز وقت پر ادا شدہ سمجھی جاتی ہے۔",
                "شرعی عذر ختم ہونے کے باوجود، پہلی نماز درست رہتی ہے اور اسے دہرانے کی ضرورت نہیں۔"
              ],
              "english": [
                "When water is unavailable, Tayammum is a legally valid substitute for Wudu.",
                "Prayer performed after Tayammum is considered validly offered on time.",
                "The initial prayer remains valid, and there is no need to repeat it, even if the excuse is removed."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کے مطابق عمل",
              "english": "Acting According to the Sunnah"
            },
            "content": {
              "urdu": [
                "جس شخص نے نماز نہیں دہرائی، نبی ﷺ نے اسے سنت پر عمل کرنے والا قرار دیا۔",
                "یہ اس بات کا ثبوت ہے کہ تیمم سے پڑھی گئی نماز اپنے وقت میں پوری ہو جاتی ہے۔",
                "اس سے آسانی اور سادگی کا اسلامی اصول واضح ہوتا ہے۔"
              ],
              "english": [
                "The Prophet ﷺ confirmed that the person who did not repeat the prayer acted according to the Sunnah.",
                "This proves that the prayer offered with Tayammum is complete and sufficient during its time.",
                "It highlights the Islamic principle of ease and simplicity in religious practice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر کی حکمت",
        "english": "Wisdom of the Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دوبارہ نماز کا اجر",
              "english": "Reward for Repeating the Prayer"
            },
            "content": {
              "urdu": [
                "جس شخص نے نماز دہرائی، اسے نبی ﷺ نے دوہرا اجر ملنے کی خوشخبری دی۔",
                "یہ اس کی نیت کی اخلاص اور احتیاط کی بنا پر تھا۔",
                "پہلا اجر فرض ادا کرنے کا اور دوسرا احتیاطی عمل (نفل) کرنے کا ہے۔"
              ],
              "english": [
                "The person who repeated the prayer was given the good news of double reward by the Prophet ﷺ.",
                "This was due to the sincerity of his intention and his desire for extra caution.",
                "The first reward is for fulfilling the obligatory duty, and the second is for the precautionary/supererogatory act."
              ]
            }
          },
          {
            "title": {
              "urdu": "حکمت اور نرمی",
              "english": "Wisdom and Clemency"
            },
            "content": {
              "urdu": [
                "حدیث میں دو مختلف جائز آراء پر اجر کی بشارت دی گئی ہے۔",
                "اس میں اجتہاد کرنے والے شخص کے لیے اللہ کی طرف سے نرمی اور حوصلہ افزائی ہے۔",
                "یہ شریعت میں وسعت اور عمل کی مختلف صورتوں میں خیر کی نشاندہی کرتا ہے۔"
              ],
              "english": [
                "The Hadith gives the promise of reward for two different valid approaches.",
                "It shows clemency and encouragement from Allah for the person who made an effort (Ijtihad).",
                "This indicates the breadth of Islamic law and goodness in various forms of action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی استنباط",
        "english": "Juristic Derivations"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی ملنے کے بعد حکم",
              "english": "Ruling After Finding Water"
            },
            "content": {
              "urdu": [
                "اگر وقت کے اندر پانی مل جائے تو تیمم سے پڑھی گئی نماز کو دہرانا فرض نہیں۔",
                "فقہاء کا اجماع ہے کہ بغیر دہرائے نماز صحیح ہے۔",
                "دہرانا صرف ایک اضافی احتیاطی یا نفلی عمل کے طور پر جائز ہے۔"
              ],
              "english": [
                "If water is found within the prayer time, repeating the prayer performed with Tayammum is not obligatory.",
                "Jurists agree that the prayer without repetition is valid.",
                "Repetition is only permissible as an extra precautionary or supererogatory act."
              ]
            }
          },
          {
            "title": {
              "urdu": "حالتِ عذر کا اعتبار",
              "english": "Considering the State of Excuse"
            },
            "content": {
              "urdu": [
                "شرعی عذر (جیسے پانی کی عدم دستیابی) کی بنیاد پر کیا گیا عمل مکمل طور پر قابل قبول ہے۔",
                "حکم کا دار و مدار عمل کے وقت کی شرائط پر ہوتا ہے۔",
                "اگر شرائط پوری ہوں تو بعد میں عذر ختم ہونے سے عمل باطل نہیں ہوتا۔"
              ],
              "english": [
                "An act based on a legal excuse (like unavailability of water) is completely acceptable.",
                "The ruling is based on the conditions present at the time the act was performed.",
                "If the conditions are met, the act is not nullified by the removal of the excuse later on."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و اخلاقی سبق",
        "english": "Practical and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسانی اور میانہ روی",
              "english": "Ease and Moderation"
            },
            "content": {
              "urdu": [
                "اسلام میں عبادت کی ادائیگی میں آسانی اور میانہ روی کا حکم ہے۔",
                "حالتِ عذر میں دی گئی رخصت پر عمل سنت کے عین مطابق ہے۔",
                "تکلیف کے بغیر احتیاط میں غلو کرنا سنت کے خلاف ہے۔"
              ],
              "english": [
                "Islam commands ease and moderation in performing acts of worship.",
                "Acting upon the concession granted during an excuse is precisely according to the Sunnah.",
                "Excessive caution without distress is contrary to the spirit of the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتہادی اختلاف میں حسنِ سلوک",
              "english": "Good Conduct in Difference of Ijtihad"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے دونوں صحابہ کے عمل کو تسلیم کیا اور دونوں کو اجر کی بشارت دی۔",
                "یہ سکھاتا ہے کہ درست اجتہادی اختلاف میں بھی نرمی اور عزت کا رویہ اختیار کیا جائے۔",
                "اگرچہ ایک سنت پر زیادہ مضبوط عمل تھا، دوسرے کی نیت کی قدر کی گئی۔"
              ],
              "english": [
                "The Prophet ﷺ acknowledged the actions of both Companions and promised reward to both.",
                "This teaches us to adopt a gentle and respectful attitude in matters of valid juristic difference.",
                "Although one followed the Sunnah more strongly, the other's intention was valued."
              ]
            }
          }
        ]
      }
    }
  ]
}
