{
  "hadithId": 1313,
  "hadithNo": 37,
  "hadithReferences": {
    "sunnah.com": ["bukhari:2457", "muslim:2668"],
    "kitabId": 16,
    "inKitabBab": 4,
    "arabicBook": "كتاب الجامع",
    "babId": 105
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (2668)، والبخاري (2457)، والترمذي (2976)، والنسائي (5420).",
    "urdu": "یہ حدیث صحیح ہے اور اسے امام بخاری اور امام مسلم دونوں نے روایت کیا ہے۔ بخاری میں اس کا نمبر 2457 ہے، اس لیے اسے متفق علیہ کہنا زیادہ موزوں ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (2668) and Al-Bukhari (2457). It is an 'Agreed Upon' Hadith found in both major collections."
  },
  "importantWords": [
    {
      "arabic": "أَبْغَضُ",
      "english": "Most detestable / hated",
      "urdu": "سب سے زیادہ ناپسندیدہ"
    },
    {
      "arabic": "الرِّجَالِ",
      "english": "Men / Persons",
      "urdu": "آدمی / مرد / لوگ"
    },
    {
      "arabic": "الأَلَدُّ",
      "english": "Highly contentious / stuborn",
      "urdu": "سخت جھگڑالو / ہٹ دھرم"
    },
    {
      "arabic": "الْخَصِمُ",
      "english": "One who argues / disputes",
      "urdu": "جھگڑا کرنے والا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ان لوگوں کی مذمت کرتی ہے جو بات بات پر جھگڑا کرتے ہیں، بحث و تکرار میں حد سے گزر جاتے ہیں اور صلح کے بجائے مخالفت کو پسند کرتے ہیں۔",
    "english": "This Hadith condemns those who are excessively argumentative and stubborn in disputes, as such traits are highly disliked by Allah."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2457)",
      "english": "Sahih al-Bukhari (2457)"
    },
    {
      "arabic": "صحيح مسلم (2668)",
      "english": "Sahih Muslim (2668)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aishah bint Abi Bakr"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_hYf40",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جھگڑالو پن کی مذمت",
        "english": "Condemnation of Quarrelsomeness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الالد الخصم کا مفہوم",
              "english": "Meaning of Al-Aladd al-Khasim"
            },
            "content": {
              "urdu": [
                "اس سے مراد وہ شخص ہے جو ناحق بات پر اڑ جائے اور جھگڑے کو طول دے۔",
                "ایسا شخص جو دلیل کے بجائے بدزبانی اور ہٹ دھرمی سے کام لیتا ہے۔",
                "وہ دوسروں کو نیچا دکھانے کے لیے ہر حد پار کر دیتا ہے۔"
              ],
              "english": [
                "It refers to a person who stubbornly sticks to falsehood and prolongs disputes.",
                "One who uses foul language and stubbornness instead of sound logic.",
                "He crosses all limits just to humiliate others in an argument."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی ناپسندیدگی",
              "english": "Allah's Displeasure"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ سلامتی اور امن کو پسند فرماتا ہے، اس لیے جھگڑالو پن اسے سخت ناپسند ہے۔",
                "ایسا رویہ معاشرے میں فساد اور دلوں میں نفرت کا باعث بنتا ہے۔",
                "جو شخص لوگوں سے جھگڑتا ہے، وہ درحقیقت خلقِ خدا کو تکلیف دیتا ہے۔"
              ],
              "english": [
                "Allah loves peace and harmony, so excessive quarreling is hateful to Him.",
                "Such behavior leads to social corruption and hatred in hearts.",
                "One who constantly disputes with people is actually causing distress to Allah's creation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بحث و تکرار کے نقصانات",
        "english": "Harms of Excessive Arguing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روحانی اثرات",
              "english": "Spiritual Impacts"
            },
            "content": {
              "urdu": [
                "زیادہ بحث کرنے سے دل مردہ ہو جاتا ہے اور خشیتِ الٰہی ختم ہو جاتی ہے۔",
                "جھگڑالو شخص اکثر جھوٹ اور غیبت جیسے گناہوں میں مبتلا ہو جاتا ہے۔",
                "یہ صفت انسان کو اللہ کے ذکر سے غافل کر دیتی ہے۔"
              ],
              "english": [
                "Frequent arguing deadens the heart and removes the fear of Allah.",
                "A quarrelsome person often falls into sins like lying and backbiting.",
                "This trait makes a person heedless of the remembrance of Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی بگاڑ",
              "english": "Social Decay"
            },
            "content": {
              "urdu": [
                "جھگڑوں سے گھروں اور خاندانوں کے سکون برباد ہو جاتے ہیں۔",
                "یہ صفت بھائی چارے کی بنیادوں کو ہلا کر رکھ دیتی ہے۔",
                "لوگ جھگڑالو شخص سے ملنا جلنا چھوڑ دیتے ہیں اور وہ تنہا رہ جاتا ہے۔"
              ],
              "english": [
                "Quarrels ruin the peace of homes and families.",
                "This trait shakes the foundations of brotherhood.",
                "People eventually avoid a quarrelsome person, leaving him isolated."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صلح اور نرمی کی اہمیت",
        "english": "Importance of Peace and Gentleness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حق چھوڑنے کی فضیلت",
              "english": "Virtue of Giving up Argument"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے فرمایا کہ جو حق پر ہونے کے باوجود جھگڑا چھوڑ دے، اس کے لیے جنت میں گھر ہے۔",
                "صلح کرنا اور دوسروں کو معاف کرنا مومن کی شان ہے۔",
                "نرم مزاجی اللہ کی بہت بڑی نعمت ہے جو انسان کو ہردلعزیز بناتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) promised a house in Paradise for one who leaves an argument even if they are right.",
                "Reconciling and forgiving others is the dignity of a believer.",
                "Gentleness is a great blessing from Allah that makes a person beloved to all."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گفتگو میں اعتدال",
              "english": "Moderation in Speech"
            },
            "content": {
              "urdu": [
                "اختلافِ رائے کو دشمنی میں نہ بدلنے دیں بلکہ شائستگی سے اپنی بات کہیں۔",
                "جب محسوس ہو کہ بات جھگڑے کی طرف جا رہی ہے تو خاموشی اختیار کریں۔",
                "دوسروں کی غلطیوں کو درگزر کرنا سیکھیں تاکہ اللہ کے پسندیدہ بندے بن سکیں۔"
              ],
              "english": [
                "Do not let a difference of opinion turn into enmity; state your point politely.",
                "When you sense a conversation turning into a quarrel, adopt silence.",
                "Learn to overlook others' mistakes to become a beloved servant of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}