{
  "hadithId": 943,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1084"],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },
  
  "takhreej": {
    "arabic": "ضعيف . رواه البيهقي في السنن الكبرى (7/411-412) من طريق مجالد بن سعيد عن الشعبي عن عمر. ومجالد بن سعيد ضعفه غير واحد من الأئمة كأحمد ويحيى بن معين، وقال الحافظ ابن حجر: ليس بالقوي.",
    "urdu": "یہ روایت سندی طور پر ضعیف ہے۔ اسے امام بیہقی نے (7/411) میں روایت کیا ہے۔ اس کی سند میں مجالد بن سعید راوی ہے جسے امام احمد اور یحییٰ بن معین نے ضعیف قرار دیا ہے۔ تاہم اس کا معنی فقہی طور پر معتبر ہے کہ نسب کے معاملے میں ایک بار اقرار کے بعد مکرنا جائز نہیں۔",
    "english": "Weak. Reported by Al-Bayhaqi in As-Sunan al-Kubra (7/411-412). The chain contains Mujalid bin Sa'id, who was graded weak by several scholars including Ahmad and Yahya bin Ma'in. Al-Hafiz Ibn Hajar described him as not strong."
  },
  "importantWords": [
    {
      "arabic": "أَقَرَّ",
      "english": "Acknowledged / Confessed",
      "urdu": "اقرار کیا / مانا"
    },
    {
      "arabic": "وَلَدٍ",
      "english": "Child",
      "urdu": "بچہ / اولاد"
    },
    {
      "arabic": "طَرْفَةَ عَيْنٍ",
      "english": "Blink of an eye",
      "urdu": "پلک جھپکنے کی دیر / ایک لمحہ"
    },
    {
      "arabic": "يَنْفِيَهُ",
      "english": "Deny / Disown him",
      "urdu": "اس کی نفی کرے / انکار کرے"
    },
    {
      "arabic": "مَوْقُوفٌ",
      "english": "Mauquf (Companion's saying)",
      "urdu": "موقوف (صحابی کا قول)"
    }
  ],
  "summary": {
    "urdu": "نسب کے معاملے میں اسلام نہایت سخت ہے؛ اگر باپ ایک بار بچے کو اپنا بیٹا تسلیم کر لے، تو بعد میں کسی شک کی بنیاد پر اس سے انکار نہیں کر سکتا۔",
    "english": "In matters of lineage, Islam is very strict; once a father acknowledges a child as his own, he loses the legal right to later disown him based on suspicion."
  },
  "references": [
    {
      "arabic": "السنن الكبرى للبيهقي (7/411)",
      "english": "As-Sunan al-Kubra by Al-Bayhaqi (7/411)"
    },
    {
      "arabic": "إرواء الغليل للالباني (2116)",
      "english": "Irwa al-Ghalil by Al-Albani (2116)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-Yg4Dk-gE",
  "grade": {
    "arabic": "ضعيف سندا، صحيح معنى",
    "english": "Weak Chain, Correct Meaning"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نسب کے تحفظ کا اسلامی اصول",
        "english": "Islamic Principle of Protecting Lineage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اقرارِ نسب کی حتمیت",
              "english": "Finality of Acknowledging Lineage"
            },
            "content": {
              "urdu": [
                "نسب کا معاملہ انسانی حقوق میں سب سے زیادہ حساس اور اہم ترین شعبہ ہے۔",
                "اگر باپ خوشی سے بچے کی پیدائش پر اسے اپنا کہے، تو یہ قانونی اقرار ہے۔",
                "ایک بار زبان سے اقرار کرنے کے بعد رجوع کرنا بچے کی تذلیل اور ظلم ہے۔"
              ],
              "english": [
                "Matters of lineage are among the most sensitive and important human rights.",
                "If a father willingly calls a newborn his own, it constitutes a legal confession.",
                "Retracting an acknowledgment after making it is considered oppressive to the child."
              ]
            }
          },
          {
            "title": {
              "urdu": "بچے کے حقوق کا تحفظ",
              "english": "Protecting the Child's Rights"
            },
            "content": {
              "urdu": [
                "شریعت بچے کو معاشرتی بے عزتی اور بے نام زندگی سے بچانا چاہتی ہے۔",
                "کسی شخص کو یہ اجازت نہیں کہ وہ جب چاہے اپنے بچے کو لاوارث کر دے۔",
                "نسب ثابت ہو جانے سے بچے کو وراثت اور نفقہ جیسے حقوق حاصل ہوتے ہیں۔"
              ],
              "english": [
                "Shariah aims to protect children from social disgrace and namelessness.",
                "No person is permitted to make their child illegitimate at their own whim.",
                "Establishing lineage grants the child rights like inheritance and maintenance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "لعان اور نفی نسب",
        "english": "Li'an and Denial of Lineage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نفی کا صحیح وقت",
              "english": "The Correct Time for Denial"
            },
            "content": {
              "urdu": [
                "اگر کسی کو نسب میں شک ہو تو اسے پیدائش کے فوراً بعد خاموش نہیں رہنا چاہیے۔",
                "خاموشی اور بچے کو پیار کرنا یا مبارکباد وصول کرنا اقرار کے مترادف ہے۔",
                "جو شخص شروع میں چپ رہا، قانون اسے بعد میں انکار کا موقع نہیں دیتا۔"
              ],
              "english": [
                "If one has doubts about lineage, they must not remain silent after birth.",
                "Remaining silent and accepting congratulations is legally equivalent to confession.",
                "One who stays quiet initially is denied the chance to deny it by the law later."
              ]
            }
          },
          {
            "title": {
              "urdu": "لعان کی قانونی رکاوٹ",
              "english": "Legal Barrier of Li'an"
            },
            "content": {
              "urdu": [
                "اقرار کے بعد اگر شوہر لعان کرنا چاہے تو بعض فقہاء کے نزدیک یہ نہیں ہو سکتا۔",
                "سیدنا عمر کا یہ فیصلہ جھوٹے الزامات اور خاندانی جھگڑوں کا سدِ باب کرتا ہے۔",
                "اسلامی قانون معاشرے میں استحکام لانے کے لیے ظاہری اقرار کو بنیاد بناتا ہے۔"
              ],
              "english": [
                "Some jurists hold that Li'an cannot occur after an explicit acknowledgment.",
                "Umar's (RA) ruling prevents false accusations and chronic family disputes.",
                "Islamic law uses outward confession as a basis to bring social stability."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا عمر کی فقہی بصیرت",
        "english": "Juristic Insight of 'Umar (RA)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشرتی نظم کا قیام",
              "english": "Establishing Social Order"
            },
            "content": {
              "urdu": [
                "خلیفہ دوم نے خاندانوں کو انتشار سے بچانے کے لیے یہ سخت ضابطہ اپنایا۔",
                "نسب میں شک پیدا ہونا پورے خاندان کی ساکھ کو تباہ کر سکتا ہے۔",
                "آپ کا یہ قول 'موقوف' ہونے کے باوجود امت میں ایک رہنما اصول مانا جاتا ہے۔"
              ],
              "english": [
                "The second Caliph adopted this strict rule to save families from chaos.",
                "Doubts regarding lineage can destroy the reputation of the entire family.",
                "Despite being a 'Mauquf' saying, it is a guiding principle for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل اور احتیاط",
              "english": "Justice and Caution"
            },
            "content": {
              "urdu": [
                "انصاف کا تقاضا ہے کہ ایک بار دی گئی قانونی شہادت کو واپس نہ لیا جائے۔",
                "مردوں کو چاہیے کہ وہ اپنی زبان کا استعمال نہایت ذمہ داری سے کریں۔",
                "پلک جھپکنے جتنا اقرار بھی اللہ کے ہاں اور قانون میں گواہی بن جاتا ہے۔"
              ],
              "english": [
                "Justice requires that legal testimonies, once given, should not be retracted.",
                "Men are required to use their speech with extreme responsibility.",
                "Acknowledgment even for a blink of an eye is a testimony before Allah and law."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی پہلو",
        "english": "Moral and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بدگمانی سے بچاؤ",
              "english": "Avoiding Suspicion"
            },
            "content": {
              "urdu": [
                "اسلام میاں بیوی کو ایک دوسرے کے بارے میں حسنِ ظن رکھنے کی تعلیم دیتا ہے۔",
                "بے بنیاد شکوک کی بنیاد پر اپنی ہی اولاد کا انکار کرنا اخلاقی پستی ہے۔",
                "یہ حدیث مرد کو اپنی بیوی پر بھروسہ کرنے اور خاندان جوڑنے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "Islam teaches spouses to maintain good expectations of one another.",
                "Denying one's own child based on groundless suspicion is moral degradation.",
                "This narration encourages men to trust their wives and keep families united."
              ]
            }
          },
          {
            "title": {
              "urdu": "قانونِ فطرت کی پاسداری",
              "english": "Adhering to Natural Law"
            },
            "content": {
              "urdu": [
                "پیدائش کا عمل اور اس کا اعتراف ایک فطری سچائی ہے جسے جھٹلایا نہیں جا سکتا۔",
                "مومن کی زبان اس کی شخصیت کی عکاس ہوتی ہے، اسے قول کا پکا ہونا چاہیے۔",
                "شریعت کے احکامات انسانی غیرت اور سچائی کو برقرار رکھنے کے لیے ہیں۔"
              ],
              "english": [
                "The process of birth and its acknowledgment is a natural truth that cannot be denied.",
                "A believer's tongue reflects their character; they must be true to their word.",
                "Shariah rulings are meant to uphold human honor and truthfulness."
              ]
            }
          }
        ]
      }
    }
  ]
}