{
  "hadithId": 760,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/760"],
    "kitabId": 7,
    "inKitabBab": 13,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 54
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2257)، ومسلم (1608). رواه الطحاوي في شرح المعاني (4/126)، والبيهقي في السنن الكبرى (6/104).",
    "urdu": "صحیح۔ اسے امام بخاری (2257) اور مسلم (1608) نے روایت کیا ہے۔ امام طحاوی نے شرح معانی الآثار اور بیہقی نے السنن الکبریٰ میں اسے بیان کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2257) and Muslim (1608). Also reported by At-Tahawi in Sharh Ma'ani al-Athar and Al-Bayhaqi in As-Sunan al-Kubra."
  },
  "importantWords": [
    {
      "arabic": "الشُّفْعَةِ",
      "english": "Pre-emption",
      "urdu": "شفعہ (حقِ ترجیح)"
    },
    {
      "arabic": "يُقْسَمْ",
      "english": "Divided",
      "urdu": "تقسیم کیا جائے"
    },
    {
      "arabic": "اَلْحُدُودُ",
      "english": "Boundaries",
      "urdu": "حدود"
    },
    {
      "arabic": "صُرِّفَتْ",
      "english": "Laid out / Fixed",
      "urdu": "راستے پھیر دیے گئے"
    },
    {
      "arabic": "شِرْكٍ",
      "english": "Joint property",
      "urdu": "مشترکہ ملکیت"
    },
    {
      "arabic": "حَائِطٍ",
      "english": "Garden / Orchard",
      "urdu": "باغ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث حقِ شفعہ کے اصولوں کو واضح کرتی ہے، جس کے مطابق مشترکہ غیر منقولہ جائیداد کی فروخت میں شریک دار کو پہلے خریدنے کا حق حاصل ہوتا ہے تاکہ اجنبی کے آنے سے ہونے والے نقصان سے بچا جا سکے۔",
    "english": "This Hadith establishes the right of Pre-emption (Shuf'a), granting partners the first right to purchase shared property to prevent harm from external buyers."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2257)",
      "english": "Reported by Al-Bukhari (2257)"
    },
    {
      "arabic": "رواه مسلم (1608)",
      "english": "Reported by Muslim (1608)"
    },
    {
      "arabic": "رواه الطحاوي (4/126)",
      "english": "Reported by At-Tahawi (4/126)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبداللہ",
        "english": "Jabir bin 'Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq692mQ0k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حقِ شفعہ کی تعریف اور دائرہ کار",
        "english": "Definition and Scope of Pre-emption"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شفعہ کا لغوی و شرعی مطلب",
              "english": "Meaning of Shuf'a"
            },
            "content": {
              "urdu": [
                "شفعہ کا مطلب جوڑنا ہے، یعنی شریک کے حصے کو اپنے ساتھ ملانا۔",
                "یہ حق صرف غیر منقولہ جائیداد (زمین، گھر، باغ) میں ثابت ہوتا ہے۔",
                "اسلام نے یہ حق اس لیے دیا تاکہ کسی ناپسندیدہ پڑوسی یا شریک کے شر سے بچا جا سکے۔"
              ],
              "english": [
                "Shuf'a literally means to join, referring to joining a partner's share to one's own.",
                "This right applies specifically to immovable property like land, houses, and orchards.",
                "Islam grants this right to protect existing owners from potentially harmful new neighbors."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیر تقسیم شدہ جائیداد",
              "english": "Undivided Property"
            },
            "content": {
              "urdu": [
                "حدیث کے مطابق شفعہ صرف اس وقت تک ہے جب تک جائیداد تقسیم نہ ہوئی ہو۔",
                "اگر حدود متعین ہو جائیں اور راستے الگ کر دیے جائیں تو شفعہ ختم ہو جاتا ہے۔",
                "یہ جمہور فقہاء کا موقف ہے کہ تقسیم کے بعد حقِ شفعہ باقی نہیں رہتا۔"
              ],
              "english": [
                "According to the Hadith, Shuf'a exists only as long as the property remains undivided.",
                "Once boundaries are fixed and paths are separated, the right of Pre-emption ceases.",
                "This is the majority view among jurists regarding the termination of Shuf'a after division."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شریک کے حقوق اور آدابِ فروخت",
        "english": "Rights of Partners and Etiquettes of Sale"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پہلے شریک کو پیش کرنا",
              "english": "Offering to the Partner First"
            },
            "content": {
              "urdu": [
                "فروخت کرنے والے پر واجب ہے کہ وہ پہلے اپنے شریک کو حصہ خریدنے کی پیشکش کرے۔",
                "شریک کی اجازت کے بغیر کسی اجنبی کو فروخت کرنا شرعی طور پر درست نہیں۔",
                "اگر شریک خریدنے سے انکار کر دے، تبھی کسی دوسرے کو فروخت کیا جا سکتا ہے۔"
              ],
              "english": [
                "The seller is obligated to offer the share to his partner before looking for other buyers.",
                "Selling to a stranger without the partner's prior knowledge is discouraged and restricted.",
                "Only after the partner declines the offer can the property be sold to an outsider."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقصان سے بچاؤ کی حکمت",
              "english": "Wisdom in Preventing Harm"
            },
            "content": {
              "urdu": [
                "حقِ شفعہ کا مقصد مشترکہ جائیداد میں نئے فرد کے آنے سے ہونے والی تکلیف کو روکنا ہے۔",
                "یہ قانون معاشرتی امن اور جائیداد کے انتظام میں آسانی پیدا کرتا ہے۔",
                "اسلامی شریعت میں دوسروں کو ضرر پہنچانا منع ہے، اور یہ قانون اسی اصول پر مبنی ہے۔"
              ],
              "english": [
                "The primary purpose of Shuf'a is to prevent the hardship caused by a stranger entering the partnership.",
                "This law facilitates social peace and simplifies property management.",
                "Islamic law prohibits causing harm to others, and Shuf'a is a practical application of this rule."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلافات اور وضاحت",
        "english": "Juristic Differences and Clarifications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کیا شفعہ ہر چیز میں ہے؟",
              "english": "Is Shuf'a in Everything?"
            },
            "content": {
              "urdu": [
                "طحاوی کی روایت میں 'ہر چیز' کا ذکر ہے، جس سے بعض نے منقولہ اشیاء بھی مراد لی ہیں۔",
                "تاہم اکثر فقہاء کے نزدیک اس سے مراد ہر قسم کی زمین اور جائیداد ہی ہے۔",
                "منقولہ اشیاء (جیسے گاڑی یا جانور) میں شفعہ نہیں ہوتا کیونکہ وہاں تقسیم آسان ہوتی ہے۔"
              ],
              "english": [
                "The narration of At-Tahawi mentions 'everything,' leading some to include movable goods.",
                "However, most jurists interpret this as referring to all types of real estate and land.",
                "Movable items (like cars or animals) generally do not carry the right of Pre-emption."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدود بندی کے بعد شفعہ",
              "english": "Shuf'a After Fixing Boundaries"
            },
            "content": {
              "urdu": [
                "امام شافعی اور احمد کے نزدیک تقسیم کے بعد شفعہ مکمل ختم ہو جاتا ہے۔",
                "احناف کے نزدیک 'پڑوسی' کے لیے بھی شفعہ ثابت ہوتا ہے اگر راستے یا حقوق مشترک ہوں۔",
                "بخاری کی یہ حدیث واضح کرتی ہے کہ تقسیم اور حدود بندی شفعہ کے خاتمے کی علامت ہے۔"
              ],
              "english": [
                "Imams Shafi'i and Ahmad believe Shuf'a ends completely after the division of property.",
                "Hanafi scholars allow Shuf'a for neighbors if they share paths or specific water rights.",
                "This Sahih Bukhari narration emphasizes that fixing boundaries signals the end of Shuf'a."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور قانونی اسباق",
        "english": "Ethical and Legal Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانتداری کی ضرورت",
              "english": "Need for Honesty"
            },
            "content": {
              "urdu": [
                "سودا کرتے وقت شریک کو صحیح قیمت اور شرائط بتانا ضروری ہے۔",
                "شریک کو دھوکہ دے کر یا خفیہ طور پر بیچنا گناہ اور قانونی جرم ہے۔",
                "اسلام باہمی معاملات میں شفافیت اور سچائی کا حکم دیتا ہے۔"
              ],
              "english": [
                "It is essential to inform the partner of the actual price and terms of the sale.",
                "Selling secretly or deceiving the partner is both a sin and a legal violation.",
                "Islam commands transparency and truthfulness in all mutual dealings."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی ہم آہنگی",
              "english": "Social Harmony"
            },
            "content": {
              "urdu": [
                "شفعہ کا قانون پڑوسیوں اور شرکاء کے درمیان اچھے تعلقات قائم رکھنے میں مدد دیتا ہے۔",
                "یہ تنازعات کے امکانات کو ختم کرتا ہے جو نئے لوگوں کے آنے سے پیدا ہو سکتے ہیں۔",
                "اسلامی معاشرت میں فرد کے حقوق کے ساتھ ساتھ اجتماعی مفاد کا بھی خیال رکھا گیا ہے۔"
              ],
              "english": [
                "The law of Shuf'a helps maintain good relationships between partners and neighbors.",
                "It eliminates potential conflicts that might arise with the entry of unknown parties.",
                "Islamic society balances individual rights with the collective well-being of the community."
              ]
            }
          }
        ]
      }
    }
  ]
}