{
  "hadithId": 1038,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1038"],
    "kitabId": 10,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 84
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (6829)، ومسلم (1691).",
    "urdu": "یہ حدیث صحیح ہے اور بخاری و مسلم کی متفق علیہ روایت ہے۔ اس میں سیدنا عمر فاروق رضی اللہ عنہ کا وہ مشہور خطبہ ہے جو انہوں نے اپنے آخری حج کے موقع پر مدینہ منورہ واپس آ کر دیا تھا۔",
    "english": "Sahih (Authentic). Reported by al-Bukhari (6829) and Muslim (1691). This is part of a long sermon delivered by Umar (RA) after his last Hajj."
  },
  "importantWords": [
    {
      "arabic": "آيَةُ اَلرَّجْمِ",
      "english": "Verse of stoning",
      "urdu": "رجم کی آیت"
    },
    {
      "arabic": "وَعَيْنَاهَا",
      "english": "We memorized it",
      "urdu": "ہم نے اسے یاد رکھا"
    },
    {
      "arabic": "فَرِيضَةٍ",
      "english": "Obligation / Duty",
      "urdu": "فرض / واجب"
    },
    {
      "arabic": "أُحْصِنَ",
      "english": "Was married (Muhsan)",
      "urdu": "شادی شدہ ہو"
    },
    {
      "arabic": "اَلْبَيِّنَةُ",
      "english": "Clear proof / Witnesses",
      "urdu": "گواہی / دلیل"
    },
    {
      "arabic": "اَلْحَبَلُ",
      "english": "Pregnancy",
      "urdu": "حمل / پیٹ سے ہونا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث رجم (سنگسار کرنے) کی سزا کے شرعی ثبوت اور اس کے نفاذ کی شرائط (شادی شدہ ہونا، گواہی، حمل یا اعتراف) کو بیان کرتی ہے۔",
    "english": "This Hadith establishes the Shariah validity of stoning (Rajm) and outlines the conditions for its enforcement: being married, proof by witnesses, pregnancy, or confession."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (6829)",
      "english": "Sahih al-Bukhari (6829)"
    },
    {
      "arabic": "صحيح مسلم (1691)",
      "english": "Sahih Muslim (1691)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar bin Al-Khattab"
      },
      "slug": "umar-bin-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رجم کی شرعی حیثیت",
        "english": "Shariah Status of Stoning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "منسوخ التلاوت آیت",
              "english": "Abrogated Recitation"
            },
            "content": {
              "urdu": [
                "رجم کی آیت قرآن میں نازل ہوئی تھی لیکن اس کی تلاوت منسوخ کر دی گئی۔",
                "تلاوت منسوخ ہونے کے باوجود اس کا حکم (سزا) قیامت تک کے لیے باقی ہے۔",
                "سیدنا عمر نے اس خطبے کے ذریعے امت کو اس اہم شرعی حکم کی حفاظت کی تاکید کی۔"
              ],
              "english": [
                "The verse regarding stoning was revealed in the Quran, but its recitation was later abrogated.",
                "Despite the abrogation of its recitation, the legal ruling (punishment) remains valid until the Day of Judgment.",
                "Through this sermon, Umar (RA) emphasized the preservation of this critical Shariah mandate for the Ummah."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ نبوی سے ثبوت",
              "english": "Evidence from Sunnah"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے اپنی زندگی میں کئی بار شادی شدہ زانیوں کو رجم کرنے کا حکم دیا۔",
                "خلفائے راشدین نے بھی اپنے ادوار میں اسی سنت پر عمل درآمد جاری رکھا۔",
                "رجم کی سزا کا انکار کرنا گمراہی ہے کیونکہ یہ قطعی دلائل سے ثابت ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) ordered the stoning of married adulterers multiple times during his life.",
                "The Rightly Guided Caliphs continued to implement this Sunnah during their respective eras.",
                "Denying the penalty of stoning is considered a form of misguidance as it is established by definitive evidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سزا کے نفاذ کی شرائط",
        "english": "Conditions for Punishment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احصان (شادی شدہ ہونا)",
              "english": "Ihsan (Marital Status)"
            },
            "content": {
              "urdu": [
                "رجم کی سزا صرف اس مرد یا عورت کے لیے ہے جو شادی شدہ (محصن) ہوں۔",
                "غیر شادی شدہ کے لیے سزا سو کوڑے ہے، جیسا کہ سورہ نور میں مذکور ہے۔",
                "اسلام نے پاکیزہ خاندانی نظام کے تحفظ کے لیے اس سخت سزا کو مقرر کیا ہے۔"
              ],
              "english": [
                "The penalty of stoning is exclusively for men or women who are married (Muhsan).",
                "The punishment for the unmarried is one hundred lashes, as mentioned in Surah An-Nur.",
                "Islam prescribed this severe penalty to safeguard the sanctity of the family system."
              ]
            }
          },
          {
            "title": {
              "urdu": "ثبوت کے ذرائع",
              "english": "Means of Proof"
            },
            "content": {
              "urdu": [
                "سزا کے لیے چار عادل گواہوں کی گواہی، حمل یا صریح اعتراف ضروری ہے۔",
                "اگر گواہی میں ذرہ برابر بھی شک ہو تو حد نافذ نہیں کی جاتی۔",
                "اسلامی قانون 'شک کا فائدہ' ملزم کو دینے اور پردہ پوشی کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "Punishment requires the testimony of four upright witnesses, pregnancy, or an explicit confession.",
                "The penalty is not enforced if there is even the slightest doubt in the evidence.",
                "Islamic law encourages giving the 'benefit of doubt' to the accused and maintaining privacy."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سیدنا عمر کی دور اندیشی",
        "english": "Umar's (RA) Foresight"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتنہ انکارِ حدیث کا سدِ باب",
              "english": "Preventing Rejection of Hadith"
            },
            "content": {
              "urdu": [
                "سیدنا عمر کو ڈر تھا کہ لوگ صرف لکھی ہوئی آیت تلاش کریں گے اور سنت کو چھوڑ دیں گے۔",
                "آج کے دور میں 'منکرینِ حدیث' کا ظہور سیدنا عمر کی اس پیش گوئی کی تصدیق ہے۔",
                "دین کی فہم کے لیے سنتِ رسول ﷺ کو قرآن سے جدا نہیں کیا جا سکتا۔"
              ],
              "english": [
                "Umar (RA) feared that people would look only for written verses and abandon the Sunnah.",
                "The emergence of 'Hadith rejecters' in the modern era confirms Umar's foresight.",
                "The Sunnah of the Messenger (ﷺ) cannot be separated from the Quran for understanding religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "حفاظتِ دین کی ذمہ داری",
              "english": "Responsibility of Preserving Faith"
            },
            "content": {
              "urdu": [
                "صحابہ کرام نے دین کے ہر حکم کو سمجھا، یاد کیا اور آگے منتقل کیا۔",
                "عوامی خطبات کے ذریعے اہم احکام کی تشہیر کرنا حاکمِ وقت کی ذمہ داری ہے۔",
                "دین میں تحریف اور کمی بیشی کے خلاف صحابہ ایک مضبوط دیوار تھے۔"
              ],
              "english": [
                "The Companions understood, memorized, and transmitted every command of the faith.",
                "It is the ruler's duty to publicize important rulings through public sermons.",
                "The Sahaba stood as a strong barrier against any distortion or alteration in religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی و اخلاقی اسباق",
        "english": "Social and Ethical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ خدا اور احتساب",
              "english": "Fear of Allah and Accountability"
            },
            "content": {
              "urdu": [
                "سخت سزاؤں کا مقصد معاشرے کو جرائم سے پاک اور محفوظ بنانا ہے۔",
                "جب لوگوں کو انجام کا علم ہو تو وہ برائی کے قریب جانے سے کتراتے ہیں۔",
                "اسلامی حدود محض انتقام نہیں بلکہ رحمت اور تطہیر کا ذریعہ ہیں۔"
              ],
              "english": [
                "The purpose of severe penalties is to keep society free from crime and secure.",
                "When people are aware of the consequences, they hesitate to approach evil.",
                "Islamic Hudud are not mere revenge but a means of mercy and purification."
              ]
            }
          },
          {
            "title": {
              "urdu": "اعتدال اور توازن",
              "english": "Moderation and Balance"
            },
            "content": {
              "urdu": [
                "اسلام گناہ سے پہلے اس کے اسباب کو روکنے (مثلاً حیا اور نکاح) پر زور دیتا ہے۔",
                "سزا اسی صورت میں ہے جب انسان تمام سہولیات کے باوجود جرم کرے۔",
                "عدل کا قیام ہی انسانیت کی فلاح اور بقا کا واحد راستہ ہے۔"
              ],
              "english": [
                "Islam emphasizes blocking the paths to sin (e.g., modesty and marriage) first.",
                "Punishment is only applied when a person commits a crime despite all available facilities.",
                "The establishment of justice is the only path to the welfare and survival of humanity."
              ]
            }
          }
        ]
      }
    }
  ]
}