{
  "hadithId": 773,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["bulugh/773"],
    "kitabId": 7,
    "inKitabBab": 15,
    "arabicBook": "بلوغ المرام - كتاب البيوع",
    "babId": 56
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (5737). أصل الحديث في قصة الصحابة الذين رقوا سيد حي من العرب بسورة الفاتحة مقابل قطيع من الغنم بعد أن لدغته عقرب، فأقرهم النبي صلى الله عليه وسلم على ذلك.",
    "urdu": "صحیح۔ اسے امام بخاری (5737) نے روایت کیا ہے۔ اس حدیث کا پس منظر یہ ہے کہ صحابہ کرام کے ایک گروہ نے قبیلے کے ایک سردار کو سانپ یا بچھو کے ڈسنے پر سورہ فاتحہ پڑھ کر دم کیا تھا اور اجرت میں بکریاں لی تھیں، جس پر نبی ﷺ نے یہ مہرِ تصدیق ثبت فرمائی۔",
    "english": "Sahih. Reported by Al-Bukhari (5737). The background involves a group of Sahaba who treated a tribal chief's scorpion sting with Surah Al-Fatiha in exchange for sheep. The Prophet (ﷺ) approved of their action with this statement."
  },
  "importantWords": [
    {
      "arabic": "أَحَقَّ",
      "english": "Most Worthy / Deserving",
      "urdu": "سب سے زیادہ مستحق"
    },
    {
      "arabic": "أَخَذْتُمْ",
      "english": "You took",
      "urdu": "تم نے لیا"
    },
    {
      "arabic": "أَجْرًا",
      "english": "Reward / Wage",
      "urdu": "اجرت / معاوضہ"
    },
    {
      "arabic": "كِتَابُ اَللَّهِ",
      "english": "The Book of Allah",
      "urdu": "اللہ کی کتاب"
    },
    {
      "arabic": "رَاقٍ",
      "english": "One who performs Ruqyah",
      "urdu": "دم کرنے والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث سے ثابت ہوتا ہے کہ قرآن کریم کے ذریعے دم (رقیہ) کرنے یا اسے سکھانے پر معاوضہ لینا شرعی طور پر جائز اور حلال ہے۔",
    "english": "This Hadith establishes the permissibility of taking a wage or reward for performing Ruqyah (healing through the Qur'an) or teaching it."
  },
  "references": [
    {
      "arabic": "رواه البخاري (5737)",
      "english": "Reported by Al-Bukhari (5737)"
    },
    {
      "arabic": "صحيح ابن حبان (5145)",
      "english": "Sahih Ibn Hibban (5145)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=0m_t9XfE1lM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرآن پر اجرت کا جواز",
        "english": "Permissibility of Reward for Qur'an"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دم (رقیہ) پر اجرت",
              "english": "Wage for Ruqyah"
            },
            "content": {
              "urdu": [
                "قرآنی آیات کے ذریعے دم کرنے اور اس پر ہدیہ یا معاوضہ لینا جائز ہے۔",
                "صحابہ نے جب دم کے بدلے بکریاں لیں تو آپ ﷺ نے اسے پسند فرمایا۔",
                "یہ اس بات کی دلیل ہے کہ کلام اللہ سے شفا حاصل کرنا اور اس کی خدمت کا بدلہ لینا درست ہے۔"
              ],
              "english": [
                "It is permissible to perform Ruqyah with Qur'anic verses and accept a gift or fee for it.",
                "When the Sahaba accepted sheep for Ruqyah, the Prophet (ﷺ) approved of their action.",
                "This serves as evidence that seeking cure through Allah's Word and being compensated for it is valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیمِ قرآن پر اجرت",
              "english": "Wage for Teaching Qur'an"
            },
            "content": {
              "urdu": [
                "ائمہ مالک، شافعی اور احمد کے نزدیک قرآن سکھانے پر تنخواہ لینا بھی جائز ہے۔",
                "حدیث کے الفاظ 'سب سے زیادہ مستحق' اس کے جواز کی عمومی اور مضبوط دلیل ہیں۔",
                "یہ اس لیے ضروری ہے تاکہ معلمینِ قرآن فارغ البال ہو کر دین کی خدمت کر سکیں۔"
              ],
              "english": [
                "Imams Malik, Shafi'i, and Ahmad permit accepting a salary for teaching the Qur'an.",
                "The phrase 'the most worthy thing' is a strong general proof for this permissibility.",
                "This is necessary so that Qur'an teachers can dedicate themselves fully to the service of religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی ابحاث اور وضاحت",
        "english": "Juristic Discussions and Clarifications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کراہت کی روایات اور ان کا حل",
              "english": "Reconciling with Narrations of Dislike"
            },
            "content": {
              "urdu": [
                "بعض روایات میں قرآن پر اجرت کی ممانعت ہے، وہ محض تلاوت پر اجرت لینے سے متعلق ہیں۔",
                "صرف تلاوت کر کے پیسے مانگنا (جیسے مروجہ ایصالِ ثواب) پسندیدہ نہیں ہے۔",
                "لیکن تعلیم اور علاج (دم) محنت کے زمرے میں آتے ہیں، اس لیے ان کا معاوضہ جائز ہے۔"
              ],
              "english": [
                "Some narrations forbidding wages for the Qur'an refer to taking money for mere recitation.",
                "Reciting solely to ask for money (like common commercialized rituals) is not recommended.",
                "However, teaching and healing (Ruqyah) fall under labor, thus compensation is valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "نیت کی اہمیت",
              "english": "Importance of Intention"
            },
            "content": {
              "urdu": [
                "معلم یا قاری کی اصل نیت دین کی ترویج اور رضائے الہی ہونی چاہیے۔",
                "دنیاوی معاوضہ صرف گزر اوقات اور ضرورت کے لیے ہونا چاہیے۔",
                "خالص دنیاوی لالچ کے لیے قرآن کو ذریعہ بنانا اجرِ آخرت کو ضائع کر سکتا ہے۔"
              ],
              "english": [
                "The primary intention of the teacher or reciter should be the propagation of religion and Allah's pleasure.",
                "Worldly compensation should be viewed as a means of livelihood and necessity.",
                "Using the Qur'an solely for worldly greed can nullify the rewards of the Hereafter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرآن اور شفا",
        "english": "The Qur'an and Healing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن تمام امراض کا علاج",
              "english": "Qur'an as a Cure for All Ailments"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ نے قرآن کو مومنین کے لیے 'شفا اور رحمت' قرار دیا ہے۔",
                "جسمانی اور روحانی دونوں قسم کی بیماریوں میں قرآن سے مدد لینا سنت ہے۔",
                "سورہ فاتحہ کو اسی لیے 'سورۃ الشفا' بھی کہا جاتا ہے۔"
              ],
              "english": [
                "Allah has declared the Qur'an as a 'healing and mercy' for the believers.",
                "Seeking help from the Qur'an for both physical and spiritual illnesses is a Sunnah.",
                "This is why Surah Al-Fatiha is also known as 'The Chapter of Healing' (Ash-Shifa)."
              ]
            }
          },
          {
            "title": {
              "urdu": "دم کرنے کے آداب",
              "english": "Etiquettes of Ruqyah"
            },
            "content": {
              "urdu": [
                "دم صرف قرآن اور مسنون دعاؤں سے ہونا چاہیے، شرکیہ کلمات سے نہیں۔",
                "دم کرنے والے کا صاحبِ ایمان اور متقی ہونا اثر کو بڑھاتا ہے۔",
                "یہ یقین ہونا چاہیے کہ شفا دینے والی ذات صرف اللہ کی ہے۔"
              ],
              "english": [
                "Ruqyah should only be performed with the Qur'an and Sunnah supplications, not shirk.",
                "The piety and faith of the person performing Ruqyah increase its efficacy.",
                "One must firmly believe that the Ultimate Healer is Allah alone."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کے اسباق",
        "english": "Practical Life Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دینی خادموں کا احترام",
              "english": "Respecting Religious Servants"
            },
            "content": {
              "urdu": [
                "قرآن سکھانے والوں اور اماموں کی کفالت معاشرے کی ذمہ داری ہے۔",
                "انہیں معقول معاوضہ دینا چاہیے تاکہ وہ معاشی پریشانیوں سے آزاد رہ سکیں۔",
                "سب سے بہترین معاوضہ وہی ہے جو سب سے بہترین کتاب کے خادم کو دیا جائے۔"
              ],
              "english": [
                "The maintenance of Qur'an teachers and Imams is the responsibility of society.",
                "They should be given reasonable compensation so they remain free from financial stress.",
                "The best reward is that which is given to the servant of the Best Book."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن سے تعلق جوڑیں",
              "english": "Connecting with the Qur'an"
            },
            "content": {
              "urdu": [
                "ہمیں اپنے معاملات اور بیماریوں میں قرآن کی طرف رجوع کرنا چاہیے۔",
                "قرآن سیکھنے اور سکھانے کو اپنی زندگی کا اولین مقصد بنائیں۔",
                "دینی خدمات پر خرچ کرنا ضیاع نہیں بلکہ بہترین سرمایہ کاری ہے۔"
              ],
              "english": [
                "We should turn to the Qur'an in our affairs and our illnesses.",
                "Make learning and teaching the Qur'an a primary goal of your life.",
                "Spending on religious services is not a waste but the best form of investment."
              ]
            }
          }
        ]
      }
    }
  ]
}