{
  "hadithId": 740,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["bulugh/7/40"],
    "kitabId": 7,
    "inKitabBab": 8,
    "arabicBook": "كتاب البيوع",
    "babId": 49
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2398)، ومسلم (1619)، وزادا: \"ومن ترك مالا فهو لورثته\". البخاري برقم (6731).",
    "urdu": "یہ روایت صحیح ہے، اسے امام بخاری (2398) اور امام مسلم (1619) نے روایت کیا ہے۔ اس میں یہ اضافہ بھی ہے کہ 'جس نے مال چھوڑا وہ اس کے وارثوں کا ہے'۔",
    "english": "Sahih. Reported by Al-Bukhari (2398) and Muslim (1619). The versions include an addition: 'Whoever leaves wealth, it belongs to his heirs.'"
  },
  "importantWords": [
    {
      "arabic": "اَلْمُتَوَفَّى",
      "english": "Deceased",
      "urdu": "فوت شدہ"
    },
    {
      "arabic": "اَلدَّيْنُ",
      "english": "Debt",
      "urdu": "قرض"
    },
    {
      "arabic": "وَفَاءً",
      "english": "Repayment / Sufficiency",
      "urdu": "ادائیگی / کافی مال"
    },
    {
      "arabic": "أَوْلَى",
      "english": "Closer / More Entitled",
      "urdu": "زیادہ قریب / حقدار"
    },
    {
      "arabic": "اَلْفُتُوحَ",
      "english": "Conquests / Victories",
      "urdu": "فتوحات"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قرض کی سنگینی اور ریاستِ مدینہ کی ذمہ داری کو واضح کرتی ہے کہ ابتداء میں آپ ﷺ مقروض کا جنازہ نہیں پڑھاتے تھے، لیکن مالی استحکام کے بعد ریاست نے قرض کی ادائیگی کا ذمہ لیا۔",
    "english": "This Hadith highlights the seriousness of debt and the state's responsibility; initially, the Prophet (ﷺ) avoided praying over debtors, but later the state assumed responsibility for their debts."
  },
  "references": [
    {
      "arabic": "رواه البخاري في كتاب الحوالات (2398)",
      "english": "Reported by Al-Bukhari in the Book of Transfers (2398)"
    },
    {
      "arabic": "رواه مسلم في كتاب الفرائض (1619)",
      "english": "Reported by Muslim in the Book of Inheritance (1619)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=DInNf7-nEBY",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرض کی سنگینی",
        "english": "The Gravity of Debt"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جنازہ سے اجتناب کی حکمت",
              "english": "Wisdom Behind Avoiding the Funeral"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا مقروض کا جنازہ نہ پڑھانا لوگوں کو قرض سے ڈرانے کے لیے تھا۔",
                "یہ اس بات کی تنبیہ تھی کہ حقوق العباد کی ادائیگی کس قدر ضروری ہے۔",
                "قرض کی حالت میں مرنا انسان کی اخروی نجات کے لیے رکاوٹ بن سکتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) avoidance was to warn people against taking unnecessary debts.",
                "It serves as a stern reminder of the importance of fulfilling others' rights.",
                "Dying in a state of debt can be a barrier to one's salvation in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی اہمیت",
              "english": "Importance of People's Rights"
            },
            "content": {
              "urdu": [
                "قرض اللہ کے حقوق سے زیادہ حساس معاملہ ہے کیونکہ یہ بندوں کا حق ہے۔",
                "اسلامی تعلیمات کے مطابق قرض کی ادائیگی ترکے میں سب سے پہلا حق ہے۔",
                "بغیر کسی مجبوری کے قرض لینا اور اسے نہ لوٹانا ایک سنگین گناہ ہے۔"
              ],
              "english": [
                "Debt is more sensitive than rights of Allah as it concerns human rights.",
                "According to Islamic law, debt repayment is the first priority from the estate.",
                "Taking a loan without necessity and refusing to return it is a grave sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسلامی ریاست کی ذمہ داری",
        "english": "Responsibility of the Islamic State"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیت المال کا کردار",
              "english": "The Role of Bayt al-Mal"
            },
            "content": {
              "urdu": [
                "فتوحات کے بعد جب ریاست کے پاس مال آیا تو آپ ﷺ نے ذمہ داری اٹھائی۔",
                "اسلامی ریاست اپنے غریب اور مقروض شہریوں کی کفیل ہوتی ہے۔",
                "یہ نظام معاشرے سے معاشی بوجھ اور پریشانیوں کو ختم کرتا ہے۔"
              ],
              "english": [
                "After victories brought wealth, the Prophet (ﷺ) took responsibility for debts.",
                "An Islamic state acts as a guardian for its poor and indebted citizens.",
                "This system aims to eradicate economic burdens and distress from society."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کی شفقت",
              "english": "Compassion of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ کا فرمان کہ 'میں مومنوں کی جان سے زیادہ قریب ہوں' شفقت کا اظہار ہے۔",
                "آپ ﷺ نے اپنی امت کے مالی بوجھ کو اپنے ذمے لے کر احسان فرمایا۔",
                "یہ عمل رہتی دنیا تک کے حکمرانوں کے لیے ایک بہترین نمونہ ہے۔"
              ],
              "english": [
                "His statement 'I am closer to believers than themselves' shows immense love.",
                "He favored the Ummah by taking their financial burdens upon himself.",
                "This action serves as a perfect role model for all future leaders."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وراثت کے احکام",
        "english": "Rulings of Inheritance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترکہ کی تقسیم",
              "english": "Distribution of Estate"
            },
            "content": {
              "urdu": [
                "اگر میت نے مال چھوڑا ہے تو پہلے قرض ادا کیا جائے گا۔",
                "قرض کی ادائیگی کے بعد جو کچھ بچے گا وہ وارثوں میں تقسیم ہوگا۔",
                "وارث میت کے ذاتی قرضوں کے شرعاً ذمہ دار نہیں اگر ترکہ نہ ہو۔"
              ],
              "english": [
                "If the deceased left wealth, the debt must be cleared first.",
                "The remainder after debt clearance is divided among the legal heirs.",
                "Heirs are not legally liable for personal debts if no estate was left."
              ]
            }
          },
          {
            "title": {
              "urdu": "وارثوں کا حق",
              "english": "Rights of the Heirs"
            },
            "content": {
              "urdu": [
                "میت کا مال اس کے رشتہ داروں کے لیے اللہ کا مقرر کردہ حصہ ہے۔",
                "کوئی دوسرا شخص وارثوں کے مال پر ناحق قبضہ نہیں کر سکتا۔",
                "اسلام نے مال کی تقسیم کا ایک منصفانہ اور شفاف نظام دیا ہے۔"
              ],
              "english": [
                "The wealth left by the deceased is the ordained portion for relatives.",
                "No other person can unjustly seize the property of the heirs.",
                "Islam has provided a just and transparent system for wealth distribution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اسباق",
        "english": "Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دیانتداری",
              "english": "Honesty and Integrity"
            },
            "content": {
              "urdu": [
                "انسان کو چاہیے کہ صرف ضرورت کے وقت ہی قرض لے۔",
                "قرض لیتے وقت نیت ہمیشہ واپس کرنے کی ہونی چاہیے۔",
                "دیانتدار مقروض کی مدد اللہ کی طرف سے غیبی طریقے سے ہوتی ہے۔"
              ],
              "english": [
                "One should only take a loan in times of absolute necessity.",
                "The intention should always be to repay the debt when borrowing.",
                "An honest debtor receives help from Allah through unseen means."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتماعی ہمدردی",
              "english": "Collective Empathy"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو اپنے مقروض بھائیوں کی مدد کرنی چاہیے۔",
                "جنازہ پڑھنے والے ساتھیوں کو میت کے لیے دعا کرنی چاہیے۔",
                "معاشرے میں ایک دوسرے کا بوجھ بانٹنے کی فضا پیدا کرنی چاہیے۔"
              ],
              "english": [
                "Muslims should strive to help their debt-ridden brothers.",
                "Those attending the funeral should sincerely pray for the deceased.",
                "A culture of sharing each other's burdens should be created in society."
              ]
            }
          }
        ]
      }
    }
  ]
}