{
  "hadithId": 998,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1148"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (111)‏، وأحمد (1/119)، وأبو داود (4530)، والنسائي (4734)، والحاكم (2/141) وصححه ووافقه الذهبي.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام بخاری نے (111) پر، امام احمد، ابوداؤد، نسائی اور حاکم نے روایت کیا ہے۔ امام حاکم اور ذہبی نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (111), Ahmad (1/119), Abu Dawud (4530), An-Nasa'i (4734), and Al-Hakim (2/141). Al-Hakim and Adh-Dhahabi graded it Sahih."
  },
  "importantWords": [
    {
      "arabic": "فَلَقَ",
      "english": "Split / Caused to grow",
      "urdu": "پھاڑا / اگایا"
    },
    {
      "arabic": "اَلْعَقْلُ",
      "english": "Blood-money (Diyat)",
      "urdu": "دیت کے احکام"
    },
    {
      "arabic": "فِكَاكُ",
      "english": "Freeing / Releasing",
      "urdu": "چھڑانا / آزاد کرنا"
    },
    {
      "arabic": "تَتَكَافَأُ",
      "english": "Are equal / Equivalent",
      "urdu": "برابر ہیں"
    },
    {
      "arabic": "ذِمَّتِهِمْ",
      "english": "Protection / Covenant",
      "urdu": "عہد / ذمہ داری"
    },
    {
      "arabic": "يَدٌ",
      "english": "One Hand (United)",
      "urdu": "ایک ہاتھ (متحد)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسلمانوں کی برابری، غیر مسلموں کے قتل کے احکام، اور قرآن کے فہم کی اہمیت کو واضح کرتی ہے۔",
    "english": "This Hadith clarifies the equality of Muslims, rulings on retaliation involving non-Muslims, and the significance of understanding the Quran."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (111)",
      "english": "Sahih al-Bukhari (111)"
    },
    {
      "arabic": "سنن أبي داود (4530)",
      "english": "Sunan Abu Dawud (4530)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Ali bin Abi Talib"
      },
      "slug": "ali-bin-abi-talib"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو جحيفة",
        "english": "Abu Juhaifa"
      },
      "slug": "abu-juhaifa"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=vV_uA-7_0s0",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرآن اور فہمِ دین",
        "english": "The Quran and Religious Understanding"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اہلِ بیت اور وحی",
              "english": "Ahl al-Bayt and Revelation"
            },
            "content": {
              "urdu": [
                "حضرت علی نے واضح کیا کہ اہل بیت کے پاس قرآن کے علاوہ کوئی خفیہ وحی نہیں ہے۔",
                "دینِ اسلام سب کے لیے ایک ہے اور اس کے بنیادی احکام قرآن میں موجود ہیں۔",
                "یہ ان غلط فہمیوں کا ازالہ ہے کہ نبی ﷺ نے کسی کو مخصوص علمِ غیب دیا تھا۔"
              ],
              "english": [
                "Ali (RA) clarified that the Ahl al-Bayt do not possess any secret revelation outside the Quran.",
                "The religion of Islam is the same for all, and its core rulings are in the Quran.",
                "This refutes misconceptions that the Prophet ﷺ gave specific hidden knowledge to some."
              ]
            }
          },
          {
            "title": {
              "urdu": "فہمِ قرآن کی اہمیت",
              "english": "Importance of Understanding Quran"
            },
            "content": {
              "urdu": [
                "اللہ تعالیٰ جسے چاہتا ہے قرآن کا خاص فہم اور گہرائی عطا فرماتا ہے۔",
                "یہ فہم کسی نئی وحی کا نام نہیں بلکہ آیات کے صحیح استنباط کی صلاحیت ہے۔",
                "علمائے کرام اور اہل اللہ اس فہم کے ذریعے امت کی رہنمائی کرتے ہیں۔"
              ],
              "english": [
                "Allah grants deep understanding and insight of the Quran to whom He wills.",
                "This understanding is not a new revelation but the ability to derive correct rulings.",
                "Scholars and righteous people guide the Ummah through this God-given insight."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قصاص اور بین المذاہب احکام",
        "english": "Retaliation and Interfaith Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسلم اور کافر کا قصاص",
              "english": "Retaliation Between Muslim and Disbeliever"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک مسلمان کو کافر کے بدلے میں قتل (قصاص) نہیں کیا جائے گا۔",
                "اس کا مطلب یہ نہیں کہ کافر کا خون رائیگاں ہے، بلکہ اس کی سزا دیت یا تعزیر ہو گی۔",
                "اسلامی قانون میں جان کی حرمت کے درجات ایمانی بنیاد پر رکھے گئے ہیں۔"
              ],
              "english": [
                "Most jurists agree that a Muslim is not killed in retaliation (Qisas) for a disbeliever.",
                "This does not mean the blood is wasted; rather, Diyat or other punishments apply.",
                "In Islamic law, levels of sanctity of life are established based on faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاہد کی حفاظت",
              "english": "Protection of Non-Muslim Citizens"
            },
            "content": {
              "urdu": [
                "ذمی یا معاہد (جس سے امن کا وعدہ ہو) کا قتل کرنا سخت حرام ہے۔",
                "حدیث میں واضح ہے کہ معاہد کو اس کے عہد کے دوران قتل نہیں کیا جا سکتا۔",
                "اسلامی ریاست غیر مسلم شہریوں کی جان و مال کے تحفظ کی ضامن ہے۔"
              ],
              "english": [
                "Killing a Dhimmi or Mu'ahid (one under a peace treaty) is strictly prohibited.",
                "The Hadith states that a person with a covenant cannot be killed during its term.",
                "The Islamic state is the guarantor of the lives and property of non-Muslim citizens."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "امتِ مسلمہ کی وحدت",
        "english": "Unity of the Muslim Ummah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خون کی برابری",
              "english": "Equality of Blood"
            },
            "content": {
              "urdu": [
                "تمام مسلمانوں کے خون کی قیمت برابر ہے، چاہے وہ امیر ہو یا غریب۔",
                "خاندانی پس منظر یا سماجی حیثیت قصاص و دیت کے احکام میں اثر انداز نہیں ہوتی۔",
                "اسلامی معاشرہ نسل اور رنگ کے بجائے انسانی برابری پر مبنی ہے۔"
              ],
              "english": [
                "The lives of all Muslims are equal in value, whether rich or poor.",
                "Social status or family background does not affect the rulings of Qisas or Diyat.",
                "Islamic society is based on human equality rather than race or color."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذمہ داری میں اشتراک",
              "english": "Shared Responsibility"
            },
            "content": {
              "urdu": [
                "اگر ایک عام مسلمان بھی کسی کو پناہ دے تو پوری امت اس کی پابند ہے۔",
                "مسلمانوں کو غیروں کے مقابلے میں ایک سیسہ پلائی ہوئی دیوار ہونا چاہیے۔",
                "باہمی دفاع اور ایک دوسرے کی حمایت ایمان کا لازمی تقاضا ہے۔"
              ],
              "english": [
                "If even an ordinary Muslim grants asylum, the entire Ummah is bound by it.",
                "Muslims must stand as a united front against external threats.",
                "Mutual defense and supporting one another are essential requirements of faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی و معاشرتی اسباق",
        "english": "Legal and Social Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قیدیوں کی رہائی",
              "english": "Freeing the Captives"
            },
            "content": {
              "urdu": [
                "مسلم قیدیوں کو دشمن کی قید سے چھڑانا حکومت اور امت پر واجب ہے۔",
                "اس کے لیے مال خرچ کرنا یا سفارتی کوششیں کرنا بہترین نیکی ہے۔",
                "یہ شق مسلمانوں کے باہمی ہمدردی کے جذبے کو نمایاں کرتی ہے۔"
              ],
              "english": [
                "Freeing Muslim captives from enemy imprisonment is obligatory on the state and Ummah.",
                "Spending wealth or making diplomatic efforts for this is a great righteous act.",
                "This clause highlights the spirit of mutual sympathy among Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیت کے احکام",
              "english": "Rulings of Blood-money"
            },
            "content": {
              "urdu": [
                "خون بہا (دیت) کا نظام سماجی تنازعات کو ختم کرنے کا ایک ذریعہ ہے۔",
                "اس صحیفے میں دیت کی مقدار اور ادائیگی کے تفصیلی ضوابط درج تھے۔",
                "اسلامی قانون انتقام کے بجائے اصلاح اور تلافی کو اہمیت دیتا ہے۔"
              ],
              "english": [
                "The system of Diyat (blood-money) is a means to resolve social conflicts.",
                "This document contained detailed regulations regarding the amount and payment of Diyat.",
                "Islamic law values reform and compensation over mere vengeance."
              ]
            }
          }
        ]
      }
    }
  ]
}