{
  "hadithId": 751,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/11/1"
    ],
    "kitabId": 7,
    "inKitabBab": 11,
    "arabicBook": "بلوغ المرام",
    "babId": 52
  },
  "name": {
    "arabic": "عَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَلَى اَلْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَهُ } رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَصَحَّحَهُ اَلْحَاكِمُ",
    "urdu": " سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو کچھ ہاتھ نے لیا ہے جب تک اسے ادا نہ کر دے اس کے ذمہ ہے۔“ اسے احمد اور چاروں نے روایت کیا ہے اور حاکم نے اسے صحیح قرار دیا ہے۔ ",
    "english": "Narrated Samurah bin Jundub (RA): Allah's Messenger (ﷺ) said: 'The hand is responsible for what it has taken until it repays it (returns it to the owner).' [Reported by Ahmad and the four (Sunan compilers), and Al-Hakim graded it Sahih]."
  },
  "takhreej": {
    "arabic": "ضعيف.‏ رواه أحمد (5/8)، وأبو داود (3561)، والترمذي (1266)، والنسائي، وابن ماجه (2400). والحديث من طريق الحسن البصري عن سمرة، والحسن مدلس وقد عنعن، مما جعل بعض العلماء يضعفونه رغم تصحيح الحاكم والترمذي له.",
    "urdu": "یہ روایت ضعیف ہے۔ اسے احمد، ابوداؤد، ترمذی اور ابن ماجہ نے روایت کیا ہے۔ اس کی سند میں حسن بصری کا سمرہ سے سماع اختلافی ہے اور وہ مدلس بھی ہیں، اسی لیے محدثین کی ایک جماعت اسے ضعیف قرار دیتی ہے۔",
    "english": "Da'if (Weak). Reported by Ahmad, Abu Dawud, At-Tirmidhi, and Ibn Majah. Although Al-Hakim and At-Tirmidhi graded it Sahih/Hasan, many scholars consider it weak due to Al-Hasan Al-Basri's tadlis (obscurity in transmission) from Samurah."
  },
  "importantWords": [
    {
      "arabic": "عَلَى اَلْيَدِ",
      "english": "On the hand (Responsible)",
      "urdu": "ہاتھ پر (ذمہ داری)"
    },
    {
      "arabic": "أَخَذَتْ",
      "english": "It took",
      "urdu": "جو اس نے لیا"
    },
    {
      "arabic": "حَتَّى",
      "english": "Until",
      "urdu": "یہاں تک کہ"
    },
    {
      "arabic": "تُؤَدِّيَهُ",
      "english": "It pays/returns it",
      "urdu": "اسے ادا کر دے"
    },
    {
      "arabic": "أَمِينُكَ",
      "english": "Your trustee",
      "urdu": "تمہارا امانت دار"
    },
    {
      "arabic": "ضَمَان",
      "english": "Guarantee/Liability",
      "urdu": "ضمانت / تاوان"
    }
  ],
  "summary": {
    "urdu": "اس حدیث کا مفہوم یہ ہے کہ اگر کوئی شخص کسی دوسرے کی چیز لیتا ہے (چاہے عاریت پر ہو یا غلطی سے)، تو وہ اس کی واپسی کا ذمہ دار ہے اور نقصان کی صورت میں تاوان بھرنا پڑے گا۔",
    "english": "The Hadith implies that anyone who takes another's property is legally responsible for its safety and return; they are liable for any loss until the item is returned to its owner."
  },
  "references": [
    {
      "arabic": "مسند أحمد (5/8)",
      "english": "Musnad Ahmad (5/8)"
    },
    {
      "arabic": "سنن أبي داود (3561)",
      "english": "Sunan Abu Dawud (3561)"
    },
    {
      "arabic": "سنن الترمذي (1266)",
      "english": "Sunan at-Tirmidhi (1266)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سمرة بن جندب",
        "english": "Samurah bin Jundub"
      },
      "slug": "samurah-bin-jundub"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FmS3m6qS0YQ",
  "grade": {
    "arabic": "ضعيف (عند المحققين)",
    "english": "Weak (According to most researchers)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "امانت اور ذمہ داری",
        "english": "Trust and Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی حفاظت کا حکم",
              "english": "Command to Protect Property"
            },
            "content": {
              "urdu": [
                "اسلام ہر شخص کو دوسرے کے مال کی حفاظت کا ذمہ دار ٹھہراتا ہے۔",
                "کسی کی چیز لینا اسے بحفاظت واپس کرنے کے وعدے پر مبنی ہے۔",
                "لاپرواہی کی صورت میں نقصان کا ازالہ قابض شخص کے ذمہ ہے۔"
              ],
              "english": [
                "Islam holds every person responsible for protecting another's property.",
                "Taking someone's item implies a promise to return it safely.",
                "In case of negligence, the person in possession is liable for damages."
              ]
            }
          },
          {
            "title": {
              "urdu": "واپسی کا وجوب",
              "english": "Obligation of Return"
            },
            "content": {
              "urdu": [
                "لی گئی چیز کو اس کے اصل مالک تک پہنچانا شرعی فریضہ ہے۔",
                "جب تک چیز واپس نہ ہو، ذمہ داری ہاتھ سے ختم نہیں ہوتی۔",
                "یہ حکم معاشرے میں مالی حقوق کے تحفظ کو یقینی بناتا ہے۔"
              ],
              "english": [
                "Returning a borrowed or taken item to its owner is a religious duty.",
                "The liability does not end until the item is physically returned.",
                "This ruling ensures the protection of financial rights in society."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ضمانت اور تاوان کے اصول",
        "english": "Principles of Liability"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان کا ازالہ",
              "english": "Compensating for Loss"
            },
            "content": {
              "urdu": [
                "اگر لی گئی چیز ضائع ہو جائے تو اس کی قیمت ادا کرنا ہوگی۔",
                "حدیث 'علی الید' فقہ میں تاوان کے وجوب کی بڑی دلیل ہے۔",
                "یہ اصول چوری، غصب اور عاریت کے مسائل میں لاگو ہوتا ہے۔"
              ],
              "english": [
                "If the taken item is destroyed, its value must be paid back.",
                "The 'Ali al-Yad' principle is a major basis for liability in Fiqh.",
                "This rule applies to cases of theft, usurpation, and borrowing."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت اور ضمانت میں فرق",
              "english": "Difference between Trust and Liability"
            },
            "content": {
              "urdu": [
                "اگر چیز بطور امانت رکھی ہو اور بغیر کوتاہی ضائع ہو تو تاوان نہیں۔",
                "لیکن اگر چیز زبردستی یا عاریت پر لی گئی ہو تو ذمہ داری سخت ہے۔",
                "فقہاء اس حدیث کو 'یدِ ضمان' کے ثبوت کے لیے استعمال کرتے ہیں۔"
              ],
              "english": [
                "A trustee is not liable for loss occurring without their negligence.",
                "However, liability is strict if an item is taken by force or borrowed.",
                "Jurists use this Hadith to prove the concept of 'Hand of Liability'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قانونی و سماجی اہمیت",
        "english": "Legal and Social Importance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معاشی انصاف کا قیام",
              "english": "Establishing Economic Justice"
            },
            "content": {
              "urdu": [
                "یہ حدیث لوگوں کو دوسروں کا مال دبانے سے روکتی ہے۔",
                "مالی شفافیت اور جوابدہی اسلامی معاشرے کا بنیادی ستون ہے۔",
                "عدالتیں اس قاعدے کی بنیاد پر مالی تنازعات کا فیصلہ کرتی ہیں۔"
              ],
              "english": [
                "This Hadith prevents people from usurping the property of others.",
                "Financial transparency and accountability are pillars of an Islamic society.",
                "Courts use this rule as a basis to resolve financial disputes."
              ]
            }
          },
          {
            "title": {
              "urdu": "لوگوں کے مابین اعتماد",
              "english": "Trust Among People"
            },
            "content": {
              "urdu": [
                "جب لوگوں کو معلوم ہو کہ ان کا مال محفوظ ہے تو باہمی تعاون بڑھتا ہے۔",
                "قانون کی گرفت کا احساس بدنیتی کو ختم کرنے میں مدد دیتا ہے۔",
                "اسلامی تعلیمات لین دین میں سچائی اور دیانت کا درس دیتی ہیں۔"
              ],
              "english": [
                "Mutual cooperation increases when people know their property is secure.",
                "The fear of legal consequences helps eliminate malicious intent.",
                "Islamic teachings promote truthfulness and integrity in dealings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تحقیق و علمی نکات",
        "english": "Research and Scholarly Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کی علمی بحث",
              "english": "Scholarly Discussion on Chain"
            },
            "content": {
              "urdu": [
                "حسن بصری کا سمرہ سے سماع محدثین کے نزدیک اختلافی مسئلہ ہے۔",
                "اگرچہ سند ضعیف کہی گئی، مگر اس کا مفہوم دیگر نصوص سے ثابت ہے۔",
                "امام حاکم اور ترمذی نے اسے حسن و صحیح قرار دے کر قبول کیا ہے۔"
              ],
              "english": [
                "Hasan al-Basri's hearing from Samurah is a debated topic among scholars.",
                "Though the chain is called weak, its meaning is supported by other texts.",
                "Imams Al-Hakim and At-Tirmidhi accepted it as Hasan/Sahih."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اطلاق",
              "english": "Juristic Application"
            },
            "content": {
              "urdu": [
                "یہ حدیث فقہ کے مشہور قاعدے 'الغرم بالغنم' کی تائید کرتی ہے۔",
                "جو نفع کا حقدار ہے، اسے نقصان کا بوجھ بھی اٹھانا پڑتا ہے۔",
                "تعلیمی حلقوں میں اسے ذمہ داری کے ادراک کے لیے پڑھایا جاتا ہے۔"
              ],
              "english": [
                "This Hadith supports the famous maxim 'Loss follows gain'.",
                "Whoever is entitled to profit must also bear the potential loss.",
                "It is taught in educational circles to foster a sense of responsibility."
              ]
            }
          }
        ]
      }
    }
  ]
}