{
  "hadithId": 54,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 2 (Chapter 5)"],
    "kitabId": 1,
    "inKitabBab": 5,
    "arabicBook": "كتاب صفة المسح على الخفين",
    "babId": 5
  },

  "takhreej": {
    "arabic": " ضعيف.  رواه أبو داود (165) ، والترمذي (97) ، وابن ماجه (550)  وله عدة علل، وقد ضعفه جمع كثير من الأئمة. ",
    "urdu": "ضعیف (درجہ)۔ اسے ابوداؤد (165)، ترمذی (97)، اور ابن ماجہ (550) نے روایت کیا ہے۔ اس میں کئی علتیں ہیں اور اسے بہت سے ائمہ نے ضعیف قرار دیا ہے۔",
    "english": "Da'īf (Weak). Narrated by Abu Dawud (165), At-Tirmidhi (97), and Ibn Mājah (550). It has several flaws and has been deemed weak by a large number of Imāms."
  },
  "importantWords": [
    {
      "arabic": "مَسَحَ",
      "english": "Wiped",
      "urdu": "مسح کیا"
    },
    {
      "arabic": "أَعْلَى اَلْخُفِّ",
      "english": "Top of the Khuff",
      "urdu": "موزے کے اوپر"
    },
    {
      "arabic": "أَسْفَلَهُ",
      "english": "Its bottom/sole",
      "urdu": "نیچے"
    },
    {
      "arabic": "إِسْنَادِهِ",
      "english": "Its chain of narration",
      "urdu": "اس کی سند"
    },
    {
      "arabic": "ضَعْف ٌ",
      "english": "Weakness",
      "urdu": "ضعف"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث موزوں پر مسح کے طریقہ کار کے ایک ایسے پہلو کو بیان کرتی ہے جس میں موزوں کے اوپر اور نیچے دونوں طرف مسح کیا جاتا تھا، لیکن یہ طریقہ ضعیف سند سے مروی ہے اور صحیح سنت اس کے برعکس ہے۔",
    "english": "This Hadith describes a method of wiping over the Khuffayn where both the top and bottom surfaces are wiped. However, this method is conveyed through a weak chain, and the established, authentic Sunnah only mandates wiping the top surface."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الطهارة، رقم 165",
      "english": "Sunan Abī Dāwūd, The Book of Purification, Hadith 165"
    },
    {
      "arabic": "جامع الترمذي، كتاب الطهارة، رقم 97",
      "english": "Jami' At-Tirmidhi, The Book of Purification, Hadith 97"
    },
    {
      "arabic": "سنن ابن ماجه، كتاب الطهارة، رقم 550",
      "english": "Sunan Ibn Mājah, The Book of Purification, Hadith 550"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "اَلْمُغِيرَةِ بْنِ شُعْبَةَ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Al-Mughīrah ibn Shuʿbah (May Allah be pleased with him)"
      },
      "slug": "al-mughirah-ibn-shubah"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-32-wiping-top-and-bottom",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'īf (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "موزوں پر مسح کا صحیح طریقہ",
        "english": "The Authentic Method of Wiping Over Khuffayn"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعیف روایت پر عمل کی ممانعت",
              "english": "Prohibition of Acting on Weak Narration"
            },
            "content": {
              "urdu": [
                "یہ حدیث موزوں کے اوپر اور نیچے دونوں طرف مسح کرنے کا ذکر کرتی ہے، لیکن اس کی سند **ضعیف** ہے اور اسے ائمہ نے ناپسند کیا ہے۔",
                "نبی اکرم صلی اللہ علیہ وسلم سے **صحیح** احادیث میں صرف موزوں کے **اوپری حصے** پر مسح کرنا ثابت ہے، نہ کہ نیچے یا ایڑیوں پر۔",
                "چونکہ عبادت کے افعال (عبادات) میں ہمیشہ قوی ترین اور صحیح سنت پر عمل کیا جاتا ہے، لہٰذا اس روایت پر عمل کرنا درست نہیں۔"
              ],
              "english": [
                "This Hadith mentions wiping over both the top and the bottom of the socks, but its chain of narration is **weak** and has been rejected by many Imāms.",
                "The **authentic** Ahadith from the Prophet (ﷺ) only confirm wiping over the **upper surface** of the socks, and not the bottom or the heels.",
                "Since acts of worship (ʿIbādāt) must always be based on the strongest and most authentic Sunnah, acting upon this weak narration is incorrect."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح کا سنت طریقہ",
              "english": "The Sunnah Method of Wiping"
            },
            "content": {
              "urdu": [
                "موزوں پر مسح کا صحیح طریقہ یہ ہے کہ وضو کا پانی لے کر گیلی انگلیوں کو موزے کے **پنجے سے ٹخنے کی طرف** ایک بار گزارا جائے، اور یہ صرف اوپر کا حصہ ہو۔",
                "نیچے کے حصے کا مسح کرنے سے منع کیا گیا ہے کیونکہ نیچے کا حصہ زمین اور نجاست سے متصل رہتا ہے، جس سے اس کا فائدہ ختم ہو جاتا ہے۔",
                "یہ سنت اس بات کی دلیل ہے کہ اسلام آسانی پیدا کرتا ہے، لیکن وہ آسانی صرف اس حد تک ہے جہاں تک نبی اکرم ﷺ نے اجازت دی ہے۔"
              ],
              "english": [
                "The correct method of wiping is to take water for Wudu and pass the wet fingers **once from the toes toward the shins** over the upper surface of the sock only.",
                "Wiping the bottom part is prohibited because the sole is frequently in contact with the ground and impurities, thus negating the purpose of Mas'h.",
                "This Sunnah proves that Islam facilitates ease, but only to the extent explicitly permitted by the Prophet (ﷺ) himself."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی کمزوری کی وضاحت",
        "english": "Clarification on the Weakness of the Chain"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت میں علتیں",
              "english": "Flaws in the Narration"
            },
            "content": {
              "urdu": [
                "امام ابوداؤد، ترمذی اور ابن ماجہ نے اسے روایت کیا، لیکن اس کی سند میں راویوں کے ضعف اور دیگر **علتیں** موجود ہیں، جس سے یہ قابلِ استدلال نہیں رہی۔",
                "امام احمد سمیت کئی بڑے ائمہ حدیث نے اس روایت کو ضعیف قرار دیا، جو اس کے حکم کو ناقابل عمل بناتا ہے۔",
                "محدثین کا اس روایت کو ضعیف قرار دینا اس بات کی دلیل ہے کہ دین میں عبادت کے لیے صرف **صحیح** سنت پر عمل ہونا چاہیے۔"
              ],
              "english": [
                "Although narrated by Abu Dawud, At-Tirmidhi, and Ibn Mājah, the chain contains weaknesses and other **flaws (ʿilal)** in its narrators, making it unacceptable as a legal proof.",
                "Many prominent Imāms of Hadith, including Imām Ahmad, deemed this narration weak, which renders its ruling non-actionable.",
                "The judgment of Hadith scholars against this narration proves that only the **authentic** Sunnah must be followed in matters of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "قوی دلیل کی موجودگی",
              "english": "The Presence of Strong Evidence"
            },
            "content": {
              "urdu": [
                "مسح علی الخفین کے جواز پر بے شمار **صحیح** احادیث موجود ہیں جو اس عمل کو صرف موزے کے اوپر تک محدود کرتی ہیں۔",
                "چونکہ صحیح احادیث میں موزے کے نیچے مسح کا ذکر نہیں، لہٰذا اس کمزور روایت کو ترک کر کے قوی اور مستند سنت پر عمل کرنا ہی واجب ہے۔",
                "یہ اصول اس بات کو یقینی بناتا ہے کہ شرعی احکام ہمیشہ نبی ﷺ کے درست طریقے سے ثابت شدہ افعال پر مبنی ہوں۔"
              ],
              "english": [
                "There are numerous **authentic** Ahadith regarding the permissibility of Masḥ alā al-Khuffayn which limit the action to the upper surface of the socks.",
                "Since authentic Ahadith do not mention wiping the bottom, it is obligatory to abandon this weak narration and follow the strong, authenticated Sunnah.",
                "This principle ensures that all Islamic rulings are based on the correct and proven actions of the Prophet (ﷺ)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اثرات",
        "english": "Fiqh and Practical Implications"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح کی مقدار",
              "english": "The Extent of the Wipe"
            },
            "content": {
              "urdu": [
                "اس صحیح قاعدہ کے مطابق موزے کے نیچے یا ایڑیوں پر مسح کرنا نہ تو سنت ہے اور نہ ہی واجب، بلکہ یہ غلو (غلط زیادتی) ہے۔",
                "اگر کوئی شخص اس ضعیف روایت پر عمل کرتے ہوئے نیچے بھی مسح کرتا ہے تو اس نے سنت کی خلاف ورزی کی، اگرچہ اس کا وضو اوپر کے مسح کی وجہ سے صحیح ہو جائے گا۔",
                "مسح کا مقصد موزے کو دوبارہ پہننے میں آسانی پیدا کرنا ہے، جو صرف اوپری سطح پر مسح کرنے سے ہی پورا ہو جاتا ہے۔"
              ],
              "english": [
                "According to the authentic ruling, wiping the bottom or heels of the sock is neither Sunnah nor obligatory; rather, it is an excess (Ghulū) in the action.",
                "If someone acts on this weak narration and wipes the bottom, they have violated the Sunnah, although their Wudu may still be valid due to the wipe on the top.",
                "The purpose of wiping is to facilitate the continuation of wearing the socks, which is achieved solely by wiping the upper surface."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجماع کا دلالہ",
              "english": "Indication of Consensus"
            },
            "content": {
              "urdu": [
                "اہل سنت کے تمام فقہاء اس بات پر متفق ہیں کہ موزوں کے نیچے مسح کرنا سنت نہیں ہے، اور ان کا اجماع صحیح سنت کی ترجیح کو ثابت کرتا ہے۔",
                "اس ضعیف روایت کی وجہ سے چند فقہاء نے اس پر عمل کیا ہے، لیکن وہ قوی دلائل کے مقابلے میں نہیں ٹھہرتا۔",
                "مسلمان کو ہمیشہ وضو کی سنت کو آسانی اور اعتدال کے ساتھ ادا کرنا چاہیے اور غلو سے بچنا چاہیے۔"
              ],
              "english": [
                "All jurists of the Ahl as-Sunnah agree that wiping the bottom of the socks is not Sunnah, and their consensus confirms the precedence of the authentic Sunnah.",
                "A few jurists have acted upon this weak narration, but their view does not stand against the weight of the stronger evidence.",
                "A Muslim should always perform the Sunnah of Wudu with ease and moderation, and avoid extremism."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "راوی کا مقام اور حکم",
        "english": "Status of the Narrator and Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغیرہ بن شعبہؓ کی اصل روایت",
              "english": "The Authentic Narration of Mughīrah (RA)"
            },
            "content": {
              "urdu": [
                "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ ہی کی روایت سے مسح علی الخفین کا جواز ثابت ہوا ہے (جیسا کہ پچھلی حدیث میں ہے)، جو ایک قوی دلیل ہے۔",
                "یہ روایت (اوپر اور نیچے مسح والی) ان کی اصل صحیح روایت کے ساتھ ٹکراتی ہے، اس لیے اسے غلطی یا ضعیف تسلسل سمجھا جاتا ہے۔",
                "اس سے یہ سبق ملتا ہے کہ ایک ہی راوی کی روایت میں بھی صحت اور ضعف کا فرق ہو سکتا ہے، جس کے لیے علم حدیث ضروری ہے۔"
              ],
              "english": [
                "The permissibility of Masḥ alā al-Khuffayn itself is authenticated by the narration of Sayyiduna Mughīrah ibn Shuʿbah (RA) (as in the previous Hadith), which is a strong proof.",
                "This narration (wiping top and bottom) conflicts with his own authentic narration, so it is considered a mistake or a weak continuation.",
                "This teaches that even narrations from the same Companion can differ in authenticity, underscoring the necessity of Hadith sciences (ʿIlm al-Ḥadīth)."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا مقصد",
              "english": "The Prophet's Intention"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم کا مقصد امت کے لیے آسانی پیدا کرنا تھا، اور موزوں کو اتارنے کی مشقت سے بچانا تھا، نہ کہ موزوں کو مکمل دھونے کے برابر مسح کرنا۔",
                "صرف اوپر مسح کرنا ہی رخصت کو مکمل کرتا ہے، اور نیچے مسح کرنا غیر ضروری مشقت ہے جو شریعت کا مقصد نہیں۔",
                "لہٰذا، اس حکم پر عمل نہ کرنا اور صرف اوپر مسح کرنا ہی عین سنت اور شریعت کی آسانی کے مطابق ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) intention was to bring ease to the Ummah and relieve the hardship of removing the socks, not to mandate wiping the socks as comprehensively as washing the feet.",
                "Wiping only the top fulfills the concession, and wiping the bottom is an unnecessary hardship that is not the goal of the Sharia.",
                "Therefore, rejecting this ruling and only wiping the top is in precise alignment with the Sunnah and the ease of Islamic Law."
              ]
            }
          }
        ]
      }
    }
  ]
}
