{
  "hadithId": 865,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/51"],
    "kitabId": 8,
    "inKitabBab": 2,
    "arabicBook": "كتاب النكاح",
    "babId": 65
  },
 
  "takhreej": {
    "arabic": "ضعيف . رواه مالك في الموطأ (2/526) وسعيد بن منصور (818) وابن أبي شيبة (175/4). رجاله ثقات لكنه منقطع بين سعيد بن المسيب وعمر بن الخطاب.",
    "urdu": "یہ روایت ضعیف ہے کیونکہ سعید بن مسیب اور عمر بن خطاب کے درمیان انقطاع ہے۔ اگرچہ راوی ثقہ ہیں، مگر سند متصل نہیں ہے۔ سیدنا علی سے مروی اضافہ بھی منقطع ہونے کی وجہ سے ضعیف ہے۔",
    "english": "Weak. Reported by Malik in al-Muwatta, Sa'id bin Mansur, and Ibn Abi Shaybah. Its narrators are reliable, but the chain is broken (Munqati') between Sa'id bin al-Musayyab and 'Umar."
  },
  "importantWords": [
    {
      "arabic": "بَرْصَاءَ",
      "english": "Leucoderma / Vitiligo",
      "urdu": "پھلبہری / سفید داغ"
    },
    {
      "arabic": "مَجْنُونَةً",
      "english": "Insane / Mad",
      "urdu": "دیوانی / پاگل"
    },
    {
      "arabic": "مَجْذُومَةً",
      "english": "Leprous",
      "urdu": "کوڑھ کی مریضہ"
    },
    {
      "arabic": "الصَّدَاقُ",
      "english": "Dower / Mahr",
      "urdu": "حق مہر"
    },
    {
      "arabic": "غَرَّهُ",
      "english": "Deceived him",
      "urdu": "اسے دھوکہ دیا"
    }
  ],
  "summary": {
    "urdu": "نکاح میں عیوب چھپانا دھوکہ دہی ہے؛ اگر ہمبستری کے بعد عیب ظاہر ہو تو عورت مہر کی مستحق ہوگی مگر شوہر دھوکہ دینے والے سے ہرجانہ لے سکتا ہے۔",
    "english": "Hiding defects in marriage is deception; if defects appear after consummation, the wife keeps the dower, but the husband can recover it from the deceiver."
  },
  "references": [
    {
      "arabic": "موطأ مالك (2/526)",
      "english": "Muwatta Malik (2/526)"
    },
    {
      "arabic": "مصنف ابن أبي شيبة (17175)",
      "english": "Musannaf Ibn Abi Shaybah (17175)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سعيد بن المسيب",
        "english": "Sa'id bin al-Musayyab"
      },
      "slug": "said-bin-al-musayyab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R3L0f6LpB3M",
  "grade": {
    "arabic": "ضعيف (منقطع)",
    "english": "Weak (Disconnected chain)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نکاح میں شفافیت کی اہمیت",
        "english": "Importance of Transparency in Marriage"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عیوب کا ظاہر کرنا",
              "english": "Disclosure of Defects"
            },
            "content": {
              "urdu": [
                "نکاح کی بنیاد سچائی اور باہمی اعتماد پر ہونی چاہیے تاکہ مستقبل میں تنازعات نہ ہوں۔",
                "ایسے امراض جو ازدواجی حقوق کی ادائیگی میں رکاوٹ بنیں، ان کا بتانا شرعاً واجب ہے۔",
                "عیب چھپا کر نکاح کرنا دھوکہ دہی ہے جسے اسلام نے سخت ناپسند کیا ہے۔"
              ],
              "english": [
                "Marriage should be based on honesty and mutual trust to prevent future conflicts.",
                "Diseases that hinder the fulfillment of marital rights must be disclosed legally.",
                "Contracting a marriage while hiding defects is a form of deception disliked in Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "دھوکہ دہی کا تدارک",
              "english": "Remedy for Deception"
            },
            "content": {
              "urdu": [
                "اگر ولی نے عیب چھپایا تو وہ اس دھوکہ دہی کا ذمہ دار ٹھہرایا جائے گا۔",
                "اسلامی قانون مظلوم فریق کو یہ حق دیتا ہے کہ وہ اپنے نقصان کا ازالہ کرے۔",
                "حقائق چھپا کر رشتہ طے کرنا معاشرتی اور خاندانی بگاڑ کا سبب بنتا ہے۔"
              ],
              "english": [
                "If the guardian hides a defect, they are held responsible for the deception.",
                "Islamic law grants the aggrieved party the right to seek compensation for loss.",
                "Settling a proposal by hiding facts causes social and familial disruption."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مہر اور دخول کے احکام",
        "english": "Rulings on Mahr and Consummation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مہر کی حقدار ہونا",
              "english": "Entitlement to Dower"
            },
            "content": {
              "urdu": [
                "ہمبستری (دخول) کے بعد عورت پورے مہر کی مستحق ہو جاتی ہے خواہ نکاح فسخ ہو۔",
                "یہ مہر عورت کی شرمگاہ کو حلال کرنے اور اس کی حرمت کے بدلے میں ہے۔",
                "عیب کی بنیاد پر علیحدگی کی صورت میں بھی عورت کا مالی حق ضائع نہیں کیا جائے گا۔"
              ],
              "english": [
                "After intercourse, the woman is entitled to the full dower even if the marriage is annulled.",
                "The dower serves as compensation for making the private parts lawful and her dignity.",
                "Even in case of separation due to defects, the woman's financial right is not forfeited."
              ]
            }
          },
          {
            "title": {
              "urdu": "رجوع کا حق",
              "english": "Right of Recourse"
            },
            "content": {
              "urdu": [
                "شوہر یہ مہر اس شخص سے واپس لینے کا حق رکھتا ہے جس نے اسے دھوکے میں رکھا۔",
                "اگر عورت نے خود عیب چھپایا تو وہ مہر کی واپسی کی ذمہ دار ہو سکتی ہے۔",
                "یہ اصول عدل و انصاف کی فراہمی اور مالی نقصان سے بچنے کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "The husband has the right to recover the dower from the person who deceived him.",
                "If the woman herself hid the defect, she might be responsible for returning it.",
                "This principle is established to ensure justice and prevent unfair financial loss."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فسخِ نکاح کا حق (خیار)",
        "english": "Right to Annulment (Khiyar)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شوہر کا اختیار",
              "english": "Husband's Option"
            },
            "content": {
              "urdu": [
                "بڑے عیوب (جنون، برص، جذام) کی موجودگی میں شوہر کو نکاح ختم کرنے کا حق ہے۔",
                "سیدنا علی کی روایت کے مطابق 'قرن' (زنانہ رکاوٹ) بھی اسی زمرے میں آتا ہے۔",
                "عیب معلوم ہوتے ہی فوری طور پر فیصلے کا حق استعمال کرنا ضروری ہوتا ہے۔"
              ],
              "english": [
                "The husband has the right to annul the marriage if major defects like insanity are found.",
                "According to Ali (RA), physical obstructions (Qaran) also fall under this category.",
                "The right to choose must be exercised promptly upon discovering the defect."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی بنیادوں پر علیحدگی",
              "english": "Separation on Medical Grounds"
            },
            "content": {
              "urdu": [
                "اسلامی فقہ میں طبی عیوب کو علیحدگی کی معقول وجہ تسلیم کیا گیا ہے۔",
                "اس کا مقصد فریقین کو ایسی زندگی سے بچانا ہے جو تکلیف دہ یا نفرت کا باعث ہو۔",
                "جدید دور میں جینیاتی یا متعدی امراض پر بھی فقہاء اسی سے استدلال کرتے ہیں۔"
              ],
              "english": [
                "Islamic jurisprudence recognizes medical defects as valid grounds for separation.",
                "The goal is to prevent a life filled with distress or physical aversion between spouses.",
                "Modern jurists use this logic for genetic or infectious diseases as well."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امانتداری اور ذمہ داری",
              "english": "Honesty and Responsibility"
            },
            "content": {
              "urdu": [
                "رشتہ طے کرنے والوں (بچوں کے والدین) پر بھاری ذمہ داری عائد ہوتی ہے۔",
                "جھوٹ بول کر رشتہ کرنا گناہِ کبیرہ ہے اور دنیاوی سزا کا بھی باعث ہے۔",
                "نبی کریم ﷺ کے دور اور صحابہ کے فیصلوں میں حق گوئی کی ہمیشہ تاکید کی گئی۔"
              ],
              "english": [
                "A heavy responsibility lies on those settling proposals (parents/guardians).",
                "Marrying through lies is a major sin and leads to worldly legal consequences.",
                "Prophetic eras and Sahaba rulings always emphasized speaking the truth in proposals."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلفائے راشدین کی سنت",
              "english": "Sunnah of the Righteous Caliphs"
            },
            "content": {
              "urdu": [
                "سیدنا عمر اور سیدنا علی کے یہ فیصلے فقہ اسلامی کے اہم ماخذ ہیں۔",
                "خلفائے راشدین نے معاشرتی مسائل کو عدل و انصاف کی بنیاد پر حل کیا۔",
                "ہمیں پیچیدہ گھریلو معاملات میں ان کے فیصلوں سے رہنمائی لینی چاہیے۔"
              ],
              "english": [
                "These rulings of Umar and Ali are vital sources for Islamic jurisprudence.",
                "The Righteous Caliphs resolved social issues based on absolute fairness.",
                "We should seek guidance from their verdicts in complex domestic matters."
              ]
            }
          }
        ]
      }
    }
  ]
}