{
  "hadithId": 218,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
 
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواية عبادة عند البخاري في كتاب الأذان، باب وجوب القراءة للإمام والمأموم في الصلوات كلها (756)، ومسلم في كتاب الصلاة (394). والزيادة (لا تجزئ صلاة...) رواها الدارقطني (1/321) بسند صحيح. وزيادة (إلا بفاتحة الكتاب...) رواها أبو داود (823) والترمذي (311) وحسنه.",
    "urdu": "صحیح متفق علیہ۔ عبادہ کی روایت بخاری میں کتاب الأذان (756) اور مسلم میں کتاب الصلاة (394) میں ہے۔ اضافی الفاظ (لا تجزئ صلاة...) کو دارقطنی (1/321) نے صحیح سند کے ساتھ روایت کیا ہے۔ اور (إلا بفاتحة الکتاب...) والی روایت کو ابو داؤد (823) اور ترمذی (311) نے روایت کر کے حسن قرار دیا ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). 'Ubādah's narration is in Al-Bukhari (756) and Muslim (394). The addition ('Lā tajzī ṣalāh...') is reported by Ad-Dāraquṭnī (1/321) with an authentic chain. The narration ('Illā bi-Fātiḥati-l-Kitāb...') is reported by Abu Dawud (823) and At-Tirmidhi (311) who graded it Hasan (Good)."
  },
  "importantWords": [
    {
      "arabic": "لَا صَلَاةَ",
      "english": "There is no prayer",
      "urdu": "کوئی نماز نہیں"
    },
    {
      "arabic": "لِمَنْ لَمْ يَقْرَأْ",
      "english": "For one who does not recite",
      "urdu": "جس نے نہ پڑھی"
    },
    {
      "arabic": "بِأُمِّ الْقُرْآنِ",
      "english": "Umm Al-Qur'ān (Mother of the Qur'an)",
      "urdu": "ام القرآن (سورۃ فاتحہ)"
    },
    {
      "arabic": "لَا تَجْزِي",
      "english": "Is not sufficient/valid",
      "urdu": "کافی نہیں/قبول نہیں"
    },
    {
      "arabic": "خَلْفَ إِمَامِكُمْ",
      "english": "Behind your Imām",
      "urdu": "اپنے امام کے پیچھے"
    },
    {
      "arabic": "إِلَّا بِفَاتِحَةِ الْكِتَابِ",
      "english": "Except with Al-Fātiḥah of the Book",
      "urdu": "سوائے سورۃ فاتحہ کے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس فقہی اصول کی بنیاد ہے کہ نماز کی ہر رکعت میں سورۃ فاتحہ کی تلاوت کرنا ایک فرض رکن ہے۔ نبی صلی اللہ علیہ وسلم نے واضح فرمایا کہ سورۃ فاتحہ کے بغیر کوئی نماز مکمل یا کافی نہیں ہوتی، اور یہ حکم امام کے پیچھے نماز پڑھنے والے مقتدی پر بھی لاگو ہوتا ہے، جس سے معلوم ہوتا ہے کہ مقتدی کو بھی جہری اور سِری (بلند آواز والی اور آہستہ آواز والی) دونوں نمازوں میں سورۃ فاتحہ پڑھنی چاہیے۔",
    "english": "This Hadith forms the basis of the juristic principle that reciting Surah Al-Fatihah in every Rak'ah is an obligatory pillar of the prayer. The Prophet (PBUH) clearly stated that no prayer is complete or sufficient without Al-Fātihah. This ruling also applies to the follower (Ma'mūm) praying behind an Imām, indicating that the follower must recite Al-Fātiḥah in both loud and silent prayers."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأذان، باب وجوب القراءة للإمام والمأموم في الصلوات كلها (756)",
      "english": "Sahih Al-Bukhari, Book of Adhan, Chapter: Obligation of recitation for the Imām and the follower in all prayers (756)"
    },
    {
      "arabic": "صحيح مسلم، كتاب الصلاة، باب وجوب قراءة الفاتحة في كل ركعة (394)",
      "english": "Sahih Muslim, Book of Prayer, Chapter: Obligation of reciting Al-Fātiḥah in every Rak'ah (394)"
    },
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب من ترك القراءة في صلاته (823)",
      "english": "Sunan Abu Dawud, Book of Prayer, Chapter: One who omits recitation in his prayer (823)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبادة بن الصامت",
        "english": "'Ubādah ibn Al-Ṣāmit"
      },
      "slug": "ubadah-ibn-al-samit"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قراءتِ فاتحہ کا وجوب",
        "english": "Obligation of Reciting Al-Fātiḥah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فریضہ اور اس کا حکم",
              "english": "Obligation and its Ruling"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کا قول 'لا صلاة لمن لم يقرأ...' سورۃ فاتحہ کی قراءت کو نماز کے بنیادی رکن کی حیثیت دیتا ہے۔",
                "لفظ 'لا صلاة' (کوئی نماز نہیں) سے مراد یہ ہے کہ ایسی نماز شرعی طور پر مقبول نہیں ہوتی اور دوبارہ پڑھنی لازم ہے۔",
                "یہ حکم ہر رکعت کے لیے ہے، جیسا کہ دیگر احادیث میں 'ہر رکعت میں' کا لفظ صریحاً موجود ہے۔"
              ],
              "english": [
                "The Prophet's statement 'Lā ṣalāta li-man lam yaqra...' establishes the recitation of Al-Fātiḥah as a fundamental pillar of the prayer.",
                "The phrase 'Lā ṣalāta' means the prayer is not legally acceptable and must be repeated.",
                "This ruling applies to every Rak'ah, as explicitly mentioned in other Hadiths ('in every Rak'ah')."
              ]
            }
          },
          {
            "title": {
              "urdu": "امّ القرآن کا مقام",
              "english": "Status of Umm Al-Qur'ān"
            },
            "content": {
              "urdu": [
                "سورۃ فاتحہ کو 'ام القرآن' (قرآن کی ماں) یا 'فاتحة الكتاب' (کتاب کا آغاز) کہا جاتا ہے۔",
                "یہ سورۃ توحید، حمد، رہنمائی کی طلب اور آخرت کے اقرار کا ایک مکمل خلاصہ ہے۔",
                "یہ اس بات کی دلیل ہے کہ کوئی نماز اللہ کے حضور اس عظیم دعا کے بغیر مکمل نہیں ہو سکتی۔"
              ],
              "english": [
                "Surah Al-Fātiḥah is called 'Umm Al-Qur'ān' (Mother of the Qur'an) or 'Fātiḥatu-l-Kitāb' (Opening of the Book).",
                "This Surah is a complete summary of Tawheed, praise, seeking guidance, and affirmation of the Hereafter.",
                "It proves that no prayer can be complete before Allah without this magnificent supplication."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مقتدی پر قراءت کا حکم",
        "english": "Ruling on Recitation for the Follower (Ma'mūm)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام کے پیچھے قراءت",
              "english": "Recitation Behind the Imām"
            },
            "content": {
              "urdu": [
                "حدیث کی تیسری روایت مقتدیوں کو امام کے پیچھے سورۃ فاتحہ کے علاوہ دیگر سورتیں پڑھنے سے منع کرتی ہے۔",
                "اس سے یہ اصول اخذ ہوتا ہے کہ مقتدی پر صرف سورۃ فاتحہ پڑھنا فرض ہے، باقی سورتیں نہیں۔",
                "صحابی کا سوال اور نبی کا جواب یہ بتاتا ہے کہ یہ حکم جہری (بلند آواز والی) اور سری (آہستہ آواز والی) دونوں نمازوں پر لاگو ہے۔"
              ],
              "english": [
                "The third narration prohibits followers from reciting anything other than Al-Fātiḥah behind the Imām.",
                "This establishes the principle that reciting only Al-Fātiḥah is obligatory for the follower, but not additional Surahs.",
                "The Companion's question and the Prophet's reply indicate that this ruling applies to both loud (Jahriyyah) and silent (Sirriyyah) prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف کی وضاحت",
              "english": "Clarification of Juristic Difference"
            },
            "content": {
              "urdu": [
                "امام ابو حنیفہؒ اور دیگر کا مؤقف ہے کہ مقتدی امام کے پیچھے بالکل خاموش رہے، جس میں اختلاف ہے۔",
                "لیکن شافعیؒ اور احمدؒ سمیت کئی ائمہ کا مؤقف اس حدیث پر ہے کہ فاتحہ مقتدی پر بھی فرض ہے۔",
                "مسنون طریقہ یہی ہے کہ مقتدی آہستہ آواز میں سورۃ فاتحہ کو ضرور پڑھے تاکہ نماز مکمل ہو۔"
              ],
              "english": [
                "Imam Abu Hanifah (RA) and others hold the view that the follower should remain completely silent behind the Imām, which is a point of contention.",
                "However, many Imāms, including Ash-Shāfi'ī and Ahmad (RA), base their stance on this Hadith that Al-Fātiḥah is obligatory even for the follower.",
                "The Sunnah method is for the follower to recite Al-Fātiḥah silently to complete their prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی سبق",
        "english": "Spiritual and Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں خلوص",
              "english": "Sincerity in Worship"
            },
            "content": {
              "urdu": [
                "فاتحہ کا پڑھنا نماز کی قبولیت کے لیے ضروری ہے کیونکہ یہ اللہ کی حمد و ثناء کا اظہار ہے۔",
                "مقتدی کے لیے قراءت کرنا اس بات کی دلیل ہے کہ نماز میں ہر فرد کی ذاتی عبادت کا حصہ ہوتا ہے۔",
                "نمازی کو یہ یاد رکھنا چاہیے کہ وہ اللہ سے براہ راست مخاطب ہے، اس لیے قراءت میں اخلاص ہو۔"
              ],
              "english": [
                "Reciting Al-Fātiḥah is necessary for the prayer's acceptance as it is an expression of praise to Allah.",
                "The recitation by the follower proves that every individual's prayer has a personal worship component.",
                "The worshipper must remember that they are addressing Allah directly, necessitating sincerity in recitation."
              ]
            }
          },
          {
            "title": {
              "urdu": "پابندی کا حکم",
              "english": "Command for Adherence"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کا اس قدر واضح اور سخت حکم دینا، اس رکن کی عظیم اہمیت کو ظاہر کرتا ہے۔",
                "نماز کی صحت کا انحصار اس بات پر ہے کہ ہر مسلمان ہر رکعت میں سورۃ فاتحہ کو ادا کرے۔",
                "یہ ہمیں سکھاتا ہے کہ سنت کی پیروی میں کوئی کمی نہیں ہونی چاہیے، خاص طور پر فرائض میں۔"
              ],
              "english": [
                "The Prophet's clear and strict command shows the immense importance of this pillar.",
                "The validity of the prayer depends on every Muslim reciting Surah Al-Fātiḥah in every Rak'ah.",
                "This teaches us that there should be no deficiency in following the Sunnah, especially concerning obligations."
              ]
            }
          }
        ]
      }
    }
  ]
}
