{
  "hadithId": 1027,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1177"],
    "kitabId": 9,
    "inKitabBab": 5,
    "arabicBook": "بلوغ المرام",
    "babId": 83
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (4771)، والنسائي (4081)، والترمذي (1418) وقال: حديث حسن صحيح. وأصله في الصحيحين: البخاري (2480) ومسلم (141).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد (4771)، نسائی (4081) اور ترمذی (1418) نے روایت کیا ہے اور ترمذی نے اسے حسن صحیح کہا ہے۔ اس کی اصل بخاری (2480) اور مسلم (141) میں بھی موجود ہے۔",
    "english": "Sahih (Authentic). Reported by Abu Dawud (4771), An-Nasa'i (4081), and At-Tirmidhi (1418), who graded it Hasan Sahih. Its origin is in Bukhari (2480) and Muslim (141)."
  },
  "importantWords": [
    {
      "arabic": "قُتِلَ",
      "english": "Killed",
      "urdu": "قتل کیا گیا"
    },
    {
      "arabic": "دُونَ",
      "english": "In defense of / Protecting",
      "urdu": "کی حفاظت میں"
    },
    {
      "arabic": "مَالِهِ",
      "english": "His property",
      "urdu": "اس کا مال"
    },
    {
      "arabic": "شَهِيدٌ",
      "english": "Martyr",
      "urdu": "شہید"
    },
    {
      "arabic": "أَرَادَ",
      "english": "Desired / Intended",
      "urdu": "ارادہ کیا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں اپنے مال و متاع کو چوروں اور ڈاکوؤں سے بچانے کے حق کو تسلیم کیا گیا ہے اور اس دوران جان دینے والے کو شہادت کا رتبہ دیا گیا ہے۔",
    "english": "This Hadith recognizes the right to defend one's property against theft and robbery, granting the status of a martyr to those who die while doing so."
  },
  "references": [
    {
      "arabic": "سنن الترمذي (1418)",
      "english": "Sunan At-Tirmidhi (1418)"
    },
    {
      "arabic": "صحيح البخاري (2480)",
      "english": "Sahih al-Bukhari (2480)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمرو بن العاص",
        "english": "Abdullah bin Amr bin al-As"
      },
      "slug": "abdullah-bin-amr-bin-al-as"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-P3g4T89k",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دفاعِ مال کا حق",
        "english": "The Right to Defend Property"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی تحفظ",
              "english": "Shariah Protection"
            },
            "content": {
              "urdu": [
                "اسلام میں انسان کی جان کی طرح اس کے مال کی حرمت کو بھی تسلیم کیا گیا ہے۔",
                "اگر کوئی ڈاکو یا چور کسی کا مال زبردستی چھیننا چاہے تو اسے روکنا جائز ہے۔",
                "مومن کو اپنے حلال مال کی حفاظت کے لیے مزاحمت کرنے کی ہمت دی گئی ہے۔"
              ],
              "english": [
                "Islam recognizes the sanctity of a person's property just as it does their life.",
                "It is permissible to stop a robber or thief who tries to take property by force.",
                "A believer is encouraged to resist in order to protect their lawfully earned wealth."
              ]
            }
          },
          {
            "title": {
              "urdu": "شہادت کا رتبہ",
              "english": "Status of Martyrdom"
            },
            "content": {
              "urdu": [
                "اپنے جائز حق کے لیے لڑتے ہوئے جان دینا اللہ کے ہاں بہت بڑا عمل ہے۔",
                "ایسے شخص کو 'شہیدِ آخرت' کہا جاتا ہے جسے ثواب شہیدوں والا ملتا ہے۔",
                "یہ حکم ظاہر کرتا ہے کہ اسلام بزدلی کے بجائے غیرت اور دفاع سکھاتا ہے۔"
              ],
              "english": [
                "Giving one's life while fighting for a legitimate right is a great deed before Allah.",
                "Such a person is called a 'Martyr of the Hereafter' and receives the reward of martyrs.",
                "This ruling shows that Islam teaches courage and self-defense rather than cowardice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دفاع کے آداب و شرائط",
        "english": "Etiquettes and Conditions of Defense"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تدریجی دفاع",
              "english": "Gradual Defense"
            },
            "content": {
              "urdu": [
                "دفاع میں پہلے کم سے کم طاقت استعمال کرنے کی کوشش کرنی چاہیے۔",
                "اگر ڈرانے یا معمولی چوٹ سے کام چل جائے تو جان لینا جائز نہیں ہے۔",
                "مگر جہاں جان یا مال کا قطعی خطرہ ہو، وہاں لڑائی کی اجازت دی گئی ہے۔"
              ],
              "english": [
                "In defense, one should initially attempt to use the minimum force necessary.",
                "If scaring off or a minor injury suffices, taking a life is not permissible.",
                "However, where there is a definitive threat to life or property, fighting is allowed."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظالم کا انجام",
              "english": "The Fate of the Aggressor"
            },
            "content": {
              "urdu": [
                "اگر دفاع کے دوران حملہ آور مارا جائے تو مدافع پر کوئی گناہ نہیں ہوتا۔",
                "ایسی صورت میں حملہ آور کا خون 'رائگاں' (ہدر) سمجھا جاتا ہے، یعنی قصاص نہیں۔",
                "یہ اصول مجرموں کے دل میں خوف پیدا کرنے کے لیے وضع کیا گیا ہے۔"
              ],
              "english": [
                "If the aggressor is killed during the defense, the defender bears no sin.",
                "In such a case, the aggressor's blood is considered 'Hadar' (uncompensated).",
                "This principle is established to instill fear in the hearts of criminals."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی امن پر اثرات",
        "english": "Impact on Social Peace"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جرائم کی روک تھام",
              "english": "Deterrence of Crimes"
            },
            "content": {
              "urdu": [
                "جب چور کو معلوم ہو کہ مالک کو لڑنے کی اجازت ہے، تو وہ باز رہے گا۔",
                "یہ قانون معاشرے میں ڈکیتی اور چھینا جھپٹی کے خلاف ایک نفسیاتی رکاوٹ ہے۔",
                "عوامی املاک اور ذاتی مال کی حفاظت سے معاشی استحکام آتا ہے۔"
              ],
              "english": [
                "When a thief knows the owner is allowed to fight back, they are deterred.",
                "This law acts as a psychological barrier against robbery and mugging in society.",
                "Protecting public and private property leads to economic stability."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقِ ملکیت کی اہمیت",
              "english": "Importance of Ownership Rights"
            },
            "content": {
              "urdu": [
                "اسلامی قانون میں نجی ملکیت کو مقدس مانا گیا ہے۔",
                "مال کی حفاظت درحقیقت خاندان کی کفالت اور مستقبل کا تحفظ ہے۔",
                "یہ حدیث واضح کرتی ہے کہ مال صرف مادی چیز نہیں بلکہ ایک ذمہ داری ہے۔"
              ],
              "english": [
                "Private property is considered sacred in Islamic law.",
                "Protecting property is, in reality, protecting the family's sustenance and future.",
                "This Hadith clarifies that wealth is not just a material object but a responsibility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و اخلاقی سبق",
        "english": "Educational and Moral Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایمانی غیرت",
              "english": "Faith-based Honor"
            },
            "content": {
              "urdu": [
                "مسلمان کو بزدل نہیں ہونا چاہیے بلکہ اپنے حقوق کے لیے کھڑا ہونا چاہیے۔",
                "ظلم کے سامنے جھکنا اسلام کی تعلیمات کے خلاف ہے۔",
                "شہادت کا شوق مومن کو دنیاوی خوف سے آزاد کر دیتا ہے۔"
              ],
              "english": [
                "A Muslim should not be a coward but should stand up for their rights.",
                "Bowing before oppression is contrary to the teachings of Islam.",
                "The desire for martyrdom frees a believer from worldly fears."
              ]
            }
          },
          {
            "title": {
              "urdu": "عفو و درگزر کی گنجائش",
              "english": "Room for Forgiveness"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص اپنے مال سے دستبردار ہو کر فتنہ ختم کرنا چاہے تو یہ بھی جائز ہے۔",
                "جان کی قیمت مال سے زیادہ ہے، اس لیے حکمتِ عملی سے کام لینا ضروری ہے۔",
                "شریعت نے حق دیا ہے، مگر حالات کے مطابق بہترین فیصلہ کرنے کی فہم بھی دی ہے۔"
              ],
              "english": [
                "If a person chooses to let go of property to end strife, that is also permissible.",
                "Life is more valuable than property, so employing wisdom is essential.",
                "Shariah grants the right, but also the intellect to make the best decision per circumstances."
              ]
            }
          }
        ]
      }
    }
  ]
}