{
  "hadithId": 80,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["bukhari:363", "muslim:274c"],
    "kitabId": 1,
    "inKitabBab": 7,
    "arabicBook": "كتاب آداب الخلاء",
    "babId": 7
  },

  "takhreej": {
    "arabic": " صحيح. رواه البخاري (363) ، ومسلم (274) (77) . ",
    "urdu": "یہ حدیث **صحیح** ہے۔ اسے بخاری (363) اور مسلم (274، 77) نے روایت کیا ہے۔ یہ اسلام کی متفقہ احادیث میں سے ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (363) and Muslim (274) (77). This is one of the firmly established and agreed-upon Ahadith in Islamic jurisprudence."
  },
  "importantWords": [
    {
      "arabic": "خُذِ",
      "english": "Take / Carry",
      "urdu": "لے چلو / پکڑو"
    },
    {
      "arabic": "اَلْإِدَاوَةَ",
      "english": "Small leather water vessel",
      "urdu": "پانی کا برتن / چمڑے کا چھوٹا ڈول"
    },
    {
      "arabic": "فَانْطَلَقَ",
      "english": "He went away / proceeded",
      "urdu": "تشریف لے گئے"
    },
    {
      "arabic": "تَوَارَى",
      "english": "He was hidden / concealed",
      "urdu": "او جھل ہو گئے"
    },
    {
      "arabic": "عَنِّي",
      "english": "From me",
      "urdu": "میری نظر سے"
    },
    {
      "arabic": "قَضَى",
      "english": "He fulfilled / completed",
      "urdu": "فارغ ہوئے"
    },
    {
      "arabic": "حَاجَتَهُ",
      "english": "His need (relieving himself)",
      "urdu": "قضائے حاجت"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْه",
      "english": "Agreed upon (Bukhari & Muslim)",
      "urdu": "متفق علیہ"
    },
    {
      "arabic": "سَتْر",
      "english": "Covering / Privacy",
      "urdu": "پردہ"
    },
    {
      "arabic": "اَلْخَلَاء",
      "english": "Lavatory / Open ground",
      "urdu": "بیت الخلاء"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قضائے حاجت کے آداب میں **پردہ پوشی** کی اہمیت کو واضح کرتی ہے کہ نبی صلی اللہ علیہ وسلم لوگوں کی نگاہوں سے مکمل طور پر اوجھل ہو کر حاجت رفع فرماتے تھے، اور استنجاء کے لیے پانی کا انتظام پہلے ہی کر لیتے تھے۔",
    "english": "This Hadith clarifies the importance of **privacy (Sitr)** in the etiquette of answering the call of nature. The Prophet (PBUH) would go far enough to be completely hidden from sight and ensured that water for cleansing (Istinja') was ready beforehand."
  },
  "references": [
    {
      "arabic": "رواه البخاري (363)",
      "english": "Reported by Al-Bukhari (No. 363)"
    },
    {
      "arabic": "رواه مسلم (274)",
      "english": "Reported by Muslim (No. 274)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "اَلْمُغِيرَةِ بْنِ شُعْبَةَ  - رضى الله عنه",
        "english": "Al-Mughirah ibn Shu’bah (May Allah be pleased with him)"
      },
      "slug": "al-mughirah-ibn-shubah"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih Muttafaq Alayh (Agreed upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پردہ داری اور تنہائی کا اصول",
        "english": "The Principle of Privacy and Seclusion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظروں سے اوجھل ہونا",
              "english": "Being Hidden from Sight"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم کا قضائے حاجت کے لیے اتنی دور جانا کہ آپ صلی اللہ علیہ وسلم صحابی کی نظروں سے اوجھل ہو جائیں، **کامل پردہ داری** کی سنت ہے۔",
                "یہ حکم صرف کپڑے سے پردہ کرنے تک محدود نہیں، بلکہ لوگوں کی نظروں اور قیاس آرائیوں سے بھی دور رہنا شامل ہے۔",
                "شریعت میں عفت، حیا اور پردہ داری کی اہمیت بہت زیادہ ہے، اور اسے رفع حاجت جیسے نجی امور میں بھی لازم کیا گیا ہے۔"
              ],
              "english": [
                "The Prophet's (PBUH) act of going far enough to be hidden from the Companion's sight establishes the Sunnah of **complete privacy** (Sitr).",
                "This ruling is not limited to mere clothing cover but extends to keeping oneself hidden from the sight and conjecture of others.",
                "In Shariah, modesty (Haya), chastity, and privacy hold immense importance, and they are mandated even in private matters like relieving oneself."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھلی جگہ میں ادب",
              "english": "Etiquette in Open Spaces"
            },
            "content": {
              "urdu": [
                "یہ واقعہ اس صورت حال کے لیے رہنما ہے جب بیت الخلاء موجود نہ ہو (جیسے سفر یا کھلے میدان میں)۔",
                "ایسی صورت میں، مسلمان کے لیے ضروری ہے کہ وہ کسی **آڑ (جیسے ٹیلے، درخت یا دیوار)** کا استعمال کرے یا کافی دور چلا جائے۔ ",
                "یہ آداب اس بات کی ضمانت دیتے ہیں کہ ایک مسلمان کا نجی فعل کسی دوسرے انسان کے لیے ناگواری کا سبب نہ بنے۔"
              ],
              "english": [
                "This incident provides guidance for situations where a dedicated lavatory is unavailable (such as during travel or in an open field).",
                "In such cases, it is mandatory for a Muslim to use a **barrier (e.g., a mound, tree, or wall)** or move far away until out of sight.",
                "These manners ensure that a Muslim's private action does not cause offense or discomfort to any other person."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "طہارت کا انتظام اور فقہی حکمت",
        "english": "Arrangement for Purity and Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی کا پیشگی انتظام",
              "english": "Pre-arranging the Water"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے مغیرہ رضی اللہ عنہ کو پانی کا برتن (إِدَاوَةً) ساتھ لے جانے کا حکم دیا، جو استنجاء کے لیے تیار شدہ پانی کا ثبوت ہے۔",
                "یہ سنت یہ سبق دیتی ہے کہ قضائے حاجت کی جگہ پر جانے سے قبل **طہارت کے وسائل** کا انتظام کر لینا ضروری ہے۔",
                "یہ عمل عجلت سے بچاتا ہے اور یہ یقینی بناتا ہے کہ قضائے حاجت کے فوراً بعد نجاست سے مکمل صفائی ہو جائے۔"
              ],
              "english": [
                "The Prophet (PBUH) instructing Mughirah (RA) to take the water vessel (Idawah) proves the preparation of water for Istinja' beforehand.",
                "This Sunnah teaches that organizing the **means of purity** before going to relieve oneself is essential.",
                "This practice prevents hurriedness and ensures that complete cleanliness from impurity is achieved immediately after the call of nature."
              ]
            }
          },
          {
            "title": {
              "urdu": "حاجت کے آداب میں رہنمائی",
              "english": "Guidance on Answering the Call"
            },
            "content": {
              "urdu": [
                "یہ حدیث طہارت کے بعد استنجاء کے لیے پانی کے جواز کو بھی ثابت کرتی ہے، اور یہ طریقہ سب سے افضل مانا گیا ہے۔",
                "یہ نبی صلی اللہ علیہ وسلم کی کمال درجہ کی عادات کو ظاہر کرتا ہے کہ آپ صلی اللہ علیہ وسلم نے نجی معاملات میں بھی بہترین آداب کا مظاہرہ کیا۔",
                "فقہی طور پر، استنجاء کے لیے پانی کا بندوبست کرنا اس حکم کو واجب کر دیتا ہے جب پانی دستیاب ہو۔"
              ],
              "english": [
                "This Hadith also proves the permissibility of using water for Istinja' after relieving oneself, which is considered the superior method.",
                "It showcases the Prophet's (PBUH) perfect character, demonstrating the highest level of etiquette even in private matters.",
                "Juristically, arranging water for Istinja' reinforces the obligatory nature of cleanliness when water is readily available."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی تعلیم اور صحابہ کی خدمت",
        "english": "Ethical Teaching and Companion's Service"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خادم کی ذمہ داری",
              "english": "Responsibility of the Servant"
            },
            "content": {
              "urdu": [
                "سیدنا مغیرہ رضی اللہ عنہ کا فوراً پانی لے کر پیچھے جانا، صحابہ کرام کی **کامل فرمانبرداری اور خدمت** کی بہترین مثال ہے۔",
                "یہ بات قابل غور ہے کہ وہ انتہائی نجی ضرورت کے لیے بھی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر رہتے تھے۔",
                "یہ واقعہ ہمیں سکھاتا ہے کہ رہنما یا استاد کی خدمت کو کسی بھی کام سے کم نہیں سمجھنا چاہیے۔"
              ],
              "english": [
                "Al-Mughirah (RA) immediately following with the water is a prime example of the **perfect obedience and service** of the Companions.",
                "It is noteworthy that they were present to serve the Prophet (PBUH) even for the most private necessities.",
                "This incident teaches us that serving a leader or teacher should not be deemed a trivial task, regardless of the nature of the service."
              ]
            }
          },
          {
            "title": {
              "urdu": "حیا اور عفت کا معیار",
              "english": "Standard of Modesty and Chastity"
            },
            "content": {
              "urdu": [
                "پردہ داری کا یہ حکم معاشرے کو حیا اور عفت کا درس دیتا ہے، جو ایمان کا ایک بنیادی جزو ہے۔",
                "مسلمان کو اپنی زندگی میں ہر جگہ عریانی یا بے پردگی سے اجتناب کرنا چاہیے، خواہ وہ نجی مقام ہی ہو۔",
                "یہ عمل اللہ کی نگاہ میں حیا کو بڑھاتا ہے اور انسان کے اخلاقی معیار کو بلند کرتا ہے۔"
              ],
              "english": [
                "This ruling on privacy teaches society about modesty (Haya) and chastity, which are foundational components of faith.",
                "A Muslim must avoid exposing themselves or acting immodestly everywhere, even in private settings.",
                "This practice enhances modesty in the sight of Allah and raises a person's moral standards."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "متفق علیہ حکم کی پختگی",
        "english": "Strength of the Agreed-Upon Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحت کی دلیل",
              "english": "Proof of Authenticity"
            },
            "content": {
              "urdu": [
                "اس حدیث کا متفق علیہ ہونا (صحیح بخاری و مسلم) اس بات کو یقینی بناتا ہے کہ یہ **قضائے حاجت میں پردہ داری کی سنت** قطعی طور پر ثابت ہے۔",
                "طہارت کا یہ حکم بلا اختلاف تمام فقہی مسالک میں بنیادی اصول کے طور پر مانا جاتا ہے۔",
                "مسلمانوں کے لیے اس حدیث پر عمل کرنا سنتِ مؤکدہ ہے اور بہترین اسلامی آداب کا مظہر ہے۔"
              ],
              "english": [
                "The 'Muttafaq Alayh' status of this Hadith (in Sahih Al-Bukhari and Muslim) definitively establishes the **Sunnah of privacy while relieving oneself**.",
                "This purity ruling is accepted without dissent across all major schools of jurisprudence as a foundational principle.",
                "Adhering to this Hadith is a Sunnah Mu'akkadah (emphasized Sunnah) for Muslims, reflecting the highest Islamic etiquette."
              ]
            }
          },
          {
            "title": {
              "urdu": "طہارت کا مکمل نظام",
              "english": "The Complete System of Purity"
            },
            "content": {
              "urdu": [
                "یہ حدیث طہارت کے مکمل نظام کا حصہ ہے، جس میں دعا (پچھلی حدیث)، پانی کا استعمال (اس سے پچھلی حدیث) اور پردہ داری شامل ہے۔",
                "اسلام میں طہارت کو اتنی تفصیل سے بیان کرنے کا مقصد یہ ہے کہ مسلمان ہر حال میں پاک صاف رہے۔",
                "اس سنت پر عمل سے انسان اخلاقی، روحانی اور جسمانی طور پر مکمل پاکیزگی حاصل کر سکتا ہے۔"
              ],
              "english": [
                "This Hadith is part of a complete system of purity, including supplication (previous Hadith), use of water, and maintaining privacy.",
                "The detailed nature of purity in Islam ensures that a Muslim remains clean and ritually pure in all circumstances.",
                "By following this Sunnah, a person achieves complete purity: moral, spiritual, and physical."
              ]
            }
          }
        ]
      }
    }
  ]
}
