{
  "hadithId": 1003,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/9/11"],
    "kitabId": 9,
    "inKitabBab": 1,
    "arabicBook": "بلوغ المرام",
    "babId": 79
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2703)‏، ومسلم (1675).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام بخاری اور امام مسلم نے روایت کیا ہے۔ اس میں قصاص اور اللہ کے مقرب بندوں کی دعا کی قبولیت کا ذکر ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (2703) and Muslim (1675). It highlights the law of Qisas and the status of certain righteous servants before Allah."
  },
  "importantWords": [
    {
      "arabic": "ثَنِيَّةَ",
      "english": "Incisor Tooth",
      "urdu": "سامنے کا دانت"
    },
    {
      "arabic": "الْعَفْوَ",
      "english": "Forgiveness",
      "urdu": "معافی"
    },
    {
      "arabic": "اَلْأَرْشَ",
      "english": "Compensation for Wounds",
      "urdu": "زخم کی دیت"
    },
    {
      "arabic": "الْقِصَاصُ",
      "english": "Retaliation",
      "urdu": "برابری کا بدلہ"
    },
    {
      "arabic": "أَقْسَمَ",
      "english": "Took an Oath",
      "urdu": "قسم کھائی"
    },
    {
      "arabic": "لَأَبَرَّهُ",
      "english": "Would Fulfill it",
      "urdu": "ضرور پورا فرمائے گا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں قصاص کے قانون اور اللہ کے صالح بندوں کے مقام کا ذکر ہے جن کی قسم اللہ پوری فرماتا ہے، جیسے انس بن نضر رضی اللہ عنہ کا واقعہ۔",
    "english": "This Hadith discusses the law of Qisas and the high status of righteous servants whose oaths are fulfilled by Allah, exemplified by Anas bin an-Nadr (RA)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (2703)",
      "english": "Reported by Al-Bukhari (2703)"
    },
    {
      "arabic": "رواه مسلم (1675)",
      "english": "Reported by Muslim (1675)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6o9l6Kts",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قصاص کا شرعی قانون",
        "english": "Islamic Law of Qisas"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دانت کا بدلہ دانت",
              "english": "Tooth for a Tooth"
            },
            "content": {
              "urdu": [
                "قرآن و سنت کی رو سے دانت توڑنے کا بدلہ وہی دانت توڑنا ہے۔",
                "نبی کریم ﷺ نے اللہ کے حکم کے مطابق قصاص کا فیصلہ دیا۔",
                "عدل و انصاف کا تقاضا ہے کہ مجرم کو ویسی ہی سزا دی جائے۔"
              ],
              "english": [
                "According to Quran and Sunnah, retaliation for a tooth is the tooth itself.",
                "The Prophet (ﷺ) gave the verdict of Qisas as per Allah's command.",
                "Justice demands that the perpetrator receives a matching punishment."
              ]
            }
          },
          {
            "title": {
              "urdu": "معافی کی ترغیب",
              "english": "Encouragement for Forgiveness"
            },
            "content": {
              "urdu": [
                "اگرچہ قصاص حق ہے، مگر معاف کرنا اللہ کے نزدیک پسندیدہ ہے۔",
                "متاثرہ فریق کو معافی یا دیت پر راضی کرنا صلح کا راستہ ہے۔",
                "ربیع کے معاملے میں آخر کار فریقین معافی پر راضی ہو گئے۔"
              ],
              "english": [
                "Although Qisas is a right, forgiveness is preferred by Allah.",
                "Persuading the victim's family toward mercy or Arsh is a way of peace.",
                "In Ar-Rubai's case, the other party eventually agreed to forgive."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کے مقرب بندے",
        "english": "Righteous Servants of Allah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قسم کی لاج رکھنا",
              "english": "Fulfilling the Oath"
            },
            "content": {
              "urdu": [
                "کچھ بندے ایسے ہیں جن کی قسم اللہ تعالیٰ رد نہیں فرماتا۔",
                "انس بن نضر رضی اللہ عنہ کا ایمان اور اللہ پر توکل کامل تھا۔",
                "اللہ نے ان کی بات کی لاج رکھی اور مخالفین کے دل بدل دیے۔"
              ],
              "english": [
                "There are some servants whose oaths Allah does not reject.",
                "Anas bin an-Nadr (RA) had perfect faith and trust in Allah.",
                "Allah honored his word by changing the hearts of the opponents."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ ظن باللہ",
              "english": "Good Expectation of Allah"
            },
            "content": {
              "urdu": [
                "انس بن نضر رضی اللہ عنہ کا کلام اللہ سے حسنِ ظن پر مبنی تھا۔",
                "یہ محض ضد نہیں تھی بلکہ اللہ کی رحمت پر گہرا بھروسہ تھا۔",
                "ایسے بندوں کا مقام ولایت کے اعلیٰ درجات میں سے ایک ہے۔"
              ],
              "english": [
                "Anas bin an-Nadr's words were based on good expectations of Allah.",
                "It was not mere stubbornness but deep reliance on Allah's mercy.",
                "The status of such servants is among the highest levels of sainthood."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور اخلاقی باریکیاں",
        "english": "Juristic and Ethical Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فیصلہ اور عمل درآمد",
              "english": "Verdict and Implementation"
            },
            "content": {
              "urdu": [
                "عدالت کا کام قانون کے مطابق فیصلہ سنانا ہوتا ہے۔",
                "فریقین کی باہمی رضامندی سے قصاص ختم ہو سکتا ہے۔",
                "معافی کے بعد قصاص کا حکم نافذ نہیں رہتا۔"
              ],
              "english": [
                "The role of the court is to deliver a verdict according to the law.",
                "Qisas can be dropped if the involved parties mutually agree.",
                "Once forgiveness is granted, the order for Qisas is no longer applied."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا طرزِ عمل",
              "english": "Conduct of the Companions"
            },
            "content": {
              "urdu": [
                "صحابہ کرام اللہ کے حکم کے سامنے فوراً سر تسلیمِ خم کرتے تھے۔",
                "ان کے باہمی جھگڑے بھی عدل اور اخلاق کے دائرے میں ہوتے تھے۔",
                "انس بن نضر کی بات پر آپ ﷺ نے انہیں غصہ نہیں فرمایا۔"
              ],
              "english": [
                "The Companions immediately submitted to the commands of Allah.",
                "Their mutual disputes remained within the bounds of justice and ethics.",
                "The Prophet (ﷺ) did not show anger at Anas bin an-Nadr's bold oath."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عفو و درگزر کی فضیلت",
              "english": "Virtue of Forgiveness"
            },
            "content": {
              "urdu": [
                "معافی سے معاشرے میں نفرتیں ختم اور محبتیں پیدا ہوتی ہیں۔",
                "اسلام انتقام کے بجائے صلح اور درگزر کی حوصلہ افزائی کرتا ہے۔",
                "اپنے حق سے دستبردار ہونا عظیم اخلاقی فتح ہے۔"
              ],
              "english": [
                "Forgiveness ends hatred and fosters love within the society.",
                "Islam encourages reconciliation and mercy over revenge.",
                "Relinquishing one's right for the sake of peace is a moral victory."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا اور توکل",
              "english": "Supplication and Trust"
            },
            "content": {
              "urdu": [
                "مشکل حالات میں اللہ کی ذات پر کامل بھروسہ رکھنا چاہیے۔",
                "سچے ایمان والے اللہ سے مانگ کر ناممکن کو ممکن کر دیتے ہیں۔",
                "ہمیں اللہ کا مقرب بننے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "In difficult times, one must have complete trust in Allah.",
                "Those with true faith can make the impossible possible through Allah.",
                "We should strive to become close and beloved servants of Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}