{
  "hadithId": 681,
  "hadithNo": 34,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:2148", "https://sunnah.com/muslim:1524"],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "كتاب البيوع",
    "babId": 42
  },
  
  "takhreej": {
    "arabic": "صحيح البخاري (2148)، كتاب البيوع، باب النهي عن تصرية الغنم؛ وصحيح مسلم (1524).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (2148) اور امام مسلم (1524) دونوں نے اسے روایت کیا ہے۔ تصرية سے مراد دھوکہ دینے کے لیے جانور کا دودھ تھنوں میں جمع کرنا ہے۔",
    "english": "Sahih al-Bukhari (2148) and Sahih Muslim (1524). The term 'Tasriyah' refers to the deceptive practice of leaving an animal unmilked for days to make its udder look large."
  },
  "importantWords": [
    {
      "arabic": "لَا تَصُرُّوا",
      "english": "Do not withhold milk",
      "urdu": "دودھ روک کر نہ رکھو"
    },
    {
      "arabic": "اِبْتَاعَهَا",
      "english": "Purchased it",
      "urdu": "اسے خریدا"
    },
    {
      "arabic": "بِخَيْرِ اَلنَّظَرَيْنِ",
      "english": "Best of two options",
      "urdu": "دو صورتوں میں سے بہتر"
    },
    {
      "arabic": "يَحْلُبَهَا",
      "english": "Milks it",
      "urdu": "دودھ نکالے"
    },
    {
      "arabic": "صَاعًا",
      "english": "A Sa' (measurement unit)",
      "urdu": "ایک صاع"
    },
    {
      "arabic": "تَمْرٍ",
      "english": "Dates",
      "urdu": "کھجور"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں جانوروں کی فروخت کے وقت ان کے تھنوں میں دودھ روک کر خریدار کو دھوکہ دینے (تصرِیہ) کی ممانعت ہے اور دھوکہ ثابت ہونے پر خریدار کو واپسی کا حق دیا گیا ہے۔",
    "english": "This Hadith forbids 'Tasriyah' (deceptive milk accumulation in udders) during sales and grants the buyer the right to return the animal if deceived."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2148)",
      "english": "Sahih al-Bukhari (2148)"
    },
    {
      "arabic": "صحيح مسلم (1524)",
      "english": "Sahih Muslim (1524)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dusi"
      },
      "slug": "abu-hurairah-al-dusi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjS6xR8E3oA",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تصرِیہ کی ممانعت اور دھوکہ دہی",
        "english": "Prohibition of Tasriyah and Deception"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تصرِیہ کا مفہوم",
              "english": "Concept of Tasriyah"
            },
            "content": {
              "urdu": [
                "تصرِیہ کا مطلب ہے جانور کو منڈی لے جانے سے پہلے دو تین دن دودھ نہ نکالنا۔",
                "اس سے خریدار یہ سمجھتا ہے کہ جانور فطری طور پر بہت زیادہ دودھ دیتا ہے۔",
                "اسلام نے اس مصنوعی بناوٹ اور دھوکہ دہی کو سختی سے منع فرمایا ہے۔"
              ],
              "english": [
                "Tasriyah means not milking an animal for a few days before taking it to the market.",
                "This leads the buyer to believe that the animal naturally produces a lot of milk.",
                "Islam strictly prohibits this artificial presentation and form of deception."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیانتدارانہ تجارت",
              "english": "Honest Trading"
            },
            "content": {
              "urdu": [
                "تجارت کی بنیاد سچائی اور امانتداری پر ہونی چاہیے تاکہ فریقین کو نقصان نہ ہو۔",
                "مال کے عیب یا کسی صفت کو چھپا کر فروخت کرنا برکت کو ختم کر دیتا ہے۔",
                "مسلمان تاجر کو چاہیے کہ وہ خریدار کے سامنے مال کی اصل حقیقت واضح کرے۔"
              ],
              "english": [
                "Trade must be based on truth and integrity to prevent harm to either party.",
                "Hiding defects or falsifying traits of a commodity removes its blessings.",
                "A Muslim merchant is required to be transparent about the actual condition of the goods."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خریدار کا حقِ فسخ (واپسی کا اختیار)",
        "english": "Buyer's Right to Rescind the Deal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اختیارِ واپسی",
              "english": "Option to Return"
            },
            "content": {
              "urdu": [
                "اگر خریدار کو گھر جا کر معلوم ہو کہ دودھ مصنوعی طور پر جمع کیا گیا تھا تو اسے واپسی کا حق ہے۔",
                "مسلم کی روایت کے مطابق خریدار کو تین دن تک یہ جانور پرکھنے کا اختیار حاصل ہے۔",
                "یہ حق اس لیے ہے تاکہ خریدار کو ہونے والے مالی نقصان کا ازالہ ہو سکے۔"
              ],
              "english": [
                "If the buyer realizes the milk was artificially accumulated, they have the right to return it.",
                "According to Muslim's narration, the buyer has a three-day period to test the animal.",
                "This right is granted to compensate the buyer for the financial loss and deception."
              ]
            }
          },
          {
            "title": {
              "urdu": "ایک صاع کھجور کا معاوضہ",
              "english": "Compensation of One Sa' of Dates"
            },
            "content": {
              "urdu": [
                "جانور واپس کرتے وقت خریدار کو ایک صاع کھجور اضافی دینی ہوگی۔",
                "یہ کھجور اس دودھ کا بدلہ ہے جو خریدار نے دوہنے کے بعد استعمال کیا ہوتا ہے۔",
                "شریعت نے دودھ کی نامعلوم مقدار کا معاوضہ ایک صاع کھجور مقرر کر کے جھگڑا ختم کر دیا۔"
              ],
              "english": [
                "Upon returning the animal, the buyer must provide one Sa' of dates additionally.",
                "These dates serve as compensation for the milk the buyer consumed after milking it.",
                "Sharia settled potential disputes by fixing the value of the milk at one Sa' of dates."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو اور کھجور کی حکمت",
        "english": "Juristic Aspects and Wisdom of Dates"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھجور ہی کیوں؟",
              "english": "Why specifically Dates?"
            },
            "content": {
              "urdu": [
                "کھجور اس وقت کا غالب اناج تھا اور اس کی قیمت عموماً مستحکم رہتی تھی۔",
                "بعض روایات میں کسی بھی غلے (اناج) کی اجازت ہے مگر گندم کی تخصیص سے منع کیا گیا۔",
                "امام بخاری کے مطابق اکثر اور صحیح روایات میں کھجور ہی کا تذکرہ ملتا ہے۔"
              ],
              "english": [
                "Dates were the staple food at the time and their value was generally stable.",
                "Some narrations allow any grain, though wheat was specifically excluded in some versions.",
                "According to Al-Bukhari, the most authentic narrations specifically mention dates."
              ]
            }
          },
          {
            "title": {
              "urdu": "ائمه کے مسالک",
              "english": "Positions of the Imams"
            },
            "content": {
              "urdu": [
                "امام شافعی، مالک اور احمد اس حدیث کی روشنی میں واپسی اور کھجور دینے کے قائل ہیں۔",
                "امام ابوحنیفہ کے نزدیک یہ معاملہ قیاس کے خلاف ہے، مگر حدیث کے مقابلے میں قیاس ترک ہوگا۔",
                "محدثین اس حدیث کو تجارت میں 'خیارِ تدلیس' (دھوکے کی بنا پر واپسی) کی بنیاد مانتے ہیں۔"
              ],
              "english": [
                "Imams Shafi'i, Malik, and Ahmad support returning the animal with dates based on this Hadith.",
                "Imam Abu Hanifa initially viewed it against analogy, yet Hadith takes precedence over analogy.",
                "Hadith scholars consider this the basis for the option of rescinding a deal due to fraud."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اطلاق",
        "english": "Practical Life Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جدید دور کی دھوکہ دہی",
              "english": "Modern Day Deception"
            },
            "content": {
              "urdu": [
                "گاڑیوں کے میٹر پیچھے کرنا یا نقص چھپا کر سیکنڈ ہینڈ اشیاء بیچنا تصرِیہ کی طرح ہے۔",
                "مصنوعی چمک دمک دکھا کر گاہک کو پھنسانا شرعاً ناپسندیدہ اور ممنوع ہے۔",
                "ہر وہ عمل جو چیز کی اصل حقیقت چھپائے وہ اسی ممانعت کے زمرے میں آتا ہے۔"
              ],
              "english": [
                "Tampering with odometers or hiding defects in second-hand goods is akin to Tasriyah.",
                "Using artificial enhancements to lure customers into a trap is religiously forbidden.",
                "Any action that conceals the true nature of a commodity falls under this prohibition."
              ]
            }
          },
          {
            "title": {
              "urdu": "عدل و احسان کی ترغیب",
              "english": "Encouraging Justice and Kindness"
            },
            "content": {
              "urdu": [
                "اسلامی معاشرے میں تاجر کو محض منافع خور نہیں بلکہ امانت دار ہونا چاہیے۔",
                "دھوکہ دہی سے بچنا رزق میں برکت اور اللہ کی رضا کا باعث بنتا ہے۔",
                "خریدار کے حق کا تحفظ کرنا معاشرتی امن اور معاشی استحکام کی ضمانت ہے۔"
              ],
              "english": [
                "In an Islamic society, a merchant should be a trustworthy trustee, not just a profiteer.",
                "Avoiding deception brings blessings in sustenance and the pleasure of Allah.",
                "Protecting the buyer's rights guarantees social peace and economic stability."
              ]
            }
          }
        ]
      }
    }
  ]
}