{
  "hadithId": 879,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bulugh/8/78"],
    "kitabId": 8,
    "inKitabBab": 3,
    "arabicBook": "كتاب النكاح",
    "babId": 66
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه البخاري (5207، 5208، 5209) ، ومسلم (1440).",
    "urdu": "صحیح۔ اسے امام بخاری (5207) اور امام مسلم (1440) نے روایت کیا ہے۔ یہ حدیث عزل کے جواز پر واضح دلیل ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5207) and Muslim (1440). It is a 'Muttafaqun Alayh' (Agreed Upon) Hadith."
  },
  "importantWords": [
    {
      "arabic": "نَعْزِلُ",
      "english": "Coitus interruptus",
      "urdu": "عزل کرنا / باہر انزال کرنا"
    },
    {
      "arabic": "عَهْدِ",
      "english": "Era / Lifetime",
      "urdu": "زمانہ / دور"
    },
    {
      "arabic": "يَنْزِلُ",
      "english": "Being revealed",
      "urdu": "نازل ہو رہا تھا"
    },
    {
      "arabic": "فَبَلَغَ",
      "english": "So it reached",
      "urdu": "پس پہنچی (اطلاع)"
    },
    {
      "arabic": "يُنْهَى",
      "english": "Forbidden",
      "urdu": "منع کیا جاتا"
    }
  ],
  "summary": {
    "urdu": "رسول اللہ ﷺ کے زمانے میں صحابہ کرام حمل روکنے کے لیے عزل کا طریقہ اختیار کرتے تھے، اور وحی یا آپ ﷺ کے خاموش رہنے سے اس کا جواز ثابت ہوتا ہے۔",
    "english": "The Companions practiced coitus interruptus ('Azl) during the Prophet's time, and the lack of prohibition in the Qur'an or from the Prophet (ﷺ) proves its basic permissibility."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5208)",
      "english": "Sahih al-Bukhari (5208)"
    },
    {
      "arabic": "صحيح مسلم (1440)",
      "english": "Sahih Muslim (1440)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jabir bin Abdullah"
      },
      "slug": "jabir-bin-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S0T0E69_Lmo",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عزل کا مفہوم اور جواز",
        "english": "Meaning and Permissibility of Azl"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزل کی تعریف",
              "english": "Definition of Azl"
            },
            "content": {
              "urdu": [
                "عزل سے مراد ہمبستری کے دوران انزال باہر کرنا ہے تاکہ حمل نہ ٹھہر سکے۔",
                "صحابہ کرام اپنی ضروریات اور حالات کے مطابق یہ طریقہ اختیار کرتے تھے۔",
                "اس حدیث سے معلوم ہوتا ہے کہ حمل روکنے کے عارضی طریقے بنیادی طور پر جائز ہیں۔"
              ],
              "english": [
                "Azl refers to withdrawing before ejaculation to prevent pregnancy during intercourse.",
                "The Companions used this method according to their specific needs and circumstances.",
                "This Hadith indicates that temporary methods of birth control are fundamentally permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ تقریری کی اہمیت",
              "english": "Importance of Tacit Approval"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کو علم ہونے کے باوجود خاموشی اختیار کرنا اس کے جواز کی دلیل ہے۔",
                "جس چیز پر آپ ﷺ نے نکیر نہیں فرمائی، وہ دین میں مباح (جائز) سمجھی جاتی ہے۔",
                "صحابہ کا یہ استدلال کہ 'قرآن نازل ہو رہا تھا' وحی کی نگرانی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) silence despite knowing of the practice serves as a legal approval.",
                "Anything the Prophet (ﷺ) did not object to is considered permissible (Mubah) in religion.",
                "The Companions' reasoning that 'Qur'an was being revealed' highlights Divine oversight."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مانع حمل اور خاندانی منصوبہ بندی",
        "english": "Contraception and Family Planning"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عزل اور جدید طریقے",
              "english": "Azl and Modern Methods"
            },
            "content": {
              "urdu": [
                "عزل پر قیاس کرتے ہوئے جدید مانع حمل ادویات اور ذرائع کو جائز قرار دیا گیا ہے۔",
                "شرط یہ ہے کہ یہ طریقے عارضی ہوں اور تولیدی صلاحیت کو مستقل ختم نہ کریں۔",
                "صحت، معیشت یا بچوں کی پرورش جیسے معقول عذر کی بنا پر اسے اپنایا جا سکتا ہے۔"
              ],
              "english": [
                "Analogous to Azl, modern contraceptive methods and tools are generally considered permissible.",
                "The condition is that these methods must be temporary and not permanently end fertility.",
                "It may be adopted for valid reasons like health, finances, or proper child upbringing."
              ]
            }
          },
          {
            "title": {
              "urdu": "بیوی کی رضامندی",
              "english": "Consent of the Wife"
            },
            "content": {
              "urdu": [
                "فقہاء کے مطابق عزل کے لیے آزاد بیوی کی رضامندی حاصل کرنا ضروری ہے۔",
                "چونکہ اولاد پر میاں بیوی دونوں کا حق ہے، اس لیے یکطرفہ فیصلہ مناسب نہیں۔",
                "اسلام میاں بیوی کے درمیان باہمی مشورے اور خوش اسلوبی کو فوقیت دیتا ہے۔"
              ],
              "english": [
                "According to jurists, the consent of a free wife is necessary for practicing Azl.",
                "Since both spouses have a right to children, a unilateral decision is not appropriate.",
                "Islam prioritizes mutual consultation and harmony between the husband and wife."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تقدیر الٰہی پر بھروسہ",
        "english": "Trust in Divine Decree"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حمل کا ٹھہرنا اللہ کے ہاتھ میں",
              "english": "Conception is in Allah's Hands"
            },
            "content": {
              "urdu": [
                "دیگر روایات میں ہے کہ اگر اللہ نے اولاد پیدا کرنی ہو تو عزل کے باوجود ہو جاتی ہے۔",
                "انسان کو تدبیر کرنے کی اجازت ہے مگر حتمی فیصلہ اللہ کی مشیت پر منحصر ہے۔",
                "عزل محض ایک تدبیر ہے، یہ اللہ کی تقدیر کو بدلنے کی طاقت نہیں رکھتی۔"
              ],
              "english": [
                "Other narrations state that if Allah decrees a child to be born, Azl will not prevent it.",
                "Man is permitted to take precautions, but the final outcome depends on Allah's Will.",
                "Azl is merely a measure; it does not possess the power to alter Divine Decree."
              ]
            }
          },
          {
            "title": {
              "urdu": "اولاد کی کثرت کی ترغیب",
              "english": "Encouragement for Large Families"
            },
            "content": {
              "urdu": [
                "بنیادی طور پر اسلام اولاد کی کثرت کو پسند کرتا ہے تاکہ امتِ محمدیہ بڑھے۔",
                "بغیر کسی عذر کے نسل کشی یا حمل روکنا پسندیدہ عمل نہیں ہے۔",
                "ضرورت اور پسندیدگی کے درمیان توازن قائم رکھنا ہی اسلامی اعتدال ہے۔"
              ],
              "english": [
                "Fundamentally, Islam favors a large family to strengthen the Ummah of Muhammad (ﷺ).",
                "Preventing pregnancy without a valid reason is not a preferred or encouraged act.",
                "Islamic moderation lies in maintaining a balance between necessity and preference."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتویٰ اور صحابہ کا فہم",
              "english": "Fatwa and Companions' Understanding"
            },
            "content": {
              "urdu": [
                "صحابہ کرام اپنے ہر عمل کو وحی کی روشنی میں پرکھتے تھے جو ان کے تقویٰ کی دلیل ہے۔",
                "اگر عزل گناہ ہوتا تو اللہ تعالیٰ ضرور اس پر تنبیہ فرما دیتا۔",
                "یہ حدیث ہمیں سکھاتی ہے کہ مباح امور میں وسعت ہے اور تنگی پیدا نہیں کرنی چاہیے۔"
              ],
              "english": [
                "The Companions judged their actions in the light of revelation, proving their piety.",
                "Had Azl been a sin, Allah would have certainly revealed a prohibition against it.",
                "This Hadith teaches that there is breadth in permissible matters and we shouldn't create hardship."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی زندگی میں راہنمائی",
              "english": "Guidance in Practical Life"
            },
            "content": {
              "urdu": [
                "اسلام زندگی کے ہر نجی اور معاشرتی معاملے میں مکمل راہنمائی فراہم کرتا ہے۔",
                "نبی کریم ﷺ کی خاموشی بھی امت کے لیے ایک واضح قانونی سند ہے۔",
                "ہمیں اپنے جدید مسائل کا حل سنت اور صحابہ کے اسلوب سے تلاش کرنا چاہیے۔"
              ],
              "english": [
                "Islam provides complete guidance in every private and social matter of life.",
                "The Prophet's (ﷺ) silence acts as a definitive legal precedent for the Ummah.",
                "We must seek solutions to modern issues from the Sunnah and the methodology of the Sahaba."
              ]
            }
          }
        ]
      }
    }
  ]
}