{
  "hadithId": 727,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/7/48"
    ],
    "kitabId": 7,
    "inKitabBab": 6,
    "arabicBook": "بلوغ المرام",
    "babId": 47
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (2402)، ومسلم (1559). ورواه أبو داود (3520-3523) بزيادات في لفظ الموت وضعفها، وصحح الحاكم تلك الزيادة.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے بخاری (2402) اور مسلم (1559) نے روایت کیا ہے۔ ابوداؤد اور دیگر کتب میں موت کے ذکر والی زیادتیاں بھی موجود ہیں جن کی صحت میں ائمہ کا اختلاف ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2402) and Muslim (1559). Versions with additions regarding the death of the buyer are found in Abu Dawud (3520) and others, though scholars differ on the authenticity of those specific additions."
  },
  "importantWords": [
    {
      "arabic": "أَدْرَكَ",
      "english": "Finds / Recognizes",
      "urdu": "پا لے / پہچان لے"
    },
    {
      "arabic": "بِعَيْنِهِ",
      "english": "Itself / Exactly the same",
      "urdu": "بعینہ / وہی چیز"
    },
    {
      "arabic": "أَفْلَسَ",
      "english": "Became Insolvent",
      "urdu": "مفلس ہو گیا"
    },
    {
      "arabic": "أَحَقُّ",
      "english": "More entitled",
      "urdu": "زیادہ حقدار"
    },
    {
      "arabic": "مَتَاعًا",
      "english": "Goods / Property",
      "urdu": "سامان / مال"
    },
    {
      "arabic": "الْغُرَمَاءِ",
      "english": "Creditors",
      "urdu": "قرض خواہ"
    }
  ],
  "summary": {
    "urdu": "اگر کوئی خریدار مفلس ہو جائے اور بیچنے والا اپنا سامان اس کے پاس موجود پائے، تو وہ اس سامان کو واپس لینے کا سب سے پہلا حقدار ہے۔",
    "english": "If a buyer becomes bankrupt while the seller's goods are still in his possession, the seller has the primary right to reclaim his actual property."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2402)",
      "english": "Sahih al-Bukhari (2402)"
    },
    {
      "arabic": "صحيح مسلم (1559)",
      "english": "Sahih Muslim (1559)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو بكر بن عبد الرحمن",
        "english": "Abu Bakr bin 'Abdur-Rahman"
      },
      "slug": "abu-bakr-bin-abdur-rahman"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FmS3m6qS0YQ",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "افلاس کی صورت میں بیچنے والے کا حق",
        "english": "Seller's Right in Case of Insolvency"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی واپسی کا حق",
              "english": "Right to Reclaim Property"
            },
            "content": {
              "urdu": [
                "اگر خریدار دیوالیہ ہو جائے تو بیچنے والا اپنا اصل مال واپس لے سکتا ہے۔",
                "یہ حق اس وقت ہے جب مال اپنی اصل حالت میں موجود ہو۔",
                "اس صورت میں بیچنے والا دیگر قرض خواہوں پر مقدم ہوگا۔"
              ],
              "english": [
                "If the buyer goes bankrupt, the seller can take back his original goods.",
                "This right applies only if the goods are found in their original state.",
                "In this case, the seller takes precedence over all other creditors."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرائطِ واپسی",
              "english": "Conditions for Reclaiming"
            },
            "content": {
              "urdu": [
                "مال میں کوئی ایسی تبدیلی نہ آئی ہو جس سے اس کی قیمت بدل جائے۔",
                "اگر خریدار نے قیمت کا کچھ حصہ ادا کر دیا ہو تو مسئلہ مختلف ہوگا۔",
                "بیچنے والے کا یہ حق انصاف کے عین مطابق ہے تاکہ اس کا نقصان نہ ہو۔"
              ],
              "english": [
                "The goods must not have undergone changes that significantly alter their value.",
                "The ruling differs if the buyer has already paid a portion of the price.",
                "This right of the seller ensures justice and prevents unfair financial loss."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قرض خواہوں کے درمیان برابری",
        "english": "Equality Among Creditors"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرض خواہوں کے حقوق",
              "english": "Rights of General Creditors"
            },
            "content": {
              "urdu": [
                "اگر مال موجود نہ ہو تو بیچنے والا عام قرض خواہوں کی فہرست میں شامل ہوگا۔",
                "اس صورت میں اسے دستیاب مال میں سے تناسب کے حساب سے حصہ ملے گا۔",
                "اسلامی قانون تمام فریقین کے مالی حقوق کا تحفظ کرتا ہے۔"
              ],
              "english": [
                "If the actual goods are gone, the seller joins the list of general creditors.",
                "In this scenario, he receives a proportional share of the remaining assets.",
                "Islamic law carefully protects the financial rights of all involved parties."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت اور افلاس کا فرق",
              "english": "Difference Between Death and Bankruptcy"
            },
            "content": {
              "urdu": [
                "کچھ روایات کے مطابق خریدار کی موت کی صورت میں بیچنے والا عام قرض خواہ بن جاتا ہے۔",
                "اگرچہ اس زیادتی کی سند پر بحث ہے، لیکن فقہاء نے اسے بیان کیا ہے۔",
                "موت کے بعد ترکے کی تقسیم کے اصول نافذ ہو جاتے ہیں۔"
              ],
              "english": [
                "Some narrations suggest that if the buyer dies, the seller is like other creditors.",
                "Though the authenticity of this addition is debated, jurists discuss it extensively.",
                "Following death, the specific rules of inheritance and estate distribution apply."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کاروباری احتیاط اور دیانتداری",
        "english": "Business Caution and Integrity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کاروباری معاملات میں شفافیت",
              "english": "Transparency in Dealings"
            },
            "content": {
              "urdu": [
                "تاجروں کو چاہیے کہ لین دین کے وقت تحریری معاہدہ کریں۔",
                "خریدار کی مالی حالت کا علم ہونا مستقبل کے تنازعات سے بچاتا ہے۔",
                "اسلام ہر معاملے کو واضح اور صاف رکھنے کی تلقین کرتا ہے۔"
              ],
              "english": [
                "Traders should ensure written agreements during their business transactions.",
                "Awareness of a buyer's financial status helps prevent future disputes.",
                "Islam encourages keeping every transaction clear, honest, and documented."
              ]
            }
          },
          {
            "title": {
              "urdu": "نقصان سے بچاؤ کا طریقہ",
              "english": "Methods of Loss Prevention"
            },
            "content": {
              "urdu": [
                "یہ حدیث بیچنے والے کو بڑے مالی نقصان سے بچانے کا قانونی راستہ دیتی ہے۔",
                "کسی کا مال ناحق دوسرے کے قرضے میں استعمال نہیں ہونا چاہیے۔",
                "شریعت کا مقصد معاشرے میں عدل پر مبنی تجارتی نظام قائم کرنا ہے۔"
              ],
              "english": [
                "This Hadith provides a legal avenue to protect sellers from major losses.",
                "One person's property should not be unfairly used to pay another's debt.",
                "The Sharia aims to establish a commercial system based on absolute justice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تعلیمی اسباق",
        "english": "Juristic and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہ کا طرزِ عمل",
              "english": "The Practice of the Companions"
            },
            "content": {
              "urdu": [
                "سیدنا ابوہریرہ رضی اللہ عنہ نے اس معاملے میں سنت کے مطابق فیصلہ کیا۔",
                "صحابہ کرام مشکل مسائل میں ہمیشہ فرمانِ نبوی ﷺ کی طرف رجوع کرتے تھے۔",
                "قاضی اور جج کے لیے سنتِ نبوی ﷺ بہترین رہنما ہے۔"
              ],
              "english": [
                "Abu Hurairah (RA) judged this matter according to the established Sunnah.",
                "The Companions always referred to the Prophet's (ﷺ) words for complex issues.",
                "The Sunnah serves as the ultimate guide for judges and legal authorities."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی استحکام",
              "english": "Social Stability"
            },
            "content": {
              "urdu": [
                "دیوالیہ پن کے قوانین واضح ہونے سے سماجی بے چینی کم ہوتی ہے۔",
                "لوگوں کا باہمی اعتماد بحال رکھنے کے لیے ایسے احکام ضروری ہیں۔",
                "اسلامی معاشیات ہر فرد کے حق کو اہمیت دیتی ہے۔"
              ],
              "english": [
                "Clear bankruptcy laws reduce social unrest and financial anxiety.",
                "Such rulings are essential to maintain mutual trust among the people.",
                "Islamic economics prioritizes the rightful claim of every individual."
              ]
            }
          }
        ]
      }
    }
  ]
}