{
  "hadithId": 51,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["Book 1, Hadith 23 (Chapter 4)"],
    "kitabId": 1,
    "inKitabBab": 4,
    "arabicBook": "كتاب مقدار الماء للوضوء والغسل",
    "babId": 4
  },

  "takhreej": {
    "arabic": "صحيح.  رواه البخاري (201) ، ومسلم (325)  (51) . ",
    "urdu": "صحیح (درجہ)۔ اسے بخاری (201) اور مسلم (325) (51) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Narrated by Al-Bukhari (201) and Muslim (325) (51)."
  },
  "importantWords": [
    {
      "arabic": "يَتَوَضَّأُ",
      "english": "Used to perform Wudu",
      "urdu": "وضو کر لیا کرتے تھے"
    },
    {
      "arabic": "بِالْمُدِّ",
      "english": "With one Mudd (volume)",
      "urdu": "مد (پانی) سے"
    },
    {
      "arabic": "يَغْتَسِلُ",
      "english": "Used to perform Ghusl",
      "urdu": "غسل کر لیا کرتے تھے"
    },
    {
      "arabic": "بِالصَّاعِ",
      "english": "With one Sā' (volume)",
      "urdu": "صاع سے"
    },
    {
      "arabic": "أَمْدَادٍ",
      "english": "Mudds (plural of Mudd)",
      "urdu": "مد (جمع)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم صلی اللہ علیہ وسلم کے وضو اور غسل میں استعمال ہونے والے پانی کی مقدار کا تعین کرتی ہے، جو **کم پانی کے استعمال (عدم اسراف)** کی سنت پر زور دیتی ہے اور طہارت کے دوران میانہ روی کی تعلیم دیتی ہے۔",
    "english": "This Hadith specifies the minimal amount of water the Prophet (ﷺ) used for Wudu and Ghusl, which emphasizes the Sunnah of **avoiding waste (Isrāf)** and maintaining moderation during acts of purification."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الوضوء، رقم 201",
      "english": "Sahih Al-Bukhari, The Book of Ablution, Hadith 201"
    },
    {
      "arabic": "صحيح مسلم، كتاب الحيض، رقم 325",
      "english": "Sahih Muslim, The Book of Menstruation, Hadith 325"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَنَسُ بْنُ مَالِكٍ رَضِيَ اَللَّهُ عَنْهُ",
        "english": "Anas ibn Mālik (May Allah be pleased with him)"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://youtu.be/example-hadith-29-water-quantity",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Agreed Upon (by Bukhari and Muslim)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وضو میں کم پانی کی حکمت",
        "english": "The Wisdom of Minimal Water in Wudu"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وضو کے لیے 'مد' کا استعمال",
              "english": "Using 'Mudd' for Wudu"
            },
            "content": {
              "urdu": [
                "**مد** ایک پیمانہ ہے جو تقریباً 600 ملی لیٹر کے برابر ہوتا ہے۔ نبی ﷺ کا اتنی قلیل مقدار میں پانی استعمال کرنا اس بات کی دلیل ہے کہ وضو میں اسراف (پانی کا ضیاع) نہیں ہونا چاہیے۔",
                "یہ سنت اس بات کا ثبوت ہے کہ طہارت کا مقصد اعضاء کو صرف گیلا کرنا نہیں بلکہ پانی کو ان کی تمام سطحوں پر پہنچانا ہے، اور یہ کم پانی سے بھی ممکن ہے۔",
                "نبی ﷺ کے اس عمل سے یہ واضح ہوتا ہے کہ وضو کو پورا کرنے کے لیے کثیر پانی کی ضرورت نہیں بلکہ **احتیاط اور کفایت شعاری** کی ضرورت ہے۔"
              ],
              "english": [
                "The **Mudd** is a measure, approximately equal to 600 milliliters. The Prophet's (ﷺ) use of such a small amount of water proves that there should be no extravagance (Isrāf) or waste in Wudu.",
                "This Sunnah proves that the goal of purification is not merely to wet the limbs but to ensure water reaches their entire surface, which is possible even with little water.",
                "The Prophet's (ﷺ) practice clarifies that completing Wudu does not require abundant water, but rather **carefulness and moderation (Iqtiṣād)**."
              ]
            }
          },
          {
            "title": {
              "urdu": "غسل کے لیے 'صاع' کا استعمال",
              "english": "Using 'Sā'' for Ghusl"
            },
            "content": {
              "urdu": [
                "**صاع** تقریباً چار مد (تقریباً 2.4 لیٹر) کے برابر ہوتا ہے۔ نبی ﷺ کا صاع سے لے کر پانچ مد تک پانی استعمال کرنا غسل میں بھی میانہ روی کو ظاہر کرتا ہے۔",
                "غسل میں زیادہ پانی کی اجازت (پانچ مد تک) اس لیے ہے کہ اس میں پورے جسم کو دھونا فرض ہے، جس میں بال بھی شامل ہیں۔",
                "یہ دونوں مثالیں اسلامی شریعت کی آسانی اور وسائل کے درست استعمال کے اصول کو نمایاں کرتی ہیں۔"
              ],
              "english": [
                "The **Sā'** is approximately four Mudds (about 2.4 liters). The Prophet's (ﷺ) use of one Sā' up to five Mudds shows moderation even in Ghusl.",
                "The allowance for more water in Ghusl (up to five Mudds) is because washing the entire body, including the hair, is obligatory.",
                "Both examples highlight the principle of ease in Islamic law and the proper use of resources."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اسراف کی ممانعت اور احتیاط",
        "english": "Prohibition of Waste and Precaution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اسراف سے اجتناب",
              "english": "Avoiding Extravagance (Isrāf)"
            },
            "content": {
              "urdu": [
                "وضو اور غسل میں کم پانی کا استعمال اس بات کی تعلیم دیتا ہے کہ اللہ تعالیٰ عبادات میں اسراف کو ناپسند فرماتے ہیں، یہاں تک کہ پانی جیسی نایاب شے کا بھی۔",
                "مسلمان کو چاہیے کہ وہ وضو میں زیادہ پانی استعمال کر کے اسے ضائع نہ کرے، اگرچہ وہ بہتے پانی (جیسے ندی) کے کنارے ہی کیوں نہ ہو۔",
                "اس سنت پر عمل کرنا ماحول اور وسائل کی قدر کرنے کے اسلامی اصولوں کی عکاسی کرتا ہے۔"
              ],
              "english": [
                "Using minimal water in Wudu and Ghusl teaches that Allah dislikes extravagance in worship, even concerning a precious resource like water.",
                "A Muslim should not use excessive water in Wudu and waste it, even if he were performing ablution by a flowing river.",
                "Adhering to this Sunnah reflects the Islamic principles of valuing the environment and resources."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو کی صحت پر اثر",
              "english": "Effect on Wudu Validity"
            },
            "content": {
              "urdu": [
                "اس حدیث کا مطلب یہ نہیں کہ اس سے زیادہ پانی استعمال کرنے سے وضو باطل ہو جائے گا، بلکہ یہ ایک **سنت** ہے۔",
                "وضو کی صحت کے لیے پانی کی مقدار سے زیادہ اہم یہ ہے کہ پانی ہر فرض عضو کی سطح تک اچھی طرح پہنچ جائے۔",
                "اس لیے پانی کا کم استعمال سنت ہے، لیکن اگر زیادہ پانی بہا کر بھی اعضاء کا کوئی حصہ خشک رہ جائے تو وضو باطل ہو جائے گا۔"
              ],
              "english": [
                "This Hadith does not mean that using more water than this invalidates Wudu; rather, it establishes a **Sunnah**.",
                "More important than the quantity of water for Wudu's validity is ensuring that water adequately covers the surface of every obligatory limb.",
                "Therefore, using less water is Sunnah, but even if excessive water is used and a part of the limb remains dry, the Wudu will be invalid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فائدہ اور اجر",
        "english": "Benefit and Reward"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی پیروی کا ثواب",
              "english": "Reward for Following the Sunnah"
            },
            "content": {
              "urdu": [
                "جو شخص نبی اکرم ﷺ کی اس سنت پر عمل کرتا ہے، وہ ایک قلیل مقدار کے ذریعے بھی مکمل طہارت حاصل کرنے کا اجر پاتا ہے۔",
                "کم پانی سے وضو کرنے کے باوجود وضو کا مکمل ہونا نبی ﷺ کی تعلیمات کی برکت اور رہنمائی کا ثبوت ہے۔",
                "یہ عمل مسلمان کے لیے یہ پیغام ہے کہ وہ اپنی زندگی میں ہر جگہ اور ہر کام میں نبی ﷺ کی سنت کی پیروی کرے۔"
              ],
              "english": [
                "The person who acts upon this Sunnah of the Prophet (ﷺ) receives the reward of achieving complete purification even through a minimal quantity of water.",
                "The completion of Wudu despite using little water is proof of the blessing and guidance inherent in the Prophet's (ﷺ) teachings.",
                "This practice conveys the message to a Muslim to follow the Prophet's (ﷺ) Sunnah in all places and every aspect of his life."
              ]
            }
          },
          {
            "title": {
              "urdu": "انس بن مالکؓ کی روایت کا مقام",
              "english": "The Status of Anas ibn Mālik's Narration"
            },
            "content": {
              "urdu": [
                "سیدنا انس رضی اللہ عنہ نے، جو نبی ﷺ کے خادم تھے، آپ ﷺ کے ذاتی معمولات کا گہرا مشاہدہ کیا اور اسے امت تک پہنچایا۔",
                "ان کی یہ روایت بخاری و مسلم میں ہونے کی وجہ سے **اعلیٰ ترین درجہ** کی ہے اور اس پر عمل کرنا شک و شبہ سے بالاتر ہے۔",
                "صحابہ کرام کا یہ اھتمام کہ وہ پانی کی مقدار تک کو محفوظ رکھتے تھے، دین کے ہر پہلو کی اہمیت کو اجاگر کرتا ہے۔"
              ],
              "english": [
                "Sayyiduna Anas (RA), who was the Prophet's (ﷺ) servant, observed his personal routines closely and conveyed them to the Ummah.",
                "Because this narration is found in Bukhari and Muslim (Muttafaqun 'Alayh), it holds the **highest degree** of authenticity, and acting upon it is beyond all doubt.",
                "The Companions' diligence in preserving even the quantity of water highlights the importance of every aspect of the religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پیمانوں کی تفصیل",
        "english": "Details of the Measurements"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مد اور صاع کی مقدار",
              "english": "The Quantity of Mudd and Sā'"
            },
            "content": {
              "urdu": [
                "**مد** ایک چلو کے برابر مقدار ہے، اور **صاع** اس کا چار گنا ہوتا ہے، یعنی 4 مد۔ یہ وزن کے بجائے حجم کے پرانے پیمانے ہیں۔",
                "آج کے معیارات کے مطابق: 1 مد تقریباً 600 گرام/ملی لیٹر پانی اور 1 صاع تقریباً 2.4 کلو گرام/لیٹر پانی کے برابر ہے۔",
                "نبی ﷺ کا معمول یہ تھا کہ آپ 1 مد سے وضو کرتے اور غسل کے لیے 1 صاع سے 5 مد تک استعمال کرتے تھے، یعنی زیادہ پانی سے بچتے تھے۔"
              ],
              "english": [
                "The **Mudd** is a quantity equal to one double-handful, and the **Sā'** is four times that (4 Mudds). These are ancient volumetric, not weight, measures.",
                "According to modern standards: 1 Mudd is roughly 600 grams/milliliters of water, and 1 Sā' is approximately 2.4 kilograms/liters of water.",
                "The Prophet's (ﷺ) routine was to perform Wudu with 1 Mudd and Ghusl with 1 Sā' up to 5 Mudds, meaning he consistently avoided excessive water."
              ]
            }
          },
          {
            "title": {
              "urdu": "پانی کے درست استعمال کی ترغیب",
              "english": "Encouragement for Precise Water Use"
            },
            "content": {
              "urdu": [
                "اس حدیث کا مقصد کسی کو وضو میں پانی کے استعمال سے ڈرانا نہیں ہے، بلکہ پانی کے ضیاع کی صورت میں اسراف کے گناہ سے ڈرانا ہے۔",
                "اگر مسلمان کم پانی کے ذریعے اپنے اعضاء کو اچھی طرح دھو سکتا ہے، تو یہی افضل ہے اور نبی ﷺ کی سنت کے عین مطابق ہے۔",
                "یہ سنت اس بات کی تعلیم دیتی ہے کہ اعتدال اور کفایت شعاری ہر حال میں اسلامی اخلاقیات کا حصہ ہیں۔"
              ],
              "english": [
                "The purpose of this Hadith is not to discourage the use of water in Wudu, but to warn against the sin of extravagance in case of water wastage.",
                "If a Muslim can thoroughly wash their limbs using minimal water, this is superior and in precise accordance with the Prophet's (ﷺ) Sunnah.",
                "This Sunnah teaches that moderation and frugality are part of Islamic ethics in all circumstances."
              ]
            }
          }
        ]
      }
    }
  ]
}
