{
  "hadithId": 74,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["darussalam:151"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب الطهارة",
    "babId": 6
  },

  "takhreej": {
    "arabic": "ضعيف. رواه الدارقطني (151 -152) ",
    "urdu": "یہ حدیث ضعیف ہے۔ اسے دارقطنی نے (151-152) نمبر میں روایت کیا ہے۔ محدثین نے اس کی سند کو کمزور قرار دیا ہے۔",
    "english": "Da'if (Weak). Reported by Ad-Daraqutni (151-152). Scholars of Hadith have ruled its chain of narration to be weak."
  },
  "importantWords": [
    {
      "arabic": "اِحْتَجَمَ",
      "english": "He performed cupping",
      "urdu": "پچھنے لگوائے"
    },
    {
      "arabic": "صَلَّى",
      "english": "He prayed",
      "urdu": "نماز ادا کی"
    },
    {
      "arabic": "لَمْ",
      "english": "Did not",
      "urdu": "نہیں"
    },
    {
      "arabic": "يَتَوَضَّأْ",
      "english": "Perform Wudu’",
      "urdu": "وضو کیا"
    },
    {
      "arabic": "اَلدَّارَقُطْنِيُّ",
      "english": "Ad-Daraqutni (the compiler)",
      "urdu": "امام دارقطنی"
    },
    {
      "arabic": "لَيَّنَه",
      "english": "Ruled it weak/softened it",
      "urdu": "کمزور کہا"
    },
    {
      "arabic": "ضَعِيف",
      "english": "Weak (Hadith grade)",
      "urdu": "ضعیف"
    },
    {
      "arabic": "اَلدَّم",
      "english": "Blood (relevant to the ruling)",
      "urdu": "خون"
    },
    {
      "arabic": "وُضُوء",
      "english": "Ablution",
      "urdu": "وضو"
    },
    {
      "arabic": "أَخْرَجَهُ",
      "english": "Reported it",
      "urdu": "روایت کیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ نبی صلی اللہ علیہ وسلم نے خون نکلنے (پچھنے لگانے) کے باوجود دوبارہ وضو کیے بغیر نماز ادا کی، جس سے یہ ظاہر ہوتا ہے کہ خون کا اخراج وضو کو نہیں توڑتا۔",
    "english": "This Hadith narrates that the Prophet (PBUH) performed cupping (which involves bloodletting) and then prayed without renewing his ablution, suggesting that the discharge of blood does not nullify Wudu'."
  },
  "references": [
    {
      "arabic": "رواه الدارقطني (151 -152)",
      "english": "Reported by Ad-Daraqutni (151-152)"
    },
    {
      "arabic": "سنن الدارقطني، كتاب الطهارة",
      "english": "Sunan Ad-Daraqutni, Kitab at-Tahara"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَنَسِ بْنِ مَالِكٍ  - رضى الله عنه",
        "english": "Anas ibn Malik (May Allah be pleased with him)"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "ضعيف",
    "english": "Da'if (Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم اور فقہی مسئلہ",
        "english": "Meaning of the Hadith and Juristic Issue"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حجامہ اور وضو کی حیثیت",
              "english": "Status of Cupping and Wudu'"
            },
            "content": {
              "urdu": [
                "حدیث کا ظاہری مفہوم یہ ہے کہ پچھنے (حجامہ) لگوانے سے وضو نہیں ٹوٹتا، حالانکہ اس میں خون نکلتا ہے۔",
                "یہ مسئلہ اسلامی فقہ میں 'نواقض الوضو' (وضو توڑنے والی چیزیں) سے متعلق ایک اہم اختلافی نکتہ ہے۔",
                "اس روایت میں نبی صلی اللہ علیہ وسلم کا عمل دلیل کے طور پر پیش کیا گیا ہے کہ خون نکلنے سے وضو قائم رہتا ہے۔"
              ],
              "english": [
                "The apparent meaning of the Hadith is that Wudu' is not nullified by cupping (Hijama), despite the discharge of blood.",
                "This issue is a critical point of difference in Islamic jurisprudence regarding the 'Nawaqidh al-Wudu' (things that nullify ablution).",
                "The Prophet's (PBUH) action in this narration is cited as proof that the emergence of blood does not break Wudu'."
              ]
            }
          },
          {
            "title": {
              "urdu": "وضو توڑنے والے عوامل",
              "english": "Factors that Nullify Wudu'"
            },
            "content": {
              "urdu": [
                "حنفی اور حنبلی فقہاء کے نزدیک جسم سے خون کا بہنا (جیسے حجامہ سے) وضو توڑ دیتا ہے اگر وہ بہہ کر آگے بڑھ جائے۔",
                "شافعی اور مالکی فقہاء کے نزدیک صرف دو راستوں (پیشاب اور پاخانہ کی جگہ) سے نکلنے والی نجاست ہی وضو توڑتی ہے۔",
                "یہ حدیث شافعی اور مالکی مسالک کے موقف کی حمایت کرتی ہے کہ خون کا اخراج بذاتِ خود وضو نہیں توڑتا۔"
              ],
              "english": [
                "Hanafi and Hanbali jurists generally hold that blood flowing from the body (like from cupping) nullifies Wudu' if it flows beyond the wound.",
                "Shafi'i and Maliki jurists hold that only impurities emerging from the two private exits (urine and feces) nullify Wudu'.",
                "This Hadith supports the Shafi'i and Maliki positions that the discharge of blood itself does not automatically break ablution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محدثین کی رائے اور حکم",
        "english": "Scholars' Opinion and Hadith Grading"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دارقطنی کا فیصلہ",
              "english": "Ad-Daraqutni's Ruling"
            },
            "content": {
              "urdu": [
                "امام دارقطنی، جنہوں نے یہ حدیث روایت کی ہے، نے خود ہی اس کی سند کو 'کمزور' (ضعیف/لین) قرار دیا ہے۔",
                "ضعف کا مطلب ہے کہ سند میں راویوں کی کمزوری یا انقطاع کی وجہ سے یہ قابلِ اعتماد ثبوت نہیں ہے۔",
                "اس ضعف کی وجہ سے، فقہی مسئلہ حل کرنے کے لیے علماء نے دیگر صحیح احادیث اور دلائل کا سہارا لیا ہے۔"
              ],
              "english": [
                "Imam Ad-Daraqutni, who narrated this Hadith, himself classified its chain as 'weak' (Da'if/Layyanahu).",
                "Weakness implies that due to flaws in the narrators or discontinuity in the chain, it is not considered reliable evidence.",
                "Because of this weakness, scholars relied on other authentic Ahadith and legal reasoning to resolve the juristic issue."
              ]
            }
          },
          {
            "title": {
              "urdu": "احتیاط کا اصول",
              "english": "The Principle of Precaution"
            },
            "content": {
              "urdu": [
                "جو احادیث خون کے اخراج سے وضو ٹوٹنے کی طرف اشارہ کرتی ہیں، ان میں بھی ضعف پایا جاتا ہے (جیسے 'جو شخص قے کرے یا نکسیر بہے')۔",
                "چونکہ اس باب میں کوئی قطعی صحیح حدیث موجود نہیں، لہٰذا احتیاط کا تقاضا ہے کہ وضو کو برقرار رکھا جائے۔",
                "اکثر علماء نے وضو نہ ٹوٹنے کے موقف کو ترجیح دی ہے، یا وضو کو مستحب (پسندیدہ) قرار دیا ہے تاکہ اختلاف سے بچا جا سکے۔"
              ],
              "english": [
                "Even the Ahadith indicating that blood discharge nullifies Wudu' contain some weakness (e.g., 'whoever vomits or has a nosebleed').",
                "Since there is no decisively authentic Hadith on this specific point, precaution often suggests maintaining the Wudu'.",
                "Most scholars lean toward the view that Wudu' is not broken, or recommend performing Wudu' (Istihbab) to avoid the scholarly disagreement."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں رہنمائی",
        "english": "Guidance in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طبی معاملات کے بعد",
              "english": "After Medical Procedures"
            },
            "content": {
              "urdu": [
                "حجامہ یا خون ٹیسٹ کروانے کے بعد، جہاں خون نکلا ہو، نماز سے پہلے وضو کا اعادہ مستحب ہے۔",
                "یہ حکم اس لیے دیا جاتا ہے تاکہ نمازی کو طہارت کی حالت کا مکمل یقین ہو اور دل میں وسوسہ نہ رہے۔",
                "اس طرح کی احتیاط رسول اللہ صلی اللہ علیہ وسلم کے عمومی طہارت کے اصولوں کی روح کے مطابق ہے۔"
              ],
              "english": [
                "After performing cupping (Hijama) or a blood test where blood has been drawn, renewing Wudu' before prayer is recommended (Mustahabb).",
                "This is advised so the worshipper can be completely certain of their state of purity and to avoid inner doubt.",
                "Such caution aligns with the overall spirit of the Prophet's (PBUH) principles regarding ritual purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "اختلاف کا احترام",
              "english": "Respect for Disagreement"
            },
            "content": {
              "urdu": [
                "مختلف فقہی مسالک اس حدیث کی صحت میں اختلاف کی وجہ سے مختلف احکام پر عمل پیرا ہیں۔",
                "ایک مسلمان کو اپنے علاقے کے فقہاء کے اختیار کردہ موقف پر عمل کرنا چاہیے اور دیگر کی رائے کا احترام کرنا چاہیے۔",
                "یہ وسیع فقہی تنوع شریعت میں آسانی اور وسعت کی علامت ہے، اور یہ دلیل کی قوت پر مبنی ہے۔"
              ],
              "english": [
                "Different juristic schools follow different rulings due to the disagreement over the authenticity of this and related Ahadith.",
                "A Muslim should follow the stance adopted by the scholars of their region while respecting the views of others.",
                "This wide juristic diversity is a sign of ease and breadth within Shariah, and it is based on the strength of evidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت اور عام طہارت",
        "english": "Sunnah and General Purity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی کا معمول",
              "english": "The Prophet's Normal Practice"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم ہر وقت طہارت اور پاکیزگی کا خیال رکھتے تھے، جیسا کہ دیگر احادیث سے ثابت ہے۔",
                "ذکرِ اللہ کی طرح، وضو بھی ایک مستقل عبادت ہے، اس لیے اس کا اعادہ ایک فضیلت والا عمل ہے۔",
                "اگرچہ یہ حدیث ضعیف ہے، لیکن یہ طہارت کے اصولوں کی روشنی میں احتیاطی تدبیر کی اہمیت اجاگر کرتی ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) maintained purity and cleanliness at all times, as established by other narrations.",
                "Like Dhikr, Wudu' is a continuous act of worship, making its renewal a virtuous practice.",
                "Even though this specific Hadith is weak, it highlights the importance of precautionary measures in light of the principles of purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "پچھنے (حجامہ) کا ذکر",
              "english": "Mention of Cupping (Hijama)"
            },
            "content": {
              "urdu": [
                "حجامہ رسول اللہ صلی اللہ علیہ وسلم کی طبّی سنتوں میں سے ہے اور علاج کا ایک بہترین ذریعہ ہے۔ ",
                "حجامہ سے نکلنے والا خون اگرچہ نجس ہے، لیکن اس کا خروج بذاتِ خود وضو نہیں توڑتا (راجح قول کے مطابق)۔",
                "اصل حکم نماز سے پہلے طہارت کو یقینی بنانا ہے، اور حجامہ کے بعد صرف زخم کو پاک صاف کرنا کافی ہو گا۔"
              ],
              "english": [
                "Cupping is one of the Prophet's (PBUH) medical Sunnahs and an excellent means of treatment. ",
                "The blood released from cupping is considered ritually impure (Najis), but its emergence itself does not nullify Wudu' (according to the stronger opinion).",
                "The main requirement is ensuring purity before prayer, and merely cleaning the wound after cupping would suffice."
              ]
            }
          }
        ]
      }
    }
  ]
}
