{
  "hadithId": 906,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bulugh/8/906", "abudawud:2133", "tirmidhi:1141"],
    "kitabId": 8,
    "inKitabBab": 6,
    "arabicBook": "كتاب النكاح",
    "babId": 69
  },
 
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (2/347)، وأبو داود (2133)، والنسائي (3942)، والترمذي (1141)، وابن ماجه (1969). وصححه ابن حبان والحاكم والذهبي.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد، ابوداؤد (2133)، نسائی (3942)، ترمذی (1141) اور ابن ماجہ (1969) نے روایت کیا ہے۔ ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by Ahmad, Abu Dawud (2133), An-Nasa'i (3942), At-Tirmidhi (1141), and Ibn Majah (1969). It was authenticated by Ibn Hibban and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "اِمْرَأَتَانِ",
      "english": "Two wives",
      "urdu": "دو بیویاں"
    },
    {
      "arabic": "فَمَالَ",
      "english": "Inclined / Favored",
      "urdu": "میلان کیا / جھک گیا"
    },
    {
      "arabic": "يَوْمَ اَلْقِيَامَةِ",
      "english": "Day of Resurrection",
      "urdu": "قیامت کا دن"
    },
    {
      "arabic": "شِقُّهُ",
      "english": "His side",
      "urdu": "اس کا پہلو"
    },
    {
      "arabic": "مَائِلٌ",
      "english": "Leaning / Hanging",
      "urdu": "جھکا ہوا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں تعدد ازواج کی صورت میں بیویوں کے درمیان عدل و انصاف کی سخت تاکید کی گئی ہے اور ناانصافی کرنے والے کے لیے رسوا کن سزا کی خبر دی گئی ہے۔",
    "english": "This Hadith emphasizes absolute justice between wives in polygyny and warns of a humiliating punishment for those who favor one over the other."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2133)",
      "english": "Reported by Abu Dawud (2133)"
    },
    {
      "arabic": "رواه الترمذي (1141)",
      "english": "Reported by At-Tirmidhi (1141)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah Al-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عدل و انصاف کی اہمیت",
        "english": "Importance of Justice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حقوق کی مساوی ادائیگی",
              "english": "Equal Fulfillment of Rights"
            },
            "content": {
              "urdu": [
                "اسلام ایک سے زائد شادیوں کی صورت میں مکمل برابری کا مطالبہ کرتا ہے۔",
                "نان و نفقہ، رہائش اور رات گزارنے میں برابری شرعی طور پر فرض ہے۔",
                "کسی ایک بیوی کو دوسری پر ترجیح دینا سنگین گناہ اور ظلم ہے۔"
              ],
              "english": [
                "Islam demands complete equality when maintaining more than one wife.",
                "Equality in spending, housing, and overnight stays is religiously obligatory.",
                "Favoring one wife over another is considered a grave sin and injustice."
              ]
            }
          },
          {
            "title": {
              "urdu": "میلان سے مراد",
              "english": "Meaning of Inclination"
            },
            "content": {
              "urdu": [
                "اس حدیث میں ممانعت اس میلان کی ہے جو حقوق کی ادائیگی میں ہو۔",
                "دلی محبت انسان کے اختیار میں نہیں، اس لیے اس پر پکڑ نہیں ہے۔",
                "تاہم، ظاہری برتاؤ اور حقوق میں فرق کرنا وعید کا باعث ہے۔"
              ],
              "english": [
                "The prohibition refers to inclination in fulfilling tangible rights.",
                "Internal heart-felt love is beyond control and not subject to punishment.",
                "However, discrimination in outward behavior and rights triggers the warning."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قیامت کی رسوائی",
        "english": "Disgrace on Judgment Day"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جیسی کرنی ویسی بھرنی",
              "english": "As You Sow, So Shall You Reap"
            },
            "content": {
              "urdu": [
                "دنیا میں حق سے انحراف کرنے والے کا جسم قیامت میں ٹیڑھا ہوگا۔",
                "یہ سزا اس کے دنیاوی عمل کی ایک جسمانی اور علامتی تصویر ہوگی۔",
                "مخلوق کے سامنے یہ حالت اس کی ناانصافی کی کھلی گواہی دے گی۔"
              ],
              "english": [
                "The body of one who deviated from truth will be crooked on Judgment Day.",
                "This punishment serves as a physical and symbolic reflection of his worldly acts.",
                "This condition will be a public testimony of his injustice before all creation."
              ]
            }
          },
          {
            "title": {
              "urdu": "عوامی عبرت",
              "english": "Public Admonition"
            },
            "content": {
              "urdu": [
                "جھکا ہوا پہلو اس شخص کی رسوائی کا باعث بنے گا تاکہ لوگ دیکھ لیں۔",
                "اللہ تعالیٰ ظالموں کو محشر کے میدان میں سب کے سامنے ظاہر کر دے گا۔",
                "یہ منظر دوسروں کے لیے سبق ہوگا کہ وہ عدل کو برقرار رکھیں۔"
              ],
              "english": [
                "The leaning side will cause public disgrace so people may witness it.",
                "Allah will expose the unjust before everyone on the plains of Mashar.",
                "This sight serves as a lesson for others to strictly maintain justice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی استحکام",
        "english": "Social Stability"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی امن",
              "english": "Domestic Peace"
            },
            "content": {
              "urdu": [
                "بیویوں میں ناانصافی گھر میں حسد اور نفرت کو جنم دیتی ہے۔",
                "عدل و انصاف ہی خاندان کو بکھرنے سے بچانے کا واحد راستہ ہے۔",
                "اسلامی معاشرے کی بنیاد مضبوط اور منظم خاندان پر رکھی گئی ہے۔"
              ],
              "english": [
                "Injustice between wives breeds jealousy and hatred within the home.",
                "Justice is the only way to prevent the family structure from collapsing.",
                "The foundation of Islamic society is built upon a strong, organized family."
              ]
            }
          },
          {
            "title": {
              "urdu": "اولاد پر اثرات",
              "english": "Effects on Children"
            },
            "content": {
              "urdu": [
                "والد کی ناانصافی بچوں کی تربیت اور نفسیات پر برا اثر ڈالتی ہے۔",
                "ماؤں کے درمیان فرق اولاد کے درمیان بھی دشمنی پیدا کر سکتا ہے۔",
                "منصف باپ اپنی اولاد کے لیے بہترین رول ماڈل ثابت ہوتا ہے۔"
              ],
              "english": [
                "A father's injustice negatively impacts the upbringing and psychology of children.",
                "Discrimination between mothers can create enmity among siblings.",
                "A just father serves as the best role model for his offspring."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعدد ازواج کی ذمہ داری",
        "english": "Responsibility of Polygyny"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صرف رغبت نہیں، بوجھ بھی",
              "english": "Not Just Desire, But a Burden"
            },
            "content": {
              "urdu": [
                "دوسری شادی صرف ایک حق نہیں بلکہ ایک عظیم آزمائش اور ذمہ داری ہے۔",
                "اگر عدل کا خوف ہو تو ایک ہی شادی پر اکتفا کرنا واجب ہے۔",
                "اسلامی احکامات نفسانی خواہشات پر قابو پانے کا نام ہیں۔"
              ],
              "english": [
                "Polygyny is not just a right but a great trial and responsibility.",
                "If one fears being unable to do justice, sticking to one is mandatory.",
                "Islamic rulings are meant to discipline and control personal desires."
              ]
            }
          },
          {
            "title": {
              "urdu": "خوفِ خدا",
              "english": "Fear of Allah"
            },
            "content": {
              "urdu": [
                "گھر کے معاملات میں اللہ سے ڈرنا ایمان کی نشانی ہے۔",
                "مومن ہمیشہ اپنی ذمہ داریوں کے بارے میں جوابدہی کا احساس رکھتا ہے۔",
                "یہ حدیث مرد کو اپنی طاقت کا غلط استعمال کرنے سے روکتی ہے۔"
              ],
              "english": [
                "Fearing Allah in domestic affairs is a true sign of faith.",
                "A believer always remains conscious of accountability for his duties.",
                "This Hadith prevents men from abusing their domestic authority."
              ]
            }
          }
        ]
      }
    }
  ]
}