{
  "hadithId": 753,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bulugh/11/3"
    ],
    "kitabId": 7,
    "inKitabBab": 11,
    "arabicBook": "بلوغ المرام",
    "babId": 52
  },
  "name": {
    "arabic": " وَعَنْ يَعْلَى بْنِ أُمَيَّةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَتَتْكَ رُسُلِي فَأَعْطِهِمْ ثَلَاثِينَ دِرْعاً \", قُلْتُ: يَا رَسُولَ اَللَّهِ ! أَعَارِيَةٌ مَضْمُونَةٌ أَوْ عَارِيَةٌ مُؤَدَّاةٌ? قَالَ: بَلْ عَارِيَةٌ مُؤَدَّاةٌ } رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ",
    "urdu": " سیدنا یعلیٰ بن امیہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ارشاد فرمایا کہ ”تمہارے پاس جب میرے ایلچی و قاصد آئیں تو ان کو تیس زرہیں دے دینا۔“ میں نے عرض کیا اے اللہ کے رسول! کیا عاریتاً جس میں ضمانت ہو گی یا اس ادھار کے طور پر جو قابل واپسی ہو گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”ایسا ادھار جو ادا کر دیا جائے گا۔“ اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے اور ابن حبان نے صحیح کہا ہے۔ ",
    "english": "Narrated Ya'la bin Umayyah (RA): Allah's Messenger (ﷺ) said to me, 'When my messengers come to you, give them thirty coats of mail.' I asked, 'O Messenger of Allah! Is it a guaranteed loan (for which I will be compensated if lost) or a loan merely for use to be returned?' He (ﷺ) replied, 'Rather, it is a loan merely for use to be returned (to its owner).'"
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد ( 4 / 222 )‏، وأبو داود ( 3566 )‏، والنسائي في الكبرى ( 3 / 409 )‏، وابن حبان ( 1173 )‏.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے امام احمد (4/222)، ابوداؤد (3566)، نسائی (3/409) اور ابن حبان (1173) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Ahmad (4/222), Abu Dawud (3566), An-Nasa'i in Al-Kubra (3/409), and Ibn Hibban (1173)."
  },
  "importantWords": [
    {
      "arabic": "رُسُلِي",
      "english": "My messengers / envoys",
      "urdu": "میرے قاصد / ایلچی"
    },
    {
      "arabic": "دِرْعاً",
      "english": "Coats of mail / Armor",
      "urdu": "زرہیں"
    },
    {
      "arabic": "أَعَارِيَةٌ",
      "english": "Is it a loan?",
      "urdu": "کیا یہ ادھار ہے؟"
    },
    {
      "arabic": "مَضْمُونَةٌ",
      "english": "Guaranteed / Insured",
      "urdu": "ضمانت والی"
    },
    {
      "arabic": "مُؤَدَّاةٌ",
      "english": "To be returned / repaid",
      "urdu": "قابلِ واپسی / ادا کردہ"
    },
    {
      "arabic": "أَعْطِهِمْ",
      "english": "Give them",
      "urdu": "انہیں دے دو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں عاریت (ادھار لینے) کی اقسام اور ان کی واپسی کی ذمہ داری کو واضح کیا گیا ہے، خاص طور پر جنگی سازوسامان کے لین دین کے حوالے سے۔",
    "english": "This Hadith clarifies the types of loans (Aariyah) and the responsibility for their return, specifically regarding the borrowing of military equipment."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (3566)",
      "english": "Sunan Abu Dawud (3566)"
    },
    {
      "arabic": "مسند أحمد (4/222)",
      "english": "Musnad Ahmad (4/222)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "يعلى بن أمية",
        "english": "Ya'la bin Umayyah"
      },
      "slug": "yala-bin-umayyah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FmS3m6qS0YQ",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عاریت کی حقیقت اور اقسام",
        "english": "Nature and Types of Loans (Aariyah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاریتِ مضمونہ اور مؤداۃ",
              "english": "Guaranteed vs. Returnable Loans"
            },
            "content": {
              "urdu": [
                "عاریتِ مضمونہ وہ ہے جس کے ضائع ہونے پر تاوان دینا پڑتا ہے۔",
                "عاریتِ مؤداۃ سے مراد وہ چیز ہے جو استعمال کے بعد اصل حالت میں واپس کرنی ہو۔",
                "نبی کریم ﷺ نے یہاں واپسی کی یقین دہانی کروا کر اطمینان دلایا۔"
              ],
              "english": [
                "Aariyah Madmunah refers to a loan where compensation is due if the item is lost.",
                "Aariyah Mu'addah means an item borrowed for use that must be returned as is.",
                "The Prophet (ﷺ) provided assurance of the items' return to ease the lender's mind."
              ]
            }
          },
          {
            "title": {
              "urdu": "سوال کی علمی اہمیت",
              "english": "The Intellectual Merit of the Question"
            },
            "content": {
              "urdu": [
                "سیدنا یعلیٰ رضی اللہ عنہ کا سوال فقہی باریکیوں کو سمجھنے کی علامت ہے۔",
                "کسی بھی معاہدے سے پہلے شرائط کی وضاحت کر لینا تنازعات سے بچاتا ہے۔",
                "دین کے معاملے میں وضاحت طلب کرنا صحابہ کرام کا بہترین طریقہ تھا۔"
              ],
              "english": [
                "Ya'la (RA)'s question demonstrates a deep understanding of juristic nuances.",
                "Clarifying terms before any agreement prevents future disputes.",
                "Seeking clarification in religious and legal matters was the way of the Companions."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ریاستی ضروریات اور تعاون",
        "english": "State Needs and Cooperation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دفاعی سازوسامان کا حصول",
              "english": "Acquiring Defense Equipment"
            },
            "content": {
              "urdu": [
                "ریاست اپنی دفاعی ضروریات کے لیے شہریوں سے سامان مستعار لے سکتی ہے۔",
                "زرہوں کا طلب کرنا غزوہ حنین یا کسی عسکری مہم کی تیاری کا حصہ تھا۔",
                "اسلامی ریاست میں شہریوں کا تعاون قومی سلامتی کے لیے اہم ہے۔"
              ],
              "english": [
                "The state may borrow equipment from citizens for its defense needs.",
                "Requesting armor was likely part of preparations for the Battle of Hunayn or other missions.",
                "Cooperation from citizens is vital for national security in an Islamic state."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالی حقوق کا تحفظ",
              "english": "Protection of Financial Rights"
            },
            "content": {
              "urdu": [
                "حاکمِ وقت پر لازم ہے کہ وہ ادھار لی گئی اشیاء کی واپسی کو یقینی بنائے۔",
                "عوامی ملکیت کا احترام اسلامی حکمرانی کا بنیادی ستون ہے۔",
                "بغیر معاوضے کے چیز لینا (عاریت) بھائی چارے اور تعاون کی علامت ہے۔"
              ],
              "english": [
                "The ruler is obligated to ensure the return of borrowed items.",
                "Respect for private property is a fundamental pillar of Islamic governance.",
                "Borrowing without a fee (Aariyah) is a sign of brotherhood and cooperation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکامات اور تاوان",
        "english": "Juristic Rulings and Compensation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نقصان کی صورت میں ذمہ داری",
              "english": "Responsibility in Case of Loss"
            },
            "content": {
              "urdu": [
                "اگر عاریت پر لی گئی چیز میں کوتاہی ہو تو تاوان لازم آتا ہے۔",
                "فقہاء کے درمیان 'مضمونہ' اور 'غیر مضمونہ' پر تفصیلی ابواب موجود ہیں۔",
                "حدیث سے ثابت ہے کہ اصل چیز کی واپسی ہی بنیادی مقصد ہے۔"
              ],
              "english": [
                "If a borrowed item is damaged due to negligence, compensation is mandatory.",
                "Jurists have detailed chapters on guaranteed vs. non-guaranteed loans.",
                "The Hadith establishes that the return of the original item is the primary goal."
              ]
            }
          },
          {
            "title": {
              "urdu": "امانت داری کا تقاضا",
              "english": "Requirements of Trustworthiness"
            },
            "content": {
              "urdu": [
                "مستعار لی گئی چیز امانت ہے جسے ضائع ہونے سے بچانا واجب ہے۔",
                "اگر لینے والا اسے صحیح طریقے سے استعمال کرے تو وہ امین ہے۔",
                "اسلامی قانون میں 'یدِ امانت' اور 'یدِ ضمان' کے اصول اسی سے اخذ ہیں۔"
              ],
              "english": [
                "A borrowed item is a trust that must be protected from loss or damage.",
                "If the borrower uses it properly, they are considered a trustee.",
                "Principles of 'Hand of Trust' and 'Hand of Guarantee' are derived from such texts."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تعلیمی اسباق",
        "english": "Ethical and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "باہمی امداد کا جذبہ",
              "english": "Spirit of Mutual Assistance"
            },
            "content": {
              "urdu": [
                "دوسروں کی ضرورت کے وقت اپنا مال پیش کرنا اعلیٰ صفت ہے۔",
                "صحابہ کرام اللہ کے رسول ﷺ کی پکار پر اپنا قیمتی مال بھی پیش کر دیتے تھے۔",
                "یہ عمل معاشرے میں سخاوت اور خیر خواہی کو فروغ دیتا ہے۔"
              ],
              "english": [
                "Offering one's wealth during others' time of need is a noble quality.",
                "The Companions would offer their precious assets at the Prophet's (ﷺ) call.",
                "This practice promotes generosity and goodwill within the community."
              ]
            }
          },
          {
            "title": {
              "urdu": "لین دین میں شفافیت",
              "english": "Transparency in Transactions"
            },
            "content": {
              "urdu": [
                "کاروباری یا سماجی لین دین میں الفاظ کا چناؤ واضح ہونا چاہیے۔",
                "مبہم بات چیت بعد میں غلط فہمیوں اور لڑائی کا باعث بنتی ہے۔",
                "نبی کریم ﷺ کا جواب انتہا درجے کی وضاحت پر مبنی تھا۔"
              ],
              "english": [
                "Choice of words must be clear in commercial or social transactions.",
                "Ambiguous communication leads to misunderstandings and conflicts later on.",
                "The Prophet's (ﷺ) response was based on ultimate clarity."
              ]
            }
          }
        ]
      }
    }
  ]
}