{
  "hadithId": 72,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["nisa'i:2151"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب الطهارة",
    "babId": 6
  },

  "takhreej": {
    "arabic": " أخرجه مالك في الموطأ، القرآن، باب الأمر بالوضوء لمن مس القرآن: 1 /199 وسنده ضعيف، وللحديث شاهد قوي عند الدار قطني: 1 / 121، حديث: 429، والرواية عن الكتاب صحيحة مالم يثبت الجرح القادح فيه.",
    "urdu": "اسے مالک نے 'الموطأ' میں 'کتاب القرآن، باب الامر بالوضوء لمن مس القرآن: 1/199' میں روایت کیا ہے اور اس کی سند ضعیف ہے۔ اس حدیث کا ایک قوی شاہد (گواہی دینے والی روایت) دارقطنی میں موجود ہے (1/121، حدیث: 429)۔ اور 'عمرو بن حزم' کے خط کے ذریعے یہ روایت صحیح سمجھی جاتی ہے جب تک کہ اس پر کوئی قادح جرح ثابت نہ ہو جائے۔",
    "english": "Reported by Malik in Al-Muwatta, The Qur'an, Chapter on the command to perform Wudu' for one who touches the Qur'an: 1/199, and its chain is weak. The Hadith has a strong corroborating evidence (Shahid Qawi) reported by Ad-Daraqutni: 1/121, Hadith: 429. The narration transmitted via the letter (of Amr ibn Hazm) is considered sound unless a devastating criticism is proven against it."
  },
  "importantWords": [
    {
      "arabic": "الْكِتَابِ",
      "english": "The letter/document",
      "urdu": "خط / تحریر"
    },
    {
      "arabic": "عَمْرِو بْنِ حَزْمٍ",
      "english": "'Amr ibn Hazm",
      "urdu": "عمرو بن حزم (صحابی)"
    },
    {
      "arabic": "يَمَسَّ",
      "english": "To touch",
      "urdu": "چھونا"
    },
    {
      "arabic": "الْقُرْآنَ",
      "english": "The Qur’an (Mus'haf)",
      "urdu": "قرآن مجید"
    },
    {
      "arabic": "طَاهِرٌ",
      "english": "One who is pure (in Wudu' or Ghusl)",
      "urdu": "پاک شخص"
    },
    {
      "arabic": "مُرْسَلاً",
      "english": "Mursal (Hadith where the Tabi'i reports directly from the Prophet)",
      "urdu": "مرسل (سند میں انقطاع)"
    },
    {
      "arabic": "وَصَلَهُ",
      "english": "Connected it (with a complete chain)",
      "urdu": "موصولاً روایت کیا"
    },
    {
      "arabic": "مَعْلُولٌ",
      "english": "Defective (having a hidden flaw)",
      "urdu": "معلول (علت والا)"
    },
    {
      "arabic": "شَاهِد",
      "english": "Corroborating evidence/witness",
      "urdu": "شاہد (گواہی)"
    },
    {
      "arabic": "سَنَد",
      "english": "Chain of narration",
      "urdu": "سند"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث عمرو بن حزم کے نام نبی صلی اللہ علیہ وسلم کے خط کا حوالہ دیتی ہے، جس میں یہ حکم دیا گیا تھا کہ قرآن کو صرف مکمل طہارت (وضو یا غسل) کی حالت میں ہی چھونا چاہیے۔",
    "english": "This Hadith refers to the letter sent by the Prophet (peace be upon him) to 'Amr ibn Hazm, which stipulates the ruling that the physical copy of the Qur'an (Mus'haf) should only be touched by a person who is in a state of ritual purity (Tahara)."
  },
  "references": [
    {
      "arabic": "رواه مالك في الموطأ، ١ / ١٩٩",
      "english": "Reported by Malik in Al-Muwatta, 1/199"
    },
    {
      "arabic": "رواه الدار قطني، ١ / ١٢١، حديث: ٤٢٩ (شاهد قوي)",
      "english": "Reported by Ad-Daraqutni, 1/121, Hadith 429 (Strong corroboration)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَبْدِ اَللَّهِ بْنِ أَبِي بَكْرٍ",
        "english": "Abdullah ibn Abi Bakr"
      },
      "slug": "abdullah-ibn-abi-bakr"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عَمْرِو بْنِ حَزْمٍ",
        "english": "'Amr ibn Hazm"
      },
      "slug": "amr-ibn-hazm"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "له أصل صحيح",
    "english": "Has a sound basis"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قرآن کو چھونے کا حکم",
        "english": "The Ruling on Touching the Qur'an"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت کی شرط",
              "english": "Condition of Purity (Tahara)"
            },
            "content": {
              "urdu": [
                "حدیث عمرو بن حزم کے خط کے ذریعے یہ اصول ثابت کرتی ہے کہ قرآن کو صرف باوضو شخص ہی چھو سکتا ہے۔",
                "یہ طہارت، وضو یا غسل کی صورت میں ہو سکتی ہے، جو حدثِ اصغر اور حدثِ اکبر دونوں کو دور کرے۔",
                "یہ حکم قرآن مجید کی تعظیم اور اس کے تقدس کو برقرار رکھنے کے لیے شریعت کی طرف سے دیا گیا ہے۔"
              ],
              "english": [
                "The Hadith establishes the principle, via the letter of 'Amr ibn Hazm, that the Qur'an must only be touched by a person with Wudu'.",
                "This purity can be in the form of Wudu' or Ghusl, removing both minor and major ritual impurity (Hadath).",
                "This ruling is mandated by Shariah to maintain the respect and sanctity due to the Glorious Qur'an (Mus'haf)."
              ]
            }
          },
          {
            "title": {
              "urdu": "مالک اور دیگر کی روایت",
              "english": "Narration by Malik and Others"
            },
            "content": {
              "urdu": [
                "امام مالک نے اسے 'مرسل' روایت کیا ہے، جس میں صحابی کا ذکر نہیں ہوتا اور سند میں انقطاع ہوتا ہے۔",
                "لیکن امام نسائی اور ابن حبان نے اسے 'موصول' (مکمل سند کے ساتھ) روایت کیا، جو اس کی سند کو مضبوط کرتا ہے۔",
                "اس روایت کی مختلف اسناد اور 'دارقطنی' کے قوی شاہد کی بنا پر فقہاء نے اسے قابل عمل تسلیم کیا ہے۔"
              ],
              "english": [
                "Imam Malik narrated it as 'Mursal', where the Companion is omitted, indicating a break in the chain.",
                "However, An-Nasa'i and Ibn Hibban narrated it as 'Mawsul' (connected chain), strengthening its authenticity.",
                "Due to various chains and the strong supporting evidence from Ad-Daraqutni, jurists have largely accepted this ruling."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مضمرات اور اختلاف",
        "english": "Juristic Implications and Differences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "The Stance of the Majority Jurists"
            },
            "content": {
              "urdu": [
                "جمہور ائمہ (بشمول چاروں مذاہب) اس حدیث کی بنیاد پر یہ رائے رکھتے ہیں کہ مصحف کو بغیر طہارت کے چھونا حرام ہے۔",
                "طہارت سے مراد یہاں وضو ہے، اور یہ شرط مصحف کی جلد یا غلاف کو چھونے پر بھی لاگو ہوتی ہے۔",
                "یہ حکم صرف اس صورت میں ہے جب قرآن کو براہ راست چھوا جائے، تلاوت زبانی یا دستانے سے چھونے پر نہیں۔"
              ],
              "english": [
                "The majority of Imams (including the four schools) hold, based on this Hadith, that it is forbidden to touch the Mus'haf without ritual purity.",
                "Purity here refers to Wudu', and this condition generally applies even to touching the cover or binding of the Mus'haf.",
                "This ruling applies specifically when touching the Qur'an directly, not for reciting from memory or touching it with gloves."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث کی 'علت' کا مفہوم",
              "english": "Meaning of the Hadith being 'Defective'"
            },
            "content": {
              "urdu": [
                "محدثین کے نزدیک 'معلول' ہونے کا مطلب ہے کہ اس کی سند میں کوئی پوشیدہ نقص ہے۔",
                "یہ علت اس کی موصول سند میں پائی جاتی ہے، لیکن 'عمرو بن حزم' کے خط کی اصل تحریر کی حیثیت زیادہ قوی ہے۔",
                "محدثین کا اس کی سند پر اختلاف ہونے کے باوجود، حکم کی صداقت پر تقریباً اجماع ہے اور یہ عمل میں ہے۔"
              ],
              "english": [
                "For Hadith scholars, 'Ma‘lul' means the chain has a subtle, hidden defect (Illah).",
                "This defect is found in its connected chain (Mawsul), but the authenticity of the original letter of 'Amr ibn Hazm carries greater weight.",
                "Despite the scholarly disagreement on the chain, the practical ruling derived from it is almost universally accepted and practiced."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی اور ادب",
        "english": "Practical Guidance and Etiquette"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تلاوت اور مسح کا فرق",
              "english": "Difference Between Recitation and Touching"
            },
            "content": {
              "urdu": [
                "وضو کے بغیر زبانی یا فون سے قرآن پڑھنے کی اجازت ہے، لیکن اسے ہاتھ لگانے سے منع کیا گیا ہے۔",
                "بچوں کو قرآن سکھانے کے لیے یا ضرورت کے تحت، انہیں پاکی کے بغیر چھونے کی گنجائش بعض علماء نے دی ہے۔",
                "تاہم، مسلمانوں کو ہر ممکن صورت میں وضو کے ساتھ ہی مصحف کو چھونے کا ادب ملحوظ رکھنا چاہیے۔"
              ],
              "english": [
                "Reciting the Qur'an verbally or from a phone is permissible without Wudu', but touching the physical Mus'haf is prohibited.",
                "Some scholars permit children to touch it without purity for educational purposes or out of necessity.",
                "Nevertheless, Muslims should always strive to observe the etiquette of touching the Mus'haf only while in a state of Wudu'."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن کا احترام",
              "english": "Respect for the Qur'an"
            },
            "content": {
              "urdu": [
                "یہ حکم محض طہارت کا نہیں، بلکہ اللہ کے کلام کے لیے انتہائی احترام کا اظہار ہے۔",
                "جب کوئی شخص نماز کے لیے طہارت حاصل کرتا ہے، تو یہ دراصل ایک تعبدی حکم ہے۔",
                "اسی طرح قرآن کو طہارت کے ساتھ چھونا اس کی عظمت کا اعتراف ہے، اور یہ ایک افضل عمل ہے۔"
              ],
              "english": [
                "This ruling is not just about cleanliness, but a profound expression of reverence for the Word of Allah.",
                "Just as purification is a devotional command for prayer, it elevates the status of the action.",
                "Touching the Qur'an with purity is an acknowledgment of its greatness, making it a highly preferable act (Mustahabb)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خطِ عمرو بن حزم کی اہمیت",
        "english": "The Significance of 'Amr ibn Hazm's Letter"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سند کے تناظر میں اہمیت",
              "english": "Importance in Context of Narration"
            },
            "content": {
              "urdu": [
                "یہ روایت اس خط کے ذریعے آئی ہے جو نبی صلی اللہ علیہ وسلم نے باقاعدہ لکھوا کر بھیجا تھا۔",
                "مکتوب روایات، جو سرکاری دستاویزات کا حصہ ہوتی ہیں، ان کی دلالت (ثبوت) اکثر سند سے زیادہ قوی ہوتی ہے۔",
                "اسی وجہ سے محدثین نے سند پر کلام کے باوجود اس کے متن کو صحیح الاصل (بنیادی طور پر درست) مانا ہے۔"
              ],
              "english": [
                "This narration comes through a letter officially written and dispatched by the Prophet (PBUH).",
                "Written narrations that are part of official state documents often hold stronger evidential weight than oral chains.",
                "For this reason, despite objections to its chain (Sanad), Hadith scholars considered its text (Matn) fundamentally sound."
              ]
            }
          },
          {
            "title": {
              "urdu": "نظامِ فقہ میں بنیادی اصول",
              "english": "Fundamental Principle in Fiqh"
            },
            "content": {
              "urdu": [
                "یہ حدیث طہارت اور نجاست سے متعلق احکام کا ایک بنیادی اصول قائم کرتی ہے۔",
                "طہارت کو نصف ایمان قرار دیا گیا ہے، اور قرآن کے ساتھ اس کا جوڑ اس کی اہمیت کو دوچند کرتا ہے۔",
                "اسلامی فقہ میں اس اصول پر عمل درآمد ضروری ہے تاکہ عبادت کی شرائط پوری ہو سکیں۔"
              ],
              "english": [
                "This Hadith establishes a fundamental principle regarding the rulings of purity (Tahara) and impurity (Najasah).",
                "Purity is deemed half of faith, and its link with the Qur'an doubles its significance.",
                "Adherence to this principle is essential in Islamic jurisprudence to ensure the conditions for worship are met."
              ]
            }
          }
        ]
      }
    }
  ]
}
