{
  "hadithId": 1163,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/12/40"],
    "kitabId": 12,
    "inKitabBab": 3,
    "arabicBook": "كتاب الأضحية",
    "babId": 94
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود (2802)، والنسائي (4369)، والترمذي (1497)، وابن ماجه (3144)، وأحمد (4/284). وقال الترمذي: حديث حسن صحيح.",
    "urdu": "یہ حدیث صحیح ہے۔ اسے ابوداؤد، نسائی، ترمذی، ابن ماجہ اور احمد نے روایت کیا ہے۔ امام ترمذی اور ابن حبان نے اس کی صحت کی تصدیق کی ہے۔",
    "english": "Sahih. Reported by Abu Dawud (2802), An-Nasa'i (4369), At-Tirmidhi (1497), Ibn Majah (3144), and Ahmad (4/284). At-Tirmidhi graded it Hasan Sahih."
  },
  "importantWords": [
    {
      "arabic": "اَلضَّحَايَا",
      "english": "Sacrificial animals",
      "urdu": "قربانی کے جانور"
    },
    {
      "arabic": "اَلْعَوْرَاءُ",
      "english": "One-eyed",
      "urdu": "کانا جانور"
    },
    {
      "arabic": "اَلْمَرِيضَةُ",
      "english": "Sick",
      "urdu": "بیمار جانور"
    },
    {
      "arabic": "اَلْعَرْجَاءُ",
      "english": "Lame",
      "urdu": "لنگڑا جانور"
    },
    {
      "arabic": "اَلْبَيِّنُ",
      "english": "Obvious / Evident",
      "urdu": "واضح / نمایاں"
    },
    {
      "arabic": "لَا تُنْقِي",
      "english": "Emaciated / No marrow",
      "urdu": "بہت کمزور / بے گودا"
    }
  ],
  "summary": {
    "urdu": "قربانی کے لیے جانور کا عیب دار ہونا اسے نااہل بنا دیتا ہے؛ اندھا، بیمار، لنگڑا اور انتہائی کمزور جانور قربانی کے لیے جائز نہیں ہیں۔",
    "english": "Sacrificial animals must be free from major defects; those that are blind, sick, lame, or severely emaciated are not valid for sacrifice."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2802)",
      "english": "Sunan Abi Dawud (2802)"
    },
    {
      "arabic": "سنن الترمذي (1497)",
      "english": "Sunan at-Tirmidhi (1497)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "البراء بن عازب",
        "english": "Al-Bara' bin 'Azib"
      },
      "slug": "al-bara-bin-azib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=3-EwLg8X2Xw",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قربانی کے جانور کے معیارات",
        "english": "Standards for Sacrificial Animals"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظاہری عیوب سے پاک ہونا",
              "english": "Free from Obvious Defects"
            },
            "content": {
              "urdu": [
                "قربانی اللہ کی بارگاہ میں ایک نذرانہ ہے جو بہترین ہونا چاہیے۔",
                "ایسے عیوب جو جانور کی قیمت یا گوشت کو متاثر کریں ممانعت کا سبب ہیں۔",
                "واضح کانا پن یا اندھا پن جانور کو قربانی کے لیے نااہل کر دیتا ہے۔"
              ],
              "english": [
                "Sacrifice is an offering to Allah and must be of the highest quality.",
                "Defects that affect the animal's value or meat quality cause prohibition.",
                "Clear blindness or a missing eye makes the animal ineligible for sacrifice."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت اور لنگڑا پن",
              "english": "Health and Physical Lameness"
            },
            "content": {
              "urdu": [
                "ایسا بیمار جانور جس کی بیماری گوشت کو خراب کرے، جائز نہیں۔",
                "لنگڑا پن جو جانور کو ذبح گاہ تک چلنے سے روکے، عیبِ فاحش ہے۔",
                "قربانی کے لیے تندرست اور چاق و چوبند جانور کا انتخاب ضروری ہے۔"
              ],
              "english": [
                "A sick animal whose illness spoils the meat is not permissible.",
                "Lameness that prevents the animal from walking to the slaughter place is a major defect.",
                "Choosing a healthy and active animal is essential for the sacrifice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کمزوری اور لاغری کا حکم",
        "english": "Ruling on Weakness and Emaciation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہڈیوں کا گودا خشک ہونا",
              "english": "Marrowless Bones"
            },
            "content": {
              "urdu": [
                "انتہائی دبلا پتلا جانور جس میں چربی نہ ہو، قربانی کے لائق نہیں۔",
                "ہڈیوں میں گودا نہ ہونا انتہائی درجے کی کمزوری کی علامت ہے۔",
                "ایسا جانور خریدنا اللہ کی راہ میں مال خرچ کرنے کے جذبے کے خلاف ہے۔"
              ],
              "english": [
                "An extremely thin animal with no body fat is unfit for sacrifice.",
                "The lack of marrow in bones indicates the highest degree of emaciation.",
                "Buying such an animal contradicts the spirit of spending wealth for Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "بہترین مال کی قربانی",
              "english": "Sacrificing the Best Wealth"
            },
            "content": {
              "urdu": [
                "قرآن کا حکم ہے کہ تم نیکی کو نہیں پہنچ سکتے جب تک پسندیدہ مال نہ دو۔",
                "عیب دار جانور پیش کرنا اللہ کی نعمتوں کی ناقدری شمار ہو سکتی ہے۔",
                "صحابہ کرام قربانی کے لیے جانوروں کو کھلا پلا کر خوب تیار کرتے تھے۔"
              ],
              "english": [
                "The Quran states you cannot attain piety until you spend what you love.",
                "Presenting a defective animal can be seen as ingratitude for Allah's blessings.",
                "The Companions used to feed and prepare their animals well for sacrifice."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی تفصیلات",
        "english": "Juristic Details"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عیبِ خفی اور عیبِ جلی",
              "english": "Minor vs Major Defects"
            },
            "content": {
              "urdu": [
                "چھوٹے عیوب (جیسے کان کا تھوڑا پھٹا ہونا) سے قربانی ہو جاتی ہے مگر مکروہ ہے۔",
                "حدیث میں مذکور چاروں عیوب 'عیبِ جلی' (بڑے عیوب) میں شمار ہوتے ہیں۔",
                "فقہاء نے ان چار پر قیاس کرتے ہوئے دیگر بڑے عیوب کو بھی حرام قرار دیا ہے۔"
              ],
              "english": [
                "Minor defects (like a slightly torn ear) are disliked but the sacrifice counts.",
                "The four defects mentioned in the Hadith are considered major defects.",
                "Jurists have inferred other major defects as prohibited based on these four."
              ]
            }
          },
          {
            "title": {
              "urdu": "خریداری کے بعد عیب پیدا ہونا",
              "english": "Defects Arising After Purchase"
            },
            "content": {
              "urdu": [
                "اگر تندرست جانور خریدا اور بعد میں عیب پیدا ہوا، تو غریب کے لیے وہی کافی ہے۔",
                "مالدار شخص کو چاہیے کہ وہ عیب دار جانور کے بدلے تندرست جانور لائے۔",
                "یہ فرق شریعت کی دی ہوئی آسانی اور مالی وسعت پر مبنی ہے۔"
              ],
              "english": [
                "If a healthy animal is bought and then becomes defective, it suffices for the poor.",
                "A wealthy person should replace the defective animal with a healthy one.",
                "This distinction is based on Islamic ease and financial capacity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی و تربیتی سبق",
        "english": "Ethical and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نیت کی پاکیزگی",
              "english": "Purity of Intention"
            },
            "content": {
              "urdu": [
                "قربانی کی اصل روح گوشت کا حصول نہیں بلکہ اللہ کا ڈر اور تقویٰ ہے۔",
                "بہترین جانور کا انتخاب اللہ کی عظمت کا دل سے اعتراف کرنا ہے۔",
                "سستے اور عیب دار جانور کی تلاش بخل اور نیت کی کمزوری ظاہر کرتی ہے۔"
              ],
              "english": [
                "The true spirit of sacrifice is piety and fear of Allah, not just meat.",
                "Choosing the best animal is a heart-felt recognition of Allah's Greatness.",
                "Seeking cheap or defective animals reflects stinginess and weak intention."
              ]
            }
          },
          {
            "title": {
              "urdu": "احکام کی پابندی",
              "english": "Adherence to Commands"
            },
            "content": {
              "urdu": [
                "عبادات میں اپنی مرضی کے بجائے سنت کے ضابطوں پر عمل کرنا ضروری ہے۔",
                "رسول اللہ ﷺ کی تعلیمات ہمیں ہر کام میں نظم و ضبط سکھاتی ہیں۔",
                "قربانی کا یہ ضابطہ معاشرے میں حیوانات کے حقوق اور معیار کا ضامن ہے۔"
              ],
              "english": [
                "It is necessary to follow Sunnah regulations rather than personal will in worship.",
                "The Prophet's (ﷺ) teachings teach us discipline in every action we take.",
                "This sacrificial regulation ensures animal rights and standards in society."
              ]
            }
          }
        ]
      }
    }
  ]
}