{
  "hadithId": 961,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1103"],
    "kitabId": 8,
    "inKitabBab": 12,
    "arabicBook": "كتاب العدة",
    "babId": 75
  },
 
  "takhreej": {
    "arabic": " صحيح. رواه البخاري (5233)، ومسلم (1341). والحديث أصل عظيم في سد الذرائع المؤدية إلى الفاحشة.",
    "urdu": "صحیح۔ اسے امام بخاری (5233) اور امام مسلم (1341) نے روایت کیا ہے۔ یہ حدیث فواحش کے تمام دروازے بند کرنے کے لیے ایک بنیادی شرعی قاعدہ ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (5233) and Muslim (1341). This Hadith is a major foundational principle in Islamic law for preventing means that lead to immorality."
  },
  "importantWords": [
    {
      "arabic": "لَا يَخْلُوَنَّ",
      "english": "Must not be alone / Seclusion",
      "urdu": "ہرگز تنہائی اختیار نہ کرے"
    },
    {
      "arabic": "ذِي مَحْرَمٍ",
      "english": "Mahram (Unmarriageable kin)",
      "urdu": "محرم رشتہ دار"
    },
    {
      "arabic": "خَلْوَة",
      "english": "Privacy / Solitude",
      "urdu": "خلوت / تنہائی"
    }
  ],
  "summary": {
    "urdu": "اسلام میں ایک نامحرم مرد اور عورت کا ایسی جگہ تنہا ہونا جہاں کوئی تیسرا نہ ہو، حرام ہے؛ اس کے لیے عورت کے ساتھ اس کے کسی محرم کا ہونا لازمی ہے۔",
    "english": "Islam prohibits a non-mahram man and woman from being in seclusion (Khalwah) together. A Mahram must be present to ensure modesty and prevent temptation."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (5233)",
      "english": "Sahih al-Bukhari (5233)"
    },
    {
      "arabic": "صحيح مسلم (1341)",
      "english": "Sahih Muslim (1341)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "صحيح / متفق عليه",
    "english": "Sahih / Muttafaqun Alayh"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "خلوتِ محرمہ کی حقیقت",
        "english": "The Reality of Prohibited Seclusion"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خلوت (تنہائی) کا مفہوم",
              "english": "Meaning of Khalwah"
            },
            "content": {
              "urdu": [
                "خلوت سے مراد ایسی تنہائی ہے جہاں کوئی نامحرم مرد اور عورت اس طرح جمع ہوں کہ تیسرا کوئی دیکھنے والا نہ ہو۔",
                "ایسی صورت میں شیطان کے لیے وسوسہ ڈالنے اور فتنے پیدا کرنے کے مواقع بڑھ جاتے ہیں۔",
                "اسلام نے گناہ سے بچنے کے لیے گناہ کے قریب جانے والے تمام راستوں کو پہلے ہی مسدود کر دیا ہے۔"
              ],
              "english": [
                "Khalwah refers to a situation where a non-mahram man and woman are alone in a place hidden from the public eye.",
                "In such instances, the opportunity for Satan to whisper and create temptation increases significantly.",
                "Islam blocks the paths leading to sin (Sadd al-Dhara'i) to protect the individual's honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "تیسرا شیطان ہے",
              "english": "The Third is Satan"
            },
            "content": {
              "urdu": [
                "دوسری روایات میں صراحت ہے کہ جہاں دو نامحرم اکیلے ہوں، وہاں تیسرا شیطان ہوتا ہے۔",
                "یہ حکم انسانی نفسیات کے عین مطابق ہے کیونکہ تنہائی میں انسان کمزور پڑ جاتا ہے۔",
                "تقویٰ کا تقاضا ہے کہ انسان خود کو ایسے حالات سے دور رکھے جہاں اس کے ایمان کو خطرہ ہو۔"
              ],
              "english": [
                "Other narrations specify that when a non-mahram man and woman are alone, Satan is the third among them.",
                "This ruling aligns with human psychology as individuals are more vulnerable when isolated.",
                "Piety requires keeping oneself away from circumstances that threaten one's faith."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محرم کی اہمیت اور تعریف",
        "english": "Definition and Importance of a Mahram"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "محرم کون ہے؟",
              "english": "Who is a Mahram?"
            },
            "content": {
              "urdu": [
                "محرم وہ مرد ہے جس سے عورت کا نکاح ہمیشہ کے لیے حرام ہو، جیسے باپ، بھائی، بیٹا، چچا یا ماموں۔",
                "شوہر محرم سے بڑھ کر ہے، اس کی موجودگی میں خلوت کا سوال ہی پیدا نہیں ہوتا۔",
                "محرم کی موجودگی عورت کے لیے ایک حفاظتی حصار اور وقار کا باعث ہوتی ہے۔"
              ],
              "english": [
                "A Mahram is a male relative with whom marriage is permanently forbidden, such as a father, brother, son, or uncle.",
                "The husband is above the status of a Mahram; his presence obviously nullifies the prohibited seclusion.",
                "The presence of a Mahram serves as a protective shield and preserves the woman's dignity."
              ]
            }
          },
          {
            "title": {
              "urdu": "عورت کا تحفظ",
              "english": "Protection of the Woman"
            },
            "content": {
              "urdu": [
                "یہ حکم عورت کو محدود کرنے کے لیے نہیں بلکہ اسے بدگمانیوں اور خطرات سے بچانے کے لیے ہے۔",
                "اسلامی معاشرے میں عفت اور پاکدامنی کو سب سے زیادہ اہمیت حاصل ہے۔",
                "خلوت سے بچنا خاندانی نظام کے استحکام اور باہمی اعتماد کی بنیاد ہے۔"
              ],
              "english": [
                "This ruling is not to restrict women but to save them from suspicions and potential dangers.",
                "Modesty and chastity are highly prioritized in an Islamic society.",
                "Avoiding prohibited seclusion is fundamental for family stability and mutual trust."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جدید دور اور خلوت کے مسائل",
        "english": "Modern Challenges and Khalwah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دفاتر اور بند کمرے",
              "english": "Offices and Closed Rooms"
            },
            "content": {
              "urdu": [
                "ملازمت یا کسی بھی ضرورت کے لیے نامحرم کے ساتھ بند کمرے میں اکیلے بیٹھنا جائز نہیں ہے۔",
                "اگر کمرہ شیشے کا ہو یا دروازہ کھلا ہو جہاں سے لوگ آ جا رہے ہوں، تو وہ خلوت نہیں کہلاتی۔",
                "مومن کو چاہیے کہ وہ ہر حال میں شرعی حدود کا پاسبان بنے۔"
              ],
              "english": [
                "Sitting alone in a closed room with a non-mahram for work or any need is not permissible.",
                "If the room has glass walls or the door remains open where people pass by, it is not considered legal 'Khalwah'.",
                "A believer must uphold Shariah boundaries in all professional and personal settings."
              ]
            }
          },
          {
            "title": {
              "urdu": "سفر میں احتیاط",
              "english": "Caution in Travel"
            },
            "content": {
              "urdu": [
                "اسی حدیث کے تناظر میں فقہاء نے عورت کے لیے بغیر محرم کے طویل سفر کو منع فرمایا ہے۔",
                "سفر میں محرم کا ہونا عورت کی سہولت اور اس کی حفاظت کی ضمانت ہے۔",
                "مجبوری کی حالت میں علماء نے مخصوص شرائط کے ساتھ اجازت دی ہے مگر اصل حکم احتیاط ہی ہے۔"
              ],
              "english": [
                "In light of this Hadith, jurists forbid long-distance travel for women without a Mahram.",
                "A Mahram's presence during travel ensures the woman's comfort and security.",
                "In cases of absolute necessity, scholars provide specific exceptions, but the original rule is caution."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی تربیت اور سبق",
        "english": "Practical Lessons and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حیا کی اہمیت",
              "english": "Importance of Modesty (Haya)"
            },
            "content": {
              "urdu": [
                "حیا ایمان کا حصہ ہے اور یہ حکم حیا کے نظام کو مضبوط کرنے کے لیے ہے۔",
                "جب انسان اپنی نظروں اور خلوتوں کی حفاظت کرتا ہے تو اللہ اسے نورِ بصیرت عطا کرتا ہے۔",
                "اپنی عزت کی حفاظت کرنا ہر مسلمان مرد اور عورت کا انفرادی فریضہ ہے۔"
              ],
              "english": [
                "Haya is a branch of faith, and this ruling is designed to strengthen the system of modesty.",
                "When a person guards their gaze and their seclusion, Allah grants them the light of insight.",
                "Protecting one's honor is an individual obligation for every Muslim man and woman."
              ]
            }
          },
          {
            "title": {
              "urdu": "معاشرتی پاکیزگی",
              "english": "Social Purity"
            },
            "content": {
              "urdu": [
                "معاشرے سے بے حیائی کا خاتمہ اسی وقت ممکن ہے جب انفرادی طور پر ان حدود کا خیال رکھا جائے۔",
                "آپ ﷺ کا یہ فرمان قیامت تک آنے والے انسانوں کے لیے ایک بہترین ضابطہ اخلاق ہے۔",
                "ہمیں چاہیے کہ ہم جاہلانہ رسم و رواج کے مقابلے میں سنتِ نبوی کو فوقیت دیں۔"
              ],
              "english": [
                "Ending immorality in society is only possible when these limits are observed individually.",
                "The Prophet's (ﷺ) statement is a perfect code of conduct for humanity until the Day of Judgment.",
                "We must prioritize the Prophetic Sunnah over ignorant social customs."
              ]
            }
          }
        ]
      }
    }
  ]
}