{
  "hadithId": 137,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["1:2:9"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  
  "takhreej": {
    "arabic": " صحيح.‏ رواه أبو داود (1894)‏، والنسائي (184 و 523)‏، والترمذي (868)‏، وابن ماجه (1254)‏، وأحمد (4/80 و 81 و 82 و 83 و 84)‏، وابن حبان (1552 و 1553 و 1554)‏.‏ وقال الترمذي: \"حديث حسن صحيح\".‏",
    "urdu": "صحیح۔ اسے ابو داؤد (1894)، نسائی (184 اور 523)، ترمذی (868)، ابن ماجہ (1254) اور احمد (4/80، 81، 82، 83، 84) نے روایت کیا ہے، اور ابن حبان (1552، 1553، 1554) نے بھی۔ ترمذی نے کہا: ”یہ حدیث حسن صحیح ہے۔“",
    "english": "Authentic (Sahih). Reported by Abu Dawud (1894), An-Nasa'i (184 & 523), At-Tirmidhi (868), Ibn Majah (1254), and Ahmad (4/80, 81, 82, 83, 84). Also by Ibn Hibban (1552, 1553, 1554). At-Tirmidhi said: 'This Hadith is Hasan Sahih (Good and Authentic).'"
  },
  "importantWords": [
    {
      "arabic": "بَنِي عَبْدِ مَنَافٍ",
      "english": "O Sons of 'Abd Manāf",
      "urdu": "اے عبد مناف کی اولاد"
    },
    {
      "arabic": "لَا تَمْنَعُوا",
      "english": "Do not prevent/forbid",
      "urdu": "مت منع کرو"
    },
    {
      "arabic": "طَافَ",
      "english": "Performs Ṭawāf (circumambulation)",
      "urdu": "طواف کرے"
    },
    {
      "arabic": "بِهَذَا اَلْبَيْتِ",
      "english": "Around this House (Ka'bah)",
      "urdu": "اس گھر (کعبہ) کا"
    },
    {
      "arabic": "وَصَلَّى",
      "english": "And prays",
      "urdu": "اور نماز پڑھے"
    },
    {
      "arabic": "أَيَّةَ سَاعَةٍ",
      "english": "At any hour/time",
      "urdu": "کسی بھی وقت"
    },
    {
      "arabic": "مِنْ لَيْلٍ أَوْ نَهَارٍ",
      "english": "By night or by day",
      "urdu": "رات یا دن میں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ مسجد حرام (کعبہ کے گرد) میں طواف اور طواف کے بعد کی نماز کسی بھی وقت، دن ہو یا رات، ممنوع نہیں ہے، حتیٰ کہ ان ممنوع اوقات میں بھی جن میں عام مساجد میں نفل نماز کی ممانعت ہے۔ یہ کعبہ کی خصوصی فضیلت کا حکم ہے۔",
    "english": "This Hadith states that performing Ṭawāf (circumambulation) around the Ka'bah and offering the subsequent prayer in Al-Masjid Al-Ḥarām is permissible at any hour of the day or night. This special ruling overrides the general prohibition of voluntary prayers during the disliked times."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (1894)",
      "english": "Reported by Abu Dawud (1894)"
    },
    {
      "arabic": "رواه الترمذي (868)",
      "english": "Reported by At-Tirmidhi (868)"
    },
    {
      "arabic": "صححه ابن حبان (1552)",
      "english": "Authenticates by Ibn Hibban (1552)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جبير بن مطعم",
        "english": "Jubair ibn Mut'im"
      },
      "slug": "jubair-ibn-mutim"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2fF_X4vA9k",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حرم کا خصوصی حکم",
        "english": "Special Ruling for the Sanctuary (Haram)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ممانعت سے استثنا",
              "english": "Exclusion from Prohibition"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر حرم مکی اور بالخصوص طواف کے ساتھ کی جانے والی نماز کے لیے استثنا کا حکم دیتی ہے۔",
                "مسجد الحرام کے علاوہ عام مساجد میں ممنوع اوقات میں نفل نماز جائز نہیں ہوتی۔",
                "یہ خاص فضیلت کعبہ کی عظمت اور طواف کی عبادت کی اہمیت کی وجہ سے ہے۔"
              ],
              "english": [
                "This Hadith clearly grants an exception for Al-Masjid Al-Ḥarām, specifically for Ṭawāf and the prayer following it.",
                "In regular mosques, voluntary prayers are generally not allowed during the prohibited times.",
                "This special virtue is due to the great status of the Ka'bah and the significance of the Ṭawāf ritual."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبد مناف کی اولاد کو مخاطب",
              "english": "Addressing the Sons of 'Abd Manāf"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے اس خطاب میں قریش کے اس قبیلے کو مخاطب کیا جن کے پاس کعبہ کے امور کی ذمہ داری تھی۔",
                "یہ ممانعت اس دور کی تھی جب وہ لوگ اپنی مرضی سے بعض لوگوں کو طواف سے روکتے تھے۔",
                "اس حکم کا مقصد یہ واضح کرنا تھا کہ عبادت میں رکاوٹ ڈالنا شرعاً ممنوع ہے۔"
              ],
              "english": [
                "The Messenger of Allah (ﷺ) addressed this clan of Quraysh who were responsible for the affairs of the Ka'bah.",
                "The prohibition was directed against the practice of some people preventing others from Ṭawāf according to their whims.",
                "The purpose of this command was to clarify that hindering worship is strictly forbidden in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت اور اطلاق",
        "english": "Jurisprudential Wisdom and Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذی سبب نوافل کا مسئلہ",
              "english": "Issue of Voluntary Prayers with a Reason"
            },
            "content": {
              "urdu": [
                "یہ حدیث ان ائمہ کی دلیل ہے جو ذی سبب نوافل (جیسے طواف کی دو رکعت) کو ممنوع اوقات میں بھی جائز قرار دیتے ہیں۔",
                "طواف چونکہ ایک مخصوص اور فوری سبب والی عبادت ہے، لہٰذا اس سے متصل نماز بھی مستثنیٰ ہے۔",
                "اس رخصت کا مقصد حرم میں ہر وقت عبادت کی حوصلہ افزائی کرنا ہے۔"
              ],
              "english": [
                "This Hadith is a key proof for the Imams who permit voluntary prayers with a specific reason (like the two rak'ahs after Ṭawāf) even during prohibited times.",
                "Since Ṭawāf is a specific and immediate act of worship, the related prayer is also excepted.",
                "The intent of this concession is to encourage continuous worship in the Sacred Mosque."
              ]
            }
          },
          {
            "title": {
              "urdu": "طواف کی فضیلت",
              "english": "Virtue of Ṭawāf"
            },
            "content": {
              "urdu": [
                "طواف ایک ایسی عبادت ہے جو کسی بھی وقت کی پابندی سے آزاد ہے اور ہمیشہ جائز ہے۔",
                "اس کے بعد کی دو رکعتیں (سنت الطواف) بھی طواف کے تابع ہیں اور ان کا ادا کرنا ضروری ہے۔",
                "طواف بذاتِ خود نماز کے حکم میں ہے، لہذا یہ ممنوع اوقات میں بھی جاری رہ سکتا ہے۔"
              ],
              "english": [
                "Ṭawāf is a form of worship that is free from any time restriction and is permissible at all times.",
                "The two rak'ahs after it (Sunnah Al-Ṭawāf) are dependent on the Ṭawāf and must be performed.",
                "Ṭawāf itself is considered equivalent to prayer, thus it can continue even during prohibited times."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عبادت میں آزادی اور آسانی",
        "english": "Freedom and Ease in Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روک ٹوک کی ممانعت",
              "english": "Prohibition of Hindrance"
            },
            "content": {
              "urdu": [
                "اس حدیث کا بنیادی پیغام یہ ہے کہ بیت اللہ میں عبادت کرنے والے کو روکنا نہیں چاہیے۔",
                "یہ نہی ہر قسم کی دنیاوی یا مذہبی رکاوٹ کو شامل ہے جو عبادت کو متاثر کرے۔",
                "اسلام میں ہر اس عمل کی حوصلہ شکنی کی گئی ہے جو لوگوں کو عبادت سے دور کرے۔"
              ],
              "english": [
                "The core message of this Hadith is that no one should be prevented from worshipping in the Ka'bah.",
                "This prohibition includes all forms of worldly or religious hindrances that affect worship.",
                "Islam discourages every action that pushes people away from devotion."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی کا اصول",
              "english": "Principle of Ease"
            },
            "content": {
              "urdu": [
                "حرم میں وقت کی قید کا نہ ہونا دین اسلام میں آسانی اور رحمت کے اصول کو ظاہر کرتا ہے۔",
                "حج اور عمرہ کے سفر میں لوگوں کے لیے طواف کو دن رات ہر وقت ادا کرنا بہت بڑی آسانی ہے۔",
                "اس رعایت کا مقصد لوگوں کے لیے سفر حج و عمرہ کی مشقت کو کم کرنا ہے۔"
              ],
              "english": [
                "The absence of time restrictions in the Haram shows the principle of ease and mercy in the religion of Islam.",
                "It is a great convenience for people on Hajj and 'Umrah journeys to perform Ṭawāf at any hour.",
                "This concession is intended to alleviate the hardship of the Hajj and 'Umrah journey."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی و تربیتی پہلو",
        "english": "Educational and Training Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حرم کی قدر",
              "english": "Appreciating the Haram"
            },
            "content": {
              "urdu": [
                "مومن کو چاہیے کہ وہ مسجد الحرام کی اس فضیلت کی قدر کرے اور وہاں زیادہ سے زیادہ عبادت کرے۔",
                "یہ حدیث طواف کو ایک مستقل عبادت کے طور پر قائم کرتی ہے جو ہر وقت جائز ہے۔",
                "حرمین شریفین میں عبادت کے لیے خاص جوش اور وقت کو غنیمت سمجھنا چاہیے۔"
              ],
              "english": [
                "A believer should appreciate the excellence of Al-Masjid Al-Ḥarām and maximize their worship there.",
                "This Hadith establishes Ṭawāf as a standing form of worship that is permissible at all times.",
                "A special zeal for worship in the Two Holy Mosques and valuing the time spent there is essential."
              ]
            }
          },
          {
            "title": {
              "urdu": "اوقات کی پہچان",
              "english": "Understanding the Times"
            },
            "content": {
              "urdu": [
                "اس حدیث کے ساتھ ممنوع اوقات کی عمومی احادیث کو سمجھنا فقہ کا اہم حصہ ہے۔",
                "استثنا صرف مسجد الحرام کے لیے ہے، دوسری مساجد میں ممنوع اوقات کا حکم برقرار ہے۔",
                "یہ تفریق ایک طالب علم کو شرعی احکام میں گہرائی پیدا کرنے میں مدد دیتی ہے۔"
              ],
              "english": [
                "Understanding this Hadith alongside the general narrations about prohibited times is a crucial part of jurisprudence.",
                "The exception is only for Al-Masjid Al-Ḥarām; the ruling for prohibited times remains for other mosques.",
                "This distinction helps a student gain depth in understanding legal Islamic rulings."
              ]
            }
          }
        ]
      }
    }
  ]
}
