{
  "hadithId": 1183,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["/bulugh/13/13"],
    "kitabId": 13,
    "inKitabBab": 1,
    "arabicBook": "كتاب الأيمان والنذور",
    "babId": 96
  },
  
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2761)، ومسلم (1638). وأخرجه أيضاً أبو داود والنسائي.",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (2761) و امام مسلم (1638) کی متفق علیہ روایت ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2761) and Muslim (1638). It is also recorded by Abu Dawud and An-Nasa'i."
  },
  "importantWords": [
    {
      "arabic": "اِسْتَفْتَى",
      "english": "Asked for a fatwa / decision",
      "urdu": "فتویٰ پوچھا / مسئلہ دریافت کیا"
    },
    {
      "arabic": "نَذْرٍ",
      "english": "Vow",
      "urdu": "نذر / منت"
    },
    {
      "arabic": "تَقْضِيَهُ",
      "english": "Fulfill it",
      "urdu": "اسے ادا کرے / پورا کرے"
    },
    {
      "arabic": "اِقْضِهِ",
      "english": "Fulfill it (command)",
      "urdu": "تم اسے پورا کرو"
    }
  ],
  "summary": {
    "urdu": "اگر کوئی شخص نذر پوری کرنے سے پہلے انتقال کر جائے، تو اس کے ورثاء کو چاہیے کہ وہ میت کی طرف سے اس ادھوری نذر کو پورا کریں۔",
    "english": "If a person dies before fulfilling a vow, their heirs should carry it out on their behalf to clear the deceased's obligation."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2761)",
      "english": "Sahih al-Bukhari (2761)"
    },
    {
      "arabic": "صحيح مسلم (1638)",
      "english": "Sahih Muslim (1638)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "سعد بن عبادة",
        "english": "Sa'd bin Ubadah"
      },
      "slug": "sad-bin-ubadah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=f-w5oTndxR8",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "میت کی نذر کی ادائیگی",
        "english": "Fulfilling the Deceased's Vow"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ورثاء کی ذمہ داری",
              "english": "Responsibility of the Heirs"
            },
            "content": {
              "urdu": [
                "نذر ایک قسم کا قرض ہے جو بندے نے اللہ سے کیا ہوتا ہے۔",
                "اگر والدین نذر پوری نہ کر سکیں تو اولاد کو اسے پورا کرنے کی ترغیب دی گئی ہے۔",
                "یہ عمل میت کو اخروی گرفت سے بچانے کا ایک ذریعہ ہے۔"
              ],
              "english": [
                "A vow is a type of debt that a servant owes to Allah.",
                "If parents cannot fulfill a vow, the children are encouraged to complete it.",
                "This act serves as a means to save the deceased from accountability in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "نذر کی اقسام",
              "english": "Types of Vows"
            },
            "content": {
              "urdu": [
                "مالی نذر (مثلاً صدقہ) میت کے ترکے سے ادا کی جانی چاہیے۔",
                "بدنی نذر (مثلاً روزے) کی ادائیگی میں ورثاء کا عمل مستحسن ہے۔",
                "صرف وہی نذر پوری کی جائے گی جو شریعت کے دائرے میں جائز ہو۔"
              ],
              "english": [
                "Financial vows (e.g., charity) should be paid from the deceased's estate.",
                "For physical vows (e.g., fasting), the performance by heirs is commendable.",
                "Only those vows that are permissible in Shariah should be fulfilled."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "والدین کے ساتھ حسنِ سلوک",
        "english": "Kindness to Parents"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وفات کے بعد نیکی",
              "english": "Goodness After Death"
            },
            "content": {
              "urdu": [
                "والدین کی وفات کے بعد ان کی طرف سے صدقہ و خیرات کرنا بہترین نیکی ہے۔",
                "سیدنا سعد کا سوال کرنا ان کی اپنی والدہ سے گہری محبت اور فکر کو ظاہر کرتا ہے۔",
                "اولاد کا نیک عمل والدین کے درجات کی بلندی کا سبب بنتا ہے۔"
              ],
              "english": [
                "Giving charity on behalf of parents after their death is a great virtue.",
                "Sa'd's (RA) inquiry shows his deep love and concern for his mother.",
                "The righteous deeds of children elevate the status of their parents."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق اللہ کی اہمیت",
              "english": "Importance of Rights of Allah"
            },
            "content": {
              "urdu": [
                "اللہ کا قرض (نذر) بندوں کے قرض سے زیادہ ادائیگی کا حقدار ہے۔",
                "عبادت میں سستی کی تلافی ورثاء کے ذریعے ممکن بنائی گئی ہے۔",
                "یہ حدیث اسلام میں خاندانی ہمدردی اور ذمہ داری کا سبق دیتی ہے۔"
              ],
              "english": [
                "Allah's debt (vows) is more deserving of being paid than human debts.",
                "Compensation for negligence in worship is made possible through heirs.",
                "This Hadith teaches a lesson of family empathy and responsibility in Islam."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی پہلو",
        "english": "Juristic Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وجوب یا استحباب",
              "english": "Obligation or Recommendation"
            },
            "content": {
              "urdu": [
                "اکثر فقہاء کے نزدیک میت کی مالی نذر ترکے سے نکالنا واجب ہے۔",
                "اگر میت نے مال نہ چھوڑا ہو تو ورثاء پر نذر پوری کرنا اخلاقی و مستحب عمل ہے۔",
                "نبی ﷺ کا حکم 'اقضہ' (پورا کرو) اس کی اہمیت پر زور دیتا ہے۔"
              ],
              "english": [
                "Most jurists believe financial vows must be extracted from the inheritance.",
                "If no property was left, fulfilling it is a moral and recommended act for heirs.",
                "The Prophet's (ﷺ) command 'Fulfill it' emphasizes its significance."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعاون علی البر",
              "english": "Cooperation in Righteousness"
            },
            "content": {
              "urdu": [
                "یہ عمل 'نیکی کے کاموں میں ایک دوسرے کی مدد' کے قرآنی اصول پر مبنی ہے۔",
                "میت کی ادھوری نیکیوں کو مکمل کرنا ایک عظیم صدقہ جاریہ ہے۔",
                "اسلام مردہ اور زندہ کے درمیان روحانی تعلق کو برقرار رکھتا ہے۔"
              ],
              "english": [
                "This act is based on the Quranic principle of 'cooperating in righteousness'.",
                "Completing the unfinished good deeds of the deceased is a great ongoing charity.",
                "Islam maintains the spiritual connection between the living and the dead."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں سبق",
        "english": "Lessons for Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نذر ماننے میں احتیاط",
              "english": "Caution in Taking Vows"
            },
            "content": {
              "urdu": [
                "نذر سوچ سمجھ کر ماننی چاہیے تاکہ زندگی میں اسے پورا کیا جا سکے۔",
                "موت کا وقت متعین نہیں، اس لیے نیکی کے وعدوں میں تاخیر نہیں کرنی چاہیے۔",
                "اپنے پیچھے کوئی شرعی بوجھ چھوڑ کر جانا پریشانی کا باعث ہو سکتا ہے۔"
              ],
              "english": [
                "Vows should be taken carefully so they can be fulfilled during one's lifetime.",
                "Death is uncertain, so one should not delay in fulfilling righteous promises.",
                "Leaving behind a religious burden can be a cause of concern."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء سے رجوع",
              "english": "Consulting the Scholars"
            },
            "content": {
              "urdu": [
                "پیچیدہ معاملات میں دینی راہنمائی حاصل کرنا سنتِ صحابہ ہے۔",
                "سیدنا سعد نے اپنی مرضی کے بجائے رسول اللہ ﷺ سے فتویٰ طلب کیا۔",
                "درست شرعی علم ہی انسان کو صحیح فیصلے کرنے میں مدد دیتا ہے۔"
              ],
              "english": [
                "Seeking religious guidance in complex matters is a Sunnah of the Companions.",
                "Sa'd (RA) sought a fatwa from the Prophet (ﷺ) instead of following his own will.",
                "Correct Shariah knowledge helps a person make the right decisions."
              ]
            }
          }
        ]
      }
    }
  ]
}