{
  "hadithId": 115,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["1:115"],
    "kitabId": 1,
    "inKitabBab": 9,
    "arabicBook": "كتاب الطهارة",
    "babId": 9
  },

  "takhreej": {
    "arabic": " موضوع.  رواه ابن ماجه (657) . ",
    "urdu": "موضوع (من گھڑت/سخت ضعیف)۔ اسے ابن ماجہ (657) نے روایت کیا ہے۔",
    "english": "Mawdu' (Fabricated/Very weak). Reported by Ibn Majah (657)."
  },
  "importantWords": [
    {
      "arabic": "اِنْكَسَرَتْ",
      "english": "It was broken",
      "urdu": "ٹوٹ گیا"
    },
    {
      "arabic": "زَنْدَيَّ",
      "english": "My forearm",
      "urdu": "میرا گٹ (کلائی)"
    },
    {
      "arabic": "فَسَأَلَتْ",
      "english": "So I asked",
      "urdu": "میں نے پوچھا"
    },
    {
      "arabic": "فَأَمَرَنِي",
      "english": "He commanded me",
      "urdu": "آپ نے مجھے حکم دیا"
    },
    {
      "arabic": "أَمْسَحَ",
      "english": "To wipe (Masah)",
      "urdu": "مسح کروں"
    },
    {
      "arabic": "اَلْجَبَائِرِ",
      "english": "Splints/Bandages/Cast",
      "urdu": "پٹیوں پر"
    },
    {
      "arabic": "بِسَنَدٍ وَاهٍ",
      "english": "With a weak chain",
      "urdu": "کمزور سند سے"
    }
  ],
  "summary": {
    "urdu": "حضرت علی رضی اللہ عنہ نے روایت کیا کہ جب ان کی کلائی ٹوٹ گئی تو نبی اکرم ﷺ نے انہیں ٹوٹے ہوئے عضو کی پٹیوں (جبیرہ) پر مسح کرنے کا حکم دیا، تاہم اس روایت کی سند حدیث کے ماہرین کے نزدیک نہایت کمزور ہے۔",
    "english": "Ali (RA) narrated that when his forearm was broken, the Prophet (PBUH) instructed him to wipe over the splints or bandages (Jabirah) during Wudu. However, the chain of narration for this Hadith is considered very weak by Hadith scholars."
  },
  "references": [
    {
      "arabic": "رواه ابن ماجه (657)",
      "english": "Reported by Ibn Majah (657)"
    },
    {
      "arabic": "بسند واه جداً",
      "english": "With a very weak chain"
    }
  ],
  "narrators": [
    {
      "id": 11501,
      "name": {
        "arabic": "عَلِيُّ بْنُ أَبِي طَالِبٍ",
        "english": "Ali ibn Abi Talib"
      },
      "slug": "ali-ibn-abi-talib"
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": "موضوع",
    "english": "Fabricated (Mawdu')"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جبیرہ پر مسح کا حکم",
        "english": "Ruling on Wiping Over Splints (Masah alal Jabirah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جبیرہ پر مسح کی کیفیت",
              "english": "Manner of Wiping over Splints"
            },
            "content": {
              "urdu": [
                "اس روایت میں زخم یا ٹوٹے ہوئے عضو پر لگی پٹی یا پلستر پر مسح کرنے کا ذکر ہے۔",
                "یہ مسح وضو یا غسل میں پانی کے استعمال سے عاجز ہونے کی صورت میں کیا جاتا ہے۔",
                "یہ اصول شریعت کی آسانی کو ظاہر کرتا ہے تاکہ پاکیزگی برقرار رکھی جا سکے۔"
              ],
              "english": [
                "This narration refers to wiping over the bandage or cast covering a wound or broken limb.",
                "This wiping is performed when one is unable to use water during Wudu or Ghusl.",
                "This principle demonstrates the ease of Sharia, allowing purification to be maintained."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسح کا فقہی محل",
              "english": "Juristic Scope of Wiping"
            },
            "content": {
              "urdu": [
                "فقہاء نے مسح علی الجبیرہ کے جواز کے لیے اس حدیث کو شواہد میں شامل کیا ہے، اگرچہ سند ضعیف ہے۔",
                "مسح علی الخفین (موزوں پر مسح) کی طرح جبیرہ پر مسح بھی رخصت ہے۔",
                "مسح صرف اسی پٹی پر ہوتا ہے جہاں پانی کا استعمال نقصان دہ ہو۔"
              ],
              "english": [
                "Jurists included this Hadith as supporting evidence for the permissibility of 'Masah alal Jabirah,' despite its weak chain.",
                "Wiping over the splint is a concession, similar to wiping over leather socks (Masah alal Khuffain).",
                "The wiping is only required on the bandage covering the area where water use would be harmful."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند کی کمزوری اور حکم",
        "english": "Weakness of Narration Chain and Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کا درجہ 'موضوع'",
              "english": "Hadith Grade 'Mawdu'"
            },
            "content": {
              "urdu": [
                "محدثین نے اس حدیث کی سند کو 'واہن جداً' (انتہائی کمزور) یا 'موضوع' (من گھڑت) قرار دیا ہے۔",
                "ضعیف اور موضوع حدیث کو شرعی احکام کے لیے بنیاد نہیں بنایا جاتا۔",
                "یہ درجہ بندی ہمیں مستند شرعی دلائل کے ساتھ رہنمائی حاصل کرنے کی اہمیت سکھاتی ہے۔"
              ],
              "english": [
                "Hadith scholars deemed the chain of this Hadith 'Wahin Jiddan' (very weak) or 'Mawdu' (fabricated).",
                "Weak and fabricated narrations are not used as a foundational basis for deriving legal rulings.",
                "This grading teaches the importance of relying on authentic legal evidence for guidance."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت کا متبادل دلیل",
              "english": "Alternative Evidence for Validity"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ روایت ضعیف ہے، جبیرہ پر مسح کا حکم دیگر صحیح اصولوں سے ثابت ہے۔",
                "فقہاء نے تیمم کے عمومی اصول اور 'ضرورت کی بنا پر آسانی' سے یہ حکم اخذ کیا ہے۔",
                "قرآن و سنت کے عمومی احکامات سے یہ بات واضح ہے کہ شریعت تکلیف نہیں دیتی۔"
              ],
              "english": [
                "Despite this narration's weakness, the ruling for Masah alal Jabirah is established through other sound principles.",
                "Jurists derived this ruling from the general principles of Tayammum and the concept of 'ease due to necessity'.",
                "The general framework of the Quran and Sunnah clearly indicates that Sharia does not intend difficulty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف",
        "english": "Juristic Differences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسح کا طریقہ",
              "english": "Method of Wiping"
            },
            "content": {
              "urdu": [
                "بعض فقہاء جبیرہ پر مسح کو ضروری سمجھتے ہیں اور تیمم کو کافی نہیں سمجھتے۔",
                "دوسرے فقہاء صرف پٹی کے آس پاس کا عضو دھوتے ہیں اور پٹی کی جگہ پر تیمم کو ترجیح دیتے ہیں۔",
                "یہ اختلاف اس مرکزی روایت کے ضعیف ہونے اور دیگر نصوص کے مختلف اجتہاد سے پیدا ہوا۔"
              ],
              "english": [
                "Some jurists consider wiping over the splint necessary and do not deem Tayammum sufficient.",
                "Other jurists prefer washing the surrounding area and performing Tayammum for the area covered by the splint.",
                "This difference stems from the weakness of this primary narration and varying interpretations of other texts."
              ]
            }
          },
          {
            "title": {
              "urdu": "عضو کی نوعیت",
              "english": "Nature of the Limb"
            },
            "content": {
              "urdu": [
                "جبیرہ پر مسح کے جواز میں وضو اور غسل دونوں کے احکام شامل ہیں۔",
                "اگر پٹی پورے عضو کو ڈھانپ لے تو مسح پورے عضو کا متبادل ہو جاتا ہے۔",
                "اس رخصت کا مقصد مجبوری کی حالت میں عبادات کی مکمل ادائیگی کو یقینی بنانا ہے۔"
              ],
              "english": [
                "The permissibility of Masah alal Jabirah applies to both Wudu and Ghusl.",
                "If the bandage covers the entire limb, the wiping becomes a substitute for washing the whole limb.",
                "The purpose of this concession is to ensure the complete performance of worship during times of inability."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی اور اخلاق",
        "english": "Practical Guidance and Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بیماری میں عبادت",
              "english": "Worship During Illness"
            },
            "content": {
              "urdu": [
                "حدیث ہمیں سکھاتی ہے کہ تکلیف کی حالت میں بھی عبادت ترک نہیں کرنی چاہیے۔",
                "اللہ تعالیٰ بیماری اور عذر میں خصوصی رخصتیں اور سہولیات فراہم کرتے ہیں۔",
                "ان رخصتوں پر عمل کرنا بھی سنت کی پیروی اور اللہ کی رحمت کا اعتراف ہے۔"
              ],
              "english": [
                "The Hadith teaches us not to abandon worship even when facing hardship or pain.",
                "Allah provides special concessions and ease during sickness and valid excuses.",
                "Acting upon these concessions is also a form of following the Sunnah and acknowledging Allah's Mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجتہاد کی ضرورت",
              "english": "Need for Ijtihad"
            },
            "content": {
              "urdu": [
                "سند کی کمزوری علماء کو دیگر صحیح دلائل کی طرف رجوع کرنے پر مجبور کرتی ہے۔",
                "مسح علی الجبیرہ جیسے مسائل میں اہل علم سے رہنمائی لینا ضروری ہے۔",
                "مریض کو اپنی حالت اور ڈاکٹر کی رائے کو مدنظر رکھتے ہوئے شرعی حکم پر عمل کرنا چاہیے۔"
              ],
              "english": [
                "The weakness of the chain necessitates that scholars refer to other authentic proofs.",
                "In matters like Masah alal Jabirah, seeking guidance from knowledgeable people is essential.",
                "The sick person should apply the Sharia ruling while considering their condition and medical advice."
              ]
            }
          }
        ]
      }
    }
  ]
}
