{
  "hadithId": 499,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/abudawud:1563",
      "https://sunnah.com/tirmidhi:637",
      "https://sunnah.com/nasai:2479"
    ],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "كتاب الزكاة",
    "babId": 29
  },
  
  "takhreej": {
    "arabic": "حسن. رواه أبو داود (1563)، والترمذي (637)، والنسائي (2479). وصححه الحاكم (1/389) من حديث عائشة بلفظ مشابه. والحديث دليل على وجوب الزكاة في الحلي إذا بلغ النصاب.",
    "urdu": "یہ حدیث حسن درجے کی ہے۔ اسے ابوداؤد، ترمذی اور نسائی نے روایت کیا ہے۔ امام حاکم نے سیدہ عائشہ رضی اللہ عنہا سے ملتی جلتی روایت کو صحیح قرار دیا ہے۔ یہ حدیث اس بات کی دلیل ہے کہ زیورات پر زکوٰۃ واجب ہے اگر وہ نصاب کو پہنچ جائیں۔",
    "english": "Hasan (Good). Reported by Abu Dawud (1563), At-Tirmidhi (637), and An-Nasa'i (2479). Al-Hakim (1/389) authenticated a similar narration from Aisha (RA). This Hadith serves as evidence for the obligation of Zakat on jewelry once it reaches the Nisab."
  },
  "importantWords": [
    {
      "arabic": "مِسْكَتَانِ",
      "english": "Two thick bangles",
      "urdu": "دو موٹے کنگن"
    },
    {
      "arabic": "يُسَوِّرَكِ",
      "english": "Encircle / Make you wear",
      "urdu": "تجھے پہنائے / طوق ڈالے"
    },
    {
      "arabic": "سِوَارَيْنِ",
      "english": "Two bangles",
      "urdu": "دو کنگن"
    },
    {
      "arabic": "نَارٍ",
      "english": "Fire",
      "urdu": "آگ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں خواتین کے زیورات پر زکوٰۃ کی اہمیت بیان کی گئی ہے اور زکوٰۃ نہ دینے کی صورت میں اخروی سزا سے ڈرایا گیا ہے۔",
    "english": "This Hadith emphasizes the obligation of paying Zakat on jewelry and warns of a severe punishment in the Hereafter for those who neglect this duty."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1563)",
      "english": "Sunan Abu Dawud (1563)"
    },
    {
      "arabic": "سنن الترمذي (637)",
      "english": "Sunan at-Tirmidhi (637)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمرو بن شعيب",
        "english": "Amr bin Shu'aib"
      },
      "slug": "amr-bin-shuaib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=F_rOun7K5bY",
  "grade": {
    "arabic": "حسن",
    "english": "Hasan (Good)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "زیورات پر زکوٰۃ کا وجوب",
        "english": "Obligation of Zakat on Jewelry"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احناف کا موقف",
              "english": "Hanafi Position"
            },
            "content": {
              "urdu": [
                "امام ابوحنیفہ کے نزدیک سونے اور چاندی کے زیورات پر زکوٰۃ واجب ہے، چاہے وہ استعمال میں ہوں۔",
                "یہ حدیث احناف کے لیے بنیادی دلیل ہے کہ آپ ﷺ نے زیور پر زکوٰۃ نہ دینے پر جہنم کی وعید سنائی۔",
                "نصاب پورا ہونے کی صورت میں ہر سال 2.5٪ زکوٰۃ نکالنا لازم ہے۔"
              ],
              "english": [
                "According to Imam Abu Hanifa, Zakat is obligatory on gold and silver jewelry, even if it is for personal use.",
                "This Hadith is a primary proof for Hanafis, as the Prophet (ﷺ) warned of Hellfire for not paying Zakat on it.",
                "If it reaches the Nisab, 2.5% Zakat must be paid annually."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر ائمہ کا موقف",
              "english": "Other Imams' Positions"
            },
            "content": {
              "urdu": [
                "امام شافعی، مالک اور احمد کے نزدیک استعمالی زیور پر زکوٰۃ واجب نہیں ہے۔",
                "ان کے نزدیک زیور 'مالِ نامی' (بڑھنے والا مال) نہیں بلکہ ذاتی ضرورت کا سامان ہے۔",
                "تاہم، احتیاط اسی میں ہے کہ زیور کی زکوٰۃ ادا کی جائے تاکہ تمام اختلافات سے بچا جا سکے۔"
              ],
              "english": [
                "Imams Shafi'i, Malik, and Ahmad generally hold that Zakat is not due on jewelry kept for personal use.",
                "They argue that jewelry is a personal necessity rather than a productive/growing asset.",
                "However, paying Zakat on jewelry is safer to avoid any potential sin or scholarly disagreement."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وعید اور سزا کی حقیقت",
        "english": "Reality of the Warning and Punishment"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آگ کے کنگن",
              "english": "Bangles of Fire"
            },
            "content": {
              "urdu": [
                "قیامت کے دن وہ مال جس کی زکوٰۃ نہ دی گئی ہو، عذاب کی شکل اختیار کر لے گا۔",
                "یہ تمثیل انسان کو جھنجھوڑنے کے لیے ہے کہ دنیا کی زینت آخرت کی ہلاکت نہ بن جائے۔",
                "اللہ تعالیٰ حقوق العباد اور مالی فرائض میں کوتاہی کو سخت ناپسند فرماتا ہے۔"
              ],
              "english": [
                "On the Day of Judgment, wealth for which Zakat was not paid will turn into a source of punishment.",
                "This imagery serves as a wake-up call so that worldly adornments do not lead to destruction in the Hereafter.",
                "Allah Almighty strongly dislikes negligence in financial obligations and rights of the poor."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحابہ کا طرزِ عمل",
        "english": "Conduct of the Companions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فوری اطاعت",
              "english": "Immediate Obedience"
            },
            "content": {
              "urdu": [
                "اس خاتون نے وعید سنتے ہی کنگن اتار دیئے، جو ان کے کامل ایمان کی علامت ہے۔",
                "صحابہ کرام اللہ کے حکم کے سامنے اپنے محبوب ترین مال کی بھی پرواہ نہیں کرتے تھے۔",
                "دین پر عمل کرنے میں تاخیر کے بجائے فوری توبہ اور اصلاح کرنی چاہیے۔"
              ],
              "english": [
                "The woman took off the bangles immediately upon hearing the warning, showing her perfect faith.",
                "The Companions did not care for their most beloved possessions when compared to Allah's command.",
                "One should practice immediate repentance and reform rather than delaying religious duties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اسباق",
        "english": "Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال کی پاکیزگی",
              "english": "Purification of Wealth"
            },
            "content": {
              "urdu": [
                "زکوٰۃ ادا کرنے سے مال پاک ہوتا ہے اور اللہ کا غضب ٹھنڈا ہوتا ہے۔",
                "بخل اور مال کی حد سے زیادہ محبت انسان کو ہلاکت میں ڈال دیتی ہے۔",
                "گھر کی خواتین کو چاہیے کہ وہ اپنے زیورات کا حساب رکھیں اور زکوٰۃ ادا کریں۔"
              ],
              "english": [
                "Paying Zakat purifies wealth and extinguishes the anger of Allah.",
                "Greed and excessive love for wealth can lead a person to ruin.",
                "Women should keep track of their jewelry and ensure Zakat is paid regularly."
              ]
            }
          }
        ]
      }
    }
  ]
}