{
  "hadithId": 934,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": [
      "bulugh/8/934"
    ],
    "kitabId": 8,
    "inKitabBab": 10,
    "arabicBook": "كتاب الإيلاء والظهار والكفارة",
    "babId": 73
  },
  
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (2223)‏، والنسائي (667)‏، والترمذي (1199)‏، وابن ماجه (2065)‏ من طريق الحكم بن أبان عن عكرمة عن ابن عباس. وصححه ابن حبان والحاكم.",
    "urdu": "یہ روایت صحیح ہے۔ اسے ابوداؤد (2223)، نسائی (667)، ترمذی (1199) اور ابن ماجہ (2065) نے روایت کیا ہے۔ امام ترمذی نے اسے حسن صحیح غریب کہا ہے اور حاکم نے بھی اس کی تصحیح کی ہے۔",
    "english": "Sahih. Reported by Abu Dawud (2223), An-Nasa'i (667), At-Tirmidhi (1199), and Ibn Majah (2065). Graded Sahih by At-Tirmidhi and Al-Hakim."
  },
  "importantWords": [
    {
      "arabic": "ظَاهَرَ",
      "english": "Committed Zihar",
      "urdu": "ظہار کیا"
    },
    {
      "arabic": "وَقَعَ عَلَيْهَا",
      "english": "Had intercourse",
      "urdu": "اس سے جماع کیا"
    },
    {
      "arabic": "أُكَفِّرَ",
      "english": "Pay expiation",
      "urdu": "کفارہ ادا کروں"
    },
    {
      "arabic": "لَا تَقْرَبْهَا",
      "english": "Do not go near her",
      "urdu": "اس کے قریب نہ جاؤ"
    },
    {
      "arabic": "تَفْعَلَ",
      "english": "You fulfill / do",
      "urdu": "تم پورا کرو"
    }
  ],
  "summary": {
    "urdu": "ظہار کرنے والے شخص پر لازم ہے کہ وہ اپنی بیوی سے قربت سے پہلے شرعی کفارہ ادا کرے؛ اگر پہلے جماع کر لے تو اسے رک جانا چاہیے یہاں تک کہ کفارہ مکمل ہو۔",
    "english": "A person who commits Zihar is prohibited from intimacy with his wife until he pays the expiation; if he does so prematurely, he must stop until the requirement is met."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (2223)",
      "english": "Reported by Abu Dawud (2223)"
    },
    {
      "arabic": "رواه الترمذي (1199)",
      "english": "Reported by At-Tirmidhi (1199)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-POfk5_3s",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ظہار اور اس کی شرعی حیثیت",
        "english": "Zihar and its Shariah Status"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظہار کا مفہوم اور ممانعت",
              "english": "Meaning and Prohibition of Zihar"
            },
            "content": {
              "urdu": [
                "ظہار کا مطلب بیوی کو اپنی ماں یا بہن کے مشابہ قرار دینا ہے۔",
                "اسلام میں اسے جاہلیت کی ایک بری رسم قرار دے کر منع کیا گیا ہے۔",
                "یہ الفاظ ادا کرنے سے بیوی حرام نہیں ہوتی مگر قربت ممنوع ہو جاتی ہے۔"
              ],
              "english": [
                "Zihar means likening one's wife to a prohibited relative like a mother.",
                "Islam prohibited it as an evil custom from the days of ignorance.",
                "Uttering these words doesn't end marriage but prohibits intimacy."
              ]
            }
          },
          {
            "title": {
              "urdu": "کفارہ سے پہلے جماع کی حرمت",
              "english": "Intercourse Before Expiation"
            },
            "content": {
              "urdu": [
                "قرآن و سنت کی رو سے کفارہ سے پہلے قربت کرنا سخت گناہ ہے۔",
                "یہ حدیث واضح کرتی ہے کہ کفارہ کے بغیر ازدواجی تعلق حرام ہے۔",
                "حکمِ الہی کی نافرمانی پر توبہ اور کفارے کی فوری ادائیگی لازم ہے۔"
              ],
              "english": [
                "According to Quran and Sunnah, intimacy before expiation is a grave sin.",
                "This Hadith clarifies that marital relations are forbidden without expiation.",
                "Repentance and immediate expiation are required for disobeying Allah's command."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کفارہ ظہار کی ترتیب",
        "english": "Sequence of Zihar Expiation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی کفارے کی اقسام",
              "english": "Types of Shariah Expiation"
            },
            "content": {
              "urdu": [
                "پہلا درجہ ایک غلام کی آزادی ہے جو کہ اب ممکن نہیں رہا۔",
                "دوسرا درجہ مسلسل ساٹھ روزے رکھنا ہے جو درمیان میں نہ ٹوٹیں۔",
                "تیسرا درجہ ساٹھ مسکینوں کو کھانا کھلانا ہے اگر روزے کی طاقت نہ ہو۔"
              ],
              "english": [
                "The first stage is freeing a slave, which is no longer applicable today.",
                "The second stage is fasting for sixty consecutive days without interruption.",
                "The third stage is feeding sixty needy people if one is unable to fast."
              ]
            }
          },
          {
            "title": {
              "urdu": "تواتر اور ترتیب کی اہمیت",
              "english": "Importance of Continuity and Sequence"
            },
            "content": {
              "urdu": [
                "کفارہ کی ان اقسام میں ترتیب کا لحاظ رکھنا شرعی طور پر واجب ہے۔",
                "روزوں کے دوران اگر جان بوجھ کر ناغہ ہو جائے تو دوبارہ شروع کرنے ہوں گے۔",
                "کھانا کھلانے کی صورت میں تمام مسکینوں کو پیٹ بھر کر کھلانا ضروری ہے۔"
              ],
              "english": [
                "Following the specific order of expiation types is legally obligatory.",
                "If fasts are intentionally broken, the person must start from the beginning.",
                "In the case of feeding, all sixty needy people must be properly fed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "غلطی کی اصلاح اور توبہ",
        "english": "Correction of Error and Repentance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نادانستہ غلطی پر پکڑ",
              "english": "Accountability for Errors"
            },
            "content": {
              "urdu": [
                "کفارہ سے پہلے جماع کر لینے والے پر توبہ اور استغفار واجب ہے۔",
                "نبی ﷺ نے اس شخص کو دوبارہ ایسا نہ کرنے کی سخت تاکید فرمائی۔",
                "یہ عمل دین میں سنجیدگی اور حدود اللہ کے احترام کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Repentance and seeking forgiveness are mandatory for premature intimacy.",
                "The Prophet (ﷺ) strictly warned the man not to repeat such an act.",
                "This incident teaches seriousness in religion and respect for Allah's limits."
              ]
            }
          },
          {
            "title": {
              "urdu": "دوبارہ جماع کی ممانعت",
              "english": "Prohibition of Further Intimacy"
            },
            "content": {
              "urdu": [
                "غلطی ہو جانے کے بعد بھی مزید قربت سے فوری رکنا لازمی ہے۔",
                "جب تک عملِ کفارہ مکمل نہ ہو، میاں بیوی الگ رہیں گے۔",
                "بزار کی روایت میں 'اعادہ نہ کر' کے الفاظ اسی پابندی کی طرف اشارہ ہیں۔"
              ],
              "english": [
                "After the mistake occurs, one must immediately cease further intimacy.",
                "The spouses must remain apart until the expiation process is completed.",
                "The wording 'do not repeat' in Al-Bazzar's report points to this restriction."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی اور اخلاقی اسباق",
        "english": "Social and Moral Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "زبان کی حفاظت",
              "english": "Guarding the Tongue"
            },
            "content": {
              "urdu": [
                "مومن کو اپنے الفاظ اور کلمات میں بہت احتیاط برتنی چاہیے۔",
                "جاہلانہ رسموں اور سخت الفاظ سے گھروں کا سکون برباد ہو جاتا ہے۔",
                "خاندانی معاملات میں اشتعال کے وقت خاموشی اختیار کرنا سنت ہے۔"
              ],
              "english": [
                "A believer must be very cautious with his words and expressions.",
                "Ignorant customs and harsh words destroy the peace of households.",
                "Remaining silent during provocation in family matters is a Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "علم کی ضرورت",
              "english": "The Necessity of Knowledge"
            },
            "content": {
              "urdu": [
                "شرعی مسائل سے لاعلمی انسان کو بڑے گناہوں میں مبتلا کر دیتی ہے۔",
                "مسائل پیش آنے پر خاموش رہنے کے بجائے اہل علم سے رجوع کرنا چاہیے۔",
                "اسلامی قوانین انسانی وقار اور خاندانی استحکام کے ضامن ہیں۔"
              ],
              "english": [
                "Ignorance of Shariah rulings leads a person into major sins.",
                "One should consult scholars instead of remaining silent when issues arise.",
                "Islamic laws guarantee human dignity and family stability."
              ]
            }
          }
        ]
      }
    }
  ]
}