{
  "hadithId": 941,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["bulugh/1082"],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "كتاب اللعان",
    "babId": 74
  },
  
  "takhreej": {
    "arabic": "ضعيف.‏ رواه أبو داود (2049)‏، والنسائي (3229)‏، والبزار (2/402). وقد ضعف الحديث الإمام أحمد بن حنبل، والنسائي، وابن الجوزي. والعلة في اضطراب متنه ومعناه، وقيل إن المراد باللمس هو التبذير في المال لا الفاحشة، ولكن سنده لا يخلو من مقال.",
    "urdu": "یہ حدیث ضعیف ہے۔ اسے ابوداؤد (2049) اور نسائی (3229) نے روایت کیا ہے۔ امام احمد بن حنبل، امام نسائی اور ابن الجوزی نے اسے ضعیف قرار دیا ہے۔ اس کی بنیادی وجہ اس کے معنی میں پایا جانے والا ابہام اور متن کا اضطراب ہے۔ بعض علماء کا خیال ہے کہ 'ہاتھ نہ روکنے' سے مراد فضول خرچی ہے، بدکاری نہیں۔",
    "english": "Weak (Da'if). Reported by Abu Dawud (2049), An-Nasa'i (3229), and al-Bazzar. It was graded weak by Imam Ahmad, An-Nasa'i, and Ibn al-Jawzi. The defect lies in the inconsistency of the text and the ambiguity of its meaning. Some scholars interpret 'not repelling a hand' as being wasteful with money rather than unchastity."
  },
  "importantWords": [
    {
      "arabic": "لَا تَرُدُّ",
      "english": "Does not repel / refuse",
      "urdu": "نہیں لوٹاتی / نہیں روکتی"
    },
    {
      "arabic": "لَامِسٍ",
      "english": "Toucher",
      "urdu": "چھونے والا"
    },
    {
      "arabic": "غَرِّبْهَا",
      "english": "Distance her / Send her away",
      "urdu": "اسے دور کر دو"
    },
    {
      "arabic": "أَصْبِرُ",
      "english": "I have patience / bear",
      "urdu": "میں صبر کر سکتا"
    },
    {
      "arabic": "أَمْسِكْهَا",
      "english": "Keep her / Retain her",
      "urdu": "اسے روکے رکھو"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں ایک ایسے شخص کا تذکرہ ہے جس کی بیوی کے کردار میں لچک تھی، آپ ﷺ نے پہلے علیحدگی کا مشورہ دیا لیکن اس کی شدید محبت اور فتنے میں پڑنے کے خوف کی وجہ سے اسے نباہ کرنے کی اجازت دے دی۔",
    "english": "This Hadith mentions a man whose wife had questionable conduct; the Prophet (ﷺ) initially advised divorce, but upon learning of the man's intense love and fear of falling into sin himself, he permitted him to keep her."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (2049)",
      "english": "Sunan Abu Dawud (2049)"
    },
    {
      "arabic": "سنن النسائي (3229)",
      "english": "Sunan an-Nasa'i (3229)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9Kq6fR_wz4",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da'if)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم اور تاویل",
        "english": "Meaning and Interpretation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کلام میں ابہام کی وضاحت",
              "english": "Clarifying Ambiguity"
            },
            "content": {
              "urdu": [
                "علماء نے 'لَا تَرُدُّ يَدَ لَامِسٍ' کے دو معنی بیان کیے ہیں: ایک بدکاری اور دوسرا سائل کو خالی نہ لوٹانا۔",
                "اکثر محققین کے نزدیک اس سے مراد عورت کا بہت زیادہ سخی ہونا یا مال ضائع کرنا ہے، نہ کہ زنا۔",
                "اگر اس سے مراد بدکاری ہوتی تو آپ ﷺ اسے رکھنے کی اجازت نہ دیتے کیونکہ زانیہ کو نکاح میں رکھنا جائز نہیں۔"
              ],
              "english": [
                "Scholars give two meanings for 'not repelling a hand': unchastity or being overly generous/wasteful.",
                "Many researchers believe it refers to the wife being spendthrift or unable to say no to beggars.",
                "If it meant adultery, the Prophet (ﷺ) wouldn't have allowed keeping her, as retaining an adultress is generally forbidden."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبوی حکمتِ عملی",
              "english": "Prophetic Wisdom"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے پہلے طلاق کا مشورہ دیا کیونکہ ایسی عورت کے ساتھ زندگی گزارنا اذیت کا باعث ہو سکتا ہے۔",
                "جب شوہر نے اپنی کمزوری ظاہر کی تو آپ ﷺ نے اسے نکاح برقرار رکھنے کی اجازت دے دی۔",
                "اس سے معلوم ہوتا ہے کہ شریعت میں حالات اور انسانی جذبات کا لحاظ رکھا جاتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) first advised divorce because living with such a woman causes distress.",
                "When the husband confessed his emotional weakness, the Prophet allowed him to retain the marriage.",
                "This shows that Shariah takes individual circumstances and human emotions into account."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "محبت اور شرعی حدود",
        "english": "Love and Shariah Limits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فتنے سے بچنے کی تدبیر",
              "english": "Avoiding Fitnah"
            },
            "content": {
              "urdu": [
                "اگر طلاق کے بعد مرد کے گناہ میں مبتلا ہونے کا اندیشہ ہو تو نکاح برقرار رکھنا بہتر ہو سکتا ہے۔",
                "آپ ﷺ کا جواب سائل کی نفسیاتی حالت اور اس کے تقویٰ کو بچانے کے لیے تھا۔",
                "اسلام میں دو برائیوں میں سے کم تر برائی کو اختیار کرنے کا اصول یہاں نظر آتا ہے۔"
              ],
              "english": [
                "If divorce might lead the man into sin, maintaining the marriage may be preferable.",
                "The Prophet's (ﷺ) response was tailored to protect the questioner's psychological state and piety.",
                "The principle of choosing the lesser of two evils is evident in this Prophetic guidance."
              ]
            }
          },
          {
            "title": {
              "urdu": "اصلاحِ احوال کی کوشش",
              "english": "Efforts for Reform"
            },
            "content": {
              "urdu": [
                "بیوی کو اپنے پاس رکھنے کا مطلب یہ بھی ہے کہ شوہر اس کی اصلاح کی کوشش کرتا رہے۔",
                "اگر عورت کی عادات خراب ہوں تو شوہر کو اسے نیکی کی طرف لانے کی ذمہ داری اٹھانی چاہیے۔",
                "محبت کو اصلاح کا ذریعہ بنا کر ایک بگڑے ہوئے انسان کو سنوارا جا سکتا ہے۔"
              ],
              "english": [
                "Retaining the wife implies that the husband should continue efforts to reform her character.",
                "If a wife has bad habits, the husband should take responsibility for guiding her toward righteousness.",
                "Using love as a tool for reform can help rehabilitate a person with flawed traits."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی باریکیاں",
        "english": "Juristic Nuances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کی سندی حیثیت",
              "english": "Status of the Chain"
            },
            "content": {
              "urdu": [
                "اگرچہ راوی ثقہ کہے گئے ہیں، مگر متن میں اضطراب کی وجہ سے امام احمد نے اسے منکر کہا ہے۔",
                "اس طرح کی احادیث سے قطعی شرعی احکام ثابت نہیں کیے جا سکتے۔",
                "علماء اسے ایک خاص واقعے پر محمول کرتے ہیں جو عام قانون نہیں بن سکتا۔"
              ],
              "english": [
                "Although narrators are termed reliable, Imam Ahmad called it 'Munkar' due to textual inconsistency.",
                "Definitive Shariah rulings cannot be derived from such problematic narrations.",
                "Scholars treat this as a specific incident that does not establish a general law."
              ]
            }
          },
          {
            "title": {
              "urdu": "غیرتِ ایمانی کا تقاضا",
              "english": "Requirement of Faith-based Honor"
            },
            "content": {
              "urdu": [
                "ایک مسلمان مرد کے لیے غیرت کا تقاضا ہے کہ اس کی بیوی کا کردار بے داغ ہو۔",
                "اگر بیوی کی بے راہ روی حد سے بڑھ جائے تو علیحدگی ہی شرعی اور اخلاقی راستہ ہے۔",
                "یہ حدیث صرف ان حالات کے لیے ہے جہاں محبت فتنے میں پڑنے کا سبب بن رہی ہو۔"
              ],
              "english": [
                "A Muslim man's honor requires that his wife's character remain spotless.",
                "If a wife's misconduct becomes extreme, separation is the legal and moral path.",
                "This Hadith only applies to cases where intense love might otherwise lead to greater sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشورے کی اہمیت",
              "english": "Importance of Consultation"
            },
            "content": {
              "urdu": [
                "گھریلو مسائل میں صاحبِ علم اور تجربہ کار لوگوں سے مشورہ کرنا سنت ہے۔",
                "انسان کو اپنے جذبات اور حقیقت کے درمیان توازن قائم کرنا سیکھنا چاہیے۔",
                "مشکل فیصلے کرتے وقت اپنی اخلاقی اور روحانی حالت کو سامنے رکھنا ضروری ہے۔"
              ],
              "english": [
                "Consulting knowledgeable and experienced people regarding domestic issues is a Sunnah.",
                "One must learn to establish a balance between raw emotions and objective reality.",
                "It is necessary to consider one's moral and spiritual state when making difficult decisions."
              ]
            }
          },
          {
            "title": {
              "urdu": "درگزر اور حکمت",
              "english": "Pardon and Wisdom"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا جواب سائل کے لیے ایک نفسیاتی مرہم کی حیثیت رکھتا تھا۔",
                "اسلام سختی کے بجائے جہاں ممکن ہو، نرمی اور گنجائش نکالنے کو پسند کرتا ہے۔",
                "گھروں کو آباد رکھنے کے لیے کبھی کبھی کڑوے گھونٹ بھی پینے پڑتے ہیں۔"
              ],
              "english": [
                "The Prophet's (ﷺ) answer served as a psychological healing for the questioner.",
                "Islam prefers leniency and finding solutions over harshness wherever possible.",
                "To keep a home populated, sometimes one must endure difficult circumstances."
              ]
            }
          }
        ]
      }
    }
  ]
}