{
  "hadithId": 818,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["bulugh/book-7/818"],
    "kitabId": 7,
    "inKitabBab": 21,
    "arabicBook": "بلوغ المرام",
    "babId": 62
  },
 
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (2738)، ومسلم (1627).",
    "urdu": "یہ حدیث صحیح ہے اور امام بخاری (2738) اور امام مسلم (1627) نے اسے اپنی صحیحین میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (2738) and Muslim (1627)."
  },
  "importantWords": [
    {
      "arabic": "حَقُّ",
      "english": "Right / Appropriate",
      "urdu": "درست / لائق"
    },
    {
      "arabic": "يُوصِيَ",
      "english": "To make a will",
      "urdu": "وصیت کرے"
    },
    {
      "arabic": "يَبِيتُ",
      "english": "To spend the night",
      "urdu": "رات گزارے"
    },
    {
      "arabic": "لَيْلَتَيْنِ",
      "english": "Two nights",
      "urdu": "دو راتیں"
    },
    {
      "arabic": "مَكْتُوبَةٌ",
      "english": "Written",
      "urdu": "لکھی ہوئی"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں وصیت کی اہمیت اور اسے جلد تحریر کرنے کی تاکید کی گئی ہے تاکہ موت کے بعد حقوق ضائع نہ ہوں اور معاملات واضح رہیں۔",
    "english": "This Hadith emphasizes the importance of making a will and urges Muslims to write it promptly to ensure rights are preserved and affairs are clarified before death."
  },
  "references": [
    {
      "arabic": "صحيح البخاري (2738)",
      "english": "Sahih al-Bukhari (2738)"
    },
    {
      "arabic": "صحيح مسلم (1627)",
      "english": "Sahih Muslim (1627)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر بن الخطاب",
        "english": "Abdullah bin Umar bin al-Khattab"
      },
      "slug": "abdullah-bin-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-E_D2B3-M",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Sahih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وصیت کی اہمیت اور ضرورت",
        "english": "Importance and Necessity of a Will"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احتیاط اور دور اندیشی",
              "english": "Precaution and Foresight"
            },
            "content": {
              "urdu": [
                "موت کا وقت کسی کو معلوم نہیں، اس لیے مالی معاملات کو واضح رکھنا ضروری ہے۔",
                "وصیت تحریر کرنے سے مرنے والے کے بعد وارثین میں جھگڑوں کا سدِ باب ہوتا ہے۔",
                "یہ حدیث ایک مسلمان کو اپنی زندگی میں نظم و ضبط اور ذمہ داری سکھاتی ہے۔"
              ],
              "english": [
                "The time of death is unknown, so it is vital to keep financial affairs clear.",
                "Writing a will prevents potential disputes among heirs after one's passing.",
                "This Hadith teaches a Muslim discipline and responsibility during their lifetime."
              ]
            }
          },
          {
            "title": {
              "urdu": "حقوق العباد کی حفاظت",
              "english": "Protection of People's Rights"
            },
            "content": {
              "urdu": [
                "اگر کسی کے ذمہ قرض ہو تو اسے وصیت میں لکھنا شرعی طور پر واجب ہے۔",
                "لوگوں کی امانتیں اور ادھورے وعدے وصیت کا حصہ ہونے چاہئیں تاکہ وہ ادا ہو سکیں۔",
                "وصیت نہ لکھنا کسی کے حق کے ضائع ہونے کا سبب بن سکتا ہے جو کہ گناہ ہے۔"
              ],
              "english": [
                "It is religiously obligatory to document any outstanding debts in the will.",
                "People's trusts and unfulfilled promises should be part of the will for fulfillment.",
                "Failing to write a will can lead to the loss of rights, which is a sinful matter."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وصیت کے شرعی ضابطے",
        "english": "Shariah Rules of a Will"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک تہائی کی حد",
              "english": "Limit of One-Third"
            },
            "content": {
              "urdu": [
                "غیر وارث کے لیے وصیت کل مال کے ایک تہائی (1/3) سے زیادہ نہیں ہو سکتی۔",
                "وارث کے حق میں وصیت کرنا جائز نہیں الا یہ کہ تمام وارثین راضی ہوں۔",
                "یہ حد اس لیے مقرر ہے تاکہ وارثین کے بنیادی حقوق متاثر نہ ہوں۔"
              ],
              "english": [
                "A will for a non-heir cannot exceed one-third of the total estate.",
                "Making a will in favor of an heir is not valid unless all other heirs consent.",
                "This limit is set to ensure the basic rights of legal heirs are not compromised."
              ]
            }
          },
          {
            "title": {
              "urdu": "تحریری شکل کی اہمیت",
              "english": "Importance of Written Form"
            },
            "content": {
              "urdu": [
                "حدیث میں 'مکتوبہ' کا لفظ ثابت کرتا ہے کہ وصیت تحریری اور دستاویزی ہونی چاہیے۔",
                "زبانی وصیت میں بھول چوک اور اختلاف کا امکان زیادہ رہتا ہے۔",
                "تحریر پر گواہوں کی موجودگی اسے قانونی اور شرعی طور پر مستند بناتی ہے۔"
              ],
              "english": [
                "The word 'written' in the Hadith emphasizes the need for documented wills.",
                "Oral wills carry a higher risk of forgetfulness and legal disagreements.",
                "Having witnesses to the written document makes it legally and religiously valid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی فوائد",
        "english": "Social Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندانی ہم آہنگی",
              "english": "Family Harmony"
            },
            "content": {
              "urdu": [
                "واضح وصیت خاندان کے افراد کے درمیان باہمی اعتماد کو برقرار رکھتی ہے۔",
                "اس سے وراثت کی تقسیم میں ہونے والی ناانصافیوں کا خاتمہ ہوتا ہے۔",
                "اسلامی معاشرے میں مالی شفافیت کو فروغ دینا اس حکم کا مقصود ہے۔"
              ],
              "english": [
                "A clear will maintains mutual trust among family members.",
                "It eliminates injustices that often occur during inheritance distribution.",
                "Promoting financial transparency in Islamic society is the goal of this order."
              ]
            }
          },
          {
            "title": {
              "urdu": "صدقہ جاریہ کا موقع",
              "english": "Opportunity for Continuous Charity"
            },
            "content": {
              "urdu": [
                "انسان وصیت کے ذریعے نیک کاموں کے لیے مال وقف کر سکتا ہے۔",
                "یہ مرنے کے بعد بھی اجر و ثواب کے حصول کا ایک بہترین ذریعہ ہے۔",
                "وصیت ہمیں اپنی دولت کو اللہ کی راہ میں صحیح استعمال کرنے کا موقع دیتی ہے۔"
              ],
              "english": [
                "Through a will, a person can dedicate wealth to various charitable causes.",
                "This serves as an excellent means of gaining reward even after death.",
                "A will provides us the opportunity to use our wealth correctly in Allah's path."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی کا سبق",
        "english": "Practical Life Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تاخیر سے بچنا",
              "english": "Avoiding Delay"
            },
            "content": {
              "urdu": [
                "وصیت لکھنے میں سستی کرنا بڑے نقصان کا باعث بن سکتا ہے۔",
                "حدیث میں 'دو راتیں' کا ذکر عجلت اور فوری عمل کی اہمیت بتاتا ہے۔",
                "ایک ذمہ دار مسلمان کو ہمیشہ اپنے معاملات مکمل اور واضح رکھنے چاہئیں۔"
              ],
              "english": [
                "Procrastination in writing a will can result in significant losses.",
                "The mention of 'two nights' signifies the urgency and importance of prompt action.",
                "A responsible Muslim should always keep their affairs complete and clear."
              ]
            }
          },
          {
            "title": {
              "urdu": "گواہوں کا انتخاب",
              "english": "Choosing Witnesses"
            },
            "content": {
              "urdu": [
                "وصیت پر عادل اور معتبر گواہوں کے دستخط ہونے چاہئیں۔",
                "گواہوں کی موجودگی وصیت کے نفاذ کو آسان اور غیر متنازعہ بناتی ہے۔",
                "جدید دور میں قانونی ضابطوں کے مطابق وصیت رجسٹر کرانا بہتر ہے۔"
              ],
              "english": [
                "A will should be signed by just and reliable witnesses.",
                "The presence of witnesses makes the implementation of the will easier and undisputed.",
                "In the modern era, it is preferable to register the will according to legal protocols."
              ]
            }
          }
        ]
      }
    }
  ]
}