{
  "hadithId": 76,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["bukhari:137", "muslim:361a"],
    "kitabId": 1,
    "inKitabBab": 6,
    "arabicBook": "كتاب الطهارة",
    "babId": 6
  },

  "takhreej": {
    "arabic": " ضعيف. رواه الحاكم (134) ، وابن حبان (2666) ، وتمامه عندهما: \"حتى يسمع صوتا بأذنه، أو يجد ريحا بأنفه\". لكن أصل الحديث ثابت في الصحيحين.",
    "urdu": "ابن عباس رضی اللہ عنہما کی روایت ضعیف ہے، اسے حاکم (134) اور ابن حبان (2666) نے روایت کیا ہے۔ لیکن اس حدیث کی اصل اور مرکزی حکم عبداللہ بن زید اور ابوہریرہ رضی اللہ عنہما کی صحیح احادیث میں موجود ہے (صحیحین میں)۔",
    "english": "Da'if (Weak) in this specific wording (Ibn Abbas). Reported by Al-Hakim (134) and Ibn Hibban (2666). However, the core principle of this Hadith is firmly established in the two Sahih collections (Bukhari and Muslim) from the narrations of Abdullah ibn Zaid and Abu Hurairah, rendering the ruling Sahih."
  },
  "importantWords": [
    {
      "arabic": "الشَّيْطَانُ",
      "english": "Satan / Devil",
      "urdu": "شیطان"
    },
    {
      "arabic": "صَلَاتِهِ",
      "english": "His prayer",
      "urdu": "اس کی نماز"
    },
    {
      "arabic": "يَنْفُخُ",
      "english": "He blows",
      "urdu": "پھونک مارتا ہے"
    },
    {
      "arabic": "مَقْعَدَتِهِ",
      "english": "His rear / seat",
      "urdu": "مقعد / بیٹھنے کی جگہ"
    },
    {
      "arabic": "فَيُخَيَّلُ",
      "english": "He imagines / perceives falsely",
      "urdu": "خیال دلایا جاتا ہے"
    },
    {
      "arabic": "أَحْدَثَ",
      "english": "Invalidated Wudu' (by passing wind)",
      "urdu": "بےوضو ہو گیا"
    },
    {
      "arabic": "يَنْصَرِفُ",
      "english": "He leaves / stops (the prayer)",
      "urdu": "نماز سے پھرے"
    },
    {
      "arabic": "صَوْتًا",
      "english": "A sound",
      "urdu": "آواز"
    },
    {
      "arabic": "رِيحًا",
      "english": "A smell / odor",
      "urdu": "بدبو / ہوا"
    },
    {
      "arabic": "كَذَبْتَ",
      "english": "You lied",
      "urdu": "تو جھوٹ بولتا ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز کے دوران پیدا ہونے والے شیطانی وسوسوں سے متعلق شرعی اصول بیان کرتی ہے، جس میں مسلمان کو یہ تعلیم دی گئی ہے کہ جب تک ریح خارج ہونے کی آواز یا بو کا یقینی ثبوت نہ ہو، وہ صرف وہم کی بنیاد پر نماز نہ چھوڑے۔",
    "english": "This Hadith sets the legal principle regarding Satanic whispers (Waswas) during prayer, teaching Muslims that they must not abandon their prayer based on mere doubt. Wudu' is only invalidated if there is definitive proof, namely hearing a sound or perceiving an odor (of passing wind)."
  },
  "references": [
    {
      "arabic": "أخرجه البزار (نحوه)",
      "english": "Reported by Al-Bazzar (similar wording)"
    },
    {
      "arabic": "أصله في الصحيحين (من حديث عبد اَللَّهِ بْنِ زَيْد)",
      "english": "Its origin is in Al-Bukhari and Muslim (from the Hadith of Abdullah ibn Zaid)"
    },
    {
      "arabic": "رواه مسلم (نحوه عن أبي هريرة)",
      "english": "Reported by Muslim (similar wording from Abu Hurairah)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا",
        "english": "Ibn Abbas (May Allah be pleased with them both)"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عَبْدِ اَللَّهِ بْنِ زَيْد",
        "english": "Abdullah ibn Zaid"
      },
      "slug": "abdullah-ibn-zaid"
    },
    {
      "id": 3,
      "name": {
        "arabic": "أَبِي هُرَيْرَةَ",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "",
  "grade": {
    "arabic": "صحيح (بأصله)",
    "english": "Sahih (due to its established origin)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وسوسہ اور وضو کے ٹوٹنے کا اصول",
        "english": "Principle of Waswas and Nullification of Wudu'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں شیطانی پھونک",
              "english": "Satanic Blow during Prayer"
            },
            "content": {
              "urdu": [
                "حدیث میں شیطان کا ذکر ہے جو نمازی کو شک میں مبتلا کرنے کے لیے اس کی مقعد میں پھونک مارتا ہے۔",
                "یہ 'پھونک' حقیقت میں ایک استعارہ ہے جو نماز کے دوران وضو ٹوٹنے کا وہم اور وسوسہ پیدا کرتا ہے۔",
                "شیطان کا بنیادی ہدف یہ ہوتا ہے کہ وہ نمازی کو طہارت کے شک میں ڈال کر اس کی عبادت کو باطل کر دے۔"
              ],
              "english": [
                "The Hadith mentions Satan blowing into the rear of the worshipper to inflict doubt about their purity.",
                "This 'blow' is a metaphor for generating overwhelming doubt and suspicion about passing wind during prayer.",
                "Satan's primary goal is to invalidate the worshipper's prayer by causing them to abandon it on the basis of purity doubts."
              ]
            }
          },
          {
            "title": {
              "urdu": "یقین اور شک کا قاعدہ",
              "english": "The Rule of Certainty over Doubt"
            },
            "content": {
              "urdu": [
                "اسلامی فقہ کا یہ ایک **بنیادی قاعدہ** ہے کہ **یقین شک سے زائل نہیں ہوتا** (الیقین لا یزول بالشک). ",
                "چونکہ نمازی نماز شروع کرتے وقت باوضو ہونے کا یقین رکھتا تھا، لہٰذا شک کی بنیاد پر اس یقین کو ترک نہیں کیا جائے گا۔",
                "وضو کے ٹوٹنے کے لیے یقینی ثبوت (آواز یا بو) درکار ہے، محض وہم پر عمل کرنا شیطانی دھوکے میں آنا ہے۔"
              ],
              "english": [
                "It is a **fundamental maxim** in Islamic jurisprudence that **certainty is not removed by doubt** (Al-Yaqin la yazul bil-shakk).",
                "Since the worshipper was certain of being pure when starting the prayer, this certainty cannot be abandoned merely based on doubt.",
                "Definitive proof (sound or smell) is required to break Wudu'; acting on mere conjecture is falling for Satanic deceit."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "وسوسہ کا علاج اور عملی حکم",
        "english": "Curing Waswas and Practical Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آواز یا بو پر انحصار",
              "english": "Reliance on Sound or Smell"
            },
            "content": {
              "urdu": [
                "حکم واضح ہے کہ نماز صرف اس وقت چھوڑی جائے جب ریح کی آواز سنی جائے یا اس کی بدبو محسوس ہو۔",
                "یہ حکم اس بات کو یقینی بناتا ہے کہ وضو صرف واضح اور حسی (سینسری) طور پر محسوس ہونے والے اخراج سے ٹوٹے۔",
                "اگر نماز کے دوران پیٹ میں حرکت یا آوازیں محسوس ہوں مگر باہر کوئی چیز خارج نہ ہو، تب بھی وضو قائم رہے گا۔"
              ],
              "english": [
                "The ruling is clear: prayer should only be terminated if the sound of wind is heard or its smell is clearly perceived.",
                "This command ensures that Wudu' is nullified only by a clear, physically detectable exit of impurity.",
                "If one feels internal abdominal movement or rumbling during prayer without any actual discharge, Wudu' remains valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان کو جواب دینا",
              "english": "Answering the Satanic Whisper"
            },
            "content": {
              "urdu": [
                "حدیث میں وسوسہ آنے پر شیطان کو 'تو جھوٹ بولتا ہے' کہنے کی تعلیم دی گئی ہے، چاہے وہ دل میں ہی ہو۔",
                "یہ عمل روحانی دفاع کا ایک طریقہ ہے اور شیطان کے وسوسے کو مسترد کرنے کا عزم ظاہر کرتا ہے۔",
                "ایسا کرنے سے نمازی کا دل پھر سے اللہ کی طرف متوجہ ہو جاتا ہے اور وسوسے کا اثر زائل ہو جاتا ہے۔"
              ],
              "english": [
                "The Hadith instructs the worshipper, when experiencing doubt, to say 'You lie' to Satan, even if only in their heart.",
                "This act serves as a form of spiritual defense (Hisn) and shows the worshipper's determination to reject the whisper.",
                "Doing so redirects the worshipper's heart back to Allah and negates the psychological effect of the doubt."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحیحین سے تائید اور درجہ",
        "english": "Confirmation from the Two Sahihs and Grading"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کی مجموعی صحت",
              "english": "Overall Authenticity of the Hadith"
            },
            "content": {
              "urdu": [
                "اگرچہ ابن عباس رضی اللہ عنہما کی مخصوص سند (بزار کے ذریعے) کو ضعیف قرار دیا گیا ہے، لیکن اصل حکم صحیح ہے۔",
                "چونکہ یہ اصول حضرت عبداللہ بن زید اور حضرت ابوہریرہ رضی اللہ عنہما کی روایات کے ذریعے صحیحین میں پختہ طور پر ثابت ہے۔",
                "اس لیے فقہی حکم کے لیے یہ حدیث صحیح سمجھی جاتی ہے اور 'صحیح باصولہ' (اپنے اصول کی بنا پر صحیح) کا درجہ رکھتی ہے۔"
              ],
              "english": [
                "Although the specific chain from Ibn Abbas (via Al-Bazzar) is rated weak, the underlying principle is authentically established.",
                "This rule is firmly confirmed in Al-Bukhari and Muslim through the narrations of Abdullah ibn Zaid and Abu Hurairah (RA).",
                "Therefore, for juristic purposes, this Hadith is considered authentic and is classified as 'Sahih bi-Usulihi' (authentic based on its fundamental sources)."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسلمانوں کے لیے آسانی",
              "english": "Ease for Muslims"
            },
            "content": {
              "urdu": [
                "یہ حکم شریعت کی طرف سے مسلمانوں کے لیے آسانی اور رحمت کا اظہار ہے، تاکہ وہ وسوسوں میں نہ پڑیں۔",
                "اگر ہر شک پر نماز توڑ دی جائے تو عبادت مشکل ہو جائے گی اور شیطان اپنے مقصد میں کامیاب ہو جائے گا۔",
                "اس قاعدے پر عمل سے مسلمان اپنی عبادات میں اطمینان اور سکون کے ساتھ مکمل کر سکتے ہیں۔"
              ],
              "english": [
                "This ruling demonstrates the ease and mercy of Shariah for Muslims, preventing them from succumbing to doubt.",
                "If prayer were broken on every doubt, worship would become burdensome, and Satan would achieve his goal.",
                "By adhering to this rule, Muslims can complete their acts of worship with tranquility and inner peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دیگر عبادات میں اطلاق اور سبق",
        "english": "Application in Other Worships and Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طواف میں وسوسہ",
              "english": "Doubt during Tawaf (Circumambulation)"
            },
            "content": {
              "urdu": [
                "یقین کا یہ اصول صرف نماز تک محدود نہیں، بلکہ طواف جیسے دیگر عبادات میں بھی لاگو ہوتا ہے۔",
                "اگر طواف کے دوران شک ہو کہ وضو ٹوٹ گیا ہے تو بھی آواز یا بو کے بغیر طواف جاری رکھا جائے گا۔",
                "یہ شریعت کی وہ بنیاد ہے جو عبادت میں انسان کے دل کو یکسوئی اور اطمینان فراہم کرتی ہے۔"
              ],
              "english": [
                "This principle of certainty is not limited to prayer but also applies to other acts of worship, such as Tawaf (circumambulation).",
                "If doubt arises during Tawaf about the invalidation of Wudu', one should continue without sound or smell.",
                "This is the foundation of Shariah that provides consistency and peace of mind for the worshipper."
              ]
            }
          },
          {
            "title": {
              "urdu": "ذہنی صحت اور ایمان",
              "english": "Mental Health and Faith"
            },
            "content": {
              "urdu": [
                "یہ حدیث شیطانی وسوسوں کے ذریعے پیدا ہونے والی اضطراب اور ذہنی پریشانیوں کا عملی علاج ہے۔",
                "یہ تعلیم دیتی ہے کہ شک کو شک کی ہی نظر سے دیکھیں اور صرف یقین پر ہی عمل کو موقوف رکھیں۔",
                "نماز اللہ اور بندے کے درمیان رابطہ ہے، اور شیطان اسی موقع پر حملہ کرتا ہے، لہٰذا ہمیں ثابت قدم رہنا چاہیے۔"
              ],
              "english": [
                "This Hadith provides a practical remedy for the anxiety and mental distress caused by Satanic whispering (Waswas).",
                "It teaches us to treat doubt as mere doubt and only proceed based on certainty (Yaqin).",
                "Prayer is the direct link between Allah and His servant, and Satan attacks at this critical point; thus, we must remain firm."
              ]
            }
          }
        ]
      }
    }
  ]
}
