{
  "hadithId": 1224,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["bulugh/16/94"],
    "kitabId": 16,
    "inKitabBab": 5,
    "arabicBook": "الجامع - باب البر والصلة",
    "babId": 106
  },
 
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (2588).",
    "urdu": "صحیح۔ اسے امام مسلم (2588) نے اپنی صحیح میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Muslim (2588)."
  },
  "importantWords": [
    {
      "arabic": "مَا نَقَصَتْ",
      "english": "Does not diminish",
      "urdu": "کمی نہیں کرتا"
    },
    {
      "arabic": "بِعَفْوٍ",
      "english": "By forgiveness",
      "urdu": "معاف کر دینے سے"
    },
    {
      "arabic": "عِزًّا",
      "english": "Honor / Might",
      "urdu": "عزت / غلبہ"
    },
    {
      "arabic": "تَوَاضَعَ",
      "english": "Humbled himself",
      "urdu": "عاجزی اختیار کی"
    },
    {
      "arabic": "رَفَعَهُ",
      "english": "Raised him",
      "urdu": "اسے بلند کیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اخلاقیات کے تین اہم ستون بیان کرتی ہے: صدقہ سے مال میں برکت، درگزر سے عزت میں اضافہ، اور عاجزی سے مقام کی بلندی۔",
    "english": "This Hadith outlines three pillars of character: charity brings blessing to wealth, forgiveness increases honor, and humility leads to high status."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب البر والصلة والآداب، رقم 2588",
      "english": "Sahih Muslim, Book of Virtue, Enjoining Good Manners and Joining of the Ties of Kinship, No. 2588"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah al-Dawsi"
      },
      "slug": "abu-hurairah-al-dawsi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9YgD9jP_wM",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "صدقہ اور مال میں برکت",
        "english": "Charity and Blessing in Wealth"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مال میں کمی نہ ہونے کی حقیقت",
              "english": "The Reality of Non-Diminishing Wealth"
            },
            "content": {
              "urdu": [
                "ظاہری طور پر صدقہ دینے سے مال کم ہوتا نظر آتا ہے، لیکن حقیقت میں اللہ اس میں غیبی برکت پیدا کر دیتا ہے۔",
                "صدقہ مال کو پاک کرتا ہے اور اسے آنے والی بلاؤں اور نقصانات سے محفوظ رکھتا ہے۔",
                "اللہ تعالیٰ صدقہ کرنے والے کے لیے رزق کے نئے اور آسان دروازے کھول دیتا ہے۔"
              ],
              "english": [
                "Outwardly, charity seems to decrease wealth, but in reality, Allah instills hidden blessings (Barakah) in it.",
                "Charity purifies wealth and protects it from upcoming calamities and losses.",
                "Allah opens new and easy doors of sustenance for the one who gives charity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "درگزر اور حقیقی عزت",
        "english": "Forgiveness and True Honor"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "معافی سے مقام کی بلندی",
              "english": "Elevation through Forgiveness"
            },
            "content": {
              "urdu": [
                "لوگ سمجھتے ہیں کہ بدلہ نہ لینے سے انسان کمزور لگتا ہے، مگر اللہ فرماتا ہے کہ معاف کرنے والے کی عزت وہ خود بڑھاتا ہے۔",
                "درگزر کرنے والے کا وقار لوگوں کے دلوں میں پیدا کر دیا جاتا ہے اور آخرت میں اسے عظیم اجر ملتا ہے۔",
                "غصے پر قابو پا کر معاف کر دینا نفس کی سب سے بڑی فتح ہے۔"
              ],
              "english": [
                "People often think that not taking revenge makes one look weak, but Allah states that He Himself increases the honor of the forgiver.",
                "The dignity of the one who overlooks faults is established in people's hearts and earns great reward in the Hereafter.",
                "Controlling anger and choosing to forgive is the greatest victory over one's self."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عاجزی اور رفعت",
        "english": "Humility and Elevation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کے لیے انکساری",
              "english": "Humility for Allah's Sake"
            },
            "content": {
              "urdu": [
                "تواضع کا مطلب ہے اپنی بڑائی نہ چاہنا اور دوسروں کو حقیر نہ سمجھنا، بشرطیکہ یہ صرف اللہ کی رضا کے لیے ہو۔",
                "جو جتنا عاجز ہوتا ہے، اللہ اسے دنیا و آخرت میں اتنی ہی بلندی عطا فرماتا ہے۔",
                "تکبر انسان کو نیچے گراتا ہے جبکہ انکساری اسے محبوبِ خدا بناتی ہے۔"
              ],
              "english": [
                "Humility means not seeking greatness for oneself and not looking down on others, provided it is done for Allah's sake.",
                "The more humble a person is, the more Allah elevates them in both worlds.",
                "Arrogance brings a person down, while humility makes them beloved to Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خلاصہ اور سبق",
        "english": "Summary and Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اخلاقی انقلاب",
              "english": "Ethical Revolution"
            },
            "content": {
              "urdu": [
                "یہ تینوں کام انسانی نفس پر بھاری ہیں، مگر ان کا انجام کامیابی اور سکون ہے۔",
                "اسلام ہمیں ظاہری مادی سوچ سے نکال کر روحانی اور اخلاقی بلندی کی طرف لے جاتا ہے۔",
                "سچا مومن وہی ہے جو دنیاوی مفاد پر اللہ کے وعدوں کو ترجیح دیتا ہے۔"
              ],
              "english": [
                "These three actions are difficult for the ego, but their outcome is success and peace.",
                "Islam transitions us from materialistic thinking toward spiritual and moral heights.",
                "A true believer is one who prioritizes Allah's promises over worldly gains."
              ]
            }
          }
        ]
      }
    }
  ]
}