{
  "hadithId": 265,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:571"],
    "kitabId": 2,
    "inKitabBab": 8,
    "arabicBook": "صحیح مسلم",
    "babId": 18
  },
  "name": {
    "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ , فَلَمْ يَدْرِ كَمْ صَلَّى أَثْلَاثًا أَوْ أَرْبَعًا ? فَلْيَطْرَحِ الشَّكَّ وَلْيَبْنِ عَلَى مَا اسْتَيْقَنَ , ثُمَّ يَسْجُدُ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ , فَإِنْ كَانَ صَلَّى خَمْساً شَفَعْنَ لَهُ صَلَاتَهُ , وَإِنْ كَانَ صَلَّى تَمَامً ا كَانَتَا تَرْغِيمًا لِلشَّيْطَانِ\" } رَوَاهُ مُسْلِمٌ .",
    "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کسی کو جب نماز میں یہ شک ہو جائے کہ اس نے کتنی رکعتیں پڑھی ہیں، تین یا چار؟ تو ایسی صورت میں شک کو نظرانداز کر کے جس پر یقین ہو (یعنی کم تعداد) اس پر نماز کی بنا رکھے۔ پھر سلام پھیرنے سے پہلے سہو کے دو سجدے کر لے۔ پس اگر اس نے پانچ رکعتیں پڑھی ہوں گی تو یہ دو سجدے اس کی نماز کو جفت کر دیں گے، اور اگر اس نے پوری نماز پڑھی ہے تو یہ دو سجدے شیطان کے لئے باعث ذلت و رسوائی ہوں گے۔“ (مسلم)",
    "english": "Narrated Abu Sa'id Al-Khudri (RA): Allah's Messenger (ﷺ) said: \"When any one of you is in doubt about his prayer and does not know how much he has prayed, three or four (Rak'ahs), he should cast aside his doubt and base his prayer on what he is convinced of (the lesser number). Then let him perform two prostrations before giving the Taslim. If he has prayed five Rak'ahs, they will make his prayer an even number for him, and if he has prayed exactly four, they will be humiliation for the devil.\""
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه مسلم ( 571 )‏ .‏ وترغيما : أي : إلصاقا لأنفه بالتراب ، والمراد : رده خاسئا .‏ وإهانته وإذلاله .‏",
    "urdu": "صحیح۔ اسے مسلم (571) نے روایت کیا ہے۔ ترغیماً سے مراد شیطان کی ناک خاک آلود کرنا یعنی اسے ذلیل و رسوا کرنا ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (571). 'Targhiman' means rubbing the nose in dust, implying humiliation and disgrace for Satan."
  },
  "importantWords": [
    {
      "arabic": "شَكَّ",
      "english": "Doubted",
      "urdu": "شک کیا"
    },
    {
      "arabic": "لَمْ يَدْرِ",
      "english": "Did not know",
      "urdu": "اسے معلوم نہ ہوا"
    },
    {
      "arabic": "اسْتَيْقَنَ",
      "english": "Was certain",
      "urdu": "یقین کر لیا"
    },
    {
      "arabic": "فَلْيَطْرَحِ",
      "english": "Cast aside",
      "urdu": "پھینک دے / چھوڑ دے"
    },
    {
      "arabic": "شَفَعْنَ",
      "english": "Make even",
      "urdu": "جفت بنا دیں"
    },
    {
      "arabic": "تَرْغِيمًا",
      "english": "Humiliation",
      "urdu": "ذلت / رسوائی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں شک کا حل بتاتی ہے کہ شک کو چھوڑ کر کم رکعتوں پر یقین کریں، نماز مکمل کریں اور سلام سے پہلے دو سجدے کریں۔",
    "english": "This Hadith provides the solution for doubt in prayer: discard the doubt, build upon the lesser number (certainty), complete the prayer, and perform two prostrations before Taslim."
  },
  "references": [
    {
      "arabic": "رواه مسلم (571)",
      "english": "Reported by Muslim (571)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أَبِي سَعِيدٍ اَلْخُدْرِيِّ",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://youtu.be/4WUkp632T0c?si=RND-Gf7uTlmJ6wV_",
  "grade": {
    "arabic": "صحیح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شک کا علاج",
              "english": "Remedy for Doubt"
            },
            "content": {
              "urdu": [
                "جب نماز کی رکعتوں میں شک ہو تو یقین پر بنیاد رکھیں۔",
                "کم رکعتوں کو یقینی مانیں اور باقی نماز پوری کریں۔",
                "شیطان کے ڈالے ہوئے وسوسے کو رد کرنے کا یہ بہترین طریقہ ہے۔"
              ],
              "english": [
                "When in doubt about Rak'ahs, build upon certainty.",
                "Consider the lesser number as certain and complete the prayer.",
                "This is the best way to reject the whispers cast by Satan."
              ]
            }
          },
          {
            "title": {
              "urdu": "سجدہ سہو کا مقام",
              "english": "Timing of Sujud Sahw"
            },
            "content": {
              "urdu": [
                "اس صورت میں سجدہ سہو سلام پھیرنے سے پہلے کیا جائے گا۔",
                "یہ دو سجدے نماز میں ہونے والی کمی یا زیادتی کا ازالہ ہیں۔",
                "نبی ﷺ نے اسے شیطان کی ذلت کا سبب قرار دیا ہے۔"
              ],
              "english": [
                "In this case, Sujud as-Sahw is performed before Taslim.",
                "These two prostrations compensate for any excess or deficiency.",
                "The Prophet (ﷺ) declared it a cause of humiliation for Satan."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "یقین کا اصول",
              "english": "Principle of Certainty"
            },
            "content": {
              "urdu": [
                "فقہ کا اصول ہے: 'یقین شک سے زائل نہیں ہوتا'۔",
                "تین رکعتیں یقینی ہیں، چوتھی مشکوک ہے، اس لیے تین مانیں۔",
                "اس اصول سے ذہنی انتشار ختم ہوتا ہے اور یکسوئی ملتی ہے۔"
              ],
              "english": [
                "The juristic principle states: 'Certainty is not removed by doubt'.",
                "Three Rak'ahs are certain, the fourth is doubtful, so assume three.",
                "This principle eliminates mental confusion and brings focus."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی حفاظت",
              "english": "Protection of Prayer"
            },
            "content": {
              "urdu": [
                "سجدہ سہو نماز کو مکمل اور محفوظ بناتا ہے۔",
                "اگر پانچ رکعت ہو گئیں تو سجدہ اسے چھ (جفت) بنا دے گا۔",
                "یہ اللہ کی طرف سے بندوں پر خاص رعایت ہے۔"
              ],
              "english": [
                "Sujud as-Sahw makes the prayer complete and protected.",
                "If five Rak'ahs were prayed, the prostration makes it six (even).",
                "This is a special concession from Allah to His servants."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وسوسوں سے نجات",
              "english": "Freedom from Whispers"
            },
            "content": {
              "urdu": [
                "نماز توڑنے یا دوبارہ پڑھنے کی ضرورت نہیں ہے۔",
                "بس اصول پر عمل کریں اور نماز جاری رکھیں۔",
                "اس سے انسان وہم اور نفسیاتی دباؤ سے بچ جاتا ہے۔"
              ],
              "english": [
                "There is no need to break or repeat the prayer.",
                "Simply follow the rule and continue the prayer.",
                "This saves a person from superstition and psychological stress."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان کا مقابلہ",
              "english": "Combating Satan"
            },
            "content": {
              "urdu": [
                "شیطان چاہتا ہے کہ نماز خراب ہو اور انسان پریشان ہو۔",
                "سجدہ سہو کر کے ہم شیطان کو شکست دیتے ہیں۔",
                "اللہ کی اطاعت شیطان کے لیے سب سے بڑی ذلت ہے۔"
              ],
              "english": [
                "Satan wants the prayer to be spoiled and the person to be worried.",
                "By performing Sujud as-Sahw, we defeat Satan.",
                "Obedience to Allah is the greatest humiliation for Satan."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دین میں سہولت",
              "english": "Ease in Religion"
            },
            "content": {
              "urdu": [
                "اسلام بھول چوک پر گرفت نہیں کرتا بلکہ حل دیتا ہے۔",
                "اللہ تعالیٰ ہماری کمزوریوں کو جانتا ہے اور درگزر فرماتا ہے۔",
                "یہ تعلیمات اسلام کی حقانیت اور رحمت کا ثبوت ہیں۔"
              ],
              "english": [
                "Islam does not punish forgetfulness but provides a solution.",
                "Allah knows our weaknesses and overlooks them.",
                "These teachings are proof of Islam's truth and mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت کا کمال",
              "english": "Perfection of Worship"
            },
            "content": {
              "urdu": [
                "نماز کا جفت ہونا (Even number) پسندیدہ ہے۔",
                "نبی ﷺ نے ہر صورت حال کا احاطہ فرمایا ہے۔",
                "ہمیں دین کا علم حاصل کرنا چاہیے تاکہ صحیح عبادت کر سکیں۔"
              ],
              "english": [
                "It is preferred for the prayer to be an even number.",
                "The Prophet (ﷺ) covered every situation.",
                "We must acquire religious knowledge to worship correctly."
              ]
            }
          }
        ]
      }
    }
  ]
}
