{
  "hadithId": 268,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["urn:1259"],
    "kitabId": 2,
    "inKitabBab": 8,
    "arabicBook": "Bulugh al-Maram",
    "babId": 18
  },
  "name": {
    "arabic": "وَعَنْ عُمَرَ رَضِيَ اَللَّهُ عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَيْسَ عَلَى مَنْ خَلَفَ اَلْإِمَامَ سَهْوٌ فَإِنْ سَهَا اَلْإِمَامُ فَعَلَيْهِ وَعَلَى مَنْ خَلْفَهُ } رَوَاهُ اَلْبَزَّارُ وَالْبَيْهَقِيُّ بِسَنَدٍ ضَعِيفٍ .",
    "urdu": "سیدنا عمر رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”کسی مقتدی پر (ذاتی بھول پر) سجدہ سہو نہیں ہے۔ ہاں اگر امام بھول جائے تو پھر امام اور مقتدی دونوں پر سجدہ سہو ہے۔“ اسے بزار اور بیہقی نے ضعیف سند کے ساتھ روایت کیا ہے۔",
    "english": "Narrated by Umar (may Allah be pleased with him): The Prophet (ﷺ) said: 'There is no Sujud as-Sahw (prostration for forgetfulness) upon the one behind the Imam. But if the Imam forgets, then it is upon him and upon those behind him.' Reported by Al-Bazzar and Al-Bayhaqi with a weak chain."
  },
  "takhreej": {
    "arabic": "ضعيف جداً. رواه البيهقي (2/352) والدارقطني (1/377). في سنده أبو الحسين المديني وهو مجهول، وخارجة بن مصعب وهو متروك، قال ابن معين: كذبه. ونسبته في المطبوع للترمذي خطأ فاحش.",
    "urdu": "انتہائی ضعیف۔ اسے بیہقی (2/352) اور دارقطنی (1/377) نے روایت کیا ہے۔ اس کی سند میں ابو الحسین مدینی ہے جو 'مجہول' ہے، اور خارجہ بن مصعب ہے جو 'متروک' ہے۔ ابن معین نے اسے جھوٹا کہا ہے۔ اس حدیث کی ترمذی کی طرف نسبت ایک بڑی غلطی ہے۔",
    "english": "Very Weak. Reported by Al-Bayhaqi (2/352) and Ad-Daraqutni (1/377). Its chain contains Abu Al-Husayn Al-Madini, who is Unknown (Majhul), and Kharijah bin Mus'ab, who is Discarded (Matruk). Ibn Ma'in accused him of lying. Attributing this to At-Tirmidhi in some prints is a gross error."
  },
  "importantWords": [
    {
      "arabic": "خلف",
      "english": "Behind",
      "urdu": "پیچھے"
    },
    {
      "arabic": "ليس على",
      "english": "Not upon him",
      "urdu": "اس پر نہیں ہے"
    },
    {
      "arabic": "الإمام",
      "english": "Leader (Imam)",
      "urdu": "امام"
    },
    {
      "arabic": "سهى",
      "english": "Forgot",
      "urdu": "بھول گیا"
    },
    {
      "arabic": "عليه",
      "english": "Upon him",
      "urdu": "اس پر لازم"
    },
    {
      "arabic": "متروك",
      "english": "Discarded (Narrator)",
      "urdu": "متروک (راوی)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سند کے اعتبار سے بہت ضعیف ہے، لیکن فقہاء کا اس کے معنی پر اتفاق ہے کہ مقتدی اگر اپنی ذاتی نماز میں بھول جائے تو اس پر سجدہ نہیں، لیکن امام کی بھول پر اسے سجدہ کرنا ہوگا۔",
    "english": "This Hadith is very weak in terms of its chain, but jurists agree on its meaning: a follower does not perform Sujud for his own forgetfulness, but must follow the Imam if the Imam forgets."
  },
  "references": [
    {
      "arabic": "رواه البزار (مسند البزار)",
      "english": "Reported by Al-Bazzar"
    },
    {
      "arabic": "رواه البيهقي (2/352)",
      "english": "Reported by Al-Bayhaqi (2/352)"
    },
    {
      "arabic": "رواه الدارقطني (1/377)",
      "english": "Reported by Ad-Daraqutni (1/377)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "Umar ibn Al-Khattab"
      },
      "slug": "umar-ibn-al-khattab"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-k7Owb2QM",
  "grade": {
    "arabic": "ضعيف جداً",
    "english": "Da'if Jiddan (Very Weak)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مقتدی کی بھول",
              "english": "Follower's forgetfulness"
            },
            "content": {
              "urdu": [
                "اگر مقتدی امام کے پیچھے قرات یا تسبیح میں کچھ بھول جائے تو اس پر سجدہ نہیں ہے۔",
                "امام کی قرات اور عمل مقتدی کی طرف سے کفایت کرتا ہے۔",
                "جماعت کی حالت میں فرد کی چھوٹی غلطیاں معاف ہو جاتی ہیں۔"
              ],
              "english": [
                "If a follower forgets something in recitation or Tasbeeh behind the Imam, he does not owe a prostration.",
                "The Imam's recitation and action suffice for the follower.",
                "In congregation, minor individual mistakes are overlooked."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام کی بھول",
              "english": "Imam's forgetfulness"
            },
            "content": {
              "urdu": [
                "اگر امام بھول جائے اور سجدہ سہو کرے تو مقتدی پر بھی سجدہ لازم ہے۔",
                "مقتدی کا کام امام کی مکمل اتباع کرنا ہے۔",
                "امام کے سجدے میں شریک نہ ہونا نماز کو خراب کر سکتا ہے۔"
              ],
              "english": [
                "If the Imam forgets and performs Sujud as-Sahw, the follower must also prostrate.",
                "The duty of the follower is to follow the Imam completely.",
                "Not joining the Imam in the prostration can invalidate the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حیثیت",
        "english": "Juristic Status"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعیف حدیث اور اجماع",
              "english": "Weak Hadith and Consensus"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حدیث سند کے لحاظ سے سخت ضعیف ہے، مگر اس کا مسئلہ متفق علیہ ہے۔",
                "تمام فقہاء کا اجماع ہے کہ امام مقتدی کے سہو کا بوجھ اٹھا لیتا ہے۔",
                "کبھی کبھی ضعیف حدیث کا متن فقہی اصولوں کے مطابق صحیح ہوتا ہے۔"
              ],
              "english": [
                "Although this Hadith is very weak in chain, its ruling is agreed upon.",
                "There is consensus among jurists that the Imam carries the burden of the follower's forgetfulness.",
                "Sometimes the text of a weak Hadith aligns correctly with juristic principles."
              ]
            }
          },
          {
            "title": {
              "urdu": "سند کی خرابی",
              "english": "Defect in Chain"
            },
            "content": {
              "urdu": [
                "خارجہ بن مصعب کو محدثین نے متروک اور کذاب کہا ہے۔",
                "ابو الحسین مدینی مجہول راوی ہے۔",
                "اس لیے اس حدیث کو رسول اللہ ﷺ کا فرمان کہنا درست نہیں، مگر حکم درست ہے۔"
              ],
              "english": [
                "Kharijah bin Mus'ab is considered Matruk (discarded) and a liar by scholars.",
                "Abu Al-Husayn Al-Madini is an unknown narrator.",
                "Therefore, attributing this statement to the Prophet (ﷺ) is not correct, though the ruling is valid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کا نظم",
        "english": "Discipline of Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماعت کی اہمیت",
              "english": "Importance of Congregation"
            },
            "content": {
              "urdu": [
                "نماز باجماعت میں امام ایک قائد کی حیثیت رکھتا ہے۔",
                "ساری جماعت ایک جسم کی طرح امام کے ساتھ حرکت کرتی ہے۔",
                "انفرادی غلطیوں سے جماعت کے نظم میں خلل نہیں آنا چاہیے۔"
              ],
              "english": [
                "In congregational prayer, the Imam holds the position of a leader.",
                "The entire congregation moves with the Imam like a single body.",
                "Individual mistakes should not disrupt the discipline of the congregation."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام کفیل ہے",
              "english": "Imam is a Guarantor"
            },
            "content": {
              "urdu": [
                "حدیث میں ہے کہ 'امام ضامن ہے'۔",
                "وہ مقتدیوں کی نماز کی درستگی کا ذمہ دار ہوتا ہے۔",
                "اس لیے مقتدی کی کوتاہی امام کے صحیح عمل میں ضم ہو جاتی ہے۔"
              ],
              "english": [
                "The Hadith states that 'The Imam is a guarantor'.",
                "He is responsible for the correctness of the followers' prayer.",
                "Therefore, the follower's shortcoming is absorbed into the Imam's correct action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی مسئلہ",
        "english": "Practical Issue"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسبوق کا حکم",
              "english": "Ruling for Latecomer"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص دیر سے شامل ہو (مسبوق)، تو وہ امام کے ساتھ سجدہ سہو کرے۔",
                "اس کے بعد کھڑے ہو کر اپنی باقی ماندہ نماز پوری کرے۔",
                "اگر وہ اپنی چھوٹی ہوئی رکعتوں میں کوئی غلطی کرے تو پھر اسے اپنا سجدہ سہو کرنا ہوگا۔"
              ],
              "english": [
                "If a person joins late (Masbuq), he should perform Sujud as-Sahw with the Imam.",
                "After that, he should stand up to complete his remaining prayer.",
                "If he makes a mistake in his remaining Rak'ahs, then he must perform his own Sujud as-Sahw."
              ]
            }
          },
          {
            "title": {
              "urdu": "شک کا علاج",
              "english": "Remedy for Doubt"
            },
            "content": {
              "urdu": [
                "اگر مقتدی کو شک ہو جائے تو وہ اپنے شک پر دھیان نہ دے۔",
                "امام کا یقین مقتدی کے شک پر بھاری ہوتا ہے۔",
                "وسوسوں سے بچنے کا بہترین طریقہ امام کی پیروی ہے۔"
              ],
              "english": [
                "If a follower has a doubt, he should ignore his doubt.",
                "The Imam's certainty overrides the follower's doubt.",
                "Following the Imam is the best way to avoid whispers (Waswas)."
              ]
            }
          }
        ]
      }
    }
  ]
}
