{
  "hadithId": 262,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["urn:1250"],
    "kitabId": 2,
    "inKitabBab": 8,
    "arabicBook": "Bulugh al-Maram",
    "babId": 18
  },
  "name": {
    "arabic": "عَنْ عَبْدِ اَللَّهِ بْنِ بُحَيْنَةَ ‏-رَضِيَ اَللَّهُ تَعَالَى عَنْهُ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-صَلَّى بِهِمُ الظُّهْرَ , فَقَامَ فِي اَلرَّكْعَتَيْنِ اَلْأُولَيَيْنِ , وَلَمْ يَجْلِسْ , فَقَامَ اَلنَّاسُ مَعَهُ , حَتَّى إِذَا قَضَى اَلصَّلَاةَ , وَانْتَظَرَ اَلنَّاسُ تَسْلِيمَهُ , كَبَّرَ وَهُوَ جَالِسٌ .‏ وَسَجَدَ سَجْدَتَيْنِ , قَبْلَ أَنْ يُسَلِّمَ , ثُمَّ سَلَّمَ } أَخْرَجَهُ اَلسَّبْعَةُ , وَهَذَا لَفْظُ اَلْبُخَارِيِّ  وَفِي رِوَايَةٍ لمُسْلِمٍ : { يُكَبِّرُ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ وَسَجَدَ اَلنَّاسُ مَعَهُ , مَكَانَ مَا نَسِىَ مِنَ الْجُلُوسِ }",
    "urdu": "سیدنا عبداللہ بن بحینہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو نماز ظہر پڑھائی تو دو رکعت ادا کر کے تشہد میں نہ بیٹھے اور سیدھے کھڑے ہو گئے اور مقتدی بھی آپ صلی اللہ علیہ وسلم کے ساتھ ہی کھڑے ہو گئے۔ جب آپ صلی اللہ علیہ وسلم نے نماز پوری کر لی تو لوگ سلام پھیرنے کے انتظار میں تھے، کہ آپ صلی اللہ علیہ وسلم نے بیٹھے ہی «الله اكبر» کہا اور سلام پھیرنے سے پہلے دو سجدے کیے، پھر سلام پھیرا۔ اسے ساتوں یعنی احمد، بخاری، مسلم، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ البتہ یہ الفاظ بخاری کے ہیں اور مسلم کی روایت میں ہے کہ بیٹھے ہوئے ہر سجدہ کے لیے «الله اكبر» کہتے تھے اور لوگوں نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ سہو کیا۔ دو رکعت کے بعد تشہد میں بیٹھنا بھول گئے تھے، اس کی تلافی کے لیے دو سجدے کیے۔",
    "english": "Narrated by 'Abdullah bin Buhainah (may Allah be pleased with him): The Prophet (ﷺ) led them in the Zuhr prayer. He stood up after the first two Rak'ahs and did not sit (for the first Tashahhud). The people stood up with him. When he finished the prayer and people waited for his Taslim, he said Takbir while sitting and performed two prostrations before saying Taslim, then he said Taslim. Reported by the Seven; this is the wording of Al-Bukhari. In a narration of Muslim: 'He said Takbir for each prostration while sitting, and the people prostrated with him, in place of the sitting he had forgotten.'"
  },
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (829)، ومسلم (570)، وأبو داود (1034)، والنسائي (3/19-20)، والترمذي (391)، وابن ماجه (1206)، وأحمد (5/345 و 346). وقال الترمذي حسن صحيح.",
    "urdu": "صحیح۔ اسے بخاری (829)، مسلم (570)، ابو داؤد (1034)، نسائی (3/19-20)، ترمذی (391)، ابن ماجہ (1206) اور احمد (5/345، 346) نے روایت کیا ہے۔ ترمذی نے اسے حسن صحیح کہا ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (829), Muslim (570), Abu Dawud (1034), An-Nasa'i (3/19-20), At-Tirmidhi (391), Ibn Majah (1206), and Ahmad (5/345, 346). At-Tirmidhi called it Hasan Sahih."
  },
  "importantWords": [
    {
      "arabic": "قام",
      "english": "Stood up",
      "urdu": "کھڑا ہوا"
    },
    {
      "arabic": "لم يجلس",
      "english": "Did not sit",
      "urdu": "نہیں بیٹھا"
    },
    {
      "arabic": "سجدتين",
      "english": "Two prostrations",
      "urdu": "دو سجدے"
    },
    {
      "arabic": "قبل أن يسلم",
      "english": "Before Taslim",
      "urdu": "سلام سے پہلے"
    },
    {
      "arabic": "نسي",
      "english": "Forgot",
      "urdu": "بھول گیا"
    },
    {
      "arabic": "مكان",
      "english": "In place of",
      "urdu": "کی جگہ"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں سجدہ سہو کا بیان ہے کہ اگر امام پہلی تشہد بھول کر کھڑا ہو جائے تو وہ واپس نہیں لوٹے گا بلکہ نماز کے آخر میں سلام سے پہلے دو سجدے کرے گا۔",
    "english": "This Hadith explains Sujud as-Sahw. If the Imam forgets the first Tashahhud and stands up, he should not return to sit but should perform two prostrations before the Taslim at the end of the prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري (829)",
      "english": "Reported by Al-Bukhari (829)"
    },
    {
      "arabic": "رواه مسلم (570)",
      "english": "Reported by Muslim (570)"
    },
    {
      "arabic": "رواه أبو داود (1034)",
      "english": "Reported by Abu Dawud (1034)"
    },
    {
      "arabic": "رواه الترمذي (391)",
      "english": "Reported by At-Tirmidhi (391)"
    },
    {
      "arabic": "رواه النسائي (1177)",
      "english": "Reported by An-Nasa'i (1177)"
    },
    {
      "arabic": "رواه ابن ماجه (1206)",
      "english": "Reported by Ibn Majah (1206)"
    },
    {
      "arabic": "رواه أحمد (22906)",
      "english": "Reported by Ahmad (22906)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن بحينة",
        "english": "Abdullah bin Buhainah"
      },
      "slug": "abdullah-bin-buhainah"
    }
  ],
  "ytLink": "https://youtu.be/watch?v=EXAMPLE_ID",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پہلا تشہد چھوٹ جانا",
              "english": "Missing the first Tashahhud"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ ظہر کی نماز میں پہلی دو رکعتوں کے بعد بھول کر کھڑے ہو گئے۔",
                "آپ ﷺ تشہد کے لیے نہیں بیٹھے اور مقتدی بھی ان کے ساتھ کھڑے ہو گئے۔",
                "یہ عمل بھول چوک کی وجہ سے ہوا جو انسانی فطرت کا حصہ ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) accidentally stood up after the first two Rak'ahs of Zuhr.",
                "He did not sit for Tashahhud, and the followers stood up with him.",
                "This action was due to forgetfulness, which is part of human nature."
              ]
            }
          },
          {
            "title": {
              "urdu": "سجدہ سہو کا طریقہ",
              "english": "Method of Sujud as-Sahw"
            },
            "content": {
              "urdu": [
                "نماز کے آخر میں سلام پھیرنے سے پہلے دو سجدے کیے جاتے ہیں۔",
                "یہ سجدے اس کمی کو پورا کرتے ہیں جو تشہد چھوٹنے سے ہوئی۔",
                "مسلم کی روایت میں ہے کہ ہر سجدے کے لیے تکبیر کہی گئی۔"
              ],
              "english": [
                "Two prostrations are performed at the end of the prayer before Taslim.",
                "These prostrations compensate for the omission of the Tashahhud.",
                "Muslim's narration adds that Takbir was said for each prostration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "واجب ترک ہونے کا حکم",
              "english": "Ruling on leaving a Wajib"
            },
            "content": {
              "urdu": [
                "پہلا تشہد واجب ہے، اگر بھولے سے چھوٹ جائے تو سجدہ سہو واجب ہے۔",
                "اگر امام کھڑا ہو جائے تو اسے واپس بیٹھنے کی اجازت نہیں ہے۔",
                "مقتدیوں پر لازم ہے کہ وہ امام کی پیروی کریں اور کھڑے ہو جائیں۔"
              ],
              "english": [
                "The first Tashahhud is Wajib; if missed by mistake, Sujud as-Sahw is mandatory.",
                "If the Imam stands up fully, he is not allowed to return to sitting.",
                "It is obligatory for the followers to follow the Imam and stand up."
              ]
            }
          },
          {
            "title": {
              "urdu": "سجدہ سہو کا محل",
              "english": "Place of Sujud as-Sahw"
            },
            "content": {
              "urdu": [
                "نقصان (کمی) کی صورت میں سجدہ سہو سلام سے پہلے کیا جاتا ہے۔",
                "یہاں چونکہ تشہد رہ گیا تھا اس لیے سلام سے پہلے سجدہ کیا گیا۔",
                "یہ احناف اور شافعیہ کے درمیان ایک فقہی اختلاف کا بھی محل ہے۔"
              ],
              "english": [
                "In case of omission (deficiency), Sujud as-Sahw is done before Taslim.",
                "Since Tashahhud was missed here, prostrations were done before Taslim.",
                "This is also a point of juristic difference between Hanafis and Shafi'is."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "غلطی کی اصلاح",
              "english": "Correcting mistakes"
            },
            "content": {
              "urdu": [
                "اگر نماز میں بھول ہو جائے تو گھبرانا نہیں چاہیے بلکہ شریعت کا حکم ماننا چاہیے۔",
                "بھول کی تلافی کے لیے سجدہ سہو ایک رحمت اور آسانی ہے۔",
                "عبادت میں نقص رہ جانے پر اللہ سے معافی اور تلافی کا طریقہ سکھایا گیا۔"
              ],
              "english": [
                "Do not panic if a mistake occurs in prayer; follow the Sharia ruling.",
                "Sujud as-Sahw is a mercy and ease to compensate for forgetfulness.",
                "It teaches the method of compensation and seeking forgiveness for flaws in worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "امام کی پیروی",
              "english": "Following the Imam"
            },
            "content": {
              "urdu": [
                "مقتدی کو ہر حال میں امام کی اتباع کرنی چاہیے سوائے کفر کے۔",
                "اگر امام بھول جائے تب بھی اس کے ساتھ رہنا ضروری ہے۔",
                "جماعت کی اہمیت انفرادی رائے یا عمل سے زیادہ ہے۔"
              ],
              "english": [
                "The follower must follow the Imam in all cases except clear disbelief.",
                "Even if the Imam forgets, it is necessary to remain with him.",
                "The importance of the congregation outweighs individual opinion or action."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی پہلو",
        "english": "Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "بشریتِ انبیاء",
              "english": "Humanity of Prophets"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کا بھولنا ان کی بشریت کی دلیل ہے۔",
                "یہ امت کے لیے تعلیم کا ذریعہ بنا کہ بھول کی صورت میں کیا کریں۔",
                "اللہ تعالیٰ اپنے محبوب سے ایسے افعال کرواتا ہے تاکہ دین مکمل ہو۔"
              ],
              "english": [
                "The Prophet's (ﷺ) forgetfulness is proof of his humanity.",
                "It became a source of teaching for the Ummah on what to do in case of forgetfulness.",
                "Allah causes such actions from His Beloved to perfect the religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی حفاظت",
              "english": "Preservation of Prayer"
            },
            "content": {
              "urdu": [
                "شیطان نماز میں خلل ڈالنے کی کوشش کرتا ہے، سجدہ سہو اس کا توڑ ہے۔",
                "یہ سجدے شیطان کو ذلیل کرتے ہیں اور نماز کو مکمل کرتے ہیں۔",
                "نمازی کو چاہیے کہ وہ نماز کے مسائل سیکھے تاکہ صحیح عبادت کر سکے۔"
              ],
              "english": [
                "Satan tries to disrupt prayer; Sujud as-Sahw is the countermeasure.",
                "These prostrations humiliate Satan and complete the prayer.",
                "A worshiper should learn prayer rulings to perform worship correctly."
              ]
            }
          }
        ]
      }
    }
  ]
}
