{
  "hadithId": 164,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["1:4:5"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (استقبال القبلة)",
    "babId": 13
  },
  "name": {
    "arabic": " وَعَنْ عَامِرِ بْنِ رَبِيعَةَ ‏- رضى الله عنه ‏- قَالَ : { كُنَّا مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فِي لَيْلَةٍ مَظْلَمَةٍ , فَأَشْكَلَتْ عَلَيْنَا اَلْقِبْلَةُ , فَصَلَّيْنَا .‏ فَلَمَّا طَلَعَتِ اَلشَّمْسُ إِذَا نَحْنُ صَلَّيْنَا إِلَى غَيْرِ اَلْقِبْلَةِ , فَنَزَلَتْ : (فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اَللَّهِ )‏ } أَخْرَجَهُ اَلتِّرْمِذِيُّ وَضَعَّفَهُ .‏ ",
    "urdu": "سیدنا عامر بن ربیعہ رضی اللہ عنہ روایت کرتے ہیں کہ ایک تاریک و اندھیری رات میں ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے، قبلہ کا رخ شناخت کرنا ہم پر دشوار و مشکل ہو گیا۔ ہم نے (اندازاً قبلہ کا رخ متعین کر کے) نماز پڑھ لی۔ جب آفتاب طلوع ہوا تو معلوم ہوا کہ ہم نے غیر قبلہ کی جانب رخ کر کے نماز پڑھی تھی۔ پس پھر یہ آیت نازل ہوئی «فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اَللَّهِ» پس جدھر تم رخ کرو گے اسی طرف اللہ کی ذات موجود ہے۔“ اس کو ترمذی نے روایت کیا ہے اور ضعیف قرار دیا ہے۔ ",
    "english": "Narrated 'Āmir ibn Rabī'ah (RA): 'We were with the Prophet (ﷺ) on a dark night, and the Qiblah (direction of prayer) became confusing for us, so we prayed. When the sun rose, we realized that we had prayed towards a direction other than the Qiblah. Then the verse was revealed: 'Fa-aynamā tuwallū fa-thamma wajhu Allāh' (So wherever you turn, there is the Face of Allah - Qur'ān 2:115).' Reported by At-Tirmidhī and he graded it as weak."
  },
  "takhreej": {
    "arabic": "ضعيف جداً .‏ رواه الترمذي (345 و 2957)‏ ، وقال : \"هذا حديث غريب ، لا نعرفه إلا من حديث أشعث السمان ؛ أبي الربيع ، عن عاصم بن عبيد الله ، وأشعث يضعف في الحديث\" .‏ ونحو ذلك قال في الموطن الأول .‏ قلت : العلة ليست في أشعث فقط ، فهو وإن كان متروكا إلا أن عاصم بن عبيد الله أيضا سيئ الحفظ .‏ وذهب شيخنا ‏-حفظه الله‏- إلى أن هذا الحديث لا علة له إلا عاصم بن عبيد الله باعتبار متابعة عمرو بن قيس الملائي ‏- وهو ثقة ‏- لأشعث كما عند أبي داود الطيالسي (1145)‏ ، وأقول : هذا وهم من الشيخ ‏-حفظه الله‏- ، فإن المتابع هو \"عمر بن قيس سندل\" وهو متروك أيضا ، ولعل وقوع التحريف في \"مسند الطيالسي\" كان سبب ذلك الوهم .‏ وأما حديث جابر الذي يشهد لهذا الحديث فهو أوهى منه فلا يفرح به .‏ وعليه فلا ينفك الضعف عن الحديث بل هو ضعيف جدا كما تقدم  ",
    "urdu": "ضعیف جداً (سخت ضعیف)۔ اسے ترمذی (345 اور 2957) نے روایت کیا، اور کہا: ”یہ حدیث غریب ہے، ہم اسے صرف اشعث السمان، ابی الربیع، عن عاصم بن عبید اللہ کے طریق سے جانتے ہیں، اور اشعث کو حدیث میں ضعیف سمجھا جاتا ہے۔“ یہی بات انہوں نے پہلے مقام پر بھی کہی ہے۔ میں (حافظ ابن حجر) کہتا ہوں: علت صرف اشعث میں نہیں ہے، وہ اگرچہ متروک ہے، لیکن عاصم بن عبید اللہ بھی خراب حافظے والا ہے۔ ہمارے شیخ (حفظہ اللہ) کا خیال تھا کہ اس حدیث میں عاصم بن عبید اللہ کے علاوہ کوئی علت نہیں ہے کیونکہ عمرو بن قیس الملائی (جو ثقہ ہیں) نے اشعث کی متابعت کی ہے، جیسا کہ ابوداؤد الطیالسی (1145) کے ہاں ہے۔ میں کہتا ہوں: یہ ہمارے شیخ کا وہم ہے، کیونکہ متابعت کرنے والا 'عمر بن قیس سندل' ہے، جو کہ وہ بھی متروک ہے، اور شاید 'مسند الطیالسی' میں تحریف کے باعث یہ وہم ہوا۔ اور جابرؓ کی جو حدیث اس کی شاہد ہے، وہ اس سے بھی زیادہ کمزور ہے، لہٰذا اس پر خوش نہیں ہونا چاہیے۔ اس بنا پر اس حدیث کا ضعف ختم نہیں ہوتا بلکہ یہ سخت ضعیف ہے۔",
    "english": "Very Weak (Ḍa'īf Jiddan). Reported by At-Tirmidhī (345 and 2957), who said: 'This Hadith is Gharīb (strange); we only know it through the narration of Ash'ath As-Sammān, from Abū Ar-Rabī', from 'Āṣim ibn 'Ubaydillāh, and Ash'ath is considered weak in Hadith.' He said similar words in the first instance. I say: The defect is not only in Ash'ath, who is abandoned (Matrūk), but also 'Āṣim ibn 'Ubaydillāh has a poor memory (Sayyi' Al-Ḥifẓ). Our Shaykh (may Allah protect him) considered that the Hadith has no defect except for 'Āṣim ibn 'Ubaydillāh, based on the corroboration of 'Amr ibn Qays Al-Mallā'ī (who is trustworthy) to Ash'ath, as found in Abū Dāwūd Aṭ-Ṭayālisī (1145). I say: This is an illusion on the part of the Shaykh, as the corroborator is 'Umar ibn Qays Sandal, who is also abandoned. The change in 'Musnad Aṭ-Ṭayālisī' might have caused this illusion. As for Jābir's Hadith that corroborates this one, it is even weaker and should not be relied upon. Therefore, the Hadith remains very weak.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَيْلَةٍ مَظْلَمَةٍ",
      "english": "A dark night",
      "urdu": "ایک تاریک رات"
    },
    {
      "arabic": "أَشْكَلَتْ عَلَيْنَا اَلْقِبْلَةُ",
      "english": "The Qiblah became confusing for us",
      "urdu": "قبلہ کا رخ ہم پر مشتبہ ہو گیا"
    },
    {
      "arabic": "صَلَّيْنَا",
      "english": "So we prayed",
      "urdu": "تو ہم نے نماز پڑھی"
    },
    {
      "arabic": "طَلَعَتِ اَلشَّمْسُ",
      "english": "The sun rose",
      "urdu": "سورج طلوع ہوا"
    },
    {
      "arabic": "غَيْرِ اَلْقِبْلَةِ",
      "english": "Other than the Qiblah",
      "urdu": "قبلہ کے علاوہ"
    },
    {
      "arabic": "فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اَللَّهِ",
      "english": "So wherever you turn, there is the Face of Allah",
      "urdu": "پس جدھر تم رخ کرو گے اسی طرف اللہ کی ذات موجود ہے"
    },
    {
      "arabic": "ضَعِيفٌ جِدًّا",
      "english": "Very weak",
      "urdu": "سخت ضعیف"
    }
  ],
  "summary": {
    "urdu": "یہ روایت ایک سفر کے دوران پیش آنے والے واقعہ کو بیان کرتی ہے جہاں اندھیری رات میں صحابہ کرام قبلہ کی سمت کا تعین نہ کر پائے اور اندازے سے نماز ادا کی۔ صبح معلوم ہوا کہ وہ غلط سمت میں تھے۔ اس پر یہ آیت نازل ہوئی کہ جہاں تم رخ کرو گے، وہیں اللہ کا رخ ہے، جس سے ان کی نماز کی صحت ثابت ہوئی۔ تاہم، یہ حدیث سند کے اعتبار سے سخت ضعیف ہے، اگرچہ اس کا حکم دوسرے صحیح شرعی اصولوں کے موافق ہے۔",
    "english": "This narration describes an incident during a journey where the Companions could not determine the direction of the Qiblah on a dark night and prayed based on their best judgment. In the morning, they discovered they had prayed in the wrong direction, leading to the revelation of the verse: 'So wherever you turn, there is the Face of Allah,' validating their prayer. However, the Hadith is very weak in its chain, although its ruling aligns with other authentic legal principles."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (345)",
      "english": "Reported by At-Tirmidhī (345)"
    },
    {
      "arabic": "رواه الترمذي (2957)",
      "english": "Reported by At-Tirmidhī (2957)"
    },
    {
      "arabic": "القرآن الكريم، سورة البقرة، آية 115",
      "english": "The Holy Qur'ān, Surah Al-Baqarah, Verse 115"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عامر بن ربيعة",
        "english": "Āmir ibn Rabī'ah"
      },
      "slug": "amir-ibn-rabiah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "ضعيف جداً",
    "english": "Very Weak (Ḍa'īf Jiddan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبلہ کی شرط اور استطاعت",
        "english": "The Condition of Qiblah and Ability"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجتہاد کا اصول",
              "english": "Principle of Ijtihād (Juristic Reasoning)"
            },
            "content": {
              "urdu": [
                "قبلہ کی طرف رخ کرنا نماز کی صحت کی ایک بنیادی شرط ہے، لیکن استطاعت نہ ہونے پر اجتہاد کا حکم ہے۔",
                "جب قبلہ کی سمت معلوم کرنا ممکن نہ ہو (جیسے تاریک رات یا سفر میں)، تو نمازی کو اپنے غالب گمان پر عمل کرنا چاہیے۔",
                "اس روایت میں صحابہ کرامؓ نے اپنے اندازے پر نماز ادا کی، جو اجتہاد کا بہترین عمل تھا۔"
              ],
              "english": [
                "Facing the Qiblah is a fundamental condition for the validity of prayer, but Ijtihād (reasoning) is required when unable to ascertain the direction.",
                "When it is impossible to determine the Qiblah (like on a dark night or while traveling), the worshipper must pray according to their best judgment.",
                "In this narration, the Companions prayed based on their estimate, which is the best form of Ijtihād."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کا اعادہ نہ کرنا",
              "english": "No Repetition of Prayer"
            },
            "content": {
              "urdu": [
                "یہاں نماز کے غلط سمت میں ہونے کے باوجود اعادہ کا حکم نہیں دیا گیا، جو اس بات کی دلیل ہے کہ اجتہاد کے بعد غلطی معاف ہے۔",
                "شرعی قاعدہ ہے کہ جب بندہ اپنی مکمل استطاعت کے مطابق عمل کرے تو اللہ اسے معاف کر دیتا ہے۔",
                "یہ حکم اس آیت سے ثابت ہوتا ہے: «فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اَللَّهِ» (جہاں تم رخ کرو گے، وہیں اللہ کی ذات موجود ہے)۔"
              ],
              "english": [
                "Despite praying in the wrong direction, there was no command to repeat the prayer, proving that mistakes made after Ijtihād are pardoned.",
                "The legal rule is that when a servant acts according to their full capacity, Allah forgives them.",
                "This ruling is confirmed by the verse: 'So wherever you turn, there is the Face of Allah.' (Qur'ān 2:115)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی سند اور قرآنی دلیل",
        "english": "Hadith Chain and Quranic Evidence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کا درجہ (ضعیف جداً)",
              "english": "Narration Status (Very Weak)"
            },
            "content": {
              "urdu": [
                "ترمذی نے اس حدیث کو ضعیف قرار دیا، اور محدثین نے اس کی سند کو سخت ضعیف (ضعیف جداً) کہا ہے۔",
                "اس میں اشعث السمان اور عاصم بن عبید اللہ جیسے کمزور راوی شامل ہیں، جو اس کی صحت کو مشکوک بناتے ہیں۔",
                "علمائے کرام کا اصول ہے کہ ضعیف روایت سے شرعی حکم کا ثبوت نہیں لیا جاتا، بلکہ حکم دوسری صحیح دلیل سے ثابت ہے۔"
              ],
              "english": [
                "At-Tirmidhī graded this Hadith as weak, and Hadith scholars ruled its chain as very weak (Ḍa'īf Jiddan).",
                "It includes weak narrators like Ash'ath As-Sammān and 'Āṣim ibn 'Ubaydillāh, which casts doubt on its authenticity.",
                "The scholars' principle is that weak narrations are not used to establish legal rulings, which must be based on other authentic evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "آیت کا صحیح سبب نزول",
              "english": "The Correct Reason for Revelation (Sabab Nuzūl)"
            },
            "content": {
              "urdu": [
                "اس آیت کا نزول (فَأَيْنَمَا تُوَلُّوا) صحیح روایات کے مطابق، نبی ﷺ کے نفل نماز (سفر میں) کو قبلہ کے بجائے سواری کے رخ پر پڑھنے کے بارے میں ہے۔",
                "اس ضعیف حدیث کے سبب نزول کو قبول کرنے سے بہتر ہے کہ صحیح روایات اور فقہی اصولوں پر اعتماد کیا جائے۔",
                "بہر حال، یہ آیت اجتہاد میں کی گئی غلطیوں کی معافی کے اصول کو بیان کرتی ہے۔"
              ],
              "english": [
                "The correct reason for the revelation of this verse (Fa-aynamā tuwallū) is related to the Prophet (ﷺ) performing voluntary prayer during travel in the direction his mount was facing, not the Qiblah.",
                "It is better to rely on authentic narrations and legal principles than to accept the Sabab Nuzūl of this weak Hadith.",
                "Nonetheless, the verse itself conveys the principle of forgiveness for mistakes made in Ijtihād."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور احتیاط",
        "english": "Practical Lesson and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قبلہ کی تلاش",
              "english": "Searching for the Qiblah"
            },
            "content": {
              "urdu": [
                "تاریک رات میں یا سفر میں قبلہ کی تلاش کے لیے تمام ممکنہ ذرائع (ستارے، کمپاس، یا لوگوں کی رہنمائی) استعمال کرنے چاہئیں۔",
                "اگر تلاش کے بعد بھی سمت کا یقین نہ ہو، تو غالب گمان پر نماز ادا کرنا جائز ہے اور نماز صحیح ہوگی۔",
                "جس شخص نے بغیر تلاش کے اندازے سے نماز پڑھی، اور بعد میں غلطی معلوم ہوئی، تو اسے نماز دہرانی پڑے گی۔"
              ],
              "english": [
                "In a dark night or during travel, one should use all available means (stars, compass, or local guidance) to find the Qiblah.",
                "If certainty is not achieved even after searching, praying based on one's strongest guess is permissible, and the prayer is valid.",
                "A person who prays based on mere guesswork without searching, and later finds they were wrong, must repeat the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "دینی کام میں آسانی",
              "english": "Ease in Religious Matters"
            },
            "content": {
              "urdu": [
                "یہ واقعہ اس بات کا درس دیتا ہے کہ اللہ اپنے بندوں پر مشقت نہیں ڈالتا اور نیت کی سچائی کو قبول کرتا ہے۔",
                "اگرچہ یہ حدیث ضعیف ہے، لیکن اس کا مفہوم اسلام کے عمومی اصول 'یُسْر' (آسانی) کے مطابق ہے۔",
                "اجتہاد اور سچے ارادے سے کی گئی غلطی اللہ کے ہاں معاف ہے۔"
              ],
              "english": [
                "This incident teaches that Allah does not burden His servants and accepts the sincerity of intention.",
                "Although the Hadith is weak, its meaning aligns with the general Islamic principle of 'Yusr' (Ease).",
                "A mistake made through Ijtihād and sincere intention is forgiven by Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
