{
  "hadithId": 163,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["1:4:4"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (ستر العورة)",
    "babId": 13
  },
  "name": {
    "arabic": " وَعَنْ أُمِّ سَلَمَةَ ‏- رَضِيَ اَللَّهُ عَنْهَا‏- ; أَنَّهَا سَأَلَتْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-{ أَتُصَلِّي اَلْمَرْأَةُ فِي دِرْعٍ وَخِمَارٍ , بِغَيْرِ إِزَارٍ ? قَالَ : \"إِذَا كَانَ اَلدِّرْعُ سَابِغًا يُغَطِّي ظُهُورَ قَدَمَيْهَا } أَخْرَجَهُ أَبُو دَاوُدَ وَصَحَّحَ اَلْأَئِمَّةُ وَقْفَهُ .‏  ",
    "urdu": "سیدہ ام سلمہ رضی اللہ عنہا روایت کرتی ہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے دریافت کیا کہ (کیا) کوئی عورت تہبند کے بغیر محض کرتے اور اوڑھنی میں نماز پڑھ سکتی ہے؟ آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ ”کرتا اگر اتنا لمبا ہو کہ قدم کی پشت تک پہنچ جاتا ہے تو جائز ہے۔ “ اسے ابوداؤد نے روایت کیا ہے اور ائمہ نے اس کے موقوف ہونے کو صحیح قرار دیا ہے۔ ",
    "english": "Narrated Umm Salamah (RA): She asked the Prophet (ﷺ): 'Should a woman pray in a Dir' (long gown/shirt) and a Khimar (head covering), without an Izār (waist-wrapper)?' He said: 'Yes, if the Dir' is Sābigh (ample/long) enough to cover the tops of her feet.' Reported by Abu Dawud, and the Imams authenticated its Mauqūf status (as a saying of Umm Salamah)."
  },
  "takhreej": {
    "arabic": " ضعيف مرفوعا وموقوفا .‏ رواه أبو داود (640)‏ ، وقال عقبه : \"روى هذا الحديث مالك بن أنس ، وبكر بن مضر ، وحفص بن غياث ، وإسماعيل بن جعفر ، وابن أبي ذئب ، وابن إسحاق عن محمد بن زيد ، عن أمه ، عن أم سلمة ، لم يذكر أحد منهم النبي ‏-صلى الله عليه وسلم‏- قصروا به على أم سلمة ‏- رضي الله عنها‏- \" .‏ قلت : وهذا الموقوف هو الصواب كما نقل الحافظ عن الأئمة ، ولكن لا يعني صحة الموقوف ، ففرق بين صواب الرواية وصحتها ، إذ الموقوف أيضا سنده ضعيف ، وعليه فلا حجة في قول الصنعاني في \"السبل\" (1/276)‏ وقول تابعه الفقي بأن الموقوف له حكم الرفع !!.‏",
    "urdu": "ضعیف مرفوعاً (نبی ﷺ سے منسوب ہو کر) اور موقوفاً (صحابی کا قول ہو کر)۔ اسے ابو داؤد (640) نے روایت کیا، اور اس کے بعد کہا: ”اس حدیث کو مالک بن انس، بکر بن مضر، حفص بن غیاث، اسماعیل بن جعفر، ابن ابی ذئب اور ابن اسحاق نے محمد بن زید سے، انہوں نے اپنی والدہ سے اور انہوں نے ام سلمہؓ سے روایت کیا ہے، ان میں سے کسی نے بھی نبی صلی اللہ علیہ وسلم کا ذکر نہیں کیا، بلکہ اسے ام سلمہؓ پر موقوف کیا ہے۔“ میں (حافظ ابن حجر) کہتا ہوں: اور یہ موقوف روایت ہی صحیح ہے، جیسا کہ حافظ نے ائمہ سے نقل کیا، لیکن اس کا مطلب موقوف کا صحیح ہونا نہیں ہے، کیونکہ روایت کے صحیح ہونے اور اس کی سند کے درست ہونے میں فرق ہے۔ کیونکہ موقوف کی سند بھی ضعیف ہے، لہٰذا صنعانی کے اس قول میں کوئی دلیل نہیں کہ موقوف کا حکم رفع (مرفوع) کا ہے!",
    "english": "Weak (Ḍa'īf) as Marfū' (attributed to the Prophet) and Mauqūf (attributed to the Companion). Reported by Abu Dawud (640), who commented afterwards: 'This Hadith was narrated by Mālik ibn Anas, Bakr ibn Muḍar, Ḥafṣ ibn Ghiyāth, Ismā'īl ibn Ja'far, Ibn Abī Dhi'b, and Ibn Isḥāq from Muḥammad ibn Zayd, from his mother, from Umm Salamah, and none of them mentioned the Prophet (ﷺ); they confined it to Umm Salamah (RA).' I say: This Mauqūf version is the correct form, as Al-Ḥāfiz quoted from the Imams, but that does not mean the Mauqūf version is authentic (Ṣaḥīḥ), as there is a difference between the correctness of the narration and its authenticity, for the chain of the Mauqūf version is also weak. Therefore, there is no proof in the statement of As-Ṣan'ānī in 'As-Subul' (1/276) and his follower Al-Fiqī that the Mauqūf ruling has the status of Marfū'!!.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "أَتُصَلِّي اَلْمَرْأَةُ",
      "english": "Should the woman pray",
      "urdu": "کیا عورت نماز پڑھ سکتی ہے"
    },
    {
      "arabic": "فِي دِرْعٍ",
      "english": "In a Dir' (long gown/shirt)",
      "urdu": "کرتے میں"
    },
    {
      "arabic": "وَخِمَارٍ",
      "english": "And a Khimar (head covering)",
      "urdu": "اور اوڑھنی میں"
    },
    {
      "arabic": "بِغَيْرِ إِزَارٍ",
      "english": "Without an Izār (waist-wrapper)",
      "urdu": "تہبند کے بغیر"
    },
    {
      "arabic": "اَلدِّرْعُ سَابِغًا",
      "english": "The Dir' is ample/long",
      "urdu": "کرتا لمبا ہو"
    },
    {
      "arabic": "يُغَطِّي ظُهُورَ قَدَمَيْهَا",
      "english": "It covers the tops of her feet",
      "urdu": "وہ اس کے قدموں کی پشت کو چھپائے"
    },
    {
      "arabic": "مَوْقُوفَهُ",
      "english": "Its Mauqūf status",
      "urdu": "اس کا موقوف ہونا"
    }
  ],
  "summary": {
    "urdu": "یہ روایت، جسے ائمہ نے موقوف (صحابی کا قول) قرار دیا ہے اور اس کی سند میں ضعف ہے، عورت کے لیے نماز میں ستر عورت کی ایک حد بیان کرتی ہے۔ اس کے مطابق اگر عورت ایک لمبے کرتے (درع) اور اوڑھنی (خمار) میں نماز پڑھے اور کرتا اتنا لمبا ہو کہ اس کے قدموں کی پشت کو بھی ڈھانپ لے، تو اسے تہبند (ازار) کی ضرورت نہیں ہے۔",
    "english": "This narration, ruled as Mauqūf (Companion's saying) by the Imams and having weakness in its chain, defines a boundary for a woman's 'Awrah covering in prayer. According to it, if a woman prays in a long gown (Dir') and a head covering (Khimar), and the gown is long enough to cover the tops of her feet, she does not need an additional waist-wrapper (Izār)."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (640)",
      "english": "Reported by Abu Dawud (640)"
    },
    {
      "arabic": "أقوال الأئمة في تضعيف الرواية المرفوعة",
      "english": "Statements of Imams on weakening the Marfū' narration"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أم سلمة",
        "english": "Umm Salamah"
      },
      "slug": "umm-salamah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "ضعيف مرفوعا وموقوفا",
    "english": "Weak (Marfū' and Mauqūf)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عورت کا ستر اور نماز کا لباس",
        "english": "Woman's 'Awrah and Prayer Attire"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کے لیے مکمل لباس",
              "english": "Complete Attire for Prayer"
            },
            "content": {
              "urdu": [
                "عورت کے لیے نماز میں ستر کا حکم مرد سے زیادہ سخت ہے، جس میں ہاتھ اور چہرہ کے علاوہ پورا جسم شامل ہے۔",
                "یہ روایت بتاتی ہے کہ درع (قمیص) اور خمار (اوڑھنی) کافی ہیں، بشرطیکہ قمیص قدموں کی پشت تک لمبی ہو۔",
                "یہ اس بات کی دلیل ہے کہ عورت کے پاؤں بھی ستر میں شامل ہیں اور انہیں ڈھانپنا ضروری ہے۔"
              ],
              "english": [
                "The requirement for a woman's 'Awrah covering in prayer is stricter than a man's, including the entire body except the face and hands.",
                "This narration indicates that a Dir' (gown) and Khimar (head covering) suffice, provided the gown is long enough to cover the tops of her feet.",
                "This proves that a woman's feet are also part of the 'Awrah and must be covered."
              ]
            }
          },
          {
            "title": {
              "urdu": "تہبند (ازار) کی ضرورت",
              "english": "Necessity of the Izār (Waist-wrapper)"
            },
            "content": {
              "urdu": [
                "ام سلمہؓ کے سوال کا مقصد یہ معلوم کرنا تھا کہ کیا لمبے کرتے کے ہوتے ہوئے بھی تہبند ضروری ہے؟",
                "جواب میں یہ اصول دیا گیا کہ اگر کرتا مکمل ڈھانپتا ہے تو تہبند ضروری نہیں، جو تخفیف اور آسانی ہے۔",
                "نماز میں لباس ایسا ہونا چاہیے کہ اس کے نیچے سے جسم یا 'Awrah ظاہر نہ ہو۔"
              ],
              "english": [
                "Umm Salamah's question aimed to clarify if an Izār (waist-wrapper) was necessary even with a long gown.",
                "The answer laid down the principle that if the gown covers completely, the Izār is not necessary, providing ease.",
                "The attire in prayer must be sufficient to prevent the body or 'Awrah beneath it from being exposed."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روایت کا درجہ اور فقہی عمل",
        "english": "Narration Status and Juristic Practice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعف اور ائمہ کی تحقیق",
              "english": "Weakness and Imams' Research"
            },
            "content": {
              "urdu": [
                "ابو داؤد نے خود اس حدیث کے مرفوعاً (نبی ﷺ سے منسوب ہونے) کو ضعیف قرار دیا، جبکہ موقوف کو کئی ائمہ نے ترجیح دی۔",
                "محدثین (جیسے ابو داؤد) نے وضاحت کی کہ یہ قول نبی ﷺ کا نہیں، بلکہ ام سلمہؓ کا ہے، جو زیادہ صحیح ہے۔",
                "تاہم، حافظ ابن حجر کی تحقیق کے مطابق موقوف روایت کی سند بھی ضعیف ہے، اس لیے فقہی حکم دوسرے شواہد پر مبنی ہے۔"
              ],
              "english": [
                "Abu Dawud himself weakened the Marfū' attribution, and several Imams preferred the Mauqūf attribution to Umm Salamah (RA).",
                "Hadith scholars clarified that the statement belongs to Umm Salamah, not the Prophet (ﷺ), which is more accurate.",
                "However, according to Al-Ḥāfiz Ibn Ḥajar's further analysis, the Mauqūf chain is also weak, so the legal ruling relies on other evidence."
              ]
            }
          },
          {
            "title": {
              "urdu": "پاؤں ڈھانپنے کا حکم",
              "english": "The Ruling on Covering the Feet"
            },
            "content": {
              "urdu": [
                "اس روایت میں پاؤں کی پشت کو ڈھانپنے کی شرط لگائی گئی ہے، جو اس بات کو ثابت کرتی ہے کہ پاؤں ستر ہیں۔",
                "یہ حکم اس آیت کے حکم (سورة الأحزاب: 59) اور دیگر احادیث سے بھی مطابقت رکھتا ہے۔",
                "فقہاء نے اس اصول کو قبول کیا ہے کہ نماز میں عورت کے قدموں کا ڈھانپنا ضروری ہے۔"
              ],
              "english": [
                "This narration stipulates covering the tops of the feet, confirming that the feet are part of the 'Awrah.",
                "This ruling aligns with the command in the Qur'ān (Sūrat Al-Aḥzāb: 59) and other related Ahadith.",
                "Jurists have accepted the principle that a woman's feet must be covered during prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی درس",
        "english": "Training and Ethical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لباس میں سادگی اور ستر",
              "english": "Simplicity and Covering in Attire"
            },
            "content": {
              "urdu": [
                "عورت کو نماز میں سادگی اور شرعی پردے کا خیال رکھنا چاہیے، لباس نہ تو تنگ ہو اور نہ ہی ایسا ہو کہ جسم نظر آئے۔",
                "یہ حکم اس بات پر زور دیتا ہے کہ زینت اختیار کرنے سے پہلے ستر پوشی کو یقینی بنایا جائے۔",
                "شرعی لباس نماز میں خشوع و خضوع پیدا کرنے میں بھی مددگار ثابت ہوتا ہے۔"
              ],
              "english": [
                "A woman should observe simplicity and legal covering in her prayer attire; the clothes should neither be tight nor transparent.",
                "This ruling emphasizes ensuring 'Awrah covering before focusing on adornment.",
                "Appropriate legal attire also helps in fostering reverence (Khushu') in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "سوال پوچھنے کی اہمیت",
              "english": "Importance of Asking Questions"
            },
            "content": {
              "urdu": [
                "ام سلمہؓ کا یہ سوال، جو عورتوں کے ایک عام مسئلہ سے متعلق تھا، علم کی جستجو کو ظاہر کرتا ہے۔",
                "مسلمانوں کو چاہیے کہ وہ اپنی عبادات کو صحیح سنت کے مطابق ادا کرنے کے لیے سوالات کریں۔",
                "نبی ﷺ کے گھر میں شرعی امور پر بحث و مباحثہ علم کی اہمیت کو اجاگر کرتا ہے۔"
              ],
              "english": [
                "Umm Salamah's question, which related to a common issue for women, shows the desire for knowledge.",
                "Muslims should ask questions to ensure their worship is performed according to the authentic Sunnah.",
                "The discussion of legal matters in the Prophet's household highlights the importance of religious learning."
              ]
            }
          }
        ]
      }
    }
  ]
}
