{
  "hadithId": 170,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["1:4:11"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (الصلاة في النعلين)",
    "babId": 13
  },
  "name": {
    "arabic": "وَعَنْ أَبِي سَعِيدٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا جَاءَ أَحَدُكُمْ اَلْمَسْجِدَ , فَلْيَنْظُرْ, فَإِنْ رَأَى فِي نَعْلَيْهِ أَذًى أَوْ قَذَرًا فَلْيَمْسَحْهُ , وَلْيُصَلِّ فِيهِمَا } أَخْرَجَهُ أَبُو دَاوُدَ , وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ ",
    "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ”تم میں سے جب کوئی مسجد میں آئے تو (مسجد میں داخل ہونے سے پہلے) اسے چائیے کہ (اپنی جوتی) دیکھ لے۔ اگر اپنی جوتی میں گندگی یا ناپاک چیز لگی ہوئی دیکھے تو اسے چائیے کہ اسے صاف کرے اور اس میں نماز پڑھ لے۔ “ ابوداؤد نے اس کی روایت کی ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔ ",
    "english": "Narrated Abū Sa'īd Al-Khudrī (RA): The Messenger of Allah (ﷺ) said: 'When one of you comes to the mosque, let him look. If he sees dirt (Adhan) or filth (Qadhran) on his sandals, let him wipe it off, and then pray in them.' Reported by Abū Dāwūd, and Ibn Khuzaymah graded it as Ṣaḥīḥ (authentic)."
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه أبو داود (650)‏ وصححه ابن خزيمة (786)‏ ، ولفظه : قال أبو سعيد الخدري ‏- رضي الله عنه‏- بينما رسول ‏-صلى الله عليه سلم‏- يصلي بأصحابه ، إذ خلع نعليه ، فوضعهما عن يساره ، فلما رأى ذلك القوم ألقوا نعالهم ، فلما قضى رسول الله ‏-صلى الله عليه وسلم‏- صلاته قال : \"ما حملكم على إلقائكم نعالكم ؟ \" قالوا : رأيناك ألقيت نعليك ، فألقينا نعالنا ، فقال رسول الله ‏-صلى الله عليه وسلم‏- : \"إن جبريل أتاني ، فأخبرني أن فيها قذرا \".‏ وقال ‏-صلى الله عليه وسلم‏- : \"إذا جاء أحدكم .‏ .‏ .‏ الحديث \" .‏ قلت : وأعل بالإرسال ، ولا يضر ذلك ، خاصة وهناك ما يشهد له ، ثم الموصول هو الراجح ، كما ذهب إلى ذلك أبو حاتم في \"العلل\" (1/330/121)‏ .‏",
    "urdu": "صحیح۔ اسے ابو داؤد (650) نے روایت کیا اور ابن خزیمہ (786) نے اسے صحیح قرار دیا۔ اس کا مکمل متن یہ ہے: ابو سعید خدریؓ نے فرمایا: ایک مرتبہ رسول اللہ ﷺ اپنے صحابہؓ کے ساتھ نماز پڑھ رہے تھے کہ آپ نے اپنے جوتے اتار کر بائیں طرف رکھ دیے۔ جب لوگوں نے یہ دیکھا تو انہوں نے بھی اپنے جوتے اتار دیے۔ جب رسول اللہ ﷺ نماز مکمل کر چکے تو فرمایا: ”تمہیں اپنے جوتے اتارنے پر کس چیز نے آمادہ کیا؟“ انہوں نے کہا: ہم نے آپ کو جوتے اتارتے دیکھا تو ہم نے بھی اپنے جوتے اتار دیے۔ رسول اللہ ﷺ نے فرمایا: ”مجھے جبرائیل آئے تھے اور انہوں نے مجھے خبر دی کہ ان جوتوں میں نجاست لگی ہوئی ہے۔“ پھر آپ ﷺ نے فرمایا: ”جب تم میں سے کوئی مسجد آئے... (پوری حدیث)۔“ میں (حافظ ابن حجر) کہتا ہوں: اسے ارسال کی علت سے معلول قرار دیا گیا، لیکن اس سے کوئی نقصان نہیں ہوتا، خاص طور پر جب اس کے شواہد موجود ہوں، اور موصول (پوری سند والی) روایت ہی راجح ہے، جیسا کہ ابو حاتم نے ”العلل“ (1/330/121) میں کہا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Abū Dāwūd (650) and authenticated by Ibn Khuzaymah (786). The full context is: Abū Sa'īd Al-Khudrī (RA) said: While the Messenger of Allah (ﷺ) was leading his companions in prayer, he took off his sandals and placed them to his left. When the people saw this, they also took off their sandals. When the Messenger of Allah (ﷺ) finished his prayer, he asked: 'What made you take off your sandals?' They said: 'We saw you take off your sandals, so we took off ours.' The Messenger of Allah (ﷺ) said: 'Jibrīl came to me and informed me that there was filth on them.' Then the Prophet (ﷺ) said: 'When one of you comes to the mosque...' (the rest of the Hadith). I say: It was judged as defective due to Irsāl (discontinuity), but that does not harm it, especially since there is corroborating evidence, and the Mawsūl (fully connected chain) version is the preferred one, as held by Abū Ḥātim in 'Al-'Ilal' (1/330/121).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "جَاءَ أَحَدُكُمْ اَلْمَسْجِدَ",
      "english": "One of you comes to the mosque",
      "urdu": "تم میں سے کوئی مسجد میں آئے"
    },
    {
      "arabic": "فِي نَعْلَيْهِ",
      "english": "On his sandals/shoes",
      "urdu": "اپنی جوتی میں"
    },
    {
      "arabic": "أَذًى أَوْ قَذَرًا",
      "english": "Dirt (harm) or filth/impurity",
      "urdu": "گندگی یا ناپاک چیز"
    },
    {
      "arabic": "فَلْيَمْسَحْهُ",
      "english": "Let him wipe it off",
      "urdu": "تو اسے صاف کرے"
    },
    {
      "arabic": "وَلْيُصَلِّ فِيهِمَا",
      "english": "And let him pray in them",
      "urdu": "اور اس میں نماز پڑھ لے"
    },
    {
      "arabic": "خَلَعَ نَعْلَيْهِ",
      "english": "He took off his sandals",
      "urdu": "آپ نے اپنے جوتے اتارے"
    },
    {
      "arabic": "قَذَرًا",
      "english": "Filth/Impurity (Najāsah)",
      "urdu": "ناپاک چیز"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسلمانوں کو جوتوں کے ساتھ نماز پڑھنے کی شرعی اجازت دیتی ہے، بشرطیکہ وہ پاک ہوں۔ حکم یہ ہے کہ مسجد میں داخل ہونے سے پہلے جوتے کا معائنہ کر لیا جائے؛ اگر ان میں کوئی گندگی یا ناپاکی لگی ہو تو اسے زمین پر رگڑ کر صاف کر لیا جائے، اور پھر انہی میں نماز ادا کی جا سکتی ہے۔ یہ حکم نماز کے لیے طہارتِ مکان اور لباس کے اصول کی تائید کرتا ہے۔",
    "english": "This Hadith grants legal permission for Muslims to pray while wearing sandals, provided they are clean. The instruction is to inspect the shoes before entering the mosque; if any dirt or impurity is found, it should be wiped off by rubbing it on the ground, and then the prayer can be performed in those shoes. This ruling supports the principle of purity of the place and clothing for prayer."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (650)",
      "english": "Reported by Abu Dawud (650)"
    },
    {
      "arabic": "صححه ابن خزيمة (786)",
      "english": "Authenticated by Ibn Khuzaymah (786)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abū Sa'īd Al-Khudrī"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جوتے میں نماز پڑھنے کا حکم",
        "english": "The Ruling on Praying in Shoes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجازت اور سنت",
              "english": "Permission and Sunnah"
            },
            "content": {
              "urdu": [
                "جوتوں کے ساتھ نماز پڑھنا سنت سے ثابت ہے اور نبی اکرم ﷺ نے اسے کرنے کا حکم دیا۔",
                "یہ حکم اس لیے دیا گیا تاکہ مسلمان مشرکوں کے طریقے کی مخالفت کریں جو جوتے اتار کر عبادت کرتے تھے۔",
                "اس بات کی شرط یہ ہے کہ جوتے ناپاک نہ ہوں اور مسجد کی صفائی کا بھی خیال رکھا جائے۔"
              ],
              "english": [
                "Praying with shoes on is proven by the Sunnah, and the Prophet (ﷺ) commanded it.",
                "This ruling was given to counter the practice of polytheists who took off their shoes for worship.",
                "The condition is that the shoes must be clean, and the cleanliness of the mosque must also be maintained."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناپاکی کی صورت میں",
              "english": "In Case of Impurity"
            },
            "content": {
              "urdu": [
                "اگر جوتے میں ناپاکی (قذر) لگی ہو تو اسے زمین پر رگڑ کر (مسح) صاف کر لینا کافی ہے، وضو یا پانی کی ضرورت نہیں۔",
                "زمین کا استعمال جوتوں کو پاک کرنے کے لیے ایک رخصت ہے، جسے فقہاء نے 'تطہیر بالمسح' (رگڑ کر پاک کرنا) کہا ہے۔",
                "یہ حکم اس لیے دیا گیا کہ اس دور میں سڑکوں اور زمین پر چلنے کی وجہ سے جوتوں کا ناپاک ہونا عام تھا۔"
              ],
              "english": [
                "If there is impurity (Qadhar) on the shoes, wiping it off by rubbing them on the ground (Masḥ) is sufficient; water or Wuḍū' is not required.",
                "Using the ground to purify shoes is a legal concession known as 'Taṭhīr bil-Masḥ' (purification by wiping).",
                "This ruling was given because shoes commonly became impure due to walking on roads and unpaved ground in that era."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز میں طہارت کا اصول",
        "english": "Principle of Purity in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "طہارت کا لازم ہونا",
              "english": "The Necessity of Purification"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا نماز کے دوران جوتے اتار دینا اور جبرائیلؑ کا اطلاع دینا اس بات کی دلیل ہے کہ نجاست نماز کو باطل کر دیتی ہے۔",
                "نماز کے لیے جسم، لباس اور جگہ تینوں کا پاک ہونا ضروری ہے، اس لیے جوتوں کی پاکی بھی ضروری ہے۔",
                "صحابہ کا نبی ﷺ کی پیروی میں جوتے اتارنا ان کے شوقِ اطاعت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) removal of his shoes during prayer and Jibrīl's notification prove that impurity nullifies the prayer.",
                "Purification of the body, clothing, and place are all required for prayer; thus, the purity of the shoes is also necessary.",
                "The Companions' action of removing their shoes in imitation of the Prophet shows their eagerness to obey him."
              ]
            }
          },
          {
            "title": {
              "urdu": "مسجد کی صفائی",
              "english": "Cleanliness of the Mosque"
            },
            "content": {
              "urdu": [
                "یہ حکم اس بات کی تاکید ہے کہ مسجد میں داخل ہونے سے پہلے صفائی کا مکمل خیال رکھا جائے۔",
                "دور حاضر میں مساجد قالینوں سے آراستہ ہوتی ہیں، اس لیے عموماً جوتوں کے ساتھ نماز پڑھنے سے اجتناب کیا جاتا ہے۔",
                "اگر مسجد کا فرش جوتوں میں نماز کے لیے تیار ہو تو سنت پر عمل کیا جا سکتا ہے۔"
              ],
              "english": [
                "This ruling emphasizes that complete cleanliness should be ensured before entering the mosque.",
                "In modern times, mosques are often carpeted, leading to the general practice of removing shoes before praying.",
                "If the mosque floor is prepared for praying in shoes (e.g., stone or dirt), the Sunnah can be practiced."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند اور فقہی اصول",
        "english": "Chain and Juristic Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحت کی دلیل",
              "english": "Evidence of Authenticity"
            },
            "content": {
              "urdu": [
                "ابن خزیمہ کا اس حدیث کو صحیح قرار دینا، اس کے فقہی حکم کو مستند بناتا ہے۔",
                "اگرچہ بعض محدثین نے ارسال کی علت بیان کی، لیکن دیگر شواہد کی بنا پر اسے صحیح مانا جاتا ہے۔",
                "یہ حدیث اس بات کو ثابت کرتی ہے کہ نماز میں سنت کے مطابق جوتوں کا استعمال جائز ہے۔"
              ],
              "english": [
                "Ibn Khuzaymah's authentication of this Hadith establishes its legal authority.",
                "Although some scholars mentioned the defect of Irsāl, it is considered authentic based on corroborating evidence.",
                "This Hadith proves the permissibility of wearing shoes during prayer according to the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی پہلو",
              "english": "Ethical Aspect"
            },
            "content": {
              "urdu": [
                "صحابہ کرامؓ کا نبی ﷺ کی پیروی میں جوتے اتار دینا اس بات کو ظاہر کرتا ہے کہ وہ اتباعِ سنت کو کتنا اہم سمجھتے تھے۔",
                "امام کو چاہیے کہ وہ کوئی ایسا عمل نہ کرے جو مقتدیوں کے لیے ابہام یا مشقت کا باعث بنے۔",
                "نبی ﷺ کا لوگوں کو حکم دینا کہ وہ خود معائنہ کریں، انفرادی ذمہ داری کا سبق دیتا ہے۔"
              ],
              "english": [
                "The Companions' immediate removal of their shoes to follow the Prophet (ﷺ) shows their strong commitment to the Sunnah.",
                "The Imām should avoid any action that could cause ambiguity or hardship for the congregation.",
                "The Prophet's command for individuals to inspect their own shoes teaches personal responsibility."
              ]
            }
          }
        ]
      }
    }
  ]
}
