{
  "hadithId": 169,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["1:4:10"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (صلاة القبور)",
    "babId": 13
  },
  "name": {
    "arabic": "وَعَنْ أَبِي مَرْثَدٍ اَلْغَنَوِيِّ ‏- رضى الله عنه ‏- قَالَ : سَمِعْتَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ : { لَا تُصَلُّوا إِلَى اَلْقُبُورِ , وَلَا تَجْلِسُوا عَلَيْهَا } رَوَاهُ مُسْلِمٌ .‏  ",
    "urdu": "سیدنا ابومرثد غنوی رضی اللہ عنہ روایت کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ ”قبروں کو سامنے (رکھ کر، قبروں کی طرف رخ کر کے) نماز نہ پڑھو اور نہ ان پر بیٹھو۔ “ (مسلم) ",
    "english": "Narrated Abū Marthad Al-Ghanawī (RA): I heard the Messenger of Allah (ﷺ) saying: 'Do not pray facing the graves, and do not sit upon them.' Reported by Muslim."
  },
  "takhreej": {
    "arabic": " صحيح .‏ رواه مسلم (972)‏ .‏ وفي \"أ\" : \"أخرجه\" بدل : \"رواه\" .‏",
    "urdu": "صحیح۔ اسے مسلم (972) نے روایت کیا ہے۔ اور یہ حافظ ابن حجر کی کتاب کے بعض نسخوں میں 'اخرجہ' کی بجائے 'رواہ' ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (972).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَا تُصَلُّوا",
      "english": "Do not pray",
      "urdu": "نماز نہ پڑھو"
    },
    {
      "arabic": "إِلَى اَلْقُبُورِ",
      "english": "Facing the graves",
      "urdu": "قبروں کی طرف"
    },
    {
      "arabic": "وَلَا تَجْلِسُوا عَلَيْهَا",
      "english": "And do not sit upon them",
      "urdu": "اور نہ ان پر بیٹھو"
    },
    {
      "arabic": "نَهْي",
      "english": "Prohibition",
      "urdu": "ممانعت"
    },
    {
      "arabic": "اِتِّخَاذُ اَلْقُبُورِ مَسَاجِدَ",
      "english": "Taking graves as places of prayer",
      "urdu": "قبروں کو سجدہ گاہ بنانا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث واضح اور حتمی طور پر دو کاموں سے منع کرتی ہے: اول، قبروں کی طرف رخ کر کے نماز پڑھنا۔ دوم، قبروں کے اوپر بیٹھنا۔ دونوں ممانعتیں شرک کی طرف لے جانے والے راستوں کو بند کرنے اور قبروں کے احترام پر مبنی ہیں۔",
    "english": "This Hadith clearly and decisively prohibits two actions: Firstly, praying while facing the graves. Secondly, sitting upon the graves. Both prohibitions are based on blocking the paths leading to polytheism (Shirk) and ensuring proper respect for the deceased."
  },
  "references": [
    {
      "arabic": "رواه مسلم (972)",
      "english": "Reported by Muslim (972)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو مرثد الغنوي",
        "english": "Abū Marthad Al-Ghanawī"
      },
      "slug": "abu-marthad-al-ghanawi"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قبروں کی طرف نماز کی ممانعت",
        "english": "Prohibition of Praying Towards Graves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرک کی طرف لے جانے والا راستہ",
              "english": "A Path Leading to Polytheism (Shirk)"
            },
            "content": {
              "urdu": [
                "قبروں کی طرف رخ کر کے نماز پڑھنا (جیسے ان کو قبلہ بنانا) شرک کی طرف لے جانے والا ایک واضح راستہ ہے۔",
                "نبی اکرم ﷺ نے اپنی امت کے لیے اس راستے کو بند کر دیا تاکہ وہ اس غلطی کا شکار نہ ہوں جس میں سابقہ امتیں مبتلا ہوئیں۔",
                "یہ ممانعت فرض اور نفل دونوں نمازوں کو شامل ہے، اور اس سے نماز باطل ہو جاتی ہے۔"
              ],
              "english": [
                "Praying facing the graves (e.g., taking them as Qiblah) is a clear path leading to Shirk.",
                "The Prophet (ﷺ) closed this path for his Ummah to prevent them from falling into the error that afflicted previous nations.",
                "This prohibition includes both obligatory and voluntary prayers, and violating it nullifies the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبرستان کی حدود",
              "english": "Boundaries of the Graveyard"
            },
            "content": {
              "urdu": [
                "ممانعت صرف عین قبر کے سامنے نماز پڑھنے تک محدود نہیں، بلکہ پورے قبرستان کو سجدہ گاہ بنانے سے منع کیا گیا ہے۔",
                "مسلمان کو چاہیے کہ وہ قبرستان سے دور، پاک اور کھلی جگہ پر نماز ادا کرے۔",
                "یہ حکم قبرستان میں بھی نمازِ جنازہ کو شامل نہیں کرتا، کیونکہ اس کا حکم الگ اور جنازہ کے ساتھ منسلک ہے۔"
              ],
              "english": [
                "The prohibition is not just limited to praying directly in front of a grave but extends to making the entire graveyard a place of prayer.",
                "A Muslim should perform prayer in a clean, open area far from the graveyard.",
                "This ruling does not include the Funeral Prayer (Ṣalāt al-Janāzah), as its ruling is separate and linked to the deceased."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قبروں پر بیٹھنے کی ممانعت",
        "english": "Prohibition of Sitting Upon Graves"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احترامِ میت",
              "english": "Respect for the Deceased"
            },
            "content": {
              "urdu": [
                "«وَلَا تَجْلِسُوا عَلَيْهَا» کا حکم قبر کی بے حرمتی اور میت کے احترام کو یقینی بناتا ہے۔",
                "قبر پر بیٹھنا میت کے لیے بھی تکلیف دہ ہو سکتا ہے اور اس کے لیے استغفار میں رکاوٹ بنتا ہے۔",
                "نبی اکرم ﷺ نے قبروں کی عزت اور احترام کا حکم دیا، انہیں عام بیٹھنے کی جگہوں جیسا سلوک نہیں کرنا چاہیے۔"
              ],
              "english": [
                "The command 'and do not sit upon them' ensures the sanctity of the grave and respect for the deceased.",
                "Sitting on a grave can be disrespectful and may cause distress to the deceased or hinder seeking forgiveness for them.",
                "The Prophet (ﷺ) commanded the respect and honor of graves, emphasizing they should not be treated like ordinary sitting places."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبرستان میں آداب",
              "english": "Manners in the Graveyard"
            },
            "content": {
              "urdu": [
                "قبرستان میں داخل ہونے والے کو چاہیے کہ وہ اہلِ قبور کو سلام کرے اور ان کے لیے دعا کرے۔",
                "چلتے پھرتے وقت بھی قبروں کو پامال کرنے یا ان کے اوپر قدم رکھنے سے بچنا چاہیے۔",
                "یہ ممانعت لوگوں کو قبروں پر بیٹھ کر دنیاوی باتیں کرنے یا سستی کرنے سے روکتی ہے۔"
              ],
              "english": [
                "A person entering the graveyard should greet the occupants (Ahl al-Qubūr) and supplicate for them.",
                "One must also avoid trampling or stepping on the graves while walking.",
                "This prohibition discourages people from sitting on graves and engaging in worldly talk or laziness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور اخلاقی درس",
        "english": "Juristic and Ethical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذریعہ شرک کا سدِ باب",
              "english": "Blocking the Means to Shirk (Sadd Adh-Dharā'i')"
            },
            "content": {
              "urdu": [
                "یہ حدیث اسلام کے اس عظیم اصول کو واضح کرتی ہے کہ شرک کی طرف لے جانے والے ہر راستے کو بند کر دیا جائے۔",
                "قبروں کی طرف نماز پڑھنا، اگرچہ نیت عبادت کی ہو، وقت کے ساتھ انہیں معبود بنانے کا ذریعہ بن سکتا ہے۔",
                "مسلمان کو چاہیے کہ وہ اپنی عبادات میں اخلاص اور توحید کی حفاظت کرے۔"
              ],
              "english": [
                "This Hadith clarifies the great Islamic principle of blocking every path that leads to polytheism (Sadd Adh-Dharā'i').",
                "Praying towards graves, even if the intention is pure, can eventually become a means of worshiping them.",
                "A Muslim must safeguard sincerity and Monotheism in all their acts of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمومی ممانعت",
              "english": "General Prohibition"
            },
            "content": {
              "urdu": [
                "پہلی حدیث (167) میں قبرستان میں نماز کی ممانعت کا حکم تھا، اور یہ حدیث اس کی مزید تاکید کرتی ہے۔",
                "یہ حدیث صحیح مسلم میں موجود ہے، جو اس کے حکم کی قطعی حیثیت کو واضح کرتی ہے۔",
                "مسلمان کو چاہیے کہ وہ قبرستان میں جائے تو میتوں کے لیے دعا کرے اور اس ممنوع عمل سے باز رہے۔"
              ],
              "english": [
                "The previous Hadith (167) prohibited prayer in the graveyard, and this Hadith further emphasizes that ruling.",
                "This Hadith is found in Ṣaḥīḥ Muslim, establishing the definitive nature of its ruling.",
                "A Muslim should only enter a graveyard to supplicate for the dead and must refrain from these prohibited actions."
              ]
            }
          }
        ]
      }
    }
  ]
}
