{
  "hadithId": 175,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["1:4:16"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (البكاء في الصلاة)",
    "babId": 13
  },
  "name": {
    "arabic": "وَعَنْ مُطَرِّفِ بْنِ عَبْدِ اَللَّهِ بْنِ الشِّخِّيرِ , عَنْ أَبِيهِ قَالَ : { رَأَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُصَلِّي , وَفِي صَدْرِهِ أَزِيزٌ كَأَزِيزِ اَلْمِرْجَلِ , مِنْ اَلْبُكَاءِ } أَخْرَجَهُ اَلْخَمْسَةُ , إِلَّا اِبْنَ مَاجَهْ , وَصَحَّحَهُ اِبْنُ حِبَّانَ . ",
    "urdu": " سیدنا مطرف اپنے باپ عبداللہ بن شخیر رضی اللہ عنہ سے بیان کرتے ہیں انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھتے دیکھا ہے اس وقت آپ صلی اللہ علیہ وسلم کے سینہ مبارک سے گریہ و زاری کی وجہ سے ایسی آواز آ رہی تھی جیسے جوش کھاتی ہوئی ہنڈیا (سے آواز آتی) ہے۔ اسے احمد، ابوداؤد، ترمذی، نسائی نے روایت کیا ہے اور ابن حبان نے صحیح قرار دیا ہے۔",
    "english": "Narrated Muṭarrif ibn 'Abdillāh ibn Ash-Shikhkhīr, from his father (RA), who said: 'I saw the Messenger of Allah (ﷺ) praying, and there was a sound in his chest like the bubbling of a cooking pot (Mirjal) due to weeping.' Reported by the five compilers except Ibn Mājah, and Ibn Ḥibbān graded it as Ṣaḥīḥ (authentic)."
  },
  "takhreej": {
    "arabic": " صحيح .‏ رواه أبو داود (904)‏ ، والنسائي (3/13)‏ ، والترمذي في الشمائل (315)‏ ، وأحمد (4/25 و 26)‏ ، وصححه ابن خزيمة (665 و 753)‏ .‏ والمرجل : القدر .‏ الأزيز : صوت غليانها .‏",
    "urdu": "صحیح۔ اسے ابو داؤد (904)، نسائی (3/13)، ترمذی نے ”الشمائل“ (315) میں، اور احمد (4/25، 26) نے روایت کیا ہے، اور ابن خزیمہ (665 اور 753) نے بھی اسے صحیح قرار دیا ہے۔ المرجل (Mirjal) سے مراد ہنڈیا (Cooking Pot) ہے۔ الازیز (Azīz) سے مراد اس کے اُبلنے کی آواز ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Abu Dawud (904), An-Nasā'ī (3/13), At-Tirmidhī in 'Ash-Shamā'il' (315), and Ahmad (4/25 & 26). Ibn Khuzaymah (665 & 753) also authenticated it. Al-Mirjal refers to a cooking pot. Al-Azīz refers to the sound of its boiling.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "يُصَلِّي",
      "english": "He was praying",
      "urdu": "وہ نماز پڑھ رہے تھے"
    },
    {
      "arabic": "صَدْرِهِ",
      "english": "His chest",
      "urdu": "ان کے سینہ مبارک"
    },
    {
      "arabic": "أَزِيزٌ",
      "english": "A sound/bubbling sound",
      "urdu": "آواز/جوش کی آواز"
    },
    {
      "arabic": "كَأَزِيزِ اَلْمِرْجَلِ",
      "english": "Like the bubbling of a cooking pot",
      "urdu": "جوش کھاتی ہوئی ہنڈیا کی طرح"
    },
    {
      "arabic": "مِنْ اَلْبُكَاءِ",
      "english": "Due to weeping/crying",
      "urdu": "گریہ و زاری کی وجہ سے"
    },
    {
      "arabic": "اَلْخَمْسَةُ",
      "english": "The Five (compilers)",
      "urdu": "پانچوں محدثین"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم صلی اللہ علیہ وسلم کے نماز میں کمالِ خشوع اور اللہ کے خوف کی شدت کو بیان کرتی ہے۔ آپ ﷺ حالتِ نماز میں اتنی گریہ و زاری فرماتے تھے کہ آپ کے سینہ مبارک سے روتے وقت جوش کھاتی ہنڈیا جیسی آواز سنائی دیتی تھی۔ یہ عمل اس بات کی دلیل ہے کہ نماز میں ایسا رونا جو گفتگو نہ ہو، نماز کو باطل نہیں کرتا، بلکہ خشوع کی علامت ہے۔",
    "english": "This Hadith illustrates the profound reverence (Khushu') and intense fear of Allah experienced by the Prophet (ﷺ) during prayer. His weeping produced a sound from his chest like the bubbling of a boiling pot. This action proves that weeping in prayer, as long as it does not involve ordinary human speech, does not nullify the prayer; rather, it is a sign of deep devotion."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (904)",
      "english": "Reported by Abu Dawud (904)"
    },
    {
      "arabic": "رواه النسائي (3/13)",
      "english": "Reported by An-Nasā'ī (3/13)"
    },
    {
      "arabic": "صححه ابن خزيمة (665)",
      "english": "Authenticated by Ibn Khuzaymah (665)"
    },
    {
      "arabic": "رواه أحمد (4/25)",
      "english": "Reported by Ahmad (4/25)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "مطرف بن عبد الله بن الشخير",
        "english": "Muṭarrif ibn 'Abdillāh ibn Ash-Shikhkhīr"
      },
      "slug": "mutarrif-ibn-abdillah-ibn-ash-shikhkhir"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن الشخير",
        "english": "Abdullāh ibn Ash-Shikhkhīr"
      },
      "slug": "abdullah-ibn-ash-shikhkhir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-t1yM-l1hI",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں گریہ و زاری کی کیفیت",
        "english": "The Nature of Weeping in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خشوع اور رونا",
              "english": "Reverence (Khushu') and Crying"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا نماز میں اس قدر گریہ و زاری کرنا اس بات کی دلیل ہے کہ نماز میں خشوع کا اعلیٰ ترین معیار کیا ہے۔",
                "یہ رونا اللہ کے خوف اور اس کے سامنے عاجزی کے اظہار کی وجہ سے تھا، جو نماز کی روح ہے۔",
                "جو شخص نماز میں گریہ و زاری کرے، اگر وہ کلامِ ناس نہ ہو، تو اس کی نماز نہ صرف صحیح ہے بلکہ کامل بھی ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) intense weeping during prayer demonstrates the highest standard of Khushu' in prayer.",
                "This weeping stemmed from the fear of Allah and the expression of humility before Him, which is the soul of prayer.",
                "The prayer of a person who weeps out of devotion is valid and complete, provided it does not constitute ordinary human speech."
              ]
            }
          },
          {
            "title": {
              "urdu": "آواز کا حکم (ازیز)",
              "english": "The Ruling of the Sound (Azīz)"
            },
            "content": {
              "urdu": [
                "سینے سے جوش کھاتی ہنڈیا جیسی آواز (ازیز) کا آنا طبعی تھا اور یہ انسان کی عام گفتگو نہیں ہے۔",
                "فقہاء نے اس بات پر اتفاق کیا ہے کہ ایسا رونا جو بلا ارادہ ہو اور جس میں حروفِ کلام واضح نہ ہوں، نماز کو باطل نہیں کرتا۔",
                "اگر رونا دنیاوی غم کے لیے ہو اور اس میں واضح الفاظ شامل ہوں، تو یہ نماز کو باطل کر سکتا ہے۔"
              ],
              "english": [
                "The bubbling sound (Azīz) from the chest was natural and does not qualify as ordinary human speech.",
                "Jurists agree that such involuntary weeping, where no discernible human speech is uttered, does not invalidate the prayer.",
                "If the weeping is due to worldly grief and involves clear articulation of words, it may nullify the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اثرات",
        "english": "Effects in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابی کا مشاہدہ",
              "english": "The Companion's Observation"
            },
            "content": {
              "urdu": [
                "عبداللہ بن شخیرؓ کا یہ واقعہ بیان کرنا، نبی ﷺ کی کیفیتِ نماز کی اہمیت کو ظاہر کرتا ہے۔",
                "صحابی کا عمل اس بات کی دلیل ہے کہ وہ نبی ﷺ کی پیروی میں ہر چھوٹی بڑی چیز کا خیال رکھتے تھے۔",
                "یہ ہم پر فرض ہے کہ ہم نبی ﷺ کے گریہ و زاری کے ذریعے خشوع کے معیار کو سمجھیں۔"
              ],
              "english": [
                "The narration of this incident by 'Abdullāh ibn Ash-Shikhkhīr (RA) underscores the importance of the Prophet's state in prayer.",
                "The Companion's action proves their attention to every detail in following the Prophet (ﷺ).",
                "It is incumbent upon us to understand the standard of Khushu' through the Prophet's weeping."
              ]
            }
          },
          {
            "title": {
              "urdu": "گریہ و زاری کی ترغیب",
              "english": "Encouragement for Weeping"
            },
            "content": {
              "urdu": [
                "یہ حدیث اس بات کی ترغیب دیتی ہے کہ نماز میں اللہ کے سامنے مکمل عاجزی اور خشوع کے ساتھ کھڑے ہونا چاہیے۔",
                "اگر دل میں خوفِ خدا پیدا ہو تو آنسوؤں کا بہنا ایک محمود اور پسندیدہ عمل ہے۔",
                "نبی ﷺ کے خشوع کی یہ کیفیت ہمیں نماز کی طرف زیادہ توجہ دینے کی طرف مائل کرتی ہے۔"
              ],
              "english": [
                "This Hadith encourages standing before Allah with complete humility and reverence (Khushu') in prayer.",
                "If the fear of Allah arises in the heart, the shedding of tears is a praiseworthy and desirable act.",
                "This state of the Prophet's Khushu' inspires us to pay closer attention to our prayers."
              ]
            }
          }
        ]
      }
    }
  ]
}
