{
  "hadithId": 160,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["1:4:1"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (بطلان الصلاة)",
    "babId": 13
  },
  "name": {
    "arabic": "عَنْ عَلِيِّ بْنِ طَلْقٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا فَسَا أَحَدُكُمْ فِي اَلصَّلَاةِ فَلْيَنْصَرِفْ , وَلْيَتَوَضَّأْ , وَلْيُعِدْ اَلصَّلَاةَ } رَوَاهُ اَلْخَمْسَةُ , وَصَحَّحَهُ اِبْنُ حِبَّانَ . ",
    "urdu": " سیدنا علی بن طلق رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”دوران نماز جب تم میں سے کسی کی ہوا خارج ہو جائے تو وہ واپس جائے، ازسرنو (دوبارہ سے) وضو کرے اور نماز دوبارہ پڑھے۔ “ اسے احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ پانچوں نے روایت کیا ہے اور ابن حبان نے صحیح قرار دیا ہے۔ ",
    "english": "Narrated 'Alī ibn Ṭalq (RA): The Messenger of Allah (ﷺ) said: 'If one of you passes wind (Fasā) during the prayer, he should leave, perform Wuḍū' (ablution) anew, and repeat the prayer.' Reported by the five compilers (Ahmad, Abu Dawud, At-Tirmidhī, An-Nasā'ī, and Ibn Mājah), and Ibn Ḥibbān graded it as Ṣaḥīḥ (authentic)."
  },
  "takhreej": {
    "arabic": " ضعيف .‏ رواه أبو داود (205)‏ ، والترمذي (1166)‏ ، وأحمد (1/86)‏ وجعله من مسند علي بن أبي طالب ، وهو خطأ منه كما نبه على ذلك ابن كثير في \"التفسير\" (1 /385)‏ ، وابن حبان في \"صحيحه\" (2237)‏ .‏ قلت : والحديث ضعيف؛ لأن مداره على مجهول هذا أولا .‏ وثانيا: عند بعضهم زيادة النهي عن إتيان النساء في أدبارهن ، وهذه الزيادة صحيحة بما لها من شواهد أخرى.‏ ثالثا : الحديث لم يروه ابن ماجه ، وهذا من أوهام الحافظ ‏-رحمه الله‏- .‏",
    "urdu": "ضعیف۔ اسے ابو داؤد (205)، ترمذی (1166)، اور احمد (1/86) نے روایت کیا ہے، اور احمد نے اسے علی بن ابی طالبؓ کی مسند میں شامل کیا ہے، جو ان کی طرف سے غلطی ہے، جیسا کہ ابن کثیر نے ”التفسیر“ (1/385) میں اور ابن حبان نے ”صحیح“ (2237) میں اس پر تنبیہ کی ہے۔ میں (حافظ ابن حجر) کہتا ہوں: اور یہ حدیث ضعیف ہے؛ کیونکہ اس کی سند کا دار و مدار ایک مجہول (نامعلوم) راوی پر ہے، یہ پہلی بات ہے۔ دوسری یہ کہ بعض روایات میں عورتوں سے پیچھے کی طرف سے جماع کی ممانعت کا اضافہ ہے، اور یہ اضافہ دیگر شواہد کی بنا پر صحیح ہے۔ تیسری بات: اس حدیث کو ابن ماجہ نے روایت نہیں کیا ہے، اور یہ حافظ (ابن حجر) کے اوہام میں سے ہے۔",
    "english": "Weak (Ḍa'īf). Reported by Abu Dawud (205), At-Tirmidhī (1166), and Ahmad (1/86), who included it in the Musnad of 'Alī ibn Abī Ṭālib, which is an error on his part, as noted by Ibn Kathīr in 'At-Tafsīr' (1/385) and Ibn Ḥibbān in his 'Ṣaḥīḥ' (2237). I say: The Hadith is weak because its chain relies on an unknown narrator (Majhūl), firstly. Secondly, some narrations include the addition of the prohibition of approaching women from behind, and this addition is authentic due to other corroborating evidence. Thirdly: The Hadith was not reported by Ibn Mājah, which is one of the errors of Al-Ḥāfiz (Ibn Ḥajar).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "فَسَا أَحَدُكُمْ",
      "english": "One of you passes wind",
      "urdu": "تم میں سے کسی کی ہوا خارج ہو جائے"
    },
    {
      "arabic": "فِي اَلصَّلَاةِ",
      "english": "During the prayer",
      "urdu": "دوران نماز"
    },
    {
      "arabic": "فَلْيَنْصَرِفْ",
      "english": "He should leave/turn away",
      "urdu": "تو وہ واپس جائے"
    },
    {
      "arabic": "وَلْيَتَوَضَّأْ",
      "english": "And perform Wuḍū' (ablution)",
      "urdu": "اور دوبارہ وضو کرے"
    },
    {
      "arabic": "وَلْيُعِدْ اَلصَّلَاةَ",
      "english": "And repeat the prayer",
      "urdu": "اور نماز دوبارہ پڑھے"
    },
    {
      "arabic": "مَجْهُول",
      "english": "Unknown narrator",
      "urdu": "مجہول راوی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ اگر کسی شخص کی نماز کے دوران ہوا (ریح) خارج ہو جائے تو اس کی نماز ٹوٹ جاتی ہے۔ اس صورت میں اسے نماز چھوڑ کر دوبارہ وضو کرنا چاہیے اور پھر نماز کو نئے سرے سے ادا کرنا چاہیے (نماز کا اعادہ)۔ تاہم، یہ روایت سند کے اعتبار سے ضعیف ہے، اگرچہ اس کا حکم دوسرے صحیح احادیث (حدث کے بعد وضو کا وجوب) کے موافق ہے۔",
    "english": "This Hadith states that if a person passes wind (Rīḥ) during prayer, their prayer is nullified. In this situation, they must leave the prayer, perform Wuḍū' anew, and then repeat the prayer from the beginning. However, this narration is weak in its chain, although its ruling is consistent with other authentic Ahadith concerning the obligation of Wuḍū' after nullifiers of ablution (Hadath)."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (205)",
      "english": "Reported by Abu Dawud (205)"
    },
    {
      "arabic": "رواه الترمذي (1166)",
      "english": "Reported by At-Tirmidhī (1166)"
    },
    {
      "arabic": "رواه أحمد (1/86)",
      "english": "Reported by Ahmad (1/86)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن طلق",
        "english": "Alī ibn Ṭalq"
      },
      "slug": "ali-ibn-talq"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Ḍa'īf)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نواقض وضو اور نماز کا حکم",
        "english": "Nullifiers of Wuḍū' and Prayer Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدث اور طہارت کا خاتمہ",
              "english": "Hadath and the Nullification of Purification"
            },
            "content": {
              "urdu": [
                "فسا (ہوا کا خارج ہونا) نواقض وضو میں سے ہے اور نماز کے دوران اس کا ہونا طہارت کو ختم کر دیتا ہے۔",
                "طہارت نماز کی ایک بنیادی شرط ہے، اس لیے طہارت کے ختم ہونے سے نماز فوراً باطل ہو جاتی ہے۔",
                "صحیح حکم یہی ہے کہ حدث کے بعد واپس جانا، وضو کرنا اور نماز کو دوبارہ شروع کرنا ضروری ہے۔"
              ],
              "english": [
                "Passing wind (Fasā) is one of the nullifiers of Wuḍū', and its occurrence during prayer instantly voids the state of purification.",
                "Purification (Ṭahārah) is a fundamental condition for prayer; hence, its nullification invalidates the prayer immediately.",
                "The authentic ruling dictates that one must leave the prayer after Ḥadath, perform Wuḍū', and then restart the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز سے انصراف (واپسی)",
              "english": "Leaving the Prayer (Inṣirāf)"
            },
            "content": {
              "urdu": [
                "«فَلْيَنْصَرِفْ» (he should leave) means he should step out of the prayer and proceed towards the place of ablution.",
                "This instruction was given so that the worshipper can restore his purification and perform the prayer with renewed focus.",
                "The Prophet (ﷺ) encouraged leaving discreetly to avoid embarrassment."
              ],
              "english": [
                "The command 'falyanṣarif' (he should leave) means he should step out of the prayer and proceed towards the place of ablution.",
                "This instruction was given so that the worshipper can restore his purification and perform the prayer with renewed focus.",
                "The Prophet (ﷺ) encouraged leaving discreetly to avoid embarrassment."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حدیث کی سند میں ضعف اور وضاحت",
        "english": "Weakness in the Hadith Chain and Clarification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعف کی علت (مجہول راوی)",
              "english": "Reason for Weakness (Unknown Narrator)"
            },
            "content": {
              "urdu": [
                "ابو داؤد اور ترمذی نے اس روایت کو ضعیف قرار دیا ہے کیونکہ اس کی سند میں ایک راوی مجہول ہے۔",
                "ابن حبان کا اسے صحیح قرار دینا دوسرے محدثین کے نزدیک درست نہیں، کیونکہ انہوں نے مجہول راویوں کو ثقہ قرار دینے میں نرمی کی ہے۔",
                "صحیح علم یہی ہے کہ سند ضعیف ہے، لیکن اس کا متن صحیح احادیث (جیسے لا تقبل صلاۃ بغیر طہور) کے اصول کے موافق ہے۔"
              ],
              "english": [
                "Abu Dawud and At-Tirmidhī graded this narration as weak because its chain contains an unknown narrator (Majhūl).",
                "Ibn Ḥibbān's grading it as Ṣaḥīḥ is not accepted by other scholars, as he was lenient in authenticating unknown narrators.",
                "The correct knowledge is that the chain is weak, but the text aligns with the principles of authentic Ahadith (e.g., Prayer is not accepted without purification)."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابن ماجہ سے عدم روایت",
              "english": "Non-Narration by Ibn Mājah"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر کا اسے پانچوں (الخمسہ) میں شامل کرنا غلطی ہے، کیونکہ ابن ماجہ نے اسے روایت نہیں کیا۔",
                "محدثین کی تحقیق اس بات کو ظاہر کرتی ہے کہ حتیٰ کہ بڑے محدثین سے بھی اوہام (سہو) ہو سکتی ہیں۔",
                "علم کی نشر و اشاعت میں ہمیشہ تحقیق اور تنقید کو برقرار رکھنا ضروری ہے۔"
              ],
              "english": [
                "Al-Ḥāfiz Ibn Ḥajar's inclusion of it among the five (Al-Khamsah) is an error, as Ibn Mājah did not report it.",
                "The research of Hadith scholars shows that even great traditionists can make mistakes (Awhām).",
                "It is necessary to maintain research and critical analysis when disseminating knowledge."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجتماعی نماز میں اخلاقی حکم",
        "english": "Ethical Ruling in Congregational Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں شرم و حیا",
              "english": "Modesty and Shame in Worship"
            },
            "content": {
              "urdu": [
                "اگر نماز میں ہوا خارج ہو جائے تو شرمندگی سے بچنے کے لیے خاموشی سے اور نرمی سے نکل جانا چاہیے۔",
                "دوسرے لوگوں کو چاہیے کہ وہ حدث کرنے والے کی طرف متوجہ نہ ہوں اور اس پر ہنسیں نہیں۔",
                "یہ اخلاقی حکم ہے جو انسانوں کی عزت نفس اور نماز کے خشوع کا خیال رکھتا ہے۔"
              ],
              "english": [
                "If one passes wind during prayer, they should leave quietly and gently to avoid embarrassment.",
                "Other people should not stare at the person who nullified his ablution or laugh at him.",
                "This is an ethical ruling that considers human dignity and the reverence of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز دوبارہ پڑھنے کا وجوب",
              "english": "Obligation to Repeat the Prayer"
            },
            "content": {
              "urdu": [
                "نماز کی دوبارہ ادائیگی (اعادہ) کا حکم واضح ہے، کیونکہ طہارت کے بغیر نماز باطل ہے۔",
                "اگر کوئی شخص حدث کے بعد نماز جاری رکھے تو وہ گناہ گار ہو گا اور اس کی نماز قبول نہیں ہو گی۔",
                "یہ حکم اس بات کی تاکید ہے کہ اسلام طہارت کو ایک بنیادی رکن قرار دیتا ہے۔"
              ],
              "english": [
                "The command to repeat the prayer ('I'ādah) is clear because the prayer is void without purification.",
                "If a person continues praying after Ḥadath, they commit a sin and their prayer will not be accepted.",
                "This ruling emphasizes that Islam considers purification a fundamental pillar of worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
