{
  "hadithId": 179,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["1:4:20"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (قتل الحيات في الصلاة)",
    "babId": 13
  },
  "name": {
    "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اُقْتُلُوا اَلْأَسْوَدَيْنِ فِي اَلصَّلَاةِ : اَلْحَيَّةَ, وَالْعَقْرَبَ } أَخْرَجَهُ اَلْأَرْبَعَةُ , وَصَحَّحَهُ اِبْنُ حِبَّانَ",
    "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے کہ ”نماز میں دو سیاہ فام جانوروں سانپ اور بچھو کو مار دیا کرو۔“ اس حدیث کو چاروں یعنی ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے۔",
    "english": "Narrated Abū Hurayrah (RA): The Messenger of Allah (ﷺ) said: 'Kill the two black ones during prayer: the snake (Ḥayyah) and the scorpion ('Aqrab).' Reported by the four compilers (Abu Dawud, At-Tirmidhī, An-Nasā'ī, and Ibn Mājah), and Ibn Ḥibbān graded it as Ṣaḥīḥ (authentic)."
  },
  "takhreej": {
    "arabic": " صحيح .‏ رواه أبو داود (921)‏ ، والنسائي (3/10)‏ ، والترمذي (390)‏ ، وابن ماجه (1245)‏ ، وصححه ابن حبان برقم (2352)‏ .‏ وقال الترمذي : \"حديث حسن صحيح\" .‏",
    "urdu": "صحیح۔ اسے ابو داؤد (921)، نسائی (3/10)، ترمذی (390) اور ابن ماجہ (1245) نے روایت کیا ہے، اور ابن حبان نے (2352) پر اسے صحیح قرار دیا ہے۔ ترمذی نے کہا: ”حدیث حسن صحیح ہے۔“",
    "english": "Authentic (Ṣaḥīḥ). Reported by Abu Dawud (921), An-Nasā'ī (3/10), At-Tirmidhī (390), and Ibn Mājah (1245), and Ibn Ḥibbān authenticated it (2352). At-Tirmidhī said: 'Hadith Ḥasan Ṣaḥīḥ (Good and Authentic).'",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "اُقْتُلُوا",
      "english": "Kill/Slaughter",
      "urdu": "مار ڈالو"
    },
    {
      "arabic": "اَلْأَسْوَدَيْنِ",
      "english": "The two black ones",
      "urdu": "دو سیاہ فام جانوروں"
    },
    {
      "arabic": "فِي اَلصَّلَاةِ",
      "english": "During the prayer",
      "urdu": "نماز میں"
    },
    {
      "arabic": "اَلْحَيَّةَ",
      "english": "The snake",
      "urdu": "سانپ"
    },
    {
      "arabic": "وَالْعَقْرَبَ",
      "english": "And the scorpion",
      "urdu": "اور بچھو"
    },
    {
      "arabic": "عَمَلٌ قَلِيل",
      "english": "Minor action",
      "urdu": "عمل قلیل"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں ایسے موذی اور زہریلے جانوروں (سانپ اور بچھو) کو مارنے کا حکم دیتی ہے جن سے جانی نقصان کا خطرہ ہو، اور یہ اجازت دیتی ہے کہ ایسے عمل کی وجہ سے نماز باطل نہیں ہوگی، حالانکہ نماز میں عام گفتگو اور عمل کثیر ممنوع ہے۔ یہ شریعت کا ایک اصول ہے کہ بڑے ضرر کو دور کرنے کے لیے چھوٹا عمل جائز ہے۔",
    "english": "This Hadith commands killing venomous and harmful animals (snakes and scorpions) during prayer if they pose a danger. This permission ensures that the prayer is not invalidated by this action, even though general speech and excessive movement are forbidden in prayer. This is an Islamic legal principle that permits minor action to avert a greater harm."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (921)",
      "english": "Reported by Abu Dawud (921)"
    },
    {
      "arabic": "رواه الترمذي (390)",
      "english": "Reported by At-Tirmidhī (390)"
    },
    {
      "arabic": "صححه ابن حبان (2352)",
      "english": "Authenticated by Ibn Ḥibbān (2352)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abū Hurayrah"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں عمل قلیل کا حکم",
        "english": "The Ruling of Minor Action ('Amal Qalīl) in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرورت کے تحت عمل",
              "english": "Action Under Necessity"
            },
            "content": {
              "urdu": [
                "سانپ اور بچھو جیسے موذی جانوروں کو مارنے کا حکم یہ ظاہر کرتا ہے کہ اپنی جان کی حفاظت کی ضرورت پر نماز میں عمل قلیل جائز ہے۔",
                "یہ عمل، اگرچہ نماز کے معمول کے افعال میں شامل نہیں، لیکن چونکہ اس کا مقصد ضرر کو دور کرنا ہے، اس لیے نماز باطل نہیں ہوگی۔",
                "فقہاء کے نزدیک یہ عمل نماز کو باطل نہیں کرتا کیونکہ یہ امرِ واجب (نبی کا حکم) کے تحت ہے اور عمل قلیل میں شمار ہوتا ہے۔"
              ],
              "english": [
                "The command to kill harmful creatures like snakes and scorpions proves that minor action is permissible in prayer out of the necessity of self-preservation.",
                "This action, although not part of the standard prayer movements, does not invalidate the prayer because it aims to avert harm and is considered minor action ('Amal Qalīl).",
                "Jurists concur that this does not nullify the prayer because it falls under a commanded obligation (the Prophet's order) and is a minor act."
              ]
            }
          },
          {
            "title": {
              "urdu": "الأسودین (دو سیاہ فام) کی تخصیص",
              "english": "Specificity of Al-Aswadayn (The Two Black Ones)"
            },
            "content": {
              "urdu": [
                "«اَلْأَسْوَدَيْنِ» کا لفظ سانپ اور بچھو کے لیے استعمال ہوا ہے، اگرچہ وہ سیاہ نہ بھی ہوں۔",
                "یہ تخصیص اس لیے ہے کہ یہ جانور عام طور پر زہریلے اور نقصان دہ ہوتے ہیں، بالخصوص مکہ اور مدینہ میں۔",
                "اس حکم کا اطلاق ان تمام جانوروں پر ہوتا ہے جو نماز میں نقصان پہنچا سکتے ہوں اور ان سے جان کا خطرہ ہو۔"
              ],
              "english": [
                "The term 'Al-Aswadayn' (the two black ones) is used for the snake and the scorpion, even if they are not black.",
                "This specificity is because these creatures are generally venomous and dangerous, especially in Makkah and Madinah.",
                "The ruling extends to all animals that can cause harm during prayer and pose a threat to life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قواعدِ فقہ کی تطبیق",
        "english": "Application of Juristic Maxims"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضرر کو دور کرنا",
              "english": "Averting Harm (Darr)"
            },
            "content": {
              "urdu": [
                "یہ حکم فقہی قاعدہ 'لا ضرر ولا ضرار' (نہ خود کو نقصان پہنچاؤ اور نہ دوسروں کو) کی تائید کرتا ہے۔",
                "اگر موذی جانور کو نہ مارا جائے تو یہ نماز میں نقصان پہنچا سکتا ہے یا کسی کو زہر دے سکتا ہے۔",
                "جان کی حفاظت چونکہ نماز سے بھی زیادہ مقدم ہے، اس لیے نماز میں چھوٹا عمل جائز ہوا۔"
              ],
              "english": [
                "This ruling supports the legal maxim 'Lā ḍarara wa lā ḍirāra' (No causing harm nor reciprocating it).",
                "If the harmful creature is not killed, it could harm the person praying or inject poison.",
                "Since preserving life is paramount, even over prayer, the minor action in prayer was permitted."
              ]
            }
          },
          {
            "title": {
              "urdu": "عمل کثیر سے اجتناب",
              "english": "Avoiding Excessive Movement"
            },
            "content": {
              "urdu": [
                "سانپ یا بچھو کو مارنے کے لیے ضرورت سے زیادہ یا مسلسل حرکت نہیں کرنی چاہیے، تاکہ عملِ کثیر سے نماز باطل نہ ہو۔",
                "اگر جانور کو مارنے کے لیے بہت زیادہ حرکت کرنا پڑے تو نماز توڑ کر مارنا واجب ہو جاتا ہے۔",
                "نمازی کو چاہیے کہ وہ نماز میں صرف ایک ہاتھ سے ہی موذی جانور کو مارے۔"
              ],
              "english": [
                "One must avoid excessive or continuous movement to kill the creature, otherwise, the 'Amal Kathīr will invalidate the prayer.",
                "If killing the animal requires too much movement, one must break the prayer to kill it.",
                "The worshipper should ideally use only one hand to kill the harmful creature during prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور اخلاقی پہلو",
        "english": "Training and Ethical Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوفِ خدا اور جان کی حفاظت",
              "english": "Fear of Allah and Self-Preservation"
            },
            "content": {
              "urdu": [
                "یہ حکم سکھاتا ہے کہ اسلام دنیاوی اور اخروی دونوں ذمہ داریوں میں توازن قائم کرتا ہے۔",
                "نمازی کو یہ نہیں سوچنا چاہیے کہ موذی جانور کو مارنے سے نماز ٹوٹ جائے گی، بلکہ جان کی حفاظت کرنی چاہیے۔",
                "نماز کی حرمت کے باوجود، جان کے بچاؤ کے لیے عارضی عمل کی اجازت رحمتِ الٰہی ہے۔"
              ],
              "english": [
                "This ruling teaches that Islam maintains a balance between worldly and spiritual responsibilities.",
                "The worshipper should not hesitate to protect their life from the creature out of fear of invalidating the prayer.",
                "The permission for a temporary action to save a life, despite the sanctity of prayer, is a manifestation of Allah's Mercy."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان اور نماز کا تعلق",
              "english": "Connection Between Adhān and Prayer"
            },
            "content": {
              "urdu": [
                "اذان کے ذریعے نماز کے وقت کی اطلاع ہوتی ہے اور نماز میں ایسا حکم دینا اس کی عملی اہمیت کو ظاہر کرتا ہے۔",
                "یہ حدیث اس بات کی دلیل ہے کہ نماز میں غیر اللہ کے ساتھ بات چیت حرام ہے، مگر خود کو بچانے کے لیے عمل جائز ہے۔",
                "مسلمان کو چاہیے کہ وہ ہر حال میں شرعی احکام کی حدود کو سمجھے اور ان پر عمل کرے۔"
              ],
              "english": [
                "The Hadith's context in the rulings of prayer shows its practical significance.",
                "It proves that while communication with people is forbidden in prayer, action to save oneself is permitted.",
                "A Muslim should strive to understand the boundaries of legal rulings in all circumstances and adhere to them."
              ]
            }
          }
        ]
      }
    }
  ]
}
