{
  "hadithId": 168,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["1:4:9"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (الأماكن المنهي عنها)",
    "babId": 13
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏-]قَالَ] : { نَهَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَنْ يُصَلَّى فِي سَبْعِ مَوَاطِنَ : اَلْمَزْبَلَةِ , وَالْمَجْزَرَةِ , وَالْمَقْبَرَةِ , وَقَارِعَةِ اَلطَّرِيقِ , وَالْحَمَّامِ , وَمَعَاطِنِ اَلْإِبِلِ , وَفَوْقَ ظَهْرِ بَيْتِ اَللَّهِ } رَوَاهُ اَلتِّرْمِذِيُّ وَضَعَّفَهُ ",
    "urdu": "سیدنا ابن عمر رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سات مقامات پر نماز پڑھنے سے منع فرمایا ہے: کوڑا کرکٹ (ڈالنے) کی جگہ، ذبح خانہ، قبرستان، شارع عام، حمام، اونٹ باندھنے کی جگہ (باڑا) اور بیت اللہ کی چھت پر۔ ترمذی نے اسے ضعیف سند کے ساتھ روایت کیا ہے۔  ",
    "english": "Narrated Ibn 'Umar (RA): 'The Prophet (ﷺ) forbade praying in seven places: the dumping ground (Mazbalah), the slaughterhouse (Majzarah), the graveyard (Maqbarah), the middle of the road (Qāri'at aṭ-Ṭarīq), the bathhouse (Ḥammām), the camel resting area (Ma'āṭin al-Ibil), and on the top of the roof of the House of Allah (Ka'bah).' Reported by At-Tirmidhī and he graded it as weak."
  },
  "takhreej": {
    "arabic": " منكر .‏ رواه الترمذي (346/347)‏ .‏ وهذا الحديث من مناكير زيد بن جبيرة كما قال الساجي ، وكما هو صنيع ابن عدي في \"الكامل\" ، والذهبي في الميزان إذ عدا هذا الحديث من مناكيره ، ومجيء الحديث من طريق آخر لا يشفع لمن صححه ! كالعلامة الشيخ أحمد شاكر ‏-رحمه الله‏- ، إذ هما \"جميعا واهيين\" كما قال أبو حاتم في \"العلل\" (1/148)‏.‏",
    "urdu": "منکر (Munkar)۔ اسے ترمذی (346/347) نے روایت کیا ہے۔ یہ حدیث زید بن جبیرہ کی منکر روایات میں سے ہے جیسا کہ ساجی نے کہا، اور جیسا کہ ابن عدی نے ”الکامل“ میں اور ذہبی نے ”المیزان“ میں کیا ہے، جنہوں نے اس حدیث کو اس کی منکر روایات میں شمار کیا۔ اور اس کا دوسرے طریق سے آنا بھی ان کے لیے کافی نہیں جو اسے صحیح قرار دیتے ہیں، جیسے علامہ شیخ احمد شاکرؒ، کیونکہ وہ دونوں (راوی) ”سخت کمزور“ ہیں جیسا کہ ابو حاتم نے ”العلل“ (1/148) میں کہا ہے۔",
    "english": "Rejected (Munkar). Reported by At-Tirmidhī (346/347). This Hadith is among the rejected narrations of Zayd ibn Jubayrah, as stated by As-Sājī, and as done by Ibn 'Adī in 'Al-Kāmil' and Adh-Dhahabī in 'Al-Mīzān,' who counted this Hadith among his rejected narrations. The presence of another chain does not strengthen the opinion of those who authenticate it, like Shaykh Aḥmad Shākir (RH), as both chains are 'weak/feeble' (Wāhīn), as stated by Abū Ḥātim in 'Al-'Ilal' (1/148).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "سَبْعِ مَوَاطِنَ",
      "english": "Seven places",
      "urdu": "سات جگہیں"
    },
    {
      "arabic": "اَلْمَزْبَلَةِ",
      "english": "The dumping ground/garbage heap",
      "urdu": "کوڑے کا ڈھیر"
    },
    {
      "arabic": "اَلْمَجْزَرَةِ",
      "english": "The slaughterhouse",
      "urdu": "ذبح خانہ"
    },
    {
      "arabic": "اَلْمَقْبَرَةِ",
      "english": "The graveyard",
      "urdu": "قبرستان"
    },
    {
      "arabic": "قَارِعَةِ اَلطَّرِيقِ",
      "english": "The middle of the road",
      "urdu": "شارع عام"
    },
    {
      "arabic": "اَلْحَمَّامِ",
      "english": "The bathhouse",
      "urdu": "حمام"
    },
    {
      "arabic": "مَعَاطِنِ اَلْإِبِلِ",
      "english": "Camel resting areas/enclosures",
      "urdu": "اونٹ باندھنے کی جگہ"
    },
    {
      "arabic": "ظَهْرِ بَيْتِ اَللَّهِ",
      "english": "The roof of the House of Allah (Ka'bah)",
      "urdu": "بیت اللہ کی چھت"
    }
  ],
  "summary": {
    "urdu": "یہ روایت سات ایسے مقامات کو بیان کرتی ہے جہاں نبی اکرم صلی اللہ علیہ وسلم نے نماز پڑھنے سے منع فرمایا ہے۔ ان میں نجاست کی جگہیں (کوڑا کرکٹ، ذبح خانہ، حمام)، شرک کا خوف (قبرستان)، لوگوں کے لیے رکاوٹ (شارع عام)، اور خاص شرعی حکم (اونٹوں کا باڑا، کعبہ کی چھت) شامل ہیں۔ تاہم، محدثین کی تحقیق کے مطابق یہ حدیث منکر (سخت ضعیف) ہے۔",
    "english": "This narration lists seven places where the Prophet (ﷺ) forbade prayer. These include places of impurity (dumping grounds, slaughterhouses, bathhouses), sites related to the fear of Shirk (graveyards), areas that obstruct people (the road), and places with specific legal rulings (camel enclosures, the roof of the Ka'bah). However, according to Hadith scholars, this narration is Rejected (Munkar) due to severe weakness in its chain.",
    "english_alternative": ""
  },
  "references": [
    {
      "arabic": "رواه الترمذي (346)",
      "english": "Reported by At-Tirmidhī (346)"
    },
    {
      "arabic": "حكم الساجي وابن عدي في الكامل",
      "english": "Ruling of As-Sājī and Ibn 'Adī in Al-Kāmil"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn 'Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "منكر/ضعيف جداً",
    "english": "Rejected/Very Weak (Munkar/Ḍa'īf Jiddan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز کی ممانعت کے مقامات کی اقسام",
        "english": "Categories of Prohibited Prayer Places"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نجاست کی وجہ سے ممانعت",
              "english": "Prohibition Due to Impurity (Najāsah)"
            },
            "content": {
              "urdu": [
                "کوڑا کرکٹ کا ڈھیر (مزبلہ) اور ذبح خانہ (مجزرہ) عام طور پر نجاست اور ناپاکی کی جگہیں ہوتی ہیں۔",
                "مسلمان کو ایسی جگہ نماز پڑھنے سے گریز کرنا چاہیے جہاں ظاہری نجاست کی موجودگی کا قوی امکان ہو۔",
                "حمام (غسل خانہ) میں بھی نجاست کے ساتھ ساتھ ستر کا نہ ڈھانپنا بھی ممانعت کا سبب ہے۔"
              ],
              "english": [
                "The dumping ground (Mazbalah) and slaughterhouse (Majzarah) are generally places of impurity and filth.",
                "A Muslim should avoid praying in any place where there is a strong likelihood of external impurity (Najāsah).",
                "The bathhouse (Ḥammām) is prohibited due to impurity as well as the general lack of covering of the 'Awrah."
              ]
            }
          },
          {
            "title": {
              "urdu": "شرک یا رکاوٹ کی وجہ سے ممانعت",
              "english": "Prohibition Due to Shirk or Obstruction"
            },
            "content": {
              "urdu": [
                "قبرستان (مقبرہ) میں نماز شرک کے خوف سے ممنوع ہے، جیسا کہ سابقہ صحیح حدیث میں بھی ہے۔",
                "شارع عام (قارعة الطريق) میں نماز لوگوں کی آمد و رفت میں رکاوٹ ڈالتی ہے اور خشوع کو بھی کم کرتی ہے۔",
                "اونٹ باندھنے کی جگہ (معاطن الابل) میں ممانعت کی وجہ اونٹوں کی مخصوص نجاست یا ان کے شیطانی طبیعت کے خوف سے ہے۔"
              ],
              "english": [
                "Prayer in the graveyard (Maqbarah) is prohibited due to the fear of Shirk, as established in the previous authentic Hadith.",
                "Praying in the middle of the road (Qāri'at aṭ-Ṭarīq) obstructs people's movement and reduces concentration (Khushu').",
                "The prohibition in camel enclosures (Ma'āṭin al-Ibil) is due to their specific impurity or a fear related to their supposed demonic nature."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "کعبہ کی چھت اور ضعفِ حدیث",
        "english": "Ka'bah Roof and Hadith Weakness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کعبہ کی چھت پر نماز",
              "english": "Prayer on the Ka'bah's Roof"
            },
            "content": {
              "urdu": [
                "کعبہ کی چھت پر نماز کی ممانعت کی حکمت یہ ہے کہ یہ کعبہ کے احترام کے خلاف ہے اور قبلہ کی سمت واضح نہیں ہوتی۔",
                "جب نماز کعبہ کے اوپر ہو تو وہ سمت متعین نہیں رہتی، جو نماز کی شرط ہے۔",
                "یہ حکم اس حدیث کی ضعیف ہونے کے باوجود فقہی طور پر درست مانا جاتا ہے۔"
              ],
              "english": [
                "The wisdom behind prohibiting prayer on the Ka'bah's roof is that it violates the sanctity of the Ka'bah and makes the Qiblah direction unclear.",
                "When praying atop the Ka'bah, the defined direction of the Qiblah is compromised, which is a condition for prayer.",
                "This ruling is considered juristically sound despite the weakness of this specific Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "سند کا منکر ہونا",
              "english": "The Narration Being Rejected (Munkar)"
            },
            "content": {
              "urdu": [
                "محدثین (جیسے ترمذی، ذہبی) نے اس حدیث کو ضعیف یا منکر قرار دیا ہے، جس کی وجہ اس کا راوی زید بن جبیرہ ہے۔",
                "منکر روایت کا مطلب ہے کہ یہ صحیح سنت کے خلاف ہے، یا اس میں کوئی سخت ضعف ہے۔",
                "لہٰذا، اس حدیث کے بعض حکم (جیسے حمام اور قبرستان کی ممانعت) کو دوسرے صحیح شواہد کی بنا پر ہی لیا جاتا ہے۔"
              ],
              "english": [
                "Hadith scholars (like At-Tirmidhī, Adh-Dhahabī) ruled this Hadith weak or rejected (Munkar) due to its narrator, Zayd ibn Jubayrah.",
                "A rejected narration implies that it contradicts authentic Sunnah or has severe weakness.",
                "Therefore, some of the rulings in this Hadith (like the prohibition in the bathhouse and graveyard) are only accepted based on other authentic evidence."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور احتیاط",
        "english": "Practical Lesson and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی احتیاط",
              "english": "Legal Precaution"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ ان تمام جگہوں پر نماز پڑھنے سے احتیاط کرے جہاں ناپاکی یا شرک کا خوف ہو۔",
                "اگرچہ یہ روایت ضعیف ہے، مگر اس میں ذکر کردہ اکثر مقامات پر نماز مکروہ یا باطل ہے (دوسرے شواہد کی بنا پر)۔",
                "نبی ﷺ کے حکم کا احترام کرنا اور عبادت کے لیے پاکیزہ جگہ کا انتخاب کرنا ضروری ہے۔"
              ],
              "english": [
                "A Muslim should take precautions by avoiding prayer in all places where there is a risk of impurity or Shirk.",
                "Although this narration is weak, prayer in most of the mentioned places is disliked (Makrūh) or invalid based on other evidences.",
                "It is necessary to respect the Prophet's command and choose a pure place for worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "نجاست اور طہارت",
              "english": "Impurity and Purification"
            },
            "content": {
              "urdu": [
                "نماز کی صحت کے لیے جگہ کا پاک ہونا ضروری ہے، اس لیے نجاست والی جگہوں سے اجتناب کرنا چاہیے۔",
                "قبرستان اور حمام وہ جگہیں ہیں جہاں نماز کی ممانعت کو صحیح احادیث میں بھی مستقل حکم دیا گیا ہے۔",
                "یہ حکم ہمیں سکھاتا ہے کہ طہارت صرف جسم اور لباس تک محدود نہیں بلکہ نماز کی جگہ بھی پاک ہونی چاہیے۔"
              ],
              "english": [
                "The prayer location must be pure for the validity of the prayer, hence places with impurity must be avoided.",
                "Graveyards and bathhouses are places where the prohibition of prayer is confirmed by other authentic Ahadith.",
                "This ruling teaches us that purification is not limited to the body and clothing but must extend to the place of prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
