{
  "hadithId": 177,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["1:4:18"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (رد السلام بالإشارة)",
    "babId": 13
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏-]قَالَ] : { قُلْتُ لِبِلَالٍ : كَيْفَ رَأَيْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-يَرُدَّ عَلَيْهِمْ حِينَ يُسَلِّمُونَ عَلَيْهِ , وَهُوَ يُصَلِّي ? قَالَ : يَقُولُ هَكَذَا , وَبَسَطَ كَفَّهُ } أَخْرَجَهُ أَبُو دَاوُدَ , وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ",
    "urdu": " سیدنا (عبداللہ) ابن عمر رضی اللہ عنہما روایت کرتے ہیں کہ میں نے بلال رضی اللہ عنہ سے دریافت کیا کہ نماز پڑھتے وقت جب لوگ نبی کریم صلی اللہ علیہ وسلم کو سلام کرتے تو آپ صلی اللہ علیہ وسلم ان کو کیسے جواب دیتے؟ انہوں نے جواب دیا کہ اس طرح کرتے اور اپنا ہاتھ پھیلایا۔ اسے ابوداؤد اور ترمذی نے روایت کیا ہے اور ترمذی نے اسے صحیح قرار دیا ہے۔",
    "english": "Narrated Ibn 'Umar (RA): 'I asked Bilāl: 'How did you see the Prophet (ﷺ) respond to them when they greeted him with Salām while he was praying?' He said: 'He would say so [respond] like this,' and he spread his palm.' Reported by Abu Dawud and At-Tirmidhī, and At-Tirmidhī graded it as Ṣaḥīḥ (authentic)."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه أبو داود (927)‏ ، والترمذي (368)‏ ، وقال الترمذي : \"حسن صحيح\" .‏ قلت : ولفظه : \"كان يشير بيده \" .‏",
    "urdu": "صحیح۔ اسے ابو داؤد (927) اور ترمذی (368) نے روایت کیا ہے، اور ترمذی نے کہا: ”حسن صحیح۔“ میں (حافظ ابن حجر) کہتا ہوں: اور اس کا لفظ ہے: ”آپ ہاتھ سے اشارہ کیا کرتے تھے۔“",
    "english": "Authentic (Ṣaḥīḥ). Reported by Abu Dawud (927) and At-Tirmidhī (368), who said: 'Ḥasan Ṣaḥīḥ (Good and Authentic).' I say: The wording of the narration is: 'He used to gesture with his hand.'",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "يَرُدَّ عَلَيْهِمْ",
      "english": "He would respond to them",
      "urdu": "آپ انہیں جواب دیتے"
    },
    {
      "arabic": "حِينَ يُسَلِّمُونَ عَلَيْهِ",
      "english": "When they greet him with Salām",
      "urdu": "جب لوگ آپ کو سلام کرتے"
    },
    {
      "arabic": "وَهُوَ يُصَلِّي",
      "english": "While he was praying",
      "urdu": "اور آپ نماز پڑھ رہے ہوتے"
    },
    {
      "arabic": "يَقُولُ هَكَذَا",
      "english": "He would say so [respond] like this",
      "urdu": "وہ اس طرح کرتے"
    },
    {
      "arabic": "وَبَسَطَ كَفَّهُ",
      "english": "And he spread his palm",
      "urdu": "اور انہوں نے اپنا ہاتھ پھیلایا"
    },
    {
      "arabic": "يُشِيرُ بِيَدِهِ",
      "english": "He would gesture with his hand",
      "urdu": "ہاتھ سے اشارہ کرتے تھے"
    },
    {
      "arabic": "اَلْإِشَارَةُ",
      "english": "The gesture/signal",
      "urdu": "اشارہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں کسی کو سلام کا جواب دینے کا صحیح طریقہ بیان کرتی ہے: نبی اکرم صلی اللہ علیہ وسلم دورانِ نماز سلام کا جواب ہاتھ کے اشارے سے دیتے تھے (جیسا کہ بلالؓ نے ہتھیلی پھیلا کر بتایا)۔ یہ عمل نماز میں خاموش رہنے کے حکم کی روشنی میں، غیر کلامی اشارے کے ذریعے ضرورت کو پورا کرنے کی اجازت دیتا ہے۔",
    "english": "This Hadith clarifies the correct method for responding to a salutation during prayer: The Prophet (ﷺ) would respond to the Salām with a gesture of his hand while praying (as demonstrated by Bilāl by spreading his palm). This action permits fulfilling a necessity through a non-verbal signal, consistent with the prohibition of speech during prayer."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (927)",
      "english": "Reported by Abu Dawud (927)"
    },
    {
      "arabic": "رواه الترمذي (368)",
      "english": "Reported by At-Tirmidhī (368)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn 'Umar"
      },
      "slug": "abdullah-ibn-umar"
    },
    {
      "id": 2,
      "name": {
        "arabic": "بلال بن رباح",
        "english": "Bilāl ibn Rabāḥ"
      },
      "slug": "bilal-ibn-rabah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں سلام کا جواب",
        "english": "Responding to Salām in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اشارے کا جواز",
              "english": "Permissibility of Gesturing"
            },
            "content": {
              "urdu": [
                "نماز میں سلام کا جواب کلام کے ذریعے دینا ممنوع ہے، کیونکہ یہ نماز کو باطل کر دیتا ہے۔",
                "صحیح سنت یہ ہے کہ سلام کا جواب ہاتھ یا سر کے اشارے سے دیا جائے، جو اس حدیث سے ثابت ہے۔",
                "نبی ﷺ کا اشارے سے جواب دینا اس بات کی دلیل ہے کہ نماز میں اشارہ کرنا کلامِ ناس میں شامل نہیں۔"
              ],
              "english": [
                "Responding to Salām verbally during prayer is forbidden as it nullifies the prayer.",
                "The authentic Sunnah is to return the greeting with a gesture of the hand or head, as proven by this Hadith.",
                "The Prophet's (ﷺ) act of responding with a gesture shows that signaling is not considered ordinary human speech in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "جواب کی کیفیت",
              "english": "The Manner of Response"
            },
            "content": {
              "urdu": [
                "بلالؓ نے نبی ﷺ کے جواب دینے کے طریقے کو ہتھیلی پھیلا کر یا ہاتھ سے اشارہ کر کے واضح کیا۔",
                "فقہاء کے نزدیک، ہاتھ سے اشارہ کرنا کافی ہے، لیکن اس میں زیادہ حرکت نہیں ہونی چاہیے جو نماز کو لغو کرے۔",
                "جو شخص نماز میں سلام کرے تو اس کا سلام مکروہ ہے، مگر سلام کرنے والے کو بھی اشارے سے جواب دینا ضروری ہے۔"
              ],
              "english": [
                "Bilāl (RA) clarified the Prophet's method of response by spreading his palm or gesturing with his hand.",
                "According to jurists, gesturing with the hand is sufficient, but it should not involve excessive movement that makes the prayer vain (Laghw).",
                "It is disliked (Makrūh) for a person to offer Salām during prayer, but the praying person must still respond with a gesture."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور فقہی فوائد",
        "english": "Educational and Juristic Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابن عمرؓ کا حصول علم",
              "english": "Ibn 'Umar's Quest for Knowledge"
            },
            "content": {
              "urdu": [
                "عبداللہ بن عمرؓ کا بلالؓ سے یہ اہم سوال کرنا علم حدیث کی ترسیل کے شوق کو ظاہر کرتا ہے۔",
                "صحابہ کرامؓ چھوٹی چھوٹی سنتوں کو بھی عملی طور پر محفوظ رکھنے کی کوشش کرتے تھے۔",
                "یہ طریقہ سکھاتا ہے کہ جب براہ راست نبی ﷺ سے سوال کرنا مشکل ہو تو آپ کے قریب ترین صحابی سے معلومات لی جائیں۔"
              ],
              "english": [
                "Ibn 'Umar's pertinent question to Bilāl (RA) demonstrates the eagerness to transmit Hadith knowledge.",
                "The Companions (RA) strove to preserve even the smallest Sunnah practices practically.",
                "This method teaches that when questioning the Prophet (ﷺ) directly is difficult, information should be sought from his closest Companions."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان اور نماز میں بلالؓ کا کردار",
              "english": "Bilāl's Role in Adhān and Prayer"
            },
            "content": {
              "urdu": [
                "بلالؓ اذان کے معاملات کے ساتھ ساتھ نماز کے عملی احکام کے بھی راوی ہیں، جو ان کے مقام کو ظاہر کرتا ہے۔",
                "ان کا 'یقول هكذا' (وہ اس طرح کرتے) کہنا اشارے کی عملی وضاحت ہے جو شرعی احکام کو یقینی بناتی ہے۔",
                "یہ حکم نماز کے دوران دوسروں کی طرف توجہ دینے کے ساتھ ساتھ اللہ کی طرف مکمل توجہ کو برقرار رکھنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "Bilāl (RA) is a narrator of practical prayer rulings alongside Adhān matters, which shows his esteemed status.",
                "His saying 'He would say so [respond] like this' is a practical demonstration of the gesture, ensuring the correct understanding of the ruling.",
                "This ruling teaches attentiveness to others during prayer while maintaining full focus on Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
