{
  "hadithId": 176,
  "hadithNo": 17,
  "hadithReferences": {
    "sunnah.com": ["1:4:17"],
    "kitabId": 2,
    "inKitabBab": 3,
    "arabicBook": "كتاب صفة الصلاة (الإعلام في الصلاة)",
    "babId": 13
  },
  "name": {
    "arabic": "وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ : { كَانَ لِي مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مَدْخَلَانِ , فَكُنْتُ إِذَا أَتَيْتُهُ وَهُوَ يُصَلِّي تَنَحْنَحَ لِي } رَوَاهُ النَّسَائِيُّ , وَابْنُ مَاجَهْ .‏ ",
    "urdu": "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کے میرے دو اوقات تھے جب میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوتا اور آپ صلی اللہ علیہ وسلم نماز ادا فرما رہے ہوتے تو مجھے مطلع کرنے کے لیے کھنکار دیتے۔ (نسائی، ابن ماجہ) ",
    "english": "Narrated 'Alī (RA): 'I had two entry times (Madkhalān) with the Messenger of Allah (ﷺ). Whenever I came to him while he was praying, he would clear his throat (tanaḥnaḥa lī) for me (as a signal).' Reported by An-Nasā'ī and Ibn Mājah."
  },
  "takhreej": {
    "arabic": " ضعيف .‏ بهذا اللفظ ، حسن بلفظ \"سبح\" بدل \"تنحنح\" .‏ وقد فصّلت القول فيه في تخريجي \"لمشكل الآثار \" للطحاوي ، الحديث الأول من المجلد الخامس .‏ ثم طبع المشكل بعد تشويه العمل باتفاق لصين كبيرين ؛ أحدهما الناشر والثاني شاهد ومراجع كما تشهد بذلك خطوطهما التي بحوزتي، وعما قريب سيعرف الناس حقيقة الأمر.‏ وإلى الله المشتكى.‏",
    "urdu": "ضعیف۔ اس لفظ کے ساتھ، البتہ ”تنحنح“ (کھنکارنا) کی جگہ ”سبح“ (تسبیح کہنا) کے لفظ کے ساتھ حسن ہے۔ میں نے اس کی تفصیل ”مشکل الآثار“ للطحاوی کی تخریج میں بیان کی ہے، جلد پنجم کی پہلی حدیث میں۔ پھر (افسوس کہ) یہ کتاب دو بڑے چوروں کے اتفاق سے کام کو بگاڑ کر شائع کی گئی؛ ایک ناشر اور دوسرا گواہ اور مراجع، جیسا کہ ان دونوں کی میرے پاس موجود تحریریں گواہی دیتی ہیں، اور عنقریب لوگ حقیقت جان لیں گے۔ اور اللہ ہی سے شکایت ہے۔",
    "english": "Weak (Ḍa'īf). With this specific wording (tanaḥnaḥa), but it is Ḥasan (good) with the wording 'sabbaḥa' (said Subḥānallāh) instead of 'tanaḥnaḥa' (cleared his throat). I detailed the discussion on this Hadith in my Takhrij (verification) of 'Mushkil Al-Āthār' by At-Ṭaḥāwī, the first Hadith of the fifth volume. Then the 'Mushkil' was published after distortion of the work by agreement between two great thieves; one the publisher and the other a witness and reviewer, as evidenced by their handwriting in my possession. Soon people will know the truth of the matter. And Allah is the one whose help is sought.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "مَدْخَلَانِ",
      "english": "Two entry times",
      "urdu": "حاضری کے دو اوقات"
    },
    {
      "arabic": "يُصَلِّي",
      "english": "He was praying",
      "urdu": "وہ نماز ادا فرما رہے ہوتے"
    },
    {
      "arabic": "تَنَحْنَحَ لِي",
      "english": "He cleared his throat for me",
      "urdu": "وہ میرے لیے کھنکار دیت"
    },
    {
      "arabic": "تَسْبِيح",
      "english": "Tasbīḥ (saying Subḥānallāh)",
      "urdu": "تسبیح"
    },
    {
      "arabic": "اَلْإِعْلَامُ",
      "english": "Notifying/signaling",
      "urdu": "مطلع کرنا"
    },
    {
      "arabic": "ضَعِيف",
      "english": "Weak",
      "urdu": "ضعیف"
    },
    {
      "arabic": "حَسَن",
      "english": "Good (in quality)",
      "urdu": "حسن"
    }
  ],
  "summary": {
    "urdu": "یہ روایت بیان کرتی ہے کہ سیدنا علی رضی اللہ عنہ جب کسی خاص وقت میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوتے اور آپ ﷺ نماز میں ہوتے تو آپ ﷺ انہیں اپنی موجودگی کی اطلاع دینے کے لیے کھنکار دیتے تھے۔ محدثین کے نزدیک کھنکارنے (تنحنح) کا لفظ ضعیف ہے، جبکہ تسبیح کہنے («سبح») کا لفظ صحیح اور معمول بہ ہے۔ یہ عمل امام کے لیے نماز میں کسی ضرورت کے وقت اشارے سے مطلع کرنے کی اجازت دیتا ہے۔",
    "english": "This narration states that when 'Alī (RA) visited the Prophet (ﷺ) at certain times and found him praying, the Prophet (ﷺ) would clear his throat to signal his presence. According to Hadith scholars, the wording 'cleared his throat' (Tanaḥnaḥa) is weak, but the authentic version uses the word 'sabbaḥa' (said Subḥānallāh). This act permits the Imām to communicate a necessary signal during prayer through a sanctioned action."
  },
  "references": [
    {
      "arabic": "رواه النسائي (3/16)",
      "english": "Reported by An-Nasā'ī (3/16)"
    },
    {
      "arabic": "رواه ابن ماجه (1016)",
      "english": "Reported by Ibn Mājah (1016)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "علي بن أبي طالب",
        "english": "Alī ibn Abī Ṭālib"
      },
      "slug": "ali-ibn-abi-talib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "ضعيف (بلفظ تنحنح)، حسن (بلفظ سبح)",
    "english": "Weak (with Tanaḥnaḥa), Good (with Sabbaḥa)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز میں غیر کلامی اشارہ",
        "english": "Non-Verbal Signaling in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تنحنح (کھنکارنا) کا حکم",
              "english": "Ruling on Clearing the Throat (Tanaḥnuḥ)"
            },
            "content": {
              "urdu": [
                "اس حدیث میں موجود لفظ 'تنحنح' (کھنکارنا) محدثین کے نزدیک ضعیف ہے اور اسے نماز میں لغو (فضول) کلام شمار کیا گیا ہے۔",
                "صحیح سنت یہ ہے کہ مرد تسبیح («سبحان اللہ») کہہ کر، اور عورتیں تالی بجا کر (تصفیق) مطلع کریں۔",
                "کھنکارنا اگرچہ غیر انسانی گفتگو نہیں، لیکن یہ نماز کے اندر اللہ کے ذکر کی مشروعیت کے خلاف ہے۔"
              ],
              "english": [
                "The word 'Tanaḥnaḥa' (clearing the throat) in this Hadith is ruled weak by scholars and considered vain speech (Laghw) in prayer.",
                "The authentic Sunnah is for men to signal by Tasbīḥ ('Subḥānallāh') and women by clapping (Taṣfīq).",
                "Clearing the throat, though not human speech, goes against the principle of prescribed remembrance of Allah within the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "تسبیح کا صحیح طریقہ",
              "english": "The Correct Method of Tasbīḥ"
            },
            "content": {
              "urdu": [
                "دوسری صحیح روایات میں نبی ﷺ کا نماز میں تسبیح کے ذریعے مطلع کرنا ثابت ہے (حسن بلفظ سبح)۔",
                "تسبیح چونکہ ذکرِ الٰہی ہے، لہٰذا یہ نماز کی عبادت کو باطل نہیں کرتی اور اشارے کی جگہ درست ہے۔",
                "یہ حکم امام کو غلطی پر، یا علیؓ کے واقعے کی طرح، ضرورت کے تحت اجازت مانگنے کے لیے جائز ہے۔"
              ],
              "english": [
                "In other authentic narrations, the Prophet (ﷺ) signaling through Tasbīḥ ('Sabbaḥa') is confirmed (Ḥasan with the word Sabbaḥa).",
                "Since Tasbīḥ is the remembrance of Allah, it does not nullify the worship and is a valid substitute for signaling.",
                "This ruling permits using Tasbīḥ to correct the Imām or, as in 'Alī's case, to seek permission out of necessity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل میں تحقیق کی اہمیت",
        "english": "Importance of Research in Juristic Issues"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ضعیف اور حسن میں فرق",
              "english": "Difference Between Weak and Good (Ḥasan)"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر کا ضعیف اور حسن کے درمیان فرق کرنا علم حدیث کی تنقیدی نوعیت کو ظاہر کرتا ہے۔",
                "اس حدیث کے متن میں راوی کی غلطی (وہم) کے باعث 'تنحنح' کا لفظ داخل ہو گیا تھا۔",
                "جب کسی حدیث کے مختلف الفاظ ہوں، تو محدثین اصولوں کے تحت صحیح الفاظ کو ترجیح دیتے ہیں۔"
              ],
              "english": [
                "Al-Ḥāfiẓ Ibn Ḥajar's distinction between the weak and Ḥasan forms demonstrates the critical nature of Hadith scholarship.",
                "The word 'Tanaḥnaḥa' was inserted due to a narrator's error (wahm) in the text of the Hadith.",
                "When there are different wordings for a single Hadith, scholars prioritize the authentic wording based on established rules."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کے اندر اشارہ",
              "english": "Signaling Within the Prayer"
            },
            "content": {
              "urdu": [
                "فقہاء نے ضرورت کے وقت نماز میں اشارے سے بات کرنے کی اجازت دی ہے، لیکن یہ گفتگو کے زمرے میں نہیں آتا۔",
                "علیؓ کا واقعہ بتاتا ہے کہ نبی ﷺ نے انہیں اشارے سے اپنی نماز میں ہونے کا مطلع کر دیا۔",
                "تسبیح یا اشارے سے مطلع کرنا نماز کے نظم و ضبط کو برقرار رکھتا ہے۔"
              ],
              "english": [
                "Jurists permit communicating through gestures during prayer when necessary, provided it does not constitute ordinary speech.",
                "'Alī's incident shows the Prophet (ﷺ) signaled his state of prayer through a non-verbal cue.",
                "Signaling through Tasbīḥ or gestures maintains the discipline of the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی آداب اور لزوم",
        "english": "Practical Manners and Necessity"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی مصروفیت",
              "english": "The Prophet's Preoccupation"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا نماز میں ہوتے ہوئے بھی حاضر ہونے والے کو مطلع کرنا آپ کی شفقت اور ذمہ داری کو ظاہر کرتا ہے۔",
                "یہ ہمیں سکھاتا ہے کہ اگرچہ عبادت میں ہوں، لیکن مہمان یا حاضر ہونے والے کے ادب کا خیال رکھا جائے۔",
                "علیؓ کو دو اوقات مقرر تھے، جو اس بات کی دلیل ہے کہ آپ ﷺ لوگوں کے ساتھ تعلقات میں بھی نظم و ضبط رکھتے تھے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of signaling to the visitor even while praying shows his compassion and sense of responsibility.",
                "It teaches us to observe the etiquette of a guest or visitor, even when engaged in worship.",
                "'Alī having two fixed times for visiting proves the Prophet's (ﷺ) discipline even in personal interactions."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Adhering to the Sunnah"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ نماز میں اشارے یا تسبیح کا استعمال صرف سنتِ صحیحہ کے مطابق ہی کرے، نہ کہ کمزور روایات کی بنیاد پر۔",
                "کھنکارنا نماز میں مکروہ ہے اور اس سے بچنا چاہیے، تاکہ نماز کے تقدس پر کوئی فرق نہ پڑے۔",
                "یہ حدیث علم حدیث کی دقت اور اس کے اصولوں کی پیروی کی اہمیت کو بھی اجاگر کرتی ہے۔"
              ],
              "english": [
                "A Muslim should only use gestures or Tasbīḥ in prayer according to the authentic Sunnah, not based on weak narrations.",
                "Clearing the throat is disliked (Makrūh) in prayer and should be avoided to maintain its sanctity.",
                "This Hadith also highlights the importance of precision in Hadith scholarship and adhering to its principles."
              ]
            }
          }
        ]
      }
    }
  ]
}
