{
  "hadithId": 3,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [""],
    "inKitab": 1,
    "inKitabBab": 1,
    "arabicBook": "",
    "chapterId": 1
  },

  "takhreej": {
    "arabic": "ضعيف. رواه ابن ماجه (521) من طريق رشدين بن سعد، حدثنا معاوية بن صالح، عن راشد بن سعد، عن أبي إمامة به. وهو ضعيف؛ لضعف رشدين، وقد اضطرب أيضا في إسناده. ورواه البيهقي في السنن الكبرى (159-260) من حديث أبي أمامة أيضا، وفي إسناده بقية بن الوليد، وهو مدلس وقد عنعن.",
    "urdu": "یہ حدیث ضعیف ہے۔ اسے ابن ماجہ (521) نے روایت کیا ہے اور اس کی سند میں رشدین بن سعد ضعیف راوی ہے۔ نیز سند میں اختلاف بھی پایا گیا ہے۔ امام بیہقی نے بھی اسے السنن الکبریٰ (159-260) میں روایت کیا ہے، لیکن اس کی سند میں بقية بن الولید ہیں جو مدلس ہیں۔",
    "english": "This Hadith is weak. Reported by Ibn Majah (521) through Rashdin ibn Sa‘d, who is weak and has inconsistencies in the chain. Also reported by Al-Bayhaqi in Al-Sunan Al-Kubra (159–260) with Baqiyyah ibn al-Walid, who was a mudallis (one who conceals his source)."
  },
  "importantWords": [
    {
      "arabic": "يُنَجِّسُهُ",
      "english": "make impure or defile",
      "urdu": "ناپاک کرنا"
    },
    {
      "arabic": "غَلَبَ",
      "english": "overcome, dominate",
      "urdu": "غالب آنا"
    },
    {
      "arabic": "طَاهِرٌ",
      "english": "pure, clean",
      "urdu": "پاک"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ پانی اپنی اصل حالت میں پاک ہوتا ہے۔ صرف وہی چیز اسے ناپاک بناتی ہے جو اس کی بو، ذائقہ یا رنگ کو بدل دے۔",
    "english": "This Hadith explains that water remains pure in its natural state. It only becomes impure if impurity changes its smell, taste, or color."
  },
  "references": [
    {
      "arabic": "ابن ماجه (521)",
      "english": "Ibn Majah (521)"
    },
    {
      "arabic": "البيهقي (159–260)",
      "english": "Al-Bayhaqi (159–260)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو أمامة الباهلي",
        "english": "Abu Umamah al-Bahili"
      },
      "slug": "abu-umamah-al-bahili"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=KJHq1vQzT6M",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Da‘eef)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "پانی کی اصل حالت",
        "english": "The Original Purity of Water"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی فطری طور پر پاک ہے",
              "english": "Water is naturally pure"
            },
            "content": {
              "urdu": [
                "پانی اللہ تعالیٰ کی بنائی ہوئی چیز ہے۔",
                "شریعت میں پانی کو پاک مانا گیا ہے جب تک کہ کوئی ناپاکی ظاہر نہ ہو۔",
                "یہ اصول طہارت کا بنیادی قاعدہ ہے۔"
              ],
              "english": [
                "Water is a creation of Allah and inherently pure.",
                "In Shariah, water is considered pure unless impurity becomes apparent.",
                "This is a fundamental rule of purification."
              ]
            }
          },
          {
            "title": {
              "urdu": "ناپاکی کے آثار",
              "english": "Signs of Impurity"
            },
            "content": {
              "urdu": [
                "پانی کی رنگت، بو یا ذائقہ اگر بدل جائے تو وہ ناپاک سمجھا جائے گا۔",
                "یہ تبدیلی ناپاک چیز کے اثر سے ہو۔",
                "اگر پانی میں یہ اثرات نہ ہوں تو وہ پاک ہی رہے گا۔"
              ],
              "english": [
                "If water’s color, smell, or taste changes, it is considered impure.",
                "The change must be due to impurity.",
                "If none of these changes occur, the water remains pure."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی قاعدہ",
        "english": "Fiqh Principle Derived"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانی میں فرق",
              "english": "Difference in Water Types"
            },
            "content": {
              "urdu": [
                "پاک پانی عبادت کے لیے قابلِ استعمال ہے۔",
                "اگر ناپاکی سے صرف گمان ہو اور کوئی اثر ظاہر نہ ہو تو پانی پاک رہتا ہے۔",
                "علمائے کرام نے اس قاعدے کو اجماع کے طور پر تسلیم کیا۔"
              ],
              "english": [
                "Pure water is suitable for worship.",
                "If impurity is suspected but no change is visible, water remains pure.",
                "Scholars have agreed upon this principle."
              ]
            }
          },
          {
            "title": {
              "urdu": "کم اور زیادہ پانی",
              "english": "Small and Large Quantity of Water"
            },
            "content": {
              "urdu": [
                "چھوٹے برتن میں ناپاکی گرے تو زیادہ امکان ہے کہ وہ ناپاک ہو جائے۔",
                "زیادہ پانی میں ناپاکی اثر نہ کرے تو وہ پاک رہتا ہے۔",
                "یہ فرق فقہاء نے حدیثوں سے اخذ کیا ہے۔"
              ],
              "english": [
                "If impurity falls into a small container, it likely becomes impure.",
                "If impurity does not affect large water bodies, they remain pure.",
                "This distinction is derived from Fiqh interpretations."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علمی درجہ بندی",
        "english": "Scholarly Classification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حدیث کی سند",
              "english": "The Chain of Transmission"
            },
            "content": {
              "urdu": [
                "اس روایت کی سند میں رشدین بن سعد ضعیف ہے۔",
                "اسی وجہ سے محدثین نے اسے ضعیف قرار دیا۔",
                "بیہقی نے بھی اسے سند کے ساتھ ذکر کیا لیکن اس میں مدلس راوی ہیں۔"
              ],
              "english": [
                "Rashdin ibn Sa‘d in the chain is weak.",
                "Hence, scholars classified it as weak.",
                "Al-Bayhaqi also reported it, but the chain includes a mudallis narrator."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملی اعتبار سے مفید",
              "english": "Practical Use Despite Weakness"
            },
            "content": {
              "urdu": [
                "فقہاء نے اسے طہارت کے اصول میں دلیل کے طور پر لیا۔",
                "چونکہ معنی صحیح ہے، اس لیے فقہی طور پر قابلِ استدلال مانا گیا۔",
                "یہ حدیث ضعیف ہونے کے باوجود اجماع کے موافق ہے۔"
              ],
              "english": [
                "Jurists accepted it for legal principles of purification.",
                "Although weak, its meaning is sound and consistent with Shariah.",
                "It aligns with scholarly consensus despite its weakness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی پیغام",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وسوسے سے بچنا",
              "english": "Avoiding Doubts"
            },
            "content": {
              "urdu": [
                "صرف شک یا وسوسے پر پانی کو ناپاک نہ سمجھا جائے۔",
                "اسلام اعتدال اور یقین پر زور دیتا ہے۔",
                "جہاں تک ممکن ہو پاکی کا یقین قائم رکھا جائے۔"
              ],
              "english": [
                "Do not consider water impure based on mere doubt.",
                "Islam emphasizes balance and certainty.",
                "Maintain assumption of purity unless clear evidence exists."
              ]
            }
          },
          {
            "title": {
              "urdu": "صفائی اور طہارت",
              "english": "Cleanliness and Purification"
            },
            "content": {
              "urdu": [
                "صفائی اسلام کا اہم جزو ہے۔",
                "پانی اللہ کی نعمت ہے جو پاکیزگی کا ذریعہ ہے۔",
                "اسے ضائع کیے بغیر طہارت کے لیے استعمال کریں۔"
              ],
              "english": [
                "Cleanliness is a core part of Islam.",
                "Water is a blessing from Allah used for purification.",
                "Use it wisely without waste while maintaining purity."
              ]
            }
          }
        ]
      }
    }
  ]
}
