{
  "hadithId": 193,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["2", "5"],
    "kitabId": 2,
    "inKitabBab": 5,
    "arabicBook": "كتاب الصلاة",
    "babId": 15
  },
  "name": {
    "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { لَيَنْتَهِيَنَّ قَوْمٌ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى اَلسَّمَاءِ فِي اَلصَّلَاةِ أَوْ لَا تَرْجِعَ إِلَيْهِمْ } رَوَاهُ مُسْلِمٌ . وَلَهُ : عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- يَقُولُ : { لَا صَلَاةَ بِحَضْرَةِ طَعَامٍ , وَلَا هُوَ يُدَافِعُهُ الْأَخْبَثَانِ }",
    "urdu": " سیدنا جابر بن سمرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” مسلمان قوم نماز میں اپنی نظریں آسمان کی جانب اٹھانے سے باز آ جائے ورنہ ایسا نہ ہو کہ پھر ان کی نظریں واپس ہی نہ آئیں (یعنی نابینا ہو جائیں)۔ “ (مسلم) اور مسلم ہی میں سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ ” جب کھانا حاضر ہو اور قضائے حاجت پیش ہو تو نماز نہیں ہوتی۔ “",
    "english": "Narrated from Jabir ibn Samurah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"Let those people cease raising their eyes towards the sky in prayer, or their eyesight will not return to them (i.e., they will lose their sight).\" Reported by Muslim. And also reported by Muslim from 'Aishah (may Allah be pleased with her) who said: I heard the Messenger of Allah (peace and blessings be upon him) saying: \"There is no prayer in the presence of food, nor (is there a prayer) when one is resisting the two evils (Al-Akhbathan).\""
  },
  "takhreej": {
    "arabic": "صحيح. رواية جابر رواها مسلم (428). ورواية عائشة رواها مسلم (560). والأخبثان هما: البول والغائط.",
    "urdu": "پہلی روایت سیدنا جابر بن سمرہ سے صحیح ہے اور اسے مسلم (428) نے روایت کیا ہے۔ دوسری روایت سیدہ عائشہ رضی اللہ عنہا سے صحیح ہے اور اسے مسلم (560) نے روایت کیا ہے۔ الاخبثان سے مراد پیشاب اور پاخانہ ہے۔",
    "english": "Authentic (Sahih). The narration of Jabir is reported by Muslim (428). The narration of 'Aishah is reported by Muslim (560). Al-Akhbathan refers to urine and feces."
  },
  "importantWords": [
    {
      "arabic": "يرفعون أبصارهم",
      "english": "Raising their eyes",
      "urdu": "اپنی نگاہیں اٹھاتے ہیں"
    },
    {
      "arabic": "السماء",
      "english": "The sky/heaven",
      "urdu": "آسمان"
    },
    {
      "arabic": "لا ترجع إليهم",
      "english": "Will not return to them",
      "urdu": "واپس نہ آئے گی"
    },
    {
      "arabic": "بحضرة طعام",
      "english": "In the presence of food",
      "urdu": "کھانا حاضر ہونے کی حالت میں"
    },
    {
      "arabic": "يدافعه",
      "english": "Resisting/holding back",
      "urdu": "دبا رہا ہو/روک رہا ہو"
    },
    {
      "arabic": "الأخبثان",
      "english": "The two evils (urine & feces)",
      "urdu": "دو خبیث چیزیں (پیشاب و پاخانہ)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں خشوع کی اہمیت پر دو اہم اصول بیان کرتی ہے: اول، نمازی کو اپنی نظریں آسمان کی طرف اٹھانے سے سخت منع کیا گیا ہے کیونکہ یہ شدید بے ادبی اور خطرناک وعید کا سبب ہے۔ دوم، ایسے تمام عوامل (جیسے تیار کھانا یا شدید حاجت) کو دور کرنا چاہیے جو دل کی یکسوئی میں خلل پیدا کریں، کیونکہ ان حالات میں نماز کامل نہیں ہوتی۔",
    "english": "This Hadith sets forth two vital principles for Khushu' (concentration) in prayer: First, it severely prohibits the worshipper from raising their gaze towards the sky, deeming it highly disrespectful and carrying a grave warning. Second, it mandates removing all factors (like prepared food or intense need to relieve oneself) that distract the heart, as the prayer is incomplete under these conditions."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الصلاة، باب النهي عن رفع البصر إلى السماء في الصلاة (428)",
      "english": "Sahih Muslim, Book of Prayer, Chapter: Prohibition of raising the eyes towards the sky in prayer (428)"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساجد ومواضع الصلاة، باب كراهة الصلاة بحضرة طعام يشتهيه (560)",
      "english": "Sahih Muslim, Book of Masajid and Places of Prayer, Chapter: Dislike of praying in the presence of desired food (560)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جابر بن سمرة",
        "english": "Jabir ibn Samurah"
      },
      "slug": "jabir-ibn-samurah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A8vH9t_1yUo",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آسمان کی طرف نگاہ اٹھانے کی ممانعت",
        "english": "Prohibition of Looking Upwards"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شدید تنبیہ اور وعید",
              "english": "Severe Admonition and Warning"
            },
            "content": {
              "urdu": [
                "نماز میں آسمان کی طرف نگاہ اٹھانا سخت مکروہ اور حرام فعل ہے جس پر شدید وعید آئی ہے۔",
                "وعید یہ ہے کہ ان کی نظریں چھین لی جائیں گی، جس سے اس عمل کی سنگینی واضح ہوتی ہے۔",
                "نماز کی حالت میں نگاہ سجدہ کی جگہ پر مرکوز رکھنی چاہیے، جو ادب اور خشوع کا تقاضا ہے۔"
              ],
              "english": [
                "Raising the gaze towards the sky in prayer is severely disliked and a forbidden act carrying a grave warning.",
                "The warning is that their eyesight might be snatched away, which highlights the seriousness of this action.",
                "The gaze should remain focused on the place of prostration during prayer, fulfilling the requirements of respect and concentration (Khushu')."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت میں بے ادبی",
              "english": "Disrespect in Worship"
            },
            "content": {
              "urdu": [
                "جب بندہ نماز میں ہوتا ہے تو وہ اللہ سے مناجات کر رہا ہوتا ہے اور اللہ کی رحمت اس کے سامنے ہوتی ہے۔",
                "ایسی حالت میں آسمان کی طرف دیکھنا دراصل اللہ کے حضور توجہ ہٹانے کے مترادف ہے۔",
                "اس ممانعت کا مقصد نمازی کو جسمانی اور قلبی طور پر کامل اطمینان اور آداب کی حالت میں رکھنا ہے۔"
              ],
              "english": [
                "When a worshipper is in prayer, they are intimately conversing with Allah, and Allah's Mercy is focused on them.",
                "Looking towards the sky in this state is tantamount to diverting attention from Allah's presence.",
                "The purpose of this prohibition is to keep the worshipper in a state of complete physical and heartfelt respect and stillness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خشوع کے موانع اور ان کا ازالہ",
        "english": "Obstacles to Khushu' and their Removal"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کھانے کی موجودگی",
              "english": "Presence of Food"
            },
            "content": {
              "urdu": [
                "اگر کھانا حاضر ہو اور نمازی کو بھوک لگی ہو تو پہلے کھانا کھا لینا چاہیے، پھر نماز ادا کی جائے۔",
                "کھانے کی طرف توجہ اور دل میں اس کا خیال نماز میں مکمل خشوع قائم نہیں ہونے دیتا۔",
                "یہ اصول اس بات پر دلالت کرتا ہے کہ اسلام میں نماز کی کامل حالت کو ہر چیز پر فوقیت دی گئی ہے۔"
              ],
              "english": [
                "If food is served and the worshipper is hungry, they should eat first, then perform the prayer.",
                "Attention and thought about the food prevent the establishment of complete concentration in prayer.",
                "This principle indicates that Islam prioritizes the perfect state of prayer above all else."
              ]
            }
          },
          {
            "title": {
              "urdu": "قضائے حاجت کا دباؤ (الاخبثان)",
              "english": "Pressure of Necessity (Al-Akhbathan)"
            },
            "content": {
              "urdu": [
                "پیشاب یا پاخانہ کا شدید دباؤ محسوس ہونے پر نماز ادا کرنا مکروہ تحریمی ہے۔",
                "شدید حاجت کی حالت میں دل کی تمام توجہ حاجت کی طرف رہتی ہے، جس سے خشوع ختم ہو جاتا ہے۔",
                "ایسی صورت میں پہلے حاجت سے فارغ ہونا چاہیے، پھر سکون سے وضو کر کے نماز ادا کرنی چاہیے۔"
              ],
              "english": [
                "Praying while severely needing to urinate or defecate (Al-Akhbathan) is considered Makruh Tahrimi (severely disliked).",
                "In a state of severe need, all attention remains focused on the need, thus destroying concentration.",
                "In such a situation, one should first relieve themselves, then perform Wudu (ablution) and pray with peace."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور طبی فوائد",
        "english": "Juristic and Medical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی صحت اور کمال",
              "english": "Validity and Perfection of Prayer"
            },
            "content": {
              "urdu": [
                "اگرچہ مذکورہ صورتوں میں نماز باطل نہیں ہوتی، مگر اس کا ثواب اور کمال ختم ہو جاتا ہے۔",
                "نماز کی صحت سے زیادہ اس کے قبول اور خشوع کی حالت میں ہونے کی اہمیت ہے۔",
                "یہ احادیث ہمیں نماز کو محض جسمانی حرکات کے بجائے روحانی اور قلبی عبادت سمجھنے کی ترغیب دیتی ہیں۔"
              ],
              "english": [
                "Although the prayer is not invalidated in the mentioned situations, its reward and perfection are lost.",
                "The perfection and acceptance of prayer in a state of Khushu' is more important than its mere validity.",
                "These Hadiths encourage us to view prayer as a spiritual and heartfelt worship, not just physical movements."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبی اور نفسیاتی آرام",
              "english": "Medical and Psychological Comfort"
            },
            "content": {
              "urdu": [
                "شدید حاجت کو روکے رکھنے سے نہ صرف خشوع ختم ہوتا ہے بلکہ صحت پر بھی منفی اثر پڑتا ہے۔",
                "اسلامی تعلیمات جسمانی اور روحانی دونوں طرح کی راحت کو مدنظر رکھتی ہیں۔",
                "نماز کی حالت میں توجہ اور یکسوئی دراصل ذہنی سکون اور روحانی لذت کا باعث بنتی ہے۔"
              ],
              "english": [
                "Holding back a severe need not only destroys Khushu' but also negatively affects health.",
                "Islamic teachings consider both physical and spiritual well-being.",
                "Attention and concentration in prayer lead to mental tranquility and spiritual pleasure."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور تعلیمات",
        "english": "Practical Lessons and Teachings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خشوع کا حصول",
              "english": "Attaining Khushu'"
            },
            "content": {
              "urdu": [
                "نماز سے پہلے اپنے آس پاس کے ماحول اور اپنی جسمانی ضروریات کا جائزہ لینا چاہیے۔",
                "ہر وہ چیز جو دھیان بھٹکائے، اسے نماز سے پہلے ہی دور کر دینا کامیابی کی علامت ہے۔",
                "کھانے کو نماز پر ترجیح دینا اس بات کی دلیل ہے کہ توجہ اور خشوع مقدم ہیں۔"
              ],
              "english": [
                "Before prayer, one must assess the surrounding environment and their physical needs.",
                "Removing everything that distracts attention before prayer is a sign of success.",
                "Prioritizing food over prayer demonstrates that focus and Khushu' are paramount."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کا حق مقدم",
              "english": "Priority to Allah's Right"
            },
            "content": {
              "urdu": [
                "نماز اللہ کا حق ہے اور اسے کامل طریقے سے ادا کرنا ہمارا فرض ہے۔",
                "بے دھیانی کی حالت میں نماز پڑھنے سے اللہ کے حق میں کمی واقع ہوتی ہے۔",
                "لہذا، نماز کے وقت جسم اور دل کی ہر رکاوٹ کو دور کر کے مکمل حاضر ہونا چاہیے۔"
              ],
              "english": [
                "Prayer is Allah's right, and performing it perfectly is our duty.",
                "Praying in a state of distraction causes deficiency in fulfilling Allah's right.",
                "Therefore, one must remove every physical and mental obstruction during prayer to be fully present."
              ]
            }
          }
        ]
      }
    }
  ]
}
