{
  "hadithId": 194,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["2", "5"],
    "kitabId": 2,
    "inKitabBab": 5,
    "arabicBook": "كتاب الصلاة",
    "babId": 15
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- قَالَ : { اَلتَّثَاؤُبُ مِنْ اَلشَّيْطَانِ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَكْظِمْ مَا اِسْتَطَاعَ } رَوَاهُ مُسْلِمٌ وَاَلتِّرْمِذِيُّ , وَزَادَ : { فِي اَلصَّلَاةِ }",
    "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جمائی کا آنا شیطانی حرکت ہے۔ تم میں سے اگر کسی کو جمائی آ جائے تو حتیٰ الوسع اسے روکنے کی کوشش کرے۔ “ (مسلم و ترمذی) ترمذی نے اپنی روایت میں 'نماز میں' کا اضافہ نقل کیا ہے۔ ",
    "english": "Narrated from Abu Hurayrah (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"Yawning is from Satan, so if one of you yawns, he should suppress it as much as he can.\" Reported by Muslim and At-Tirmidhi, who added: \"During the prayer.\""
  },
  "takhreej": {
    "arabic": "صحيح. رواه مسلم في كتاب صفات المنافقين وأحكامهم، باب التثاؤب (2994). ورواه الترمذي في كتاب الصلاة، باب ما جاء في كراهية التثاؤب في الصلاة (370)، وقال: حديث حسن صحيح.",
    "urdu": "صحیح ہے۔ اسے مسلم نے کتاب صفات المنافقین وأحکامہم میں باب التثاؤب (2994) کے تحت روایت کیا ہے۔ اور اسے ترمذی نے کتاب الصلاة میں باب ما جاء فی کراهية التثاؤب فی الصلاة (370) کے تحت روایت کیا ہے، اور کہا کہ یہ حدیث حسن صحیح ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim in the Book on the characteristics of the hypocrites and their rulings, Chapter: Yawning (2994). And reported by At-Tirmidhi in the Book of Prayer, Chapter: What has been related concerning the dislike of yawning in prayer (370), and he graded it Hasan Sahih (Good and Authentic)."
  },
  "importantWords": [
    {
      "arabic": "التثاؤب",
      "english": "Yawning",
      "urdu": "جمائی"
    },
    {
      "arabic": "من الشيطان",
      "english": "Is from Satan",
      "urdu": "شیطان کی طرف سے ہے"
    },
    {
      "arabic": "فليكظم",
      "english": "He should suppress/restrain",
      "urdu": "وہ روکنے کی کوشش کرے"
    },
    {
      "arabic": "ما استطاع",
      "english": "As much as he can",
      "urdu": "جتنی طاقت ہو"
    },
    {
      "arabic": "في الصلاة",
      "english": "During the prayer",
      "urdu": "نماز میں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ جمائی سستی اور غفلت کی علامت ہے جو شیطان کی طرف سے ہوتی ہے، لہٰذا ہمیں ہر حالت میں اور خصوصاً نماز کے دوران پوری کوشش کر کے اسے روکنا چاہیے تاکہ شیطان ہم پر ہنسے نہیں اور ہماری عبادت میں خلل نہ آئے۔",
    "english": "This Hadith states that yawning is a sign of laziness and heedlessness, which originates from Satan. Therefore, we must strive our utmost to suppress it in all situations, especially during prayer, so that Satan does not mock us and our worship remains undisturbed."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب صفات المنافقين وأحكامهم (2994)",
      "english": "Sahih Muslim, Book on the characteristics of the hypocrites and their rulings (2994)"
    },
    {
      "arabic": "سنن الترمذي، كتاب الصلاة، باب ما جاء في كراهية التثاؤب في الصلاة (370)",
      "english": "Sunan At-Tirmidhi, Book of Prayer, Chapter: What has been related concerning the dislike of yawning in prayer (370)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurayrah"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYv0R2cM5nE",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمائی اور شیطانی مداخلت",
        "english": "Yawning and Satanic Interference"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمائی کی اصل",
              "english": "The Origin of Yawning"
            },
            "content": {
              "urdu": [
                "نبی اکرم صلی اللہ علیہ وسلم نے جمائی کو شیطان سے منسوب کیا ہے، جو سستی اور کاہلی کی علامت ہے۔",
                "شیطان اس وقت خوش ہوتا ہے جب انسان سستی اور غفلت کی حالت میں ہو، خاص طور پر عبادت کے وقت۔",
                "جمائی کے دوران منہ سے آواز نکالنا یا کھل کر جمائی لینا شیطان کو موقع فراہم کرتا ہے کہ وہ ہنسے۔"
              ],
              "english": [
                "The Prophet (PBUH) attributed yawning to Satan, as it signifies laziness and sluggishness.",
                "Satan is pleased when a person is in a state of lethargy and heedlessness, especially during worship.",
                "Making a sound or opening the mouth wide while yawning gives Satan an opportunity to laugh."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمائی روکنے کا حکم",
              "english": "The Command to Suppress Yawning"
            },
            "content": {
              "urdu": [
                "حکم دیا گیا ہے کہ انسان حتیٰ الامکان جمائی کو روکنے کی کوشش کرے، خواہ نماز میں ہو یا عام حالت میں۔",
                "اگر روکنا ممکن نہ ہو تو منہ پر ہاتھ رکھ لینا چاہیے تاکہ شیطان اندر داخل نہ ہو اور دوسرے لوگ ہنسیں نہیں۔",
                "یہ عمل نہ صرف شیطانی مداخلت سے بچاتا ہے بلکہ عمومی آداب اور خوبصورتی کا تقاضا بھی ہے۔"
              ],
              "english": [
                "It is commanded that one should suppress yawning as much as possible, whether inside or outside the prayer.",
                "If suppression is not possible, one should cover the mouth with the hand to prevent Satan from entering or others from mocking.",
                "This act not only protects against Satanic intervention but also fulfills the requirements of general etiquette and decency."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز میں جمائی کے احکام",
        "english": "Rulings on Yawning in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں روکنے کی تاکید",
              "english": "Emphasis on Suppression in Prayer"
            },
            "content": {
              "urdu": [
                "ترمذی کی روایت میں نماز کے دوران جمائی روکنے پر خاص زور دیا گیا ہے جو عبادت کی اہمیت کو واضح کرتا ہے۔",
                "نماز اللہ سے مناجات کی حالت ہے، جس میں سستی کا مظاہرہ انتہائی ناپسندیدہ فعل ہے۔",
                "جمائی روکنے میں ناکامی خشوع میں کمی اور نماز کے ثواب میں نقصان کا باعث بن سکتی ہے۔"
              ],
              "english": [
                "At-Tirmidhi's narration specifically emphasizes suppressing yawning during prayer, highlighting the importance of worship.",
                "Prayer is a state of conversation with Allah, where exhibiting sluggishness is highly disliked.",
                "Failure to suppress yawning can lead to a decrease in Khushu' and a loss in the prayer's reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "ہاتھ سے منہ ڈھکنا",
              "english": "Covering the Mouth with the Hand"
            },
            "content": {
              "urdu": [
                "اگر جمائی نہ روکی جا سکے تو منہ پر ہاتھ رکھنا چاہیے، نماز میں بھی اسی طرح کرنا چاہیے۔",
                "نماز میں دایاں ہاتھ استعمال کرنا افضل ہے، البتہ بائیں ہاتھ یا آستین کا بھی استعمال جائز ہے۔",
                "یہ عمل چہرے کے کھلے پن اور غیر ضروری حرکت سے بچاتا ہے، جو نماز کے آداب کے خلاف ہیں۔"
              ],
              "english": [
                "If yawning cannot be suppressed, the mouth should be covered; this applies during prayer as well.",
                "Using the right hand is preferred in prayer, but using the left hand or sleeve is also permissible.",
                "This act prevents the face from opening wide and avoids unnecessary movement, which is against the etiquette of prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحت، احتیاط اور اخلاق",
        "english": "Health, Caution, and Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمائی کا طبی پہلو",
              "english": "The Medical Aspect of Yawning"
            },
            "content": {
              "urdu": [
                "اگرچہ جمائی ایک فطری جسمانی رد عمل ہے، لیکن حدیث اسے روحانی سستی سے جوڑتی ہے۔",
                "اس کے علاج کے لیے نیند پوری کرنا، یا قیام کی حالت بدلنا مفید ہوتا ہے۔",
                "مومن کو چاہیے کہ وہ اپنی نماز کی صحت اور روحانی تازگی کے لیے جسمانی احتیاط بھی کرے۔"
              ],
              "english": [
                "Although yawning is a natural physiological reaction, the Hadith connects it to spiritual lethargy.",
                "To treat it, getting enough sleep or changing one's position (like standing up) is beneficial.",
                "A believer should take physical precautions to ensure the health and spiritual freshness of their prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ اخلاق کا مظاہرہ",
              "english": "Demonstration of Good Manners"
            },
            "content": {
              "urdu": [
                "جمائی کو روکنے کا حکم حسنِ اخلاق اور دوسروں کے سامنے خوبصورتی برقرار رکھنے کا بھی درس ہے۔",
                "جمائی کھول کر لینے سے نکلنے والی آواز نمازی اور دیگر لوگوں کے لیے ناگوار ہو سکتی ہے۔",
                "اسلام ہر حالت میں پاکیزگی اور اچھے آداب سکھاتا ہے، خواہ وہ عبادت ہو یا عام زندگی۔"
              ],
              "english": [
                "The command to suppress yawning is also a lesson in good manners and maintaining decency in front of others.",
                "The sound produced by wide-open yawning can be unpleasant for the worshipper and others.",
                "Islam teaches purity and good etiquette in all situations, whether in worship or daily life."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اقدامات اور دعا",
        "english": "Practical Measures and Supplication (Du'a)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز سے قبل تیاری",
              "english": "Preparation Before Prayer"
            },
            "content": {
              "urdu": [
                "جمائی سے بچنے کے لیے نماز سے قبل مسواک کرنا، چہرے پر پانی ڈالنا اور تازہ دم ہونا چاہیے۔",
                "اگر نیند غالب ہو تو کچھ دیر کے لیے سو جانا چاہیے تاکہ نماز مکمل ہوش و حواس میں ادا ہو۔",
                "سستی اور نیند شیطان کا ایک ہتھیار ہے، اس سے بچنے کے لیے اللہ سے مدد مانگنی چاہیے۔"
              ],
              "english": [
                "To avoid yawning, one should use Siwak (tooth stick), wash the face with water, and refresh themselves before prayer.",
                "If sleep is overwhelming, one should take a short nap so that the prayer is performed with full awareness.",
                "Lethargy and sleep are weapons of Satan; one should seek Allah's help to guard against them."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان کو شرمندہ کرنا",
              "english": "Embarrassing Satan"
            },
            "content": {
              "urdu": [
                "جمائی کو روکنے کا عمل شیطان کو شرمندہ کرتا ہے، کیونکہ وہ اس پر خوش ہوتا ہے۔",
                "یہ کوشش دراصل عبادت میں سستی کے خلاف ایک عملی جہاد کے مترادف ہے۔",
                "نمازی کو ہر حال میں شیطان کی چالوں کو ناکام بنانے کے لیے ہوشیار اور مستعد رہنا چاہیے۔"
              ],
              "english": [
                "The act of suppressing a yawn embarrasses Satan, who rejoices at it.",
                "This effort is equivalent to a practical struggle (Jihad) against laziness in worship.",
                "The worshipper must be vigilant and proactive to thwart Satan's schemes at all times."
              ]
            }
          }
        ]
      }
    }
  ]
}
