{
  "hadithId": 230,
  "hadithNo": 21,
  "hadithReferences": {
    "sunnah.com": ["Sahih Muslim 479"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَلَا وَإِنِّي نُهِيتُ أَنْ أَقْرَأَ اَلْقُرْآنَ رَاكِعًا أَوْ سَاجِدًا , فَأَمَّا اَلرُّكُوعُ فَعَظِّمُوا فِيهِ اَلرَّبَّ , وَأَمَّا اَلسُّجُودُ فَاجْتَهِدُوا فِي اَلدُّعَاءِ , فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ } رَوَاهُ مُسْلِمٌ",
    "urdu": "سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” لوگو سن لو کہ مجھے رکوع اور سجدہ میں قرآن پڑھنے سے منع کیا گیا ہے۔ لہذا رکوع میں اپنے مالک و پروردگار کی عظمت بیان کرو اور سجدہ میں دعا مانگنے کی کوشش کرو۔ یہ اس لائق ہے کہ تمہاری دعا قبول کر لی جائے۔“ (مسلم)",
    "english": "Narrated Ibn Abbas (May Allah be pleased with them both): The Messenger of Allah (ﷺ) said: \"Behold! I have been forbidden to recite the Qur'an while bowing (Ruku') or prostrating (Sujud). So, as for the bowing, glorify the Lord therein, and as for the prostration, strive hard in supplication, for it is worthy that your prayer should be answered.\""
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه مسلم (479)‏ من طريق عبد الله بن معبد ، عن ابن عباس قال : كشف رسول الله ‏-صلى الله عليه وسلم‏- الستارة ، والناس صفوف خلف أبي بكر ، فقال : \"أيها الناس ! إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم ، أو ترى له ، ألا وإني .‏ .‏ .‏ الحديث .‏ وقمن : بفتح الميم وكسرها ، جدير وحقيق .‏",
    "urdu": "صحیح روایت۔ اسے مسلم (479) نے عبداللہ بن معبد کے طریق سے ابن عباس رضی اللہ عنہما سے روایت کیا ہے۔ اس حدیث میں یہ بھی ہے کہ آپ ﷺ نے پردہ ہٹا کر فرمایا: \"لوگو! نبوت کی خوشخبریوں میں سے صرف نیک خواب ہی باقی بچے ہیں... پھر فرمایا: خبردار! مجھے قرآن پڑھنے سے منع کیا گیا ہے...\"۔",
    "english": "Authentic (Sahih). Reported by Muslim (479) via the route of Abdullah ibn Ma'bad, from Ibn Abbas. The beginning of the Hadith mentions the Prophet (ﷺ) drawing back the curtain and addressing the people. The word 'Qamin' means deserving or likely (that your prayer should be answered)."
  },
  "importantWords": [
    {
      "arabic": "نُهِيتُ",
      "english": "I was forbidden",
      "urdu": "مجھے منع کیا گیا"
    },
    {
      "arabic": "أَقْرَأَ اَلْقُرْآنَ",
      "english": "To recite the Qur'an",
      "urdu": "میں قرآن پڑھوں"
    },
    {
      "arabic": "رَاكِعًا",
      "english": "Bowing (in Ruku')",
      "urdu": "رکوع کرتے ہوئے"
    },
    {
      "arabic": "سَاجِدًا",
      "english": "Prostrating (in Sujud)",
      "urdu": "سجدہ کرتے ہوئے"
    },
    {
      "arabic": "فَعَظِّمُوا",
      "english": "Then glorify (Allah)",
      "urdu": "پس تم عظمت بیان کرو"
    },
    {
      "arabic": "فَاجْتَهِدُوا",
      "english": "Strive hard (in supplication)",
      "urdu": "کوشش کرو"
    },
    {
      "arabic": "فَقَمِنٌ",
      "english": "Worthy/Likely",
      "urdu": "اس لائق ہے"
    },
    {
      "arabic": "يُسْتَجَابَ",
      "english": "To be answered",
      "urdu": "قبول کی جائے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں افعال کے مقصد اور ان میں کی جانے والی عبادات کی نوعیت کو واضح کرتی ہے۔ رکوع تعظیمِ رب کے لیے ہے جہاں صرف تسبیح اور ثنا کی جاتی ہے، جبکہ سجدہ عاجزی کا مقام ہے جہاں دعا پر محنت کرنی چاہیے کیونکہ یہ قبولیت کا سب سے زیادہ مستحق مقام ہے۔",
    "english": "This Hadith clarifies the purpose and nature of worship in the postures of prayer. Ruku' (bowing) is for glorifying the Lord, where only praise is offered, while Sujud (prostration) is the position of utmost humility where one should strive hard in supplication, as it is the most deserving state for prayers to be answered."
  },
  "references": [
    {
      "arabic": "رواه مسلم (479)",
      "english": "Reported by Muslim (479)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن معبد",
        "english": "Abdullah ibn Ma'bad"
      },
      "slug": "abdullah-ibn-mabad"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYv_6zE50kY",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رکوع اور سجدے کا مقصد",
        "english": "The Purpose of Ruku' and Sujud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن پڑھنے کی ممانعت",
              "english": "Prohibition of Qur'an Recitation"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کو رکوع اور سجدے میں قرآن کی تلاوت سے منع کیا گیا تھا، لہٰذا یہ فعل حرام ہے۔",
                "قرآن کی تلاوت قیام (کھڑے ہونے) کی حالت کے لیے خاص ہے، جو نماز کا افضل ترین رکن ہے۔",
                "یہ ممانعت قرآن کے مقام و عظمت کو ظاہر کرتی ہے کہ یہ صرف اطاعت اور عاجزی کی حالت میں پڑھا جائے۔"
              ],
              "english": [
                "The Prophet (ﷺ) was forbidden from reciting the Qur'an while bowing or prostrating, making this act prohibited.",
                "Qur'an recitation is specifically reserved for the standing (Qiyam) posture, which is the most excellent pillar of prayer.",
                "This prohibition highlights the status of the Qur'an, indicating it should be read only in the posture of submission and honor."
              ]
            }
          },
          {
            "title": {
              "urdu": "رکوع میں تعظیم کا حکم",
              "english": "The Command for Glorification in Ruku'"
            },
            "content": {
              "urdu": [
                "رکوع تعظیم کا مقام ہے، لہٰذا اس میں رب کی عظمت، پاکیزگی اور بڑائی بیان کی جاتی ہے۔",
                "رکوع میں مسنون اذکار میں 'سبحان ربي العظيم' سب سے معروف اور افضل تسبیح ہے۔",
                "تعظیم سے مراد صرف زبانی تسبیح نہیں، بلکہ دل کی گہرائی سے اللہ کی بڑائی کا اقرار کرنا ہے۔"
              ],
              "english": [
                "Ruku' is the posture of reverence, hence, one should glorify, sanctify, and declare the greatness of the Lord.",
                "The known and superior glorification in Ruku' is 'Subhana Rabbiyal-Azeem' (Glory to my Lord, the Most Great).",
                "Glorification is not just verbal but involves deeply acknowledging Allah's majesty in the heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سجدہ اور قبولیت دعا",
        "english": "Sujud and Acceptance of Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سجدے میں دعا کی کوشش",
              "english": "Striving Hard in Sujud Supplication"
            },
            "content": {
              "urdu": [
                "سجدہ اللہ کے سب سے زیادہ قریب ہونے کا مقام ہے، لہٰذا اس میں کثرت سے دعا کرنی چاہیے۔",
                "دعا میں محنت (اجتہاد) سے مراد یہ ہے کہ تکرار اور دلی توجہ سے دعا مانگی جائے۔",
                "یہ کوشش سنت اور دنیا و آخرت کی جامع دعاؤں کو مانگنے میں صرف ہونی چاہیے۔"
              ],
              "english": [
                "Sujud is the closest state a servant can be to Allah, so one should increase supplication during it.",
                "Striving hard (Ijtihad) in supplication means praying repeatedly and with deep heartfelt focus.",
                "This effort should be directed towards making Prophetic and comprehensive supplications for this world and the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کی قبولیت کی امید",
              "english": "Hope for Prayer Answered"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے واضح کیا کہ سجدہ دعا کی قبولیت کا بہترین مقام ہے ('فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ')۔",
                "قبولیت کا زیادہ امکان اس لیے ہے کہ سجدہ انتہا درجے کی عاجزی اور بندگی کا اظہار ہے۔",
                "مومن کو سجدے میں اپنے تمام معاملات اور حاجات کو اپنے رب کے سامنے پیش کرنا چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) clarified that prostration is the best state for supplication to be accepted ('it is worthy that your prayer should be answered').",
                "The likelihood of acceptance is high because Sujud demonstrates the ultimate degree of humility and servitude.",
                "A believer should present all their needs and concerns to their Lord while in prostration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی نکات",
        "english": "Juristic and Educational Points"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سجدہ میں دعا کی نوعیت",
              "english": "Nature of Supplication in Sujud"
            },
            "content": {
              "urdu": [
                "سجدے میں ہر قسم کی شرعی دعا کرنا جائز ہے، خواہ وہ عربی میں ہو یا غیر عربی میں (بعض علماء کے نزدیک)۔",
                "بہتر اور افضل یہ ہے کہ مسنون عربی دعاؤں کا انتخاب کیا جائے جو قرآن یا سنت میں وارد ہیں۔",
                "اگرچہ سجدے میں دعا افضل ہے، لیکن فرض نمازوں میں سنت پر اکتفا کرنا امام کے لیے افضل ہے۔"
              ],
              "english": [
                "It is permissible to make all lawful supplications in Sujud, whether in Arabic or, according to some scholars, in one's own language.",
                "It is better and superior to choose the established Arabic supplications mentioned in the Qur'an or Sunnah.",
                "While supplication in Sujud is superior, it is best for the Imam in obligatory prayers to stick to the Sunnah remembrances."
              ]
            }
          },
          {
            "title": {
              "urdu": "مختلف عبادات کے حقوق",
              "english": "Rights of Different Acts of Worship"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح کرتی ہے کہ ہر رکنِ نماز کا ایک خاص حق اور مقصد ہے۔",
                "قیام تلاوت کے لیے، رکوع تعظیم کے لیے اور سجدہ عاجزی اور دعا کے لیے مخصوص ہے۔",
                "عبادات میں امتزاج کی بجائے، ہر عمل کو اس کے صحیح مقام پر ادا کرنا ایمان کا تقاضا ہے۔"
              ],
              "english": [
                "This Hadith clarifies that every pillar of prayer has a specific right and purpose.",
                "Standing (Qiyam) is designated for recitation, Ruku' for glorification, and Sujud for humility and supplication.",
                "The requirement of faith is to perform each act of worship in its correct place, rather than mixing them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور عملی رہنمائی",
        "english": "Ethical and Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خشوع کا حصول",
              "english": "Attaining Khushu'"
            },
            "content": {
              "urdu": [
                "نماز میں خشوع حاصل کرنے کا ایک بڑا ذریعہ یہ ہے کہ ہر رکن کا مفہوم یاد رکھا جائے۔",
                "رکوع میں اللہ کی عظمت کا تصور اور سجدے میں اپنی عاجزی کا شعور خشوع کو بڑھاتا ہے۔",
                "مسلمان کو چاہیے کہ وہ ان اوقات میں دھیان بھٹکنے سے بچنے کی کوشش کرے۔"
              ],
              "english": [
                "A major means of achieving Khushu' (devotion) in prayer is to remember the meaning of each posture.",
                "Contemplating Allah's greatness in Ruku' and feeling one's humility in Sujud increases devotion.",
                "The Muslim must strive to prevent their mind from wandering during these sacred moments."
              ]
            }
          },
          {
            "title": {
              "urdu": "افضل عمل کی پہچان",
              "english": "Recognizing the Superior Action"
            },
            "content": {
              "urdu": [
                "سجدے کو دعا کے لیے سب سے افضل اور مناسب ترین حالت قرار دیا گیا ہے۔",
                "نماز کے باہر بھی دعا مانگنی چاہیے، لیکن سجدے میں مانگی گئی دعا کی فضیلت سب سے زیادہ ہے۔",
                "یہ تعلیم ہمیں زندگی کے سب سے مشکل لمحات میں سجدے کی طرف رجوع کرنے کی ترغیب دیتی ہے۔"
              ],
              "english": [
                "Sujud has been designated as the most superior and appropriate state for making supplication.",
                "While one should supplicate outside of prayer, the virtue of the prayer made in prostration is highest.",
                "This teaching encourages us to turn towards Sujud during the most challenging moments of life."
              ]
            }
          }
        ]
      }
    }
  ]
}
