{
  "hadithId": 236,
  "hadithNo": 27,
  "hadithReferences": {
    "sunnah.com": ["Sahih Muslim 494"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ اَلْبَرَاءِ بْنِ عَازِبٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا سَجَدْتَ فَضَعْ كَفَّيْكَ , وَارْفَعْ مِرْفَقَيْكَ } رَوَاهُ مُسْلِمٌ .",
    "urdu": "سیدنا براء بن عازب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب تو سجدہ کرے تو (اس وقت) اپنی ہتھیلیوں کو زمین پر ٹکا دے اور اپنی دونوں کہنیوں کو اوپر اٹھا لے۔“ (مسلم)",
    "english": "Narrated Al-Bara' ibn 'Azib (May Allah be pleased with him): The Messenger of Allah (ﷺ) said: \"When you prostrate, place your palms (firmly) and raise your elbows.\" Reported by Muslim."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه مسلم (494)‏. هذا الحديث يؤكد الأمر برفع المرفقين عن الأرض في السجود، وهو مكمل لحديث التجافي السابق، ويمنع من بسط الذراعين كافتراش السبع.",
    "urdu": "صحیح روایت۔ اسے مسلم (494) نے روایت کیا ہے۔ یہ حدیث سجدے میں کہنیوں کو زمین سے اوپر اٹھانے کے حکم کی تاکید کرتی ہے، اور یہ سابقہ حدیثِ تجافی (جسم کو کھلا رکھنے) کا مکمل کرنے والا ہے، جو درندوں کی طرح بازو پھیلانے سے منع کرتا ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim (494). This Hadith confirms the command to raise the elbows off the ground during prostration, completing the previous Hadith on Tajaafi (separation), and preventing the spreading of the forearms flat like predatory animals."
  },
  "importantWords": [
    {
      "arabic": "سَجَدْتَ",
      "english": "You prostrate",
      "urdu": "تو سجدہ کرے"
    },
    {
      "arabic": "فَضَعْ",
      "english": "Then place",
      "urdu": "تو رکھ دے"
    },
    {
      "arabic": "كَفَّيْكَ",
      "english": "Your two palms",
      "urdu": "اپنی دونوں ہتھیلیاں"
    },
    {
      "arabic": "وَارْفَعْ",
      "english": "And raise",
      "urdu": "اور اوپر اٹھا"
    },
    {
      "arabic": "مِرْفَقَيْكَ",
      "english": "Your two elbows",
      "urdu": "اپنی دونوں کہنیاں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں سجدے کے ایک اہم رکن کی وضاحت کرتی ہے: سجدہ کرتے وقت دونوں ہتھیلیوں کو زمین پر جمایا جائے اور کہنیوں کو بستر کی طرح زمین پر نہ بچھایا جائے بلکہ اوپر اٹھا کر جسم سے الگ رکھا جائے۔ یہ سنت نماز میں کامل عاجزی اور وقار کو یقینی بناتی ہے۔",
    "english": "This Hadith clarifies an essential element of prostration: that when prostrating, one must firmly place the palms on the ground and raise the elbows off the ground, avoiding spreading them out like an animal. This Sunnah ensures perfect humility and dignity in prayer."
  },
  "references": [
    {
      "arabic": "رواه مسلم (494)",
      "english": "Reported by Muslim (494)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "البراء بن عازب",
        "english": "Al-Bara' ibn 'Azib"
      },
      "slug": "al-bara-ibn-azib"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2y8nJ-X4U0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سجدے کی درست کیفیت",
        "english": "The Correct Manner of Prostration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہتھیلیوں کا زمین پر ٹِکانا",
              "english": "Placing the Palms on the Ground"
            },
            "content": {
              "urdu": [
                "حدیث میں حکم ہے کہ سجدے کے دوران ہتھیلیوں کو مضبوطی سے زمین پر ٹکا دیا جائے۔",
                "ہتھیلیوں کا زمین پر لگنا سجدے کے سات اعضاء میں سے دو اہم اعضاء کی تکمیل ہے۔",
                "یہ ہاتھ نہ صرف زمین پر ہوں بلکہ قبلہ رخ بھی ہونے چاہئیں، جو سنت کے مطابق ہے۔"
              ],
              "english": [
                "The Hadith commands that the palms must be firmly placed on the ground during the act of prostration.",
                "Placing the palms on the ground fulfills two of the seven crucial limbs required for valid prostration.",
                "The hands should not only be on the ground but also facing the Qiblah, as per the established Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "کہنیوں کو اٹھانے کا حکم",
              "english": "The Command to Raise the Elbows"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے واضح حکم دیا کہ کہنیوں کو زمین پر بچھانے کے بجائے اوپر اٹھایا جائے۔",
                "یہ فعل بازوؤں کو پہلوؤں سے جدا رکھنے (تجافی) کو یقینی بناتا ہے جو ایک اہم سنت ہے۔",
                "کہنیوں کا اٹھانا درندوں کے مشابہت سے بچاتا ہے، جو اپنے بازو زمین پر بچھا دیتے ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) explicitly commanded raising the elbows rather than laying them flat on the ground.",
                "This action ensures the separation of the arms from the sides (Tajaafi), which is a crucial Sunnah practice.",
                "Raising the elbows prevents the imitation of predatory animals, which often spread their forearms on the ground."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی حکمت",
        "english": "Juristic and Educational Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاجزی میں وقار",
              "english": "Dignity in Humility"
            },
            "content": {
              "urdu": [
                "سجدہ انتہا کی عاجزی کا عمل ہے، لیکن کہنیوں کا اٹھانا وقار اور کمال بندگی کو ظاہر کرتا ہے۔",
                "زمین پر بازو بچھانے سے سستی اور کاہلی کا تاثر ملتا ہے، جس سے نماز کو پاک رکھنا ضروری ہے۔",
                "یہ سنت مومن کو سکھاتی ہے کہ عاجزی میں بھی اللہ کے سامنے باوقار کھڑا ہونا چاہیے۔"
              ],
              "english": [
                "Prostration is the ultimate act of humility, yet raising the elbows demonstrates dignity and perfected servitude.",
                "Laying the forearms flat on the ground suggests laziness, from which the prayer must be kept pure.",
                "This Sunnah teaches the believer that even in humility, one should stand before Allah with dignity and attention."
              ]
            }
          },
          {
            "title": {
              "urdu": "ممانعت کی وضاحت",
              "english": "Clarification of Prohibition"
            },
            "content": {
              "urdu": [
                "صحیح احادیث میں نبی اکرم ﷺ نے بازوؤں کو زمین پر بچھانے سے صراحتاً منع فرمایا ہے۔",
                "بعض علماء اس ممانعت کو مکروہ تحریمی (قریباً حرام) قرار دیتے ہیں کیونکہ یہ سنت کے خلاف ہے۔",
                "یہ حکم مردوں کے لیے مخصوص ہے، جبکہ عورتوں کے لیے اعضاء کو سکیڑ کر رکھنا افضل ہے۔"
              ],
              "english": [
                "In authentic narrations, the Prophet (ﷺ) explicitly forbade laying the forearms flat on the ground.",
                "Some scholars classify this prohibition as Makruh Tahrimi (close to forbidden) because it violates the Sunnah.",
                "This command is generally specific to men, while for women, gathering the limbs together is considered superior."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سنت اور اس کا نتیجہ",
        "english": "Practical Sunnah and Its Outcome"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سجدے میں طاقت کا استعمال",
              "english": "Exertion of Effort in Sujud"
            },
            "content": {
              "urdu": [
                "ہتھیلیوں کو ٹِکانا اور کہنیوں کو اٹھانا دونوں ہی سجدے میں طاقت اور ارتکاز کو ظاہر کرتے ہیں۔",
                "ان احکامات پر عمل کرنے سے نمازی سجدہ میں لمبے وقت تک اطمینان کے ساتھ رہ سکتا ہے۔",
                "اس طرح سے کی گئی نماز خشوع اور اس کے اجر و ثواب میں اضافہ کرتی ہے۔"
              ],
              "english": [
                "Placing the palms firmly and raising the elbows both demonstrate effort and focus during prostration.",
                "Adhering to these commands allows the worshipper to remain in Sujud with stillness (Tuma'ninah) for a longer period.",
                "A prayer performed in this manner increases devotion (Khushu') and multiplies the reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "جسمانی صحت اور نماز",
              "english": "Physical Health and Prayer"
            },
            "content": {
              "urdu": [
                "کہنیوں کو اٹھا کر جسم کو کھلا رکھنے سے سجدے میں دورانِ خون کا نظام بہتر ہوتا ہے۔",
                "یہ حالت پھیپھڑوں کو زیادہ جگہ فراہم کرتی ہے تاکہ سانس لینے میں آسانی ہو۔",
                "اسلامی عبادات جسمانی اور روحانی دونوں فوائد کی حامل ہوتی ہیں، جس کی یہ بہترین مثال ہے۔"
              ],
              "english": [
                "Keeping the elbows raised and the body separated improves blood circulation during prostration.",
                "This posture provides more space for the lungs, thus easing the process of breathing.",
                "Islamic acts of worship carry both physical and spiritual benefits, and this is an excellent example of that."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نبی ﷺ کے فرمان پر عمل",
        "english": "Acting upon the Prophet's Command"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دو واضح احکام",
              "english": "Two Clear Commands"
            },
            "content": {
              "urdu": [
                "اس حدیث میں رسول اللہ ﷺ نے سجدے کے لیے دو واضح، عملی احکام دیے ہیں۔",
                "پہلا حکم ہاتھوں کے ٹھکاؤ سے متعلق ہے اور دوسرا کہنیوں کی پوزیشن سے متعلق ہے۔",
                "صحیح نماز کے لیے ان احکام کی مکمل اتباع لازم ہے تاکہ بندگی کا حق ادا ہو۔"
              ],
              "english": [
                "In this Hadith, the Messenger of Allah (ﷺ) gave two clear, practical commands for prostration.",
                "The first command relates to the firm placement of the hands, and the second relates to the position of the elbows.",
                "Complete obedience to these commands is essential for a correct prayer to fulfill the rights of servitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفل اور فرض نماز",
              "english": "Voluntary and Obligatory Prayer"
            },
            "content": {
              "urdu": [
                "یہ حکم نفل اور فرض دونوں نمازوں میں یکساں لاگو ہوتا ہے اور اس میں کوئی فرق نہیں ہے۔",
                "نماز کی سنتیں اور طریقہ کار ہر حال میں وہی رہتا ہے جو نبی اکرم ﷺ سے ثابت ہے۔",
                "البتہ، فرض نماز میں، اگر دوسروں کو تکلیف ہو، تو سنتِ تجافی میں کمی کی اجازت ہے۔"
              ],
              "english": [
                "This ruling applies equally to both voluntary (Nafl) and obligatory (Fard) prayers; there is no difference.",
                "The Sunnah practices and method of prayer remain the same in all circumstances as established by the Prophet (ﷺ).",
                "However, in a crowded obligatory prayer, reducing the separation (Tajaafi) is permitted if it prevents harming others."
              ]
            }
          }
        ]
      }
    }
  ]
}
