{
  "hadithId": 228,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": [
      "Sunan Abi Dawud 1074 (similar topic, slightly different wording)"
    ],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقْرَأُ فِي صَلَاةِ اَلْفَجْرِ يَوْمَ اَلْجُمْعَةِ : (الم تَنْزِيلُ )‏ اَلسَّجْدَةَ , و (هَلْ أَتَى عَلَى اَلْإِنْسَانِ)‏ } مُتَّفَقٌ عَلَيْهِ وَلِلطَّبَرَانِيِّ مِنْ حَدِيثِ اِبْنِ مَسْعُودٍ : { يُدِيمُ ذَلِكَ }",
    "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے روز نماز فجر کی پہلی رکعت میں «الم تنزيل السجدة» اور دوسری میں «هل أتى على الإنسان» (سورۃ «دهر») پڑھا کرتے تھے۔ (بخاری و مسلم) اور طبرانی میں ابن مسعود سے مروی روایت میں ہے کہ ایسا آپ صلی اللہ علیہ وسلم ہمیشہ کرتے تھے۔",
    "english": "Narrated Abu Hurairah (May Allah be pleased with him): The Messenger of Allah (ﷺ) used to recite in the Fajr prayer on Friday: *'Alif, Lam, Mim. The Revelation (Surah As-Sajdah)* in the first Rak'ah, and *'Has there not come upon man (Surah Al-Insan / Ad-Dahr)* in the second. (Agreed upon: Al-Bukhari and Muslim). And according to At-Tabarani from the Hadith of Ibn Mas'ud: 'He used to continue doing that.'"
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (891)‏ ، ومسلم (880)‏ واللفظ للبخاري .‏ ضعيف .‏ رواه الطبراني في \"الصغير\" (986)‏ بسند ضعيف ، وله علة أخرى أبان أبو حاتم عنها في \"العلل\" (1/204/586)‏ .‏",
    "urdu": "صحیح متفق علیہ روایت: بخاری (891) اور مسلم (880)۔ الفاظ بخاری کے ہیں۔ طبرانی کی ابن مسعود والی روایت جس میں آپ ہمیشہ ایسا کرنے کا ذکر ہے وہ ضعیف ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (891) and Muslim (880). The wording is from Al-Bukhari. The part reported by At-Tabarani from Ibn Mas'ud mentioning 'He used to continue doing that' is Weak (Da'if)."
  },
  "importantWords": [
    {
      "arabic": "يَقْرَأُ",
      "english": "He used to recite",
      "urdu": "آپ پڑھتے تھے"
    },
    {
      "arabic": "صَلَاةِ اَلْفَجْرِ",
      "english": "Fajr Prayer",
      "urdu": "فجر کی نماز"
    },
    {
      "arabic": "يَوْمَ اَلْجُمْعَةِ",
      "english": "Friday",
      "urdu": "جمعہ کا دن"
    },
    {
      "arabic": "اَلسَّجْدَةَ",
      "english": "The Prostration (Surah 32)",
      "urdu": "سورۃ سجدہ"
    },
    {
      "arabic": "هَلْ أَتَى",
      "english": "Has there not come (Surah 76)",
      "urdu": "سورۃ الدہر"
    },
    {
      "arabic": "يُدِيمُ",
      "english": "He continues/persists",
      "urdu": "وہ ہمیشہ کرتے"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon (by Bukhari and Muslim)",
      "urdu": "متفق علیہ"
    }
  ],
  "summary": {
    "urdu": "رسول اللہ ﷺ جمعہ کی فجر کی نماز میں پہلی رکعت میں سورۃ السجدہ (الم تنزیل) اور دوسری رکعت میں سورۃ الإنسان (ھل اتی) تلاوت کیا کرتے تھے، جس میں قیامت اور انسان کی تخلیق کے مضامین شامل ہیں۔",
    "english": "The Prophet Muhammad (ﷺ) customarily recited Surah As-Sajdah (Chapter 32) in the first unit (Rak'ah) and Surah Al-Insan (Chapter 76) in the second unit of the Fajr prayer on the day of Jumu'ah (Friday). The content of these Surahs serves as a reminder of the creation, Resurrection, and Day of Judgment."
  },
  "references": [
    {
      "arabic": "رواه البخاري (891)",
      "english": "Reported by Al-Bukhari (891)"
    },
    {
      "arabic": "رواه مسلم (880)",
      "english": "Reported by Muslim (880)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ud"
      },
      "slug": "abdullah-ibn-masud"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2y8nJ-X4U0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "جمعہ کی فجر کا معمول",
        "english": "The Friday Fajr Practice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سورتوں کا انتخاب",
              "english": "The Choice of Surahs"
            },
            "content": {
              "urdu": [
                "رسول اللہ ﷺ نے جمعہ کے دن فجر کی نماز کے لیے مخصوص سورتوں کا انتخاب کیا۔",
                "یہ سورتیں (السجدہ اور الإنسان) یوم الجمعہ کے مضامین، یعنی تخلیق، قیامت اور جنت و دوزخ کے حالات پر زور دیتی ہیں۔",
                "یہ انتخاب اس دن کی عظمت اور خاص عبادات کی طرف توجہ دلانے کے لیے ہے۔"
              ],
              "english": [
                "The Messenger of Allah (ﷺ) specifically chose these Surahs for the Fajr prayer on Friday.",
                "These Surahs emphasize the themes of Jumu'ah: creation, resurrection, and the state of Paradise and Hellfire.",
                "This selection serves to highlight the importance of the day and draw attention to its special observances."
              ]
            }
          },
          {
            "title": {
              "urdu": "سجدہ کی حکمت",
              "english": "Wisdom of the Prostration"
            },
            "content": {
              "urdu": [
                "سورۃ السجدہ میں سجدہ تلاوت کا حکم ہے، جسے پہلی رکعت میں پڑھا جاتا ہے۔",
                "اس سجدے کا مقصد جمعہ کے دن امت کو سجدہ تلاوت کے ذریعے اللہ کی مزید قربت دلانا ہے۔",
                "مقتدیوں کے لیے سجدہ واجب نہیں، لیکن سنت کی پیروی میں مستحب ہے۔"
              ],
              "english": [
                "Surah As-Sajdah contains an instruction for a prostration of recitation, which is performed in the first unit.",
                "The purpose of this prostration is to bring the Ummah closer to Allah through an act of prostration on the blessed day of Jumu'ah.",
                "While not mandatory for the followers, performing the prostration is highly recommended in following the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی احکام",
        "english": "Juristic Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت اور التزام",
              "english": "Sunnah and Observance"
            },
            "content": {
              "urdu": [
                "یہ حدیث جمعہ کی فجر میں ان سورتوں کی تلاوت کے مستحب ہونے کا ثبوت ہے۔",
                "علماء کے نزدیک ان سورتوں کی تلاوت سنت مؤکدہ یا مستحب میں شامل ہے۔",
                "یہ التزام اور مداومت صرف اس نیت سے ہونی چاہیے کہ یہ رسول اللہ ﷺ کا معمول تھا۔"
              ],
              "english": [
                "This Hadith establishes the desirability (Mustahabb) of reciting these Surahs in the Fajr prayer on Friday.",
                "Scholars generally regard the recitation of these Surahs as a confirmed Sunnah (Sunnah Mu'akkadah) or highly recommended.",
                "Consistency in this act should only be with the intention of following the established practice of the Prophet (ﷺ)."
              ]
            },
            "id": 3
          },
          {
            "title": {
              "urdu": "دوسری سورتیں پڑھنے کا حکم",
              "english": "Ruling on Reciting Other Surahs"
            },
            "content": {
              "urdu": [
                "اگر امام کو یہ سورتیں یاد نہ ہوں یا بھول جائے تو وہ دوسری سورتیں پڑھ سکتا ہے، نماز صحیح ہوگی۔",
                "اس سنت کو چھوڑنا مکروہ تنزیہی نہیں، لیکن اس پر عمل کرنا بہت اجر کا باعث ہے۔",
                "مقصد جمعہ کی یاد دہانی اور سجدہ تلاوت کا حصول ہے، جو دوسری رکعت سے بھی حاصل ہو سکتا ہے۔"
              ],
              "english": [
                "If the Imam does not know these Surahs or forgets, he may recite others, and the prayer remains valid.",
                "Omitting this Sunnah is not a disliked act (Makruh Tanzihi), but acting upon it yields great reward.",
                "The main goals are the remembrance of Jumu'ah and obtaining the prostration of recitation, which can also be done in other ways."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تربیتی سبق",
        "english": "Educational and Spiritual Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جمعہ کے دن کی تیاری",
              "english": "Preparation for Jumu'ah"
            },
            "content": {
              "urdu": [
                "جمعہ کے دن کی فجر کی نماز، اس پورے دن کی یاد دہانی اور آغاز ہے۔",
                "سورتوں میں قیامت اور حساب کا ذکر ہمیں جمعہ کی روحانیت کے لیے تیار کرتا ہے۔",
                "مسلمان کو چاہیے کہ وہ اس دن کی عظمت اور اہمیت کو سمجھے اور اس کے حقوق ادا کرے۔"
              ],
              "english": [
                "The Fajr prayer on Friday serves as a reminder and the start of the spiritual day.",
                "The mention of Resurrection and Reckoning in the Surahs prepares us for the spirituality of Jumu'ah.",
                "A Muslim should understand the greatness and importance of this day and fulfill its due rights."
              ]
            },
            "id": 5
          },
          {
            "title": {
              "urdu": "سنت پر عمل کی ترغیب",
              "english": "Encouragement to Follow Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سنت نبوی پر عمل کرنے کی ترغیب دیتی ہے، خواہ وہ چھوٹے اعمال ہوں۔",
                "رسول اللہ ﷺ کی عبادات میں مستقل مزاجی ہمارے لیے بہترین نمونہ ہے۔",
                "مداومت (تسلسل) چھوٹے نیک اعمال کو بھی بڑے اجر کا مستحق بناتی ہے۔"
              ],
              "english": [
                "This Hadith encourages us to follow the Prophetic Sunnah, even in minor acts of worship.",
                "The Prophet's consistency (Idaamah) in worship is the best example for us to follow.",
                "Consistency (Mudaawamah) makes small good deeds worthy of great reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "انتباہ اور وضاحت",
        "english": "Caveat and Clarification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سجدہ تلاوت کا محل",
              "english": "Place of Prostration of Recitation"
            },
            "content": {
              "urdu": [
                "بعض عوام یہ سمجھتے ہیں کہ سجدہ اس لیے کیا جاتا ہے کہ وہ جمعہ کا دن ہے۔",
                "یہ سجدہ صرف اس لیے کیا جاتا ہے کہ سورۃ السجدہ میں سجدے کی آیت موجود ہے۔",
                "مسجد میں بھیڑ کو دیکھتے ہوئے امام کو چاہیے کہ وہ سجدے کی جگہ مصلحت سے کام لے۔"
              ],
              "english": [
                "Some common people mistakenly believe the prostration is done simply because it is Friday.",
                "The prostration is performed solely because Surah As-Sajdah contains the verse of prostration.",
                "The Imam should exercise wisdom regarding the place of prostration, especially considering crowded mosques."
              ]
            }
          },
          {
            "title": {
              "urdu": "طبرانی کی روایت کی وضاحت",
              "english": "Clarification on At-Tabarani's Narration"
            },
            "content": {
              "urdu": [
                "طبرانی کی روایت 'یُدِیمُ ذَلِكَ' (آپ ﷺ ہمیشہ ایسا کرتے تھے) کو محدثین نے ضعیف قرار دیا ہے۔",
                "صحیح روایت سے ثابت ہے کہ آپ ﷺ نے یہ سورتیں پڑھیں، مگر مداومت کا ذکر ثابت نہیں ہے۔",
                "اس لیے امت کو کبھی دوسری سورتیں بھی پڑھ کر لوگوں کو یہ تعلیم دینی چاہیے کہ یہ واجب نہیں ہے۔"
              ],
              "english": [
                "At-Tabarani's narration 'He used to continue doing that' is classified as weak by scholars.",
                "The authentic Hadith confirms the Prophet (ﷺ) recited these Surahs, but not necessarily with absolute constancy.",
                "Therefore, the Ummah should sometimes recite other Surahs to teach that this practice is not obligatory."
              ]
            }
          }
        ]
      }
    }
  ]
}
