{
  "hadithId": 241,
  "hadithNo": 32,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/32"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَنَتَ شَهْرًا بَعْدَ اَلرُّكُوعِ , يَدْعُو عَلَى أَحْيَاءٍ مِنْ أَحْيَاءِ اَلْعَرَبِ , ثُمَّ تَرَكَهُ } مُتَّفَقٌ عَلَيْهِ .‏ وَلِأَحْمَدَ وَاَلدَّارَقُطْنِيِّ نَحْوُهُ مِنْ وَجْهٍ آخَرَ , وَزَادَ : { فَأَمَّا فِي اَلصُّبْحِ فَلَمْ يَزَلْ يَقْنُتُ حَتَّى فَارَقَ اَلدُّنْيَا } ",
    "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے پورا مہینہ رکوع کے بعد دعائے قنوت پڑھی، پھر اسے چھوڑ دیا۔ (بخاری و مسلم) احمد اور دارقطنی وغیرہ نے ایک اور طریق سے اسے روایت کیا ہے، اس میں اتنا اضافہ ہے کہ صبح کی نماز میں دعائے قنوت تا دم زیست ہمیشہ پڑھتے رہے۔ ",
    "english": "Narrated Anas bin Malik (RA): Allah's Messenger (peace be upon him) performed Qunut for a month after the Ruku' (bowing), invoking curse upon some of the Arab tribes, then he stopped doing it. [Agreed upon]. Ahmad and Ad-Daraqutni have a similar narration from another chain, with the addition: 'As for the Fajr prayer, he continued to perform Qunut until he left this world.'"
  },
  "takhreej": {
    "arabic": "صحيح البخاري (4089)، صحيح مسلم (677). أما زيادة 'فلم يزل يقنت في الصبح' فقد رواها أحمد (3/162) والدارقطني (2/39) وهي ضعيفة عند جمهور المحققين.",
    "urdu": "یہ حدیث صحیح بخاری (4089) اور صحیح مسلم (677) میں موجود ہے۔ تاہم 'صبح کی نماز میں ہمیشہ قنوت پڑھنے' کا اضافہ امام احمد اور دارقطنی نے روایت کیا ہے، جسے محققین کی اکثریت نے ضعیف قرار دیا ہے۔",
    "english": "The main Hadith is Sahih, reported by Al-Bukhari (4089) and Muslim (677). The addition regarding 'continuous Qunut in Fajr' reported by Ahmad and Ad-Daraqutni is considered weak (Dha'if) by most Hadith scholars."
  },
  "importantWords": [
    {
      "arabic": "قَنَتَ",
      "english": "Stood in supplication (Qunut)",
      "urdu": "دعا کی / قنوت پڑھی"
    },
    {
      "arabic": "بَعْدَ اَلرُّكُوعِ",
      "english": "After bowing",
      "urdu": "رکوع کے بعد"
    },
    {
      "arabic": "يَدْعُو",
      "english": "Supplicating/Invoking",
      "urdu": "بددعا کر رہے تھے"
    },
    {
      "arabic": "تَرَكَهُ",
      "english": "He left/stopped it",
      "urdu": "اسے چھوڑ دیا"
    },
    {
      "arabic": "فَارَقَ اَلدُّنْيَا",
      "english": "Left the world (passed away)",
      "urdu": "دنیا سے رخصت ہوئے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قنوتِ نازلہ کے مشروع ہونے اور اس کے وقت (رکوع کے بعد) کی وضاحت کرتی ہے۔ صبح کی نماز میں مستقل قنوت کے بارے میں مروی اضافہ علمی طور پر بحث طلب ہے۔",
    "english": "This Hadith explains the legality of Qunut al-Nazila and its timing after Ruku. The addition about permanent Fajr Qunut is a subject of scholarly debate due to its chain."
  },
  "references": [
    {
      "arabic": "رواه البخاري (4089)",
      "english": "Reported by Al-Bukhari (4089)"
    },
    {
      "arabic": "رواه مسلم (677)",
      "english": "Reported by Muslim (677)"
    },
    {
      "arabic": "مسند أحمد (12657)",
      "english": "Musnad Ahmad (12657)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas bin Malik"
      },
      "slug": "anas-bin-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=qunut+e+nazila+ki+haqeeqat+urdu",
  "grade": {
    "arabic": "أصل الحديث صحيح، والزيادة ضعيفة",
    "english": "The core Hadith is Sahih; the addition is weak."
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قنوتِ نازلہ کی مشروعیت",
        "english": "Legitimacy of Qunut al-Nazila"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قنوت کا سبب",
              "english": "Reason for Qunut"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے عرب کے مخصوص قبائل کے خلاف بددعا کے لیے ایک ماہ قنوت پڑھی۔",
                "یہ ان قبائل کی طرف سے مسلمانوں کے ساتھ کی گئی غداری اور دھوکہ دہی کا ردعمل تھا۔",
                "اس سے ثابت ہوتا ہے کہ آفات و مصائب میں دعا کرنا سنت نبوی ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) performed Qunut for a month to invoke curses against certain tribes.",
                "This was a reaction to the betrayal and treachery these tribes showed towards Muslims.",
                "It proves that supplicating during calamities and hardships is a Prophetic Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "قنوت کا وقت",
              "english": "Timing of Qunut"
            },
            "content": {
              "urdu": [
                "حدیث سے واضح ہے کہ آپ ﷺ نے قنوت رکوع سے سر اٹھانے کے بعد پڑھی۔",
                "اکثر فقہاء کے نزدیک قنوتِ نازلہ کا صحیح وقت رکوع کے بعد ہی ہے۔",
                "اس طریقہ کار کو اپنانا نماز میں سنت کی پیروی کی علامت ہے۔"
              ],
              "english": [
                "The Hadith clarifies that the Prophet (PBUH) performed Qunut after rising from Ruku.",
                "Most jurists agree that the correct time for Qunut al-Nazila is after the bowing position.",
                "Following this procedure is a sign of adhering to the Sunnah during prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "قنوتِ فجر کی بحث",
        "english": "Discussion on Fajr Qunut"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستقل قنوت کا حکم",
              "english": "Ruling on Permanent Qunut"
            },
            "content": {
              "urdu": [
                "روایت کا دوسرا حصہ صبح کی نماز میں دائمی قنوت کا ذکر کرتا ہے۔",
                "محدثین کے نزدیک یہ اضافہ سند کے لحاظ سے کمزور اور غیر مستند ہے۔",
                "یہی وجہ ہے کہ جمہور علماء اسے مستقل سنت نہیں مانتے۔"
              ],
              "english": [
                "The second part of the narration mentions permanent Qunut in the Fajr prayer.",
                "Scholars of Hadith consider this addition weak and unauthentic in its chain.",
                "This is why the majority of scholars do not view it as a permanent Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "علماء کا موقف",
              "english": "Scholarly Stance"
            },
            "content": {
              "urdu": [
                "شافعی اور مالکی فقہاء بعض روایات کی بنا پر فجر میں قنوت کے قائل ہیں۔",
                "دیگر فقہاء بشمول حنفی و حنبلی اسے صرف آفات کے وقت کے لیے خاص سمجھتے ہیں۔",
                "مسلمانوں کو ایسے اختلافی مسائل میں باہمی وسعت نظری کا مظاہرہ کرنا چاہیے۔"
              ],
              "english": [
                "Shafi'i and Maliki jurists advocate for Fajr Qunut based on certain narrations.",
                "Other jurists, including Hanafi and Hanbali, restrict it to times of calamity.",
                "Muslims should maintain tolerance and broad-mindedness in such juristic differences."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کی اہمیت",
        "english": "Importance of Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مظلوم کی پکار",
              "english": "Call of the Oppressed"
            },
            "content": {
              "urdu": [
                "قنوتِ نازلہ اس بات کی دلیل ہے کہ اللہ سے مدد مانگنا مومن کا ہتھیار ہے۔",
                "جب مسلمان مشکل میں ہوں تو اجتماعی دعا کا اہتمام کیا جا سکتا ہے۔",
                "اللہ تعالیٰ اپنے بندوں کی پکار کو ضرور سنتا ہے اور حالات بدلتا ہے۔"
              ],
              "english": [
                "Qunut al-Nazila is evidence that seeking Allah's help is a believer's weapon.",
                "Collective supplications can be organized when Muslims are in distress.",
                "Allah Almighty certainly hears the calls of His servants and changes situations."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا میں اعتدال",
              "english": "Moderation in Prayer"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ایک ماہ بعد اسے ترک کر دیا، جو کہ مقصد کے حصول کی طرف اشارہ ہے۔",
                "دعا میں خشوع و خضوع اور سنت کے مطابق الفاظ کا انتخاب ضروری ہے۔",
                "شرعی حدود کے اندر رہتے ہوئے بددعا صرف ظالموں کے لیے جائز ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) stopped after a month, indicating the fulfillment of the purpose.",
                "Humility and the selection of Sunnah-based words are essential in supplication.",
                "Invoking curses is only permissible against oppressors within Sharia limits."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تعلیمی اسباق",
        "english": "Juristic and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی پیروی",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "نماز کی ہر حرکت میں سنت نبوی کا لحاظ رکھنا ایمان کا تقاضا ہے۔",
                "روایات کی تحقیق کے بغیر کسی عمل کو مستقل سنت نہیں بنانا چاہیے۔",
                "صحیح احادیث کی روشنی میں عبادات کی اصلاح ضروری ہے۔"
              ],
              "english": [
                "Observing the Prophetic Sunnah in every prayer posture is a demand of faith.",
                "An action should not be made a permanent Sunnah without verifying narrations.",
                "Reforming acts of worship in the light of Sahih Hadith is necessary."
              ]
            }
          },
          {
            "title": {
              "urdu": "اتحادِ امت",
              "english": "Unity of the Ummah"
            },
            "content": {
              "urdu": [
                "فقہی اختلافات کو نفرت اور تفرقے کا ذریعہ نہیں بنانا چاہیے۔",
                "ہر مکتب فکر کے پاس اپنے موقف کے لیے دلائل موجود ہوتے ہیں۔",
                "اسلامی تعلیمات کا اصل مقصد مسلمانوں کے دلوں کو جوڑنا ہے۔"
              ],
              "english": [
                "Juristic differences should not be made a source of hatred or division.",
                "Every school of thought has its own arguments to support its stance.",
                "The primary goal of Islamic teachings is to unite the hearts of Muslims."
              ]
            }
          }
        ]
      }
    }
  ]
}
