{
  "hadithId": 257,
  "hadithNo": 48,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/48"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ لَهُ : \" أُوصِيكَ يَا مُعَاذُ : لَا تَدَعَنَّ دُبُرَ كُلِّ صَلَاةٍ أَنْ تَقُولُ : اَللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ } رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَالنَّسَائِيُّ بِسَنَدٍ قَوِيٍّ . ",
    "urdu": "سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے فرمایا ” اے معاذ! میں تمہیں وصیت کرتا ہوں ہر نماز کے اختتام کے بعد ان کلمات کو کبھی فراموش نہ کرنا «اللهم أعني على ذكرك وشكرك وحسن عبادتك» اے اللہ! میری مدد فرما کہ میں تیرا ذکر کروں، تیرا شکر ادا کر سکوں اور عمدہ و بہتر طریقے سے تیری عبادت کر سکوں۔“ اسے احمد، ابوداؤد اور نسائی نے قوی سند کے ساتھ روایت کیا ہے۔ ",
    "english": "Narrated Mu'adh bin Jabal (RA): Allah's Messenger (PBUH) said to him, 'I advise you, O Mu'adh, do not fail to say after every prayer: O Allah, help me in remembering You, thanking You, and worshipping You in the best manner.' [Reported by Ahmad, Abu Dawud and an-Nasa'i with a strong chain]."
  },
  "takhreej": {
    "arabic": "صحيح . رواه أحمد (22119)، وأبو داود (1522)، والنسائي (1303)، وابن حبان (2021). وهذا الحديث يُعرف بـ'المسلسل بالمحبة' لأن كل راوٍ قال لمن بعده: إني أحبك فقل.",
    "urdu": "یہ حدیث صحیح ہے، اسے احمد، ابوداؤد اور نسائی نے روایت کیا ہے۔ یہ حدیث 'مسلسل بالمحبہ' کہلاتی ہے کیونکہ ہر راوی نے اپنے شاگرد سے محبت کا اظہار کر کے یہ وصیت نقل کی ہے۔",
    "english": "Sahih. Reported by Ahmad (22119), Abu Dawud (1522), and an-Nasa'i (1303). This is a famous 'Hadith Musalsal bil-Mahabbah' where each narrator told the next that he loved him."
  },
  "importantWords": [
    {
      "arabic": "أُوصِيكَ",
      "english": "I advise/enjoin you",
      "urdu": "میں تمہیں وصیت کرتا ہوں"
    },
    {
      "arabic": "لَا تَدَعَنَّ",
      "english": "Do not leave/fail",
      "urdu": "ہرگز نہ چھوڑنا"
    },
    {
      "arabic": "أَعِنِّي",
      "english": "Help me",
      "urdu": "میری مدد فرما"
    },
    {
      "arabic": "شُكْرِكَ",
      "english": "Thanking You",
      "urdu": "تیرا شکر ادا کرنا"
    },
    {
      "arabic": "حُسْنِ عِبَادَتِكَ",
      "english": "Excellence in worship",
      "urdu": "تیری بہترین عبادت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نبی ﷺ نے سیدنا معاذؓ کو محبت بھری وصیت فرمائی کہ وہ ہر نماز کے بعد ذکر، شکر اور بہترین عبادت کے لیے اللہ سے مدد مانگیں۔",
    "english": "In this Hadith, the Prophet (PBUH) lovingly advised Mu'adh (RA) to seek Allah's help for His remembrance, gratitude, and excellent worship after every prayer."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (1522)",
      "english": "Sunan Abu Dawud (1522)"
    },
    {
      "arabic": "سنن النسائي (1303)",
      "english": "Sunan an-Nasa'i (1303)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "معاذ بن جبل",
        "english": "Mu'adh bin Jabal"
      },
      "slug": "muadh-bin-jabal"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=Allahumma+aini+ala+dhikrika+fazilat+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "محبت اور خیر خواہی",
        "english": "Love and Sincere Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استاد اور شاگرد کا تعلق",
              "english": "Teacher-Student Relationship"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے معاذ بن جبلؓ سے اپنی محبت کا اظہار کر کے اس دعا کی اہمیت بیان فرمائی۔",
                "یہ اسلوب سکھاتا ہے کہ محبت بھرے کلمات نصیحت کو دل میں اتارنے کا بہترین ذریعہ ہیں۔",
                "دین کی تعلیم دینے میں نرمی اور اپنائیت کا ہونا نبوی طریقہ کار ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) expressed his love for Mu'adh before emphasizing this Dua's importance.",
                "This style teaches that loving words are the best way to make advice reach the heart.",
                "Gentleness and a sense of belonging are key in the Prophetic method of religious education."
              ]
            }
          },
          {
            "title": {
              "urdu": "وصیت کی اہمیت",
              "english": "Importance of the Advice"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا 'وصیت کرتا ہوں' کہنا اس دعا کی غیر معمولی اہمیت کو ظاہر کرتا ہے۔",
                "یہ کلمات ایک مومن کے لیے زندگی بھر کا بہترین سرمایہ اور زادِ راہ ہیں۔",
                "معاذ بن جبلؓ نے اس وصیت کو تاحیات نبھایا اور آگے بھی اسی طرح منتقل کیا۔"
              ],
              "english": [
                "The Prophet (PBUH) using the term 'I advise you' shows the extraordinary value of this Dua.",
                "These words are a lifelong treasure and spiritual provision for every believer.",
                "Mu'adh (RA) fulfilled this advice throughout his life and passed it on in the same manner."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "دعا کے تین بنیادی ستون",
        "english": "Three Pillars of the Supplication"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکر اور شکر کی طلب",
              "english": "Seeking Dhikr and Gratitude"
            },
            "content": {
              "urdu": [
                "ذکر سے مراد اللہ کی یاد ہے جو دل کو زندگی اور روح کو بالیدگی بخشتی ہے۔",
                "شکر سے مراد اللہ کی نعمتوں کا اعتراف اور ان کا صحیح استعمال کرنا ہے۔",
                "بندہ اپنے بل بوتے پر نہ ذکر کر سکتا ہے نہ شکر، اس لیے اللہ سے مدد مانگی جاتی ہے۔"
              ],
              "english": [
                "Dhikr refers to the remembrance of Allah which gives life to the heart and soul.",
                "Gratitude (Shukr) means acknowledging Allah's blessings and using them appropriately.",
                "A servant cannot remember or thank Allah on their own; hence divine help is sought."
              ]
            }
          },
          {
            "title": {
              "urdu": "حسنِ عبادت کا مفہوم",
              "english": "Meaning of Excellence in Worship"
            },
            "content": {
              "urdu": [
                "عبادت صرف انجام دینا کافی نہیں بلکہ اسے بہترین طریقے سے ادا کرنا مقصود ہے۔",
                "حسنِ عبادت میں اخلاص، سنت کی پیروی اور خشوع و خضوع کا ہونا لازمی ہے۔",
                "یہ دعا ہمیں عبادت کی مقدار کے بجائے اس کے معیار پر توجہ دینے کا سبق دیتی ہے۔"
              ],
              "english": [
                "Performing worship is not enough; the goal is to perform it in the best possible way.",
                "Excellence (Husn) in worship requires sincerity, following Sunnah, and deep humility.",
                "This Dua teaches us to focus on the quality of our worship rather than just quantity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "توفیقِ الٰہی کی ضرورت",
        "english": "Need for Divine Success (Tawfiq)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی مدد کے بغیر کچھ ممکن نہیں",
              "english": "Nothing is Possible Without Allah's Help"
            },
            "content": {
              "urdu": [
                "یہ دعا بندے کے اس عجز کا اقرار ہے کہ وہ نیکی کرنے میں اللہ کا محتاج ہے۔",
                "اگر اللہ کی توفیق شاملِ حال نہ ہو تو انسان ایک تسبیح بھی نہیں پڑھ سکتا۔",
                "ہر نماز کے بعد یہ مانگنا اس عاجزی کو برقرار رکھنے کا ایک مستقل ذریعہ ہے۔"
              ],
              "english": [
                "This Dua is an admission of the servant's helplessness in performing good deeds without Allah.",
                "If Allah's success (Tawfiq) is not present, one cannot even utter a single glorification.",
                "Asking this after every prayer is a permanent way to maintain this state of humility."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا کا صحیح وقت",
              "english": "Right Time for the Dua"
            },
            "content": {
              "urdu": [
                "دبر کل صلاۃ سے مراد سلام سے ٹھیک پہلے یا سلام پھیرنے کے فوراً بعد کا وقت ہے۔",
                "محدثین کے نزدیک دونوں اوقات میں یہ دعا مانگنا سنت سے ثابت اور جائز ہے۔",
                "نماز کی تکمیل کے وقت اللہ سے آئندہ کی نیکیوں کی مدد مانگنا بہترین اختتام ہے۔"
              ],
              "english": [
                "The term 'end of prayer' refers to either just before the Taslim or right after it.",
                "According to scholars, reciting this at either time is established and permissible.",
                "Seeking help for future good deeds at the completion of a prayer is a perfect ending."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی پر اثر",
        "english": "Impact on Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مثبت سوچ کی تعمیر",
              "english": "Building a Positive Mindset"
            },
            "content": {
              "urdu": [
                "شکر گزاری کا جذبہ انسان کو مایوسی سے نکال کر امید کی طرف لے جاتا ہے۔",
                "ذکر کی عادت انسان کو لایعنی باتوں اور گناہوں سے محفوظ رکھتی ہے۔",
                "یہ دعا بندے کی پوری زندگی کو اللہ کی رضا کے سانچے میں ڈھال دیتی ہے۔"
              ],
              "english": [
                "A sense of gratitude takes a person out of despair and towards hope.",
                "The habit of remembrance (Dhikr) protects a person from vain talk and sins.",
                "This supplication molds the entire life of the servant into the pattern of Allah's pleasure."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنتِ مسلسل کا سبق",
              "english": "Lesson of Continuous Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث محبت کی زنجیر ہے جو صدیوں سے علماء اور طلبہ کے درمیان چل رہی ہے۔",
                "ہمیں بھی چاہیے کہ اپنی اولاد اور دوستوں کو محبت سے یہ دعا سکھائیں۔",
                "نبوی وصیتوں پر عمل پیرا ہونا ہی دونوں جہانوں کی کامیابی کا راز ہے۔"
              ],
              "english": [
                "This Hadith is a chain of love that has existed between scholars and students for centuries.",
                "We should also teach this supplication to our children and friends with love.",
                "Adhering to Prophetic instructions is the secret to success in both worlds."
              ]
            }
          }
        ]
      }
    }
  ]
}
