{
  "hadithId": 217,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ وَائِلِ بْنِ حُجْرٍ ‏- رضى الله عنه ‏- قَالَ : { صَلَّيْتُ مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- فَوَضَعَ يَدَهُ اَلْيُمْنَى عَلَى يَدِهِ اَلْيُسْرَى عَلَى صَدْرِهِ } أَخْرَجَهُ اِبْنُ خُزَيْمَةَ",
    "urdu": "سیدنا وائل بن حجر رضی اللہ عنہ روایت کرتے ہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز ادا کی تو آپ صلی اللہ علیہ وسلم نے اپنا دایاں ہاتھ اپنے بائیں ہاتھ پر رکھ کر سینے پر باندھ لیا۔ (ابن خزیمہ)",
    "english": "Narrated from Wā'il ibn Ḥujr (may Allah be pleased with him) who said: \"I prayed with the Prophet (peace and blessings be upon him), and he placed his right hand over his left hand on his chest.\" Reported by Ibn Khuzaymah."
  },
  "takhreej": {
    "arabic": "صحيح. رواه ابن خزيمة في صحيحه، كتاب الصلاة، باب وضع اليدين على الصدر في الصلاة (479)، والطبراني في المعجم الكبير. الحديث صحيح بشواهده الكثيرة التي تقوي إسناده.",
    "urdu": "صحیح۔ اسے ابن خزیمہ نے صحیحہ، کتاب الصلاة، باب وضع الیدین علی الصدر فی الصلاة (479) میں، اور طبرانی نے المعجم الکبیر میں روایت کیا ہے۔ یہ حدیث کثیر شواہد کی بنا پر صحیح ہے جو اس کی سند کو تقویت دیتے ہیں۔",
    "english": "Authentic (Sahih). Reported by Ibn Khuzaymah in his Sahih, Book of Prayer, Chapter: Placing the two hands on the chest in prayer (479), and by At-Tabarānī in Al-Mu'jam Al-Kabīr. The Hadith is authentic due to its numerous corroborating reports which strengthen its chain."
  },
  "importantWords": [
    {
      "arabic": "صَلَّيْتُ مَعَ",
      "english": "I prayed with",
      "urdu": "میں نے نماز پڑھی"
    },
    {
      "arabic": "وَضَعَ يَدَهُ الْيُمْنَى",
      "english": "He placed his right hand",
      "urdu": "آپ نے اپنا دایاں ہاتھ رکھا"
    },
    {
      "arabic": "عَلَى يَدِهِ الْيُسْرَى",
      "english": "Over his left hand",
      "urdu": "اپنے بائیں ہاتھ پر"
    },
    {
      "arabic": "عَلَى صَدْرِهِ",
      "english": "On his chest",
      "urdu": "اپنے سینے پر"
    },
    {
      "arabic": "ابن خزيمة",
      "english": "Ibn Khuzaymah",
      "urdu": "ابن خزیمہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں قیام کے دوران ہاتھوں کو باندھنے کی مسنون ہیئت کو واضح کرتی ہے۔ نبی صلی اللہ علیہ وسلم اپنا دایاں ہاتھ بائیں ہاتھ پر رکھ کر انہیں سینے پر باندھتے تھے، جو عاجزی، خشوع اور ادبِ الٰہی کو ظاہر کرنے والا طریقہ ہے۔",
    "english": "This Hadith clarifies the Sunnah posture for placing the hands during the standing position (Qiyām) in prayer. The Prophet (PBUH) would place his right hand over his left hand on his chest, a posture that denotes humility, reverence (Khushu'), and respect for Allah."
  },
  "references": [
    {
      "arabic": "صحيح ابن خزيمة، كتاب الصلاة، باب وضع اليدين على الصدر في الصلاة (479)",
      "english": "Sahih Ibn Khuzaymah, Book of Prayer, Chapter: Placing the two hands on the chest in prayer (479)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "وائل بن حجر",
        "english": "Wā'il ibn Ḥujr"
      },
      "slug": "wail-ibn-hujr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قیام میں ہاتھوں کی ہیئت",
        "english": "Posture of Hands in Qiyām (Standing)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سینے پر ہاتھ باندھنا",
              "english": "Placing Hands on the Chest"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کی نماز کی کیفیت میں سب سے واضح اور قوی طریقہ ہاتھوں کو سینے پر باندھنا ثابت ہے۔",
                "دایاں ہاتھ بائیں ہاتھ پر رکھا جاتا ہے، جو اطاعت اور عاجزی کی علامت ہے۔",
                "یہ عمل اس بات کو ظاہر کرتا ہے کہ نماز میں دل کا مقام (سینے) کو مرکزِ توجہ بنانا چاہیے۔"
              ],
              "english": [
                "The most explicit and strongest method proven from the Prophet's prayer is placing the hands on the chest.",
                "The right hand is placed over the left hand, symbolizing submission and humility.",
                "This action indicates that the heart (in the chest) should be the center of attention during prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "دیگر مسنون صورتیں",
              "english": "Other Sunnah Methods"
            },
            "content": {
              "urdu": [
                "بعض دیگر روایات سے ناف کے نیچے یا ناف کے قریب ہاتھ باندھنا بھی منقول ہے، جس میں فقہاء کا اختلاف ہے۔",
                "تاہم، سینے پر ہاتھ باندھنے کی روایت سند کے لحاظ سے زیادہ قوی اور واضح سمجھی جاتی ہے۔",
                "اصل مقصد خشوع کو حاصل کرنا ہے، اور سینے پر ہاتھ باندھنے سے قلب (دل) پر توجہ مرکوز رہتی ہے۔"
              ],
              "english": [
                "Some other narrations mention placing the hands below the navel or near the navel, which is a point of difference among jurists.",
                "However, the narration about placing hands on the chest is considered stronger and clearer in terms of authenticity.",
                "The main goal is achieving Khushu', and placing hands on the chest helps concentrate on the heart."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اطاعت اور انکساری کا مظاہرہ",
        "english": "Demonstration of Obedience and Humility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادب کی ہیئت",
              "english": "The Posture of Respect"
            },
            "content": {
              "urdu": [
                "قدیم عرب اور فارس میں بڑے لوگوں کے سامنے ہاتھ باندھ کر کھڑا ہونا ادب کی علامت تھا۔",
                "نمازی کا اللہ کے حضور ہاتھ باندھنا دراصل اللہ کی عظمت کے سامنے اپنی مکمل تابعداری کا اظہار ہے۔",
                "یہ جسمانی ہیئت دل میں خشوع کے جذبات کو ابھارنے میں بھی مدد دیتی ہے۔"
              ],
              "english": [
                "In ancient Arabia and Persia, standing with hands clasped was a sign of respect before dignitaries.",
                "The worshipper clasping hands before Allah is an expression of complete obedience before His Majesty.",
                "This physical posture also helps in generating feelings of humility in the heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائیں ہاتھ کی فوقیت",
              "english": "Precedence of the Right Hand"
            },
            "content": {
              "urdu": [
                "عام طور پر دایاں ہاتھ بائیں پر رکھنے کی ہدایت دی گئی ہے، جو دائیں ہاتھ کی فضیلت کو ظاہر کرتی ہے۔",
                "نبی صلی اللہ علیہ وسلم ہر اچھے کام میں دائیں ہاتھ سے ابتدا کرنا پسند فرماتے تھے۔",
                "یہ معمولی عمل بھی نماز کی مجموعی ہیئت اور کمالِ عبادت میں شامل ہے۔"
              ],
              "english": [
                "Generally, instructions are given to place the right hand over the left, which shows the preference for the right hand.",
                "The Prophet (PBUH) preferred to start every good action with his right hand.",
                "Even this minor action contributes to the overall posture and perfection of the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سند اور فقہی رہنمائی",
        "english": "Chain of Narration and Juristic Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسن سند کا استدلال",
              "english": "Inference from Hasan Chain"
            },
            "content": {
              "urdu": [
                "ابن خزیمہ کی روایت اگرچہ بذات خود ضعیف سمجھی گئی تھی، مگر شواہد اسے حسن یا صحیح کا درجہ دیتے ہیں۔",
                "نماز کے تمام افعال کو نبی صلی اللہ علیہ وسلم کی واضح سنت سے ثابت کرنا ہی شرعی فرض ہے۔",
                "علماء کی بڑی تعداد نے اسی حدیث کی بنا پر نماز میں سینے پر ہاتھ باندھنے کو راجح قرار دیا ہے۔"
              ],
              "english": [
                "Although Ibn Khuzaymah's narration was initially considered weak, corroborating reports elevate it to Hasan or Sahih status.",
                "It is a religious duty to establish all prayer actions from the clear Sunnah of the Prophet (PBUH).",
                "A large number of scholars have given preference to placing the hands on the chest based on this Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف اور وحدت",
              "english": "Juristic Difference and Unity"
            },
            "content": {
              "urdu": [
                "ہاتھ باندھنے کے مقام (ناف کے نیچے یا سینے پر) پر فقہاء کے درمیان اختلاف موجود ہے۔",
                "تاہم، تمام صورتوں میں نماز صحیح رہتی ہے اور کسی کو دوسرے کو غلط نہیں ٹھہرانا چاہیے۔",
                "مسلمانوں کو چاہیے کہ وہ نبی صلی اللہ علیہ وسلم کی سنت پر عمل کریں، خواہ ان کی فقہی رائے کچھ بھی ہو۔"
              ],
              "english": [
                "There is a difference of opinion among jurists regarding the exact position of placing hands (below the navel or on the chest).",
                "However, the prayer remains valid in all proven postures, and one should not invalidate the practice of others.",
                "Muslims should adhere to the Sunnah of the Prophet (PBUH), regardless of their specific juristic opinion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی پہلو",
        "english": "Spiritual and Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں ٹھہراؤ",
              "english": "Stillness in Prayer"
            },
            "content": {
              "urdu": [
                "قیام میں ہاتھوں کو باندھ کر رکھنا، جسم کو غیر ضروری حرکتوں سے روکنے کا ذریعہ ہے۔",
                "یہ ہیئت دل اور آنکھوں کی توجہ کو ایک ہی مرکز (سینے کے مقام) پر مرکوز رکھتی ہے۔",
                "جس قدر زیادہ سکون ہوگا، اسی قدر روحانی طور پر نماز میں لذت حاصل ہوگی۔"
              ],
              "english": [
                "Clasping the hands during Qiyām is a means of preventing the body from unnecessary movements.",
                "This posture helps focus the attention of the heart and eyes on one spot (the area of the chest).",
                "The greater the physical stillness, the greater the spiritual enjoyment in the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی کی کامل اقتداء",
              "english": "Perfect Emulation of the Prophet"
            },
            "content": {
              "urdu": [
                "نماز کی ہر چھوٹی بڑی تفصیل کو سیکھنا اور اس پر عمل کرنا نبی صلی اللہ علیہ وسلم سے محبت کی دلیل ہے۔",
                "حضرت وائل بن حجر کی روایت نبی صلی اللہ علیہ وسلم کی نماز کے طریقہ کو محفوظ رکھنے میں اہم ہے۔",
                "یہ ہمیں سکھاتا ہے کہ عبادات میں اپنی مرضی کے بجائے نبی صلی اللہ علیہ وسلم کے طریقے کو اپنانا چاہیے۔"
              ],
              "english": [
                "Learning and practicing every small detail of the prayer is evidence of love for the Prophet (PBUH).",
                "Wā'il ibn Ḥujr's narration is vital in preserving the authentic method of the Prophet's prayer.",
                "It teaches us that in worship, we must adopt the Prophet's method rather than following our own preferences."
              ]
            }
          }
        ]
      }
    }
  ]
}
