{
  "hadithId": 225,
  "hadithNo": 16,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ : { كُنَّا نَحْزُرُ قِيَامَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏- فِي اَلظُّهْرِ وَالْعَصْرِ , فَحَزَرْنَا قِيَامَهُ فِي اَلرَّكْعَتَيْنِ اَلْأُولَيَيْنِ مِنْ اَلظُّهْرِ قَدْرَ : (الم تَنْزِيلُ)‏ اَلسَّجْدَةِ .‏ وَفِي اَلْأُخْرَيَيْنِ قَدْرَ اَلنِّصْفِ مِنْ ذَلِكَ .‏ وَفِي اَلْأُولَيَيْنِ مِنْ اَلْعَصْرِ عَلَى قَدْرِ اَلْأُخْرَيَيْنِ مِنْ اَلظُّهْرِ , وَالْأُخْرَيَيْنِ مِنْ اَلْعَصْرِ عَلَى قَدْرِ اَلنِّصْفِ مِنْ ذَلِكَ } رَوَاهُ مُسْلِمٌ .",
    "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ ہم ظہر اور عصر میں نبی کریم صلی اللہ علیہ وسلم کے قیام کا اندازہ لگایا کرتے تھے (کہ آپ دونوں رکعتوں میں کتنا قیام فرماتے تھے)۔ ہم نے اندازہ لگایا کہ آپ صلی اللہ علیہ وسلم ظہر کی پہلی دونوں رکعتوں میں سورۃ «الم تنزيل» (السجدة) کی تلاوت کے برابر قیام فرماتے تھے اور آخری دونوں رکعتوں میں پہلی دونوں سے نصف کے برابر۔ اور عصر کی پہلی دونوں رکعتوں میں ظہر کی آخری دونوں رکعتوں کے برابر اور عصر کی آخری دونوں میں عصر کی پہلی دو رکعتوں سے نصف کے برابر قیام فرماتے تھے۔ (مسلم) ",
    "english": "Narrated from Abū Sa'īd Al-Khudrī (may Allah be pleased with him) who said: \"We used to estimate the standing (Qiyām) of the Messenger of Allah (peace and blessings be upon him) in the Zuhr (Noon) and 'Asr (Afternoon) prayers. We estimated his standing in the first two Rak'ah of Zuhr to be approximately the length of reciting 'Alif Lām Mīm Tanzīl' (Surah As-Sajdah). And in the last two Rak'ah, about half of that. And in the first two Rak'ah of 'Asr, the length of the last two Rak'ah of Zuhr, and in the last two Rak'ah of 'Asr, about half of that.\" Reported by Muslim."
  },
  "takhreej": {
    "arabic": "صحيح. رواه مسلم في كتاب الصلاة، باب القراءة في الظهر والعصر (452). و'نَحْزُرُ' کا معنی ہے 'نُقَدِّرُ' (ہم اندازہ لگاتے تھے)۔",
    "urdu": "صحیح۔ اسے مسلم نے کتاب الصلاة، باب القراءة فی الظھر والعصر (452) میں روایت کیا ہے۔ 'نحزر' کا مطلب ہے 'ہم اندازہ لگاتے تھے'۔",
    "english": "Authentic (Sahih). Reported by Muslim in the Book of Prayer, Chapter: Recitation in Zuhr and 'Asr (452). 'Naḥzur' means 'we used to estimate' or 'calculate'."
  },
  "importantWords": [
    {
      "arabic": "نَحْزُرُ",
      "english": "We used to estimate/calculate",
      "urdu": "ہم اندازہ لگایا کرتے تھے"
    },
    {
      "arabic": "قِيَامَ",
      "english": "Standing (in prayer)",
      "urdu": "قیام"
    },
    {
      "arabic": "الرَّكْعَتَيْنِ الْأُولَيَيْنِ",
      "english": "The first two Rak'ah",
      "urdu": "پہلی دو رکعتیں"
    },
    {
      "arabic": "قَدْرَ",
      "english": "The length of/equivalent to",
      "urdu": "کے برابر/جتنا"
    },
    {
      "arabic": "الم تَنْزِيلُ",
      "english": "Alif Lām Mīm Tanzīl (Surah As-Sajdah)",
      "urdu": "سورۃ الم السجدہ"
    },
    {
      "arabic": "النِّصْفِ مِنْ ذَلِكَ",
      "english": "Half of that",
      "urdu": "اس کا نصف (آدھا)"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سِری نمازوں (ظہر اور عصر) میں نبی صلی اللہ علیہ وسلم کے قیام اور قرأت کی طوالت کی تفصیلات کو عددی انداز میں بیان کرتی ہے۔ اس سے معلوم ہوتا ہے کہ ظہر کی پہلی دو رکعتوں کا قیام تمام نمازوں میں سب سے لمبا ہوتا تھا، پھر عصر کا قیام، اور آخری رکعتوں کا قیام پہلی دو رکعتوں کے مقابلے میں آدھا ہوتا تھا، جس سے نماز میں اعتدال اور توازن کی سنت واضح ہوتی ہے۔",
    "english": "This Hadith numerically details the length of the Prophet's standing (Qiyām) and recitation in the silent prayers (Zuhr and 'Asr). It indicates that the standing in the first two Rak'ah of Zuhr was the longest of all, followed by 'Asr, and the standing in the final two Rak'ah was half the length of the first two. This highlights the Sunnah of balance and moderation in prayer."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الصلاة، باب القراءة في الظهر والعصر (452)",
      "english": "Sahih Muslim, Book of Prayer, Chapter: Recitation in Zuhr and 'Asr (452)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abū Sa'īd Al-Khudrī"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازوں میں قرأت کی طوالت",
        "english": "Length of Recitation in Prayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظہر کی پہلی دو رکعتیں",
              "english": "The First Two Rak'ah of Zuhr"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم ظہر کی پہلی دو رکعتوں کا قیام سورۃ السجدہ (30 آیات) کے برابر لمبا کرتے تھے، جو قرأت کی طوالت کو ظاہر کرتا ہے۔",
                "یہ نمازوں میں سب سے لمبا قیام ہوتا تھا، جس سے مقتدیوں کو کافی وقت ملتا تھا کہ وہ اطمینان سے فاتحہ پڑھیں۔",
                "یہ عمل اس بات پر زور دیتا ہے کہ ظہر کی نماز میں روحانی اور قلبی توجہ کے لیے زیادہ وقت لیا جاتا ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) would lengthen the standing in the first two Rak'ah of Zuhr to the equivalent of reciting Surah As-Sajdah (30 verses), indicating prolonged recitation.",
                "This was the longest standing in all prayers, giving the followers ample time to recite Al-Fātiḥah with composure.",
                "This practice emphasizes taking more time for spiritual and heartfelt focus in the Zuhr prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "ظہر اور عصر کا فرق",
              "english": "Difference Between Zuhr and 'Asr"
            },
            "content": {
              "urdu": [
                "ظہر کی پہلی دو رکعتوں کے مقابلے میں عصر کی پہلی دو رکعتوں کا قیام نصف کے برابر ہوتا تھا۔",
                "اس سے ظاہر ہوتا ہے کہ نبی صلی اللہ علیہ وسلم نے دونوں نمازوں کی قرأت کی طوالت میں فرق رکھا ہے۔",
                "عصر کا وقت چونکہ دن کے اختتام پر ہوتا ہے، اس لیے قیام کو ظہر کے مقابلے میں ہلکا رکھا جاتا تھا۔"
              ],
              "english": [
                "The standing in the first two Rak'ah of 'Asr was about half the length of that in Zuhr.",
                "This indicates that the Prophet (PBUH) maintained a difference in the length of recitation between the two prayers.",
                "Since 'Asr occurs later in the day, the standing was generally kept lighter compared to Zuhr."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز میں اعتدال کا اصول",
        "english": "Principle of Moderation in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آخری رکعتوں کی تخفیف",
              "english": "Shortening the Final Rak'ah"
            },
            "content": {
              "urdu": [
                "ظہر اور عصر کی آخری دو رکعتوں کا قیام پہلی دو رکعتوں کے نصف کے برابر ہوتا تھا، جو تخفیف کی سنت ہے۔",
                "آخری رکعتوں میں صرف سورۃ فاتحہ پر اکتفا کرنا سنت ہے، جس سے نماز میں اعتدال برقرار رہے۔",
                "یہ طریقہ جماعت میں بھی لوگوں کے لیے آسانی پیدا کرتا ہے، خصوصاً جب لوگ مصروف ہوں۔"
              ],
              "english": [
                "The standing in the last two Rak'ah of Zuhr and 'Asr was half the length of the first two, which is the Sunnah of shortening.",
                "Sufficing with only Surah Al-Fātiḥah in the final Rak'ah is Sunnah, maintaining moderation in prayer.",
                "This method also provides ease for people in congregation, especially when they are busy."
              ]
            }
          },
          {
            "title": {
              "urdu": "اجمالی اندازہ (حزر)",
              "english": "General Estimation (Ḥazr)"
            },
            "content": {
              "urdu": [
                "صحابی کا قرأت کا اندازہ لگانا یہ بتاتا ہے کہ نبی صلی اللہ علیہ وسلم کی قرأت اتنی باقاعدہ اور متوازن ہوتی تھی۔",
                "'نحزر' (ہم اندازہ لگاتے تھے) کا لفظ یہ ظاہر کرتا ہے کہ صحابہؓ ہر عمل کو غور سے دیکھتے اور نقل کرتے تھے۔",
                "یہ اعداد و شمار نمازیوں کے لیے ایک عمومی معیار فراہم کرتے ہیں، نہ کہ ہر بار ایک ہی مقدار میں پڑھنا فرض ہے۔"
              ],
              "english": [
                "The Companion estimating the recitation shows that the Prophet's recitation was highly regular and balanced.",
                "The word 'Naḥzur' (we used to estimate) indicates that the Companions observed and transmitted every action carefully.",
                "These figures provide a general standard for worshippers, not a strict obligation to recite the exact same length every time."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور تربیتی حکمت",
        "english": "Juristic and Educational Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی طوالت کی حد",
              "english": "Limit of Prayer Length"
            },
            "content": {
              "urdu": [
                "یہ حدیث نماز کی طوالت کی ایک مسنون حد متعین کرتی ہے، جس پر اماموں کو عمل کرنا چاہیے۔",
                "نماز کو لمبا کرنا جائز ہے، لیکن اتنا نہیں کہ مقتدیوں پر مشقت ہو اور وہ جماعت سے دور بھاگیں۔",
                "امام کو نماز کی امامت کے دوران لوگوں کے حالات اور کاموں کا بھی خیال رکھنا چاہیے۔"
              ],
              "english": [
                "This Hadith establishes a Sunnah limit for the length of prayer, which Imāms should adhere to.",
                "It is permissible to lengthen the prayer, but not so much that it burdens the followers and drives them away from the congregation.",
                "The Imām should also consider the circumstances and duties of the people while leading the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "سِری نماز میں بھی قرأت",
              "english": "Recitation even in Silent Prayer"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر سِری نمازوں (ظہر، عصر) میں بھی سورۃ فاتحہ کے بعد مزید سورتیں پڑھنے کو ثابت کرتی ہے۔",
                "کچھ فقہاء صرف فاتحہ کو ضروری قرار دیتے ہیں، لیکن سنت کے مطابق اضافی قرأت افضل ہے۔",
                "یہ عمل قرأت کے حق کو پورا کرتا ہے اور نماز کے قیام میں مشغولیت کو بڑھاتا ہے۔"
              ],
              "english": [
                "This Hadith clearly proves the recitation of additional Surahs after Al-Fātiḥah even in silent prayers (Zuhr, 'Asr).",
                "Some jurists deem only Al-Fātiḥah necessary, but additional recitation is preferable according to the Sunnah.",
                "This practice fulfills the right of recitation and increases engagement during the standing posture of the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی پیغام",
        "english": "Spiritual and Educational Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی کا اسوہ",
              "english": "The Prophet's Example (Uswah)"
            },
            "content": {
              "urdu": [
                "صحابی کا نبی صلی اللہ علیہ وسلم کی نماز کی ہر تفصیل کو محفوظ رکھنا اتباعِ سنت کا بہترین نمونہ ہے۔",
                "یہ حدیث ہمیں ہر عبادت کو مسنون طریقے سے ادا کرنے کی اہمیت کو واضح کرتی ہے۔",
                "نبی کا یہ طریقہ ہر امام کے لیے ایک معیار ہے جس پر عمل کرنا باعثِ اجر ہے۔"
              ],
              "english": [
                "The Companion's act of preserving every detail of the Prophet's prayer is the best example of following the Sunnah.",
                "This Hadith clarifies the importance of performing every act of worship according to the prescribed Sunnah method.",
                "This method is a standard for every Imām, and adhering to it brings reward."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز میں خشوع",
              "english": "Khushu' in Prayer"
            },
            "content": {
              "urdu": [
                "لمبی قرأت اور قیام کے دوران اللہ کے کلام پر غور کرنا خشوع کو بڑھاتا ہے۔",
                "آخری رکعتوں کی تخفیف مقتدیوں کے لیے آسانی اور دل کے لیے فرحت کا باعث ہے۔",
                "نماز کو اعتدال سے ادا کرنا دراصل اللہ کے ساتھ گہرے تعلق کو یقینی بناتا ہے۔"
              ],
              "english": [
                "Longer recitation and contemplating Allah's word during Qiyām enhance Khushu'.",
                "Shortening the final Rak'ah provides ease for the followers and relief for the heart.",
                "Performing the prayer with moderation ensures a deeper connection with Allah."
              ]
            }
          }
        ]
      }
    }
  ]
}
