{
  "hadithId": 232,
  "hadithNo": 23,
  "hadithReferences": {
    "sunnah.com": ["Sahih al-Bukhari 789", "Sahih Muslim 392"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏-‏-رَضِيَ اَللَّهُ عَنْهُ‏-‏- قَالَ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا قَامَ إِلَى اَلصَّلَاةِ يُكَبِّرُ حِينَ يَقُومُ , ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ , ثُمَّ يَقُولُ : \"سَمِعَ اَللَّهُ لِمَنْ حَمِدَهُ\" حِينَ يَرْفَعُ صُلْبَهُ مِنْ اَلرُّكُوعِ , ثُمَّ يَقُولُ وَهُوَ قَائِمٌ : \"رَبَّنَا وَلَكَ اَلْحَمْدُ\" ثُمَّ يُكَبِّرُ حِينَ يَهْوِي سَاجِدًا , ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ, ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ , ثُمَّ يَفْعَلُ ذَلِكَ فِي اَلصَّلَاةِ كُلِّهَا , وَيُكَبِّرُ حِينَ يَقُومُ مِنْ اِثْنَتَيْنِ بَعْدَ اَلْجُلُوسِ } مُتَّفَقٌ عَلَيْهِ .",
    "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز کیلئے کھڑے ہوتے تو «الله اكبر» کہتے۔ پھر جب رکوع کیلئے جاتے تو اس وقت «الله اكبر» کہتے۔ پھر رکوع سے اٹھتے وقت «سمع الله لمن حمده» کہتے ہوئے کھڑے ہو جاتے اور پھر جب رکوع سے سیدھے کھڑے ہو جاتے تو «ربنا ولك الحمد» کہتے۔ پھر سجدے میں جاتے وقت تکبیر «الله اكبر» کہہ کر سجدے کیلئے جھکتے پھر سجدے سے اٹھتے ہوئے «الله اكبر» کہتے پھر سجدے میں جاتے تو «الله اكبر» کہتے پھر سجدے سے سر اٹھاتے ہوئے «الله اكبر» کہتے پھر ساری نماز اسی طرح کرتے جاتے تھے۔ پھر جب دوسری رکعت کی (تکمیل) کے بعد تشہد پڑھ کر اٹھتے تو بھی «الله اكبر» کہتے۔ (بخاری و مسلم)",
    "english": "Narrated Abu Hurairah (May Allah be pleased with him): When the Messenger of Allah (ﷺ) stood up for prayer, he would say *'Allahu Akbar'* (Allah is the greatest) when standing, then say *'Allahu Akbar'* when bowing (Ruku'). Then he would say, *'Sami Allahu liman hamidah'* (Allah hears those who praise Him) when raising his back from the Ruku', and then, while standing straight, he would say, *'Rabbana wa lakal-hamd'* (Our Lord, and to You is the praise). Then he would say *'Allahu Akbar'* when descending for prostration (Sujud), then *'Allahu Akbar'* when raising his head (from the first Sujud), then *'Allahu Akbar'* when prostrating (for the second Sujud), then *'Allahu Akbar'* when raising his head (from the second Sujud). He would do this throughout the entire prayer, and he would say *'Allahu Akbar'* when standing up from the sitting after two Rak'ahs (for the third Rak'ah)."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (789)‏ ، ومسلم (392)‏ .‏ هذا الحديث يوضح صفة صلاة النبي صلى الله عليه وسلم والأذكار الانتقالية فيها، وهي أصل صفة الصلاة عند جماهير الفقهاء.",
    "urdu": "صحیح متفق علیہ روایت۔ اسے بخاری (789) اور مسلم (392) نے روایت کیا ہے۔ یہ حدیث نبی اکرم ﷺ کی نماز کے طریقہ کار اور اس میں حرکت کے دوران کہے جانے والے اذکار کو واضح کرتی ہے، اور یہ جمہور فقہاء کے نزدیک نماز کی کیفیت کا بنیادی ماخذ ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (789) and Muslim (392). This Hadith clearly demonstrates the manner of the Prophet's (ﷺ) prayer and the transitional remembrance (Takbirat) within it, which is considered the fundamental basis for describing the prayer by the majority of jurists."
  },
  "importantWords": [
    {
      "arabic": "يُكَبِّرُ",
      "english": "He says 'Allahu Akbar'",
      "urdu": "آپ تکبیر کہتے"
    },
    {
      "arabic": "يَرْفَعُ صُلْبَهُ",
      "english": "He raises his back",
      "urdu": "وہ اپنی کمر اٹھاتے"
    },
    {
      "arabic": "يَهْوِي سَاجِدًا",
      "english": "He descends to prostrate",
      "urdu": "وہ سجدے کے لیے جھکتے"
    },
    {
      "arabic": "رَبَّنَا وَلَكَ اَلْحَمْدُ",
      "english": "Our Lord, and to You is praise",
      "urdu": "اے ہمارے رب، تیرے ہی لیے حمد ہے"
    },
    {
      "arabic": "سَمِعَ اَللَّهُ لِمَنْ حَمِدَهُ",
      "english": "Allah hears those who praise Him",
      "urdu": "اللہ نے اسے سن لیا جس نے اس کی تعریف کی"
    },
    {
      "arabic": "اَلصَّلَاةِ كُلِّهَا",
      "english": "The entire prayer",
      "urdu": "ساری نماز"
    },
    {
      "arabic": "اِثْنَتَيْنِ",
      "english": "Two (rak'ahs)",
      "urdu": "دو رکعتوں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم ﷺ کی نماز کا مکمل طریقہ بیان کرتی ہے، خاص طور پر نماز کے ارکان میں ایک حالت سے دوسری حالت میں جانے کے تمام اذکار (انتقالی تکبیرات) کی تفصیل فراہم کرتی ہے۔ یہ اس بات پر زور دیتی ہے کہ نماز کے تمام افعال میں اللہ کی کبریائی اور حمد کا اظہار کس طرح کیا جاتا ہے۔",
    "english": "This Hadith provides a detailed description of the Prophet's (ﷺ) prayer, specifically outlining all the transitional remembrances (Takbirat) used when moving between the various pillars of prayer. It emphasizes the continuous declaration of Allah's greatness and praise throughout the entire prayer sequence."
  },
  "references": [
    {
      "arabic": "رواه البخاري (789)",
      "english": "Reported by Al-Bukhari (789)"
    },
    {
      "arabic": "رواه مسلم (392)",
      "english": "Reported by Muslim (392)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurairah"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A8vN0Jc9K9o",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "انتقالی اذکار کی اہمیت",
        "english": "Importance of Transitional Remembrances"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تکبیراتِ انتقال",
              "english": "Takbirat al-Intiqal (Transitional Takbirs)"
            },
            "content": {
              "urdu": [
                "یہ حدیث نماز کے مختلف افعال کے درمیان کہی جانے والی تمام تکبیرات کو واضح کرتی ہے۔",
                "یہ تکبیرات نماز کے ایک رکن سے دوسرے رکن کی طرف جانے کی علامت ہیں اور اللہ کی عظمت کا اظہار کرتی ہیں۔",
                "جمہور علماء کے نزدیک یہ تکبیرات سنت ہیں، جن کا نماز میں دھیان رکھنا ضروری ہے۔"
              ],
              "english": [
                "This Hadith clarifies all the Takbirs recited when transitioning between the various actions of the prayer.",
                "These Takbirs symbolize the movement from one pillar to the next and declare the greatness of Allah.",
                "According to the majority of scholars, these transitional Takbirs are Sunnah (recommended), and attention must be paid to them in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبیر کا مقصد",
              "english": "The Purpose of Takbir"
            },
            "content": {
              "urdu": [
                "ہر حرکت پر 'اللہ اکبر' کہنے کا مطلب ہے کہ بندہ ہر حالت میں اللہ کی کبریائی کو محسوس کرے۔",
                "یہ تکبیرات بھول چوک سے بچنے اور نماز میں خشوع کو برقرار رکھنے میں مدد دیتی ہیں۔",
                "تکبیر کا مقصد اللہ کی عظمت کو اپنی ہر حرکت پر غالب کرنا ہے تاکہ دل دنیا سے منقطع رہے۔"
              ],
              "english": [
                "Saying 'Allahu Akbar' with every movement means the servant realizes Allah's greatness in every posture.",
                "These Takbirs help avoid forgetfulness and maintain concentration (Khushu') throughout the prayer.",
                "The purpose of Takbir is to prioritize Allah's majesty over every action, keeping the heart detached from the world."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "رکوع اور قیام کے اذکار",
        "english": "Remembrances in Ruku' and Standing"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکوع سے اٹھنے کا ذکر",
              "english": "Remembrance of Rising from Ruku'"
            },
            "content": {
              "urdu": [
                "رکوع سے اٹھتے وقت امام، مقتدی اور اکیلا نمازی سب 'سمع الله لمن حمده' کہیں۔",
                "اس کے بعد سیدھا کھڑے ہو کر 'ربنا ولك الحمد' کہنا نبی اکرم ﷺ کا معمول تھا۔",
                "یہ اذکار اس بات کا اعتراف ہیں کہ اللہ اس کی سنتا ہے جو اس کی تعریف کرتا ہے اور ہم اس کے بدلے میں حمد کرتے ہیں۔"
              ],
              "english": [
                "Upon rising from Ruku', the Imam, follower, and individual worshipper should all say 'Sami Allahu liman hamidah'.",
                "Following this, standing straight, the phrase 'Rabbana wa lakal-hamd' was the consistent practice of the Prophet (ﷺ).",
                "These phrases acknowledge that Allah hears those who praise Him, and in response, we offer that praise."
              ]
            }
          },
          {
            "title": {
              "urdu": "حمد کی تاکید",
              "english": "Emphasis on Praise (Hamd)"
            },
            "content": {
              "urdu": [
                "'ربنا ولك الحمد' کے ذریعے بندہ اللہ کی تعریف اور شکر گزاری کا اظہار کرتا ہے۔",
                "حمد صرف زبان سے نہیں بلکہ دل میں اللہ کی نعمتوں کا اعتراف بھی شامل ہے۔",
                "اس جگہ مزید طویل حمد (مثلاً حمداً كثيراً طيباً مباركاً فيه) پڑھنا بھی سنت سے ثابت ہے۔"
              ],
              "english": [
                "Through 'Rabbana wa lakal-hamd,' the servant expresses gratitude and praise to Allah.",
                "Praise (Hamd) involves not just the tongue but also the heartfelt acknowledgment of Allah's favors.",
                "Reciting further elaborated praises (like 'Hamdan kathiran tayyiban mubarakan fih') is also established in the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کی کیفیت اور فقہی مسائل",
        "english": "Manner of Prayer and Jurisprudence"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہر حرکت میں تکبیر",
              "english": "Takbir in Every Movement"
            },
            "content": {
              "urdu": [
                "حدیث میں وضاحت ہے کہ رکوع، سجدے میں جاتے ہوئے اور ان سے اٹھتے ہوئے تکبیر کہی جائے۔",
                "سجدے کی حرکت میں جھکتے وقت اور سجدے سے اٹھتے وقت دونوں بار تکبیر کہی جاتی ہے۔",
                "صحیح قول کے مطابق ساری نماز میں یہ اذکار تمام حرکات کے ساتھ مکمل ادا کیے جاتے ہیں۔"
              ],
              "english": [
                "The Hadith clarifies that Takbir is said when descending into Ruku', going into Sujud, and rising from both.",
                "In the prostration sequence, Takbir is said both when descending for Sujud and when rising from it.",
                "The soundest opinion is that these remembrances are fully executed with all movements throughout the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "دو رکعتوں کے بعد اٹھنا",
              "english": "Rising after Two Rak'ahs"
            },
            "content": {
              "urdu": [
                "جب نمازی تشہدِ اول کے بعد تیسری رکعت کے لیے کھڑا ہوتا ہے تو بھی 'اللہ اکبر' کہتا ہے۔",
                "یہ 'اللہ اکبر' قیام کے لیے منتقل ہونے کی علامت ہے اور باقی نماز اسی طرح جاری رکھی جاتی ہے۔",
                "یہ طریقہ تین یا چار رکعت والی نمازوں کے لیے مخصوص ہے، جیسے ظہر، عصر، مغرب اور عشاء۔"
              ],
              "english": [
                "When the worshipper stands up for the third Rak'ah after the first Tashahhud, they also say 'Allahu Akbar'.",
                "This 'Allahu Akbar' marks the transition to standing and the continuation of the rest of the prayer in the same manner.",
                "This method is specific to prayers consisting of three or four units (Rak'ahs), such as Dhuhr, Asr, Maghrib, and Isha."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز میں وقار اور اطمینان",
        "english": "Tranquility and Dignity in Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اطمینان کی اہمیت",
              "english": "Importance of Tranquility (Tuma'ninah)"
            },
            "content": {
              "urdu": [
                "ہر حرکت کے ساتھ اذکار کا پڑھنا، نمازی کو رکوع اور سجدے میں اطمینان سے رہنے کی ترغیب دیتا ہے۔",
                "یہ حدیث 'مسیء صلاتہ' (نماز خراب کرنے والے) کی حدیث سے مطابقت رکھتی ہے جو ہر رکن کو ٹھہر کر ادا کرنے کا حکم دیتی ہے۔",
                "اطمینان کے بغیر نماز ناقص ہوتی ہے، اور اذکار اس اطمینان کو یقینی بنانے کا ذریعہ ہیں۔"
              ],
              "english": [
                "Reciting the remembrances with every movement encourages the worshipper to maintain stillness (Tuma'ninah) in Ruku' and Sujud.",
                "This Hadith aligns with the narration of the 'Man who prayed badly,' which commands performing every pillar with composure.",
                "Prayer is deficient without Tuma'ninah, and the prescribed remembrances are a means of ensuring this tranquility."
              ]
            }
          },
          {
            "title": {
              "urdu": "صفة صلاۃ النبی ﷺ",
              "english": "The Description of the Prophet's Prayer"
            },
            "content": {
              "urdu": [
                "یہ حدیث صفتِ صلاۃ النبی ﷺ کے اہم ترین ماخذ میں سے ایک ہے، جس پر عمل کرنا فرض ہے۔",
                "ابوہریرہ رضی اللہ عنہ نے یہ نماز لوگوں کو سکھانے کے لیے خود پڑھ کر بیان کی تھی۔",
                "ہر مسلمان کو چاہیے کہ وہ اپنی نماز کو اس مستند سنت کے مطابق بنانے کی کوشش کرے۔"
              ],
              "english": [
                "This Hadith is one of the most vital sources describing the manner of the Prophet's prayer, the following of which is mandatory.",
                "Abu Hurairah (RA) performed and narrated this prayer specifically to teach the people the correct form.",
                "Every Muslim should strive to perform their prayer in accordance with this authenticated Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
