{
  "hadithId": 256,
  "hadithNo": 47,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/47"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": " وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَنْ سَبَّحَ اَللَّهَ دُبُرَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ , وَحَمِدَ اَللَّهِ ثَلَاثًا وَثَلَاثِينَ , وَكَبَّرَ اَللَّهُ ثَلَاثًا وَثَلَاثِينَ , فَتِلْكَ تِسْعٌ وَتِسْعُونَ , وَقَالَ تَمَامَ اَلْمِائَةِ : لَا إِلَهَ إِلَّا اَللَّهَ وَحْدَهُ لَا شَرِيكَ لَهُ , لَهُ اَلْمُلْكُ , وَلَهُ اَلْحَمْدُ , وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ , غُفِرَتْ لَهُ خَطَايَاهُ , وَإِنْ كَانَتْ مِثْلَ زَبَدِ اَلْبَحْرِ } رَوَاهُ مُسْلِمٌ .‏ وَفِي رِوَايَةٍ أُخْرَى : أَنَّ اَلتَّكْبِيرَ أَرْبَعٌ وَثَلَاثُونَ].‏ ",
    "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے ہر نماز کے بعد 33 مرتبہ سبحان اللہ، 33 مرتبہ الحمد للہ اور 33 مرتبہ اللہ اکبر کہا، تو یہ کل 99 کلمات ہوئے، اور سو پورا کرنے کے لیے 'لا الہ الا اللہ وحدہ لا شریک لہ، لہ الملک ولہ الحمد، وھو علیٰ کل شیء قدیر' کہا، تو اس کے گناہ معاف کر دیے جاتے ہیں چاہے وہ سمندر کی جھاگ کے برابر ہی کیوں نہ ہوں۔“ (مسلم)۔ ایک اور روایت میں ہے کہ تکبیر (اللہ اکبر) 34 مرتبہ کہے۔",
    "english": "Narrated Abu Hurairah (RA): Allah's Messenger (PBUH) said: 'He who recites after every prayer: Subhan-Allah (Glory be to Allah) thirty-three times; Al-hamdu lillah (Praise be to Allah) thirty-three times; Allahu Akbar (Allah is Most Great) thirty-three times; and completes the hundred with: La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu wa huwa 'ala kulli shai'in qadir (There is no god but Allah Alone, Who has no partner; to Him belongs the kingdom and to Him belongs the praise, and He has power over all things) his sins will be forgiven even if they are as abundant as the foam of the sea.' [Reported by Muslim]. In another narration: Takbir (Allahu Akbar) is thirty-four times."
  },
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (597). والرواية التي فيها التكبير أربع وثلاثون هي رواية كعب بن عجرة عند مسلم (596).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام مسلم نے (597) میں روایت کیا ہے۔ 34 مرتبہ تکبیر والی روایت کعب بن عجرہ کی ہے جو مسلم (596) میں موجود ہے۔",
    "english": "Sahih. Reported by Muslim (597). The narration mentioning Takbir thirty-four times is from Ka'b bin 'Ujrah in Muslim (596)."
  },
  "importantWords": [
    {
      "arabic": "سَبَّحَ",
      "english": "Glorified",
      "urdu": "تسبیح کی"
    },
    {
      "arabic": "حَمِدَ",
      "english": "Praised",
      "urdu": "حمد کی"
    },
    {
      "arabic": "كَبَّرَ",
      "english": "Exalted",
      "urdu": "بڑائی بیان کی"
    },
    {
      "arabic": "تَمَامَ",
      "english": "Completion",
      "urdu": "کامل / پورا"
    },
    {
      "arabic": "زَبَدِ اَلْبَحْرِ",
      "english": "Sea foam",
      "urdu": "سمندر کی جھاگ"
    },
    {
      "arabic": "خَطَايَاهُ",
      "english": "His sins",
      "urdu": "اس کی خطائیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز کے بعد تسبیحاتِ فاطمہ کی فضیلت اور گناہوں کی معافی کا عظیم مژدہ سنایا گیا ہے۔",
    "english": "This Hadith highlights the virtue of reciting specific Adhkar after prayer and the promise of extensive forgiveness."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (597)",
      "english": "Sahih Muslim (597)"
    },
    {
      "arabic": "سنن النسائي (1352)",
      "english": "Sunan an-Nasa'i (1352)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة الدوسي",
        "english": "Abu Hurairah ad-Dawsi"
      },
      "slug": "abu-hurairah"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=tasbeeh+fatima+after+salah+fazilat",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ذکرِ الٰہی کی فضیلت",
        "english": "The Virtue of Remembrance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغفرت کا وسیلہ",
              "english": "A Means of Forgiveness"
            },
            "content": {
              "urdu": [
                "نماز کے بعد ان مختصر کلمات کی ادائیگی گناہوں کی معافی کا بہت بڑا ذریعہ ہے۔",
                "اللہ تعالیٰ اپنی رحمت سے بندے کے صغیرہ گناہوں کو یکسر ختم فرما دیتا ہے۔",
                "یہ اجر ان لوگوں کے لیے ہے جو اخلاص کے ساتھ ان اذکار کو پڑھتے ہیں۔"
              ],
              "english": [
                "Reciting these short words after prayer is a great way to earn forgiveness.",
                "Allah, by His mercy, completely erases the minor sins of the servant.",
                "This reward is for those who recite these Adhkar with sincerity."
              ]
            }
          },
          {
            "title": {
              "urdu": "روحانی سکون",
              "english": "Spiritual Tranquility"
            },
            "content": {
              "urdu": [
                "اللہ کی تسبیح اور حمد بیان کرنے سے دل کو اطمینان اور سکون ملتا ہے۔",
                "یہ اذکار نمازی کو دنیا کی فکروں سے نکال کر اللہ کی طرف متوجہ کرتے ہیں۔",
                "ذکرِ الٰہی سے انسان کا تعلق اپنے خالق کے ساتھ مزید مضبوط ہو جاتا ہے۔"
              ],
              "english": [
                "Glorifying and praising Allah brings peace and satisfaction to the heart.",
                "These Adhkar shift the worshipper's focus from worldly worries to Allah.",
                "Through remembrance, a person's connection with their Creator is strengthened."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اذکار کی ترتیب اور تعداد",
        "english": "Sequence and Count of Adhkar"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سو کا عدد مکمل کرنا",
              "english": "Completing the Count of 100"
            },
            "content": {
              "urdu": [
                "تین تسبیحات کے 99 کلمات کے بعد چوتھا کلمہ پڑھ کر 100 مکمل کرنا سنت ہے۔",
                "عدد کی یہ پابندی اللہ کے ہاں خاص اہمیت اور اجر و ثواب کی حامل ہے۔",
                "کلمہ توحید پر تسبیحات کا اختتام عقیدہِ توحید کی تجدید کا نام ہے۔"
              ],
              "english": [
                "After the 99 words of the three tasbihs, completing 100 with the fourth kalima is Sunnah.",
                "Following this specific count holds special significance and reward with Allah.",
                "Ending the tasbihat with the testimony of faith is a renewal of monotheism."
              ]
            }
          },
          {
            "title": {
              "urdu": "مختلف روایات کا تنوع",
              "english": "Diversity in Narrations"
            },
            "content": {
              "urdu": [
                "بعض روایات میں تکبیر (اللہ اکبر) کو 34 مرتبہ پڑھنے کا ذکر بھی آیا ہے۔",
                "دونوں طریقے سنت سے ثابت ہیں اور ان پر باری باری عمل کیا جا سکتا ہے۔",
                "اذکار میں یہ تنوع اللہ کی رحمت اور بندے کے لیے آسانی کی علامت ہے۔"
              ],
              "english": [
                "Some narrations also mention reciting the Takbir (Allahu Akbar) thirty-four times.",
                "Both methods are established from the Sunnah and can be practiced interchangeably.",
                "This diversity in Adhkar signifies Allah's mercy and ease for the servant."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "گناہوں کی معافی کی وسعت",
        "english": "The Extent of Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سمندر کی جھاگ کی مثال",
              "english": "Example of Sea Foam"
            },
            "content": {
              "urdu": [
                "سمندر کی جھاگ کی مثال گناہوں کی کثرت کو بیان کرنے کے لیے دی گئی ہے۔",
                "یہ اللہ کی بے پناہ مغفرت کی وسعت اور اس کی شانِ کریمی کو ظاہر کرتی ہے۔",
                "انسان کو کبھی بھی اپنے گناہوں کی وجہ سے اللہ کی رحمت سے مایوس نہیں ہونا چاہیے۔"
              ],
              "english": [
                "The example of sea foam is used to describe the vast quantity of sins.",
                "This illustrates the immensity of Allah's forgiveness and His noble generosity.",
                "A person should never despair of Allah's mercy due to their sins."
              ]
            }
          },
          {
            "title": {
              "urdu": "صغیرہ اور کبیرہ گناہ",
              "english": "Minor and Major Sins"
            },
            "content": {
              "urdu": [
                "علماء کے مطابق اس طرح کے اذکار سے عام طور پر صغیرہ گناہ معاف ہوتے ہیں۔",
                "کبیرہ گناہوں کی معافی کے لیے سچی توبہ اور حقوق العباد کی تلافی ضروری ہے۔",
                "نیکیوں کی مداومت انسان کو بڑے گناہوں سے بچنے کی توفیق عطا کرتی ہے۔"
              ],
              "english": [
                "According to scholars, such Adhkar generally wipe away minor sins.",
                "For major sins, sincere repentance and fulfilling the rights of others are required.",
                "Consistency in good deeds gives one the strength to avoid major sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی پر اثر",
        "english": "Impact on Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی برکت",
              "english": "Blessing of Time"
            },
            "content": {
              "urdu": [
                "نماز کے بعد چند منٹ اذکار کے لیے وقف کرنا پورے دن کے کاموں میں برکت لاتا ہے۔",
                "یہ عمل انسان کو جلد بازی سے روک کر صبر و تحمل کی مشق کرواتا ہے۔",
                "سنتِ نبوی پر عمل پیرا ہونے سے زندگی میں نظم و ضبط پیدا ہوتا ہے۔"
              ],
              "english": [
                "Dedicating a few minutes to Adhkar after prayer brings barakah to daily tasks.",
                "This practice restrains hastiness and trains a person in patience and self-control.",
                "Following the Prophetic Sunnah instills discipline within one's life."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائمی تعلق مع اللہ",
              "english": "Permanent Connection with Allah"
            },
            "content": {
              "urdu": [
                "پانچوں وقت ان تسبیحات کی تکرار اللہ کی یاد کو دل میں تازہ رکھتی ہے۔",
                "یہ اذکار بندے کو غفلت سے نکال کر ہوشیار اور بیدار رکھتے ہیں۔",
                "روزمرہ کے معمولات میں ذکرِ الٰہی کو شامل کرنا ہی حقیقی کامیابی ہے۔"
              ],
              "english": [
                "Repeating these tasbihat five times a day keeps Allah's remembrance fresh in the heart.",
                "These Adhkar pull the servant out of negligence and keep them spiritually alert.",
                "Incorporating Allah's remembrance into daily routines is the true success."
              ]
            }
          }
        ]
      }
    }
  ]
}
