{
  "hadithId": 249,
  "hadithNo": 40,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/40"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": " وَعَنْ أَبِي مَسْعُودٍ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- قَالَ : { قَالَ بَشِيرُ بْنُ سَعْدٍ: يَا رَسُولَ اَللَّهِ ! أَمَرَنَا اَللَّهُ أَنْ نُصَلِّيَ عَلَيْكَ , فَكَيْفَ نُصَلِّي عَلَيْكَ ? فَسَكَتَ , ثُمَّ قَالَ : \" قُولُوا : اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ , وَعَلَى آلِ مُحَمَّدٍ , كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ , وَبَارِكْ عَلَى مُحَمَّدٍ , وَعَلَى آلِ مُحَمَّدٍ , كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي اَلْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ .‏ وَالسَّلَامُ كَمَا عَلَّمْتُكُمْ } رَوَاهُ مُسْلِمٌ وَزَادَ اِبْنُ خُزَيْمَةَ فِيهِ : { فَكَيْفَ نُصَلِّي عَلَيْكَ , إِذَا نَحْنُ صَلَّيْنَا عَلَيْكَ فِي صَلَاتِنَا } .‏",
    "urdu": "سیدنا ابومسعود انصاری رضی اللہ عنہ روایت کرتے ہیں کہ بشیر بن سعد رضی اللہ عنہ نے عرض کیا یا رسول اللہ! اللہ تعالیٰ نے ہمیں آپ صلی اللہ علیہ وسلم پر درود بھیجنے کا حکم ارشاد فرمایا ہے لہذا ہم کس طرح آپ پر درود بھیجیں؟ تھوڑے سے توقف کے بعد فرمایا ”اس طرح کہا کرو: اللّٰھُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَّعَلٰی اٰلِ مُحَمَّدٍ کَمَا صَلَّیْتَ عَلٰی اٰلِ اِبْرَاھِیْمَ وَبَارِکْ عَلٰی مُحَمَّدٍ وَّعَلٰی اٰلِ مُحَمَّدٍ کَمَا بَارَکْتَ عَلٰی اٰلِ اِبْرَاھِیْمَ فِی الْعَالَمِیْنَ اِنَّکَ حَمِیْدٌ مَّجِیْدٌ۔ اے اللہ! محمد (صلی اللہ علیہ وسلم) اور آل محمد پر رحمت نازل فرما جس طرح تو نے آلِ ابراہیم پر رحمت نازل فرمائی اور برکت نازل فرما محمد اور آل محمد پر جس طرح تو نے آلِ ابراہیم پر برکت نازل فرمائی دونوں جہانوں میں۔ یقیناً تو ستودہ صفات اور بزرگ ہے، اور رہا سلام تو اس کا علم تمہیں سکھلا دیا گیا ہے۔“ (مسلم) اور ابن خزیمہ نے یہ اضافہ کیا کہ ہم جب نماز میں ہوں تو درود کس طرح پڑھیں۔",
    "english": "Narrated Abu Mas'ud al-Ansari (RA): Bashir bin Sa'd asked, 'O Messenger of Allah! Allah has commanded us to invoke blessings upon you, so how should we do it?' He remained silent for a while and then said: 'Say: O Allah, bless Muhammad and the family of Muhammad as You blessed the family of Abraham, and grant favors to Muhammad and the family of Muhammad as You granted favors to the family of Abraham in the worlds; surely You are Praiseworthy and Glorious. And the greeting (Salam) is as you have already learned.' [Reported by Muslim]. Ibn Khuzaimah added: 'How should we bless you when we pray in our Salah?'"
  },
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (405) في كتاب الصلاة. وزيادة ابن خزيمة صحيحة السند رواها في صحيحه (711).",
    "urdu": "یہ حدیث صحیح ہے، اسے امام مسلم نے اپنی صحیح (405) میں روایت کیا ہے۔ ابن خزیمہ کا اضافہ بھی صحیح سند کے ساتھ ان کی کتاب (71) میں موجود ہے۔",
    "english": "Sahih. Reported by Muslim (405) in the Book of Prayer. The addition by Ibn Khuzaimah is also authentic and reported in his Sahih (711)."
  },
  "importantWords": [
    {
      "arabic": "آلِ",
      "english": "Family / Followers",
      "urdu": "آل / اولاد و پیروکار"
    },
    {
      "arabic": "بَارِكْ",
      "english": "Grant favors / Bless",
      "urdu": "برکت نازل فرما"
    },
    {
      "arabic": "الْعَالَمِينَ",
      "english": "The worlds",
      "urdu": "تمام جہان"
    },
    {
      "arabic": "حَمِيدٌ",
      "english": "Praiseworthy",
      "urdu": "قابلِ تعریف"
    },
    {
      "arabic": "مَجِيدٌ",
      "english": "Glorious",
      "urdu": "بزرگی والا"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز کے اندر پڑھے جانے والے درودِ ابراہیمی کے الفاظ اور اس کی اہمیت بیان کی گئی ہے جو براہِ راست نبی ﷺ نے سکھائے۔",
    "english": "This Hadith clarifies the wording and importance of Durood-e-Ibrahim as taught directly by the Prophet (PBUH) for use in prayer."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (405)",
      "english": "Sahih Muslim (405)"
    },
    {
      "arabic": "صحيح ابن خزيمة (711)",
      "english": "Sahih Ibn Khuzaimah (711)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو مسعود الأنصاري",
        "english": "Abu Mas'ud al-Ansari"
      },
      "slug": "abu-masud-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=Durood+e+Ibrahim+fazilat+explanation+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "درود کی اہمیت",
        "english": "Significance of Durood"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حکمِ الٰہی کی تعمیل",
              "english": "Fulfilling Divine Command"
            },
            "content": {
              "urdu": [
                "قرآن پاک میں اللہ تعالیٰ نے ایمان والوں کو نبی ﷺ پر درود بھیجنے کا حکم دیا ہے۔",
                "صحابہ کرام نے اس حکم کی عملی صورت جاننے کے لیے نبی ﷺ سے سوال کیا۔",
                "درود پڑھنا اللہ کی محبت اور نبی ﷺ سے وفاداری کا لازمی تقاضا ہے۔"
              ],
              "english": [
                "Allah has commanded believers in the Quran to send blessings upon the Prophet (PBUH).",
                "The Companions asked the Prophet (PBUH) to learn the practical way of fulfilling this.",
                "Reciting Durood is an essential requirement of love for Allah and loyalty to His Prophet."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کا لازمی جزو",
              "english": "Essential Part of Prayer"
            },
            "content": {
              "urdu": [
                "ابن خزیمہ کی روایت سے واضح ہے کہ یہ درود خاص طور پر نماز کے لیے سکھایا گیا۔",
                "تشہد کے بعد درود پڑھنا نماز کی قبولیت اور کمال کے لیے نہایت ضروری ہے۔",
                "بغیر درود کے نماز ادھوری رہتی ہے اور یہ سنتِ مؤکدہ یا واجب کا درجہ رکھتا ہے۔"
              ],
              "english": [
                "Ibn Khuzaimah's narration clarifies that this Durood was taught specifically for Salah.",
                "Reciting Durood after Tashahhud is vital for the acceptance and perfection of prayer.",
                "Prayer remains incomplete without Durood, and it holds the status of Sunnah or Wajib."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "درودِ ابراہیمی کی فضیلت",
        "english": "Virtues of Durood-e-Ibrahim"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سب سے افضل درود",
              "english": "The Most Superior Durood"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ کے سکھائے ہوئے یہ الفاظ تمام درودوں میں سب سے زیادہ افضل ہیں۔",
                "اس میں سیدنا ابراہیم علیہ السلام کی آل کا ذکر کر کے فضیلتِ نبوت کو اجاگر کیا گیا۔",
                "انہی الفاظ کی پابندی کرنا اجر و ثواب کے لحاظ سے سب سے زیادہ باعثِ برکت ہے۔"
              ],
              "english": [
                "These words taught by the Prophet (PBUH) are the most superior among all forms of Durood.",
                "Mentioning the family of Abraham (AS) highlights the continuity of prophetic virtue.",
                "Adhering to these specific words is the most rewarding and blessed practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "رحمت اور برکت کا حصول",
              "english": "Gaining Mercy and Blessings"
            },
            "content": {
              "urdu": [
                "اس دعا میں نبی ﷺ کے لیے رحمت (صلی) اور برکت (بارک) دونوں طلب کی گئی ہیں۔",
                "ایک بار درود پڑھنے والے پر اللہ تعالیٰ دس رحمتیں نازل فرماتا ہے۔",
                "یہ درود دنیا اور آخرت کی پریشانیوں کے حل کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "In this prayer, both Mercy (Salah) and Blessings (Barakah) are sought for the Prophet.",
                "Allah sends ten mercies upon the one who recites Durood just once.",
                "This Durood is an excellent means for resolving worldly and afterlife anxieties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "آلِ محمد سے مراد",
        "english": "Meaning of Aal-e-Muhammad"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاندان اور پیروکار",
              "english": "Family and Followers"
            },
            "content": {
              "urdu": [
                "آل سے مراد نبی کریم ﷺ کا خاندان اور آپ کی سچی پیروی کرنے والے ہیں۔",
                "اس دعا میں پوری امتِ مسلمہ کے لیے بالواسطہ برکت کی دعا شامل ہے۔",
                "اہلِ بیت کی محبت اور ان کے لیے دعا ایمان کا ایک اہم حصہ ہے۔"
              ],
              "english": [
                "Aal refers to the family of the Prophet (PBUH) and his true, sincere followers.",
                "This supplication indirectly includes a prayer for the entire Muslim Ummah.",
                "Love for the Ahl al-Bayt and praying for them is a significant part of faith."
              ]
            }
          },
          {
            "title": {
              "urdu": "انبیاء کا تسلسل",
              "english": "Continuity of Prophets"
            },
            "content": {
              "urdu": [
                "سیدنا ابراہیم کو 'ابوالانبیاء' کہا جاتا ہے، ان سے نسبت ایک عظیم شرف ہے۔",
                "اللہ نے جس طرح ابراہیم علیہ السلام کی نسل میں برکت دی، ویسے ہی محمد ﷺ کے لیے مانگی گئی۔",
                "یہ دعا توحید اور رسالت کے گہرے تعلق کو واضح کرتی ہے۔"
              ],
              "english": [
                "Abraham (AS) is called the Father of Prophets; association with him is a great honor.",
                "As Allah blessed the lineage of Abraham, similar blessings are sought for Muhammad (PBUH).",
                "This prayer clarifies the deep connection between Monotheism and Prophethood."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "درست تلفظ کی اہمیت",
              "english": "Importance of Correct Pronunciation"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ درودِ ابراہیمی کے الفاظ کو درست تلفظ کے ساتھ یاد کریں۔",
                "نماز میں سکون اور توجہ کے ساتھ ان الفاظ کی ادائیگی کرنی چاہیے۔",
                "غلطی سے بچنے کے لیے علماء سے الفاظ کی تصحیح کروانا بہتر ہے۔"
              ],
              "english": [
                "Muslims should memorize the words of Durood-e-Ibrahim with correct pronunciation.",
                "These words should be recited with tranquility and focus during the prayer.",
                "It is better to have the words corrected by scholars to avoid mistakes."
              ]
            }
          },
          {
            "title": {
              "urdu": "کثرتِ درود کا معمول",
              "english": "Routine of Frequent Recitation"
            },
            "content": {
              "urdu": [
                "صرف نماز میں ہی نہیں بلکہ چلتے پھرتے بھی درود کا ورد رکھنا چاہیے۔",
                "کثرتِ درود سے دل کو سکون اور گناہوں سے مغفرت حاصل ہوتی ہے۔",
                "قیامت کے دن نبی ﷺ کے سب سے قریب وہ ہوگا جو زیادہ درود پڑھتا ہوگا۔"
              ],
              "english": [
                "One should recite Durood not just in prayer but also throughout daily activities.",
                "Frequent recitation brings peace to the heart and forgiveness for sins.",
                "On Judgment Day, the closest to the Prophet will be the one who recited Durood most."
              ]
            }
          }
        ]
      }
    }
  ]
}
