{
  "hadithId": 237,
  "hadithNo": 28,
  "hadithReferences": {
    "sunnah.com": ["Sunan Abi Dawud 863 (Similar Hadith on Ruku' grasp)"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ وَائِلِ بْنِ حُجْرٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا رَكَعَ فَرَّجَ بَيْنَ أَصَابِعِهِ , وَإِذَا سَجَدَ ضَمَّ أَصَابِعَهُ } رَوَاهُ اَلْحَاكِمُ .",
    "urdu": "سیدنا وائل بن حجر رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم جب رکوع میں ہوتے تو اپنی (ہاتھوں کی) انگلیاں کھلی رکھتے اور جب سجدے میں ہوتے تو اپنی (ہاتھوں کی) انگلیاں باہم ملا لیا کرتے تھے۔ (مستدرک حاکم)",
    "english": "Narrated Wa'il ibn Hujr (May Allah be pleased with him): When the Prophet (ﷺ) bowed (in Ruku'), he would spread his fingers apart, and when he prostrated (in Sujud), he would keep his fingers close together."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه الحاكم (1/224 )‏ مقتصراً على شطره الأول، وروى الشطر الثاني (1/227 )‏ .‏ وقال في الموضوعين : \" صحيح على شرط مسلم \".‏ وقد صححه الألباني في الإرواء (2/142).",
    "urdu": "صحیح روایت۔ اسے حاکم نے روایت کیا (1/224) پہلے حصے پر اکتفا کرتے ہوئے، اور دوسرا حصہ (1/227) پر روایت کیا۔ اور حاکم نے دونوں جگہ فرمایا کہ یہ \"صحیح علیٰ شرط مسلم\" ہے۔ اسے البانی نے بھی 'إرواء الغلیل' میں صحیح قرار دیا ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Hakim (1/224) focusing on the first part, and the second part (1/227). Al-Hakim stated concerning both parts: 'Sahih according to the condition of Muslim.' It was also authenticated by Al-Albani in 'Irwa' al-Ghalil' (2/142)."
  },
  "importantWords": [
    {
      "arabic": "رَكَعَ",
      "english": "He bowed (Ruku')",
      "urdu": "آپ نے رکوع کیا"
    },
    {
      "arabic": "سَجَدَ",
      "english": "He prostrated (Sujud)",
      "urdu": "آپ نے سجدہ کیا"
    },
    {
      "arabic": "فَرَّجَ",
      "english": "He spread/separated",
      "urdu": "آپ نے کشادہ رکھیں"
    },
    {
      "arabic": "ضَمَّ",
      "english": "He joined/closed",
      "urdu": "آپ نے ملا لیا"
    },
    {
      "arabic": "أَصَابِعِهِ",
      "english": "His fingers",
      "urdu": "آپ کی انگلیاں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں ہاتھوں کی انگلیوں کے مسنون طریقے کو بیان کرتی ہے: رکوع میں انگلیاں کشادہ اور پھیلی ہوئی رکھی جائیں تاکہ گھٹنوں کو مضبوطی سے پکڑا جا سکے، جبکہ سجدے میں انگلیاں باہم ملی ہوئی ہوں تاکہ سجدے کے عضو (ہاتھ) پر یکجہتی اور عاجزی کا کمال ظاہر ہو۔",
    "english": "This Hadith clarifies the Sunnah posture of the hands' fingers during prayer: in Ruku', the fingers should be spread apart to firmly grasp the knees, whereas in Sujud, the fingers should be kept close together, demonstrating unity and perfection of humility on the prostrating limb (the hands)."
  },
  "references": [
    {
      "arabic": "رواه الحاكم (1/224)",
      "english": "Reported by Al-Hakim (1/224)"
    },
    {
      "arabic": "صححه الألباني في الإرواء (2/142)",
      "english": "Authenticated by Al-Albani in Irwa' al-Ghalil (2/142)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "وائل بن حجر",
        "english": "Wa'il ibn Hujr"
      },
      "slug": "wail-ibn-hujr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=D-j0c4PzW0Y",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "رکوع میں انگلیاں کشادہ کرنا",
        "english": "Spreading Fingers in Ruku'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کشادہ رکھنے کی حکمت",
              "english": "Wisdom of Separation"
            },
            "content": {
              "urdu": [
                "رکوع میں انگلیاں کشادہ کرنے کا مقصد گھٹنوں کو مضبوطی سے پکڑنا اور جسم کو سہارا دینا ہے۔",
                "یہ عمل رکوع کی حالت میں بازوؤں کو تنے رکھنے اور کمر کو سیدھا رکھنے میں مدد دیتا ہے۔",
                "جمہور فقہاء کے نزدیک رکوع میں انگلیوں کو اس طرح پھیلانا سنتِ نماز میں شامل ہے۔"
              ],
              "english": [
                "The purpose of spreading the fingers in Ruku' is to firmly grasp the knees and provide stable support for the body.",
                "This posture helps keep the arms taut and the back straight during the bowing posture.",
                "According to the majority of jurists, spreading the fingers in this manner is part of the Sunnah of prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "رکوع کی عظمت",
              "english": "Majesty of Ruku'"
            },
            "content": {
              "urdu": [
                "رکوع تعظیم کا مقام ہے، اور ہاتھوں کو اس طرح کھولنا اللہ کے حضور پورے جسم کی حاضری کو ظاہر کرتا ہے۔",
                "کھلی انگلیاں جسم کے اوپری حصے کو پھیلاؤ اور مناسب پوزیشن فراہم کرتی ہیں۔",
                "یہ کیفیت نماز میں خشوع اور اطمینان (تسکین) کو بڑھانے کا سبب بنتی ہے۔"
              ],
              "english": [
                "Ruku' is the position of reverence, and opening the hands in this way demonstrates the full presence of the body before Allah.",
                "The spread fingers help give proper posture and extension to the upper body.",
                "This practice is a means of increasing devotion (Khushu') and stillness (Tuma'ninah) in the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سجدے میں انگلیاں ملانا",
        "english": "Joining Fingers in Sujud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ملانے کی حکمت",
              "english": "Wisdom of Joining"
            },
            "content": {
              "urdu": [
                "سجدے میں انگلیاں ملانے کا مقصد زمین پر سجدے کے مقام کو یکجا اور مضبوط بنانا ہے۔",
                "اس طرح سے ہتھیلیاں اور انگلیاں زمین پر زیادہ موثر طریقے سے ٹِکتی ہیں، جو سجدہ کا تقاضا ہے۔",
                "یہ عاجزی اور سجدے کے اعضاء (ہاتھوں) کی یکجہتی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The purpose of joining the fingers in Sujud is to make the prostration area on the ground unified and firm.",
                "The palms and fingers rest more effectively on the ground, which is a requirement of the prostration.",
                "This posture signifies humility and the unity of the prostrating limbs (the hands)."
              ]
            }
          },
          {
            "title": {
              "urdu": "قبلہ رخ ہونا",
              "english": "Facing the Qiblah"
            },
            "content": {
              "urdu": [
                "انگلیاں باہم ملی ہوں اور ان کا رخ قبلہ کی طرف ہو، یہ بھی سجدے میں ہاتھوں کی مسنون پوزیشن ہے۔",
                "تمام اعضاء کو قبلہ کی طرف متوجہ رکھنا اللہ کے سامنے کامل عاجزی کا مظہر ہے۔",
                "یہ عمل بکھراؤ سے بچاتا ہے اور نماز میں کامل ارتکاز اور توجہ کو برقرار رکھتا ہے۔"
              ],
              "english": [
                "The fingers should be joined and also directed towards the Qiblah, which is the Sunnah position for the hands in Sujud.",
                "Directing all limbs towards the Qiblah is an expression of perfect humility before Allah.",
                "This action prevents distraction and helps maintain full focus and concentration in prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اخلاقی اور تربیتی پہلو",
        "english": "Ethical and Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توازن اور تناسب",
              "english": "Balance and Proportion"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا دونوں حالتوں میں مختلف عمل، ہر رکن کے خاص حکم اور مقصد کو واضح کرتا ہے۔",
                "نماز کے ہر رکن کے مخصوص آداب ہیں جو سنت کی پیروی سے ہی سیکھے جا سکتے ہیں۔",
                "یہ تعلیم ہمیں سکھاتی ہے کہ نماز کے ایک ایک عمل میں توازن اور تناسب موجود ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) different actions in both postures clarify the specific ruling and purpose of each pillar.",
                "Each pillar of the prayer has its particular etiquette that can only be learned by following the Sunnah.",
                "This teaching shows us that there is balance and proportion in every single act of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "عملِ سنت کی محبت",
              "english": "Love for Sunnah Practice"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے عمل کی یہ باریک تفصیل صحابہ کرام کی سنت سے گہری محبت کو ظاہر کرتی ہے۔",
                "ایک مومن کے لیے ان تمام چھوٹی سنتوں پر عمل کرنا بڑا اجر و ثواب کا ذریعہ ہے۔",
                "کامل اتباع ہی عبادات میں خلوص اور قبولیت کو بڑھانے کا اہم ذریعہ ہے۔"
              ],
              "english": [
                "These subtle details of the Prophet's actions reveal the deep love the companions had for the Sunnah.",
                "For a believer, practicing all these seemingly minor Sunnahs is a source of great reward.",
                "Perfect emulation is the primary means of increasing sincerity and acceptance in our acts of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تطبیق (سنتوں کو جمع کرنا)",
        "english": "Application (Combining Sunnahs)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مختلف سجدوں کو یکجا کرنا",
              "english": "Integrating Various Sujud Sunnahs"
            },
            "content": {
              "urdu": [
                "سجدے میں انگلیوں کو ملانا، کہنیوں کو اٹھانا، اور پہلوؤں کو دور رکھنا سب ایک دوسرے کے معاون ہیں۔",
                "یہ تمام افعال سجدے کو بہترین اور مسنون طریقے سے ادا کرنے کی رہنمائی کرتے ہیں۔",
                "نمازی کو چاہیے کہ وہ ہر سجدے میں ان تمام سنتوں کو جمع کرنے کی کوشش کرے۔"
              ],
              "english": [
                "Joining the fingers, raising the elbows, and keeping the arms separated during Sujud are all complementary actions.",
                "All these actions guide the worshipper to perform the prostration in the best and most established Sunnah manner.",
                "The person praying should strive to combine all these Sunnahs in every single prostration."
              ]
            }
          },
          {
            "title": {
              "urdu": "رکوع میں ہاتھوں کی پوزیشن",
              "english": "Hand Position in Ruku'"
            },
            "content": {
              "urdu": [
                "رکوع میں انگلیاں پھیلا کر گھٹنوں کو مضبوطی سے پکڑنا مستحب ہے، یہ تجافی کے حکم کے خلاف نہیں۔",
                "بعض دیگر روایات میں گھٹنوں کو صرف چھونے کا ذکر ہے، لیکن پکڑنا زیادہ افضل ہے۔",
                "یہ عمل ہاتھوں کی ہتھیلیوں کو بالکل فلیٹ (سیدھا) رکھنے سے بہتر ہے جو وقار کے خلاف ہے۔"
              ],
              "english": [
                "In Ruku', spreading the fingers to firmly grasp the knees is recommended and does not contradict Tajaafi (separation).",
                "Some other narrations mention merely touching the knees, but firmly grasping them is considered more virtuous.",
                "This action is superior to keeping the palms completely flat, which is considered undignified."
              ]
            }
          }
        ]
      }
    }
  ]
}
