{
  "hadithId": 258,
  "hadithNo": 49,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/49"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": " وَعَنْ أَبِي أُمَامَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَرَأَ آيَةَ اَلْكُرْسِيِّ دُبُرَ كُلِّ صَلَاةٍ مَكْتُوبَةٍ لَمْ يَمْنَعْهُ مِنْ دُخُولِ اَلْجَنَّةِ إِلَّا اَلْمَوْتُ } رَوَاهُ النَّسَائِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏ وَزَادَ فِيهِ اَلطَّبَرَانِيُّ : { وَقُلْ هُوَ اَللَّه أَحَدٌ } ",
    "urdu": "سیدنا ابوامامہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے ہر فرض نماز کے بعد آیت الکرسی پڑھی، اس کو جنت میں داخل ہونے سے موت کے سوا اور کوئی چیز روکنے والی نہیں۔“ اسے نسائی نے روایت کیا ہے اور ابن حبان نے صحیح قرار دیا ہے، نیز طبرانی نے اس میں یہ اضافہ کیا ہے کہ ”سورہ اخلاص (قل ھو اللہ احد) بھی پڑھے۔“",
    "english": "Narrated Abu Umamah (RA): Allah's Messenger (PBUH) said: 'Whoever recites Ayat al-Kursi after every prescribed (obligatory) prayer, nothing will prevent him from entering Paradise except death.' [Reported by an-Nasa'i and graded Sahih by Ibn Hibban]. At-Tabarani added: 'And Surah al-Ikhlas (Say: He is Allah, the One).'"
  },
  "takhreej": {
    "arabic": "صحيح . رواه النسائي في 'عمل اليوم والليلة' (100)، وابن حبان في الصلاة، والطبراني في الكبير (7532) بإسناد جيد. وصححه الألباني في صحيح الجامع (6464).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے نسائی نے 'عمل الیوم واللیلہ' میں اور ابن حبان نے اپنی صحیح میں روایت کیا ہے۔ طبرانی کی 'قل ھو اللہ احد' والی زیادتی کی سند بھی جید ہے۔ علامہ البانی نے اسے صحیح الجامع میں صحیح قرار دیا ہے۔",
    "english": "Sahih. Reported by an-Nasa'i in 'Amal al-Yawm wal-Laylah' (100) and Ibn Hibban. At-Tabarani reported it in al-Kabir (7532) with a good chain. It was graded Sahih by al-Albani in Sahih al-Jami' (6464)."
  },
  "importantWords": [
    {
      "arabic": "آيَةَ اَلْكُرْسِيِّ",
      "english": "Verse of the Throne",
      "urdu": "آیت الکرسی"
    },
    {
      "arabic": "دُبُرَ",
      "english": "At the end / After",
      "urdu": "پیچھے / بعد"
    },
    {
      "arabic": "مَكْتُوبَةٍ",
      "english": "Prescribed / Obligatory",
      "urdu": "فرض نماز"
    },
    {
      "arabic": "لَمْ يَمْنَعْهُ",
      "english": "Did not prevent him",
      "urdu": "اسے نہیں روکا"
    },
    {
      "arabic": "اَلْمَوْتُ",
      "english": "Death",
      "urdu": "موت"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں فرض نماز کے بعد آیت الکرسی پڑھنے کی عظیم فضیلت بیان کی گئی ہے کہ یہ عمل جنت کے حصول کا یقینی راستہ ہے، بس موت کا حائل ہونا باقی ہے۔",
    "english": "This Hadith highlights the immense virtue of reciting Ayat al-Kursi after every obligatory prayer, stating it is a guaranteed path to Paradise, with death being the only barrier."
  },
  "references": [
    {
      "arabic": "سنن النسائي الكبرى (9848)",
      "english": "Sunan an-Nasa'i al-Kubra (9848)"
    },
    {
      "arabic": "المعجم الكبير للطبراني (7532)",
      "english": "al-Mu'jam al-Kabir at-Tabarani (7532)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو أمامة الباهلي",
        "english": "Abu Umamah al-Bahili"
      },
      "slug": "abu-umama-al-bahili"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=Ayat+al+Kursi+after+Salah+benefits+Urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "آیت الکرسی کی عظمت",
        "english": "Greatness of Ayat al-Kursi"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قرآن کی سب سے عظیم آیت",
              "english": "Greatest Verse of the Quran"
            },
            "content": {
              "urdu": [
                "آیت الکرسی کو قرآن مجید کی تمام آیات میں سب سے افضل اور عظیم مقام حاصل ہے۔",
                "اس میں اللہ تعالیٰ کی توحید، اس کی صفات اور بادشاہت کا جامع ذکر موجود ہے۔",
                "نبی ﷺ نے اس کے فضائل مختلف مواقع پر صحابہ کرام کو تعلیم فرمائے ہیں۔"
              ],
              "english": [
                "Ayat al-Kursi holds the most superior and greatest status among all verses of the Quran.",
                "It contains a comprehensive mention of Allah's Oneness, His attributes, and Sovereignty.",
                "The Prophet (PBUH) taught its virtues to the Companions on various occasions."
              ]
            }
          },
          {
            "title": {
              "urdu": "جنت کا یقینی وعدہ",
              "english": "Certain Promise of Paradise"
            },
            "content": {
              "urdu": [
                "فرض نماز کے بعد اسے پڑھنا بندے کے لیے جنت کے داخلے کو آسان بنا دیتا ہے۔",
                "حدیث کا مفہوم ہے کہ موت واقع ہوتے ہی بندہ اللہ کی رحمت سے جنت کا مستحق بن جاتا ہے۔",
                "یہ عمل قلیل ہے لیکن اس کا اجر و ثواب میزان میں بہت بھاری اور عظیم ہے۔"
              ],
              "english": [
                "Reciting it after obligatory prayers makes entering Paradise easy for the servant.",
                "The meaning is that upon death, the servant becomes eligible for Paradise by Allah's mercy.",
                "This action is small, but its reward is very heavy and great in the Balance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عمل کی مداومت اور برکات",
        "english": "Consistency and Blessings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانچوں وقت کی پابندی",
              "english": "Punctuality in Five Prayers"
            },
            "content": {
              "urdu": [
                "اس فضیلت کا حصول اسی وقت ممکن ہے جب ہر فرض نماز کے بعد اسے پڑھا جائے۔",
                "یہ پابندی انسان کو ہمہ وقت اللہ کی یاد اور اس کی حفاظت میں رکھتی ہے۔",
                "سنت پر مستقل مزاجی سے عمل کرنا ہی ولایت اور قربِ الٰہی کا ذریعہ ہے۔"
              ],
              "english": [
                "Attaining this virtue is only possible when it is recited after every obligatory prayer.",
                "This punctuality keeps a person in the remembrance and protection of Allah at all times.",
                "Consistently acting upon the Sunnah is the means of sainthood and closeness to Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان سے حفاظت کا قلعہ",
              "english": "Fortress Against Satan"
            },
            "content": {
              "urdu": [
                "آیت الکرسی پڑھنے والا اللہ کی امان میں ہوتا ہے اور شیطان اس سے دور بھاگتا ہے۔",
                "نماز کے بعد اسے پڑھنا دن بھر کے معاملات میں روحانی تحفظ فراہم کرتا ہے۔",
                "جو شخص اس کی تلاوت کرتا ہے، اللہ کی طرف سے اس کے لیے ایک نگہبان مقرر ہوتا ہے۔"
              ],
              "english": [
                "One who recites Ayat al-Kursi is under Allah's protection, and Satan flees from them.",
                "Reciting it after prayer provides spiritual protection in daily affairs.",
                "For the one who recites it, a guardian from Allah is appointed over them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سورہ اخلاص کا اضافہ",
        "english": "Addition of Surah al-Ikhlas"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توحیدِ کامل کا بیان",
              "english": "Description of Perfect Monotheism"
            },
            "content": {
              "urdu": [
                "طبرانی کی روایت میں سورہ اخلاص کا اضافہ توحید کی اہمیت کو مزید اجاگر کرتا ہے۔",
                "سورہ اخلاص قرآن کا ایک تہائی حصہ ہے اور خالص اللہ کی پہچان کرواتی ہے۔",
                "آیت الکرسی اور سورہ اخلاص کا مجموعہ بہترین حفاظتی حصار اور عقیدہ کی بنیاد ہے۔"
              ],
              "english": [
                "The addition of Surah al-Ikhlas in Tabarani's report further highlights the importance of Tawhid.",
                "Surah al-Ikhlas equals one-third of the Quran and provides pure recognition of Allah.",
                "The combination of Ayat al-Kursi and Surah al-Ikhlas is the best protective shield."
              ]
            }
          },
          {
            "title": {
              "urdu": "محبتِ الٰہی کا ذریعہ",
              "english": "Means to Allah's Love"
            },
            "content": {
              "urdu": [
                "سورہ اخلاص سے محبت کرنے والوں سے اللہ تعالیٰ خود محبت فرماتا ہے۔",
                "نماز کے بعد اس کی تلاوت بندے کے ایمان میں پختگی اور مٹھاس پیدا کرتی ہے۔",
                "یہ چھوٹی سی سورت اللہ کی صفات کا نچوڑ اور کفر و شرک کی بیخ کنی کرتی ہے۔"
              ],
              "english": [
                "Allah Himself loves those who have a love for Surah al-Ikhlas.",
                "Reciting it after prayer creates firmness and sweetness in a servant's faith.",
                "This small Surah is the essence of Allah's attributes and eradicates disbelief and Shirk."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور نصیحت",
        "english": "Practical Lesson and Advice"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آسان نیکی، بڑا اجر",
              "english": "Easy Deed, Huge Reward"
            },
            "content": {
              "urdu": [
                "صرف ایک منٹ کا یہ عمل انسان کی ابدی زندگی کا رخ بدل سکتا ہے۔",
                "ہمیں چاہیے کہ اسے اپنے روزمرہ کے اذکار کا لازمی حصہ بنائیں۔",
                "دین میں چھوٹی چھوٹی نیکیوں کو حقیر نہیں سمجھنا چاہیے کیونکہ وہ نجات کا سبب بنتی ہیں۔"
              ],
              "english": [
                "This action of just one minute can change the direction of one's eternal life.",
                "We should make it an essential part of our daily remembrances (Adhkar).",
                "Small good deeds in religion should not be belittled as they cause salvation."
              ]
            }
          },
          {
            "title": {
              "urdu": "موت کی تیاری",
              "english": "Preparation for Death"
            },
            "content": {
              "urdu": [
                "حدیث یاد دلاتی ہے کہ مومن اور جنت کے درمیان صرف موت کا فاصلہ ہے۔",
                "ہمیں ہر نماز کو آخری نماز سمجھ کر اور ان اذکار کے ساتھ ادا کرنا چاہیے۔",
                "موت کی یاد انسان کو گناہوں سے بچاتی اور نیکیوں کی طرف راغب کرتی ہے۔"
              ],
              "english": [
                "The Hadith reminds that only death separates a believer from Paradise.",
                "We should perform every prayer as our last and accompany it with these Adhkar.",
                "The remembrance of death saves a person from sins and attracts them to virtues."
              ]
            }
          }
        ]
      }
    }
  ]
}
