{
  "hadithId": 227,
  "hadithNo": 18,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ جُبَيْرِ بْنِ مُطْعِمٍ ‏- رضى الله عنه ‏- قَالَ : { سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏- يَقْرَأُ فِي اَلْمَغْرِبِ بِالطُّورِ } مُتَّفَقٌ عَلَيْهِ .",
    "urdu": " سیدنا جبیر بن مطعم رضی اللہ عنہ روایت کرتے ہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو نماز مغرب میں سورۃ «الطور» پڑھتے سنا ہے۔ (بخاری و مسلم) ",
    "english": "Narrated from Jubayr ibn Muṭ'im (may Allah be pleased with him) who said: \"I heard the Messenger of Allah (peace and blessings be upon him) reciting Surah At-Ṭūr in the Maghrib (Sunset) prayer.\" Agreed upon (Al-Bukhari and Muslim)."
  },
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري في كتاب الأذان، باب القراءة في المغرب (765)، ومسلم في كتاب الصلاة، باب القراءة في الصبح (463).",
    "urdu": "صحیح متفق علیہ۔ اسے بخاری نے کتاب الأذان، باب القراءة فی المغرب (765) میں اور مسلم نے کتاب الصلاة، باب القراءة فی الصبح (463) میں روایت کیا ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). Reported by Al-Bukhari in the Book of Adhan, Chapter: Recitation in Maghrib (765), and by Muslim in the Book of Prayer, Chapter: Recitation in Fajr (463)."
  },
  "importantWords": [
    {
      "arabic": "سَمِعْتُ",
      "english": "I heard",
      "urdu": "میں نے سنا"
    },
    {
      "arabic": "يَقْرَأُ",
      "english": "He was reciting",
      "urdu": "آپ پڑھ رہے تھے"
    },
    {
      "arabic": "الْمَغْرِبِ",
      "english": "The Maghrib prayer",
      "urdu": "نماز مغرب"
    },
    {
      "arabic": "بِالطُّورِ",
      "english": "Surah At-Ṭūr (Chapter 52)",
      "urdu": "سورۃ الطور"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز مغرب میں قرأت کے جواز کی ایک صورت بیان کرتی ہے، جس میں نبی صلی اللہ علیہ وسلم نے سورۃ 'الطور' (جو کہ اوساطِ مفصل کی طرف مائل ہے) کی تلاوت فرمائی۔ اگرچہ مغرب کی نماز میں قصارِ مفصل (چھوٹی سورتیں) پڑھنا افضل ہے، لیکن کبھی کبھار طویل سورتیں پڑھنا بھی سنت ہے، تاکہ یہ معلوم ہو جائے کہ یہ کام جائز ہے۔",
    "english": "This Hadith illustrates a permissible instance of recitation in the Maghrib prayer, where the Prophet (PBUH) recited Surah 'At-Ṭūr' (which is relatively long and leans towards Awsāṭ Al-Mufaṣṣal). Although reciting the short Surahs (Qiṣār Al-Mufaṣṣal) is generally preferred in Maghrib, reciting longer Surahs occasionally is also Sunnah, ensuring people know it is permissible."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأذان، باب القراءة في المغرب (765)",
      "english": "Sahih Al-Bukhari, Book of Adhan, Chapter: Recitation in Maghrib (765)"
    },
    {
      "arabic": "صحيح مسلم، كتاب الصلاة، باب القراءة في الصبح (463)",
      "english": "Sahih Muslim, Book of Prayer, Chapter: Recitation in Fajr (463)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "جبير بن مطعم",
        "english": "Jubayr ibn Muṭ'im"
      },
      "slug": "jubayr-ibn-mutim"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مغرب کی نماز میں طویل قرأت",
        "english": "Long Recitation in Maghrib Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغرب کی عام سنت",
              "english": "General Sunnah for Maghrib"
            },
            "content": {
              "urdu": [
                "عام طور پر، نبی صلی اللہ علیہ وسلم مغرب میں قصارِ مفصل (سورۃ ضحیٰ سے ناس تک) کی سورتیں پڑھتے تھے کیونکہ وقت کم ہوتا ہے۔",
                "مسلمانوں پر آسانی اور مغرب کے محدود وقت کی بنا پر مختصر سورتیں پڑھنا زیادہ افضل ہے۔",
                "لیکن اس حدیث سے معلوم ہوتا ہے کہ سورۃ الطور جیسی نسبتاً لمبی سورت کا پڑھنا بھی جائز اور سنت سے ثابت ہے۔"
              ],
              "english": [
                "Generally, the Prophet (PBUH) recited the short Surahs of Al-Mufaṣṣal (from Ad-Duḥā to An-Nās) in Maghrib due to time constraints.",
                "Reciting short Surahs is more preferable due to ease for Muslims and the limited time of Maghrib.",
                "However, this Hadith proves that reciting a relatively long Surah like At-Ṭūr is also permissible and established by the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "طوالت کی حکمت",
              "english": "Wisdom of Lengthening"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کا کبھی کبھار لمبی سورتیں پڑھنا اس بات کی تعلیم تھی کہ یہ عمل حرام نہیں ہے۔",
                "یہ اس فقہی اصول کو واضح کرتا ہے کہ نماز میں تمام جائز صورتیں عمل میں لائی جانی چاہییں۔",
                "حضرت جبیر بن مطعم رضی اللہ عنہ کی یہ روایت قریش کے سامنے اللہ کے کلام کی عظمت کو بھی ظاہر کرتی ہے۔"
              ],
              "english": [
                "The Prophet's occasional recitation of long Surahs was to teach that this action is not forbidden.",
                "This clarifies the juristic principle that all permissible forms of prayer should be practiced.",
                "Jubayr ibn Muṭ'im's narration also highlights the majesty of Allah's word before the Quraysh."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سماجی تناظر اور ایمان",
        "english": "Social Context and Faith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جبیر کا قبولِ اسلام",
              "english": "Jubayr's Acceptance of Islam"
            },
            "content": {
              "urdu": [
                "حضرت جبیر بن مطعم نے یہ سورۃ اس وقت سنی جب وہ ابھی مسلمان نہیں ہوئے تھے یا نئے نئے مسلمان ہوئے تھے۔",
                "اس سورۃ میں اللہ کے عذاب اور توحید کے دلائل تھے، جنہیں سن کر جبیر کا دل پگھل گیا۔",
                "خود جبیرؓ نے فرمایا کہ میں نے اس وقت پہلی بار اسلام کی حلاوت محسوس کی، جب یہ آیت سنی: «أم خلقوا من غير شيء أم هم الخالقون»۔"
              ],
              "english": [
                "Jubayr ibn Muṭ'im heard this Surah when he was either not yet a Muslim or had recently embraced Islam.",
                "The Surah contained arguments for Allah's punishment and Monotheism, which melted Jubayr's heart upon hearing them.",
                "Jubayr himself stated that he felt the sweetness of Islam for the first time when he heard the verse: 'Or were they created from nothing, or are they themselves the creators?'"
              ]
            }
          },
          {
            "title": {
              "urdu": "قراءت کا اثر",
              "english": "The Impact of Recitation"
            },
            "content": {
              "urdu": [
                "جہری نمازوں میں لمبی قرأت کا مقصد صرف ارکان ادا کرنا نہیں بلکہ سامعین کو دعوت اور عبرت دینا ہے۔",
                "قرآن کی قرأت لوگوں کے دلوں کو متاثر کرتی ہے اور انہیں حق کی طرف راغب کرتی ہے۔",
                "امام کو قرأت ہمیشہ ایسی کرنی چاہیے کہ وہ سننے والوں کے دلوں پر گہرا اثر ڈالے۔"
              ],
              "english": [
                "The purpose of long recitation in audible prayers is not just to fulfill the pillars but also to invite and admonish the listeners.",
                "The recitation of the Qur'an deeply affects people's hearts and inclines them towards the truth.",
                "The Imām should always recite in a manner that leaves a profound impact on the hearts of the listeners."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی اصول اور اسوہ",
        "english": "Practical Principles and Example"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام کے لیے معیار",
              "english": "Standard for the Imām"
            },
            "content": {
              "urdu": [
                "اگر امام کو معلوم ہو کہ مقتدی خوشی سے لمبی قرأت قبول کریں گے تو اسے اختیار کرنا مسنون ہے۔",
                "لیکن اگر عام مقتدی کمزور یا مصروف ہوں تو مغرب میں قصارِ مفصل کو ہی غالب سنت بنانا چاہیے۔",
                "یہ حکم اس بات کی دلیل ہے کہ نماز میں قرأت کا معیار ہمیشہ کیفیت اور اخلاص ہونا چاہیے، نہ کہ مقدار۔"
              ],
              "english": [
                "If the Imām knows that the followers will willingly accept long recitation, adopting it is Sunnah.",
                "However, if the general followers are weak or busy, the short Surahs of Al-Mufaṣṣal should be the dominant Sunnah in Maghrib.",
                "This ruling proves that the standard for recitation in prayer should always be quality and sincerity, not just quantity."
              ]
            }
          },
          {
            "title": {
              "urdu": "اوسط اور اکمل",
              "english": "Average and Most Complete"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم کا عمل یہ تھا کہ مغرب میں عمومی طور پر چھوٹی سورتیں پڑھتے اور کبھی لمبی بھی پڑھتے تھے۔",
                "اس لیے سنت کو مکمل طور پر اپنانے کے لیے ان تمام مسنون صورتوں پر باری باری عمل کرنا چاہیے۔",
                "اوسط درجے کی قرأت کو ہی اختیار کرنا زیادہ مناسب ہے تاکہ کسی بھی قسم کی مشقت سے بچا جا سکے۔"
              ],
              "english": [
                "The Prophet's practice was to generally recite short Surahs in Maghrib and occasionally recite long ones.",
                "Therefore, to fully embrace the Sunnah, one should alternate between all these proven methods.",
                "Adopting the average length of recitation is more suitable to avoid any form of hardship."
              ]
            }
          }
        ]
      }
    }
  ]
}
