{
  "hadithId": 235,
  "hadithNo": 26,
  "hadithReferences": {
    "sunnah.com": ["Sahih al-Bukhari 807", "Sahih Muslim 495"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ بُحَيْنَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ , حَتَّى يَبْدُوَ بَيَاضُ إِبِطَيْهِ } مُتَّفَقٌ عَلَيْهِ .‏",
    "urdu": "سیدنا ابن بحینہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم جب نماز ادا فرماتے اور سجدہ کرتے تو اس حالت میں اپنے دونوں بازو اپنے پہلووں سے الگ رکھتے تھے، یہاں تک کہ آپ صلی اللہ علیہ وسلم کی بغلوں کی سفیدی نظر آنے لگتی تھی۔ (بخاری و مسلم)",
    "english": "Narrated Ibn Buhainah (May Allah be pleased with him): When the Prophet (ﷺ) prayed, he would spread his arms apart (during prostration) so much that the whiteness of his armpits became visible."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (807)‏ ، ومسلم (495)‏ .‏ وهي دلالة على الإبعاد الكامل بين اليدين والجنبين في حال السجود للمنفرد.",
    "urdu": "صحیح متفق علیہ روایت۔ اسے بخاری (807) اور مسلم (495) نے روایت کیا ہے۔ یہ روایت سجدے کی حالت میں اکیلے نماز پڑھنے والے (منفرد) کے لیے ہاتھوں کو پہلوؤں سے مکمل طور پر الگ رکھنے پر دلالت کرتی ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (807) and Muslim (495). This narration indicates the complete separation of the hands from the sides during prostration for an individual worshipper (Munfarid)."
  },
  "importantWords": [
    {
      "arabic": "فَرَّجَ",
      "english": "He spread apart",
      "urdu": "آپ الگ رکھتے"
    },
    {
      "arabic": "يَدَيْهِ",
      "english": "His two hands/arms",
      "urdu": "اپنے دونوں ہاتھ/بازو"
    },
    {
      "arabic": "يَبْدُوَ",
      "english": "It became visible",
      "urdu": "وہ نظر آتی تھی"
    },
    {
      "arabic": "بَيَاضُ",
      "english": "Whiteness",
      "urdu": "سفیدی"
    },
    {
      "arabic": "إِبِطَيْهِ",
      "english": "His two armpits",
      "urdu": "آپ کی دونوں بغلیں"
    },
    {
      "arabic": "صَلَّى",
      "english": "He prayed",
      "urdu": "آپ نے نماز ادا کی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سجدے کی حالت میں جسم کو کھولنے (تجافی) کی سنت کو بیان کرتی ہے۔ نبی اکرم ﷺ سجدے میں اپنے بازو پہلوؤں سے اور پیٹ رانوں سے اتنا الگ رکھتے تھے کہ آپ کی بغلوں کی سفیدی نظر آنے لگتی تھی۔ یہ سجدے کی مکمل کیفیت اور اطمینان کی علامت ہے۔",
    "english": "This Hadith describes the Sunnah posture of 'Tajaafi' (keeping the body parts separated) during prostration. The Prophet (ﷺ) used to keep his arms separated from his sides and his stomach from his thighs so much that the whiteness of his armpits was visible. This signifies a complete and proper state of prostration and tranquility."
  },
  "references": [
    {
      "arabic": "رواه البخاري (807)",
      "english": "Reported by Al-Bukhari (807)"
    },
    {
      "arabic": "رواه مسلم (495)",
      "english": "Reported by Muslim (495)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مالك بن بحينة",
        "english": "Abdullah ibn Malik ibn Buhainah"
      },
      "slug": "abdullah-ibn-malik-ibn-buhainah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=s_e_0xT5Q4s",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سجدے میں تجافی",
        "english": "Tajaafi (Separation) in Sujud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ہاتھوں کو پھیلانا",
              "english": "Spreading the Arms"
            },
            "content": {
              "urdu": [
                "تجافی سے مراد یہ ہے کہ سجدے میں دونوں بازوؤں کو پہلوؤں سے اس طرح کھول کر رکھا جائے کہ وہ جدا ہوں۔",
                "نبی اکرم ﷺ اتنا پھیلاتے تھے کہ آپ کی بغلوں کی سفیدی پیچھے سے دیکھنے والے کو نظر آ جاتی تھی۔",
                "یہ عمل سجدے میں سکون اور عظمت کی علامت ہے اور یہ سنتِ مؤکدہ میں شامل ہے۔"
              ],
              "english": [
                "Tajaafi means separating the two arms from the sides during prostration so they are not touching the torso.",
                "The Prophet (ﷺ) would spread them so much that the whiteness of his armpits was visible to those behind him.",
                "This act signifies tranquility and majesty in prostration and is considered a confirmed Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "پیٹ کا رانوں سے اٹھانا",
              "english": "Raising the Stomach from Thighs"
            },
            "content": {
              "urdu": [
                "سجدے کی حالت میں پیٹ کو رانوں سے الگ رکھنا بھی تجافی کا حصہ اور سنت ہے۔",
                "اس طرح جسم سجدے میں سکڑنے کی بجائے کھُلا اور پھیلا ہوا رہتا ہے، جو عاجزی کا کمال ہے۔",
                "اس سے سانس لینے میں آسانی ہوتی ہے اور عاجزی کی حالت میں زیادہ سکون ملتا ہے۔"
              ],
              "english": [
                "Keeping the stomach lifted away from the thighs during prostration is also part of Tajaafi and a Sunnah.",
                "This ensures the body remains open and stretched in prostration, rather than being contracted, which perfects the humility.",
                "It facilitates breathing and allows for greater comfort and composure during the act of submission."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور احکام",
        "english": "Juristic Issues and Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تجافی کا حکم",
              "english": "The Ruling on Tajaafi"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک سجدے میں تجافی کرنا مردوں کے لیے سنت اور مستحب ہے۔",
                "عورتوں کے لیے حکم مختلف ہے؛ انہیں سجدے میں اپنے اعضاء کو سکیڑ کر رکھنا چاہیے۔",
                "امام احمد بن حنبلؒ کے نزدیک سجدے میں اعضاء کو الگ رکھنا نماز کے کمال کے لیے ضروری ہے۔"
              ],
              "english": [
                "According to the majority of jurists, Tajaafi during prostration is Sunnah and recommended for men.",
                "The ruling differs for women, who are instructed to keep their limbs drawn close together during prostration.",
                "Imam Ahmad ibn Hanbal held that separating the limbs in Sujud is necessary for the perfection of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "بھیڑ میں تجافی",
              "english": "Tajaafi in Crowded Places"
            },
            "content": {
              "urdu": [
                "اگر مسجد میں بھیڑ ہو اور بازو پھیلانے سے دوسرے نمازی کو تکلیف ہو، تو کم پھیلاؤ جائز ہے۔",
                "نمازی کو چاہیے کہ وہ سنت پر عمل کرے، مگر دوسرے مسلمان کو تکلیف دینے سے پرہیز کرے۔",
                "ایسی صورتحال میں سنتِ کاملہ پر عمل کرنے کے بجائے اذیت کو دور کرنا زیادہ اہم ہے۔"
              ],
              "english": [
                "If the mosque is crowded and spreading the arms causes discomfort to others, less separation is permissible.",
                "The worshipper should strive to follow the Sunnah but must avoid causing harm to a fellow Muslim.",
                "In such situations, removing harm takes precedence over fulfilling the complete Sunnah posture."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانیت اور بندگی",
        "english": "Spirituality and Servitude"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جسمانی کشادگی",
              "english": "Physical Spaciousness"
            },
            "content": {
              "urdu": [
                "سجدے میں جسم کو پھیلانا دل کے کھلنے اور روحانی سکون کی علامت ہے۔",
                "یہ کیفیت نماز میں اللہ کے سامنے عاجزی اور بندگی کے مکمل اظہار میں مدد دیتی ہے۔",
                "جس قدر جسم سجدے میں کشادہ ہو گا، اتنا ہی دل بھی اللہ سے تعلق میں کشادہ ہو گا۔"
              ],
              "english": [
                "Spreading the body in prostration symbolizes the opening of the heart and spiritual peace.",
                "This posture helps in the complete manifestation of humility and servitude before Allah in prayer.",
                "The more the body is stretched in prostration, the more the heart will expand in its connection with Allah."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی اتباع",
              "english": "Following the Sunnah"
            },
            "content": {
              "urdu": [
                "بغلیوں کی سفیدی کا نظر آنا سجدے کی حالت کو مکمل طور پر درست کرنے کی دلیل ہے۔",
                "ان تمام باریک بینیوں پر عمل کرنا نبی اکرم ﷺ کی کامل محبت اور اتباع کی نشانی ہے۔",
                "نبی اکرم ﷺ کی صلاۃ کی کیفیت کو اپنائے بغیر نماز کامل نہیں ہو سکتی۔"
              ],
              "english": [
                "The visibility of the armpits' whiteness is proof of the complete and accurate execution of the prostration posture.",
                "Adhering to all these minute details is a sign of perfect love and emulation of the Prophet (ﷺ).",
                "The prayer cannot be perfected without adopting the exact mannerisms of the Prophet's (ﷺ) prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تدریسی نقطہ",
        "english": "Educational and Instructive Point"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابی کا مشاہدہ",
              "english": "The Companion's Observation"
            },
            "content": {
              "urdu": [
                "ابن بحینہ رضی اللہ عنہ کا یہ مشاہدہ سنت کی حفاظت اور امت تک پہنچانے کی اہمیت کو واضح کرتا ہے۔",
                "صحابی کا بغلوں کی سفیدی کا ذکر کرنا، سنت کی باریکیوں کو بیان کرنے کی ایک دقیق کوشش تھی۔",
                "یہ روایت ہمیں سکھاتی ہے کہ نماز کے معمولی سمجھے جانے والے اعمال بھی کتنی اہمیت رکھتے ہیں۔"
              ],
              "english": [
                "Ibn Buhainah's observation highlights the dedication of the companions in preserving and conveying the Sunnah to the Ummah.",
                "The companion mentioning the armpits' whiteness was a precise attempt to describe the subtleties of the Sunnah.",
                "This narration teaches us the great importance of even the seemingly minor acts of the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "جانوروں کی مشابہت سے اجتناب",
              "english": "Avoiding Imitation of Animals"
            },
            "content": {
              "urdu": [
                "اعضاء کو سکیڑ کر سجدہ کرنا یا بازو زمین پر بچھا دینا مکروہ ہے (مکروہ تحریمی)، کیونکہ یہ درندوں کی مشابہت ہے۔",
                "نبی اکرم ﷺ نے بازوؤں کو زمین پر بچھانے سے منع فرمایا تھا، اور تجافی اس ممانعت سے بچاتی ہے۔",
                "لہٰذا، سجدہ ایسی حالت میں ہونا چاہیے جو ایک مومن کے لیے باعزت اور کامل عاجزی کی ہو۔"
              ],
              "english": [
                "Contracting the limbs in Sujud or spreading the forearms on the ground is disliked (Makruh Tahrimi) because it resembles predatory animals.",
                "The Prophet (ﷺ) forbade placing the forearms flat on the ground, and Tajaafi prevents this prohibition.",
                "Therefore, prostration must be in a state that is dignified and shows perfect humility for a believer."
              ]
            }
          }
        ]
      }
    }
  ]
}
