{
  "hadithId": 255,
  "hadithNo": 46,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/46"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ ثَوْبَانَ ‏- رضى الله عنه ‏- قَالَ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا اِنْصَرَفَ مِنْ صَلَاتِهِ اِسْتَغْفَرَ اَللَّهَ ثَلَاثًا , وَقَالَ : \" اَللَّهُمَّ أَنْتَ اَلسَّلَامُ وَمِنْكَ اَلسَّلَامُ .‏ تَبَارَكْتَ يَا ذَا اَلْجَلَالِ وَالْإِكْرَامِ } رَوَاهُ مُسْلِمٌ .‏",
    "urdu": "سیدنا ثوبان رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب اپنی نماز سے فارغ ہوتے (سلام پھیرتے) تو تین مرتبہ «استغفر الله» کہتے اور پھر یہ دعا پڑھتے: «اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام» ”اے اللہ! تو ہی سلامتی والا ہے اور سلامتی تیری ہی طرف سے ہے، اے بزرگی اور عزت والے! تو بابرکت ہے۔“",
    "english": "Narrated Thawban (RA): When Allah's Messenger (PBUH) finished his prayer, he would ask for Allah's forgiveness three times and say: 'O Allah, You are As-Salam (Peace), and from You comes peace. Blessed are You, O Possessor of Majesty and Honor.'"
  },
  "takhreej": {
    "arabic": "صحيح . رواه مسلم (591) في كتاب المساجد ومواضع الصلاة، باب استحباب الذكر بعد الصلاة وبيان صفته.",
    "urdu": "یہ حدیث صحیح ہے اور امام مسلم (591) نے اسے اپنی صحیح میں نماز کے بعد کے اذکار کے بیان میں روایت کیا ہے۔",
    "english": "Sahih. Reported by Muslim (591) in the Book of Masjids and Places of Prayer, Chapter on the Recommendation of Dhikr after Prayer."
  },
  "importantWords": [
    {
      "arabic": "اِنْصَرَفَ",
      "english": "Finished / Turned away",
      "urdu": "فارغ ہوئے / سلام پھیرا"
    },
    {
      "arabic": "اِسْتَغْفَرَ",
      "english": "Sought forgiveness",
      "urdu": "بخشش طلب کی"
    },
    {
      "arabic": "اَلسَّلَامُ",
      "english": "The Peace",
      "urdu": "سلامتی والا"
    },
    {
      "arabic": "تَبَارَكْتَ",
      "english": "Blessed are You",
      "urdu": "تو برکت والا ہے"
    },
    {
      "arabic": "اَلْجَلَالِ",
      "english": "Majesty",
      "urdu": "بزرگی / جلال"
    },
    {
      "arabic": "الْإِكْرَامِ",
      "english": "Honor",
      "urdu": "عزت / اکرام"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز کے فوراً بعد استغفار کرنے اور اللہ کی سلامتی اور عظمت بیان کرنے کی مسنون ترتیب سکھائی گئی ہے۔",
    "english": "This Hadith teaches the Prophetic sequence of seeking forgiveness and exalting Allah's peace and majesty immediately after prayer."
  },
  "references": [
    {
      "arabic": "صحيح مسلم (591)",
      "english": "Sahih Muslim (591)"
    },
    {
      "arabic": "سنن النسائي (1337)",
      "english": "Sunan an-Nasa'i (1337)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "ثوبان بن بجدد",
        "english": "Thawban bin Bojdod"
      },
      "slug": "thawban-bin-bojdod"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=astaghfirullah+3+times+after+salah+meaning",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "استغفار کی حکمت",
        "english": "Wisdom of Seeking Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عبادت میں کوتاہی کا تدارک",
              "english": "Compensating for Shortcomings"
            },
            "content": {
              "urdu": [
                "نماز جیسی عظیم عبادت کے بعد استغفار کرنا بندگی کی انتہا اور عاجزی کی علامت ہے۔",
                "یہ اس بات کا اقرار ہے کہ ہم اللہ کی عبادت کا حق کما حقہ ادا نہیں کر سکے۔",
                "استغفار نماز کے دوران پیدا ہونے والے وسوسوں اور توجہ کی کمی کا کفارہ بنتا ہے۔"
              ],
              "english": [
                "Seeking forgiveness after a great worship like Salah is a sign of ultimate humility.",
                "It is an admission that we could not fulfill the right of worship as it deserved.",
                "Istighfar acts as a compensation for distractions and lack of focus during prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبر سے نجات",
              "english": "Saving from Spiritual Pride"
            },
            "content": {
              "urdu": [
                "نیک عمل کے فوراً بعد توبہ کرنا انسان کو خود پسندی اور تکبر سے محفوظ رکھتا ہے۔",
                "مومن اپنی نیکی پر ناز کرنے کے بجائے اللہ کی مغفرت کا طلبگار رہتا ہے۔",
                "یہ عمل نفس کی اصلاح اور روحانی ترقی کے لیے بنیادی اہمیت رکھتا ہے۔"
              ],
              "english": [
                "Repenting right after a good deed protects a person from self-conceit and pride.",
                "A believer seeks Allah's pardon instead of taking pride in their righteousness.",
                "This practice is fundamental for the self-reformation and spiritual growth."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اللہ کی صفتِ سلامتی",
        "english": "Attribute of Allah's Peace"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظ السلام کی گہرائی",
              "english": "Depth of the Word 'As-Salam'"
            },
            "content": {
              "urdu": [
                "السلام اللہ کا صفاتی نام ہے جس کا مطلب ہے کہ وہ ہر نقص سے پاک ہے۔",
                "تمام مخلوقات کو ملنے والی سلامتی اور امن صرف اللہ ہی کی عطا کردہ ہے۔",
                "نماز کے بعد اس نام کا ذکر دل کو سکون اور اطمینان فراہم کرتا ہے۔"
              ],
              "english": [
                "As-Salam is an attribute of Allah, meaning He is free from all defects.",
                "The peace and safety experienced by all creation is granted solely by Allah.",
                "Mentioning this name after prayer provides tranquility and peace to the heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "سلامتی کا سرچشمہ",
              "english": "The Source of Peace"
            },
            "content": {
              "urdu": [
                "حقیقی سلامتی دنیاوی وسائل میں نہیں بلکہ اللہ کی ذات اور اس کی اطاعت میں ہے۔",
                "جب بندہ 'منک السلام' کہتا ہے تو وہ اپنے امن کے لیے اللہ کی طرف رجوع کرتا ہے۔",
                "یہ عقیدہ انسان کو فتنوں اور پریشانیوں میں اللہ ہی سے لَو لگانے کا درس دیتا ہے۔"
              ],
              "english": [
                "True peace is not in worldly means but in Allah's essence and obedience.",
                "When a servant says 'from You comes peace', they turn to Allah for safety.",
                "This belief teaches one to rely on Allah during trials and anxieties."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ذوالجلال والاکرام کی اہمیت",
        "english": "Majesty and Honor of Allah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی عظمت کا بیان",
              "english": "Stating Allah's Majesty"
            },
            "content": {
              "urdu": [
                "ذوالجلال والاکرام وہ جامع کلمات ہیں جو اللہ کی ہیبت اور رحمت کو ظاہر کرتے ہیں۔",
                "اللہ ہی ہر قسم کی تعریف، بزرگی اور اکرام کا حقیقی حقدار ہے۔",
                "ان کلمات کے ذریعے بندہ اپنے رب کی عظمت کے سامنے سرِ تسلیم خم کرتا ہے۔"
              ],
              "english": [
                "The words 'Dhal-Jalali wal-Ikram' represent both the awe and mercy of Allah.",
                "Allah alone is the true owner of all praise, greatness, and honor.",
                "Through these words, the servant bows in submission before the Lord's majesty."
              ]
            }
          },
          {
            "title": {
              "urdu": "برکت کا حصول",
              "english": "Gaining Divine Blessings"
            },
            "content": {
              "urdu": [
                "لفظ 'تبارکت' اس بات کا اعلان ہے کہ اللہ کی ذات خیر و برکت کا منبع ہے۔",
                "دعا میں اللہ کی برکت کا ذکر کرنا بندے کے لیے فیض کا باعث بنتا ہے۔",
                "یہ الفاظ اللہ کی ثنا کے لیے بہترین اور جامع ترین انتخاب ہیں۔"
              ],
              "english": [
                "The word 'Tabarakta' is a declaration that Allah is the source of all blessings.",
                "Mentioning Allah's blessing in Dua leads to spiritual benefit for the servant.",
                "These words are among the best and most comprehensive choices for praising Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی و تربیتی پہلو",
        "english": "Practical and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ذکرِ مسنون کی مداومت",
              "english": "Consistency in Sunnah Dhikr"
            },
            "content": {
              "urdu": [
                "نماز کے بعد فوراً اٹھنے کے بجائے ان اذکار کی پابندی کرنا سنتِ مؤکدہ ہے۔",
                "نبی ﷺ کا یہ معمول ہمیں ہر نماز کے بعد ذکر کے لیے وقت نکالنے کی ترغیب دیتا ہے۔",
                "ان اذکار سے نماز کی روحانی تاثیر زندگی کے دیگر معاملات تک پھیل جاتی ہے۔"
              ],
              "english": [
                "Adhering to these Adhkar instead of leaving immediately is a stressed Sunnah.",
                "The Prophet's routine encourages us to dedicate time for Dhikr after every Salah.",
                "These Adhkar extend the spiritual impact of prayer into other life matters."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیمِ صحابہ کا نمونہ",
              "english": "Model of Teaching Companions"
            },
            "content": {
              "urdu": [
                "سیدنا ثوبانؓ نے ان باریک تفصیلات کو محفوظ کر کے امت تک پہنچایا ہے۔",
                "محدثین نے استغفار کے الفاظ (استغفر اللہ) کی بھی صراحت فرما دی ہے۔",
                "ہمیں بھی چاہیے کہ اپنی نمازوں کو ان خوبصورت اذکار سے مزین کریں۔"
              ],
              "english": [
                "Thawban (RA) preserved and conveyed these minute details to the Ummah.",
                "Scholars have clarified the specific words of Istighfar (Astaghfirullah).",
                "We should also beautify our prayers with these magnificent remembrances."
              ]
            }
          }
        ]
      }
    }
  ]
}
