{
  "hadithId": 213,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- إِذَا كَبَّرَ لِلصَّلَاةِ سَكَتَ هُنَيَّةً , قَبْلِ أَنْ يَقْرَأَ , فَسَأَلْتُهُ , فَقَالَ : \"أَقُولُ : اَللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ اَلْمَشْرِقِ وَالْمَغْرِبِ , اَللَّهُمَّ نقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى اَلثَّوْبُ اَلْأَبْيَضُ مِنْ اَلدَّنَسِ , اَللَّهُمَّ اِغْسِلْنِي مِنْ خَطَايَايَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ\" } مُتَّفَقٌ عَلَيْهِ",
    "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا معمول تھا کہ تکبیر تحریمہ کے بعد تھوڑا سا وقفہ فرماتے پھر قرآت شروع کرتے (ایک روز) میں نے عرض کیا یا رسول اللہ! وقفہ کے دوران آپ کیا پڑھتے ہیں؟ فرمایا! «اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياي بالماء والثلج والبرد» ” اے اللہ! میرے اور میرے گناہوں کے مابین اتنا فاصلہ اور دوری فرما دے کہ جتنا مشرق و مغرب کے درمیان فاصلہ ہے۔ اے اللہ! مجھے گناہوں اور خطاؤں سے اس طرح صاف فرما دے کہ جس طرح سفید کپڑا میل کچیل سے صاف کیا جاتا ہے۔ اے اللہ! میرے گناہوں کو پانی، برف اور اولوں سے دھو ڈال۔“ (بخاری و مسلم)  ",
    "english": "Narrated from Abu Hurayrah (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings be upon him), when he said the Takbīr for prayer, would remain silent for a short while (Hunayyah) before reciting. I asked him, and he said: \"I say: 'Allāhumma bā'id baynī wa bayna khaṭāyāya kamā bā'adta bayna-l-mashriqi wal-maghrib. Allāhumma naqqinī min khaṭāyāya kamā yunaqqa al-thawbu al-abyadhu min al-danas. Allāhumma aghsilnī min khaṭāyāya bil-mā’i wath-thalji wal-barad.' (O Allah, separate me from my sins as You have separated the East and the West. O Allah, cleanse me of my sins as a white garment is cleansed of dirt. O Allah, wash away my sins with water, snow, and hail.)\" Agreed upon (Al-Bukhari and Muslim)."
  },
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري في كتاب الأذان، باب ما يقول بعد التكبير (744)، ومسلم في كتاب المساجد ومواضع الصلاة، باب ما يقول إذا افتتح الصلاة (598). وهذه الدعاء أحد صيغ دعاء الاستفتاح (أو الاستفتاح والدعاء بعده).",
    "urdu": "صحیح متفق علیہ۔ اسے بخاری نے کتاب الأذان، باب ما یقول بعد التکبیر (744) میں اور مسلم نے کتاب المساجد ومواضع الصلاة، باب ما یقول اذا افتتح الصلاة (598) میں روایت کیا ہے۔ یہ دعا دعاء الاستفتاح کی مختلف صورتوں میں سے ایک ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). Reported by Al-Bukhari in the Book of Adhan, Chapter: What one says after the Takbir (744), and by Muslim in the Book of Mosques and Places of Prayer, Chapter: What one says when opening the prayer (598). This supplication is one of the various forms of Du'a Al-Istiftāḥ (the opening supplication)."
  },
  "importantWords": [
    {
      "arabic": "سَكَتَ هُنَيَّةً",
      "english": "Remained silent for a short while",
      "urdu": "تھوڑا سا وقفہ فرمایا"
    },
    {
      "arabic": "بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ",
      "english": "Separate me from my sins",
      "urdu": "میرے اور گناہوں میں دوری کر دے"
    },
    {
      "arabic": "الْمَشْرِقِ وَالْمَغْرِبِ",
      "english": "The East and the West",
      "urdu": "مشرق اور مغرب"
    },
    {
      "arabic": "نَقِّنِي",
      "english": "Cleanse me/Purify me",
      "urdu": "مجھے صاف فرما دے"
    },
    {
      "arabic": "اَلدَّنَسِ",
      "english": "Dirt/Filth",
      "urdu": "میل کچیل"
    },
    {
      "arabic": "بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
      "english": "With water, snow, and hail",
      "urdu": "پانی، برف اور اولوں سے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز کے آغاز میں تکبیر تحریمہ کے بعد خاموشی کے دوران پڑھی جانے والی ایک مسنون دعا (دعاء الاستفتاح کی ایک صورت) کو بیان کرتی ہے۔ اس میں بندہ اللہ تعالیٰ سے التجا کرتا ہے کہ وہ اس کے گناہوں کو دور کر دے، انہیں میل کچیل سے پاک کر دے، اور انہیں پانی، برف اور اولوں جیسی پاکیزہ چیزوں سے دھو ڈالے، جو نماز کو قلبی طور پر پاکیزہ حالت میں شروع کرنے کا ایک بہترین طریقہ ہے۔",
    "english": "This Hadith describes a Sunnah supplication (one form of Du'a Al-Istiftāḥ) recited in silence after the Takbirat Al-Ihram at the beginning of the prayer. In this supplication, the servant implores Allah to distance his sins from him, cleanse him of them completely (like a white garment is cleansed of dirt), and wash them away with pure elements like water, snow, and hail, which is an excellent way to begin the prayer in a state of spiritual purity."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الأذان، باب ما يقول بعد التكبير (744)",
      "english": "Sahih Al-Bukhari, Book of Adhan, Chapter: What one says after the Takbir (744)"
    },
    {
      "arabic": "صحيح مسلم، كتاب المساجد ومواضع الصلاة، باب ما يقول إذا افتتح الصلاة (598)",
      "english": "Sahih Muslim, Book of Mosques and Places of Prayer, Chapter: What one says when opening the prayer (598)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو هريرة",
        "english": "Abu Hurayrah"
      },
      "slug": "abu-hurayrah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "افتتاحی دعا اور اس کی حکمت",
        "english": "The Opening Supplication and its Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خاموشی کا وقفہ",
              "english": "The Pause of Silence (Hunayyah)"
            },
            "content": {
              "urdu": [
                "تکبیر تحریمہ کے بعد تھوڑی دیر خاموش رہنا سنت ہے، جسے 'سکتہ' کہتے ہیں، تاکہ دعا پڑھی جا سکے۔",
                "یہ وقفہ نمازی کو دنیاوی افکار سے روحانی حالت میں منتقل ہونے کا موقع فراہم کرتا ہے۔",
                "یہ دعا امام، مقتدی اور منفرد (تنہا نماز پڑھنے والے) سب کے لیے مسنون ہے۔"
              ],
              "english": [
                "Pausing briefly after Takbirat Al-Ihram is Sunnah, called 'Saktah,' to recite the supplication.",
                "This pause allows the worshipper to transition from worldly thoughts into a spiritual state.",
                "This supplication is Sunnah for everyone: the Imam, the follower, and the one praying alone."
              ]
            }
          },
          {
            "title": {
              "urdu": "گناہوں کی معافی کی طلب",
              "english": "Seeking Forgiveness for Sins"
            },
            "content": {
              "urdu": [
                "نماز کی ابتدا گناہوں سے دوری اور پاکیزگی کی التجا سے کرنا، اخلاص اور خشوع کی علامت ہے۔",
                "بندے کا یہ اقرار کہ وہ گناہوں سے آلودہ ہے، اس کی عاجزی کو ظاہر کرتا ہے۔",
                "اللہ سے گناہوں کو مشرق و مغرب کی طرح دور کرنے کی التجا، مکمل اور دائمی مغفرت کی طلب ہے۔"
              ],
              "english": [
                "Beginning the prayer by seeking distance and purification from sins is a sign of sincerity and Khushu'.",
                "The servant's admission that they are tainted with sins demonstrates their humility.",
                "Imploring Allah to distance sins like the East and West is a plea for complete and lasting forgiveness."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "پاکیزگی کی مثالیں اور حکمت",
        "english": "Metaphors of Purity and Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سفید کپڑے کی مثال",
              "english": "The Metaphor of the White Garment"
            },
            "content": {
              "urdu": [
                "سفید کپڑے کا میل کچیل سے صاف ہونا، مکمل طہارت اور داغ سے پاک ہونے کی واضح مثال ہے۔",
                "نمازی دراصل اپنے دل اور روح کو گناہوں کے داغوں سے بالکل پاک کرنے کی دعا کر رہا ہوتا ہے۔",
                "یہ دعا اس بات کی جانب اشارہ ہے کہ نماز کی قبولیت کے لیے طہارتِ قلب بنیادی شرط ہے۔"
              ],
              "english": [
                "The cleansing of a white garment from dirt is a clear metaphor for complete purification and freedom from stain.",
                "The worshipper is essentially supplicating for the complete cleansing of their heart and soul from the stains of sin.",
                "This prayer points out that purity of heart is a fundamental condition for the acceptance of prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "پانی، برف اور اولوں سے دھونا",
              "english": "Washing with Water, Snow, and Hail"
            },
            "content": {
              "urdu": [
                "مختلف ذرائع سے دھونے کی التجا، گناہوں کی مختلف اقسام سے مکمل پاکیزگی کی طلب ہے۔",
                "پانی، برف اور اولے پاکیزگی کے ٹھنڈے اور خالص ذرائع ہیں، جو گناہوں کو مکمل طور پر دھو ڈالتے ہیں۔",
                "برف اور اولے عموماً صفائی میں زیادہ قوت رکھتے ہیں، جو گناہوں کے اثرات کے مکمل ازالہ کی دعا ہے۔"
              ],
              "english": [
                "Asking to be washed with diverse elements is a plea for complete purification from various types of sins.",
                "Water, snow, and hail are cool and pure cleansing agents, symbolizing the thorough washing away of sins.",
                "Snow and hail are generally more potent cleansers, which signifies the prayer for complete removal of the effects of sins."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور روحانی اصول",
        "english": "Juristic and Spiritual Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کی تیاری",
              "english": "Preparation for Prayer"
            },
            "content": {
              "urdu": [
                "یہ دعا نماز میں داخل ہونے سے پہلے کی بہترین روحانی اور نفسیاتی تیاری ہے۔",
                "اس سے نمازی دنیا کے الجھنوں سے نکل کر مکمل طور پر اللہ کی طرف متوجہ ہو جاتا ہے۔",
                "مختلف مسنون دعائے استفتاح کی موجودگی، تنوع اور آسانی کا پہلو پیدا کرتی ہے۔"
              ],
              "english": [
                "This supplication is the best spiritual and psychological preparation before entering the prayer.",
                "It enables the worshipper to detach from worldly preoccupations and turn entirely towards Allah.",
                "The existence of various Sunnah opening supplications allows for diversity and ease of practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "حدیث کی افادیت",
              "english": "Benefit of the Hadith"
            },
            "content": {
              "urdu": [
                "حضرت ابوہریرہ رضی اللہ عنہ کا سوال کرنا، صحابہ کرام کی علم دین میں حرص کو ظاہر کرتا ہے۔",
                "نبی صلی اللہ علیہ وسلم نے اس دعا کی تفصیل بتا کر امت کو ایک بڑا خزانہ عطا فرمایا۔",
                "اس دعا کا تعلق توحید، مغفرت اور طہارتِ قلب سے ہے جو اسلام کی بنیادی تعلیمات ہیں۔"
              ],
              "english": [
                "Abu Hurayrah's question demonstrates the Companions' eagerness for religious knowledge.",
                "The Prophet (PBUH) granted the Ummah a great treasure by detailing this supplication.",
                "This prayer is connected to Tawheed, forgiveness, and purity of heart, which are fundamental Islamic teachings."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی میں اہمیت",
        "english": "Importance in Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "توبہ اور ندامت",
              "english": "Repentance and Regret"
            },
            "content": {
              "urdu": [
                "ہر نماز کے آغاز میں گناہوں کو یاد کرنا، عاجزی اور ندامت کے جذبات کو تازہ کرتا ہے۔",
                "ایمان والے کو چاہیے کہ وہ اس دعا کو صرف الفاظ میں نہیں بلکہ دل کی گہرائی سے پڑھے۔",
                "جو شخص کثرت سے اپنے گناہوں کی مغفرت مانگتا ہے، اللہ اس کی خطاؤں کو مٹا دیتا ہے۔"
              ],
              "english": [
                "Remembering sins at the start of every prayer refreshes feelings of humility and regret.",
                "The believer should recite this supplication not just verbally but from the depth of their heart.",
                "The one who frequently seeks forgiveness for their sins, Allah wipes away their errors."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی پاکیزگی",
              "english": "Moral Purity"
            },
            "content": {
              "urdu": [
                "یہ دعا نہ صرف گناہوں کی بلکہ بری عادات اور اخلاقی کمزوریوں سے بھی نجات کی طلب ہے۔",
                "نمازی کو یہ یقین رکھنا چاہیے کہ اللہ تعالیٰ ہی اس کی طہارت کا اصل ذریعہ ہے۔",
                "روزمرہ زندگی میں استغفار کی عادت ڈالنا نماز کی روحانیت کو بڑھا دیتا ہے۔"
              ],
              "english": [
                "This prayer seeks not only forgiveness for sins but also salvation from bad habits and moral deficiencies.",
                "The worshipper must be confident that Allah alone is the true source of their purification.",
                "Cultivating the habit of seeking forgiveness (Istighfar) in daily life enhances the spirituality of the prayer."
              ]
            }
          }
        ]
      }
    }
  ]
}
