{
  "hadithId": 214,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- أَنَّهُ كَانَ يَقُولُ : { سُبْحَانَكَ اَللَّهُمَّ وَبِحَمْدِكَ , تَبَارَكَ اِسْمُكَ , وَتَعَالَى جَدُّكَ , وَلَا إِلَهُ غَيْرُكَ } رَوَاهُ مُسْلِمٌ بِسَنَدٍ مُنْقَطِعٍ , وَاَلدَّارَقُطْنِيُّ مَوْصُولاً وَهُوَ مَوْقُوفٌ وَنَحْوُهُ عَنْ أَبِي سَعِيدٍ مَرْفُوعًا عِنْدَ اَلْخَمْسَةِ وَفِيهِ : وَكَانَ يَقُولُ بَعْدَ اَلتَّكْبِيرِ : { أَعُوذُ بِاَللَّهِ اَلسَّمِيعِ اَلْعَلِيمِ مِنَ اَلشَّيْطَانِ اَلرَّجِيمِ , مِنْ هَمْزِهِ , وَنَفْخِهِ , وَنَفْثِهِ }",
    "urdu": "سیدنا عمر رضی اللہ عنہ سے روایت ہے کہ آپ (نماز کے آغاز میں) «سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك» پڑھتے تھے: ” اے اللہ تو پاک ہے اور سب تعریفیں تیرے ہی لئے ہیں۔ بابرکت ہے تیرا نام اور بلند ہے تیری شان اور تیرے سوا کوئی معبود نہیں۔“ اسے مسلم نے منقطع اور دارقطنی نے موصول روایت کیا ہے اور یہ موقوف ہے۔ احمد، ابوداؤد، نسائی، ابن ماجہ اور ترمذی (پانچوں) نے سیدنا ابوسعید خدری رضی اللہ عنہ کے حوالہ سے اسی طرح مرفوعاً روایت کیا ہے اور اس میں یہ بھی ذکر ہے کہ آپ صلی اللہ علیہ وسلم تکبیر تحریمہ کے بعد تعوذ یعنی «أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه» پڑھتے تھے۔ ”میں اللہ سمیع و علیم کی شیطان مردود سے پناہ لیتا ہوں اس کے وسوسوں سے، اس کے پھونکنے (کبر و نخوت) سے اور اس کے جادو (شعر) سے۔“ ",
    "english": "Narrated from 'Umar (may Allah be pleased with him) that he used to say (at the beginning of the prayer): \"Subḥānak Allāhumma wa bi-ḥamdika, wa tabāraka-smuka, wa ta'ālā jadduka, wa lā ilāha ghayruk.\" (Glory be to You, O Allah, and with Your praise; blessed is Your Name, exalted is Your majesty, and there is no god besides You.) Reported by Muslim with a disconnected chain (Munqaṭi') and by Ad-Dāraquṭnī with a connected chain, but it is Maukūf (saying of a Companion). The same content is Marfū' (attributed to the Prophet) from Abu Sa'id (RA) by the Five (Ahmad, Abu Dawud, An-Nasa'i, Ibn Majah, and At-Tirmidhi). And in it (the narration from Abu Sa'id): He would say after the Takbīr: \"A'ūdhu billāhi-s-samī'i-l-'alīmi mina-sh-shayṭāni-r-rajīm, min hamzihi, wa nafkhīhi, wa nafthīhi.\" (I seek refuge with Allah, the All-Hearing, the All-Knowing, from the outcast Satan, from his madness/evil suggestions, his pride/blowing, and his poetry/spitting)."
  },
  "takhreej": {
    "arabic": "صحيح. الدعاء الأول (سبحانك اللهم...) صحیح موقوف عن عمر، وصحيح مرفوع عن أبي سعيد الخدري. رواه الترمذي (242) وحسّنه، والنسائي (2/132)، وأبو داود (775)، وابن ماجه (804). وأما التعوذ بلفظ (أعوذ بالله السميع العليم...) فهو صحيح عن النبي صلى الله عليه وسلم، رواه أبو داود (775) وغيره.",
    "urdu": "صحیح۔ پہلی دعا (سبحانک اللھم...) حضرت عمرؓ کا صحیح موقوف قول ہے اور ابو سعید خدریؓ سے صحیح مرفوعاً (نبیؐ سے منسوب) مروی ہے۔ اسے ترمذی (242) نے روایت کر کے حسن قرار دیا، اور نسائی (2/132)، ابو داؤد (775)، اور ابن ماجہ (804) نے بھی روایت کیا ہے۔ تعوذ کا دوسرا حصہ (أعوذ بالله السميع العلیم...) نبی صلی اللہ علیہ وسلم سے صحیح مروی ہے، جسے ابو داؤد (775) وغیرہ نے روایت کیا ہے۔",
    "english": "Authentic (Sahih). The first supplication (Subḥānak Allāhumma...) is authentically Maukūf (saying of 'Umar), and authentically Marfū' (attributed to the Prophet) from Abu Sa'id Al-Khudrī. Reported by At-Tirmidhi (242) and graded Hasan, An-Nasa’i (2/132), Abu Dawud (775), and Ibn Majah (804). The second part of the seeking refuge (A'ūdhu billāhi-s-samī'i-l-'alīmi...) is authentically reported from the Prophet (PBUH), reported by Abu Dawud (775) and others."
  },
  "importantWords": [
    {
      "arabic": "سُبْحَانَكَ",
      "english": "Glory be to You",
      "urdu": "تو پاک ہے"
    },
    {
      "arabic": "تَبَارَكَ اسْمُكَ",
      "english": "Blessed is Your Name",
      "urdu": "بابَرَکت ہے تیرا نام"
    },
    {
      "arabic": "تَعَالَى جَدُّكَ",
      "english": "Exalted is Your Majesty/Grandeur",
      "urdu": "بلند ہے تیری شان"
    },
    {
      "arabic": "اَلسَّمِيعِ اَلْعَلِيمِ",
      "english": "The All-Hearing, the All-Knowing",
      "urdu": "سب کچھ سننے والا، سب کچھ جاننے والا"
    },
    {
      "arabic": "هَمْزِهِ",
      "english": "His evil suggestions/madness",
      "urdu": "اس کے وسوسوں سے"
    },
    {
      "arabic": "نَفْخِهِ",
      "english": "His blowing/pride",
      "urdu": "اس کے پھونکنے/کبر سے"
    },
    {
      "arabic": "نَفْثِهِ",
      "english": "His poetry/spitting (magic)",
      "urdu": "اس کے شعر/جادو سے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز کے آغاز میں پڑھی جانے والی دعاء الاستفتاح کی ایک اور مشہور صورت بیان کرتی ہے، جس میں اللہ کی حمد و ثنا اور اس کی بڑائی کا اقرار ہے۔ نیز، اس میں قراءت سے پہلے شیطان کے ہر طرح کے وسوسوں اور شر سے اللہ کی پناہ مانگنا بھی شامل ہے، جو اس بات کی تاکید ہے کہ نمازی کو اللہ سے راز و نیاز کے لیے قلبی و روحانی طہارت حاصل کرنی چاہیے۔",
    "english": "This Hadith presents another famous form of Du'a Al-Istiftāḥ (Opening Supplication) recited at the start of prayer, which includes praising Allah and acknowledging His Greatness. Furthermore, it includes seeking refuge in Allah from all forms of Satan's whispers and evil before recitation, emphasizing the need for the worshipper to attain spiritual purity and concentration for their intimate communion with Allah."
  },
  "references": [
    {
      "arabic": "سنن الترمذي، كتاب الصلاة، باب ما يقول عند افتتاح الصلاة (242)",
      "english": "Sunan At-Tirmidhi, Book of Prayer, Chapter: What one says when starting the prayer (242)"
    },
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب من رأى أن يجهر بها (775)",
      "english": "Sunan Abu Dawud, Book of Prayer, Chapter: The one who advocated reciting it loudly (775)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عمر بن الخطاب",
        "english": "'Umar ibn Al-Khattab"
      },
      "slug": "umar-ibn-al-khattab"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "دعاء الاستفتاح: ثنا اور تمجید",
        "english": "Du'a Al-Istiftāḥ: Praise and Glorification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی تعریف اور بڑائی",
              "english": "Praise and Greatness of Allah"
            },
            "content": {
              "urdu": [
                "«سبحانك اللهم وبحمدك...» یہ دعا اللہ کی پاکیزگی (تسبیح) اور تعریف (حمد) سے شروع ہوتی ہے۔",
                "«تبارك اسمك» میں اللہ کے نام کی برکت کا اقرار ہے، جس کا مطلب ہے کہ اس کے نام میں دائمی خیر ہے۔",
                "«تعالى جدك» اللہ کی شان اور عظمت کی بلندی کا اعتراف ہے، جو اس کی عظمت کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The supplication 'Subḥānak Allāhumma...' begins with the glorification (Tasbih) and praise (Hamd) of Allah.",
                "'Tabāraka-smuka' is the acknowledgment of the blessedness of Allah's Name, implying lasting goodness.",
                "'Ta'ālā jadduka' is the affirmation of the exaltation of Allah's Majesty and Greatness."
              ]
            }
          },
          {
            "title": {
              "urdu": "سیدنا عمرؓ کا عمل",
              "english": "The Practice of 'Umar (RA)"
            },
            "content": {
              "urdu": [
                "حضرت عمرؓ یہ دعا بلند آواز سے پڑھتے تھے تاکہ لوگوں کو اس کے الفاظ یاد ہو جائیں۔",
                "ان کا یہ عمل اس بات کی دلیل ہے کہ دعاء الاستفتاح کو لوگوں کو سکھانے کی ترغیب دی گئی ہے۔",
                "اگرچہ یہ موقوف روایت ہے، لیکن اس کی تعلیمات نبی اکرم صلی اللہ علیہ وسلم کے طریقے سے موافقت رکھتی ہیں۔"
              ],
              "english": [
                "'Umar (RA) used to recite this supplication aloud so that people could memorize its words.",
                "His action indicates the encouragement to teach people the words of Du'a Al-Istiftāḥ.",
                "Although this narration is Maukūf, its teachings align with the methodology of the Prophet (PBUH)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شیطان سے پناہ اور اس کی صورتیں",
        "english": "Seeking Refuge from Satan and its Forms"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعوذ کا حکم",
              "english": "The Command for Ta'awwudh (Seeking Refuge)"
            },
            "content": {
              "urdu": [
                "قراءتِ قرآن سے پہلے شیطان سے اللہ کی پناہ طلب کرنا قرآن کے حکم کے مطابق بھی ضروری ہے۔",
                "یہ دعا اللہ کے سمیع (سننے والا) اور علیم (جاننے والا) ہونے کے وصف سے پناہ مانگنے کی تاکید کرتی ہے۔",
                "یہ عمل قراءت کے دوران شیطانی وسوسوں سے محفوظ رہنے کا ذریعہ ہے۔"
              ],
              "english": [
                "Seeking refuge in Allah from Satan before reciting the Qur'an is also essential, as per the Quranic command.",
                "This supplication emphasizes seeking refuge through the attributes of Allah as 'As-Samī'' (All-Hearing) and 'Al-'Alīm' (All-Knowing).",
                "This act is a means of protection from Satanic whispers during the recitation."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطانی شر کی اقسام",
              "english": "Categories of Satan's Evil"
            },
            "content": {
              "urdu": [
                "«همزه» سے مراد جنون، وسوسے اور نماز میں خلل ڈالنے والے خیالات ہیں۔",
                "«نفخه» کی تفسیر کبر و نخوت سے کی گئی ہے، یعنی شیطان نماز میں ریاکاری کا پھونک مارتا ہے۔",
                "«نفثه» سے مراد شیطانی اشعار، جادو یا وسوسوں کا ایسا کلام ہے جو نمازی کی نیت میں خلل ڈالے۔"
              ],
              "english": [
                "'Hamz' is interpreted as madness, whispers, and distracting thoughts that disrupt the prayer.",
                "'Nafkh' is interpreted as pride and arrogance; Satan blows arrogance into the prayer.",
                "'Nafth' refers to satanic poetry, magic, or speech (whispers) that corrupts the worshipper's intention."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی رہنمائی",
        "english": "Juristic and Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعائے استفتاح کا حکم",
              "english": "Ruling on Du'a Al-Istiftāḥ"
            },
            "content": {
              "urdu": [
                "دعائے استفتاح پڑھنا سنت ہے، واجب نہیں؛ اگر کوئی نہ پڑھے تو نماز فاسد نہیں ہوتی۔",
                "اس دعا کو آہستہ آواز میں پڑھنا سنت ہے، سوائے حضرت عمرؓ کے تعلیم دینے کے عمل کے۔",
                "شافعی مسلک کے علاوہ دیگر فقہاء کے نزدیک یہ دعا پہلی رکعت تک محدود ہے۔"
              ],
              "english": [
                "Reciting the opening supplication is Sunnah, not obligatory; the prayer remains valid if omitted.",
                "The Sunnah is to recite this supplication quietly (in a low voice), except for the educational context of 'Umar's practice.",
                "Except for the Shafi'i school, other jurists restrict this supplication to the first Rak'ah only."
              ]
            }
          },
          {
            "title": {
              "urdu": "مختلف دعائیں پڑھنا",
              "english": "Reciting Different Supplications"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم سے کئی دعائے استفتاح ثابت ہیں، جنہیں باری باری پڑھنا سنت ہے۔",
                "اس سے نماز میں تنوع پیدا ہوتا ہے اور نمازی ہر بار نئے احساس اور توجہ کے ساتھ عبادت کرتا ہے۔",
                "ہر دعا میں مقصد اللہ کی حمد، گناہوں کا اقرار اور اصلاح کی طلب ہوتا ہے۔"
              ],
              "english": [
                "Several opening supplications are authenticated from the Prophet (PBUH), and reciting them alternately is Sunnah.",
                "This creates variety in the prayer, allowing the worshipper to engage with a renewed sense of focus each time.",
                "The common goal in every supplication is the praise of Allah, confession of sins, and seeking reform."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانیت اور اخلاق کا درس",
        "english": "Lesson in Spirituality and Ethics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اللہ کی عظمت",
              "english": "The Majesty of Allah"
            },
            "content": {
              "urdu": [
                "نماز کی ابتدا اللہ کی سب سے بڑی صفات کے اقرار سے ہوتی ہے، جو خشوع کو بڑھاتی ہے۔",
                "«لا إله غيرك» کا اقرار نماز کے دوران توحید کے عقیدے کو ذہن میں راسخ کرتا ہے۔",
                "دل میں جتنی زیادہ اللہ کی عظمت ہوگی، نماز اتنی ہی پرخلوص اور کامل ہوگی۔"
              ],
              "english": [
                "The prayer begins with the affirmation of Allah's greatest attributes, which enhances Khushu'.",
                "The affirmation 'Lā ilāha ghayruk' firmly establishes the belief in Tawheed during the prayer.",
                "The greater the Majesty of Allah in the heart, the more sincere and complete the prayer will be."
              ]
            }
          },
          {
            "title": {
              "urdu": "شیطان کے حملوں سے دفاع",
              "english": "Defense Against Satanic Attacks"
            },
            "content": {
              "urdu": [
                "تعوذ کا پڑھنا اس بات کا عملی اظہار ہے کہ نماز شیطانی حملوں کا سب سے بڑا مرکز ہے۔",
                "نمازی کو چاہیے کہ وہ ہر بار تعوذ کو صرف زبان سے نہیں بلکہ سچے دل سے پڑھ کر پناہ طلب کرے۔",
                "نماز میں پناہ مانگنا اس بات کو یقینی بناتا ہے کہ بندہ صرف اللہ کے لیے اخلاص کے ساتھ کھڑا ہے۔"
              ],
              "english": [
                "Reciting the Ta'awwudh is a practical demonstration that prayer is the main target of Satanic attacks.",
                "The worshipper should recite the Ta'awwudh not just verbally but sincerely, seeking refuge with a true heart.",
                "Seeking refuge in prayer ensures that the servant stands before Allah with complete sincerity, solely for Him."
              ]
            }
          }
        ]
      }
    }
  ]
}
