{
  "hadithId": 247,
  "hadithNo": 38,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/38"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام - كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ : { اِلْتَفَتَ إِلَيْنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ : \" إِذَا صَلَّى أَحَدُكُمْ فَلْيَقُلْ : اَلتَّحِيَّاتُ لِلَّهِ , وَالصَّلَوَاتُ , وَالطَّيِّبَاتُ , اَلسَّلَامُ عَلَيْكَ أَيُّهَا اَلنَّبِيُّ وَرَحْمَةَ اَللَّهِ وَبَرَكَاتُهُ , اَلسَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اَللَّهِ اَلصَّالِحِينَ , أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ , وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ , ثُمَّ لِيَتَخَيَّرْ مِنْ اَلدُّعَاءِ أَعْجَبُهُ إِلَيْهِ , فَيَدْعُو } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ وَلِلنَّسَائِيِّ : { كُنَّا نَقُولُ قَبْلِ أَنْ يُفْرَضَ عَلَيْنَا اَلتَّشَهُّدُ } وَلِأَحْمَدَ : { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَلَّمَهُ اَلتَّشَهُّد , وَأَمَرَهُ اَنْ يُعَلِّمَهُ اَلنَّاسَ } .‏ وَلِمُسْلِمٍ : عَنْ اِبْنِ اَبَّاسٍ ‏- رضى الله عنه ‏- قَالَ : { كَانَ رَسُولُ اَللَّهِ يُعَلِّمُنَا اَلتَّشَهُّدَ: \" اَلتَّحِيَّاتُ اَلْمُبَارَكَاتُ اَلصَّلَوَاتُ لِلَّهِ .‏.‏.‏ } إِلَى آخِرِهِ . ",
    "urdu": "سیدنا عبداللہ بن مسعود رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہماری طرف توجہ فرمائی اور ارشاد فرمایا کہ ” جب تم میں سے کوئی نماز پڑھے تو تشہد میں یوں کہے۔ «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» تمام سلامیاں اللہ ہی کیلئے ہیں اور نمازیں پاکیزیاں بھی (زبانی، بدنی اور مالی عبادتیں صرف اللہ کے لئے ہیں) اے نبی! سلام ہو آپ پر اور اللہ کی رحمت اور اس کی برکتیں ہوں۔ سلام ہو ہم پر اور اللہ کے صالح بندوں پر۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی لائق عبادت (معبود) نہیں اور اس کی بھی گواہی دیتا ہوں کہ محمد ( صلی اللہ علیہ وسلم ) اللہ کے بندے اور اس کے رسول ہیں۔ پھر اسے دعا کا انتخاب کرنا چاہیئے کہ جو اسے سب سے اچھی لگے وہ مانگے۔“ (بخاری و مسلم) متن حدیث کے الفاظ بخاری کے ہیں اور نسائی میں ہے کے ہم تشہد فرض ہونے سے پہلے کہا کرتے تھے اور احمد میں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو تشہد سکھایا اور حکم دیا کہ لوگوں کو اسے سکھاؤ اور مسلم میں ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں تشہد سکھاتے تھے (وہ اس طرح تھا) «التحيات المباركات الصلوات الطيبات لله» إلى آخره۔",
    "english": "Narrated Abdullah bin Mas'ud (RAA): The Messenger of Allah (ﷺ) turned towards us and said, 'When one of you prays, he should say (during the sitting): All compliments, prayers, and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous servants of Allah. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His servant and Messenger. Then he may choose whatever supplication he likes and supplicate.' Agreed upon; the version belongs to Al-Bukhari. An-Nasa'i added: 'We used to say this before the Tashahhud was made obligatory upon us.' Ahmad added: 'The Prophet (ﷺ) taught him the Tashahhud and ordered him to teach it to the people.' Muslim reported from Ibn Abbas (RAA) that the Messenger of Allah (ﷺ) used to teach us the Tashahhud: 'All blessed compliments, prayers, and pure words are due to Allah...'"
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (831)‏ ، ومسلم (402)‏ .‏ ورواية ابن عباس رواها مسلم (403).",
    "urdu": "یہ حدیث صحیح ہے۔ اسے بخاری اور مسلم نے روایت کیا ہے۔ ابن عباس رضی اللہ عنہما کی روایت مسلم (403) میں ہے۔",
    "english": "Sahih. Reported by Al-Bukhari (831) and Muslim (402). The narration of Ibn Abbas is in Muslim (403)."
  },
  "importantWords": [
    {
      "arabic": "اَلتَّحِيَّاتُ",
      "english": "Greetings / Compliments",
      "urdu": "تمام زبانی عبادتیں / سلامیاں"
    },
    {
      "arabic": "اَلصَّلَوَاتُ",
      "english": "Prayers",
      "urdu": "تمام بدنی عبادتیں / نمازیں"
    },
    {
      "arabic": "اَلطَّيِّبَاتُ",
      "english": "Pure words / Good things",
      "urdu": "تمام مالی و پاکیزہ عبادتیں"
    },
    {
      "arabic": "اَلصَّالِحِينَ",
      "english": "The righteous",
      "urdu": "نیک لوگ"
    },
    {
      "arabic": "يُفْرَضَ",
      "english": "To be made obligatory",
      "urdu": "فرض کیا جانا"
    },
    {
      "arabic": "لِيَتَخَيَّرْ",
      "english": "Let him choose",
      "urdu": "وہ انتخاب کر لے"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز کے قعدہ میں پڑھے جانے والے کلمات (تشہد) اور اس کے بعد دعا مانگنے کی مشروعیت کا بیان ہے۔",
    "english": "This Hadith explains the words of Tashahhud to be recited during the sitting of prayer and the permissibility of personal supplication afterward."
  },
  "references": [
    {
      "arabic": "رواه البخاري (831)",
      "english": "Reported by Al-Bukhari (831)"
    },
    {
      "arabic": "رواه مسلم (402)",
      "english": "Reported by Muslim (402)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah bin Mas'ud"
      },
      "slug": "abdullah-bin-masud"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah bin Abbas"
      },
      "slug": "abdullah-bin-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Fj-yI_lD2K4",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تشہد کی اہمیت اور الفاظ",
        "english": "Importance and Wording of Tashahhud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جامع کلمات کا مجموعہ",
              "english": "Collection of Comprehensive Words"
            },
            "content": {
              "urdu": [
                "تشہد کے کلمات اللہ کی بڑائی، نبی پر سلام اور صالحین کے لیے دعا پر مشتمل ہیں۔",
                "التحیات میں زبانی، بدنی اور مالی تمام عبادتیں اللہ کے لیے خاص کی گئی ہیں۔",
                "یہ کلمات بندے اور رب کے درمیان تعلق کو مضبوط کرتے ہیں۔"
              ],
              "english": [
                "The words of Tashahhud include glorifying Allah and salutations upon the Prophet.",
                "In 'At-Tahiyyat', all verbal, physical, and financial acts of worship are dedicated to Allah.",
                "These words strengthen the bond between the servant and the Lord."
              ]
            }
          },
          {
            "title": {
              "urdu": "تشہد کی فرضیت",
              "english": "Obligation of Tashahhud"
            },
            "content": {
              "urdu": [
                "نسائی کی روایت 'فرض ہونے سے پہلے' اس کی فرضیت پر دلیل ہے۔",
                "اکثر ائمہ کے نزدیک قعدہ اخیرہ میں تشہد پڑھنا نماز کا رکن ہے۔",
                "اس کے بغیر نماز مکمل نہیں ہوتی، اس لیے اسے سیکھنا ضروری ہے۔"
              ],
              "english": [
                "The narration of An-Nasa'i suggests that Tashahhud is an obligatory part of prayer.",
                "Most scholars consider reciting Tashahhud in the final sitting a pillar of Salah.",
                "Prayer is not complete without it, making it essential to learn and memorize."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تشہد کے مختلف صیغے",
        "english": "Different Versions of Tashahhud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایات کا تنوع",
              "english": "Diversity of Narrations"
            },
            "content": {
              "urdu": [
                "ابن مسعود اور ابن عباس رضی اللہ عنہما کے الفاظ میں معمولی فرق ہے۔",
                "ابن مسعود کا تشہد 'التحیات للہ' سے جبکہ ابن عباس کا 'المبارکات' سے شروع ہوتا ہے۔",
                "علماء کے نزدیک تمام مستند صیغے پڑھنا جائز اور درست ہیں۔"
              ],
              "english": [
                "There is a slight difference in wording between Ibn Mas'ud and Ibn Abbas.",
                "Ibn Mas'ud's version starts with 'At-Tahiyyatu lillah' while Ibn Abbas adds 'Al-Mubarakatu'.",
                "Scholars agree that reciting any of the authentically reported versions is valid."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابن مسعود کی روایت کی ترجیح",
              "english": "Preference for Ibn Mas'ud's Narration"
            },
            "content": {
              "urdu": [
                "احناف اور شوافع کے نزدیک ابن مسعود کی روایت زیادہ مستند اور قوی ہے۔",
                "نبی کریم ﷺ نے ابن مسعود کو یہ کلمات نہایت توجہ سے سکھائے تھے۔",
                "اسے سکھانے کا حکم دینا اس کی خاص اہمیت کو واضح کرتا ہے۔"
              ],
              "english": [
                "Many scholars prefer Ibn Mas'ud's version due to its high level of authenticity.",
                "The Prophet (ﷺ) taught it to Ibn Mas'ud with great care and attention.",
                "The command to teach it to others highlights its specific importance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تشہد کے بعد دعا کی مشروعیت",
        "english": "Supplication After Tashahhud"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کی قبولیت کا وقت",
              "english": "Time for Acceptance of Prayer"
            },
            "content": {
              "urdu": [
                "تشہد کے بعد اور سلام سے پہلے کا وقت دعا کی قبولیت کا بہترین وقت ہے۔",
                "انسان کو اپنی پسند کی جائز دینی و دنیوی دعائیں مانگنی چاہئیں۔",
                "تاہم مسنون دعاؤں کو اپنی مرضی کی دعاؤں پر فوقیت دینی چاہیے۔"
              ],
              "english": [
                "The interval after Tashahhud and before the Salam is a prime time for supplication.",
                "One may ask for any permissible worldly or religious needs from Allah.",
                "However, the supplications taught by the Prophet (ﷺ) should be prioritized."
              ]
            }
          },
          {
            "title": {
              "urdu": "جامع دعا کا انتخاب",
              "english": "Choosing Comprehensive Supplications"
            },
            "content": {
              "urdu": [
                "نبی کریم ﷺ نے جامع دعائیں مانگنے کی ترغیب دی ہے۔",
                "عذابِ قبر اور فتنہ دجال سے پناہ مانگنا اس موقع پر مسنون ہے۔",
                "یہ بندے کے لیے عاجزی اور اللہ سے مانگنے کا بہترین مقام ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) encouraged using comprehensive and meaningful prayers.",
                "Seeking refuge from the punishment of the grave and Dajjal is Sunnah here.",
                "This is a perfect moment for the servant to express humility and need."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تربیتی پہلو",
        "english": "Educational and Practical Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تعلیمِ تشہد کا حکم",
              "english": "Command to Teach Tashahhud"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے ابن مسعود کو حکم دیا کہ وہ لوگوں کو تشہد سکھائیں۔",
                "دین کی بنیادی باتیں دوسروں تک پہنچانا ہر مسلمان کی ذمہ داری ہے۔",
                "نماز کے ارکان کی درستی کے لیے ایک دوسرے کی رہنمائی کرنی چاہیے۔"
              ],
              "english": [
                "The Prophet (ﷺ) ordered Ibn Mas'ud to teach the Tashahhud to others.",
                "Relaying the fundamentals of religion is a responsibility of every Muslim.",
                "We should guide each other to ensure the correctness of our prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "توجہ اور اہتمام",
              "english": "Attention and Diligence"
            },
            "content": {
              "urdu": [
                "حدیث میں 'ہماری طرف توجہ فرمائی' کے الفاظ علم کی اہمیت بتاتے ہیں۔",
                "سیکھنے اور سکھانے کے عمل میں پوری توجہ اور سنجیدگی ہونی چاہیے۔",
                "نماز کو مسنون طریقے پر پڑھنا ہی اس کی روح اور جان ہے۔"
              ],
              "english": [
                "The phrase 'He turned towards us' signifies the importance of the teaching.",
                "Teaching and learning should be conducted with full focus and seriousness.",
                "Performing prayer according to the Sunnah is its true spirit and essence."
              ]
            }
          }
        ]
      }
    }
  ]
}
