{
  "hadithId": 231,
  "hadithNo": 22,
  "hadithReferences": {
    "sunnah.com": ["Sahih al-Bukhari 817", "Sahih Muslim 484"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: فِي رُكُوعِهِ وَسُجُودِهِ : \"سُبْحَانَكَ اَللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ , اَللَّهُمَّ اِغْفِرْ لِي\" } مُتَّفَقٌ عَلَيْهِ",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم رکوع و سجود میں «سبحانك اللهم ربنا وبحمدك اللهم اغفرلي» ” تو پاک ہے اے اللہ! اے ہمارے پروردگار! اپنی حمد و ثنا کے ساتھ۔ اے اللہ! مجھے بخش دے۔“ پڑھا کرتے۔ (بخاری و مسلم)",
    "english": "Narrated 'Aisha (May Allah be pleased with her): The Messenger of Allah (ﷺ) used to say in his bowing (Ruku') and prostrations (Sujud): \"Subhanaka Allahumma Rabbana wa bihamdika, Allahummagh-firli.\" (Glory be to You, O Allah, our Lord, and with Your praise, O Allah, forgive me.) (Agreed upon: Al-Bukhari and Muslim)."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري (817)‏ ، ومسلم (484)‏ .‏ في رواية مسلم زيادة \"يتأول القرآن\" ، وهي إشارة إلى العمل بقوله تعالى : (فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا)",
    "urdu": "صحیح متفق علیہ روایت۔ اسے بخاری (817) اور مسلم (484) نے روایت کیا ہے۔ مسلم کی ایک روایت میں یہ اضافہ ہے کہ \"آپ قرآن پر عمل کر رہے تھے\"، جو سورۃ النصر کی اس آیت کی طرف اشارہ ہے: (فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا) \"پس اپنے رب کی حمد کے ساتھ تسبیح کیجئے اور اس سے بخشش طلب کیجئے۔ بے شک وہ بڑا توبہ قبول کرنے والا ہے۔\"",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (817) and Muslim (484). The narration in Muslim adds the phrase 'He was acting upon the Qur'an,' referring to the implementation of Allah’s command in Surah An-Nasr (Chapter 110): (Fasabbih bihamdi Rabbika wastaghfirh, innahu kana tawwaba) 'So exalt [Allah] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance.'"
  },
  "importantWords": [
    {
      "arabic": "يَقُولُ",
      "english": "He used to say",
      "urdu": "آپ کہتے تھے"
    },
    {
      "arabic": "رُكُوعِهِ",
      "english": "His bowing",
      "urdu": "آپ کے رکوع میں"
    },
    {
      "arabic": "سُجُودِهِ",
      "english": "His prostrations",
      "urdu": "آپ کے سجدوں میں"
    },
    {
      "arabic": "سُبْحَانَكَ",
      "english": "Glory be to You",
      "urdu": "تو پاک ہے"
    },
    {
      "arabic": "وَبِحَمْدِكَ",
      "english": "And with Your praise",
      "urdu": "اور تیری حمد کے ساتھ"
    },
    {
      "arabic": "اِغْفِرْ لِي",
      "english": "Forgive me",
      "urdu": "مجھے بخش دے"
    },
    {
      "arabic": "يَتَأَوَّلُ",
      "english": "He was interpreting/implementing",
      "urdu": "آپ عمل کر رہے تھے"
    }
  ],
  "summary": {
    "urdu": "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ رکوع اور سجدے میں 'سُبْحَانَكَ اَللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ, اَللَّهُمَّ اِغْفِرْ لِي' پڑھتے تھے، جو اللہ کی تسبیح، حمد اور استغفار کا مجموعہ ہے۔ یہ عمل سورۃ النصر کے حکم کی تعمیل میں آپ کا آخری معمول تھا۔",
    "english": "Aisha (RA) narrated that the Prophet (ﷺ) would frequently recite a specific supplication combining glorification, praise, and seeking forgiveness ('Subhanaka Allahumma... Allahummagh-firli') in his bowing and prostrations. This practice was linked to implementing the command revealed in the Qur'an (Surah An-Nasr) towards the end of his life."
  },
  "references": [
    {
      "arabic": "رواه البخاري (817)",
      "english": "Reported by Al-Bukhari (817)"
    },
    {
      "arabic": "رواه مسلم (484)",
      "english": "Reported by Muslim (484)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر",
        "english": "Aisha bint Abi Bakr"
      },
      "slug": "aisha-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R9jFpQ4Zz9k",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تسبیح اور استغفار کا امتزاج",
        "english": "Combination of Glorification and Forgiveness"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسنون دعا کی جامعیت",
              "english": "The Comprehensive Prophetic Supplication"
            },
            "content": {
              "urdu": [
                "یہ مسنون دعا اللہ کی پاکیزگی (تسبیح)، تعریف (حمد) اور بخشش (استغفار) کو ایک ساتھ جمع کرتی ہے۔",
                "یہ نماز کے ان افعال میں بہترین ذکر ہے جہاں تسبیح اور دعا کا حکم دیا گیا ہے۔",
                "یہ عمل بندگی کے اعلیٰ مقام کو ظاہر کرتا ہے، جہاں بندہ اللہ کی تعریف کے ساتھ اپنی کوتاہی کا اعتراف بھی کرتا ہے۔"
              ],
              "english": [
                "This established supplication combines the glorification (Tasbih), praise (Hamd), and seeking forgiveness (Istighfar) of Allah.",
                "It is one of the best forms of remembrance in these prayer postures where Tasbih and Du'a are commanded.",
                "This act shows the peak of servitude, where the servant acknowledges Allah's perfection along with their own shortcomings."
              ]
            }
          },
          {
            "title": {
              "urdu": "قرآن پر عمل کی تعبیر",
              "english": "Implementation of the Qur'anic Command"
            },
            "content": {
              "urdu": [
                "مسلم کی روایت میں اس دعا کو سورۃ النصر پر عمل کرنے سے تعبیر کیا گیا ہے۔",
                "سورۃ النصر میں فتح کے بعد تسبیح و استغفار کا حکم تھا جو آپ ﷺ نے نماز میں اپنایا۔",
                "اس سے معلوم ہوا کہ نماز کے اذکار اللہ کے آخری حکم (سورۃ النصر) کی تکمیل تھے۔"
              ],
              "english": [
                "The narration in Sahih Muslim connects this supplication to the fulfillment of the command in Surah An-Nasr.",
                "The Surah commanded glorification and seeking forgiveness after victory, which the Prophet (ﷺ) adopted in his prayer.",
                "This shows that the remembrances in prayer were an implementation of Allah's final command (Surah An-Nasr)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی حکم",
        "english": "Juristic and Practical Ruling"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رکوع و سجدہ میں پڑھنا",
              "english": "Recitation in Ruku' and Sujud"
            },
            "content": {
              "urdu": [
                "یہ دعا رکوع اور سجدہ دونوں میں پڑھنا سنت سے ثابت ہے اور مستحب عمل ہے۔",
                "یہ دعا رکوع میں 'سبحان ربي العظيم' اور سجدے میں 'سبحان ربي الأعلى' کے ساتھ پڑھی جا سکتی ہے۔",
                "فقہاء نے اسے ایک اضافی اور بہترین ذکر قرار دیا ہے جسے نماز میں شامل کرنا باعثِ اجر ہے۔"
              ],
              "english": [
                "It is established from the Sunnah and is a recommended act to recite this supplication in both Ruku' and Sujud.",
                "This Du'a can be recited alongside 'Subhana Rabbiyal-Azeem' in Ruku' and 'Subhana Rabbiyal-A'la' in Sujud.",
                "Jurists consider this an excellent additional form of remembrance, the inclusion of which brings great reward in prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "استغفار کی اہمیت",
              "english": "The Importance of Seeking Forgiveness"
            },
            "content": {
              "urdu": [
                "اللہ کے نبی ﷺ کا رکوع و سجدے میں کثرت سے استغفار کرنا امت کے لیے سبق ہے۔",
                "آپ ﷺ کا یہ عمل ہماری اپنی کوتاہیوں اور بھول چوک پر استغفار کی ترغیب دیتا ہے۔",
                "استغفار، عبادت کی کمی کو پورا کرنے اور اللہ سے تعلق مضبوط کرنے کا ذریعہ ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) frequent seeking of forgiveness in Ruku' and Sujud is a lesson for the Ummah.",
                "His act encourages us to seek forgiveness for our own negligence and unintentional mistakes.",
                "Istighfar serves to compensate for deficiencies in worship and strengthens the bond with Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی پہلو",
        "english": "Spiritual and Educational Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عاجزی کا اظہار",
              "english": "Expression of Humility"
            },
            "content": {
              "urdu": [
                "رکوع و سجدہ بندگی اور عاجزی کی انتہائی حالتیں ہیں، جہاں بندہ مکمل جھک جاتا ہے۔",
                "تسبیح کے بعد مغفرت طلب کرنا یہ ظاہر کرتا ہے کہ عظمت صرف اللہ کے لیے ہے اور بندہ گناہوں کا محتاج ہے۔",
                "یہ سنت ہمیں سکھاتی ہے کہ بہترین عبادت کے ساتھ بھی ہمیشہ اللہ سے معافی مانگتے رہنا چاہیے۔"
              ],
              "english": [
                "Ruku' and Sujud are extreme states of worship and humility where the servant bows completely.",
                "Seeking forgiveness after glorification shows that perfection belongs only to Allah and the servant is in need of pardon.",
                "This Sunnah teaches us that even with the best worship, we should constantly ask for Allah's forgiveness."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی تاثیر",
              "english": "The Effect of Prayer"
            },
            "content": {
              "urdu": [
                "اس حدیث پر عمل کرنے سے نماز کی روحانی تاثیر اور خشوع میں اضافہ ہوتا ہے۔",
                "نماز صرف حرکات کا نام نہیں، بلکہ اللہ کے ساتھ دل سے کی جانے والی مناجات ہے۔",
                "یہ دعا نماز کو ایک مکمل عبادت بنا دیتی ہے جس میں حمد، تسبیح اور مغفرت سب شامل ہیں۔"
              ],
              "english": [
                "Acting upon this Hadith increases the spiritual impact and devotion (Khushu') in the prayer.",
                "Prayer is not just a set of movements, but a sincere, heartfelt conversation with Allah.",
                "This specific supplication makes the prayer a complete act of worship, including praise, glorification, and seeking pardon."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی",
        "english": "Practical Guidance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مداومت کا حصول",
              "english": "Achieving Consistency"
            },
            "content": {
              "urdu": [
                "مومن کو چاہیے کہ وہ یہ دعا کثرت سے پڑھے، بالخصوص فرض اور نفل دونوں نمازوں میں۔",
                "نبی اکرم ﷺ نے اس دعا کو معمول بنا لیا تھا، جو اس کی فضیلت اور اہمیت کو ظاہر کرتا ہے۔",
                "اگر وقت کی کمی ہو تو یہ دعا صرف ایک بار سجدے میں پڑھ لینا بھی باعثِ اجر ہے۔"
              ],
              "english": [
                "A believer should recite this supplication frequently, especially in both obligatory and voluntary prayers.",
                "The Prophet (ﷺ) made this a regular practice, which highlights its virtue and importance.",
                "If time is limited, reciting this Du'a just once in prostration is still highly rewarding."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذکار کی اقسام",
              "english": "Types of Remembrances"
            },
            "content": {
              "urdu": [
                "ركوع اور سجود میں تین طرح کے اذکار کا اہتمام کیا جا سکتا ہے (تسبیح، حمد/ثناء، دعا/استغفار)۔",
                "یہ دعا (سُبْحَانَكَ اَللَّهُمَّ رَبَّنَا...) ان تینوں اقسام کو ایک خوبصورت انداز میں شامل کرتی ہے۔",
                "دوسری مسنون دعاؤں کو بھی پڑھنا چاہیے تاکہ سنت کے تمام پہلوؤں پر عمل ہو سکے۔"
              ],
              "english": [
                "Three types of remembrances can be maintained in Ruku' and Sujud (Tasbih, Hamd/Praise, Du'a/Istighfar).",
                "This specific supplication ('Subhanaka Allahumma...') incorporates all three types beautifully.",
                "One should also recite other established Sunnah supplications to implement all aspects of the Prophetic practice."
              ]
            }
          }
        ]
      }
    }
  ]
}
