{
  "hadithId": 215,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["2", "7"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "كتاب صفة الصلاة",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- يَسْتَفْتِحُ اَلصَّلَاةَ بِالتَّكْبِيرِ , وَالْقِرَاءَةَ : بِـ (اَلْحَمْدُ لِلَّهِ رَبِّ اَلْعَالَمِينَ )‏ وَكَانَ إِذَا رَكَعَ لَمْ يُشْخِصْ رَأْسَهُ , وَلَمْ يُصَوِّبْهُ , وَلَكِنْ بَيْنَ ذَلِكَ .‏ وَكَانَ إِذَا رَفَعَ مِنْ اَلرُّكُوعِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ قَائِمًا .‏ وَإِذَا رَفَعَ مِنْ اَلسُّجُودِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ جَالِسًا .‏ وَكَانَ يَقُولُ فِي كُلِّ رَكْعَتَيْنِ اَلتَّحِيَّةَ .‏ وَكَانَ يَفْرِشُ رِجْلَهُ اَلْيُسْرَى وَيَنْصِبُ اَلْيُمْنَى .‏ وَكَانَ يَنْهَى عَنْ عُقْبَةِ اَلشَّيْطَانِ , وَيَنْهَى أَنْ يَفْتَرِشَ اَلرَّجُلُ زِرَاعَيْهِ اِفْتِرَاشَ اَلسَّبُعِ .‏ وَكَانَ يُخْتَمُ اَلصَّلَاةَ بِالتَّسْلِيمِ } أَخْرَجَهُ مُسْلِمٌ , وَلَهُ عِلَّةٌ",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز کا آغاز «الله اكبر» سے کیا کرتے تھے اور قرأت «الحمد لله رب العالمين» (سورۃ فاتحہ) سے شروع کرتے۔ اور جب رکوع کرتے تو اپنا سر مبارک نہ اونچا کرتے اور نہ نیچا کرتے بلکہ اس کے درمیان کی حالت میں رکھتے اور جب رکوع سے سر اٹھاتے تو اس وقت تک سجدہ میں نہ جاتے جب تک کہ بالکل سیدھے کھڑے نہ ہو جاتے اور جب سجدہ سے سر اٹھاتے تو دوسرا سجدہ اس وقت تک نہ کرتے جب تک کہ ٹھیک آرام سے بیٹھ نہ جاتے اور ہر دو رکعت کے بعد تشہد پڑھتے اور اپنے بائیں پاؤں کو زمین پر بچھا لیتے اور دائیں کو قائم رکھتے (کھڑا رکھتے)۔ شیطان کی چوکڑی سے منع فرماتے تھے اور درندوں کی طرح بازو آگے نکال کر بچھانے سے بھی منع فرماتے تھے اور نماز کو سلام کے ساتھ ختم کرتے تھے۔ (مسلم) ",
    "english": "Narrated from 'Aishah (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings be upon him) would begin the prayer with the Takbīr (Allahu Akbar), and the recitation with 'Al-Hamdu Lillahi Rabbil 'Alamīn' (Surah Al-Fatihah). When he bowed (Rukū'), he would neither raise his head nor lower it, but keep it in between. When he raised his head from bowing, he would not prostrate until he had stood up straight. When he raised his head from prostration, he would not prostrate again until he had sat up straight in composure. He used to say the Tashahhud in every two Rak'ah. He would spread out his left foot and keep his right foot upright. He used to forbid 'Uqbat Ash-Shayṭān (the squat of Satan) and forbid a man from spreading out his forearms like a beast of prey. He would conclude the prayer with the Taslīm (salutation). Reported by Muslim."
  },
  "takhreej": {
    "arabic": "صحيح بشواهده. رواه مسلم في كتاب الصلاة، باب ما يجمع صفة الصلاة (498). علة الحديث (انقطاع) کے باوجود، اس کا ہر جزء صحیح بخاری اور مسلم میں دیگر قوی سندوں سے ثابت ہے، لہذا یہ صحیح لغیرہ ہے۔",
    "urdu": "صحیح بشواہدہ (شواہد کی بنا پر صحیح)۔ اسے مسلم نے کتاب الصلاة، باب ما یجمع صفة الصلاة (498) میں روایت کیا ہے۔ سند میں انقطاع کی علت کے باوجود، اس حدیث کا ہر حصہ صحیح بخاری اور مسلم میں دوسری قوی سندوں کے ساتھ ثابت ہے، لہٰذا یہ حدیث مجموعی طور پر صحیح ہے۔",
    "english": "Authentic due to corroborating reports (Sahih li ghayrihi). Reported by Muslim in the Book of Prayer, Chapter: What summarizes the description of the prayer (498). Although the chain has a disconnection (illah), every part of this Hadith is individually proven with other strong chains in Sahih Al-Bukhari and Muslim, hence the Hadith is authentic overall."
  },
  "importantWords": [
    {
      "arabic": "يَسْتَفْتِحُ",
      "english": "He would begin/open",
      "urdu": "آغاز کرتے تھے"
    },
    {
      "arabic": "لَمْ يُشْخِصْ رَأْسَهُ",
      "english": "He did not raise his head",
      "urdu": "سر اونچا نہیں کرتے تھے"
    },
    {
      "arabic": "لَمْ يُصَوِّبْهُ",
      "english": "Nor did he lower it (head)",
      "urdu": "اور نہ نیچا کرتے تھے"
    },
    {
      "arabic": "يَسْتَوِيَ قَائِمًا",
      "english": "He stood up straight",
      "urdu": "بالکل سیدھے کھڑے ہو جاتے"
    },
    {
      "arabic": "عُقْبَةِ الشَّيْطَانِ",
      "english": "The squat of Satan",
      "urdu": "شیطان کی چوکڑی/بیٹھک"
    },
    {
      "arabic": "يَفْتَرِشَ زِرَاعَيْهِ",
      "english": "Spread out his forearms",
      "urdu": "بازووں کو بچھائے"
    },
    {
      "arabic": "اِفْتِرَاشَ اَلسَّبُعِ",
      "english": "Like a beast of prey",
      "urdu": "درندے کی طرح بچھانا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز کے اہم ترین آداب اور ارکان کی وضاحت کرتی ہے۔ یہ بتاتی ہے کہ نماز کا آغاز تکبیر اور سورۃ فاتحہ سے ہو، رکوع کی حالت میں سر کو کمر کے متوازی رکھا جائے، اور تمام ارکان (رکوع سے کھڑے ہونا اور سجدوں کے درمیان بیٹھنا) اطمینان سے ادا ہوں۔ اس کے علاوہ، یہ شیطان کی چوکڑی اور سجدے میں درندوں کی طرح بازو بچھانے سے منع کرتی ہے، اور نماز کا اختتام سلام سے ہوتا ہے۔",
    "english": "This Hadith clarifies the most important etiquettes and pillars of prayer. It states that prayer begins with Takbir and Surah Al-Fatihah, the head should be parallel to the back in Ruku', and all transitions (rising from Ruku' and sitting between Sujud) must be performed with Tuma'ninah (composure). Furthermore, it prohibits 'Uqbat Ash-Shayṭān (squatting) and spreading forearms like a predator in Sujud, and confirms that the prayer concludes with the Taslīm."
  },
  "references": [
    {
      "arabic": "صحيح مسلم، كتاب الصلاة، باب ما يجمع صفة الصلاة (498)",
      "english": "Sahih Muslim, Book of Prayer, Chapter: What summarizes the description of the prayer (498)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشة بنت أبي بكر الصديق",
        "english": "'Aishah bint Abi Bakr As-Siddiq"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S2E-R6kUeB0",
  "grade": {
    "arabic": "صحيح لغيره",
    "english": "Authentic due to corroborating reports (Sahih li ghayrihi)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز کا آغاز اور بنیادی ارکان",
        "english": "Beginning of Prayer and Core Pillars"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ابتدائی فرائض",
              "english": "Initial Obligations (Furūd)"
            },
            "content": {
              "urdu": [
                "نماز کی ابتدا تکبیر تحریمہ سے ہوتی ہے اور قراءت کا آغاز سورۃ فاتحہ (الحمد للہ رب العالمین) سے ہوتا ہے۔",
                "رکوع میں سر کا پوزیشن درست رکھنا ضروری ہے: نہ اونچا ہو کہ کمر سے اوپر رہے، نہ نیچا ہو کہ خم آ جائے۔",
                "یہ حالت اس بات کو یقینی بناتی ہے کہ کمر اور سر ایک سیدھ میں ہو کر سنت کو پورا کریں۔"
              ],
              "english": [
                "Prayer begins with Takbirat Al-Ihram, and recitation starts with Surah Al-Fatihah (Al-Hamdu Lillahi Rabbil 'Alamīn).",
                "It is essential to keep the head position correct in Ruku': neither raised above the back nor dipped below it.",
                "This posture ensures the back and head are aligned, fulfilling the requirements of the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعدیلِ ارکان کا تسلسل",
              "english": "Continuity of Tuma'ninah (Composure)"
            },
            "content": {
              "urdu": [
                "حدیث واضح کرتی ہے کہ رکوع سے کھڑے ہونے اور سجدوں کے درمیان بیٹھنے میں مکمل اطمینان ضروری ہے۔",
                "رکوع سے اٹھ کر فوراً سجدہ میں جانا یا سجدوں کے درمیان بیٹھے بغیر دوسرا سجدہ کرنا نماز کو ناقص کرتا ہے۔",
                "یہ اصول نماز میں خشوع اور تمام ارکان کو اس کے حق کے مطابق ادا کرنے کی تاکید کرتا ہے۔"
              ],
              "english": [
                "The Hadith clarifies that complete composure (Tuma'ninah) is necessary when rising from Ruku' and sitting between the Sujud.",
                "Rushing from Ruku' to Sujud or performing the second Sujud without sitting properly invalidates the prayer.",
                "This principle emphasizes Khushu' and performing all pillars according to their due right."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "منع کردہ ہیئتیں اور آداب",
        "english": "Forbidden Postures and Etiquettes"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عقبۃ الشیطان سے ممانعت",
              "english": "Prohibition of 'Uqbat Ash-Shayṭān"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے 'عقبۃ الشیطان' (شیطان کی چوکڑی) سے منع فرمایا۔",
                "اس سے مراد یہ ہے کہ قعدہ میں سرین پر بیٹھ کر گھٹنوں کو سینے سے لگانا (جسے 'احتباء' بھی کہتے ہیں)۔",
                "یہ طریقہ سستی اور بدویانہ انداز کو ظاہر کرتا ہے جو نماز کے آداب کے خلاف ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) forbade 'Uqbat Ash-Shayṭān (the squat of Satan).",
                "This refers to squatting on the buttocks while embracing the knees to the chest (also known as Iḥtibā'), during the sitting position.",
                "This posture indicates laziness and a crude style that is contrary to the etiquette of prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "درندوں کی طرح بچھانا",
              "english": "Spreading Like a Beast of Prey"
            },
            "content": {
              "urdu": [
                "سجدہ میں بازوؤں کو زمین پر درندوں یا کُتّوں کی طرح بچھا دینے سے بھی منع کیا گیا۔",
                "سنت یہ ہے کہ بازوؤں کو زمین سے اٹھا کر رکھا جائے تاکہ ان میں اور پہلوؤں کے درمیان فاصلہ رہے۔",
                "یہ عمل سجدے میں اعتدال اور خشوع کو برقرار رکھنے کے لیے ضروری ہے۔"
              ],
              "english": [
                "It is forbidden to spread one's forearms flat on the ground during Sujud, like a predator or a dog.",
                "The Sunnah is to keep the forearms raised off the ground, maintaining space between the arms and the sides.",
                "This action is necessary for maintaining moderation and humility (Khushu') in prostration."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تشہد اور نماز کا اختتام",
        "english": "Tashahhud and Conclusion of Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تشہد کا وقت اور طریقہ",
              "english": "Time and Method of Tashahhud"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم ہر دو رکعت کے بعد تشہد پڑھتے تھے، جو فرض نمازوں میں قعدہ اولیٰ اور قعدہ اخیرہ ہے۔",
                "قعدہ میں بایاں پاؤں بچھانا اور دائیں کو کھڑا رکھنا 'افتراش' کا طریقہ ہے، جو اس حدیث سے ثابت ہے۔",
                "یہ طریقہ پہلی تشہد یا دو رکعت والی نماز کے آخری تشہد کے لیے ہے۔"
              ],
              "english": [
                "The Prophet (PBUH) used to recite the Tashahhud after every two Rak'ah (Qad'ah Ūlā and Qad'ah Ākhirah in obligatory prayers).",
                "The method of sitting by spreading the left foot and keeping the right upright ('Iftirāsh') is confirmed by this Hadith.",
                "This posture is for the first Tashahhud or the final Tashahhud of two-Rak'ah prayers."
              ]
            }
          },
          {
            "title": {
              "urdu": "سلام پر اختتام",
              "english": "Concluding with Taslīm"
            },
            "content": {
              "urdu": [
                "حدیث واضح کرتی ہے کہ نماز کا اختتام سلام (التسلیم) سے ہوتا ہے۔",
                "دونوں طرف سلام پھیرنا نماز کے ارکان میں سے ایک ہے، اور اس کے بغیر نماز مکمل نہیں ہوتی۔",
                "سلام کے بعد ہی نمازی نماز کے احرام (پابندیوں) سے باہر آتا ہے۔"
              ],
              "english": [
                "The Hadith clarifies that the prayer concludes with the salutation (Taslīm).",
                "Turning the head and saying the Salām (to both sides) is one of the pillars of the prayer, without which it is incomplete.",
                "Only after the Taslīm does the worshipper exit the sacred state (Iḥrām) of the prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "علمی اور تربیتی سبق",
        "english": "Scholarly and Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحیح لغیرہ کا اصول",
              "english": "The Principle of Sahih li ghayrihi"
            },
            "content": {
              "urdu": [
                "اس حدیث میں انقطاع کی علت کے باوجود، دیگر احادیث کی تائید کی بنا پر اسے صحیح مانا گیا ہے۔",
                "یہ علم حدیث کا اصول ہے کہ ضعیف روایت اگر متعدد شواہد سے تقویت پائے تو قابل عمل ہو جاتی ہے۔",
                "اس طرح سے نماز کی صفات کی یہ جامع تفصیل مسلمانوں کے لیے قابل عمل ہے۔"
              ],
              "english": [
                "Despite the disconnection (illah) in this Hadith's chain, it is considered authentic due to corroboration from other narrations.",
                "This is a principle of Hadith science: a weak report becomes actionable if strengthened by multiple supporting reports.",
                "Thus, this comprehensive description of the prayer's attributes is actionable for Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "توازن اور اعتدال",
              "english": "Balance and Moderation"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے ہر رکن میں افراط و تفریط (حد سے تجاوز اور کمی) سے منع فرما کر اعتدال سکھایا۔",
                "رکوع میں سر کو نہ بہت اونچا کرنا اور نہ ہی نیچا کرنا اسی اعتدال کی بہترین مثال ہے۔",
                "نماز کو صرف ظاہری حرکات نہیں بلکہ اللہ کی موجودگی کے احساس کے ساتھ ادا کرنا چاہیے۔"
              ],
              "english": [
                "The Prophet (PBUH) taught moderation by forbidding extremism and negligence (Ifrāṭ wa Tafrīṭ) in every pillar.",
                "Not raising or lowering the head excessively in Ruku' is a prime example of this moderation.",
                "Prayer should be performed not merely as physical movements but with the feeling of being in Allah's presence."
              ]
            }
          }
        ]
      }
    }
  ]
}
