{
  "hadithId": 252,
  "hadithNo": 43,
  "hadithReferences": {
    "sunnah.com": ["bulugh/2/43"],
    "kitabId": 2,
    "inKitabBab": 7,
    "arabicBook": "بلوغ المرام",
    "babId": 17
  },
  "name": {
    "arabic": "وَعَنْ وَائِلِ بْنِ حُجْرٍ ‏- رضى الله عنه ‏- قَالَ : { صَلَّيْتُ مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَكَانَ يُسَلِّمُ عَنْ يَمِينِهِ : \" اَلسَّلَام عَلَيْكُمْ وَرَحْمَةُ اَللَّهِ وَبَرَكَاتُهُ \" وَعَنْ شِمَالِهِ : \" اَلسَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اَللَّهِ وَبَرَكَاتُهُ } رَوَاهُ أَبُو دَاوُدَ بِسَنَدٍ صَحِيحٍ . ",
    "urdu": "سیدنا وائل بن حجر رضی اللہ عنہ روایت کرتے ہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی آپ صلی اللہ علیہ وسلم نے دائیں جانب سلام پھیرتے ہوئے کہا «السلام عليكم ورحمة الله وبركاته» اور اسی طرح بائیں طرف سلام پھیرتے ہوئے کہا «السلام عليكم ورحمة الله وبركاته»۔ ابوداؤد نے اسے صحیح سند سے روایت کیا ہے۔",
    "english": "Narrated Wa'il bin Hujr (RA): I prayed with the Prophet (PBUH) and he used to say Salam to his right: 'As-Salamu 'Alaikum wa Rahmatullahi wa Barakatuhu' and to his left: 'As-Salamu 'Alaikum wa Rahmatullahi wa Barakatuhu'. [Reported by Abu Dawud with a Sahih chain]."
  },
  "takhreej": {
    "arabic": "صحيح . رواه أبو داود (997). تنبيه: زيادة 'وبركاته' في التسليمة الثانية (عن الشمال) ضعيفة عند المحققين، والمحفوظ هو ثبوتها في التسليمة الأولى فقط.",
    "urdu": "یہ حدیث صحیح ہے، اسے ابو داؤد (997) نے روایت کیا ہے۔ واضح رہے کہ بائیں طرف سلام میں 'وبرکاتہ' کا اضافہ اکثر محققین کے نزدیک شاذ یا ضعیف ہے، جبکہ دائیں طرف یہ اضافہ ثابت ہے۔",
    "english": "Sahih. Reported by Abu Dawud (997). Note: The addition of 'wa Barakatuhu' in the second Salam (to the left) is considered weak by many researchers; it is authentically established mainly for the first Salam."
  },
  "importantWords": [
    {
      "arabic": "صَلَّيْتُ",
      "english": "I prayed",
      "urdu": "میں نے نماز پڑھی"
    },
    {
      "arabic": "يُسَلِّمُ",
      "english": "Turning for Salam",
      "urdu": "سلام پھیرتے تھے"
    },
    {
      "arabic": "يَمِينِهِ",
      "english": "His right side",
      "urdu": "ان کی دائیں جانب"
    },
    {
      "arabic": "شِمَالِهِ",
      "english": "His left side",
      "urdu": "ان کی بائیں جانب"
    },
    {
      "arabic": "وَبَرَكَاتُهُ",
      "english": "And His blessings",
      "urdu": "اور اس کی برکتیں"
    }
  ],
  "summary": {
    "urdu": "اس حدیث میں نماز کے خاتمے پر سلام پھیرنے کی کیفیت اور سلام کے مکمل الفاظ کا بیان ہے جن میں رحمت کے ساتھ برکت کا اضافہ بھی شامل ہے۔",
    "english": "This Hadith describes the manner of ending the prayer with Salam and mentions the complete wording, including the addition of 'blessings'."
  },
  "references": [
    {
      "arabic": "سنن أبي داود (997)",
      "english": "Sunan Abu Dawud (997)"
    },
    {
      "arabic": "صحيح ابن حبان (1993)",
      "english": "Sahih Ibn Hibban (1993)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "وائل بن حجر الحضرمي",
        "english": "Wa'il bin Hujr al-Hadrami"
      },
      "slug": "wail-bin-hujr"
    }
  ],
  "ytLink": "https://www.youtube.com/results?search_query=namaz+ka+salam+ka+tarika+urdu",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز سے خروج کا طریقہ",
        "english": "Method of Exiting Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سلام کی اہمیت",
              "english": "Importance of Salam"
            },
            "content": {
              "urdu": [
                "نماز کا اختتام سلام پھیرنے سے ہوتا ہے جو کہ نماز کا ایک رکن ہے۔",
                "یہ عمل اس بات کی علامت ہے کہ اب نمازی دنیاوی امور میں مشغول ہو سکتا ہے۔",
                "سنت کے مطابق سلام دائیں اور بائیں دونوں طرف پھیرنا چاہیے۔"
              ],
              "english": [
                "The prayer ends with the Salam, which is a fundamental pillar of Salah.",
                "This act signifies that the worshipper can now engage in worldly matters.",
                "According to the Sunnah, the Salam should be turned to both right and left."
              ]
            }
          },
          {
            "title": {
              "urdu": "گردن موڑنے کی کیفیت",
              "english": "Manner of Turning the Neck"
            },
            "content": {
              "urdu": [
                "سلام پھیرتے وقت اتنی گردن موڑنی چاہیے کہ پیچھے والوں کو گال نظر آئے۔",
                "پہلا سلام دائیں طرف اور دوسرا بائیں طرف پھیرنا مسنون طریقہ ہے۔",
                "گردن موڑنے کا یہ عمل انتہائی وقار اور سکون کے ساتھ ہونا چاہیے۔"
              ],
              "english": [
                "While turning for Salam, the neck should be turned enough to show the cheek to those behind.",
                "Turning the first Salam to the right and second to the left is the Sunnah method.",
                "This movement of the neck should be performed with great dignity and tranquility."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سلام کے الفاظ کی بحث",
        "english": "Discussion on Wording of Salam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "لفظ وبرکاتہ کا اضافہ",
              "english": "Addition of 'wa Barakatuhu'"
            },
            "content": {
              "urdu": [
                "عام طور پر 'ورحمۃ اللہ' تک سلام پھیرا جاتا ہے لیکن وبرکاتہ بھی ثابت ہے۔",
                "یہ اضافہ دائیں طرف کے سلام میں زیادہ مستند روایات سے ثابت ہے۔",
                "اس اضافے کو اختیار کرنا سنت پر عمل کی ایک خوبصورت صورت ہے۔"
              ],
              "english": [
                "Generally Salam is said up to 'wa Rahmatullahi', but 'wa Barakatuhu' is also proven.",
                "This addition is established through authentic narrations especially for the right side.",
                "Adopting this addition is a beautiful way of practicing the Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "بائیں طرف کا سلام",
              "english": "The Left Side Salam"
            },
            "content": {
              "urdu": [
                "بائیں طرف کے سلام میں 'وبرکاتہ' کے متعلق محدثین میں علمی اختلاف ہے۔",
                "احتیاط اس میں ہے کہ بائیں طرف 'ورحمۃ اللہ' پر ہی اکتفا کیا جائے۔",
                "تاہم دائیں طرف اس کا پڑھنا فضیلت اور اجر میں اضافے کا باعث ہے۔"
              ],
              "english": [
                "There is scholarly disagreement regarding 'wa Barakatuhu' for the left side Salam.",
                "Precaution lies in sufficing with 'wa Rahmatullahi' for the left side.",
                "However, reciting it for the right side leads to extra virtue and reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی و تعلیمی اسباق",
        "english": "Juristic and Educational Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماعت اور انفرادی نماز",
              "english": "Congregational and Individual Prayer"
            },
            "content": {
              "urdu": [
                "یہ حکم امام، مقتدی اور تنہا نماز پڑھنے والے سب کے لیے یکساں ہے۔",
                "مقتدی کو چاہیے کہ وہ امام کے سلام پھیرنے کے بعد سلام پھیرے۔",
                "نماز کی مکمل ہیئت کی پیروی کرنا ہی بندگی کا تقاضا ہے۔"
              ],
              "english": [
                "This ruling applies equally to the Imam, follower, and individual worshipper.",
                "The follower should turn their Salam after the Imam has completed theirs.",
                "Following the complete structure of Salah is a requirement of servitude."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعا اور سلامتی کا پیغام",
              "english": "Message of Peace and Supplication"
            },
            "content": {
              "urdu": [
                "نماز کا اختتام دوسروں کے لیے سلامتی اور رحمت کی دعا پر ہوتا ہے۔",
                "یہ عمل مسلمانوں کے درمیان باہمی محبت اور امن کا درس دیتا ہے۔",
                "ایک مومن اپنی عبادت کے بعد بھی دوسروں کی بھلائی کا سوچتا ہے۔"
              ],
              "english": [
                "Prayer ends with a supplication for peace and mercy for others.",
                "This act teaches mutual love and peace among Muslims.",
                "A believer thinks about the welfare of others even after their worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی پر اثر",
        "english": "Impact on Practical Life"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط کی تعلیم",
              "english": "Training in Discipline"
            },
            "content": {
              "urdu": [
                "سلام کے مخصوص الفاظ اور طریقہ ہمیں زندگی میں نظم و ضبط سکھاتے ہیں۔",
                "ہر کام کو سنت کے مطابق سلیقے سے ختم کرنا کامیابی کی کنجی ہے۔",
                "نماز کے آداب انسان کی پوری شخصیت میں نکھار پیدا کرتے ہیں۔"
              ],
              "english": [
                "The specific words and method of Salam teach us discipline in life.",
                "Ending every task properly according to the Sunnah is a key to success.",
                "The etiquettes of prayer refine a person's entire personality."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی اتباع کا جذبہ",
              "english": "Spirit of Following Sunnah"
            },
            "content": {
              "urdu": [
                "چھوٹی سے چھوٹی سنت پر عمل کرنا بھی اللہ کی محبت کا ذریعہ ہے۔",
                "روایات کی تحقیق اور ان پر عمل کرنا علمِ دین کی روح ہے۔",
                "صحابہ کرام کا یہ اندازِ مشاہدہ ہمارے لیے مشعلِ راہ ہے۔"
              ],
              "english": [
                "Practicing even the smallest Sunnah is a means to attain Allah's love.",
                "Researching narrations and acting upon them is the soul of religious knowledge.",
                "This observational style of the Companions serves as a guiding light for us."
              ]
            }
          }
        ]
      }
    }
  ]
}
