{
  "hadithId": 299,
  "hadithNo": 20,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/muslim:737"],
    "kitabId": 2,
    "inKitabBab": 9,
    "arabicBook": "صحيح مسلم",
    "babId": 19
  },
  "name": {
    "arabic": "وَعَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُصَلِّي مِنْ اَللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً, يُوتِرُ مِنْ ذَلِكَ بِخَمْسٍ, لَا يَجْلِسُ فِي شَيْءٍ إِلَّا فِي آخِرِهَا.‏ }",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ: ”رسول اللہ صلی اللہ علیہ وسلم رات کو تیرہ رکعتیں ادا فرماتے تھے۔ ان میں سے پانچ کے ذریعے وتر ادا کرتے تھے، اور ان (پانچوں) میں سے کسی رکعت میں نہیں بیٹھتے تھے سوائے آخری رکعت کے۔“",
    "english": "Narrated 'Aishah (RA): \"The Messenger of Allah (ﷺ) used to pray thirteen Rak'ahs during the night, performing Witr with five of them, and he would not sit (for Tashahhud) except in the last of them.\""
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (737)‏ وعزوه للبخاري وهم.‏",
    "urdu": "صحیح۔ اسے مسلم (737) نے روایت کیا ہے۔ اور اسے بخاری کی طرف منسوب کرنا وہم (غلطی) ہے۔",
    "english": "Sahih (Authentic). Reported by Muslim (737). Attributing it to Al-Bukhari is an error."
  },
  "importantWords": [
    {
      "arabic": "ثَلَاثَ عَشْرَةَ",
      "english": "Thirteen",
      "urdu": "تیرہ"
    },
    {
      "arabic": "يُوتِرُ",
      "english": "He performs Witr",
      "urdu": "وتر ادا کرتے"
    },
    {
      "arabic": "بِخَمْسٍ",
      "english": "With five",
      "urdu": "پانچ کے ساتھ"
    },
    {
      "arabic": "لَا يَجْلِسُ",
      "english": "He does not sit",
      "urdu": "وہ نہیں بیٹھتے تھے"
    },
    {
      "arabic": "آخِرِهَا",
      "english": "The last of them",
      "urdu": "ان کے آخر میں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث پانچ رکعت وتر پڑھنے کا مسنون طریقہ بتاتی ہے کہ پانچوں رکعتیں مسلسل پڑھی جائیں اور درمیان میں کہیں تشہد نہ بیٹھا جائے، صرف پانچویں رکعت میں بیٹھ کر سلام پھیرا جائے۔",
    "english": "This Hadith explains the Sunnah method of praying five Rak'ahs of Witr: they should be offered continuously without sitting for Tashahhud in between, sitting only in the final (fifth) Rak'ah before Taslim."
  },
  "references": [
    {
      "arabic": "رواه مسلم (737)",
      "english": "Reported by Muslim (737)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشہ بنت ابی بکر",
        "english": "Aishah bint Abu Bakr"
      },
      "slug": "aisha-bint-abu-bakr"
    }
  ],
  "ytLink": "https://youtu.be/k2Mxo0Nlo9A?si=l4nQ8vJ4X5bF8Gg_",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تیرہ رکعت کی وضاحت",
              "english": "Explanation of 13 Rak'ahs"
            },
            "content": {
              "urdu": [
                "اس گنتی میں عشاء کی دو سنتیں یا فجر کی دو سنتیں شامل ہو سکتی ہیں۔",
                "یا یہ اس رات کا ذکر ہے جب آپ ﷺ نے طویل قیام کیا۔",
                "نبی ﷺ کے معمولات میں وسعت اور تنوع تھا۔"
              ],
              "english": [
                "This count might include the 2 Sunnahs of Isha or Fajr.",
                "Or it refers to a night when He (ﷺ) prolonged the prayer.",
                "There was flexibility and variety in the Prophet's routine."
              ]
            }
          },
          {
            "title": {
              "urdu": "پانچ وتر کا طریقہ",
              "english": "Method of 5 Witr"
            },
            "content": {
              "urdu": [
                "اگر کوئی پانچ وتر پڑھنا چاہے تو یہ طریقہ اختیار کرے۔",
                "پہلی چار رکعتوں میں قعدہ (بیٹھنا) نہیں کرنا۔",
                "صرف پانچویں رکعت میں تشہد پڑھ کر سلام پھیرنا ہے۔"
              ],
              "english": [
                "If one wishes to pray 5 Witr, this method should be adopted.",
                "Do not sit (Qa'dah) in the first four Rak'ahs.",
                "Perform Tashahhud and Taslim only in the fifth Rak'ah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وتر کی مختلف صورتیں",
              "english": "Different Forms of Witr"
            },
            "content": {
              "urdu": [
                "شریعت نے وتر کی ادائیگی میں کئی صورتیں جائز رکھی ہیں۔",
                "3، 5، اور 7 رکعتیں پڑھنے کے الگ الگ طریقے ہیں۔",
                "5 رکعت میں مسلسل قیام کرنا (بغیر تشہد کے) افضل ہے۔"
              ],
              "english": [
                "Shariah allows various forms for performing Witr.",
                "There are distinct methods for 3, 5, and 7 Rak'ahs.",
                "In 5 Rak'ahs, continuous standing (without Tashahhud) is preferred."
              ]
            }
          },
          {
            "title": {
              "urdu": "نفل میں توسع",
              "english": "Flexibility in Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "نوافل میں وہ پابندیاں نہیں جو فرائض میں ہیں۔",
                "مسلسل پانچ رکعت پڑھنا فرض میں نہیں، مگر نفل میں جائز ہے۔",
                "یہ تنوع عبادت میں رغبت بڑھاتا ہے۔"
              ],
              "english": [
                "Voluntary prayers do not have the strictness of Fard.",
                "Praying 5 continuous Rak'ahs is not in Fard, but valid in Nafl.",
                "This variety increases desire in worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کو زندہ کرنا",
              "english": "Reviving the Sunnah"
            },
            "content": {
              "urdu": [
                "ہم عموماً تین وتر ہی پڑھتے ہیں، کبھی پانچ بھی پڑھنے چاہئیں۔",
                "مختلف سنتوں پر عمل کرنے سے ثواب اور محبت بڑھتی ہے۔",
                "یہ طریقہ تہجد گزاروں کے لیے خاص طور پر موزوں ہے۔"
              ],
              "english": [
                "We usually pray only 3 Witr; we should sometimes pray 5.",
                "Acting on different Sunnahs increases reward and love.",
                "This method is especially suitable for those praying Tahajjud."
              ]
            }
          },
          {
            "title": {
              "urdu": "عبادت میں یکسوئی",
              "english": "Concentration in Worship"
            },
            "content": {
              "urdu": [
                "مسلسل پانچ رکعت پڑھنے سے توجہ قائم رہتی ہے۔",
                "بار بار بیٹھنے اور اٹھنے سے جو انقطاع ہوتا ہے، وہ اس میں نہیں ہے۔",
                "لمبی قرآت کا شوقین اس طریقے سے لطف اٹھا سکتا ہے۔"
              ],
              "english": [
                "Praying 5 continuous Rak'ahs maintains concentration.",
                "It avoids the interruption caused by repeated sitting and standing.",
                "One fond of long recitation can enjoy this method."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تخریج کی اہمیت",
              "english": "Importance of Takhreej"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر نے نشاندہی کی کہ اسے بخاری کی طرف منسوب کرنا غلطی ہے۔",
                "محقق کو حوالے دیتے وقت احتیاط کرنی چاہیے۔",
                "یہ علم حدیث کی باریکیوں میں سے ہے۔"
              ],
              "english": [
                "Al-Hafiz noted that attributing this to Bukhari is an error.",
                "A researcher must be careful when citing references.",
                "This is among the intricacies of the science of Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "امہات المؤمنین کی خدمات",
              "english": "Services of Mothers of Believers"
            },
            "content": {
              "urdu": [
                "یہ باریک مسائل ہمیں گھر کے اندر سے معلوم ہوئے۔",
                "سیدہ عائشہ رضی اللہ عنہا نے امت پر بڑا احسان کیا۔",
                "خواتین کو بھی دین کا گہرا علم حاصل کرنا چاہیے۔"
              ],
              "english": [
                "We learned these detailed rulings from within the house.",
                "Aishah (RA) did a great favor to the Ummah.",
                "Women should also acquire deep religious knowledge."
              ]
            }
          }
        ]
      }
    }
  ]
}
