{
  "hadithId": 280,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["urn:1270"],
    "kitabId": 2,
    "inKitabBab": 9,
    "arabicBook": "Bulugh al-Maram",
    "babId": 19
  },
  "name": {
    "arabic": "عَنْ رَبِيعَةَ بْنِ كَعْبٍ الْأَسْلَمِيِّ ‏-رِضَى اَللَّهُ عَنْهُ‏- قَالَ : { قَالَ لِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-سَلْ .‏ فَقُلْتُ : أَسْأَلُكَ مُرَافَقَتَكَ فِي اَلْجَنَّةِ .‏ فَقَالَ : أَوَغَيْرَ ذَلِكَ ? , قُلْتُ : هُوَ ذَاكَ , قَالَ : ' فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ اَلسُّجُودِ } رَوَاهُ مُسْلِمٌ .‏",
    "urdu": "سیدنا ربیعہ بن کعب اسلمی رضی اللہ عنہ روایت کرتے ہیں کہ ایک روز نبی کریم صلی اللہ علیہ وسلم نے مجھے (مخاطب کر کے) فرمایا: 'مانگ لے (جو کچھ مانگنا ہے)۔' میں نے عرض کیا: 'میں جنت میں آپ صلی اللہ علیہ وسلم کی رفاقت کا طلبگار ہوں۔' آپ صلی اللہ علیہ وسلم نے فرمایا: 'کچھ اس کے علاوہ مزید بھی؟' میں نے عرض کیا: 'بس وہ ہی مطلوب ہے۔' آپ صلی اللہ علیہ وسلم نے فرمایا: 'تو پھر اپنے مطلب کے حصول کے لئے کثرتِ سجود سے میری مدد کر۔' (مسلم)",
    "english": "Narrated by Rabi'ah bin Ka'b Al-Aslami (may Allah be pleased with him): The Prophet (ﷺ) said to me: 'Ask.' I said: 'I ask for your companionship in Paradise.' He said: 'Is there anything else?' I said: 'That is all.' He said: 'Then help me to achieve this for you by devoting yourself to frequent prostration.'"
  },
  "takhreej": {
    "arabic": "صحيح. رواه مسلم (489).",
    "urdu": "صحیح۔ اسے مسلم (489) نے روایت کیا ہے۔",
    "english": "Sahih. Reported by Muslim (489)."
  },
  "importantWords": [
    {
      "arabic": "سل",
      "english": "Ask",
      "urdu": "مانگو / سوال کرو"
    },
    {
      "arabic": "مرافقتك",
      "english": "Your company",
      "urdu": "آپ کا ساتھ / رفاقت"
    },
    {
      "arabic": "الجنة",
      "english": "Paradise",
      "urdu": "جنت"
    },
    {
      "arabic": "أعني",
      "english": "Help me",
      "urdu": "میری مدد کرو"
    },
    {
      "arabic": "كثرة السجود",
      "english": "Frequent prostration",
      "urdu": "سجدوں کی کثرت"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بتاتی ہے کہ جنت میں نبی ﷺ کا قرب حاصل کرنے کا بہترین ذریعہ کثرت سے نفل نمازیں اور سجدے کرنا ہے۔ یہ حدیث بلند ہمتی اور عمل کی ترغیب ہے۔",
    "english": "This Hadith indicates that the best way to attain the Prophet's (ﷺ) companionship in Paradise is through frequent voluntary prayers and prostrations. It encourages high aspirations and action."
  },
  "references": [
    {
      "arabic": "رواه مسلم (489)",
      "english": "Reported by Muslim (489)"
    },
    {
      "arabic": "رواه النسائي (1138)",
      "english": "Reported by An-Nasa'i (1138)"
    },
    {
      "arabic": "رواه أبو داود (1320)",
      "english": "Reported by Abu Dawud (1320)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "ربيعة بن كعب الأسلمي",
        "english": "Rabi'ah bin Ka'b Al-Aslami"
      },
      "slug": "rabiah-bin-kab-al-aslami"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=EXAMPLE_ID_RABIAH",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا پس منظر",
        "english": "Context of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خادمِ رسول ﷺ",
              "english": "Servant of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "سیدنا ربیعہؓ نبی ﷺ کے لیے وضو کا پانی لاتے اور خدمت کرتے تھے۔",
                "نبی ﷺ نے ان کی خدمت سے خوش ہو کر فرمایا 'مانگو'۔",
                "یہ نبی کریم ﷺ کی سخاوت اور اپنے خدام پر شفقت کا ثبوت ہے۔"
              ],
              "english": [
                "Rabi'ah (RA) used to bring wudu water and serve the Prophet (ﷺ).",
                "Pleased with his service, the Prophet (ﷺ) said, 'Ask'.",
                "This proves the generosity of the Prophet (ﷺ) and his kindness towards his servants."
              ]
            }
          },
          {
            "title": {
              "urdu": "بلند ہمتی",
              "english": "High Aspirations"
            },
            "content": {
              "urdu": [
                "صحابی نے دنیا کا مال نہیں مانگا بلکہ آخرت کی سب سے بڑی نعمت مانگی۔",
                "جنت میں رسول اللہ ﷺ کا ساتھ ملنا سب سے بڑا درجہ ہے۔",
                "یہ ہمیں سکھاتا ہے کہ ہماری خواہشات اور دعائیں بلند ہونی چاہئیں۔"
              ],
              "english": [
                "The Companion did not ask for worldly wealth but the greatest blessing of the Hereafter.",
                "Companionship of the Prophet (ﷺ) in Paradise is the highest rank.",
                "This teaches us that our desires and prayers should be lofty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عمل کی اہمیت",
        "english": "Importance of Action"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دعا کے ساتھ کوشش",
              "english": "Effort with Dua"
            },
            "content": {
              "urdu": [
                "نبی ﷺ نے صرف دعا پر اکتفا نہیں کیا بلکہ عمل کرنے کا حکم دیا۔",
                "فرمایا: 'میری مدد کرو'، یعنی تم کوشش کرو گے تو میری شفاعت کام آئے گی۔",
                "بغیر عمل کے صرف تمنا کرنا دانشمندی نہیں ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not rely solely on Dua but commanded action.",
                "He said, 'Help me', meaning if you strive, my intercession will be effective.",
                "It is not wise to merely wish without taking action."
              ]
            }
          },
          {
            "title": {
              "urdu": "کثرتِ سجود",
              "english": "Abundance of Prostration"
            },
            "content": {
              "urdu": [
                "یہاں کثرتِ سجود سے مراد نوافل کی کثرت ہے۔",
                "سجدہ وہ حالت ہے جس میں بندہ اللہ کے سب سے زیادہ قریب ہوتا ہے۔",
                "جتنا زیادہ انسان اللہ کے سامنے جھکتا ہے، اتنا ہی اس کا درجہ بلند ہوتا ہے۔"
              ],
              "english": [
                "Here, abundance of prostration refers to frequent voluntary prayers (Nawafil).",
                "Prostration is the state where a servant is closest to Allah.",
                "The more a person bows to Allah, the higher their rank becomes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی پہلو",
        "english": "Educational Aspect"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "استاد اور شاگرد",
              "english": "Teacher and Student"
            },
            "content": {
              "urdu": [
                "استاد کو چاہیے کہ شاگرد کی اچھی کارکردگی پر اس کی حوصلہ افزائی کرے۔",
                "شاگرد کو چاہیے کہ استاد سے علم اور آخرت کی بھلائی طلب کرے۔",
                "نبی ﷺ نے ایک عظیم اصول سکھایا کہ کامیابی قربانی مانگتی ہے۔"
              ],
              "english": [
                "A teacher should encourage the student for good performance.",
                "A student should seek knowledge and Hereafter's welfare from the teacher.",
                "The Prophet (ﷺ) taught a great principle that success requires sacrifice."
              ]
            }
          },
          {
            "title": {
              "urdu": "شفاعت کا مفہوم",
              "english": "Concept of Intercession"
            },
            "content": {
              "urdu": [
                "شفاعت برحق ہے لیکن یہ عمل کرنے والوں کے لیے ہے۔",
                "غفلت کی زندگی گزار کر شفاعت کی امید رکھنا دھوکہ ہے۔",
                "سچا عاشق وہ ہے جو محبوب کے حکم (نماز) کی پابندی کرے۔"
              ],
              "english": [
                "Intercession is true, but it is for those who act.",
                "It is a delusion to hope for intercession while living a life of negligence.",
                "A true lover is one who obeys the command (prayer) of the Beloved."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نوافل کا اہتمام",
              "english": "Observing Voluntary Prayers"
            },
            "content": {
              "urdu": [
                "فرائض کے ساتھ ساتھ سنن اور نوافل (تہجد، اشراق) کا اہتمام کریں۔",
                "نفل نماز اللہ کی محبت کا ذریعہ ہے۔",
                "یہ آخرت میں فرائض کی کمی کو بھی پورا کرتی ہے۔"
              ],
              "english": [
                "Along with obligatory prayers, observe Sunnah and Nawafil (Tahajjud, Ishraq).",
                "Voluntary prayer is a means of attaining Allah's love.",
                "It also compensates for deficiencies in obligatory prayers in the Hereafter."
              ]
            }
          },
          {
            "title": {
              "urdu": "مقصد کا تعین",
              "english": "Setting the Goal"
            },
            "content": {
              "urdu": [
                "اپنی زندگی کا سب سے بڑا مقصد جنت اور دیدارِ الٰہی کو بنائیں۔",
                "دنیاوی نعمتیں مانگنا منع نہیں، مگر ترجیح آخرت ہونی چاہیے۔",
                "اللہ سے مانگتے وقت بہترین چیز کا سوال کریں۔"
              ],
              "english": [
                "Make Paradise and the Vision of Allah the ultimate goal of life.",
                "Asking for worldly blessings is not forbidden, but priority should be the Hereafter.",
                "When asking Allah, ask for the best."
              ]
            }
          }
        ]
      }
    }
  ]
}
