{
  "hadithId": 298,
  "hadithNo": 19,
  "hadithReferences": {
    "sunnah.com": [
      "https://sunnah.com/bukhari:1147",
      "https://sunnah.com/muslim:738"
    ],
    "kitabId": 2,
    "inKitabBab": 9,
    "arabicBook": "صحيح البخاری / صحيح مسلم",
    "babId": 19
  },
  "name": {
    "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { ]مَا] كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَزِيدُ فِي رَمَضَانَ وَلَا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً, يُصَلِّي أَرْبَعًا, فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ, ثُمَّ يُصَلِّي أَرْبَعًا, فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ, ثُمَّ يُصَلِّي ثَلَاثًا.‏ قَالَتْ عَائِشَةُ, فَقُلْتُ: يَا رَسُولَ اَللَّهِ, أَتَنَامُ قَبْلَ أَنْ تُوتِرَ? قَالَ: \"يَا عَائِشَةُ, إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي\".‏ } مُتَّفَقٌ عَلَيْهِ .‏ وَفِي رِوَايَةٍ لَهُمَا عَنْهَا: { كَانَ يُصَلِّي مِنْ اَللَّيْلِ عَشْرَ رَكَعَاتٍ, وَيُوتِرُ بِسَجْدَةٍ, وَيَرْكَعُ رَكْعَتَيْ اَلْفَجْرِ, فَتِلْكَ ثَلَاثُ عَشْرَةَ }",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم رمضان اور غیر رمضان میں گیارہ رکعات سے زائد نہیں پڑھتے تھے۔ آپ چار رکعتیں پڑھتے، پس ان کے حسن اور طوالت کے بارے میں مت پوچھو! پھر چار رکعتیں پڑھتے، ان کے حسن اور طوالت کے بارے میں مت پوچھو! پھر تین رکعتیں (وتر) پڑھتے۔ سیدہ عائشہ رضی اللہ عنہا نے فرمایا: میں نے عرض کیا: ”یا رسول اللہ! کیا آپ وتر ادا کئے بغیر سو جاتے ہیں؟“ فرمایا: ”اے عائشہ! میری آنکھیں سوتی ہیں لیکن میرا دل نہیں سوتا۔“ (متفق علیہ)۔ اور ایک دوسری روایت میں ہے کہ آپ رات کو دس رکعتیں پڑھتے، ایک رکعت وتر پڑھتے اور دو رکعت فجر کی سنتیں پڑھتے، یہ کل تیرہ رکعتیں ہوتیں۔",
    "english": "Narrated 'Aishah (RA): \"The Messenger of Allah (ﷺ) would not increase beyond eleven Rak'ahs in Ramadan or otherwise. He would pray four, do not ask about their beauty and length; then he would pray four, do not ask about their beauty and length; then he would pray three. I asked, 'O Messenger of Allah, do you sleep before observing Witr?' He said: 'O 'Aishah, my eyes sleep but my heart does not sleep.'\" (Agreed Upon). In another narration: \"He used to pray ten Rak'ahs at night, pray Witr with one Rak'ah, and pray the two Rak'ahs of Fajr, making a total of thirteen.\""
  },
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري (1147) ومسلم (738).",
    "urdu": "صحیح، متفق علیہ۔ اسے بخاری (1147) اور مسلم (738) نے روایت کیا ہے۔",
    "english": "Sahih (Agreed Upon). Reported by Al-Bukhari (1147) and Muslim (738)."
  },
  "importantWords": [
    {
      "arabic": "مَا كَانَ يَزِيدُ",
      "english": "He did not increase",
      "urdu": "وہ اضافہ نہیں کرتے تھے"
    },
    {
      "arabic": "إِحْدَى عَشْرَةَ",
      "english": "Eleven",
      "urdu": "گیارہ"
    },
    {
      "arabic": "حُسْنِهِنَّ",
      "english": "Their beauty",
      "urdu": "ان کا حسن / خوبصورتی"
    },
    {
      "arabic": "طُولِهِنَّ",
      "english": "Their length",
      "urdu": "ان کی لمبائی"
    },
    {
      "arabic": "لَا يَنَامُ قَلْبِي",
      "english": "My heart does not sleep",
      "urdu": "میرا دل نہیں سوتا"
    },
    {
      "arabic": "تَنَامَانِ",
      "english": "They (two eyes) sleep",
      "urdu": "وہ دونوں سوتی ہیں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی ﷺ کی نمازِ تہجد (قیام اللیل/تراویح) کی کیفیت اور مقدار بیان کرتی ہے کہ آپ ﷺ عموماً 11 رکعتیں انتہائی خشوع اور طوالت کے ساتھ پڑھتے تھے، اور آپ ﷺ کا دل نیند میں بھی بیدار رہتا تھا۔",
    "english": "This Hadith describes the quality and quantity of the Prophet's (ﷺ) Night Prayer (Tahajjud/Taraweeh), stating he generally prayed 11 Rak'ahs with great devotion and length, and that his heart remained awake even during sleep."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1147)",
      "english": "Reported by Al-Bukhari (1147)"
    },
    {
      "arabic": "رواه مسلم (738)",
      "english": "Reported by Muslim (738)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشہ بنت ابی بکر",
        "english": "Aishah bint Abu Bakr"
      },
      "slug": "aisha-bint-abu-bakr"
    }
  ],
  "ytLink": "https://youtu.be/J6yR0gqF37E?si=Hq6T6yR0Xz5Z_g_n",
  "grade": {
    "arabic": "متفق عليه",
    "english": "Muttafaq Alaih (Agreed Upon)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "قیام اللیل کی مقدار",
        "english": "Quantity of Night Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گیارہ رکعات",
              "english": "Eleven Rak'ahs"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا اکثر معمول 11 رکعات (8 تہجد + 3 وتر) کا تھا۔",
                "رمضان اور غیر رمضان میں یہ تعداد یکساں رہتی تھی۔",
                "اس سے تراویح اور تہجد کے ایک ہونے کا استدلال کیا جاتا ہے۔"
              ],
              "english": [
                "The Prophet's most frequent habit was 11 Rak'ahs (8 Tahajjud + 3 Witr).",
                "This number remained consistent in and out of Ramadan.",
                "This is used as evidence that Taraweeh and Tahajjud are the same prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "تیرہ رکعات",
              "english": "Thirteen Rak'ahs"
            },
            "content": {
              "urdu": [
                "دوسری روایت میں 13 رکعات کا ذکر ہے۔",
                "اس میں فجر کی دو سنتیں یا عشاء کے بعد کی دو سنتیں شامل ہو سکتی ہیں۔",
                "اس سے معلوم ہوتا ہے کہ گنتی کے طریقے میں اختلاف ہو سکتا ہے۔"
              ],
              "english": [
                "Another narration mentions 13 Rak'ahs.",
                "This may include the 2 Sunnahs of Fajr or 2 after Isha.",
                "It shows there can be a difference in the method of counting."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کی کیفیت",
        "english": "Quality of Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "حسن اور طوالت",
              "english": "Beauty and Length"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ نے 'مت پوچھو' کہہ کر اس کی خوبصورتی بیان کی۔",
                "مقصد یہ ہے کہ وہ نماز اتنی عالی شان تھی کہ الفاظ میں بیان نہیں ہو سکتی۔",
                "ہمیں تعداد سے زیادہ معیار (Quality) پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "Aishah (RA) described its beauty by saying 'do not ask'.",
                "The meaning is that the prayer was too magnificent to be described in words.",
                "We should focus more on quality than quantity."
              ]
            }
          },
          {
            "title": {
              "urdu": "چار چار کا طریقہ",
              "english": "Method of Fours"
            },
            "content": {
              "urdu": [
                "حدیث کے ظاہر سے 4 رکعت ایک سلام سے معلوم ہوتی ہیں۔",
                "تاہم دیگر احادیث کی روشنی میں محدثین اسے 2+2 پر محمول کرتے ہیں۔",
                "یعنی چار رکعت کے بعد آپ ﷺ تھوڑا آرام فرماتے تھے۔"
              ],
              "english": [
                "Apparently, it suggests 4 Rak'ahs with one Taslim.",
                "However, scholars interpret it as 2+2 based on other Hadiths.",
                "Meaning, he (ﷺ) rested briefly after every four Rak'ahs."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "خصائصِ نبوی",
        "english": "Prophetic Characteristics"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دل کا جاگنا",
              "english": "Wakefulness of Heart"
            },
            "content": {
              "urdu": [
                "انبیاء کی آنکھیں سوتی ہیں لیکن دل بیدار رہتا ہے۔",
                "اس لیے نیند سے ان کا وضو نہیں ٹوٹتا۔",
                "یہ صرف انبیاء کرام کا خاصہ ہے، عام امتی کا نہیں۔"
              ],
              "english": [
                "Prophets' eyes sleep, but their hearts remain awake.",
                "Therefore, their Wudu is not invalidated by sleep.",
                "This is a specific characteristic of Prophets, not ordinary followers."
              ]
            }
          },
          {
            "title": {
              "urdu": "وحی کا ادراک",
              "english": "Perception of Revelation"
            },
            "content": {
              "urdu": [
                "دل کے بیدار رہنے کی وجہ یہ ہے کہ کسی بھی وقت وحی آ سکتی ہے۔",
                "نیند کی حالت میں بھی نبی ﷺ کا تعلق باللہ قائم رہتا تھا۔",
                "ان کے خواب بھی وحی کا حصہ ہوتے ہیں۔"
              ],
              "english": [
                "The heart remains awake because revelation can come at any time.",
                "Even in sleep, the Prophet's connection with Allah remained intact.",
                "Their dreams are also part of revelation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ادب اور سوال",
              "english": "Etiquette and Questioning"
            },
            "content": {
              "urdu": [
                "سیدہ عائشہ نے ادب کے ساتھ سوال پوچھا۔",
                "دین کی سمجھ بوجھ کے لیے سوال کرنا ضروری ہے۔",
                "اس سوال کی وجہ سے امت کو ایک اہم مسئلہ معلوم ہوا۔"
              ],
              "english": [
                "Aishah (RA) asked the question with respect.",
                "Asking questions is necessary for understanding religion.",
                "Due to this question, the Ummah learned an important ruling."
              ]
            }
          },
          {
            "title": {
              "urdu": "رمضان کی عبادت",
              "english": "Worship in Ramadan"
            },
            "content": {
              "urdu": [
                "رمضان میں نماز کی کیفیت اور بھی بہتر ہو جاتی تھی۔",
                "نبی ﷺ کا معمول سکھاتا ہے کہ عبادات میں ہمیشگی اختیار کریں۔",
                "تعداد میں زیادتی کے بجائے خشوع میں زیادتی مطلوب ہے۔"
              ],
              "english": [
                "The quality of prayer improved even more in Ramadan.",
                "The Prophet's routine teaches consistency in worship.",
                "Increase in devotion (Khushoo) is required rather than increase in number."
              ]
            }
          }
        ]
      }
    }
  ]
}
