{
  "hadithId": 289,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": ["https://sunnah.com/bukhari:1160"],
    "kitabId": 2,
    "inKitabBab": 9,
    "arabicBook": "صحیح البخاری",
    "babId": 19
  },
  "name": {
    "arabic": "وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { كَانَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-إِذَا صَلَّى رَكْعَتَيْ اَلْفَجْرِ اِضْطَجَعَ عَلَى شِقِّهِ اَلْأَيْمَنِ } رَوَاهُ اَلْبُخَارِيُّ .",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ جب نبی کریم صلی اللہ علیہ وسلم نماز فجر کی دو رکعت سنت پڑھ کر فارغ ہوتے تو اپنے دائیں پہلو کے بل لیٹ جاتے۔ (بخاری)",
    "english": "Narrated 'Aishah (RA): \"When the Prophet (ﷺ) had prayed the two Rak'ahs of Fajr, he would lie down on his right side.\""
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه البخاري ( 1160 )‏ .",
    "urdu": "صحیح۔ اسے بخاری (1160) نے روایت کیا ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (1160)."
  },
  "importantWords": [
    {
      "arabic": "اِضْطَجَعَ",
      "english": "He lay down",
      "urdu": "وہ لیٹ گئے"
    },
    {
      "arabic": "شِقِّهِ",
      "english": "His side",
      "urdu": "ان کا پہلو"
    },
    {
      "arabic": "اَلْأَيْمَنِ",
      "english": "Right",
      "urdu": "دایاں"
    },
    {
      "arabic": "إِذَا صَلَّى",
      "english": "When he prayed",
      "urdu": "جب انہوں نے نماز پڑھی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث فجر کی سنتوں اور فرض نماز کے درمیان دائیں کروٹ پر تھوڑی دیر لیٹنے کی سنت کو بیان کرتی ہے، جو نبی ﷺ کا معمول تھا۔",
    "english": "This Hadith describes the Sunnah of lying down on the right side for a short while between the Sunnahs of Fajr and the Obligatory prayer, which was the Prophet's (ﷺ) routine."
  },
  "references": [
    {
      "arabic": "رواه البخاري (1160)",
      "english": "Reported by Al-Bukhari (1160)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عائشہ بنت ابی بکر",
        "english": "Aishah bint Abu Bakr"
      },
      "slug": "aisha-bint-abu-bakr"
    }
  ],
  "ytLink": "https://youtu.be/kC6y8OaL1wM?si=GzRGFkL8pC24SjZ_",
  "grade": {
    "arabic": "صحيح",
    "english": "Sahih (Authentic)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "حدیث کا مفہوم",
        "english": "Meaning of the Hadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "دائیں کروٹ لیٹنا",
              "english": "Lying on Right Side"
            },
            "content": {
              "urdu": [
                "نبی ﷺ سنتیں پڑھنے کے بعد اور فرض کے لیے جانے سے پہلے لیٹتے تھے۔",
                "یہ عمل گھر میں کیا جاتا تھا تاکہ سستی دور ہو جائے۔",
                "دائیں کروٹ پر لیٹنا سنت ہے اور صحت کے لیے مفید ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used to lie down after Sunnahs and before going for Fard.",
                "This act was done at home to remove lethargy.",
                "Lying on the right side is Sunnah and beneficial for health."
              ]
            }
          },
          {
            "title": {
              "urdu": "فصل (فاصلہ) پیدا کرنا",
              "english": "Creating Separation"
            },
            "content": {
              "urdu": [
                "اس عمل کا مقصد نفل اور فرض نماز میں فرق کرنا تھا۔",
                "مسلسل نماز پڑھنے کے بجائے درمیان میں وقفہ کیا جاتا تھا۔",
                "یہ وقفہ جسمانی اور روحانی دونوں اعتبار سے اہم ہے۔"
              ],
              "english": [
                "The purpose was to differentiate between Voluntary and Obligatory prayers.",
                "Instead of continuous prayer, a break was introduced.",
                "This break is important both physically and spiritually."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی حکمت",
        "english": "Juristic Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت یا مستحب",
              "english": "Sunnah or Mustahabb"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک یہ لیٹنا استراحت (آرام) کے لیے تھا، عبادت نہیں۔",
                "بعض (جیسے ابن حزم) اسے واجب کہتے ہیں، مگر راجح قول مستحب کا ہے۔",
                "اگر مسجد میں ہوں تو لیٹنا ضروری نہیں، بات چیت سے بھی فصل ہو جاتا ہے۔"
              ],
              "english": [
                "Majority scholars view this lying down as rest, not binding worship.",
                "Some (like Ibn Hazm) consider it Wajib, but the preferred view is Mustahabb.",
                "If in the mosque, lying down is not necessary; talking also creates separation."
              ]
            }
          },
          {
            "title": {
              "urdu": "تہجد کی تھکاوٹ",
              "english": "Fatigue of Tahajjud"
            },
            "content": {
              "urdu": [
                "نبی ﷺ رات بھر قیام کرتے تھے، اس لیے فجر سے پہلے آرام فرماتے تھے۔",
                "جس نے رات کو قیام نہ کیا ہو، اس کے لیے یہ تاکید کم ہے۔",
                "تاہم اتباع سنت کی نیت سے کرنا ثواب کا باعث ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) prayed Qiyam all night, so he rested before Fajr.",
                "For one who did not pray Qiyam, this emphasis is less.",
                "However, doing it with the intention of following Sunnah brings reward."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق",
        "english": "Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز کے لیے تازگی",
              "english": "Freshness for Prayer"
            },
            "content": {
              "urdu": [
                "تھوڑا سا آرام انسان کو فرض نماز کے لیے تازہ دم کر دیتا ہے۔",
                "خشوع و خضوع کے لیے ذہنی سکون ضروری ہے۔",
                "اسلام جسمانی ضروریات کا خیال رکھتا ہے۔"
              ],
              "english": [
                "A little rest refreshes a person for the Obligatory prayer.",
                "Mental peace is necessary for devotion (Khushoo).",
                "Islam takes care of physical needs."
              ]
            }
          },
          {
            "title": {
              "urdu": "گھر میں سنتیں",
              "english": "Sunnahs at Home"
            },
            "content": {
              "urdu": [
                "یہ حدیث ثابت کرتی ہے کہ فجر کی سنتیں گھر میں پڑھنا افضل ہے۔",
                "لیٹنے کا عمل گھر کی چاردیواری میں ہی مناسب لگتا ہے۔",
                "مساجد میں صفوں کے درمیان لیٹنا لوگوں کے لیے تکلیف دہ ہو سکتا ہے۔"
              ],
              "english": [
                "This Hadith proves it is preferred to pray Fajr Sunnahs at home.",
                "The act of lying down is appropriate within the privacy of the home.",
                "Lying down between rows in mosques can be inconvenient for others."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی سبق",
        "english": "Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ازواج مطہرات کا علم",
              "english": "Knowledge of Wives"
            },
            "content": {
              "urdu": [
                "گھر کے اندرونی اعمال صرف امہات المؤمنین کے ذریعے ہم تک پہنچے۔",
                "عائشہ رضی اللہ عنہا نے نبی ﷺ کی نجی زندگی کو محفوظ کیا۔",
                "دین کا ایک بڑا حصہ ان کے ذریعے منتقل ہوا۔"
              ],
              "english": [
                "Domestic actions reached us only through the Mothers of Believers.",
                "Aisha (RA) preserved the private life of the Prophet (ﷺ).",
                "A large part of the religion was transmitted through them."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائیں جانب کی فضیلت",
              "english": "Virtue of Right Side"
            },
            "content": {
              "urdu": [
                "نبی ﷺ ہر کام میں دائیں جانب کو ترجیح دیتے تھے۔",
                "سونے یا لیٹنے کے لیے دائیں کروٹ سنت ہے۔",
                "یہ عمل دل کو سکون اور جسم کو راحت دیتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) preferred the right side in every action.",
                "Lying on the right side is Sunnah for sleeping or resting.",
                "This action brings peace to the heart and comfort to the body."
              ]
            }
          }
        ]
      }
    }
  ]
}
