{
  "hadithId": 1009,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 9,
    "inKitabBab": 2,
    "arabicBook": "",
    "babId": 80
  },
  "name": {
    "arabic": "عَنْ أَبِي بَكْرٍ بْنِ مُحَمَّدٍ بْنِ عَمْرِوِ بْنِ حَزْمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَتَبَ إِلَى أَهْلِ اَلْيَمَنِ.‏.‏.‏ فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ: { أَنَّ مَنْ اِعْتَبَطَ مُؤْمِنًا قَتْلاً عَنْ بَيِّنَةٍ, فَإِنَّهُ قَوَدٌ, إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ اَلْمَقْتُولِ, وَإِنَّ فِي اَلنَّفْسِ اَلدِّيَةَ مِائَةً مِنْ اَلْإِبِلِ, وَفِي اَلْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ اَلدِّيَةُ, وَفِي اَللِّسَانِ اَلدِّيَةُ, وَفِي اَلشَّفَتَيْنِ اَلدِّيَةُ, وَفِي اَلذِّكْرِ اَلدِّيَةُ, وَفِي اَلْبَيْضَتَيْنِ اَلدِّيَةُ, وَفِي اَلصُّلْبِ اَلدِّيَةُ, وَفِي اَلْعَيْنَيْنِ اَلدِّيَةُ, وَفِي اَلرِّجْلِ اَلْوَاحِدَةِ نِصْفُ اَلدِّيَةِ, وَفِي الْمَأْمُومَةِ ثُلُثُ اَلدِّيَةِ, وَفِي اَلْجَائِفَةِ ثُلُثُ اَلدِّيَةِ, وَفِي اَلْمُنَقِّلَةِ خَمْسَ عَشْرَةَ مِنْ اَلْإِبِلِ, وَفِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ اَلْيَدِ وَالرِّجْلِ عَشْرٌ مِنْ اَلْإِبِلِ, وَفِي اَلسِّنِّ خَمْسٌ مِنْ اَلْإِبِلِ 1‏ وَفِي اَلْمُوضِحَةِ خَمْسٌ مِنْ اَلْإِبِلِ, وَإِنَّ اَلرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ, وَعَلَى أَهْلِ اَلذَّهَبِ أَلْفُ دِينَارٍ } أَخْرَجَهُ أَبُو دَاوُدَ فِي "اَلْمَرَاسِيلِ" وَالنَّسَائِيُّ, وَابْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَأَحْمَدُ, وَاخْتَلَفُوا فِي صِحَّتِهِ  ",
    "urdu": "سیدنا ابوبکر بن محمد بن عمرو بن حزم نے اپنے باپ کے حوالہ سے اپنے دادا سے روایت کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اہل یمن کو لکھا، پھر حدیث بیان کی جس میں یہ تحریر تھا جس کسی نے ایک بےگناہ مسلمان کو قتل کیا اور اس قتل کے گواہ ہوں تو اس پر قصاص لازم ہے۔ الایہ کہ مقتول کے ورثاء راضی ہوں تو ایک جان کے قتل کی دیت سو اونٹ ہے اور ناک میں بھی پوری دیت ہے جبکہ اسے جڑ سے کاٹ دے اور دونوں آنکھوں اور زبان اور دونوں ہونٹوں کے عوض بھی پوری دیت ہے۔ اسی طرح عضو مخصوص اور دو خصیہ میں پوری دیت ہے اور پشت میں بھی پوری دیت ہے اور ایک پاؤں کی صورت میں آدھی دیت ہے اور دماغ کے زخم اور پیٹ کے زخم میں تہائی دیت ہے اور وہ زخم جس سے ہڈی ٹوٹ جائے اس میں پندرہ اونٹ اور ہاتھ اور پاؤں کی ہر ایک انگلی میں دس دس اونٹ دیت ہے اور ایک دانت کی دیت پانچ اونٹ اور ایسے زخم میں جس سے ہڈی نظر آنے لگے پانچ اونٹ دیت ہے اور مرد کو عورت کے بدلہ قتل کیا جائے گا اور جن کے پاس اونٹ نہ ہوں اور سونا ہو تو ان سے ایک ہزار دینار وصول کئے جائیں گے۔ ابوداؤد نے اسے اپنی مراسیل میں لکھا ہے اور نسائی، ابن خزیمہ، ابن جارود، ابن حبان اور احمد نے روایت کیا ہے اور اس کی صحت میں انہوں نے اختلاف کیا ہے۔ ",
    "english": " "
  },
  "takhreej": {
    "arabic": " في "أ": "إبل".‏
‏2 ‏- ضعيف؛ لإرساله، ولأنه من رواية سليمان بن أرقم، وهو متروك، وفي الحديث كلام كثير، وقد فصلت القول فيه في "الأصل".‏",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
