{
  "hadithId": 1089,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 11,
    "inKitabBab": 1,
    "arabicBook": "",
    "babId": 89
  },
  "name": {
    "arabic": " وَعَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ, عَنْ أَبِيهِ قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَمَّرَ أَمِيرًا عَلَى جَيْشٍ أَوْصَاهُ بِتَقْوَى اَللَّهِ, وَبِمَنْ مَعَهُ مِنْ اَلْمُسْلِمِينَ خَيْراً, ثُمَّ قَالَ: "اُغْزُوا بِسْمِ اَللَّهِ, فِي سَبِيلِ اَللَّهِ, قَاتِلُوا مِنْ كَفَرَ بِاَللَّهِ, اُغْزُوا, وَلَا تَغُلُّوا, وَلَا تَغْدُرُوا, وَلَا تُمَثِّلُوا, وَلَا تَقْتُلُوا وَلِيداً, وَإِذَا لَقِيتَ عَدُوَّكَ مِنْ اَلْمُشْرِكِينَ فَادْعُهُمْ إِلَى ثَلَاثِ خِصَالٍ, فَأَيَّتُهُنَّ أَجَابُوكَ إِلَيْهَا, فَاقْبَلْ مِنْهُمْ, وَكُفَّ عَنْهُمْ: اُدْعُهُمْ إِلَى اَلْإِسْلَامِ فَإِنْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ.‏ ثُمَّ اُدْعُهُمْ إِلَى اَلتَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ اَلْمُهَاجِرِينَ, فَإِنْ أَبَوْا فَأَخْبَرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ اَلْمُسْلِمِينَ, وَلَا يَكُونُ لَهُمْ 1‏ .‏ فِي اَلْغَنِيمَةِ وَالْفَيْءِ شَيْءٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ اَلْمُسْلِمِينَ.‏ فَإِنْ هُمْ أَبَوْا فَاسْأَلْهُمْ اَلْجِزْيَةَ, فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ, فَإِنْ أَبَوْا فَاسْتَعِنْ بِاَللَّهِ وَقَاتِلْهُمْ.‏ وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اَللَّهِ وَذِمَّةَ نَبِيِّهِ, فَلَا تَفْعَلْ, وَلَكِنْ اِجْعَلْ لَهُمْ ذِمَّتَكَ; فَإِنَّكُمْ إِنْ تُخْفِرُوا ذِمَمَكُمْ 2‏ .‏ أَهْوَنُ مِنْ أَنَّ تُخْفِرُوا ذِمَّةَ اَللَّهِ, وَإِذَا أَرَادُوكَ أَنْ تُنْزِلَهُمْ عَلَى حُكْمِ اَللَّهِ, فَلَا تَفْعَلْ, بَلْ عَلَى حُكْمِكَ; فَإِنَّكَ لَا تَدْرِي أَتُصِيبُ فِيهِمْ حُكْمَ اَللَّهِ أَمْ لَا" } أَخْرَجَهُ مُسْلِمٌ ",
    "urdu": " سیدنا سلیمان بن بریدہ اپنے باپ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی لشکر یا سریہ کا امیر مقرر فرماتے تو اسے بالخصوص خدا خوفی اور اپنے مسلمانوں ساتھیوں کے ساتھ بھلائی اور خیر کی نصیحت فرماتے۔ اس کے بعد فرماتے ” اللہ کے نام کے ساتھ اس کے راستہ میں جہاد کرو ان لوگوں سے جو خدا کے منکر و کافر ہیں۔ لڑائی کرو، خیانت نہ کرنا، دھوکہ نہ دینا اور مثلہ نہ کرنا، بچوں کو قتل نہ کرنا۔ مشرک دشمن سے جب ملاقات ہو تو ان کو لڑائی سے پہلے تین چیزوں کی دعوت پیش کرو۔ ان میں سے جسے وہ قبول کر لیں اسے قبول کر لو اور ان سے لڑائی نہ کرو۔ پہلے ان کو اسلام کی دعوت پیش کرو۔ پس اگر وہ اس کو تسلیم کر لیں تو اسے قبول کر لو۔ پھر ان کو دعوت دو کہ وہ اپنے گھربار چھوڑ کر (دارالسلام) مہاجرین کے ملک کی طرف ہجرت کر کے آ جائیں۔ اگر وہ انکار کریں تو ان کو خبردار کر دو کہ ان کے حقوق بدوی مسلمانوں کے برابر ہوں گے اور ان کے لیے مال غنیمت اور اموال فے میں سے کچھ بھی نہیں ہو گا۔ الایہ کہ وہ مسلمانوں کے ساتھ مل کر جہاد میں شریک ہوں۔ اگر اس سے انکار کریں تو ان سے جزیہ لو۔ اگر وہ تسلیم کر لیں تو اسے بھی قبول کر لو اور اگر وہ انکار کریں تو اللہ سے مدد طلب کرو اور ان سے لڑائی شروع کر دو اور جب تم کسی قلعہ کا محاصرہ کر لو اور وہ تم سے اللہ اور اس کے نبی کا ذمہ و عہد لینا چاہیں تو انہیں یہ ذمہ نہ دو بلکہ تم اپنا عہد و ذمہ ان کو دے دو۔ (اس کے خلاف نہ کرنا) اس لئے کہ اگر تم اپنے عہد و ذمہ کو توڑتے ہو تو یہ اللہ کی پناہ کو توڑنے سے بہت خفیف و ہلکا ہے اور جب یہ چاہیں کہ تو ان کو اللہ کے حکم و فیصلہ پر اتارے تو ایسا نہ کرنا بلکہ اپنے حکم و فیصلہ پر اتارنا کیونکہ تجھے علم نہیں کہ تو اللہ کے فیصلہ پر پہنچ بھی سکے گا یا نہیں۔ (مسلم) ",
    "english": " "
  },
  "takhreej": {
    "arabic": " سقط من" أ".‏
‏2 ‏- وفي" أ": "ذمتكم" والذي في مسلم: " ذممكم وذمم أصحابكم" ومعنى " تخفروا": تنقضوا.‏
‏3 ‏- صحيح.‏ رواه مسلم ( 1731 )‏ ( 3 )‏ وقد اختصر الحافظ بعض عباراته.‏",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
