{
  "chapId": 10,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 118,
    "to": 128
  },
  "hadiths": [
    {
      "id": 118,
      "name": {
        "arabic": " عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { إِنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ كَانَتْ تُسْتَحَاضُ, فَقَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  - \"إِنَّ دَمَ اَلْحَيْضِ دَمٌ أَسْوَدُ يُعْرَفُ, فَإِذَا كَانَ ذَلِكَ فَأَمْسِكِي مِنَ اَلصَّلَاةِ, فَإِذَا كَانَ اَلْآخَرُ فَتَوَضَّئِي, وَصَلِّي\" } رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ, وَاسْتَنْكَرَهُ أَبُو حَاتِم ٍ وَفِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ عِنْدَ أَبِي دَاوُدَ: { لِتَجْلِسْ فِي مِرْكَنٍ, فَإِذَا رَأَتْ صُفْرَةً فَوْقَ اَلْمَاءِ, فَلْتَغْتَسِلْ لِلظُّهْرِ وَالْعَصْرِ غُسْلاً وَاحِدًا, وَتَغْتَسِلْ لِلْمَغْرِبِ وَالْعِشَاءِ غُسْلاً وَاحِدًا, وَتَغْتَسِلْ لِلْفَجْرِ غُسْلاً, وَتَتَوَضَّأْ فِيمَا بَيْنَ ذَلِكَ }",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ فاطمہ بنت ابی حبیش کو استحاضہ (خون کا جاری رہنا) کی شکایت تھی۔ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے ان سے فرمایا: \"حیض کا خون سیاہ ہوتا ہے اور پہچانا جاتا ہے، جب وہ (سیاہ خون) ہو تو نماز سے رک جاؤ، اور جب دوسرا (خون، یعنی استحاضہ کا) ہو تو وضو کرو اور نماز ادا کرو۔\" اسے ابو داؤد اور نسائی نے روایت کیا ہے، اور ابن حبان اور حاکم نے اسے صحیح قرار دیا ہے، جبکہ ابو حاتم نے اس پر نکارت کا اظہار کیا ہے۔ اور اسماء بنت عمیس کی حدیث میں ابو داؤد کے ہاں یہ ہے کہ: \"وہ ایک برتن میں بیٹھے، پس جب پانی کے اوپر زرد رنگ دیکھے تو ظہر اور عصر کے لیے ایک غسل کرے، اور مغرب اور عشاء کے لیے ایک غسل کرے، اور فجر کے لیے ایک غسل کرے، اور اس کے درمیان وضو کرتی رہے۔\"",
        "english": "Narrated Aishah (may Allah be pleased with her): Fatimah bint Abi Hubaysh suffered from Istihadah (non-menstrual bleeding). The Messenger of Allah (peace and blessings be upon him) said to her: \"The blood of menses is dark blood that is recognizable, so when it is that, stop praying. But when it is the other (blood, i.e., Istihadah), perform Wudu (ablution) and pray.\" Reported by Abu Dawud and An-Nasa'i, and authenticated by Ibn Hibban and Al-Hakim, though Abu Hatim considered it Mukhtar (rejected). And in the Hadith of Asma bint Umays narrated by Abu Dawud: \"She should sit in a tub, and if she sees yellowness upon the water, she should perform one Ghusl (ritual bath) for Zuhr and Asr, one Ghusl for Maghrib and Isha, and one Ghusl for Fajr, and she should perform Wudu between those times.\""
      }
    },

    {
      "id": 119,
      "name": {
        "arabic": " وَعَنْ حَمْنَةَ بِنْتِ جَحْشٍ قَالَتْ: { كُنْتُ أُسْتَحَاضُ حَيْضَةً كَبِيرَةً شَدِيدَةً, فَأَتَيْتُ اَلنَّبِيَّ  - صلى الله عليه وسلم  -أَسْتَفْتِيهِ, فَقَالَ: 'إِنَّمَا هِيَ رَكْضَةٌ مِنَ اَلشَّيْطَانِ, فَتَحَيَّضِي سِتَّةَ أَيَّامٍ, أَوْ سَبْعَةً, ثُمَّ اِغْتَسِلِي, فَإِذَا اسْتَنْقَأْتِ فَصَلِّي أَرْبَعَةً وَعِشْرِينَ, أَوْ ثَلَاثَةً وَعِشْرِينَ, وَصُومِي وَصَلِّي, فَإِنَّ ذَلِكَ يُجْزِئُكَ, وَكَذَلِكَ فَافْعَلِي كَمَا تَحِيضُ اَلنِّسَاءُ, فَإِنْ قَوِيتِ عَلَى أَنْ تُؤَخِّرِي اَلظُّهْرَ وَتُعَجِّلِي اَلْعَصْرَ, ثُمَّ تَغْتَسِلِي حِينَ تَطْهُرِينَ وَتُصَلِّينَ اَلظُّهْرَ وَالْعَصْرِ جَمِيعًا, ثُمَّ تُؤَخِّرِينَ اَلْمَغْرِبَ وَتُعَجِّلِينَ اَلْعِشَاءِ, ثُمَّ تَغْتَسِلِينَ وَتَجْمَعِينَ بَيْنَ اَلصَّلَاتَيْنِ, فَافْعَلِي.  وَتَغْتَسِلِينَ مَعَ اَلصُّبْحِ وَتُصَلِّينَ.  قَالَ: وَهُوَ أَعْجَبُ اَلْأَمْرَيْنِ إِلَيَّ } رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَحَسَّنَهُ اَلْبُخَارِيّ ُ",
        "urdu": " سیدہ حمنہ بنت جحش رضی اللہ عنہا بیان کرتی ہیں کہ مجھے زیادہ اور شدید استحاضہ ہوتا تھا۔ میں نے نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر فتویٰ طلب کیا، تو آپ نے فرمایا: \"یہ شیطان کی طرف سے ایک ضرب (دھچکا) ہے، چنانچہ تم چھ دن یا سات دن حیض شمار کرو، پھر غسل کر لو، جب تم پاکیزگی حاصل کر لو تو چوبیس دن یا تئیس دن نماز پڑھو اور روزے رکھو، تمہارے لیے یہی کافی ہو گا۔ اور اسی طرح کرو جیسے عورتیں حیض گزارتی ہیں۔ پس اگر تم میں طاقت ہو کہ ظہر کو مؤخر کرو اور عصر کو مقدم کر لو، پھر جب تم پاک ہو جاؤ تو غسل کرو اور ظہر اور عصر کو جمع کر کے پڑھو، پھر مغرب کو مؤخر کرو اور عشاء کو مقدم کر لو، پھر غسل کرو اور ان دونوں نمازوں کو جمع کر کے پڑھو، تو ایسا کر لو۔ اور صبح کے ساتھ (بھی) غسل کرو اور نماز پڑھو۔\" آپ ﷺ نے فرمایا: \"یہ دونوں حکموں میں مجھے زیادہ پسند ہے۔\" اسے خمسہ (پانچوں: ابوداؤد، ترمذی، ابن ماجہ، احمد) نے روایت کیا ہے سوائے نسائی کے، اور اسے ترمذی نے صحیح اور بخاری نے حسن قرار دیا ہے۔",
        "english": "Narrated Hamnah bint Jahsh (may Allah be pleased with her): 'I suffered from excessive and severe Istihadah (non-menstrual bleeding). I came to the Prophet (peace and blessings be upon him) seeking a ruling. He said: 'This is but a kick (or stroke) from the Satan. So, count your menstrual period as six or seven days, then perform Ghusl (ritual bath). When you have purified yourself, pray for twenty-four or twenty-three days, and fast and pray, for that will suffice you. And do so just as other women menstruate. If you are strong enough to delay Dhuhr and advance Asr, then perform Ghusl when you are purified, and pray Dhuhr and Asr together. Then delay Maghrib and advance Isha, then perform Ghusl and combine these two prayers. And perform Ghusl with the Fajr prayer and pray.' He (the Prophet ﷺ) said: 'That is the more astonishing (or better) of the two matters to me.'' Reported by the five (Abu Dawud, At-Tirmidhi, Ibn Majah, Ahmad) except An-Nasa'i. At-Tirmidhi authenticated it, and Al-Bukhari graded it Hasan (good)."
      }
    },

    {
      "id": 120,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ شَكَتْ إِلَى رَسُولِ اَللَّهِ  - صلى الله عليه وسلم  -اَلدَّمَ, فَقَالَ: \"اُمْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حَيْضَتُكِ, ثُمَّ اِغْتَسِلِي\" فَكَانَتْ تَغْتَسِلُ كُلَّ صَلَاةٍ } رَوَاهُ مُسْلِم ٌ وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: { وَتَوَضَّئِي لِكُلِّ صَلَاةٍ } وَهِيَ لِأَبِي دَاوُدَ وَغَيْرِهِ مِنْ وَجْهٍ آخَرَ. ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ سیدہ ام حبیبہ بنت جحش رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے دم استحاضہ کا شکوہ کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ”تمہارے ماہواری کے ایام جس قدر پہلے سے متعین ہیں اتنے ایام میں (نماز، روزہ) چھوڑ دو۔ اس کے بعد نہا دھو کر نماز ادا کرو۔“ سیدہ ام حبیبہ رضی اللہ عنہا اس کے بعد ہر نماز کیلئے تازہ غسل کیا کرتی تھیں۔ (مسلم) اور بخاری کی روایت میں ہے کہ ”پھر ہر نماز کیلئے ازسرنو (دوبارہ سے) وضو کر لیا کرو۔“ ابوداؤد وغیرہ محدثین نے اس حدیث کو دوسرے طریقے سے روایت کیا ہے۔ ",
        "english": "Narrated Aishah (may Allah be pleased with her): Umm Habibah bint Jahsh complained to the Messenger of Allah (peace and blessings be upon him) about the blood (Istihadah). He said: 'Stop (praying and fasting) for the length of time your menses used to hold you, then perform Ghusl (ritual bath).' So she used to perform Ghusl for every prayer. Reported by Muslim. And in a narration by Al-Bukhari: 'And perform Wudu (ablution) for every prayer,' which is also reported by Abu Dawud and others through another chain."
      }
    },

    {
      "id": 121,
      "name": {
        "arabic": "وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كُنَّا لَا نَعُدُّ اَلْكُدْرَةَ وَالصُّفْرَةَ بَعْدَ اَلطُّهْرِ شَيْئًا } رَوَاهُ اَلْبُخَارِيُّ, وَأَبُو دَاوُدَ وَاللَّفْظُ لَه ُ  ",
        "urdu": "سیدہ ام عطیہ رضی اللہ عنہا بیان کرتی ہیں کہ ہم (ایام ماہواری کے اختتام پر) نہا دھو کر پاک و صاف ہونے کے بعد گدلے اور زرد رنگ کی چیز کو (اس چیز کے خارج ہونے کو) کوئی اہمیت نہیں دیتی تھیں (یعنی ایسے مادہ کے خروج کو حیض تصور نہیں کرتی تھیں۔) (بخاری، ابوداؤد) متن حدیث کے الفاظ ابوداؤد کے ہیں۔  ",
        "english": "Narrated Umm 'Atiyyah (may Allah be pleased with her): 'We used not to consider the Kuddrah (brownish discharge) and Sufrah (yellowish discharge) after Tuhur (purification/completion of menses) as anything (i.e., we did not consider it part of menses).' Reported by Al-Bukhari and Abu Dawud, and the wording is that of Abu Dawud."
      }
    },

    {
      "id": 122,
      "name": {
        "arabic": "وَعَنْ أَنَسٍ  - رضى الله عنه  - { أَنَّ اَلْيَهُودَ كَانُوا إِذَا حَاضَتْ اَلْمَرْأَةُ لَمْ يُؤَاكِلُوهَا, فَقَالَ اَلنَّبِيُّ  - صلى الله عليه وسلم  - \"اِصْنَعُوا كُلَّ شَيْءٍ إِلَّا اَلنِّكَاحَ\" } رَوَاهُ مُسْلِم ٌ  ",
        "urdu": " سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ یہودیوں کے ہاں جب کسی عورت کو حیض آتا تو وہ اس عورت کے ساتھ کھانا پینا ترک کر دیتے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”(اے مسلمانوں)! تم ہمبستری کے علاوہ ہر قسم کا فعل عورت کے ساتھ کر سکتے ہو۔“ (مسلم)",
        "english": "Narrated Anas (may Allah be pleased with him): The Jews, when a woman among them menstruated, would not eat with her nor dwell with her in their houses. The Prophet (peace and blessings be upon him) said: \"Do everything except Nikah (sexual intercourse).\" Reported by Muslim."
      }
    },

    {
      "id": 123,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -يَأْمُرُنِي فَأَتَّزِرُ, فَيُبَاشِرُنِي وَأَنَا حَائِضٌ } مُتَّفَقٌ عَلَيْه",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مجھے تہبند مضبوطی سے باندھنے کا حکم فرماتے پھر آپ صلی اللہ علیہ وسلم میرے ساتھ مباشرت کرتے، حالانکہ میں اس وقت حالت حیض میں ہوتی تھی۔ (بخاری و مسلم) ",
        "english": "Narrated Aishah (may Allah be pleased with her): 'The Messenger of Allah (peace and blessings be upon him) used to order me to wear an Izar (waist-wrapper/lower garment), and then he would cuddle/fondle me while I was menstruating.' Agreed upon (Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 124,
      "name": {
        "arabic": " وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنِ اَلنَّبِيِّ  - صلى الله عليه وسلم  - -فِي اَلَّذِي يَأْتِي اِمْرَأَتَهُ وَهِيَ حَائِضٌ - قَالَ: { يَتَصَدَّقُ بِدِينَارٍ, أَوْ نِصْفِ دِينَارٍ } رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلْحَاكِمُ وَابْنُ اَلْقَطَّانِ, وَرَجَّحَ غَيْرَهُمَا وَقْفَه ُ",
        "urdu": " سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے ایسے آدمی کے بارے میں بیان کیا ہے جو اپنی بیوی کے پاس ایسی حالت میں جائے جبکہ وہ حالت حیض میں ہو ”وہ ایک دینار یا نصف دینار صدقہ و خیرات کرے۔“ اس حدیث کو پانچوں نے روایت کیا ہے۔ حاکم اور ابن قطان دونوں نے اس کو صحیح قرار دیا ہے اور ان دونوں کے علاوہ دوسرے محدثین نے اسے موقوف کہا ہے۔",
        "english": "Narrated Ibn Abbas (may Allah be pleased with them both), from the Prophet (peace and blessings be upon him), concerning the man who has sexual intercourse with his wife while she is menstruating, he said: 'He should give a Dinar or half a Dinar in charity.' Reported by the five (Ahl as-Sunan and Ahmad). Al-Hakim and Ibn Al-Qattan authenticated it, while others preferred it to be Mawquf (stopped at the Companion)."
      }
    },

    {
      "id": 125,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ أَلَيْسَ إِذَا حَاضَتْ لَمْ تُصَلِّ وَلَمْ تَصُمْ? } مُتَّفَقٌ عَلَيْهِ فِي حَدِيث ",
        "urdu": " سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے کہ ”کیا عورت جب حالت حیض میں ہوتی ہے تو نماز اور روزہ چھوڑ نہیں دیتی؟“ (بخاری و مسلم) یہ لمبی حدیث کا ٹکڑا ہے۔",
        "english": "Narrated Abu Sa'id Al-Khudri (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: 'Is it not the case that when she menstruates, she neither prays nor fasts?' Agreed upon (Al-Bukhari and Muslim), as part of a longer Hadith."
      }
    },

    {
      "id": 126,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { لَمَّا جِئْنَا سَرِفَ حِضْتُ, فَقَالَ اَلنَّبِيُّ  - صلى الله عليه وسلم  - \"اِفْعَلِي مَا يَفْعَلُ اَلْحَاجُّ, غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ حَتَّى تَطْهُرِي\" } مُتَّفَقٌ عَلَيْهِ فِي حَدِيث ٍ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ جب ہم مقام سرف میں آئے تو مجھے ایام ماہواری شروع ہو گئے (میرے بتانے پر) نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” مناسک حج تم بھی اسی طرح ادا کرو جس طرح دوسرے حاجی کرتے ہیں البتہ طواف بیت اللہ ایام سے فارغ ہو کر نہا دھو کر کرنا“ (بخاری و مسلم) یہ لمبی حدیث کا ٹکڑا ہے۔  ",
        "english": "Narrated Aishah (may Allah be pleased with her): 'When we reached Sarif (a place near Makkah), I menstruated. The Prophet (peace and blessings be upon him) said: 'Do everything that the pilgrim does, except that you should not perform Tawaf (circumambulation) around the House (Ka'bah) until you become pure.'' Agreed upon (Al-Bukhari and Muslim), as part of a longer Hadith."
      }
    },

    {
      "id": 127,
      "name": {
        "arabic": " وَعَنْ مُعَاذٍ  - رضى الله عنه  - { أَنَّهُ سَأَلَ اَلنَّبِيَّ  - صلى الله عليه وسلم  -مَا يَحِلُّ لِلرَّجُلِ مِنِ اِمْرَأَتِهِ, وَهِيَ حَائِضٌ? قَالَ: \"مَا فَوْقَ اَلْإِزَارِ\" } رَوَاهُ أَبُو دَاوُدَ وَضَعَّفَه ُ ",
        "urdu": " سیدنا معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا کہ ”جب عورت ایام ماہواری میں ہو تو عورت کی اپنے شوہر کے لیے کیا کیا چیز حلال ہے؟“ آپ صلی اللہ علیہ وسلم نے فرمایا ” پاجامہ یا تہبند میں جسم کا جتنا حصہ ہے اسے چھوڑ کر باقی حصہ اس کے لیے حلال ہے۔“ اسے ابوداؤد نے روایت کیا ہے اور ضعیف قرار دیا ہے۔",
        "english": "Narrated Mu'adh (may Allah be pleased with him): 'He asked the Prophet (peace and blessings be upon him): 'What is lawful for a man from his wife when she is menstruating?' He replied: 'What is above the Izar (waist-wrapper).' Reported by Abu Dawud, who graded it weak."
      }
    },

    {
      "id": 128,
      "name": {
        "arabic": "عَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَتِ اَلنُّفَسَاءُ عَلَى عَهْدِ رَسُولِ اَللَّهِ  - صلى الله عليه وسلم  -تَجْلِسُ أَرْبَعِينَ يَوْمًا } وَفِي لَفْظٍ لَهُ: { وَلَمْ يَأْمُرْهَا اَلنَّبِيُّ  - صلى الله عليه وسلم  -بِقَضَاءِ صَلَاةِ اَلنِّفَاسِ } رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلْحَاكِمُ",
        "urdu": " سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ عہد رسالت مآب صلی اللہ علیہ وسلم میں عورتیں بچے کی ولادت کے چالیس روز تک نفاس میں بیٹھی رہتی تھیں۔ نسائی کے علاوہ باقی چاروں (ابوداؤد، ترمذی، ابن ماجہ، احمد) نے اسے روایت کیا ہے اور متن حدیث کے الفاظ ابوداؤد کے ہیں۔ اور اس کی ایک روایت میں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایام نفاس میں چھوٹی ہوئی نمازوں کی قضاء کا حکم نہیں دیا۔ اسے حاکم نے صحیح قرار دیا ہے۔ ",
        "english": "Narrated Umm Salamah (may Allah be pleased with her): 'The women during the time of the Messenger of Allah (peace and blessings be upon him) used to remain in Nifas (post-natal bleeding) for forty days.' And in one wording [reported by Abu Dawud]: 'And the Prophet (peace and blessings be upon him) did not command her to make up the prayers missed during Nifas.' Reported by the five (Ahl as-Sunan and Ahmad) except An-Nasa'i, and Al-Hakim authenticated it."
      }
    }
  ]
}