{
    "chapId": 2,
    "bookId": 1,
    "summary": {
        "urdu": [""],
        "english": [""]
    },
    "description": {
        "urdu": " ",
        "english": " "
    }, 
    "hadithRange": {
        "from": 14,
        "to": 21
    }, 
    "hadiths": [
        {
          "id": 14,
          "name": {
            "arabic": "عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: قَالَ النَّبِيُّ - صلى الله عليه وسلم -{ لَا تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ والْفِضَّةِ، وَلَا تَأْكُلُوا فِي صِحَافِهَا، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا، وَلَكُمْ فِي الْآخِرَةِ } مُتَّفَقٌ عَلَيْهِ",
            "urdu": "حضرت حذیفہ بن یمان رضی اللہ عنہما روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا: ”سونے اور چاندی کے برتنوں میں نہ پیا کرو، اور نہ ہی ان کے برتنوں میں کھایا کرو۔ بے شک یہ دنیا میں ان (کافروں) کے لئے ہیں اور آخرت میں تمہارے لئے۔“ اسے امام بخاری اور مسلم نے روایت کیا ہے۔",
            "english": "Hudhayfah ibn al-Yaman (RA) reported that the Prophet ﷺ said: “Do not drink from vessels of gold and silver, nor eat from their plates. They are for them in this world, and for you in the Hereafter.” Agreed upon."
          }
        },

        
        {
          "id": 15,

          "name": {
            "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ الْلَّهُ عَنْهَا، قَالَتْ: قَالَ رَسُولُ الْلَّهِ - صلى الله عليه وسلم - { الَّذِي يَشْرَبُ فِي إِنَاءِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ } مُتَّفَقٌ عَلَيْهِ",
            "urdu": "سیدہ ام سلمہ رضی اللہ عنہا روایت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص چاندی کے برتنوں میں پیتا ہے وہ اپنے پیٹ میں جہنم کی آگ بھر رہا ہے۔“",
            "english": "Umm Salamah (RA) reported that the Messenger of Allah (ﷺ) said: “Whoever drinks from a silver vessel is only gulping fire from Hell into his stomach.” Agreed upon."
          }
        },

        {
          "id": 16,
          "name": {
            "arabic": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ - صلى الله عليه وسلم - { إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهُرَ } أَخْرَجَهُ مُسْلِمٌ. وَعِنْدَ الْأَرْبَعَةِ: { أَيُّمَا إِهَابٍ دُبِغَ }",
            "urdu": "سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب کچے چمڑے کو (مسالہ لگا کر) رنگ دیا جائے تو وہ پاک ہو جاتا ہے۔“ (مسلم) اور سنن اربعہ میں یہ الفاظ ہیں: ”جو بھی چمڑا دباغت دیا جائے (وہ پاک ہو جاتا ہے)۔“",
            "english": "Ibn Abbas (RA) narrated that the Messenger of Allah (ﷺ) said: “When a hide is tanned, it becomes purified.” (Muslim) And the Four Sunan narrate: “Any hide that is tanned becomes purified.”"
          }
        },

        {
          "id": 17,
          "name": {
            "arabic": "وَعَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ الْلَّهِ  - صلى الله عليه وسلم  -{ دِبَاغُ جُلُودِ الْمَيْتَةِ طُهُورُهاَ } صَحَّحَهُ ابْنُ حِبَّانَ",
            "urdu": "سیدنا سلمہ بن محبق رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مردہ جانوروں کے چمڑوں کو رنگنا ہی ان کی طہارت اور پاکیزگی ہے۔“ ابن حبان نے اسے صحیح قرار دیا۔",
            "english": "Salamah ibn al-Muhabbiq (ra) narrated that the Messenger of Allah (ﷺ) said: “Tanning the skin of a dead animal makes it pure.” Ibn Hibban authenticated it."
          }
        },

        {
          "id": 18,
          "name": {
            "arabic": "وَعَنْ مَيْمُونَةَ رَضِيَ الْلَّهُ عَنْهَا، قَالَتْ: { مَرَّ رَسُولُ الْلَّهِ - صلى الله عليه وسلم - بِشَاةٍ يَجُرُّونَهَا، فَقَالَ: \"لَوْ أَخَذْتُمْ إِهَابَهَا؟\" فَقَالُوا: إِنَّهَا مَيْتَةٌ، فَقَالَ: \"يُطَهِّرُهَا الْمَاءُ وَالْقَرَظُ\" } أَخْرَجَهُ أَبُو دَاوُدَ، وَالنَّسَائِيُّ.",
            "urdu": "سیدہ میمونہ رضی اللہ عنہا روایت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا گزر ایک مردہ بکری کے پاس سے ہوا جسے لوگ گھسیٹ رہے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”کاش تم نے اس کی کھال اتار لی ہوتی۔“ وہ بولے: یا رسول اللہ! وہ تو مری ہوئی ہے۔ آپ نے فرمایا: ”اسے پانی اور کیکر کی چھال پاک کر دیتی ہے۔“",
            "english": "Maimuna (RA) reported that the Messenger of Allah (ﷺ) passed by a dead sheep being dragged. He said, “Why did you not take its skin?” They said, “It is dead.” He replied, “Water and qaraz (acacia bark) purify it.”"
          }
        },

        {
          "id": 19,
          "name": {
            "arabic": "وَعَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ  - رضى الله عنه  - قَالَ: { قُلْتُ: يَا رَسُولَ الْلَّهِ، إِنَّا بِأَرْضِ قَوْمٍ أَهْلِ كِتَابٍ، أَفَنَأْكُلُ فِي آنِيَتِهِمْ؟]فـَ] قَالَ: \"لَا تَأْكُلُوا فِيهَا، إِلَّا أَنْ لَا تَجِدُوا غَيْرَهَا، فَاغْسِلُوهَا، وَكُلُوا فِيهَا\" } مُتَّفَقٌ عَلَيْهِ 1",
            "urdu": "سیدنا ابوثعلبہ خشنی رضی اللہ عنہ روایت کرتے ہیں کہ میں نے عرض کیا اے اللہ کے رسول! ہم اہل کتاب کے علاقے میں رہتے ہیں کیا ہم ان کے استعمال کے برتنوں میں کھا سکتے ہیں؟ جواب میں آپ صلی اللہ علیہ وسلم نے فرمایا ”ان برتنوں میں نہ کھاؤ، البتہ اگر ان کے ماسوا اور برتن میسر نہ ہو سکیں تو پھر ان کو دھو کر ان میں کھا سکتے ہو۔“",
            "english": "Narrated Abu Tha’laba Al-Khushani (RA): I said, 'O Messenger of Allah, we are in the land of the People of the Book; should we eat from their utensils?' He (ﷺ) said, 'Do not eat in them, except that you do not find other utensils; then wash them and eat from them.'"
          }
        },

        {
          "id": 20,
          "name": {
            "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ الْلَّهُ عَنْهُمَا؛ { أَنَّ النَّبِيَّ  - صلى الله عليه وسلم  -وَأَصْحَابَهُ تَوَضَّئُوا مِنْ مَزَادَةِ اِمْرَأَةٍ مُشْرِكَةٍ.  } مُتَّفَقٌ عَلَيْهِ، فِي حَدِيثٍ طَوِيلٍ 1",
            "urdu": "سیدنا عمران بن حصین رضی اللہ عنہما روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم کے صحابہ نے ایک مشرکہ عورت کے مشکیزہ سے پانی لے کر اس سے وضو کیا۔ (بخاری و مسلم) یہ ایک طویل حدیث کا ٹکڑا ہے۔",
            "english": "Narrated Imran ibn Husayn (RA): The Prophet (ﷺ) and his companions performed ablution using water from the container of a polytheist woman. This is part of a longer Hadith reported in Bukhari and Muslim."
          }
        },

        {
          "id": 21,
          "name": {
            "arabic": "وَعَنْ أَنَسِ بْنِ مَالِكٍ - رضى الله عنه - { أَنَّ قَدَحَ النَّبِيِّ - صلى الله عليه وسلم -اِنْكَسَرَ، فَاتَّخَذَ مَكَانَ الشَّعْبِ سِلْسِلَةً مِنْ فِضَّةٍ. } أَخْرَجَهُ الْبُخَارِيُّ 1",
            "urdu": "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم کا ذاتی پیالہ ٹوٹ گیا تو آپ صلی اللہ علیہ وسلم نے اس ٹوٹی جگہ پر چاندی کا تار لگوا دیا۔",
            "english": "Narrated Anas ibn Malik (RA): The Prophet’s (ﷺ) cup broke, so he used a silver wire to repair the broken part. (Reported by Bukhari)"
          }
        }


    ]
}