{
  "hadithId": 1020,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 9,
    "inKitabBab": 3,
    "arabicBook": "",
    "babId": 81
  },
  "name": {
    "arabic": " عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ, عَنْ رِجَالٍ مِنْ كُبَرَاءِ قَوْمِهِ, أَنَّ عَبْدَ اَللَّهِ بْنَ سَهْلٍ ومُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ, فَأُتِيَ مَحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اَللَّهِ بْنِ سَهْلِ قَدْ قُتِلَ, وَطُرِحَ فِي عَيْنٍ, فَأَتَى يَهُودَ, فَقَالَ: أَنْتُمْ وَاَللَّهِ قَتَلْتُمُوهُ.‏ قَالُوا: وَاَللَّهِ مَا قَتَلْنَاهُ, فَأَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ اَلرَّحْمَنِ بْنُ سَهْلٍ, فَذَهَبَ مُحَيِّصَةُ لَيَتَكَلَّمَ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ "كَبِّرْ كَبِّرْ" يُرِيدُ: اَلسِّنَّ, فَتَكَلَّمَ حُوَيِّصَةُ, ثُمَّ تَكَلَّمَ مُحَيِّصَةُ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-"إِمَّا أَنْ يَدُوا صَاحِبَكُمْ, وَإِمَّا أَنْ يَأْذَنُوا بِحَرْبٍ".‏ فَكَتَبَ إِلَيْهِمْ فِي ذَلِكَ [كِتَابًا].‏ فَكَتَبُوا: إِنَّا وَاَللَّهِ مَا قَتَلْنَاهُ, فَقَالَ لِحُوَيِّصَةَ, وَمُحَيِّصَةُ, وَعَبْدِ اَلرَّحْمَنِ بْنَ سَهْلٍ: "أَتَحْلِفُونَ, وَتَسْتَحِقُّونَ دَمَ صَاحِبَكُمْ?" قَالُوا: لَا.‏ قَالَ: "فَتَحْلِفُ لَكُمْ يَهُودُ?" قَالُوا: لَيْسُوا مُسْلِمِينَ فَوَدَاهُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مِنْ عِنْدِهِ, فَبَعَثَ إِلَيْهِمْ مَائَةَ نَاقَةٍ.‏ قَالَ سَهْلٌ: فَلَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ } مُتَّفَقٌ عَلَيْهِ.‏",
    "urdu": " سیدنا سہل بن ابی حثمہ نے اپنی قوم کے بڑے بزرگوں سے روایت بیان کی ہے کہ عبداللہ بن سہل اور محیصہ بن مسعود رضی اللہ عنہما اپنی تنگ دستی کی وجہ سے خیبر کی طرف نکلے۔ پس محیصہ نے آ کر اطلاع دی کہ عبداللہ بن سہل رضی اللہ عنہ کو قتل کر دیا گیا ہے۔ اور اسے ایک چشمہ میں پھینک دیا گیا ہے۔ محیصہ رضی اللہ عنہ یہود کے پاس آئے اور کہا کہ خدا کی قسم تم لوگوں نے اسے قتل کیا ہے۔ وہ بولے اللہ کی قسم ہم نے اسے قتل نہیں کیا۔ پھر محیصہ اور اس کا بھائی حویصہ اور عبدالرحمٰن بن سہل رضی اللہ عنہم تینوں رسول اللہ صلی اللہ علیہ وسلم کی عدالت میں پہنچے اور محیصہ نے گفتگو کرنی چاہی۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” بڑے کو بات کرنے دو بڑے کو“ آپ صلی اللہ علیہ وسلم کی مراد تھی جو تم میں عمر میں بڑا ہے (اسے بات کرنی چاہیئے) چنانچہ حویصہ رضی اللہ عنہ نے بیان دیا پھر محیصہ بولا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” وہ لوگ یا تو تمہارے صاحب و ساتھی کی دیت ادا کریں گے یا جنگ کے لیے تیار ہو جائیں۔“ پھر اس سلسلہ میں آپ صلی اللہ علیہ وسلم نے ان کو خط تحریر فرمایا جس کے جواب میں انہوں نے لکھا کہ اللہ کی قسم ہم نے اسے قتل نہیں کیا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے حویصہ، محیصہ اور عبدالرحمٰن بن سہل (رضی اللہ عنہم) سے فرمایا ” کیا تم لوگ قسم کھا کر اپنے صاحب کے خون کے حقدار بنو گے؟“ انہوں نے جواب دیا۔ نہیں! پھر آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ ” تم کو یہودی قسم دیں؟“ انہوں نے جواب دیا کہ وہ تو مسلمان نہیں ہیں (اس لئے ان کی قسم کا کوئی اعتبار نہیں) پس پھر رسول اللہ صلی اللہ علیہ وسلم نے اس کی دیت اپنے پاس (بیت المال) سے دی اور ان کو سو اونٹنیاں بھیج دیں۔ سہل رضی اللہ عنہ نے بتایا کہ ان میں سے ایک سرخ رنگ کی اونٹنی نے مجھے لات ماری۔ (بخاری و مسلم)",
    "english": " "
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه البخاري (7192)‏، ومسلم (1669)‏ (6)‏.‏",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
