{
  "hadithId": 657,
  "hadithNo": 10,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 7,
    "inKitabBab": 1,
    "arabicBook": "",
    "babId": 42
  },
  "name": {
    "arabic": " وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: { جَاءَتْنِي بَرِيرَةُ, فَقَالَتْ: كَاتَبْتُ أَهْلِي عَلَى تِسْعٍ أُوَاقٍ, فِي كُلِّ عَامٍ أُوقِيَّةٌ, فَأَعِينِينِي.‏ فَقُلْتُ: إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ, فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا.‏ فَقَالَتْ لَهُمْ; فَأَبَوْا عَلَيْهَا, فَجَاءَتْ مِنْ عِنْدِهِمْ, وَرَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-جَالِسٌ.‏ فَقَالَتْ: إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ فَأَبَوْا إِلَّا أَنْ يَكُونَ اَلْوَلَاءُ لَهُمْ, فَسَمِعَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَأَخْبَرَتْ عَائِشَةُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَ: خُذِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ, فَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ فَفَعَلَتْ عَائِشَةُ, ثُمَّ قَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلنَّاسِ [ خَطِيباً ], فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ.‏ ثُمَّ قَالَ: " أَمَّا بَعْدُ, مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطاً لَيْسَتْ فِي كِتَابِ اَللَّهِ عَزَّ وَجَلَّ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اَللَّهِ فَهُوَ بَاطِلٌ, وَإِنْ كَانَ مِائَةَ شَرْطٍ, قَضَاءُ اَللَّهِ أَحَقُّ, وَشَرْطُ اَللَّهِ أَوْثَقُ, وَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ " } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ 1‏ .‏ وَعِنْدَ مُسْلِمٍ فَقَالَ: { اِشْتَرِيهَا وَأَعْتِقِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ }
",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ بریرہ رضی اللہ عنہا (لونڈی) میرے پاس آئی اور کہنے لگی میں نے اپنے مالک سے نو اوقیہ چاندی پر مکاتبت (یعنی میں نو اوقیہ دے کر آزادی لے لوں گی) کر لی ہے کہ ہر سال میں ایک اوقیہ ادا کرتی رہوں گی۔ لہٰذا میری (اس بارے میں) مدد کریں۔ میں نے (اسے) کہا کہ اگر تیرے مالک کو یہ پسند ہو کہ میں تیری مجموعی قیمت یکمشت ادا کر دوں اور تیری ولاء میری ہو جائے تو میں ایسا کرنے کو تیار ہوں۔ بریرہ رضی اللہ عنہا یہ تجویز لے کر اپنے مالک کے پاس گئی اور ان سے یہ کہا تو انہوں نے اسے تسلیم کرنے سے انکار کر دیا۔ بریرہ رضی اللہ عنہا ان کے پاس سے واپس آئی، اس وقت رسول اللہ صلی اللہ علیہ وسلم بھی تشریف فرما تھے۔ بریرہ رضی اللہ عنہا نے کہا کہ میں نے اپنے مالکوں کے سامنے وہ تجویز پیش کی تھی، مگر انہوں نے اسے تسلیم کرنے سے انکار کر دیا ہے اور وہ کہتے ہیں کہ ولاء ان کے لئے ہے۔ یہ بات نبی کریم صلی اللہ علیہ وسلم نے سنی اور سیدہ عائشہ رضی اللہ عنہا نے بھی اس واقعہ سے نبی کریم صلی اللہ علیہ وسلم کو باخبر کیا۔ یہ سن کر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” اسے لے لو اور ان سے ولاء کی شرط کر لو، کیونکہ ولاء کا حقدار وہی ہے جو اسے آزادی دے۔“ سیدہ عائشہ رضی اللہ عنہا نے ایسا ہی کیا۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم لوگوں میں خطاب فرمانے کھڑے ہوئے۔ اللہ تعالیٰ کی حمد و ثنا کی، پھر فرمایا ” لوگوں کو کیا ہو گیا ہے کہ ایسی شرطیں لگاتے ہیں جو کتاب اللہ میں نہیں۔ (یاد رکھو!) جو شرط کتاب اللہ میں نہیں ہے وہ باطل ہیں، خواہ سینکڑوں شرطیں ہی کیوں نہ ہوں۔ اللہ کا فیصلہ نہایت برحق ہے اور اللہ کی شرط نہایت ہی پختہ اور پکی ہے۔ ولاء اسی کا حق ہے جو آزاد کرے۔“ (بخاری و مسلم) یہ الفاظ بخاری کے ہیں۔ مسلم کے ہاں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ”اسے خرید لو اور آزاد کر دو اور ان سے ولاء کی شرط کر لو۔“ (بخاری و مسلم) ",
    "english": " "
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري ( 2168 )‏، ومسلم ( 1504 )‏.‏ ",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
