{
  "hadithId": 607,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 6,
    "inKitabBab": 5,
    "arabicBook": "",
    "babId": 40
  },
  "name": {
    "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حَجَّ, فَخَرَجْنَا مَعَهُ, حَتَّى أَتَيْنَا ذَا الْحُلَيْفَةِ, فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ, فَقَالَ: " اِغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ, وَأَحْرِمِي " وَصَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلْمَسْجِدِ, ثُمَّ رَكِبَ اَلْقَصْوَاءَ 1‏ حَتَّى إِذَا اِسْتَوَتْ بِهِ عَلَى اَلْبَيْدَاءِ أَهَلَّ بِالتَّوْحِيدِ: " لَبَّيْكَ اَللَّهُمَّ لَبَّيْكَ, لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ, إِنَّ اَلْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ, لَا شَرِيكَ لَكَ ".‏ حَتَّى إِذَا أَتَيْنَا اَلْبَيْتَ اِسْتَلَمَ اَلرُّكْنَ, فَرَمَلَ ثَلَاثًا وَمَشَى أَرْبَعًا, ثُمَّ أَتَى مَقَامَ إِبْرَاهِيمَ فَصَلَّى, ثُمَّ رَجَعَ إِلَى اَلرُّكْنِ فَاسْتَلَمَهُ.‏ ثُمَّ خَرَجَ مِنَ اَلْبَابِ إِلَى اَلصَّفَا, فَلَمَّا دَنَا مِنَ اَلصَّفَا قَرَأَ: " إِنَّ اَلصَّفَا وَاَلْمَرْوَةَ مِنْ شَعَائِرِ اَللَّهِ " " أَبْدَأُ بِمَا بَدَأَ اَللَّهُ بِهِ " فَرَقِيَ اَلصَّفَا, حَتَّى رَأَى اَلْبَيْتَ, فَاسْتَقْبَلَ اَلْقِبْلَةَ 2‏ فَوَحَّدَ اَللَّهَ وَكَبَّرَهُ وَقَالَ: " لَا إِلَهَ إِلَّا اَللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ, لَهُ اَلْمُلْكُ, وَلَهُ اَلْحَمْدُ, وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ, لَا إِلَهَ إِلَّا اَللَّهُ [ وَحْدَهُ ] 3‏ أَنْجَزَ وَعْدَهُ, وَنَصَرَ عَبْدَهُ, وَهَزَمَ اَلْأَحْزَابَ وَحْدَهُ ".‏ ثُمَّ دَعَا بَيْنَ ذَلِكَ 4‏ ثَلَاثَ مَرَّاتٍ, ثُمَّ نَزَلَ إِلَى اَلْمَرْوَةِ, حَتَّى 5‏ اِنْصَبَّتْ قَدَمَاهُ فِي بَطْنِ اَلْوَادِي [ سَعَى ] 6‏ حَتَّى إِذَا صَعَدَتَا 7‏ مَشَى إِلَى اَلْمَرْوَةِ 8‏ فَفَعَلَ عَلَى اَلْمَرْوَةِ, كَمَا فَعَلَ عَلَى اَلصَّفَا … ‏- فَذَكَرَ اَلْحَدِيثَ.‏ وَفِيهِ: فَلَمَّا كَانَ يَوْمَ اَلتَّرْوِيَةِ تَوَجَّهُوا إِلَى مِنَى, وَرَكِبَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَصَلَّى بِهَا اَلظُّهْرَ, وَالْعَصْرَ, وَالْمَغْرِبَ, وَالْعِشَاءَ, وَالْفَجْرَ, ثُمَّ مَكَثَ قَلِيلاً حَتَّى طَلَعَتْ اَلشَّمْسُ، فَأَجَازَ حَتَّى أَتَى عَرَفَةَ, فَوَجَدَ اَلْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ 9‏ فَنَزَلَ بِهَا.‏ حَتَّى إِذَا زَاغَتْ اَلشَّمْسُ أَمَرَ بِالْقَصْوَاءِ, فَرُحِلَتْ لَهُ, فَأَتَى بَطْنَ اَلْوَادِي, فَخَطَبَ اَلنَّاسَ.‏ ثُمَّ أَذَّنَ ثُمَّ أَقَامَ, فَصَلَّى اَلظُّهْرَ, ثُمَّ أَقَامَ فَصَلَّى اَلْعَصْرَ, وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا.‏ ثُمَّ رَكِبَ حَتَّى أَتَى اَلْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ اَلْقَصْوَاءِ إِلَى الصَّخَرَاتِ, وَجَعَلَ حَبْلَ اَلْمُشَاةِ 10‏ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ اَلْقِبْلَةَ, فَلَمْ يَزَلْ وَاقِفاً حَتَّى غَرَبَتِ اَلشَّمْسُ, وَذَهَبَتْ اَلصُّفْرَةُ قَلِيلاً, حَتَّى غَابَ اَلْقُرْصُ, وَدَفَعَ, وَقَدْ شَنَقَ لِلْقَصْوَاءِ اَلزِّمَامَ حَتَّى إِنَّ رَأْسَهَا لَيُصِيبُ مَوْرِكَ رَحْلِهِ, وَيَقُولُ بِيَدِهِ اَلْيُمْنَى: " أَيُّهَا اَلنَّاسُ, اَلسَّكِينَةَ, اَلسَّكِينَةَ ", كُلَّمَا أَتَى حَبْلاً 11‏ أَرْخَى لَهَا قَلِيلاً حَتَّى تَصْعَدَ.‏ حَتَّى أَتَى اَلْمُزْدَلِفَةَ, فَصَلَّى بِهَا اَلْمَغْرِبَ وَالْعِشَاءَ, بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ, وَلَمْ يُسَبِّحْ 12‏ بَيْنَهُمَا شَيْئًا, ثُمَّ اِضْطَجَعَ حَتَّى طَلَعَ اَلْفَجْرُ, فَصَلَّى 13‏ اَلْفَجْرَ, حِينَ 14‏ تَبَيَّنَ لَهُ اَلصُّبْحُ بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ حَتَّى أَتَى اَلْمَشْعَرَ اَلْحَرَامَ, فَاسْتَقْبَلَ اَلْقِبْلَةَ, فَدَعَاهُ, وَكَبَّرَهُ, وَهَلَّلَهُ 15‏ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا.‏ فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ اَلشَّمْسُ, حَتَّى أَتَى بَطْنَ مُحَسِّرَ فَحَرَّكَ قَلِيلاً، ثُمَّ سَلَكَ اَلطَّرِيقَ اَلْوُسْطَى اَلَّتِي تَخْرُجُ عَلَى اَلْجَمْرَةِ اَلْكُبْرَى, حَتَّى أَتَى اَلْجَمْرَةَ اَلَّتِي عِنْدَ اَلشَّجَرَةِ, فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ, يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا, مِثْلَ حَصَى اَلْخَذْفِ, رَمَى مِنْ بَطْنِ اَلْوَادِي، ثُمَّ اِنْصَرَفَ إِلَى اَلْمَنْحَرِ, فَنَحَرَ، ثُمَّ رَكِبَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَأَفَاضَ إِلَى اَلْبَيْتِ, فَصَلَّى بِمَكَّةَ اَلظُّهْرَ } رَوَاهُ مُسْلِمٌ مُطَوَّلاً ",
    "urdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حج کیا تو ہم آپ صلی اللہ علیہ وسلم کے ساتھ نکلے یہاں تک کہ ہم ذوالحلیفہ پہنچے تو اسماء بنت عمیس رضی اللہ عنہا نے بچہ جنا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”غسل کر اور کسی کپڑے سے لنگوٹ باندھ لے اور احرام باندھ لے۔“ رسول اللہ صلی اللہ علیہ وسلم نے مسجد میں نماز پڑھی اور قصواء (آپ صلی اللہ علیہ وسلم کی اونٹنی کا نام) پر سوار ہو گئے یہاں تک کہ جب آپ صلی اللہ علیہ وسلم بیداء کے برابر آئے تو آپ صلی اللہ علیہ وسلم نے توحیدی تلبیہ پکارا «لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك» ”حاضر ہوں، اے میرے اللہ! میں حاضر ہوں، تیرا کوئی شریک نہیں، میں حاضر ہوں، بلا شک سب تعریفیں اور انعامات تیرے ہیں۔ بادشاہت بھی تیری ہے، تیرا کوئی شریک نہیں۔“ یہاں تک کہ ہم بیت اللہ میں داخل ہوئے۔ رکن (اسود) کو آپ صلی اللہ علیہ وسلم نے بوسہ دیا، تین بار رمل کیا اور چار بار معمول کے مطابق چلے۔ پھر آپ صلی اللہ علیہ وسلم مقام ابراہیم پر آئے اور نماز پڑھی پھر رکن (حجر اسود) کی طرف واپس آئے اور اس کو بوسہ دیا۔ پھر مسجد الحرام کے دروازہ سے صفا کی طرف نکلے جب صفا کے نزدیک پہنچے تو یہ آیت پڑھی۔ ”تحقیق صفا اور مروہ اللہ تعالیٰ کی نشانیوں میں سے ہیں۔“ (پھر فرمایا) ”میں شروع کرتا ہوں (سعی کو) اس مقام سے کہ جہاں سے اللہ نے شروع کیا ہے۔“ پھر صفا پر چڑھے۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم نے بیت اللہ کو دیکھا۔ پھر قبلہ رخ ہوئے اور اللہ کی وحدانیت اور کبریائی بیان کی اور کہا ”اللہ کے سوا کوئی معبود نہیں وہ اکیلا ہے کوئی اس کا شریک نہیں۔ بادشاہی اور سب خوبیاں اسی کی ہیں اور وہ ہر چیز پر قادر ہے اللہ کے سوا کوئی معبود نہیں۔ اس نے اپنا وعدہ پورا کر دیا اور اپنے بندے کی مدد کی اور کفار کی جماعت کو اکیلے اسی نے شکست دی۔“ پھر اس کے درمیان تین بار دعا کی۔ پھر صفا سے اترے اور مروہ کی طرف گئے۔ یہاں تک کہ جب آپ صلی اللہ علیہ وسلم کے دونوں پاؤں وادی کے نشیب میں پڑے تو دوڑے یہاں تک کہ آپ صلی اللہ علیہ وسلم نشیب سے اوپر چڑھے اور مروہ کی طرف چلے۔ مروہ پر وہی کچھ کیا جو صفا پر کیا تھا۔ پھر جابر رضی اللہ عنہ نے ساری حدیث بیان کی جس میں یہ ہے کہ جب ترویہ کا دن (8 ذی الحج) ہوا تو لوگ منیٰ کی طرف متوجہ ہوئے اور نبی کریم صلی اللہ علیہ وسلم سوار تھے پھر وہاں ظہر، عصر، مغرب، عشاء اور صبح کی نماز پڑھی۔ پھر تھوڑی دیر ٹھہرے یہاں تک کہ سورج نکل آیا تو وہاں سے روانہ ہوئے اور مزدلفہ سے گزرتے ہوئے عرفات میں پہنچے تو خیمہ میں اترے جو آپ صلی اللہ علیہ وسلم کیلئے نمرہ میں لگایا گیا تھا۔ پھر جب سورج ڈھلنے لگا تو آپ صلی اللہ علیہ وسلم نے قصواء پر پالان رکھنے کا حکم دیا۔ آپ صلی اللہ علیہ وسلم سوار ہو کر وادی کے درمیان میں آئے اور لوگوں کو خطبہ دیا پھر اذان دلوائی پھر اقامت کہلوائی تو نماز ظہر ادا کی پھر اقامت کہلوائی تو عصر کی نماز پڑھی اور ان دونوں کے درمیان کوئی نماز نہ پڑھی۔ پھر سوار ہو کر ٹھہرنے کی جگہ پر پہنچے تو اپنی اونٹنی قصواء کا پیٹ پتھروں کی طرف کر دیا اور راہ چلنے والوں کو اپنے سامنے کر لیا اور اپنا رخ قبلہ کی جانب کر لیا۔ پھر آپ صلی اللہ علیہ وسلم اس وقت تک ٹھہرے رہے کہ سورج غروب ہونے لگا اور تھوڑی سی زردی ختم ہو گئی حتیٰ کہ سورج مکمل طور پر غروب ہو گیا پھر آپ صلی اللہ علیہ وسلم اسی حالت میں واپس ہوئے۔ آپ صلی اللہ علیہ وسلم نے قصواء کی باگ اتنی تنگ کر رکھی تھی کہ اس کا سر آپ صلی اللہ علیہ وسلم کے پالان کے اگلے ابھرے ہوئے حصے کو پہنچتا تھا اور آپ صلی اللہ علیہ وسلم اپنے داہنے ہاتھ سے اشارہ کرتے ہوئے فرماتے تھے ”اے لوگو! تسکین و اطمینان اختیار کرو“ اور جب بھی آپ صلی اللہ علیہ وسلم کسی ٹیلے پر آتے تو باگ تھوڑی سی ڈھیلی کر دیتے کہ وہ اوپر چڑھ جاتی یہاں تک کہ آپ صلی اللہ علیہ وسلم مزدلفہ تشریف لائے اور وہاں ایک اذان اور دو اقامت کے ساتھ مغرب اور عشاء کی نماز پڑھی اور دونوں کے درمیان کوئی نفلی نماز نہیں پڑھی۔ پھر لیٹ گئے۔ یہاں تک کہ صبح ہو گئی۔ جب صبح کا وقت ظاہر ہوا تو آپ صلی اللہ علیہ وسلم نے اذان اور اقامت سے فجر کی نماز پڑھی۔ پھر سوار ہو کر مشعر حرام پر آئے۔ پس آپ صلی اللہ علیہ وسلم قبلہ رو ہوئے دعا کی اور تکبیر و تہلیل کہتے رہے۔ آپ صلی اللہ علیہ وسلم وہاں اچھی طرح سفیدی ظاہر ہونے تک ٹھہرے رہے پھر سورج نکلنے سے پہلے واپس ہو کر وادی محسر کے نشیب میں آ گئے تو سواری کو کچھ تیز کر دیا۔ پھر درمیانی راستہ پر چلے جو جمرہ کبریٰ (بڑا شیطان) پر پہنچتا ہے پھر آپ صلی اللہ علیہ وسلم اس جمرہ پر آئے جو درخت کے پاس ہے تو اسے سات کنکریاں وادی کے نشیب سے ماریں، ہر کنکری کے ساتھ «الله اكبر» کہتے تھے، ان میں سے ہر کنکری خذف (لوبیے کے دانے) کے برابر تھی۔ پھر آپ صلی اللہ علیہ وسلم قربان گاہ کی طرف گئے اور وہاں قربانی کی پھر رسول اللہ صلی اللہ علیہ وسلم سوار ہوئے اور بیت اللہ کی طرف روانہ ہوئے۔ پھر مکہ میں ظہر کی نماز پڑھی۔ اسے مسلم نے تفصیل سے بیان کیا ہے۔  ",
    "english": " "
  },
  "takhreej": {
    "arabic": "1 ‏- وهي ناقته صلى الله عليه وسلم.‏
‏2 ‏- تحرف في " أ " إلى: " فاستقبله واستقبل القبلة ".‏
‏3 ‏- سقطت من الأصلين، واستدركتها من مسلم.‏
‏4 ‏- زاد مسلم: " قال مثل هذا ".‏
5 ‏- زاد مسلم: " إذا ". ‏
‏6 ‏- سقطت من الأصلين، واستدركتها من مسلم.‏
‏7 ‏- في الأصلين: " صعد "، والتصويب من مسلم.‏
‏8 ‏- كذا بالأصلين، وفي مسلم: " مشى حتى أتى المروة ".‏
‏9 ‏- موضع بجنب عرفات، وليس من عرفات.‏
‏10 ‏- أي: طريقهم الذي يسلكونه.‏
‏11 ‏- زاد مسلم: " من الحبال ".‏
‏12 ‏- أي: لم يصل نافلة.‏
‏13 ‏- كذا في الأصلين، وفي مسلم: " وصلى ".‏
‏14 ‏- تحرف في " أ " إلى: " حتى ".‏
‏15 ‏- كذا هو في مسلم، وفي الأصلين: " فدعا، وكبر، وهلل ".‏
‏16 ‏- صحيح.‏ رواه مسلم ( 1218 )‏ ولشيخنا العلامة محمد ناصر الدين الألباني ‏-حفظه الله‏- كتاب: " حجة النبي صلى الله عليه وسلم " ساق فيها حديث جابر هذا وزياداته من كتب السنة ونسقها أحسن تنسيق، والكتاب مطبوع عدة طبعات.‏ ",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
