{
  "hadithId": 132,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["1:2:4"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  "name": {
    "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { أَعْتَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-ذَاتَ لَيْلَةٍ بِالْعَشَاءِ, حَتَّى ذَهَبَ عَامَّةُ اَللَّيْلِ, ثُمَّ خَرَجَ, فَصَلَّى, وَقَالَ: \"إِنَّهُ لَوَقْتُهَا لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي\" } رَوَاهُ مُسْلِمٌ ",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے ایک شب نماز عشاء تاخیر سے پڑھی کہ رات کا اول حصہ زیادہ تر گزر گیا تھا۔ آپ صلی اللہ علیہ وسلم نماز کیلئے تشریف لائے اور نماز پڑھی اور فرمایا کہ ”اگر میری امت پر (یہ وقت) گراں نہ ہوتا تو میں نماز عشاء کا یہی وقت مقرر کرتا۔“ (مسلم) ",
    "english": "Narrated 'Aishah (RA): 'The Messenger of Allah (ﷺ) delayed the 'Isha' (Night) prayer one night until most of the night had passed. Then he came out and prayed, and said: \"This is indeed its [the 'Isha' prayer's] [preferred] time, were it not that I would cause hardship for my Ummah (nation).\"' Reported by Muslim."
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه مسلم (638)‏ (219)‏.‏ و \"أعتم\": أخرها حتى اشتدت عتمة الليل، وهي ظلمته. ويقصد به وقت نصف الليل الأول أو الثلث الأول منه. ",
    "urdu": "صحیح۔ اسے مسلم (638) (219) نے روایت کیا ہے۔ \"أعتم\" کا مطلب ہے: نماز کو اس وقت تک مؤخر کرنا جب رات کی تاریکی گہری ہو جائے، اور یہ رات کا پہلا نصف یا پہلا تہائی حصہ ہوتا ہے۔",
    "english": "Authentic (Sahih). Reported by Muslim (638) (219). 'A'tama' means: He delayed it until the darkness of the night intensified. This refers to the first half or the first third of the night."
  },
  "importantWords": [
    {
      "arabic": "أَعْتَمَ",
      "english": "Delayed (Isha)",
      "urdu": "تاخیر کی"
    },
    {
      "arabic": "بِالْعَشَاءِ",
      "english": "The Night Prayer ('Isha)",
      "urdu": "عشاء کی نماز"
    },
    {
      "arabic": "عَامَّةُ اَللَّيْلِ",
      "english": "Most of the night",
      "urdu": "رات کا زیادہ حصہ"
    },
    {
      "arabic": "أَشُقَّ",
      "english": "I would cause hardship",
      "urdu": "میں مشقت ڈالوں"
    },
    {
      "arabic": "أُمَّتِي",
      "english": "My nation/community",
      "urdu": "میری امت"
    },
    {
      "arabic": "لَوَقْتُهَا",
      "english": "Indeed its time",
      "urdu": "یقیناً اس کا وقت ہے"
    },
    {
      "arabic": "ذَاتَ لَيْلَةٍ",
      "english": "One night",
      "urdu": "ایک رات"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ نماز عشاء کو رات کے پہلے تہائی یا نصف تک مؤخر کرنا افضل ترین وقت ہے، لیکن رسول اللہ ﷺ نے یہ وقت اپنی امت پر مشقت کے خوف سے معمول نہیں بنایا تاکہ لوگوں کو آسانی رہے۔",
    "english": "This Hadith illustrates that the preferred and most virtuous time for 'Isha' prayer is to delay it until the first third or half of the night, but the Messenger of Allah (ﷺ) refrained from making this the general rule out of fear of causing hardship to his Ummah."
  },
  "references": [
    {
      "arabic": "رواه مسلم (638)",
      "english": "Reported by Muslim (638)"
    },
    {
      "arabic": "رواه مسلم (219)",
      "english": "Reported by Muslim (219)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا",
        "english": "'Aishah (May Allah be pleased with her)"
      },
      "slug": "aishah-bint-abi-bakr"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-t1yM-l1hI",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عشاء کی تاخیر کی فضیلت",
        "english": "Virtue of Delaying 'Isha'"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "افضل ترین وقت",
              "english": "The Most Preferred Time"
            },
            "content": {
              "urdu": [
                "حدیث واضح کرتی ہے کہ نماز عشاء کا افضل ترین وقت رات کے پہلے تہائی یا نصف تک مؤخر کرنا ہے۔",
                "اس وقت میں نماز پڑھنے کا ثواب اور فضیلت عام وقت سے زیادہ ہے۔",
                "نبی اکرم ﷺ نے اس وقت کی فضیلت کو قولاً اور فعلاً بیان فرمایا۔"
              ],
              "english": [
                "The Hadith clearly indicates that the most virtuous time for 'Isha' prayer is to delay it until the first third or half of the night.",
                "The reward and virtue of praying at this specific time are greater than the usual time.",
                "The Prophet (ﷺ) explicitly stated this time's virtue both by his words and action."
              ]
            }
          },
          {
            "title": {
              "urdu": "تاخیر کی حکمت",
              "english": "Wisdom of the Delay"
            },
            "content": {
              "urdu": [
                "رات کا یہ حصہ سکون اور یکسوئی کا ہوتا ہے، جس میں نماز میں زیادہ خشوع و خضوع حاصل ہوتا ہے۔",
                "تاخیر سے نماز پڑھنا اس بات کا ثبوت ہے کہ بندہ دنیاوی مشاغل پر نماز کو ترجیح دیتا ہے۔",
                "یہ تاخیر لوگوں کو باجماعت نماز کی تیاری اور انتظار کے لیے وقت دیتی ہے۔"
              ],
              "english": [
                "This part of the night is characterized by tranquility and solitude, which facilitates greater humility (khushu') in prayer.",
                "Delaying the prayer proves that the servant prioritizes prayer over worldly preoccupations.",
                "This delay allows people time to prepare for and await the congregational prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "امت پر شفقت نبوی ﷺ",
        "english": "Prophetic Compassion for the Ummah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشقت سے بچاؤ",
              "english": "Preventing Hardship"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے اس افضل وقت کو عام معمول نہیں بنایا تاکہ امت پر مشقت نہ ہو۔",
                "اکثر لوگ دن بھر کے کام کاج کے بعد تھک جاتے ہیں اور جلدی آرام کی ضرورت ہوتی ہے۔",
                "یہ حدیث اسلام کے بنیادی اصول 'آسانی اور تخفیف' کو اجاگر کرتی ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) did not establish this preferred time as the regular practice to avoid burdening the Ummah.",
                "Most people are exhausted after a day's work and require rest early.",
                "This Hadith highlights the fundamental Islamic principle of 'ease and reduction of burden'."
              ]
            }
          },
          {
            "title": {
              "urdu": "اوسط وقت اختیار کرنا",
              "english": "Adopting the Middle Time"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا معمول یہ تھا کہ مشقت سے بچنے کے لیے عشاء کو بہت زیادہ تاخیر نہیں کرتے تھے۔",
                "عام حالات میں عشاء کو اول وقت کے بعد اور افضل وقت سے پہلے ادا کرنا زیادہ مناسب ہے۔",
                "مسلمان کو اپنی عبادت کو آسان بنانا چاہیے تاکہ اس پر ہمیشہ قائم رہ سکے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) normal practice was not to delay 'Isha' too much to avoid hardship.",
                "In general situations, praying 'Isha' after the initial time but before the most preferred time is more appropriate.",
                "A Muslim should make their acts of worship easy so they can maintain consistency in them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اصول",
        "english": "Juristic Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اوقات کی وسعت",
              "english": "Leniency in Time (Wus'a)"
            },
            "content": {
              "urdu": [
                "یہ حدیث بتاتی ہے کہ عشاء کا وقت رات کے نصف سے پہلے تک رہتا ہے اور اس میں وسعت ہے۔",
                "تاہم، سنت کی پیروی میں تاخیر کی اجازت ہے مگر رات کا آخری حصہ مستحب نہیں ہے۔",
                "فقہاء نے یہ اصول اخذ کیا ہے کہ 'افضل العمل ما دام علی الامة لیس بمشقة' (وہ عمل افضل ہے جو امت پر مشقت نہ ڈالے)۔"
              ],
              "english": [
                "This Hadith shows that the time for 'Isha' extends until before midnight and has a degree of leniency.",
                "However, delaying it is permissible following the Sunnah, but the last part of the night is not recommended.",
                "Jurists derive the principle: 'The best deed is that which does not cause hardship to the Ummah.'"
              ]
            }
          },
          {
            "title": {
              "urdu": " جماعت کا حکم",
              "english": "Ruling on Congregation"
            },
            "content": {
              "urdu": [
                "اگرچہ تاخیر افضل ہے، لیکن اسے باجماعت نماز کے ترک یا فوت ہونے کا سبب نہیں بنانا چاہیے۔",
                "مساجد میں نماز عشاء کو عام طور پر جلدی ادا کیا جاتا ہے تاکہ لوگوں کی سہولت رہے۔",
                "ایک فرد کے لیے اکیلے تاخیر کرنا افضل ہے اگر اس سے جماعت فوت نہ ہو۔"
              ],
              "english": [
                "Although delay is virtuous, it should not lead to abandoning or missing the congregational prayer.",
                "In mosques, 'Isha' prayer is usually performed earlier for the convenience of the people.",
                "It is more virtuous for an individual to delay the prayer if it does not cause them to miss the congregation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تعلیمی اور تربیتی پہلو",
        "english": "Educational and Training Aspects"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "رسول اللہ ﷺ کی رحمت",
              "english": "The Mercy of the Messenger (ﷺ)"
            },
            "content": {
              "urdu": [
                "یہ حدیث نبی اکرم ﷺ کی اپنی امت پر غیر معمولی رحمت اور شفقت کو ظاہر کرتی ہے۔",
                "آپ ﷺ نے آسانی کو ترجیح دی تاکہ لوگ شوق سے عبادت پر قائم رہیں۔",
                "اس سے معلوم ہوتا ہے کہ دین اسلام آسانی اور خیر پر مبنی ہے۔"
              ],
              "english": [
                "This Hadith demonstrates the extraordinary mercy and compassion of the Prophet (ﷺ) towards his Ummah.",
                "He prioritized ease so that people would remain constant in their worship with enthusiasm.",
                "It teaches that the religion of Islam is founded upon ease and goodness."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی اہمیت",
              "english": "The Importance of Prayer"
            },
            "content": {
              "urdu": [
                "عائشہؓ کا اس وقت کو نوٹ کرنا نماز کی اہمیت اور اس کے اوقات کی حفاظت کو ظاہر کرتا ہے۔",
                "نماز ہر مسلمان پر فرض ہے، اور اسے وقت پر ادا کرنا ایمان کی علامت ہے۔",
                "مسلمان کو ہمیشہ افضل وقت کا علم رکھنا چاہیے اور اسے اپنانے کی کوشش کرنی چاہیے۔"
              ],
              "english": [
                "Aishah's (RA) observation of the time indicates the importance of prayer and safeguarding its times.",
                "Prayer is obligatory upon every Muslim, and performing it on time is a sign of faith.",
                "A Muslim should always know the preferred time and strive to adopt it."
              ]
            }
          }
        ]
      }
    }
  ]
}
