{
  "hadithId": 140,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["1:2:12"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَفْضَلُ اَلْأَعْمَالِ اَلصَّلَاةُ فِي أَوَّلِ وَقْتِهَا } رَوَاهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ.‏ وَصَحَّحَاهُ  وَأَصْلُهُ فِي \"اَلصَّحِيحَيْنِ\" ",
    "urdu": "سیدنا ابن مسعود رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اول وقت میں نماز پڑھنا سب اعمال سے افضل ہے۔“ اسے ترمذی اور حاکم نے روایت کیا ہے اور دونوں نے اسے صحیح قرار دیا ہے۔ اس حدیث کی اصل بخاری و مسلم میں موجود ہے۔ ",
    "english": "Narrated Ibn Mas'ūd (RA): The Messenger of Allah (ﷺ) said: 'The best of deeds is the prayer performed at the beginning of its time.' Reported by At-Tirmidhī and Al-Ḥākim, and they both graded it as Sahih (authentic). The origin of this narration is found in Al-Ṣaḥīḥayn (Al-Bukhārī and Muslim)."
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه الترمذي (173)‏، والحاكم (188)‏ واللفظ للحاكم.‏ والأصل في الصحيحين: أن ابن مسعود سأل النبي صلى الله عليه وسلم: \"أي العمل أحب إلى الله؟\" قال: \"الصلاة على وقتها\".‏ (البخاري: 527، مسلم: 85).‏ ",
    "urdu": "صحیح۔ اسے ترمذی (173) اور حاکم (188) نے روایت کیا ہے، اور یہ الفاظ حاکم کے ہیں۔ اس حدیث کی اصل صحیحین میں یوں موجود ہے کہ ابن مسعود رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے پوچھا: ”اللہ کو کون سا عمل سب سے زیادہ محبوب ہے؟“ آپ نے فرمایا: ”نماز کو اس کے وقت پر ادا کرنا۔“ (بخاری: 527، مسلم: 85)۔",
    "english": "Authentic (Sahih). Reported by At-Tirmidhī (173) and Al-Ḥākim (188), and the wording here is from Al-Ḥākim. The origin in the two Ṣaḥīḥ collections is: Ibn Mas'ūd asked the Prophet (ﷺ): 'Which deed is most beloved to Allah?' He replied: 'Prayer performed on its time.' (Al-Bukhārī: 527, Muslim: 85)."
  },
  "importantWords": [
    {
      "arabic": "أَفْضَلُ اَلْأَعْمَالِ",
      "english": "The best of deeds",
      "urdu": "سب سے افضل اعمال"
    },
    {
      "arabic": "اَلصَّلَاةُ",
      "english": "The Prayer",
      "urdu": "نماز"
    },
    {
      "arabic": "فِي أَوَّلِ وَقْتِهَا",
      "english": "At the beginning of its time",
      "urdu": "اس کے اول وقت میں"
    },
    {
      "arabic": "أَحَبُّ إِلَى اَللَّهِ",
      "english": "Most beloved to Allah",
      "urdu": "اللہ کو سب سے زیادہ محبوب"
    },
    {
      "arabic": "وَقْتِهَا",
      "english": "Its time",
      "urdu": "اس کا وقت"
    },
    {
      "arabic": "أَصْلُهُ",
      "english": "Its origin/basis",
      "urdu": "اس کی اصل"
    },
    {
      "arabic": "صَحَّحَاهُ",
      "english": "They both graded it as Sahih",
      "urdu": "دونوں نے صحیح قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ اللہ تعالیٰ کے نزدیک سب سے زیادہ افضل اور محبوب عمل نماز کو اس کے وقت کے آغاز میں ادا کرنا ہے۔ یہ حکم وقت کی قدر، اللہ کے حکم کی تعمیل میں تیزی اور دیگر اعمال پر نماز کی فوقیت کو ظاہر کرتا ہے۔",
    "english": "This Hadith states that the most virtuous and beloved deed to Allah is performing the prayer immediately at the beginning of its prescribed time. This emphasizes the value of time, prompt obedience to Allah's command, and the superiority of prayer over other deeds."
  },
  "references": [
    {
      "arabic": "رواه الترمذي (173)",
      "english": "Reported by At-Tirmidhī (173)"
    },
    {
      "arabic": "رواه الحاكم (188)",
      "english": "Reported by Al-Ḥākim (188)"
    },
    {
      "arabic": "أصل الحديث في البخاري (527)",
      "english": "Origin in Al-Bukhārī (527)"
    },
    {
      "arabic": "أصل الحديث في مسلم (85)",
      "english": "Origin in Muslim (85)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن مسعود",
        "english": "Abdullah ibn Mas'ūd"
      },
      "slug": "abdullah-ibn-masood"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نماز کی فضیلت اور درجہ",
        "english": "Virtue and Status of Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اعمال میں سب سے افضل",
              "english": "The Best Among Deeds"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے اس حدیث میں نماز کو تمام اعمال میں سب سے زیادہ افضل قرار دیا ہے۔",
                "صحیحین کی روایت میں 'الصلاة على وقتها' (نماز کو اس کے وقت پر) کا ذکر ہے، جس میں اول وقت شامل ہے۔",
                "اول وقت میں نماز ادا کرنا بندے کی دین پر مضبوطی اور اللہ کے حکم کی تعمیل میں چستی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) declared prayer to be the most virtuous of all deeds in this Hadith.",
                "The narration in the Ṣaḥīḥayn mentions 'Prayer performed on its time,' which encompasses the excellence of the earliest time.",
                "Praying at the beginning of its time shows the servant's steadfastness in religion and eagerness to obey Allah's command."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز اور دیگر اعمال",
              "english": "Prayer Versus Other Deeds"
            },
            "content": {
              "urdu": [
                "ایک اور روایت میں ابن مسعودؓ نے جہاد اور والدین کے ساتھ حسن سلوک کو بھی پوچھا تھا، لیکن نماز کو مقدم رکھا گیا۔",
                "یہ نماز کے مرکزی کردار کی نشاندہی کرتا ہے، جو اسلام کا ستون اور بنیادی فریضہ ہے۔",
                "اگرچہ تمام نیک اعمال اہم ہیں، لیکن نماز وقت کی پابندی اور فرض کی ادائیگی میں اولیت رکھتی ہے۔"
              ],
              "english": [
                "In another narration, Ibn Mas'ūd also asked about Jihād and treating parents kindly, but prayer was given precedence.",
                "This indicates the central role of prayer, which is the pillar of Islam and a fundamental obligation.",
                "Although all good deeds are important, prayer holds primacy in terms of adherence to time and fulfilling the duty."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اول وقت میں نماز کی حکمت",
        "english": "Wisdom of Praying in the Early Time"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی قدر اور اخلاص",
              "english": "Valuing Time and Sincerity"
            },
            "content": {
              "urdu": [
                "اول وقت میں نماز پڑھنا دنیاوی کاموں پر اللہ کے حق کو ترجیح دینے کا عملی ثبوت ہے۔",
                "اس میں یہ حکمت پوشیدہ ہے کہ شیطان کے وسوسوں سے بچتے ہوئے فوراً حکم کی تعمیل کی جائے۔",
                "جس قدر جلدی بندہ اللہ کی پکار (اذان) پر لبیک کہتا ہے، اسی قدر اخلاص میں اضافہ ہوتا ہے۔"
              ],
              "english": [
                "Praying at the earliest time is practical proof of prioritizing Allah's right over worldly activities.",
                "The wisdom embedded is to hasten to obey the command, thereby avoiding the whispers of Satan.",
                "The quicker the servant responds to Allah's call (Adhān), the greater the sincerity achieved."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کا بہتر معیار",
              "english": "Better Quality of Prayer"
            },
            "content": {
              "urdu": [
                "زیادہ تر نمازوں (جیسے مغرب اور جمعہ) کے لیے اول وقت ہی افضل ہوتا ہے، سوائے بعض مستثنیٰ صورتوں کے۔",
                "اول وقت میں نماز ادا کرنے سے دل کی یکسوئی اور خشوع زیادہ بہتر طور پر حاصل ہوتا ہے۔",
                "تاخیر میں سستی اور کاہلی کا عنصر شامل ہو سکتا ہے، جو خشوع کو کم کرتا ہے۔"
              ],
              "english": [
                "For most prayers (like Maghrib and Jumu'ah), the earliest time is the most preferred, except in certain exceptional cases.",
                "Performing prayer in the early time allows for better focus and reverence (Khushu') of the heart.",
                "Delaying can introduce elements of laziness and heedlessness, which diminish the quality of Khushu'."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اطلاق",
        "english": "Juristic and Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مستثنیٰ صورتیں",
              "english": "Exceptional Cases"
            },
            "content": {
              "urdu": [
                "ظہر کی نماز گرمی میں (ابراد)، اور عشاء کی نماز کا مؤخر کرنا (اعتام) اس اصول سے مستثنیٰ ہیں۔",
                "ان مستثنیٰ اوقات میں افضل یہ ہے کہ اول وقت کی بجائے مستحب وقت پر نماز ادا کی جائے۔",
                "تاہم، بنیادی اصول ہر نماز کے لیے اول وقت میں ادا کرنے کا ہی ہے۔"
              ],
              "english": [
                "Zuhr prayer in intense heat (Ibrād) and delaying the 'Isha' prayer (I'tām) are exceptions to this principle.",
                "In these exceptions, it is preferred to perform the prayer at the recommended time rather than the absolute earliest time.",
                "However, the fundamental rule remains to perform every prayer in the earliest part of its window."
              ]
            }
          },
          {
            "title": {
              "urdu": "جماعت کے لیے ترجیح",
              "english": "Priority for Congregation"
            },
            "content": {
              "urdu": [
                "اگر اول وقت میں نماز پڑھنے سے جماعت فوت ہو رہی ہو تو جماعت کو اولیت دی جائے گی، کیونکہ اس کا اجر زیادہ ہے۔",
                "مساجد میں باجماعت نماز کا وقت مقرر کرنا عام مسلمانوں کی آسانی اور اجتماعیت کے لیے ضروری ہے۔",
                "یہ حدیث انفرادی عبادت میں اول وقت کی فضیلت کو زیادہ واضح کرتی ہے۔"
              ],
              "english": [
                "If praying at the earliest time causes one to miss the congregation, the congregation is prioritized due to its greater reward.",
                "Setting fixed times for congregational prayer in mosques is essential for the ease and unity of the general Muslim populace.",
                "This Hadith emphasizes the virtue of the early time in individual worship more clearly."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی فوائد",
        "english": "Educational Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نظم و ضبط اور ذمہ داری",
              "english": "Discipline and Responsibility"
            },
            "content": {
              "urdu": [
                "اول وقت میں نماز کی ادائیگی مسلمان کی زندگی میں نظم و ضبط اور وقت کی پابندی پیدا کرتی ہے۔",
                "یہ ہمیں سکھاتی ہے کہ ذمہ داریوں کی ادائیگی میں تاخیر نہیں کرنی چاہیے، بالخصوص اللہ کے حقوق میں۔",
                "یہ عمل فرد کو روحانی اور اخلاقی طور پر مضبوط بناتا ہے۔"
              ],
              "english": [
                "Performing prayer in the early time develops discipline and punctuality in a Muslim's life.",
                "It teaches us not to delay fulfilling responsibilities, especially the rights due to Allah.",
                "This practice strengthens the individual spiritually and ethically."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا منہج",
              "english": "The Prophetic Methodology"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا جواب (الصلاة على وقتها) تعلیم و تربیت کے اہم اصول کو واضح کرتا ہے۔",
                "اہمیت کے لحاظ سے تین چیزوں (نماز، والدین کی خدمت، جہاد) کا ذکر تعلیم و تربیت کا حصہ ہے۔",
                "اس حدیث پر عمل ہمیں سنتِ نبوی ﷺ کے قریب لے جاتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) response ('Prayer on its time') illustrates an important principle of teaching and training.",
                "The mention of three important deeds (prayer, parental kindness, Jihād) is part of educational methodology.",
                "Acting upon this Hadith brings us closer to the Prophetic Sunnah."
              ]
            }
          }
        ]
      }
    }
  ]
}
