{
  "hadithId": 136,
  "hadithNo": 8,
  "hadithReferences": {
    "sunnah.com": ["1:2:8"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  "name": {
    "arabic": "وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { لَا صَلَاةَ بَعْدَ اَلصُّبْحِ حَتَّى تَطْلُعَ اَلشَّمْسُ وَلَا صَلَاةَ بَعْدَ اَلْعَصْرِ حَتَّى تَغِيبَ اَلشَّمْسُ } مُتَّفَقٌ عَلَيْهِ.‏ وَلَفْظُ مُسْلِمٍ: { لَا صَلَاةَ بَعْدَ صَلَاةِ اَلْفَجْرِ } وَلَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ: { ثَلَاثُ سَاعَاتٍ كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَنْهَانَا أَنْ نُصَلِّي فِيهِنَّ, وَأَنْ نَقْبُرَ فِيهِنَّ مَوْتَانَا: حِينَ تَطْلُعُ اَلشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ, وَحِينَ يَقُومُ قَائِمُ اَلظَّهِيرَةِ حَتَّى تَزُولَ اَلشَّمْسُ, وَحِينَ تَتَضَيَّفُ اَلشَّمْسُ لِلْغُرُوبِ } وَالْحُكْمُ اَلثَّانِي عِنْدَ \"اَلشَّافِعِيِّ\" مِنْ: حَدِيثِ أَبِي هُرَيْرَةَ بِسَنَدٍ ضَعِيفٍ.‏ وَزَادَ: { إِلَّا يَوْمَ اَلْجُمْعَةِ } وَكَذَا لِأَبِي دَاوُدَ: عَنْ أَبِي قَتَادَةَ نَحْوُهُ ",
    "urdu": " سیدنا ابوسعید خدری رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ ارشاد فرماتے سنا ہے کہ ”صبح کی نماز ادا کر لینے کے بعد طلوع آفتاب تک کوئی نماز (جائز) نہیں اور اسی طرح نماز عصر ادا کر چکنے کے بعد غروب آفتاب تک کوئی دوسری نماز (جائز) نہیں۔“ (بخاری و مسلم) اور مسلم کے الفاظ ہیں ”کوئی نماز، نماز فجر کے بعد نہیں۔“ اور مسلم میں عقبہ بن عامر رضی اللہ عنہ سے مروی ہے کہ تین اوقات ایسے ہیں جن میں نماز پڑھنے اور میت کی تدفین سے رسول اللہ صلی اللہ علیہ وسلم ہمیں منع فرمایا کرتے تھے۔ اول یہ کہ جب آفتاب طلوع ہو رہا ہو تاآنکہ وہ بلند ہو جائے۔ دوم جب سورج نصف آسمان پر ہو تاوقتیکہ وہ ڈھل نہ جائے اور سوم جس وقت سورج غروب ہونا شروع ہو۔ دوسرا حکم (یعنی نصف النہار کے وقت نماز کی ادائیگی ممنوع ہونا) امام شافعی رحمہ اللہ نے سیدنا ابوہریرہ رضی اللہ عنہ سے ضعیف سند سے روایت کیا ہے، مگر اس میں «إلا يوم الجمعة» کے الفاظ زیادہ ہیں۔ (یعنی نصف النہار کے وقت نماز نہ پڑھو مگر جمعہ کے روز پڑھ سکتے ہو) اور ابوداؤد نے بھی سیدنا ابوقتادہ رضی اللہ عنہ سے سیدنا ابوہریرہ رضی اللہ عنہ کی مانند روایت نقل کی ہے (جس میں جمعہ کے دن کا استثنا ہے)",
    "english": "Narrated Abu Sa'id Al-Khudri (RA): I heard the Messenger of Allah (ﷺ) saying: 'There is no prayer after the Fajr prayer until the sun rises, and there is no prayer after the 'Asr prayer until the sun sets.' [Agreed upon (Al-Bukhari and Muslim)]. And the wording of Muslim is: 'There is no prayer after the Fajr prayer.' And in Muslim, narrated from 'Uqbah ibn 'Amir: 'There are three times when the Messenger of Allah (ﷺ) used to forbid us from praying in them, and from burying our dead in them: (1) When the sun is rising brightly until it is high, (2) when the shadow is directly beneath something (i.e., the sun is at its zenith) until the sun declines, and (3) when the sun starts to approach its setting.' The second ruling [prohibition at noon] is reported by Ash-Shafi'i from Abu Hurayrah with a weak chain, adding: 'Except on Friday.' And likewise, for Abu Dawud, from Abu Qatadah, similar to it."
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (586)‏، ومسلم (827)‏ وفي لفظ البخاري \"ترتفع\" بدل \"تطلع\".‏ وأن لفظ مسلم فعدا عما ذكره الحافظ فقد وقع عنده تقديم النهي عن الصلاة بعد العصر على النهي بعد صلاة الفجر.‏ وعنده أيضا \"تغرب\" بدل \"تغيب\".‏ ‏2 ‏- في مسلم: \"تميل\" .‏ ‏3 ‏- في مسلم: \"تتضيف\".‏ وهي بمعنى \"تميل\" .‏ ‏4 ‏- صحيح.‏ رواه مسلم (831)‏.‏ و \"قائم الظهيرة\": أي قيام الشمس وقت الزوال، وذلك عند بلوغها وسط السماء فإنها عند ذلك يبطئ حركتها.‏ ضعيف جدا.‏ رواه الشافعي في \"المسند\" (139 /408)‏ عن أبي هريرة؛ أن النبي صلى الله عليه وسلم نهى عن الصلاة نصف النهار، حتى تزول الشمس إلا يوم الجمعة.‏ قلت: وفي إسناده متروكان.‏ ضعيف.‏ رواه أبو داود (1083)‏ عن أبي قتادة، عن النبي صلى الله عليه وسلم؛ أنه كره الصلاة نصف النهار إلا يوم الجمعة، وقال: \"إن جهنم تسجر إلا يوم الجمعة\".‏ قلت: وفي سنده ضعف وانقطاع.‏ وأما عن الصلاة نصف النهار، فقد قال ابن القيم في \"الزاد\" (1/380)‏: \"اختلف الناس في كراهة الصلاة نصف النهار على ثلاثة أقوال.‏ أحدها: أنه ليس وقت كراهة بحال، وهو مذهب مالك.‏ الثاني: أنه وقت كراهة في يوم الجمعة وغيرها، وهو مذهب أبي حنيفة والمشهور من مذهب أحمد.‏ الثالث: أنه وقت كراهة إلا يوم الجمعة، فليس بوقت كراهة، وهذا مذهب الشافعي\".‏ ا.‏ هـ.‏ قلت: ومذهب الشافعي هو أعدل المذاهب، وهو الذي تدل عليه الأحاديث الصحيحة.‏",
    "urdu": "صحیح۔ اسے بخاری (586) اور مسلم (827) نے روایت کیا ہے۔ بخاری کی روایت میں 'ترتفع' (بلند ہو) کا لفظ 'تطلع' (طلوع ہو) کی جگہ آیا ہے۔ مسلم کی روایت میں جو حافظ ابن حجر نے ذکر کیا، اس کے علاوہ عصر کے بعد کی نماز کی ممانعت کو فجر کے بعد کی نماز کی ممانعت پر مقدم کیا گیا ہے، اور ان کے ہاں 'تغرب' (غروب ہو) کی جگہ 'تغيب' (غائب ہو) بھی ہے۔ مسلم میں ہے: 'أو أن'۔ مسلم میں: 'تمیل' (مائل ہو جائے)۔ مسلم میں: 'تتضيف' (مائل ہو جائے)، اور اس کا معنی 'تمیل' ہی ہے۔ صحیح۔ اسے مسلم (831) نے روایت کیا ہے۔ \"قائم الظهيرة\" (نصف النہار کا قیام): یعنی سورج کا زوال کے وقت ٹھہرنا، جب وہ آسمان کے وسط میں پہنچ کر اپنی حرکت میں سست ہو جاتا ہے۔ ضعیف جداً۔ اسے شافعی نے 'المسند' (139/408) میں ابوہریرہ سے روایت کیا ہے کہ نبی صلی اللہ علیہ وسلم نے نصف النہار کے وقت نماز سے منع فرمایا، حتی کہ سورج ڈھل جائے، سوائے جمعہ کے دن کے۔ میں کہتا ہوں: اس کی سند میں دو متروک راوی ہیں۔ ضعیف۔ اسے ابوداؤد (1083) نے ابوقتادہ سے روایت کیا ہے کہ نبی صلی اللہ علیہ وسلم نے نصف النہار میں نماز کو ناپسند فرمایا، سوائے جمعہ کے دن کے، اور فرمایا: \"بیشک جہنم جمعہ کے دن کے علاوہ دہکائی جاتی ہے۔\" میں کہتا ہوں: اس کی سند میں ضعف اور انقطاع ہے۔ نصف النہار میں نماز کے بارے میں ابن قیم نے 'الزاد' (1/380) میں کہا: \"لوگوں نے نصف النہار میں نماز کی کراہت کے بارے میں تین اقوال اختیار کیے ہیں۔ اول: وہ کسی بھی حال میں کراہت کا وقت نہیں ہے، اور یہ امام مالک کا مذہب ہے۔ دوم: یہ جمعہ اور دیگر دنوں میں کراہت کا وقت ہے، یہ امام ابوحنیفہ اور امام احمد کے مشہور مذہب ہے۔ سوم: یہ کراہت کا وقت ہے سوائے جمعہ کے دن کے، یہ امام شافعی کا مذہب ہے۔\" میں کہتا ہوں: امام شافعی کا مذہب سب سے معتدل ہے، اور یہی صحیح احادیث سے ثابت ہوتا ہے۔",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (586) and Muslim (827). In Al-Bukhari's wording, 'tartafe' (rises high) is used instead of 'tatlu' (rises). In Muslim's narration, in addition to what Al-Hafiz mentioned, the prohibition of prayer after 'Asr precedes the prohibition after Fajr. And Muslim also uses 'taghib' (disappears) instead of 'taghrub' (sets). In Muslim: 'aw an' (or that). In Muslim: 'tamīl' (inclines). In Muslim: 'tatadayyaf' (inclines), which has the same meaning as 'tamīl'. Authentic (Sahih). Reported by Muslim (831). 'Qā'im Az-Zahīrah' (standing upright at noon) refers to the sun standing still at the zenith time, when its movement slows down as it reaches the center of the sky. Very Weak (Da'if Jiddan). Reported by Ash-Shafi'i in 'Al-Musnad' (139/408) from Abu Hurayrah: that the Prophet (ﷺ) forbade prayer at midday until the sun declines, except on Friday. I say: There are two abandoned narrators in its chain. Weak (Da'if). Reported by Abu Dawud (1083) from Abu Qatadah, from the Prophet (ﷺ): that he disliked prayer at midday except on Friday, and said: 'Indeed, Hellfire is stoked except on Friday.' I say: There is weakness and discontinuity in its chain. Regarding prayer at midday, Ibn Al-Qayyim said in 'Az-Zād' (1/380): 'People have differed on the dislike of prayer at midday into three opinions. First: That it is not a time of dislike at all, which is the madhhab of Malik. Second: That it is a time of dislike on Friday and other days, which is the madhhab of Abu Hanifah and the famous opinion of Ahmad. Third: That it is a time of dislike except on Friday, so it is not a time of dislike, which is the madhhab of Ash-Shafi'i.' I say: The madhhab of Ash-Shafi'i is the most balanced and is indicated by the authentic Ahadith."
  },
  "importantWords": [
    {
      "arabic": "لَا صَلَاةَ",
      "english": "No prayer",
      "urdu": "کوئی نماز نہیں"
    },
    {
      "arabic": "بَعْدَ اَلصُّبْحِ",
      "english": "After Fajr (Dawn) prayer",
      "urdu": "فجر کی نماز کے بعد"
    },
    {
      "arabic": "تَغِيبَ اَلشَّمْسُ",
      "english": "The sun sets/disappears",
      "urdu": "سورج غروب ہو جائے"
    },
    {
      "arabic": "ثَلَاثُ سَاعَاتٍ",
      "english": "Three times/periods",
      "urdu": "تین اوقات"
    },
    {
      "arabic": "قَائِمُ اَلظَّهِيرَةِ",
      "english": "Standing upright at noon (Zenith)",
      "urdu": "نصف النہار کا قیام"
    },
    {
      "arabic": "تَزُولَ",
      "english": "Declines (from zenith)",
      "urdu": "ڈھل جائے"
    },
    {
      "arabic": "نَقْبُرَ فِيهِنَّ",
      "english": "To bury our dead in them",
      "urdu": "ان میں اپنی میت کو دفن کریں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث ان تین اوقات کو بیان کرتی ہے جن میں نوافل پڑھنا ممنوع ہے: نماز فجر کے بعد طلوع آفتاب تک، نماز عصر کے بعد غروب آفتاب تک، اور عین زوال کا وقت جب سورج نصف آسمان پر ہو کر ڈھلنے لگتا ہے۔ یہ ممانعت مشرکوں سے مشابہت اور جہنم کے دہکائے جانے کی حکمت پر مبنی ہے۔",
    "english": "This Hadith clarifies the three times when voluntary prayers are forbidden: after the Fajr prayer until sunrise, after the 'Asr prayer until sunset, and the brief period of noon (zenith) when the sun is directly overhead before declining. This prohibition is based on avoiding resemblance to polytheists and the time when Hellfire is stoked."
  },
  "references": [
    {
      "arabic": "رواه البخاري (586) عن أبي سعيد الخدري",
      "english": "Reported by Al-Bukhari (586) from Abu Sa'id Al-Khudri"
    },
    {
      "arabic": "رواه مسلم (827) عن أبي سعيد الخدري",
      "english": "Reported by Muslim (827) from Abu Sa'id Al-Khudri"
    },
    {
      "arabic": "رواه مسلم (831) عن عقبة بن عامر",
      "english": "Reported by Muslim (831) from 'Uqbah ibn 'Amir"
    },
    {
      "arabic": "رواه أبو داود (1083) عن أبي قتادة",
      "english": "Reported by Abu Dawud (1083) from Abu Qatadah"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abu Sa'id Al-Khudri"
      },
      "slug": "abu-said-al-khudri"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عقبة بن عامر",
        "english": "Uqbah ibn 'Amir"
      },
      "slug": "uqbah-ibn-amir"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=E-w5s2hT2y0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "ممنوع اوقاتِ نماز (مکروہ اوقات)",
        "english": "Prohibited Times for Prayer (Makrūh Times)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "پانچ ممنوع اوقات",
              "english": "The Five Prohibited Periods"
            },
            "content": {
              "urdu": [
                "نوافل کی ممانعت کے کل پانچ اوقات ہیں، جن میں سے دو کا تعلق فرض نماز سے اور تین کا سورج سے ہے۔",
                "اول: فجر کی فرض نماز کے بعد سے طلوع آفتاب اور اس کے بلند ہونے تک (تقریباً ایک نیزے کی بلندی تک)۔",
                "دوم: عصر کی فرض نماز کے بعد سے غروب آفتاب تک (جب سورج زرد پڑ جائے)۔"
              ],
              "english": [
                "There are five prohibited periods for voluntary prayers, two related to obligatory prayers and three related to the sun's position.",
                "First: After the obligatory Fajr prayer until the sun rises and becomes high (about the height of a spear).",
                "Second: After the obligatory 'Asr prayer until the sun sets (when the sun turns yellow/starts approaching sunset)."
              ]
            }
          },
          {
            "title": {
              "urdu": "تین متعلقہ بہ سورج اوقات",
              "english": "Three Sun-Related Periods"
            },
            "content": {
              "urdu": [
                "تین اوقات جو کسی فرض نماز کی ادائیگی سے مشروط نہیں: طلوع آفتاب کے وقت، زوال کے وقت، اور غروب آفتاب کے وقت۔",
                "زوال کا وقت وہ ہے جب سورج ٹھیک نصف آسمان پر ہو اور سائے کم سے کم ہو کر ساکن ہو جائیں۔",
                "ان اوقات میں نماز کی ممانعت اس لیے ہے کہ یہ مشرکین کے سورج کو سجدہ کرنے کے اوقات ہیں۔"
              ],
              "english": [
                "Three times not conditional on an obligatory prayer: at the time of sunrise, at the time of zenith, and at the time of sunset.",
                "The zenith time is when the sun is exactly at midday and shadows are minimal and stationary.",
                "The prohibition is due to avoiding resemblance to the polytheists who worship the sun at these times."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ممانعت کی حکمتیں",
        "english": "Wisdoms Behind the Prohibition"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشرکوں سے مشابہت سے اجتناب",
              "english": "Avoiding Resemblance to Polytheists"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے سختی سے ان اوقات میں نماز پڑھنے سے منع فرمایا جہاں سورج پرست سجدہ کرتے ہیں۔",
                "مقصد یہ ہے کہ مسلمان کی عبادت ہر حال میں توحید پر قائم رہے اور شرک کا کوئی شائبہ نہ ہو۔",
                "یہ حکم دین اسلام میں مکمل خلوص اور شرک سے بیزاری کو یقینی بناتا ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) strictly forbade praying during the times when sun-worshippers prostrate to the sun.",
                "The aim is to ensure the Muslim's worship is always based on pure monotheism (Tawhīd) and free from any hint of polytheism (Shirk).",
                "This ruling ensures complete sincerity and detachment from Shirk in the religion of Islam."
              ]
            }
          },
          {
            "title": {
              "urdu": "جہنم کا دہکایا جانا",
              "english": "The Stoking of Hellfire"
            },
            "content": {
              "urdu": [
                "حدیث ابوقتادہ کے مطابق، نصف النہار میں جہنم کو دہکایا جاتا ہے، سوائے جمعہ کے دن کے۔",
                "اس وقت نماز ادا کرنے سے خوف اور مشقت بڑھ جاتی ہے، اس لیے اللہ نے اپنے بندوں کو آسانیاں دیں۔",
                "یہ غیبی حکمتیں ہیں جو ہمیں آخرت اور جہنم کی آگ سے باخبر رکھتی ہیں۔"
              ],
              "english": [
                "According to Abu Qatadah's Hadith, Hellfire is stoked at midday, except on Friday.",
                "Praying at this time increases fear and hardship, so Allah granted ease to His servants.",
                "These are unseen wisdoms that keep us mindful of the Hereafter and the Fire of Hell."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ممنوع اوقات میں دفن اور نماز کی نوعیت",
        "english": "Burial and Type of Prayer in Prohibited Times"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تدفین کی ممانعت",
              "english": "Prohibition of Burial"
            },
            "content": {
              "urdu": [
                "عقبہ بن عامرؓ کی حدیث میں ان تین اوقات میں میت کی تدفین سے بھی منع کیا گیا ہے۔",
                "یہ ممانعت غالباً نماز کی ممانعت سے منسلک ہے تاکہ تدفین کے بعد نماز جنازہ کی ادائیگی میں کراہت نہ ہو۔",
                "علماء نے ضروری تدفین کو جائز قرار دیا ہے، ممانعت صرف بلا وجہ تاخیر پر ہے۔"
              ],
              "english": [
                "'Uqbah ibn 'Amir's Hadith also forbids burying the dead during these three times.",
                "This prohibition is likely linked to the prayer prohibition to avoid Makrūh time for the funeral prayer.",
                "Scholars have permitted necessary burial, the prohibition applies only to unnecessary delay."
              ]
            }
          },
          {
            "title": {
              "urdu": "فرض یا نفل",
              "english": "Obligatory or Voluntary"
            },
            "content": {
              "urdu": [
                "اس ممانعت کا اطلاق عام طور پر مطلق نوافل (وہ نفل جن کا کوئی سبب نہ ہو) پر ہوتا ہے۔",
                "فرض نمازیں اور وہ نوافل جن کا کوئی سبب ہو (جیسے تحیۃ الوضوء یا تحیۃ المسجد)، ان کے بارے میں فقہاء میں اختلاف ہے۔",
                "امام شافعی کے نزدیک ذی سبب نوافل ان اوقات میں جائز ہیں، جبکہ احناف کے نزدیک ممنوع ہیں۔"
              ],
              "english": [
                "This prohibition generally applies to absolute voluntary prayers (those without a specific reason).",
                "There is scholarly difference regarding obligatory prayers and voluntary prayers with a reason (like Tahiyyat Al-Wudu' or Tahiyyat Al-Masjid).",
                "According to Imam Ash-Shafi'i, voluntary prayers with a reason are permissible in these times, while the Hanafis forbid them."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جمعہ کے دن کا استثنا",
        "english": "Exception on Friday"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نصف النہار کا استثنا",
              "english": "Exclusion of Midday"
            },
            "content": {
              "urdu": [
                "بعض روایات میں یہ اضافہ ہے کہ جمعہ کے دن نصف النہار میں نماز کی ممانعت نہیں ہے۔",
                "اس کی حکمت یہ ہے کہ جمعہ کا دن خصوصی طور پر عبادت اور خیر و برکت کا دن ہے۔",
                "مسلمانوں کو جمعہ کے لیے جلد از جلد تیاری کرنے اور مسجد میں آ کر نوافل پڑھنے کی ترغیب دی جاتی ہے۔"
              ],
              "english": [
                "Some narrations add the exception that prayer is not prohibited at midday on Friday.",
                "The wisdom behind this is that Friday is a special day for worship, goodness, and blessings.",
                "Muslims are encouraged to prepare early for Jumu'ah and perform voluntary prayers upon entering the mosque."
              ]
            }
          },
          {
            "title": {
              "urdu": "جمہور فقہاء کا موقف",
              "english": "Stance of the Majority Jurists"
            },
            "content": {
              "urdu": [
                "اگرچہ استثنیٰ والی روایات سنداً ضعیف ہیں، لیکن امام شافعی نے اس پر عمل کیا ہے۔",
                "امام مالک کے نزدیک ویسے ہی نصف النہار ممنوع نہیں، جبکہ دیگر کے نزدیک جمعہ کو استثنا ہے۔",
                "احتیاط کا پہلو یہ ہے کہ جمعہ کے دن کے علاوہ نصف النہار میں نفل سے پرہیز کیا جائے۔"
              ],
              "english": [
                "Although the narrations granting the exception are weak in chain, Imam Ash-Shafi'i acted upon them.",
                "Imam Malik does not prohibit midday prayer at all, while others allow the exception for Friday.",
                "The cautious approach is to refrain from voluntary prayers at midday, except perhaps on Friday due to the specific encouragement."
              ]
            }
          }
        ]
      }
    }
  ]
}
