{
  "hadithId": 131,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["1:2:3"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب مواقيت الصلاة",
    "babId": 11
  },
  "name": {
    "arabic": "وَعَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: { كُنَّا نُصَلِّي اَلْمَغْرِبَ مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَيَنْصَرِفُ أَحَدُنَا وَإِنَّهُ لَيُبْصِرُ مَوَاقِعَ نَبْلِهِ } مُتَّفَقٌ عَلَيْهِ ",
    "urdu": "سیدنا رافع بن خدیج رضی اللہ عنہ روایت کرتے ہیں کہ ہم نماز مغرب نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھتے پھر ہم میں سے کوئی نماز سے فارغ ہو کر واپس ہوتا (تو اتنی روشنی ابھی باقی ہوتی تھی) کہ تیر کے گرنے کی جگہ دیکھ لیتا۔ (بخاری و مسلم)  ",
    "english": "Narrated Rafi' ibn Khadij: 'We used to pray Maghrib with the Prophet (ﷺ), and then one of us would depart while he could still see the places where his arrows fell.' [Agreed upon (Al-Bukhari and Muslim)]"
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه البخاري (559)‏، ومسلم (637)‏.‏ وقال الحافظ في \"الفتح\" (2 /41)‏: \"ومقتضاه المبادرة بالمغرب في أول وقتها، بحيث أن الفراغ منها يقع والضوء باق\".‏ ",
    "urdu": "صحیح۔ اسے بخاری (559) اور مسلم (637) نے روایت کیا ہے۔ حافظ ابن حجر عسقلانی رحمہ اللہ نے \"فتح الباری\" (2/41) میں فرمایا: \"اس حدیث کا تقاضا یہ ہے کہ نماز مغرب کو اس کے اول وقت میں جلدی سے ادا کیا جائے، یہاں تک کہ نماز سے فارغ ہونے کے وقت بھی روشنی باقی ہو۔\"",
    "english": "Authentic (Sahih). Reported by Al-Bukhari (559) and Muslim (637). Al-Hafiz Ibn Hajar said in Al-Fath (2/41): \"The implication of this is to hasten Maghrib prayer at the beginning of its time, such that the completion of the prayer occurs while the light (of the sky) is still present.\""
  },
  "importantWords": [
    {
      "arabic": "نُصَلِّي",
      "english": "We pray",
      "urdu": "ہم نماز پڑھتے تھے"
    },
    {
      "arabic": "اَلْمَغْرِب",
      "english": "Maghrib (Sunset Prayer)",
      "urdu": "مغرب کی نماز"
    },
    {
      "arabic": "يَنْصَرِفُ",
      "english": "Departs/leaves",
      "urdu": "واپس ہوتا ہے"
    },
    {
      "arabic": "لَيُبْصِرُ",
      "english": "He can certainly see",
      "urdu": "یقیناً وہ دیکھ سکتا ہے"
    },
    {
      "arabic": "مَوَاقِعَ",
      "english": "Places where (things) fall",
      "urdu": "گرنے کی جگہیں"
    },
    {
      "arabic": "نَبْلِهِ",
      "english": "His arrows",
      "urdu": "اس کے تیر"
    },
    {
      "arabic": "مُتَّفَقٌ عَلَيْهِ",
      "english": "Agreed upon (Bukhari & Muslim)",
      "urdu": "بخاری و مسلم متفق"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز مغرب کو اس کے وقت کے آغاز میں جلدی ادا کرنے کی فضیلت اور طریقہ بیان کرتی ہے، جس سے معلوم ہوتا ہے کہ نماز کی ادائیگی کے بعد بھی آسمان پر ہلکی سرخی اور روشنی باقی ہوتی تھی۔",
    "english": "This Hadith illustrates the virtue and practice of performing the Maghrib prayer immediately at the beginning of its time, indicating that there was still sufficient light remaining in the sky after the congregation finished their prayer."
  },
  "references": [
    {
      "arabic": "رواه البخاري (559)",
      "english": "Reported by Al-Bukhari (559)"
    },
    {
      "arabic": "رواه مسلم (637)",
      "english": "Reported by Muslim (637)"
    },
    {
      "arabic": "فتح الباري لابن حجر (2/41)",
      "english": "Fath Al-Bari by Ibn Hajar (2/41)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "رافع بن خديج",
        "english": "Rafi' ibn Khadij"
      },
      "slug": "rafi-ibn-khadij"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYJ0i-X-W1o",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مغرب کی نماز کا وقت",
        "english": "The Time of Maghrib Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اول وقت میں جلدی کرنا",
              "english": "Haste in the Early Time"
            },
            "content": {
              "urdu": [
                "حدیث اس بات کی دلیل ہے کہ نماز مغرب کو اس کے وقت کے داخل ہوتے ہی ادا کرنا افضل ہے۔",
                "نبی اکرم ﷺ کی عادت مبارکہ یہی تھی کہ مغرب کی نماز فوراً ادا فرماتے تھے۔",
                "یہ عمل نماز کے وقت کی حفاظت اور فضیلت کو یقینی بناتا ہے۔"
              ],
              "english": [
                "This Hadith serves as evidence that it is preferable to perform the Maghrib prayer immediately upon the entry of its time.",
                "It was the noble practice of the Prophet (ﷺ) to pray Maghrib without delay.",
                "This practice ensures safeguarding the prayer time and attaining its virtue."
              ]
            }
          },
          {
            "title": {
              "urdu": "روشنی کا باقی رہنا",
              "english": "Remaining Daylight/Twilight"
            },
            "content": {
              "urdu": [
                "صحابہ کرامؓ نماز مکمل کرنے کے بعد بھی اتنا اجالا پاتے تھے کہ تیر کے گرنے کی جگہ دیکھ سکتے تھے۔",
                "یہ اس بات کی علامت ہے کہ مغرب کا وقت سورج غروب ہوتے ہی شروع ہو جاتا ہے، اندھیرا چھانے کا انتظار نہیں کیا جاتا۔",
                "نماز کی تیزی اور آسانی اس وقت کو پہچاننے کا سبب بنتی ہے۔"
              ],
              "english": [
                "The Companions (RA) would find enough light remaining after completing the prayer to see where their arrows fell.",
                "This indicates that the Maghrib time starts immediately upon sunset, without waiting for complete darkness.",
                "The swiftness and ease of the prayer allow for recognizing this early time."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور احکام",
        "english": "Jurisprudential Issues and Rulings"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مغرب میں تاخیر کا حکم",
              "english": "Ruling on Delaying Maghrib"
            },
            "content": {
              "urdu": [
                "جمہور علماء کے نزدیک نماز مغرب میں بلا عذر تاخیر کرنا مکروہ یا خلاف سنت ہے۔",
                "اس حدیث کی بنیاد پر اول وقت میں جلدی ادا کرنا سنتِ مؤکدہ ہے۔",
                "صرف سفر یا کسی شرعی عذر کی صورت میں جمع بین الصلاتین کی اجازت ہے۔"
              ],
              "english": [
                "According to the majority of scholars, delaying the Maghrib prayer without a valid excuse is disliked (Makruh) or contrary to the Sunnah.",
                "Based on this Hadith, hastening it in the early time is a confirmed Sunnah (Sunnah Mu'akkadah).",
                "Combining prayers (Jama' bayn As-Salatayn) is only permissible in case of travel or a valid legal excuse."
              ]
            }
          },
          {
            "title": {
              "urdu": "تیر کے گرنے کی جگہ کا مفہوم",
              "english": "Meaning of 'Places where Arrows Fell'"
            },
            "content": {
              "urdu": [
                "اس سے مراد یہ ہے کہ اتنی روشنی باقی تھی کہ دور پھینکی گئی چیز (تیر) کی جگہ واضح طور پر نظر آ سکے۔",
                "یہ وقت کا تعین کرنے کا ایک دیہی یا جنگجوؤں کے ماحول کے مطابق استعارہ ہے۔",
                "یہ اس بات پر زور دیتا ہے کہ عشاء کا وقت شروع ہونے سے پہلے ہی مغرب مکمل کر لی جاتی تھی۔"
              ],
              "english": [
                "This metaphor means that enough light remained for a distant object (like an arrow) to be clearly seen where it landed.",
                "It is an idiom appropriate to a rural or warrior environment for defining the time.",
                "It emphasizes that the Maghrib prayer was completed before the time for Isha prayer began."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور فوائد",
        "english": "Practical Lessons and Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نماز میں چستی اور تیزی",
              "english": "Vigilance and Swiftness in Prayer"
            },
            "content": {
              "urdu": [
                "حدیث اس بات کی ترغیب دیتی ہے کہ نماز کو اول وقت میں جلدی ادا کیا جائے اور اس میں سستی نہ کی جائے۔",
                "تیزی سے ادائیگی کا مطلب یہ نہیں کہ نماز کے ارکان میں کمی کی جائے بلکہ مختصر مگر جامع نماز پڑھنا ہے۔",
                "مسلمان کو عبادات کی ادائیگی میں ہمیشہ چست اور فعال رہنا چاہیے۔"
              ],
              "english": [
                "The Hadith encourages the rapid performance of prayer at its earliest time and avoiding sluggishness.",
                "Swift performance does not mean neglecting pillars but performing a concise yet complete prayer.",
                "A Muslim should always be vigilant and active in performing acts of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی اہمیت",
              "english": "Importance of Time"
            },
            "content": {
              "urdu": [
                "اسلام میں نماز کے وقت کی پابندی پر شدید زور دیا گیا ہے اور یہ وقت کی قدر سکھاتی ہے۔",
                "مغرب کا وقت مختصر ہوتا ہے، لہذا فوراً نماز پڑھ کر تاخیر کے خطرے سے بچنا چاہیے۔",
                "وقت پر نماز کی ادائیگی ایمان کا ثبوت اور اللہ کے حکم کی تعمیل ہے۔"
              ],
              "english": [
                "Islam places a strong emphasis on adhering to prayer times, teaching the value of time.",
                "The time for Maghrib is short, so one should pray immediately to avoid the risk of delay.",
                "Praying on time is proof of faith and compliance with the command of Allah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت اور طریقہ",
        "english": "Sunnah and Methodology"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت نبوی ﷺ",
              "english": "The Prophetic Sunnah"
            },
            "content": {
              "urdu": [
                "یہ حدیث نبی اکرم ﷺ کی سنت کو واضح کرتی ہے کہ مغرب کی نماز میں تاخیر نہیں کرتے تھے۔",
                "صحابہ کرامؓ کا عمل اس بات کا ثبوت ہے کہ وہ اس سنت پر سختی سے عمل پیرا تھے۔",
                "اس طریقہ کار کو اپنانا رسول اللہ ﷺ کے طریقے کی پیروی ہے۔"
              ],
              "english": [
                "This Hadith clarifies the Sunnah of the Prophet (ﷺ) that he did not delay the Maghrib prayer.",
                "The practice of the Companions (RA) proves that they strictly adhered to this Sunnah.",
                "Adopting this methodology is following the path of the Messenger of Allah (ﷺ)."
              ]
            }
          },
          {
            "title": {
              "urdu": "اخلاقی پہلو",
              "english": "Ethical Aspect"
            },
            "content": {
              "urdu": [
                "نماز میں جلدی کرنے سے دنیاوی کاموں میں بھی نظم و ضبط اور ذمہ داری کا احساس پیدا ہوتا ہے۔",
                "یہ جلد بازی نہیں بلکہ عبادات میں دھیان اور توجہ کا سبق دیتی ہے۔",
                "وقت کی اہمیت کو سمجھنا اور نماز کو دیگر امور پر ترجیح دینا اخلاقی فرض ہے۔"
              ],
              "english": [
                "Hasting the prayer cultivates a sense of discipline and responsibility in worldly affairs as well.",
                "It teaches attentiveness and focus in worship, not merely rushing.",
                "Understanding the importance of time and prioritizing prayer over other matters is an ethical duty."
              ]
            }
          }
        ]
      }
    }
  ]
}
