{
  "hadithId": 130,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["bukhari:547", "muslim:647"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب مَوَاقِيتُ الصَّلاَةِ",
    "babId": 11
  },
  "name": {
    "arabic": "وَعَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُصَلِّيَ اَلْعَصْرَ, ثُمَّ يَرْجِعُ أَحَدُنَا إِلَى رَحْلِهِ فِي أَقْصَى اَلْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ, وَكَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ مِنْ اَلْعِشَاءِ, وَكَانَ يَكْرَهُ اَلنَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا, وَكَانَ يَنْفَتِلُ مِنْ صَلَاةِ اَلْغَدَاةِ حِينَ يَعْرِفُ اَلرَّجُلُ جَلِيسَهُ, وَيَقْرَأُ بِالسِّتِّينَ إِلَى اَلْمِائَةِ } مُتَّفَقٌ عَلَيْهِ وَعِنْدَهُمَا مِنْ حَدِيثِ جَابِرٍ: { وَالْعِشَاءَ أَحْيَانًا وَأَحْيَانًا: إِذَا رَآهُمْ اِجْتَمَعُوا عَجَّلَ, وَإِذَا رَآهُمْ أَبْطِئُوا أَخَّرَ, وَالصُّبْحَ: كَانَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-يُصَلِّيهَا بِغَلَسٍ } وَلِمُسْلِمٍ مِنْ حَدِيثِ أَبِي مُوسَى: { فَأَقَامَ اَلْفَجْرَ حِينَ اِنْشَقَّ اَلْفَجْرُ, وَالنَّاسُ لَا يَكَادُ يَعْرِفُ بَعْضُهُمْ بَعْضًا } ",
    "urdu": "سیدنا ابوبرزہ اسلمی رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز عصر (ایسے وقت) میں پڑھتے کہ ہم میں سے کوئی ایک مدینہ کی آخری حدود تک چلا جاتا پھر آفتاب زندہ (روشن، صاف) ہوتا اور آپ صلی اللہ علیہ وسلم نماز عشاء کو تاخیر سے پڑھنا پسند فرماتے تھے۔ نماز عشاء سے پہلے سونے اور بعد از نماز عشاء (غیر ضروری) باتیں کرنے کو ناپسند اور مکروہ خیال فرماتے اور نماز فجر سے ایسے وقت فارغ ہوتے جب نمازی اپنے ساتھ والے شخص کو پہچان لیتا (عموماً) ساٹھ سے سو آیات کی تعداد تک تلاوت فرمایا کرتے تھے۔ (بخاری و مسلم) اور جابر رضی اللہ عنہ کی روایت میں ہے، کہ آپ صلی اللہ علیہ وسلم نماز عشاء کبھی جلدی پڑھ لیتے اور کبھی تاخیر سے۔ (اس کی صورت یہ ہوتی کہ) جب آپ صلی اللہ علیہ وسلم دیکھتے کہ نمازی جمع ہو چکے ہیں تو جلد پڑھا دیتے اور اگر دیکھتے کہ نمازی دیر سے آتے ہیں تو تاخیر کرتے البتہ صبح کی نماز آپ صلی اللہ علیہ وسلم اندھیرے ہی میں پڑھتے (بخاری و مسلم) مسلم میں ابوموسیٰ رضی اللہ عنہ سے مروی ہے کہ صبح کی نماز صبح صادق طلوع ہوتے ہی شروع فرما دیتے یہاں تک کہ اندھیرے کی وجہ سے صحابہ ایک دوسرے کو پہچان نہیں سکتے تھے۔",
    "english": "Narrated Abu Barzah Al-Aslami (May Allah be pleased with him): The Messenger of Allah (ﷺ) used to offer the 'Asr prayer, and then one of us would return to his dwelling in the farthest part of Al-Madinah, and the sun would still be bright (alive). He (ﷺ) liked to delay the 'Isha' prayer. He disliked sleeping before it and engaging in conversation after it. He used to leave the Fajr prayer when a man could recognize his companion (sitting beside him), and he would recite between sixty to one hundred Verses. (Bukhari and Muslim). And in their (Bukhari and Muslim) narration from Jabir: 'And sometimes he offered the 'Isha' prayer earlier and sometimes later: if he saw them gathered, he would offer it earlier, and if he saw them lagging behind, he would delay it. And the Prophet (ﷺ) used to offer the Fajr prayer while it was still dark (ghalas).' And for Muslim from the Hadith of Abu Musa: 'He offered the Fajr prayer when the dawn broke, and the people could hardly recognize one another.'"
  },
  "takhreej": {
    "arabic": "صحيح. رواه البخاري (547) في كتاب مواقيت الصلاة، ومسلم (647) في كتاب المساجد ومواضع الصلاة، باب الأَوْقَاتِ الَّتِي نَهَى عَنِ الصَّلاَةِ فِيهَا، واللفظ للبخاري. ورواية جابر رواها البخاري (560) ومسلم (646). رواية أبي موسى رواها مسلم (646-173).",
    "urdu": "صحیح (درجہ)۔ اسے بخاری (547) نے 'کتاب مواقیت الصلاۃ' میں اور مسلم (647) نے 'کتاب المساجد ومواضع الصلاۃ' میں روایت کیا ہے۔ یہ الفاظ بخاری کے ہیں، جبکہ جابر رضی اللہ عنہ کی روایت بخاری (560) اور مسلم (646) میں موجود ہے۔ ابوموسیٰ رضی اللہ عنہ کی روایت مسلم (646-173) میں ہے۔",
    "english": "Sahih (Authentic). Reported by Al-Bukhari (547) in 'The Book of Prayer Times' and Muslim (647) in 'The Book of Mosques and Places of Prayer'. The wording here is mainly from Bukhari. The narration of Jabir is reported by Al-Bukhari (560) and Muslim (646). The narration of Abu Musa is reported by Muslim (646-173)."
  },
  "importantWords": [
    {
      "arabic": "رَحْلِهِ",
      "english": "His dwelling/camp",
      "urdu": "اس کی قیام گاہ"
    },
    {
      "arabic": "الشَّمْسُ حَيَّةٌ",
      "english": "Sun is bright/vivid",
      "urdu": "سورج روشن ہے"
    },
    {
      "arabic": "يُؤَخِّرَ",
      "english": "To delay",
      "urdu": "تاخیر کرنا"
    },
    {
      "arabic": "يَنْفَتِلُ",
      "english": "He would finish/depart",
      "urdu": "فارغ ہونا، لوٹنا"
    },
    {
      "arabic": "جَلِيسَهُ",
      "english": "His companion/neighbor",
      "urdu": "اس کا ہم نشین"
    },
    {
      "arabic": "بِغَلَسٍ",
      "english": "In darkness/twilight (early Fajr time)",
      "urdu": "اندھیرے میں"
    },
    {
      "arabic": "عَجَّلَ",
      "english": "He hastened/offered early",
      "urdu": "جلدی کرنا"
    },
    {
      "arabic": "أَبْطَئُوا",
      "english": "They lagged behind",
      "urdu": "انہوں نے تاخیر کی"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نبی اکرم صلی اللہ علیہ وسلم کے معمولات کو بیان کرتی ہے، جس میں آپ صلی اللہ علیہ وسلم عصر کی نماز سورج کے صاف اور روشن رہتے ہوئے جلد ادا فرماتے تھے۔ عشاء کی نماز میں جماعت کی حاضری دیکھتے ہوئے تاخیر پسند فرماتے تھے اور اس سے پہلے سونا اور بعد میں بات چیت کرنا ناپسند فرماتے تھے۔ فجر کی نماز اندھیرے میں شروع کی جاتی تھی، اور ختم ہوتے ہوتے اتنی روشنی ہو جاتی کہ آس پاس بیٹھا شخص پہچانا جا سکے، جس میں آپ صلی اللہ علیہ وسلم 60 سے 100 آیات تلاوت فرماتے تھے۔",
    "english": "This Hadith describes the Prophet's (ﷺ) customary practice regarding prayer timings. He would offer 'Asr early while the sun was still bright. He preferred delaying 'Isha' if the congregation was slow but would hasten if they gathered early, and he disliked sleeping before it and talking after it. Fajr prayer would commence while it was still dark (ghalas) and conclude when there was enough light for people to recognize their neighbors, during which he would recite 60 to 100 Verses."
  },
  "references": [
    {
      "arabic": "رواه البخاري (547) عن أبي برزة الأسلمي",
      "english": "Reported by Al-Bukhari (547) from Abu Barzah Al-Aslami"
    },
    {
      "arabic": "رواه مسلم (647) عن أبي برزة الأسلمي",
      "english": "Reported by Muslim (647) from Abu Barzah Al-Aslami"
    },
    {
      "arabic": "رواه البخاري (560) ومسلم (646) من حديث جابر",
      "english": "Reported by Al-Bukhari (560) and Muslim (646) from Jabir"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو برزة نضلة بن عبيد الأسلمي",
        "english": "Abu Barzah Nadlah ibn Ubayd Al-Aslami"
      },
      "slug": "abu-barzah-al-aslami"
    },
    {
      "id": 2,
      "name": {
        "arabic": "جابر بن عبد الله الأنصاري",
        "english": "Jabir ibn Abdullah Al-Ansari"
      },
      "slug": "jabir-ibn-abdullah"
    },
    {
      "id": 3,
      "name": {
        "arabic": "أبو موسى الأشعري",
        "english": "Abu Musa al-Ash'ari"
      },
      "slug": "abu-musa-al-ashari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYJzN8qU3o8",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic (Sahih) Agreed Upon"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "عصر اور عشاء کی افضل ادائیگی",
        "english": "Optimal Performance of Asr and Isha"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عصر کی جلدی ادائیگی کی فضیلت",
              "english": "Virtue of Early Asr Performance"
            },
            "content": {
              "urdu": [
                "آپ ﷺ عصر کی نماز اس وقت ادا کرتے تھے جب سورج کی رنگت صاف اور روشن (حیة) رہتی تھی، جو افضل وقت ہے۔",
                "یہ عمل نماز کو سورج کے زرد پڑنے سے پہلے ادا کرنے کی ترغیب دیتا ہے تاکہ سستی سے بچا جا سکے۔",
                "صحابی کا مدینہ کی آخری حد تک جانا بتاتا ہے کہ وقت کا دائرہ کافی وسیع تھا۔"
              ],
              "english": [
                "The Prophet (ﷺ) offered 'Asr while the sun was still bright and vivid (Hayyah), which is the preferred time.",
                "This practice encourages performing the prayer before the sun turns pale, safeguarding against laziness.",
                "The narrator's ability to return to the outskirts of Madinah indicates the 'Asr time window was generous."
              ]
            }
          },
          {
            "title": {
              "urdu": "عشاء کی تاخیر میں حکمت",
              "english": "Wisdom in Delaying Isha"
            },
            "content": {
              "urdu": [
                "آپ ﷺ عشاء کو آدھی رات تک مؤخر کرنا پسند فرماتے تھے تاکہ لوگوں کو زیادہ آرام مل سکے۔",
                "تاہم، جابر کی روایت واضح کرتی ہے کہ آپ اجتماع کو دیکھ کر تاخیر یا جلدی دونوں اختیار فرماتے تھے۔",
                "اس سے معلوم ہوتا ہے کہ نمازوں کے اوقات میں امام کے لیے مصلحتِ جماعت کو مدنظر رکھنا اہم ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) preferred delaying 'Isha' until near midnight to allow people more rest and convenience.",
                "However, Jabir's narration clarifies that he would adjust the timing based on the congregation's readiness.",
                "This shows the importance for the Imam to consider the communal benefit (Maslaha) when setting prayer times."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عشاء سے متعلق مکروہ افعال",
        "english": "Disliked Acts Related to Isha"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عشاء سے پہلے سونا",
              "english": "Sleeping Before Isha"
            },
            "content": {
              "urdu": [
                "آپ ﷺ عشاء کی نماز سے پہلے سونے کو ناپسند فرماتے تھے کیونکہ اس سے نماز قضا ہونے کا خطرہ ہوتا ہے۔",
                "فقہاء نے نیند کے غلبے میں عشاء سے پہلے سونا مکروہ قرار دیا ہے، سوائے اس کے کہ جب نماز کے لیے جگانے والا موجود ہو۔",
                "یہ حکم بندے کی عبادت میں سستی اور کوتاہی سے بچنے کے لیے دیا گیا۔"
              ],
              "english": [
                "The Prophet (ﷺ) disliked sleeping before the 'Isha' prayer because of the risk of missing its time entirely.",
                "Jurists deemed sleeping before 'Isha' disliked (Makruh) unless one has a reliable person to wake them up for the prayer.",
                "This prohibition serves to prevent negligence and sluggishness in fulfilling one's duty of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "عشاء کے بعد بات چیت کی ممانعت",
              "english": "Prohibition of Talking After Isha"
            },
            "content": {
              "urdu": [
                "عشاء کے بعد دنیاوی باتوں میں مشغول ہونا اس لیے ناپسند تھا کیونکہ اس سے فجر کے لیے اٹھنا مشکل ہو جاتا ہے۔",
                "اس میں ہر وہ گفتگو شامل ہے جو ضروری یا دین کے فائدے سے خالی ہو، جیسے بے مقصد گپ شپ۔",
                "البتہ، علمی مذاکرہ، مہمان نوازی، یا خاندانی معاملات پر گفتگو اس ممانعت میں شامل نہیں ہے۔"
              ],
              "english": [
                "Engaging in worldly talk after 'Isha' was disliked because it could lead to difficulty waking up for Fajr.",
                "This covers any conversation lacking necessity or religious benefit, such as aimless chatting.",
                "Discussions on religious knowledge, hosting guests, or vital family matters are exempted from this dislike."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فجر کی ادائیگی اور قرآت کا معیار",
        "english": "Fajr Performance and Recitation Standard"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فجر کو اندھیرے میں ادا کرنا (تغلیس)",
              "english": "Performing Fajr in Darkness (Taghlis)"
            },
            "content": {
              "urdu": [
                "آپ ﷺ فجر کی نماز 'غلس' (گہرے اندھیرے) میں شروع فرماتے تھے، جو فجر کا افضل ترین وقت ہے۔",
                "ابوموسیٰ کی روایت اس بات کی تائید کرتی ہے کہ نماز کے آغاز میں ایک دوسرے کو پہچاننا مشکل ہوتا تھا۔",
                "یہ طریقہ اس بات کو یقینی بناتا ہے کہ نماز وقت کے آغاز میں ہی ادا ہو جائے اور دن کا زیادہ حصہ کام کے لیے بچے۔"
              ],
              "english": [
                "The Prophet (ﷺ) used to start Fajr prayer in 'Ghalas' (deep twilight/darkness), which is the most virtuous time.",
                "Abu Musa's narration supports this, indicating difficulty in recognizing others at the start of the prayer.",
                "This method ensured the prayer was performed right at the beginning of its time, reserving the maximum daylight hours for work."
              ]
            }
          },
          {
            "title": {
              "urdu": "فجر میں قرآت کی مقدار",
              "english": "Amount of Recitation in Fajr"
            },
            "content": {
              "urdu": [
                "نماز فجر میں نبی ﷺ کا ساٹھ سے سو آیات تک تلاوت کرنا سنتِ مؤکدہ ہے۔",
                "قرآت کی یہ طوالت فجر کی اہمیت اور فضیلت کو ظاہر کرتی ہے، جو دن کا آغاز ہے۔",
                "طویل قرآت کے باوجود نماز کا اختتام اتنی روشنی میں ہوتا تھا کہ آدمی اپنے ساتھی کو پہچان لے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) practice of reciting sixty to one hundred verses in Fajr is a confirmed Sunnah.",
                "This length of recitation indicates the significance and excellence of Fajr, which marks the beginning of the day.",
                "Despite the lengthy recitation, the prayer concluded when there was enough light for people to recognize their companion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "جماعتی مصلحت اور امام کی ذمہ داری",
        "english": "Congregational Benefit and Imam's Responsibility"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "جماعت کے لحاظ سے عشاء کا وقت بدلنا",
              "english": "Adjusting Isha Time for the Congregation"
            },
            "content": {
              "urdu": [
                "جابر رضی اللہ عنہ کی روایت امام کے لیے اہم اصول دیتی ہے کہ وقت کا تعین لوگوں کی سہولت پر منحصر ہو۔",
                "اگر لوگ جلد جمع ہو جائیں تو نماز جلدی شروع کی جائے تاکہ وہ اپنے کاموں کو لوٹ سکیں۔",
                "اگر دیر ہو تو تاخیر کی جائے تاکہ زیادہ سے زیادہ لوگ جماعت میں شامل ہو سکیں اور نماز فوت نہ ہو۔"
              ],
              "english": [
                "Jabir's narration provides a crucial principle for the Imam: setting the time should depend on the people's convenience.",
                "If people gather early, the prayer should be hastened so they can return to their necessities quickly.",
                "If they are delayed, it should be postponed slightly to ensure maximum attendance and prevent missing the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی طوالت میں اعتدال",
              "english": "Moderation in Prayer Length"
            },
            "content": {
              "urdu": [
                "فجر میں ساٹھ سے سو آیات کی قرآت سنت ہے، جو نماز کو مناسب طوالت دیتی ہے۔",
                "یہ قرآت اتنی طویل نہیں ہونی چاہیے کہ لوگوں کو مشقت میں ڈال دے اور نہ اتنی مختصر کہ مقصد فوت ہو جائے۔",
                "امام کو طوالت میں سنت کے ساتھ ساتھ مقتدیوں کے حالات کا بھی خیال رکھنا چاہیے۔"
              ],
              "english": [
                "The recitation of sixty to one hundred verses in Fajr is Sunnah, providing suitable length to the prayer.",
                "The recitation should not be so long as to cause undue hardship to the people, nor so short as to lose its spiritual objective.",
                "The Imam must consider the condition of the congregants alongside adhering to the prophetic example of length."
              ]
            }
          }
        ]
      }
    }
  ]
}
