{
  "hadithId": 139,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["1:2:11"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  "name": {
    "arabic": " وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْفَجْرُ فَجْرَانِ: فَجْرٌ يُحَرِّمُ اَلطَّعَامَ وَتَحِلُّ فِيهِ اَلصَّلَاةُ, وَفَجْرٌ تَحْرُمُ فِيهِ اَلصَّلَاةُ ‏- أَيْ: صَلَاةُ اَلصُّبْحِ ‏- وَيَحِلَّ فِيهِ اَلْطَّعَامُ } رَوَاهُ اِبْنُ خُزَيْمَةَ, وَالْحَاكِمُ, وَصَحَّحَاهُ  وَلِلْحَاكِمِ فِي حَدِيثِ جَابِرٍ ‏- رضى الله عنه ‏- نَحْوُهُ, وَزَادَ فِي اَلَّذِي يُحَرِّمُ اَلطَّعَامَ: { إِنَّهُ يَذْهَبُ مُسْتَطِيلاً فِي اَلْأُفُقِ } وَفِي اَلْآخَرِ: { إِنَّهُ كَذَنَبِ اَلسِّرْحَان }",
    "urdu": "سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”فجر کی دو قسمیں ہیں، ایک وہ فجر جس میں کھانا حرام ہے اور نماز ادا کرنا جائز و حلال ہے اور ایک وہ فجر ہے جس میں نماز پڑھنا حرام ہے اور کھانا جائز و حلال ہے۔“ اسے ابن خزیمہ اور حاکم نے روایت کیا ہے اور دونوں نے اسے صحیح بھی قرار دیا ہے۔ اور مستدرک حاکم میں جابر رضی اللہ عنہ سے بھی اسی طرح مروی ہے۔ اس میں اتنا اضافہ ہے کہ ”جس صبح میں کھانا حرام ہے وہ آسمان کے کناروں اور اطراف میں پھیل جاتی ہے اور دوسری بھیڑیئے کی دم کی طرح اونچی چلی جاتی ہے۔“ ",
    "english": "Narrated Ibn 'Abbās (RA): The Messenger of Allah (ﷺ) said: 'Fajr (dawn) is of two types: (1) A Fajr in which food becomes forbidden (for a fasting person) and prayer becomes permissible, and (2) a Fajr in which prayer becomes forbidden (i.e., the Fajr obligatory prayer) and food becomes permissible.' Reported by Ibn Khuzaymah and Al-Ḥākim, and they both graded it as Sahih (authentic). And in Al-Ḥākim, a similar narration is reported from Jābir (RA), adding concerning the one that makes food forbidden: 'It spreads out horizontally across the horizon,' and concerning the other: 'It is like the tail of a wolf (i.e., rising vertically).'"
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه ابن خزيمة (356)‏، وعنه الحاكم (191)‏، ويشهد له ما بعده.‏ صحيح.‏ رواه الحاكم (191)‏ وقال: \"إسناده صحيح\".‏ وقال الذهبي: \"صحيح\".‏ \"والسرحان\": هو: الذئب، والمراد أنه لا يذهب مستطيلاً ممتداً، بل يرتفع في السماء كالعمود.‏ قاله الصنعاني.‏",
    "urdu": "صحیح۔ اسے ابن خزیمہ (356) نے روایت کیا، اور ان سے حاکم (191) نے، اور بعد کی روایت اس کی تائید کرتی ہے۔ صحیح۔ اسے حاکم (191) نے روایت کیا اور کہا: ”اس کی سند صحیح ہے۔“ اور ذہبی نے کہا: ”صحیح ہے۔“ السرحان (Sarḥān) سے مراد بھیڑیا ہے۔ اس سے مراد یہ ہے کہ وہ (پہلی فجر) افق پر افقی طور پر نہیں پھیلتی، بلکہ آسمان میں ایک ستون کی طرح اوپر جاتی ہے۔ یہ بات صنعانی نے کہی ہے۔",
    "english": "Authentic (Sahih). Reported by Ibn Khuzaymah (356), and from him Al-Ḥākim (191), and what follows confirms it. Authentic (Sahih). Reported by Al-Ḥākim (191) and he said: 'Its chain is authentic.' And Adh-Dhahabī said: 'Authentic.' 'As-Sarḥān' is the wolf, and the meaning is that it (the false dawn) does not spread horizontally, but rather rises vertically in the sky like a column, as stated by As-Ṣan'ānī.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "اَلْفَجْرُ فَجْرَانِ",
      "english": "Fajr is two types (Dawns)",
      "urdu": "فجر دو قسم کی ہے"
    },
    {
      "arabic": "يُحَرِّمُ اَلطَّعَامَ",
      "english": "Makes food forbidden (for fast)",
      "urdu": "کھانا حرام کر دیتی ہے"
    },
    {
      "arabic": "تَحِلُّ فِيهِ اَلصَّلَاةُ",
      "english": "Prayer is permissible in it",
      "urdu": "اس میں نماز حلال ہے"
    },
    {
      "arabic": "تَحْرُمُ فِيهِ اَلصَّلَاةُ",
      "english": "Prayer is forbidden in it",
      "urdu": "اس میں نماز حرام ہے"
    },
    {
      "arabic": "مُسْتَطِيلاً فِي اَلْأُفُقِ",
      "english": "Spreading horizontally across the horizon",
      "urdu": "افق پر پھیل جاتی ہے"
    },
    {
      "arabic": "ذَنَبِ اَلسِّرْحَان",
      "english": "Like the tail of a wolf (vertical)",
      "urdu": "بھیڑیئے کی دم کی طرح"
    },
    {
      "arabic": "وَيَحِلَّ فِيهِ اَلْطَّعَامُ",
      "english": "Food is permissible in it",
      "urdu": "اس میں کھانا حلال ہے"
    }
  ],
  "summary": {
    "urdu": "نبی اکرم صلی اللہ علیہ وسلم نے فجر کی دو اقسام بیان فرمائیں: فجر صادق (سچی فجر) جو افق پر پھیلتی ہے اور روزے کے لیے کھانے سے منع کرتی ہے اور نمازِ فجر کا وقت شروع کرتی ہے۔ دوسری فجر کاذب (جھوٹی فجر) جو بھیڑیئے کی دم کی طرح اوپر جاتی ہے اور اس میں کھانا پینا جائز رہتا ہے، جبکہ اس وقت نماز پڑھنا ممنوع ہوتا ہے (کیونکہ فجر کا وقت ابھی داخل نہیں ہوا ہوتا)۔",
    "english": "The Prophet (ﷺ) differentiated between two types of dawn: Fajr Ṣādiq (True Dawn), which spreads horizontally across the horizon and marks the start of the fasting period and the obligatory Fajr prayer time. The second is Fajr Kāzhib (False Dawn), which rises vertically like a wolf's tail and does not prohibit eating and drinking, nor does it mark the beginning of the Fajr prayer time."
  },
  "references": [
    {
      "arabic": "رواه ابن خزيمة (356)",
      "english": "Reported by Ibn Khuzaymah (356)"
    },
    {
      "arabic": "رواه الحاكم (191)",
      "english": "Reported by Al-Ḥākim (191)"
    },
    {
      "arabic": "صححه الذهبي",
      "english": "Authenticates by Adh-Dhahabī"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn 'Abbās"
      },
      "slug": "abdullah-ibn-abbas"
    },
    {
      "id": 2,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jābir ibn 'Abdullāh"
      },
      "slug": "jabir-ibn-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=Jm0qV5-V1K0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فجر صادق اور فجر کاذب",
        "english": "Fajr Ṣādiq and Fajr Kāzhib"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فجر صادق (سچی فجر)",
              "english": "Fajr Ṣādiq (The True Dawn)"
            },
            "content": {
              "urdu": [
                "فجر صادق وہ ہے جو افق پر کناروں میں پھیل جاتی ہے (مستطیلاً) اور جس کے بعد روشنی مسلسل بڑھتی جاتی ہے۔",
                "یہ وہ وقت ہے جب رمضان میں روزے داروں پر کھانا پینا حرام ہو جاتا ہے (امساک کا وقت)۔",
                "اسی وقت سے نماز فجر کا وقت شروع ہوتا ہے اور نماز ادا کرنا جائز ہو جاتا ہے۔"
              ],
              "english": [
                "Fajr Ṣādiq is the light that spreads horizontally across the horizon and after which the light continuously increases.",
                "This is the time when eating and drinking become forbidden for fasting individuals (the time of Imsāk).",
                "The time for the Fajr prayer begins at this point, and performing the prayer becomes permissible."
              ]
            }
          },
          {
            "title": {
              "urdu": "فجر کاذب (جھوٹی فجر)",
              "english": "Fajr Kāzhib (The False Dawn)"
            },
            "content": {
              "urdu": [
                "فجر کاذب وہ ہے جو آسمان میں بھیڑیئے کی دم کی طرح لمبائی میں (عمودی طور پر) اوپر جاتی ہے اور پھر غائب ہو جاتی ہے۔",
                "اس وقت میں روزہ دار کے لیے کھانا پینا حلال رہتا ہے کیونکہ یہ رات ہی کا حصہ ہے۔",
                "اس وقت چونکہ فجر کا وقت داخل نہیں ہوا، لہٰذا فرض نماز فجر پڑھنا حرام ہے (یعنی صحیح نہیں ہے)۔"
              ],
              "english": [
                "Fajr Kāzhib is the light that rises vertically in the sky like a wolf's tail and then disappears.",
                "At this time, eating and drinking remain permissible for a fasting person because it is still considered part of the night.",
                "Since the Fajr time has not yet begun, performing the obligatory Fajr prayer at this moment is invalid."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عبادت میں حکم کی بنیاد",
        "english": "Basis of Rulings in Worship"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "فجر کا معیاری وقت",
              "english": "The Standard Fajr Time"
            },
            "content": {
              "urdu": [
                "یہ حدیث واضح طور پر نماز اور روزے کے لیے شرعی وقت کی تعیین کا اہم ترین معیار فراہم کرتی ہے۔",
                "شریعت میں دونوں عبادتوں کے آغاز کا تعلق فجر صادق کے طلوع ہونے سے ہے۔",
                "نماز کی صحت اور روزے کی ابتدا اسی فجر صادق کے ظہور پر منحصر ہے۔"
              ],
              "english": [
                "This Hadith provides the most important criterion for legally defining the time for both prayer and fasting.",
                "In Sharia, the start of both acts of worship is linked to the rising of Fajr Ṣādiq.",
                "The validity of the prayer and the start of the fast depend on the appearance of this True Dawn."
              ]
            }
          },
          {
            "title": {
              "urdu": "کھانے اور نماز کا حکم",
              "english": "Rulings on Food and Prayer"
            },
            "content": {
              "urdu": [
                "فجر کاذب کے وقت کھانا پینا جائز ہے، مگر فجر صادق ہوتے ہی روزے کے لیے ممنوع ہو جاتا ہے۔",
                "فجر کاذب کے وقت فجر کی نماز درست نہیں، جبکہ فجر صادق ہوتے ہی اس کا وقت شروع ہو جاتا ہے۔",
                "حدیث میں 'نماز حرام ہے' سے مراد یہ ہے کہ وقت داخل نہ ہونے کی وجہ سے اس کی ادائیگی جائز نہیں۔"
              ],
              "english": [
                "Eating and drinking are permissible during Fajr Kāzhib, but become forbidden for the fast upon Fajr Ṣādiq.",
                "The Fajr prayer is invalid during Fajr Kāzhib, while its time begins immediately with Fajr Ṣādiq.",
                "The statement 'prayer is forbidden' means that its performance is invalid because the time has not yet begun."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "ظاہری نشانیاں اور پہچان",
        "english": "Visible Signs and Identification"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "افقی اور عمودی پھیلاؤ",
              "english": "Horizontal and Vertical Spread"
            },
            "content": {
              "urdu": [
                "فجر صادق کی اہم پہچان یہ ہے کہ اس کی روشنی افق پر دائیں سے بائیں تک یکساں طور پر پھیلتی ہے۔",
                "فجر کاذب کی روشنی عمودی طور پر آسمان کی طرف ایک ستون کی مانند اٹھتی ہے اور پھر غائب ہو جاتی ہے۔",
                "جب آسمان پر افقی روشنی (فجر صادق) ظاہر ہو تو تمام شرعی احکام اس کے ساتھ منسلک ہو جاتے ہیں۔"
              ],
              "english": [
                "The key sign of Fajr Ṣādiq is that its light spreads uniformly across the horizon from right to left.",
                "The light of Fajr Kāzhib rises vertically towards the sky like a pillar and then disappears.",
                "Once the horizontal light (Fajr Ṣādiq) appears in the sky, all associated legal rulings take effect."
              ]
            }
          },
          {
            "title": {
              "urdu": "بہتر وقت کا تعین",
              "english": "Determining the Better Time"
            },
            "content": {
              "urdu": [
                "فجر کاذب کی علامت (بھیڑیے کی دم) دھوکہ دہی کی طرف اشارہ کرتی ہے، اس لیے اس پر شرعی احکام لاگو نہیں ہوتے۔",
                "یہ حکم مسلمانوں کو مشتبہ اوقات سے بچ کر یقینی اور واضح وقت پر عبادت کرنے کی ترغیب دیتا ہے۔",
                "فلکیاتی مشاہدے سے ان دونوں فجروں میں فرق کرنا دور حاضر میں بھی ممکن ہے۔"
              ],
              "english": [
                "The sign of Fajr Kāzhib (the wolf's tail) indicates deceit, hence no legal rulings are tied to it.",
                "This command encourages Muslims to worship at the certain and clear time, avoiding dubious moments.",
                "Distinguishing between these two Dawns remains possible even today through astronomical observation."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی فوائد",
        "english": "Training and Practical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روزے میں احتیاط",
              "english": "Caution in Fasting"
            },
            "content": {
              "urdu": [
                "روزے داروں کو چاہیے کہ وہ فجر صادق کی روشنی کو پہچانیں تاکہ امساک (کھانا بند کرنا) میں احتیاط برت سکیں۔",
                "یہ علم لوگوں کو فجر کاذب کے دھوکے میں آ کر سحری جلدی ختم کرنے سے بچاتا ہے۔",
                "سحری کا اختتام نماز فجر کے شروع ہونے کے وقت سے منسلک ہے۔"
              ],
              "english": [
                "Fasters should be able to identify the light of Fajr Ṣādiq to exercise caution regarding Imsāk (stopping food intake).",
                "This knowledge prevents people from mistakenly ending their Suhoor (pre-dawn meal) early due to Fajr Kāzhib.",
                "The end of Suhoor is intrinsically linked to the beginning of the Fajr prayer time."
              ]
            }
          },
          {
            "title": {
              "urdu": "وقت کی اہمیت",
              "english": "The Importance of Time"
            },
            "content": {
              "urdu": [
                "یہ حدیث نماز کے اوقات کی شرعی اہمیت اور ان کی حدود کی دقیق پہچان سکھاتی ہے۔",
                "واضح نشانیاں مقرر کی گئی ہیں تاکہ ہر مسلمان خود بھی شرعی وقت کا تعین کر سکے۔",
                "وقت پر عبادت کی ادائیگی اسلام میں ایک بنیادی حکم ہے۔"
              ],
              "english": [
                "This Hadith teaches the legal importance of prayer times and the precise identification of their limits.",
                "Clear signs are established so that every Muslim can determine the legal time themselves.",
                "Performing worship on time is a fundamental commandment in Islam."
              ]
            }
          }
        ]
      }
    }
  ]
}
