{
  "hadithId": 141,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["1:2:13"],
    "kitabId": 2,
    "inKitabBab": 1,
    "arabicBook": "كتاب الصلاة",
    "babId": 11
  },
  "name": {
    "arabic": "وَعَنْ أَبِي مَحْذُورَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَوَّلُ اَلْوَقْتِ رِضْوَانُ اَللَّهُ, وَأَوْسَطُهُ رَحْمَةُ اَللَّهِ; وَآخِرُهُ عَفْوُ اَللَّهِ } أَخْرَجَهُ اَلدَّارَقُطْنِيُّ بِسَنَدٍ ضَعِيفٍ جِدًّا  وَلِلتِّرْمِذِيِّ مِنْ حَدِيثِ اِبْنِ عُمَرَ نَحْوُهُ, دُونَ اَلْأَوْسَطِ, وَهُوَ ضَعِيفٌ أَيْضًا ",
    "urdu": "سیدنا ابومحذورہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اول وقت (میں نماز پڑھنا) رضائے الٰہی کا موجب ہے اور درمیانی وقت (میں ادائیگی نماز) رحمت الٰہی کا سبب ہے اور آخر وقت (میں ادا کرنا) اللہ تعالیٰ سے معافی کا موجب ہے۔“ دارقطنی نے اسے نہایت ہی ضعیف سند سے روایت کیا ہے اور ترمذی میں ابن عمر رضی اللہ عنہما کی حدیث بھی اسی طرح ہے لیکن اس میں لفظ «وسط» مذکور نہیں اور وہ ضعیف بھی ہے۔ ",
    "english": "Narrated Abu Maḥdhūrah (RA): The Prophet (ﷺ) said: 'The beginning of the time [for prayer] is Allah's Pleasure; the middle of it is Allah's Mercy; and the end of it is Allah's Pardon (for performing it).' Ad-Dāraquṭnī reported it with a very weak chain. And At-Tirmidhī reported a similar narration from Ibn 'Umar, without mentioning the middle part, and it is also weak."
  },
  "takhreej": {
    "arabic": " موضوع.‏ رواه الدارقطني (149‏-2502)‏، وفي إسناده جهالة وانقطاع.‏ موضوع.‏ كسابقه.‏ رواه الترمذي (172)‏، وفي إسناده يعقوب بن الوليد وهو من الكذابين الكبار كما قال أحمد.‏ لذا فإن الحديث موضوع (مكذوب) أو ضعيف جداً ولا يصح إسناده.‏",
    "urdu": "موضوع (من گھڑت)۔ اسے دارقطنی (149-2502) نے روایت کیا، اور اس کی سند میں جہالت اور انقطاع ہے۔ یہ پچھلی روایت کی طرح موضوع ہے۔ اسے ترمذی (172) نے روایت کیا، اور حافظ ابن حجر کے قول 'ضعیف' میں نرمی ہے، کیونکہ اس کی سند میں یعقوب بن ولید ہے جو کہ امام احمد کے قول کے مطابق بڑے جھوٹے راویوں میں سے تھا۔ لہذا، یہ حدیث موضوع (من گھڑت) یا سخت ضعیف ہے اور اس کی سند صحیح نہیں ہے۔",
    "english": "Fabricated (Mawḍū'). Reported by Ad-Dāraquṭnī (149-2502), and its chain contains unknown narrators and discontinuity. Fabricated (Mawḍū'), like the previous one. Reported by At-Tirmidhī (172), and Al-Ḥāfiz's ruling of 'weak' is considered lenient, as its chain includes Ya'qūb ibn Al-Walīd, whom Imām Aḥmad called one of the major liars. Therefore, the Hadith is Mawḍū' (fabricated) or very weak, and its chain is not authentic."
  },
  "importantWords": [
    {
      "arabic": "أَوَّلُ اَلْوَقْتِ",
      "english": "The beginning of the time",
      "urdu": "اول وقت"
    },
    {
      "arabic": "رِضْوَانُ اَللَّهُ",
      "english": "Allah's Pleasure",
      "urdu": "اللہ کی رضا"
    },
    {
      "arabic": "أَوْسَطُهُ",
      "english": "The middle of it",
      "urdu": "اس کا درمیانی حصہ"
    },
    {
      "arabic": "رَحْمَةُ اَللَّهِ",
      "english": "Allah's Mercy",
      "urdu": "اللہ کی رحمت"
    },
    {
      "arabic": "آخِرُهُ",
      "english": "The end of it",
      "urdu": "اس کا آخری حصہ"
    },
    {
      "arabic": "عَفْوُ اَللَّهِ",
      "english": "Allah's Pardon/Forgiveness",
      "urdu": "اللہ کی معافی"
    },
    {
      "arabic": "بِسَنَدٍ ضَعِيفٍ",
      "english": "With a weak chain",
      "urdu": "ضعیف سند کے ساتھ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث، جو سند کے اعتبار سے نہایت ضعیف یا موضوع ہے، نماز کے اوقات کو تین فضیلتوں میں تقسیم کرتی ہے: اول وقت کو اللہ کی رضا، درمیانی وقت کو رحمت اور آخری وقت کو معافی کا ذریعہ قرار دیا گیا ہے۔ تاہم، علمائے حدیث نے اس کی صحت کو تسلیم نہیں کیا اور اسے فضائل اعمال میں بھی بیان نہیں کرنا چاہیے۔",
    "english": "This Hadith, which is very weak or fabricated in its chain, divides the prayer times into three virtues: the beginning time is stated as Allah's Pleasure, the middle as His Mercy, and the end as His Pardon. However, Hadith scholars do not accept its authenticity and it should not be quoted, even for virtues of deeds."
  },
  "references": [
    {
      "arabic": "أخرجه الدارقطني (149-2502)",
      "english": "Reported by Ad-Dāraquṭnī (149-2502)"
    },
    {
      "arabic": "رواه الترمذي (172) عن ابن عمر",
      "english": "Reported by At-Tirmidhī (172) from Ibn 'Umar"
    },
    {
      "arabic": "حكم الإمام أحمد على راويه",
      "english": "Verdict of Imām Aḥmad on its narrator"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو محذورة",
        "english": "Abu Maḥdhūrah"
      },
      "slug": "abu-mahthurah"
    },
    {
      "id": 2,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn 'Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kR9U_vH0xYk",
  "grade": {
    "arabic": "موضوع/ضعيف جداً",
    "english": "Fabricated / Very Weak (Mawḍū'/Da'if Jiddan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سند اور درجہ بندی",
        "english": "Chain and Grading Status"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شدید ضعف کا حکم",
              "english": "Ruling of Severe Weakness"
            },
            "content": {
              "urdu": [
                "علمائے حدیث نے اس روایت کو سخت ضعیف یا موضوع (من گھڑت) قرار دیا ہے اور یہ نبی اکرم ﷺ سے ثابت نہیں۔",
                "سند میں یعقوب بن ولید جیسے راوی شامل ہیں جنہیں محدثین نے جھوٹا قرار دیا ہے، لہٰذا اس پر عمل جائز نہیں۔",
                "یہ حدیث سابقہ صحیح حدیث (الصلاة في أول وقتها) کے خلاف جاتی ہے اور شرعی اصولوں سے ٹکراتی ہے۔"
              ],
              "english": [
                "Hadith scholars have graded this narration as severely weak or fabricated (Mawḍū'), thus it is not authentically attributed to the Prophet (ﷺ).",
                "The chain includes narrators like Ya'qūb ibn Al-Walīd, whom scholars declared liars, so acting upon it is impermissible.",
                "This Hadith contradicts the previous authentic Hadith (Prayer at the beginning of its time) and clashes with legal principles."
              ]
            }
          },
          {
            "title": {
              "urdu": "فضائل اعمال میں استعمال",
              "english": "Usage in Virtues of Deeds"
            },
            "content": {
              "urdu": [
                "ضعیف احادیث کو فضائل اعمال میں بیان کرنے کی عمومی اجازت ہے، مگر یہ حدیث سخت ضعیف ہونے کی وجہ سے اس زمرے میں بھی شامل نہیں۔",
                "جس حدیث میں جھوٹا راوی ہو، اسے کسی بھی صورت میں بیان کرنا جائز نہیں، جب تک اس کے ضعف کو واضح نہ کر دیا جائے۔",
                "محدثین کی ذمہ داری ہے کہ وہ روایت کی اصلیت کو واضح کر کے لوگوں کو گمراہی سے بچائیں۔"
              ],
              "english": [
                "While generally permissible to quote weak Ahadith for virtues of deeds, this one is excluded due to its severe weakness.",
                "It is impermissible to quote any Hadith containing a liar unless its weakness is explicitly stated.",
                "It is the duty of Hadith scholars to clarify the authenticity and protect people from misguidance."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "صحیح منہج اور اصول",
        "english": "The Authentic Methodology and Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحیح حکم کی بنیاد",
              "english": "Basis of the Correct Ruling"
            },
            "content": {
              "urdu": [
                "صحیح اور معتبر حدیث کا اصول یہی ہے کہ \"الصلاة في أول وقتها\" (اول وقت میں نماز) سب سے افضل ہے۔",
                "عبادت میں فضیلت کا مدار وقت کو رضائے الٰہی سے مشروط کرنے والی اس ضعیف حدیث پر نہیں ہے۔",
                "افضلیت کا حکم اس لیے ہے کہ اول وقت میں سستی اور تاخیر سے بچا جاتا ہے۔"
              ],
              "english": [
                "The authentic and reliable Hadith principle states that 'Prayer at the beginning of its time' is the most virtuous.",
                "The virtue in worship is not based on this weak Hadith that links time to Allah's Pleasure.",
                "The preference for the early time is due to avoiding laziness and delay."
              ]
            }
          },
          {
            "title": {
              "urdu": "اللہ کی رحمت کا دائرہ",
              "english": "The Scope of Allah's Mercy"
            },
            "content": {
              "urdu": [
                "اللہ کی رحمت اور رضامندی تمام شرعی وقت کو شامل ہے، نہ کہ صرف ایک حصے کو۔",
                "نماز کو اپنے مقررہ وقت میں کسی بھی حصے میں ادا کرنا اللہ کی طرف سے رحمت کا ذریعہ ہے۔",
                "شرعی وقت کے اندر ادا کی گئی ہر نماز مقبول ہے، اگرچہ اول وقت کی فضیلت سب سے زیادہ ہے۔"
              ],
              "english": [
                "Allah's Mercy and Pleasure encompass the entire prescribed time, not just one portion.",
                "Performing the prayer within its fixed time frame is a source of Mercy from Allah.",
                "Every prayer performed within the legal time is acceptable, although the early time holds the highest virtue."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی احتیاط",
        "english": "Training Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "من گھڑت روایات سے اجتناب",
              "english": "Avoiding Fabricated Narrations"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ دین کے معاملات میں صرف صحیح اور مستند روایات پر ہی بھروسہ کریں۔",
                "صرف نیک نیتی کی بنا پر بھی ضعیف یا موضوع حدیث کو نبی ﷺ سے منسوب نہیں کرنا چاہیے۔",
                "حدیث کی سند اور متن دونوں کی جانچ کرنا علمائے کرام کی ذمہ داری ہے۔"
              ],
              "english": [
                "Muslims should rely only on authentic and verified narrations in matters of religion.",
                "Even with good intentions, one must not attribute a weak or fabricated Hadith to the Prophet (ﷺ).",
                "It is the scholars' responsibility to verify both the chain and text of the Hadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "اول وقت پر زور",
              "english": "Emphasis on the Early Time"
            },
            "content": {
              "urdu": [
                "اگرچہ یہ حدیث ضعیف ہے، لیکن یہ اول وقت کی فضیلت کے بنیادی تصور کی تصدیق کرتی ہے۔",
                "نمازی کو چاہیے کہ وہ اول وقت کی فضیلت کو دیگر صحیح احادیث کی روشنی میں ہی سمجھے۔",
                "اول وقت میں نماز پڑھنے کی عادت ڈالنا اللہ کی رضا حاصل کرنے کا بہترین ذریعہ ہے۔"
              ],
              "english": [
                "Although this Hadith is weak, it affirms the core concept of the superiority of the early prayer time.",
                "The worshipper should understand the virtue of the early time based on other authentic Ahadith only.",
                "Cultivating the habit of praying at the beginning of the time is the best way to earn Allah's Pleasure."
              ]
            }
          }
        ]
      }
    }
  ]
}
