{
  "hadithId": 484,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 4,
    "inKitabBab": 1,
    "arabicBook": "",
    "babId": 29
  },
  "name": {
    "arabic": " وَعَنْ أَنَسٍ  - رضى الله عنه  - أَنَّ أَبَا بَكْرٍ اَلصِّدِّيقَ  - رضى الله عنه  - كَتَبَ لَه ُ 1  { هَذِهِ فَرِيضَةُ اَلصَّدَقَةِ اَلَّتِي فَرَضَهَا رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -عَلَى اَلْمُسْلِمِينَ, وَاَلَّتِي أَمَرَ اَللَّهُ بِهَا رَسُولَه ُ 2  فِي أَرْبَعٍ وَعِشْرِينَ مِنَ اَلْإِبِلِ فَمَا دُونَهَا اَلْغَنَم ُ 3  فِي كُلِّ خَمْسٍ شَاةٌ, فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلَاثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَ ى 4  فَإِنْ لَمْ تَكُنْ فَابْنُ لَبُونٍ ذَكَر ٍ 5  فَإِذَا بَلَغَتْ سِتًّا وَثَلَاثِينَ إِلَى خَمْسٍ وَأَرْبَعِينَ فَفِيهَا بِنْتُ لَبُون ٍ 6  أُنْثَى, فَإِذَا بَلَغَتْ سِتًّا وَأَرْبَعِينَ إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ اَلْجَمَل ِ 7  فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ إِلَى خَمْسٍ وَسَبْعِينَ فَفِيهَا جَذَعَة ٌ 8  فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ إِلَى تِسْعِينَ فَفِيهَا بِنْتَا لَبُونٍ, فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا اَلْجَمَلِ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ, وَفِي كُلِّ خَمْسِينَ حِقَّةٌ, وَمَنْ لَمْ يَكُنْ مَعَهُ إِلَّا أَرْبَعٌ مِنَ اَلْإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا 9  .  وَفِي صَدَقَةِ اَلْغَنَمِ سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةِ شَاة ٍ 10  شَاةٌ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ فَفِيهَا شَاتَانِ, فَإِذَا زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلَاثمِائَةٍ فَفِيهَا ثَلَاثُ شِيَاه ٍ 11  فَإِذَا زَادَتْ عَلَى ثَلَاثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ، فَإِذَا كَانَتْ سَائِمَةُ اَلرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاة ٍ 12  شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ, إِلَّا أَنْ يَشَاءَ رَبُّهَا.  وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ اَلصَّدَقَةِ, وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ, وَلَا يُخْرَجُ فِي اَلصَّدَقَةِ هَرِمَة ٌ 13  وَلَا ذَاتُ عَوَارٍ, إِلَّا أَنْ يَشَاءَ اَلْمُصَّدِّقُ، وَفِي اَلرِّقَة ِ 14  رُبُعُ اَلْعُشْرِ, فَإِنْ لَمْ تَكُن ْ 15  إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا, وَمَنْ بَلَغَتْ عِنْدَهُ مِنَ اَلْإِبِلِ صَدَقَةُ اَلْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْحِقَّةُ, وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اِسْتَيْسَرَتَا لَهُ, أَوْ عِشْرِينَ دِرْهَمًا, وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ اَلْحِقَّةِ وَلَيْسَتْ عِنْدَهُ اَلْحِقَّةُ, وَعِنْدَهُ اَلْجَذَعَةُ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْجَذَعَةُ, وَيُعْطِيهِ اَلْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ } رَوَاهُ اَلْبُخَارِيّ ُ",
    "urdu": "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ سیدنا ابوبکر رضی اللہ عنہ نے سیدنا انس رضی اللہ عنہ کو فریضہ زکٰوۃ کے سلسلہ میں یہ تحریر لکھ کر دی تھی۔ جسے رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں پر مقرر فرمایا تھا اور جس کا حکم اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم کو دیا تھا کہ اونٹوں کی چوبیس یا اس سے کم تعداد پر بکریاں ہیں ہر پانچ اونٹ پر ایک بکری، جب تعداد پچیس سے بڑھ کر پینتیس ہو جائے تو اس تعداد پر ایک سالہ اونٹنی۔ اگر میسر نہ ہو تو پھر دو سالہ نر بچہ اور جب چھتیس سے تعداد بڑھ کر پینتالیس تک پہنچ جائے تو ان میں دو سالہ اونٹنی اور جب چھیالیس سے بڑھ کر ساٹھ تک تعداد پہنچ جائے تو ان میں تین سالہ جوان اونٹ جفتی کے قابل اونٹنی اور جب اکسٹھ سے بڑھ کر پچھتر تک پہنچ جائے تو ان میں چار سالہ اونٹ اور جب چھہتر سے تعداد بڑھ کر نوے ہو جائے تو ان میں دو ‘ دو سالہ دو اونٹنیاں اور پھر اکانوے سے بڑھ کر تعداد ایک سو بیس تک پہنچ جائے تو ان میں تین ‘ تین سالہ دو جوان اونٹنیاں۔ جو اونٹ کی جفتی کے قابل ہوں۔ اور جب تعداد ایک سو بیس سے زائد ہو جائے تو پھر ہر چالیس اونٹوں پر ایک دو سالہ اونٹنی اور ہر پچاس پر تین سالہ اور جس کے پاس صرف چار ہی اونٹ ہوں تو اس تعداد پر کوئی زکٰوۃ نہیں الایہ کہ ان کا مالک چاہے اور بکریوں کی زکٰوۃ کہ جو باہر چرنے جاتی ہوں ‘ چالیس سے لے کر ایک سو بیس کی تعداد پر صرف ایک بکری زکٰوۃ میں وصول کی جائے گی۔ جب یہ تعداد ایک سو بیس سے بڑھ کر دو سو تک پہنچ جائے گی تو دو بکریاں زکٰوۃ میں وصول کی جائیں گی۔ پھر جب دو سو سے بڑھ کر تین سو تک پہنچ جائے گی تو تین بکریاں وصول کی جائیں گی۔ جب تعداد تین سو سے بڑھ جائے گی تو ہر سو بکری پر ایک بکری زکٰوۃ وصول کی جائے گی ‘ اگر کسی کی باہر جنگل میں چرنے والی بکریاں چالیس سے ایک بھی کم تعداد میں ہوں تو مالک پر کوئی زکٰوۃ نہیں الایہ کہ مالک چاہے۔ زکٰوۃ کے ڈر سے نہ تو الگ الگ چرنے والیوں کو اکٹھا کیا جائے اور نہ ہی اکٹھی چرنے والیوں کو الگ الگ۔ اور جو جانور دو آدمیوں کے درمیان مشترکہ ہوں وہ مساوی طور پر زکٰوۃ کا حصہ نکالیں۔ زکٰوۃ کی مد میں بوڑھا اور نہ یک چشم جانور اور نہ سانڈ لیا جائے الایہ کہ زکٰوۃ دینے والا خود چاہے۔ اور چاندی کے سکوں کا نصاب دو سو درہم ہے اس میں سے چالیسواں حصہ زکٰوۃ ہے۔ اگر کسی کے پاس دو سو درہم سے ایک درہم بھی کم ہے تو اس پر زکٰوۃ واجب نہیں الایہ کہ اس کا مالک خود دینا چاہے۔ اور جس کے اونٹوں کی زکٰوۃ میں چار سالہ اونٹ واجب الوصول ہو اور اس کے پاس اس عمر کا اونٹ نہ ہو اور اس کے پاس تین سالہ ہو جوان اونٹنی تو اس سے دو بکریاں اور تین سالہ جفتی کے لائق جوان اونٹنی وصول کی جائے بشرطیکہ بکریاں بآسانی دستیاب ہو سکیں یا بیس درہم دینا ہوں گے اور جس کی زکٰوۃ میں تین سالہ جوان اونٹنی آتی ہو اور اس کے پاس چار سالہ اونٹ ہو تو اس سے وہی چار سالہ اونٹ ہی وصول کر لیا جائے گا مگر زکٰوۃ وصول کرنے والا اسے بیس درہم یا دو بکریاں واپس دے گا (بخاری)  ",
    "english": " "
  },
  "takhreej": {
    "arabic": "  جاء في البخاري بعد ذلك قوله: "هذا الكتاب، لما وجهه إلى البحرين.  بسم الله الرحمن الرحيم". 
 2  - في البخاري زيادة: "فمن سئلها من المسلمين على وجهها فليعطها، ومن سئل فوقها فلا يعط". 
 3  - في البخاري "من الغنم"، أي: تؤخذ الغنم في زكاتها. 
 4  - ما استكمل من الإبل السنة الأولى ودخل في الثانية. 
 5  - هذه الجملة ليست في البخاري. 
 6  - من الإبل، ما استكمل السنة الثانية، ودخل في الثالثة. 
 7  - هي التي أتت عليها ثلاث سنين ودخلت في الرابعة، والمراد: أنها بلغت أن يطرقها الفحل. 
 8  - هي التي أتى عليها أربع سنين، ودخلت في الخامسة. 
 9  - أي: صاحبها. 
 10  - هذه اللفظة ليست في البخاري. 
 11  - هذه اللفظة ليست في البخاري. 
 12  - هذه اللفظة ليست في البخاري. 
 13  - التي سقطت أسنانها. 
 14  - هي الفضة الخالصة سواء كانت مضروبة أو غير مضروبة. 
 15  - في الأصلين: "يكن". 
 16  - صحيح.  رواه البخاري ( 1454 )  ومما تجدر الإشارة إليه أنه لا توجد رواية واحدة في البخاري بهذا السياق، ولكن الحافظ جمع بين روايات الحديث، وانظر البخاري رقم ( 1448 ) ، لتقف على أطراف الحديث. ",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}