{
  "hadithId": 381,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 2,
    "inKitabBab": 13,
    "arabicBook": "",
    "babId": 23
  },
  "name": {
    "arabic": "وَعَنْ جَابِرٍ قَالَ: { شَهِدْتُ مَعَ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -صَلَاةَ اَلْخَوْفِ، فَصَفَّنَا صَفَّيْنِ: صَفٌّ خَلْفَ رَسُولِ اَللَّهِ - صلى الله عليه وسلم -وَالْعَدُوُّ بَيْنَنَا وَبَيْنَ اَلْقِبْلَةِ, فَكَبَّرَ اَلنَّبِيُّ - صلى الله عليه وسلم -وَكَبَّرْنَا جَمِيعًا, ثُمَّ رَكَعَ وَرَكَعْنَا جَمِيعًا, ثُمَّ رَفَعَ رَأْسَهُ مِنَ اَلرُّكُوعِ وَرَفَعْنَا جَمِيعًا, ثُمَّ اِنْحَدَرَ بِالسُّجُودِ وَالصَّفُّ اَلَّذِي يَلِيهِ, وَقَامَ اَلصَّفُّ اَلْمُؤَخَّرُ فِي نَحْرِ اَلْعَدُوِّ, فَلَمَّا قَضَى اَلسُّجُودَ, قَامَ اَلصَّفُّ اَلَّذِي يَلِيهِ... } فَذَكَرَ اَلْحَدِيثَ.وَفِي رِوَايَةٍ: { ثُمَّ سَجَدَ وَسَجَدَ مَعَهُ اَلصَّفُّ اَلْأَوَّلُ, فَلَمَّا قَامُوا سَجَدَ اَلصَّفُّ اَلثَّانِي, ثُمَّ تَأَخَّرَ اَلصَّفُّ اَلْأَوَّلِ وَتَقَدَّمَ اَلصَّفُّ اَلثَّانِي... } فَذَكَرَ مِثْلَهُ. وَفِي آخِرِهِ: { ثُمَّ سَلَّمَ اَلنَّبِيُّ - صلى الله عليه وسلم -وَسَلَّمْنَا جَمِيعًا } رَوَاهُ مُسْلِمٌ  وَلِأَبِي دَاوُدَ: عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ مِثْلُهُ, وَزَادَ: { أَنَّهَا كَانَتْ بِعُسْفَانَ } وَلِلنَّسَائِيِّ مِنْ وَجْهٍ آخَرَ عَنْ جَابِرٍ { أَنَّ اَلنَّبِيَّ - صلى الله عليه وسلم -صَلَّى بِطَائِفَةٍ مِنْ أَصْحَابِهِ رَكْعَتَيْنِ, ثُمَّ سَلَّمَ, ثُمَّ صَلَّى بِآخَرِينَ أَيْضًا رَكْعَتَيْنِ, ثُمَّ سَلَّمَ } وَمِثْلُهُ لِأَبِي دَاوُدَ, عَنْ أَبِي بَكْرَةَ  ",
    "urdu": " سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز خوف میں حاضر تھا۔ ہم نے دو صفیں بنائیں ایک صف رسول اللہ صلی اللہ علیہ وسلم کے پیچھے کھڑی ہوئی جبکہ دشمن ہمارے اور قبلہ کے درمیان میں تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے اللہ اکبر کہا اور ہم سب نے بھی اللہ اکبر کہا۔ پھر آپ صلی اللہ علیہ وسلم نے رکوع سے سر اوپر اٹھایا اور ہم سب نے بھی اپنے سر اٹھائے پھر آپ صلی اللہ علیہ وسلم سجدے میں چلے گئے اور آپ صلی اللہ علیہ وسلم کے ساتھ والی صف بھی اور دوسری صف دشمن کے مقابلے کیلئے کھڑی رہی۔ جب آپ صلی اللہ علیہ وسلم نے سجدہ پورا کر لیا تو وہ صف جو آپ صلی اللہ علیہ وسلم کے قریب تھی کھڑی ہو گئی۔ پھر راوی نے ساری حدیث بیان کی۔ ایک روایت میں ہے کہ پھر آپ صلی اللہ علیہ وسلم نے سجدہ کیا تو آپ صلی اللہ علیہ وسلم کے ساتھ پہلی صف نے بھی سجدہ کیا اور جب وہ سب کھڑے ہو گئے تو دوسری صف سجدے میں چلی گئی اور پہلی صف پیچھے ہٹ گئی اور دوسری صف آگے آ گئی اور پہلے کی طرح ہی ذکر کیا اور آخر پر نبی کریم صلی اللہ علیہ وسلم نے سلام پھیرا اور ہم سب نے بھی سلام پھیر دیا (مسلم) اور ابوداؤد نے ابوعیاش زرقی سے اس طرح روایت نقل کی ہے لیکن اس میں یہ اضافہ ہے کہ ”وہ عسفان مقام پر (ادا کی گئی) تھی۔“ اور نسائی نے سیدنا جابر رضی اللہ عنہ سے ایک دوسری سند کے ساتھ روایت کیا ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنے اصحاب کے ایک گروہ کو دو رکعتیں پڑھائیں پھر سلام پھیر دیا پھر ایک دوسرے گروہ کو اسی طرح دو رکعات پڑھا کر سلام پھیر دیا۔ ابوداؤد میں سیدنا ابوبکرہ رضی اللہ عنہ سے اسی طرح کی ایک روایت ہے۔ ",
    "english": " "
  },
  "takhreej": {
    "arabic": "مسلم (1/574‏-575/840)‏.‏  صحيح.‏ رواه أبو داود (1236)‏ ولفظه: عن أبي عياش الزرقي قال: كنا مع رسول الله صلى الله عليه وسلم بعسفان، وعلى المشركين خالد بن الوليد، فصلينا الظهر، فقال المشركون: لقد أصبنا غرة.‏ لقد أصبنا غفلة، لو كنا حملنا عليهم وهم في الصلاة، فنزلت آية القصر بين الظهر والعصر، فلما حضرت العصر، قام رسول الله صلى الله عليه وسلم، مستقبل القبلة والمشركون أمامه، فصف خلف رسول الله صلى الله عليه وسلم صف، وصف بعد ذلك الصف صف آخر، فركع رسول الله صلى الله عليه وسلم وركعوا جميعا، ثم سجد وسجد الصف الذين يلونه، وقام الآخرون يحرسونهم، فلما صلى هؤلاء السجدتين وقاموا سجد الآخرين الذين كانوا خلفهم، ثم تأخر الصف الذي يليه إلى مقام الآخرين، وتقدم الصف الأخير إلى مقام الصف الأول، ثم ركع رسول الله صلى الله عليه وسلم وركعوا جميعا، ثم سجد وسجد الصف الذي يليه، وقام الآخرون يحرسونهم فلما جلس رسول الله صلى الله عليه وسلم والصف الذي يليه الآخرون، ثم جلسوا جميعا، فسلم عليهم جميعا، فصلاها بعسفان، وصلاها يوم بني سليم.‏ صحيح.‏ رواه النسائي (378)‏، وأصله في مسلم (843)‏.‏ صحيح.‏ رواه أبو داود (1248)‏.‏ ",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
