{
  "chapId": 3,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 22,
    "to": 28
  },
  "hadiths": [
    {
      "id": 22,
      "name": {
        "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ  - رضى الله عنه  - قَالَ: { سُئِلَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -عَنْ اَلْخَمْرِ تُتَّخَذُ خَلًّا? قَالَ: \"لَا\".  } أَخْرَجَهُ مُسْلِم ٌ",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے شراب سے سرکہ بنانے کے بارے میں دریافت کیا گیا تو آپ صلی اللہ علیہ وسلم نے ایسا کرنے سے منع فرمایا۔ (مسلم و ترمذی) اور ترمذی نے اسے حسن اور صحیح قرار دیا ہے۔",
        "english": "Narrated Anas ibn Malik (RA): The Messenger of Allah (ﷺ) was asked about making vinegar from wine, and he said, 'No.' (Reported by Muslim, 1983)"
      }
    },

    {
      "id": 23,
      "name": {
        "arabic": "وَعَنْهُ قَالَ: { لَمَّا كَانَ يَوْمُ خَيْبَرَ, أَمَرَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -أَبَا طَلْحَةَ, فَنَادَى: \"إِنَّ اَللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ اَلْحُمُرِ]اَلْأَهلِيَّةِ], فَإِنَّهَا رِجْسٌ\" } مُتَّفَقٌ عَلَيْه",
        "urdu": "سیدنا انس بن مالک رضی اللہ عنہ ہی سے روایت ہے کہ جس روز غزوہ خیبر تھا رسول اللہ صلی اللہ علیہ وسلم نے ابوطلحہ کو حکم دیا (کہ لوگوں کو مطلع کر دیں) انہوں نے باآواز بلند اعلان کیا کہ اللہ اور اس کا رسول دونوں تمہیں گھریلو گدھوں کے گوشت کو کھانے سے منع فرماتے ہیں، کیونکہ وہ «رجس» (ناپاک) ہے۔ (بخاری و مسلم)",
        "english": "Narrated Anas ibn Malik (may Allah be pleased with him): On the day of the Battle of Khaybar, the Messenger of Allah (peace and blessings be upon him) commanded Abu Talha to announce that Allah and His Messenger forbid you from consuming the meat of domestic donkeys, for it is Rijs (impure/unclean). Agreed upon (Al-Bukhari & Muslim)."
      }
    },

    {
      "id": 24,
      "name": {
        "arabic": " وَعَنْ عَمْرُو بْنِ خَارِجَةَ  - رضى الله عنه  - قَالَ: { خَطَبَنَا رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -بِمِنًى, وَهُوَ عَلَى رَاحِلَتِهِ, وَلُعَابُهَا يَسِيلُ عَلَى كَتِفَيَّ.  } أَخْرَجَهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَصَحَّحَه ُ",
        "urdu": "سیدنا عمرو بن خارجہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی سواری پر مقام منی میں ہمیں خطاب فرمایا اور اس اونٹنی کا لعاب دہن میرے کندھوں پر بہتا تھا۔ (احمد و ترمذی) اور ترمذی نے اس کو صحیح قرار دیا ہے۔",
        "english": "Narrated Amr ibn Kharija (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) addressed us at Mina while riding his mount, and its saliva was dripping onto my shoulders. Reported by Ahmad and At-Tirmidhi, who authenticated it."
      }
    },

    {
      "id": 25,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا, قَالَتْ: { كَانَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -يَغْسِلُ اَلْمَنِيَّ, ثُمَّ يَخْرُجُ إِلَى اَلصَّلَاةِ فِي ذَلِكَ اَلثَّوْبِ, وَأَنَا أَنْظُرُ إِلَى أَثَرِ اَلْغُسْلِ فِيهِ } مُتَّفَقٌ عَلَيْه ِ وَلِمُسْلِمٍ: { لَقَدْ كُنْتُ أَفْرُكُهُ مِنْ ثَوْبٍ رَسُولِ اَللَّهِ  - صلى الله عليه وسلم  -فَرْكًا, فَيُصَلِّي فِيهِ } وَفِي لَفْظٍ لَهُ: { لَقَدْ كُنْتُ أَحُكُّهُ يَابِسًا بِظُفُرِي مِنْ ثَوْبِهِ }",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ نبی کریم صلی اللہ علیہ وسلم (کپڑے پر لگی ہوئی) منی کو دھویا کرتے تھے۔ پھر اسی کپڑے کو زیب تن فرما کر نماز پڑھ لیتے تھے اور میں دھونے کے نشان اور اثر کو صاف طور پر (اپنی آنکھوں سے) دیکھتی تھی۔ (بخاری و مسلم) اور مسلم کی روایت میں ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے کپڑے سے منی کو رگڑ کر (کھرچ) دیا کرتی تھی۔ پھر آپ صلی اللہ علیہ وسلم اسی کپڑے میں نماز ادا فرما لیتے تھے۔ اور مسلم ہی کی ایک روایت میں اس طرح ہے کہ جب منی خشک ہو جاتی تو میں اپنے ناخن سے اسے کھرچ کر کپڑے سے اتار دیتی۔",
        "english": "Narrated Aishah (may Allah be pleased with her): The Messenger of Allah (peace and blessings be upon him) used to wash the semen from his garment and then go out for prayer in that very garment, and I would see the traces of washing on it. Agreed upon (Al-Bukhari and Muslim). And in a narration by Muslim: 'I used to rub it off from the garment of the Messenger of Allah (peace and blessings be upon him), and he would pray in it.' And in another wording by Muslim: 'I used to scrape it off dry with my nail from his garment.'"
      }
    },

    {
      "id": 26,
      "name": {
        "arabic": "وَعَنْ أَبِي اَلسَّمْحِ  - رضى الله عنه  - قَالَ: قَالَ اَلنَّبِيُّ  - صلى الله عليه وسلم  -{ يُغْسَلُ مِنْ بَوْلِ اَلْجَارِيَةِ, وَيُرَشُّ مِنْ بَوْلِ اَلْغُلَامِ } أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِم ُ",
        "urdu": " سیدنا ابوالسمح رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے کہ ”لڑکی کے پیشاب سے کپڑا دھویا جائے گا اور لڑکے کے پیشاب سے کپڑے پر پانی کے چھینٹے مارے جائیں گے۔“ اسے ابوداؤد و نسائی اور حاکم نے صحیح قرار دیا ہے۔",
        "english": "Narrated Abu As-Samh: The Prophet (ﷺ) said: \"The garment must be washed from the urine of a baby girl, and water should only be sprinkled over the urine of a baby boy.\" Narrated by Abu Dawud and An-Nasa'i, and Al-Hakim graded it Sahih (authentic)."
      }
    },

    {
      "id": 27,
      "name": {
        "arabic": "وَعَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ  - صلى الله عليه وسلم  -قَالَ  -فِي دَمِ اَلْحَيْضِ يُصِيبُ اَلثَّوْبَ -: { \"تَحُتُّهُ, ثُمَّ تَقْرُصُهُ بِالْمَاءِ, ثُمَّ تَنْضَحُهُ, ثُمَّ تُصَلِّي فِيهِ\" } مُتَّفَقٌ عَلَيْه ِ",
        "urdu": "سیدہ اسماء بنت ابی بکر رضی اللہ عنہا روایت کرتی ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے حیض کا خون جو کپڑے کو لگ جائے کے متعلق فرمایا ”پہلے اسے کھرچ ڈالو پھر پانی سے مل کر دھو لو پھر اس پر کھلا پانی بہاؤ پھر اس میں نماز پڑھ لو“ ",
        "english": "Narrated Asma bint Abi Bakr (may Allah be pleased with them both): The Prophet (ﷺ) said concerning menstrual blood that stains a garment: \"She should scratch it off, then rub it with water, then rinse it, and then pray in it.\" [Agreed upon by Al-Bukhari and Muslim]"
      }
    },

    {
      "id": 28,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَتْ خَوْلَةُ: { يَا رَسُولَ اَللَّهِ, فَإِنْ لَمْ يَذْهَبْ اَلدَّمُ? قَالَ: \"يَكْفِيكِ اَلْمَاءُ, وَلَا يَضُرُّكِ أَثَرُهُ\" } أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَسَنَدُهُ ضَعِيف ٌ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ خولہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے استفسار کیا کہ اے اللہ کے رسول! خون کا نشان ختم نہ (اگر خون آلود کپڑے کو اچھی طرح مل کر دھونے کے باوجود نشان) ہو تو پھر کیا، کیا جائے؟ ارشاد فرمایا ”بس تیرا اس پر اچھی طرح پانی بہانا کافی ہے، اس کا نشان تیرے لئے ضرر رساں نہیں۔“ اسے امام ترمذی نے روایت کیا ہے۔ اس کی سند ضعیف ہے۔",
        "english": "Narrated Abu Hurayrah (may Allah be pleased with him): Khawlah (may Allah be pleased with her) asked: \"O Messenger of Allah, what if the bloodstain does not go away?\" He replied: \"It is sufficient for you to use water, and its trace will not harm you.\" Narrated by At-Tirmidhi, and its chain is weak."
      }
    }
  ]
}