{
  "hadithId": 185,
  "hadithNo": 6,
  "hadithReferences": {
    "sunnah.com": ["1:5:6"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
  "name": {
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلْ تِلْقَاءَ وَجْهِهِ شَيْئًا , فَإِنْ لَمْ يَجِدْ فَلْيَنْصِبْ عَصًا , فَإِنْ لَمْ يَكُنْ فَلْيَخُطَّ خَطًّا , ثُمَّ لَا يَضُرُّهُ مَنْ مَرَّ بَيْنَ يَدَيْهِ } أَخْرَجَهُ أَحْمَدُ وَابْنُ مَاجَهْ , وَصَحَّحَهُ اِبْنُ حِبَّانَ , وَلَمْ يُصِبْ مَنْ زَعَمَ أَنَّهُ مُضْطَرِبٌ , بَلْ هُوَ حَسَنٌ .‏ ",
    "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” جب تم میں سے کوئی نماز پڑھنے لگے تو اپنے سامنے کوئی چیز گاڑ لے یا قائم کر لے۔ اگر کوئی چیز دستیاب نہ ہو سکے تو اپنی لاٹھی ہی کھڑی کر لے۔ اگر لاٹھی بھی ممکن نہ ہو سکے تو (زمین پر) خط ہی کھینچ لے۔ اب آگے سے گزرنے والا نمازی کو کوئی نقصان نہیں پہنچا سکے گا۔ “ اسے احمد اور ابن ماجہ نے روایت کیا ہے اور ابن حبان نے اسے صحیح قرار دیا ہے اور جس کسی نے یہ گمان کیا ہے کہ یہ حدیث مضطرب ہے اس نے صحیح نہیں کہا (وہ غلطی پر ہے) بلکہ یہ حدیث حسن کے مرتبہ کی ہے۔",
    "english": "Narrated Abū Hurayrah (RA): The Messenger of Allah (ﷺ) said: 'When one of you prays, let him place something in front of his face (as a Sutrah). If he does not find anything, let him set up a staff (Asā). If he does not have (a staff), let him draw a line (Khaṭṭan). Then, whoever passes in front of him will not harm him.' Reported by Ahmad and Ibn Mājah, and Ibn Ḥibbān graded it as Ṣaḥīḥ (authentic). Whoever claimed it is Mudṭarib (disrupted/confused) did not succeed (was mistaken); rather, it is of the rank of Ḥasan (good)."
  },
  "takhreej": {
    "arabic": " ضعيف ؛ لاضطرابه ، وجهالة بعض رواته ، وممن ضعفه سفيان بن عيينة ، والشافعي ، والبغوي ، والعراقي ، وغيرهم .‏ ورواه أحمد (2/249و 255و 266)‏ ، وابن ماجه (943)‏ ، وابن حبان (2361)‏ ونفي الاضطراب من الحافظ قد يمشى ، أما التحسين فلا ، إذ لو سلمنا بنفي الاضطراب تبقى الجهالة ، والحافظ نفسه حكم على بعض رواته بالجهالة ، كما هو مذكور \"بالأصل\".‏",
    "urdu": "ضعیف؛ کیونکہ اس میں اضطراب ہے اور بعض راوی مجہول (نامعلوم) ہیں۔ اور اسے ضعیف قرار دینے والوں میں سفیان بن عیینہ، شافعی، بغوی، عراقی اور دیگر شامل ہیں۔ اسے احمد (2/249، 255، 266)، ابن ماجہ (943)، اور ابن حبان (2361) نے روایت کیا ہے۔ حافظ ابن حجر کا اضطراب کی نفی کرنا شاید قابل قبول ہو، لیکن حسن کا درجہ دینا نہیں۔ کیونکہ اگر ہم اضطراب کو نہ بھی مانیں تو بھی جہالت (نامعلوم راوی) باقی رہتی ہے، اور حافظ ابن حجر نے خود اپنے اصل (کتاب) میں بعض راویوں پر جہالت کا حکم لگایا ہے۔",
    "english": "Weak (Ḍa'īf); due to its disruption (Iḍṭirāb) and the unknown status (Jahālah) of some narrators. Among those who weakened it are Sufyān ibn 'Uyaynah, Ash-Shāfi'ī, Al-Baghawī, Al-'Irāqī, and others. Reported by Ahmad (2/249, 255, 266), Ibn Mājah (943), and Ibn Ḥibbān (2361). Al-Ḥāfiẓ's negation of Iḍṭirāb might be acceptable, but classifying it as Ḥasan is not, because even if we assume no Iḍṭirāb, the problem of the unknown narrator remains. Al-Ḥāfiẓ himself ruled some of its narrators as unknown, as mentioned in the original source.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "تِلْقَاءَ وَجْهِهِ",
      "english": "In front of his face",
      "urdu": "اپنے چہرے کے سامنے"
    },
    {
      "arabic": "فَلْيَنْصِبْ عَصًا",
      "english": "Let him set up a staff",
      "urdu": "تو اپنی لاٹھی کھڑی کر لے"
    },
    {
      "arabic": "فَلْيَخُطَّ خَطًّا",
      "english": "Let him draw a line",
      "urdu": "تو خط کھینچ لے"
    },
    {
      "arabic": "لَا يَضُرُّهُ مَنْ مَرَّ",
      "english": "Whoever passes will not harm him",
      "urdu": "گزرنے والا کوئی نقصان نہیں پہنچا سکے گا"
    },
    {
      "arabic": "مُضْطَرِبٌ",
      "english": "Disrupted/Confused (Iḍṭirāb)",
      "urdu": "مضطرب"
    },
    {
      "arabic": "حَسَنٌ",
      "english": "Good (in quality)",
      "urdu": "حسن"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث سترہ قائم کرنے کے لیے ممکنہ متبادل طریقوں کی تدریج کو بیان کرتی ہے: پہلے کوئی ٹھوس چیز (لاٹھی یا دیوار)، پھر لاٹھی (عصا)، اور اگر کچھ میسر نہ ہو تو زمین پر ایک خط کھینچنا۔ اس میں یہ بھی کہا گیا ہے کہ خط کھینچ لینے کے بعد گزرنے والے سے نماز کو کوئی نقصان نہیں پہنچے گا۔ تاہم، محدثین کی اکثریت نے آخری حصے (خط کھینچنے) کو ضعیف اور مضطرب قرار دیا ہے، اگرچہ سترہ قائم کرنے کی ترغیب صحیح ہے۔",
    "english": "This Hadith describes the gradation of permissible alternatives for establishing a Sutrah: first, a solid object (staff or wall), then a staff, and if nothing is available, drawing a line on the ground. It states that after drawing the line, the passerby will not harm the prayer. However, the majority of Hadith scholars have ruled the final part (drawing a line) as weak and disrupted (Mudṭarib), though the general encouragement to use a Sutrah remains authentic.",
    "english_alternative": ""
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سترہ کے متبادل اور تدریج",
        "english": "Substitutes for Sutrah and Gradation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ٹھوس چیزوں کو ترجیح",
              "english": "Preference for Solid Objects"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے پہلے کوئی چیز (شیئاً) پھر لاٹھی (عصا) کو سترہ بنانے کا حکم دیا، جو عموماً مؤخرۃ الرحل کے برابر ہوتا ہے۔",
                "یہ نماز کے لیے بہتر ہے کہ کوئی ٹھوس چیز ہو جو نمازی کے آگے سے گزرنے والے کو واضح طور پر رکاوٹ کا احساس دلائے۔",
                "یہ حکم اس بات کی دلیل ہے کہ سترہ قائم کرنے کی کوشش کرنا ایک شرعی ضرورت ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) commanded using 'something' (Shay'an) first, then a staff (Asā) as a Sutrah, which is usually the height of the saddle's back.",
                "It is preferable for the Sutrah to be a solid object that clearly makes the passerby aware of the barrier.",
                "This proves that striving to establish a Sutrah is a religious necessity."
              ]
            }
          },
          {
            "title": {
              "urdu": "خط کھینچنے کا حکم (ضعیف)",
              "english": "The Ruling of Drawing a Line (Weak)"
            },
            "content": {
              "urdu": [
                "«فَلْيَخُطَّ خَطًّا» (تو خط کھینچ لے) کا حکم اس حدیث کا وہ حصہ ہے جسے محدثین کی اکثریت نے ضعیف یا مضطرب قرار دیا ہے۔",
                "صحیح احادیث میں خط کھینچنے کا ذکر نہیں ملتا اور یہ عمل سترہ کے مقصد (رکاوٹ) کو پورا نہیں کرتا۔",
                "لہٰذا، احتیاط کا تقاضا ہے کہ اگر کوئی چیز میسر نہ ہو تو کسی چھوٹی چیز (تیر یا جوتا) کو استعمال کیا جائے، خط کھینچنے کی بجائے۔"
              ],
              "english": [
                "The command 'Falyakhuṭṭa Khaṭṭan' (let him draw a line) is the part of the Hadith that the majority of scholars ruled as weak or disrupted (Mudṭarib).",
                "Drawing a line is not mentioned in authentic Ahadith and does not fulfill the purpose of a Sutrah (a physical barrier).",
                "Therefore, caution dictates using a minimal object (like an arrow or shoe) if nothing solid is available, rather than drawing a line."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "حکمِ عدم ضرر اور فقہی فیصلہ",
        "english": "Ruling of No Harm and Juristic Decision"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "گزرنے والے سے حفاظت",
              "english": "Protection from the Passerby"
            },
            "content": {
              "urdu": [
                "«ثُمَّ لَا يَضُرُّهُ مَنْ مَرَّ بَيْنَ يَدَيْهِ» کا مطلب یہ ہے کہ سترہ قائم کرنے سے نمازی پر گزرنے والے کا گناہ نہیں ہوتا۔",
                "یہ فائدہ اس لیے دیا گیا تاکہ نمازی نماز کو بے فکری کے ساتھ ادا کر سکے، کیونکہ اس نے اپنی ذمہ داری پوری کر لی۔",
                "لیکن یہ فائدہ صرف سترہ کی صحیح صورت (مؤخرۃ الرحل) پر ہی مرتب ہوتا ہے۔"
              ],
              "english": [
                "'Then, whoever passes in front of him will not harm him' means the passerby's sin does not affect the worshipper after the Sutrah is set up.",
                "This benefit is granted so the worshipper can focus on prayer without worry, having fulfilled his obligation.",
                "However, this benefit is mainly realized when a proper Sutrah (like the saddle's back) is used."
              ]
            }
          },
          {
            "title": {
              "urdu": "مضطرب روایت اور اس کا حکم",
              "english": "Disrupted Narration and its Ruling"
            },
            "content": {
              "urdu": [
                "محدثین کی اکثریت نے اس روایت کو مضطرب قرار دیا، جس کی وجہ یہ ہے کہ اس کے راوی مختلف صورتوں میں مختلف احکام بیان کرتے ہیں۔",
                "اضطراب کسی حدیث کی سند یا متن میں اختلاف ہونے کو کہتے ہیں، جس سے اس کا حکم ضعیف ہو جاتا ہے۔",
                "اس روایت میں خط کھینچنے کا حکم دیگر صحیح سنتوں سے متصادم ہے۔"
              ],
              "english": [
                "The majority of Hadith scholars ruled this narration as Mudṭarib because its narrators presented conflicting forms in its chain and text.",
                "Iḍṭirāb refers to contradiction in a Hadith's chain or text, which weakens its authority.",
                "The ruling about drawing a line in this narration conflicts with other authentic Sunnah practices."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی سبق اور سنت کا طریقہ",
        "english": "Practical Lesson and the Sunnah Method"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "عمومی سترہ",
              "english": "General Sutrah"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ مسجد میں یا کھلی جگہ پر ہمیشہ سترہ کا اہتمام کرے، دیوار، ستون، یا جوتے کا استعمال کرے۔",
                "اگر کوئی ٹھوس چیز نہ ملے تو بعض فقہاء نے زمین پر جوتا رکھ کر نماز پڑھنے کی اجازت دی ہے، جو سنت کے قریب ہے۔",
                "خط کھینچنے کے بجائے، گزرنے والے کو ہاتھ کے اشارے سے روکنا زیادہ صحیح اور مؤثر عمل ہے۔"
              ],
              "english": [
                "A Muslim should always ensure a Sutrah in the mosque or an open area, using a wall, column, or shoe.",
                "If no solid object is available, some jurists permit placing a shoe on the ground, which is closer to the Sunnah.",
                "Instead of drawing a line, physically repelling the passerby with a hand gesture is the more authentic and effective action."
              ]
            }
          },
          {
            "title": {
              "urdu": "سنت کی حفاظت",
              "english": "Protection of the Sunnah"
            },
            "content": {
              "urdu": [
                "علمائے حدیث کا اس روایت کو ضعیف قرار دینا اس بات کی دلیل ہے کہ وہ دین کی حفاظت میں کتنی زیادہ احتیاط کرتے تھے۔",
                "ہمیں چاہیے کہ ہم ہمیشہ صحیح سنت کی پیروی کریں اور ہر اس چیز سے بچیں جو نماز کے خشوع کو متاثر کرے۔",
                "یہ حدیث ایک اچھی نیت کے باوجود غلط طریقے سے عبادت کرنے سے خبردار کرتی ہے۔"
              ],
              "english": [
                "The action of Hadith scholars in weakening this narration demonstrates their extreme caution in safeguarding the religion.",
                "We should always follow the authentic Sunnah and avoid anything that might compromise the reverence of the prayer.",
                "This Hadith warns against performing acts of worship incorrectly, even if done with good intention."
              ]
            }
          }
        ]
      }
    }
  ]
}
