{
  "hadithId": 182,
  "hadithNo": 3,
  "hadithReferences": {
    "sunnah.com": ["1:5:3"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
  "name": {
    "arabic": " وَعَنْ سَبْرَةَ بْنِ مَعْبَدٍ اَلْجُهَنِيِّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لِيَسْتَتِرْ أَحَدُكُمْ فِي صَلَاتِهِ وَلَوْ بِسَهْمٍ } أَخْرَجَهُ اَلْحَاكِمُ",
    "urdu": " سیدنا سبرہ بن معبد جھنی رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” نماز (ادا کرتے وقت) تم میں سے ہر ایک کو سترہ ضرور ہی قائم کرنا چاہیئے اگرچہ تیر ہی سہی۔ “ (مستدرک حاکم)",
    "english": "Narrated Sabrah ibn Ma'bad Al-Juhanī (RA): The Messenger of Allah (ﷺ) said: 'Let one of you use a Sutrah (barrier) for his prayer, even if it be with an arrow (Sahm).' Reported by Al-Ḥākim."
  },
  "takhreej": {
    "arabic": " حسن .‏ رواه الحاكم (1/252)‏ ، واللفظ الذي ساقه الحافظ لابن أبي شيبة (1/278)‏ .‏ قلت : الحديث حسن بشواهده .‏",
    "urdu": "حسن (Good). اسے حاکم (1/252) نے روایت کیا ہے، اور حافظ ابن حجر نے جو الفاظ نقل کیے ہیں وہ ابن ابی شیبہ (1/278) کے ہیں۔ میں (حافظ ابن حجر) کہتا ہوں: یہ حدیث شواہد کی بنا پر حسن ہے۔",
    "english": "Ḥasan (Good). Reported by Al-Ḥākim (1/252). The wording quoted by Al-Ḥāfiẓ is from Ibn Abī Shaybah (1/278). I say: The Hadith is Ḥasan due to its corroborating evidence.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لِيَسْتَتِرْ أَحَدُكُمْ",
      "english": "Let one of you use a Sutrah",
      "urdu": "تم میں سے ہر ایک سترہ قائم کرے"
    },
    {
      "arabic": "فِي صَلَاتِهِ",
      "english": "In his prayer",
      "urdu": "اپنی نماز میں"
    },
    {
      "arabic": "وَلَوْ بِسَهْمٍ",
      "english": "Even if it be with an arrow",
      "urdu": "اگرچہ تیر ہی سہی"
    },
    {
      "arabic": "سَهْم",
      "english": "Arrow",
      "urdu": "تیر"
    },
    {
      "arabic": "حَسَن",
      "english": "Good (in quality)",
      "urdu": "حسن"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نماز میں سترہ (رکاوٹ) کے استعمال کی ترغیب دیتی ہے، اور اس کی مقدار کو کم سے کم کرنے کا حکم بھی دیتی ہے کہ اگر کوئی بڑی چیز میسر نہ ہو تو تیر جیسی چھوٹی چیز کو بھی سترہ بنایا جا سکتا ہے۔ یہ حکم نماز کے خشوع کی حفاظت اور گزرنے والے کے گناہ سے بچاؤ کے لیے ہے، اور یہ سترہ کی اہمیت کو مزید بڑھاتا ہے۔",
    "english": "This Hadith encourages the use of a Sutrah (barrier) in prayer and dictates that its size can be minimal; even a small object like an arrow can suffice if nothing larger is available. This ruling is aimed at protecting the reverence of the prayer and guarding against the sin of passing in front of the worshipper, further emphasizing the importance of the Sutrah. "
  },
  "references": [
    {
      "arabic": "أخرجه الحاكم (1/252)",
      "english": "Reported by Al-Ḥākim (1/252)"
    },
    {
      "arabic": "رواه ابن أبي شيبة (1/278)",
      "english": "Reported by Ibn Abī Shaybah (1/278)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "سبرة بن معبد الجهني",
        "english": "Sabrah ibn Ma'bad Al-Juhanī"
      },
      "slug": "sabrah-ibn-mabad-al-juhani"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "حسن",
    "english": "Good (Ḥasan)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "سترہ کی اہمیت اور کم از کم مقدار",
        "english": "Importance and Minimum Size of the Sutrah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سترہ کی تاکید",
              "english": "Emphasis on the Sutrah"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا «لِيَسْتَتِرْ» (ضرور سترہ قائم کرے) کا حکم، امر کے صیغے میں ہے جو سترہ کی اہمیت اور وجوب کو ظاہر کرتا ہے۔",
                "یہ حکم اس لیے دیا گیا تاکہ نمازی کے آگے سے گزرنے کی سخت وعید (حدیث 180) سے بچا جا سکے۔",
                "یہ سنتِ مؤکدہ ہے اور ایک صحیح قول کے مطابق ہر نمازی پر لازم ہے کہ وہ انفرادی نماز میں اس کا اہتمام کرے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) command 'Liyastatir' (Let him surely use a Sutrah) is in the imperative form, indicating the high importance or obligation of the Sutrah.",
                "This ruling is given to avoid the severe warning (Hadith 180) associated with passing in front of the worshipper.",
                "It is an emphasized Sunnah, and according to one valid opinion, it is obligatory for every person praying individually to ensure they have one."
              ]
            }
          },
          {
            "title": {
              "urdu": "کم از کم مقدار (تیر)",
              "english": "Minimum Size (An Arrow)"
            },
            "content": {
              "urdu": [
                "«وَلَوْ بِسَهْمٍ» (اگرچہ تیر ہی سہی) کا حکم یہ ظاہر کرتا ہے کہ اگرچہ مؤخرۃ الرحل (پچھلی حدیث) افضل ہے، لیکن اگر وہ میسر نہ ہو تو معمولی چیز کو بھی سترہ بنایا جا سکتا ہے۔",
                "تیر یا اس جیسی کوئی بھی چھوٹی چیز بھی سترہ کا کام دے سکتی ہے، بشرطیکہ وہ سیدھی کھڑی ہو سکے۔",
                "اس سے نماز میں آسانی اور مبالغے کی نفی بھی واضح ہوتی ہے، کہ مقصد صرف ایک حد بندی قائم کرنا ہے۔"
              ],
              "english": [
                "The instruction 'even if it be with an arrow' indicates that while the size of the saddle's back (Hadith 181) is preferred, even a minimal object can be used as a Sutrah if nothing else is available.",
                "An arrow or any small, similar object can function as a Sutrah, provided it can stand upright.",
                "This shows ease and negates exaggeration in the matter of Sutrah; the purpose is to establish a clear boundary."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اصول اور عملی اطلاق",
        "english": "Juristic Principle and Practical Application"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سترہ کی حدود",
              "english": "Boundaries of the Sutrah"
            },
            "content": {
              "urdu": [
                "سترہ نمازی کی سجدہ گاہ سے آگے ہونا چاہیے، اور اس سے نمازی کا قریب کھڑے ہونا مسنون ہے۔",
                "اگر نمازی نے سترہ قائم کر لیا ہو، تو سترہ کے آگے سے گزرنا گناہ ہے، مگر نماز صحیح رہے گی۔",
                "تیر کا استعمال یہ بھی واضح کرتا ہے کہ مٹی میں چھڑی یا لکڑی گاڑنا بھی سترہ ہے۔"
              ],
              "english": [
                "The Sutrah should be placed in front of the worshipper's place of prostration, and standing close to it is Sunnah.",
                "If the worshipper has established a Sutrah, passing in front of it is a sin for the passerby, but the prayer remains valid.",
                "The use of an arrow also implies that sticking a staff or small piece of wood into the ground can serve as a Sutrah."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت حدیث پر کلام",
              "english": "Discussion on Hadith Authenticity"
            },
            "content": {
              "urdu": [
                "حافظ ابن حجر کا اسے 'حسن' قرار دینا اس کی دلیل ہے کہ یہ حدیث ضعیف نہیں ہے اور اس پر عمل کیا جا سکتا ہے۔",
                "یہ حکم اس عمومی اصول کی تائید کرتا ہے کہ 'جب دو چیزوں کا حکم ہو تو افضل کو اختیار کیا جائے، اور اگر افضل نہ ملے تو کم درجہ کی چیز بھی جائز ہے۔'",
                "یہ حدیث اس بات کو ثابت کرتی ہے کہ نماز میں سترہ کا اہتمام شریعت کا مطلوب ہے۔"
              ],
              "english": [
                "Al-Ḥāfiẓ Ibn Ḥajar's grading of this Hadith as 'Ḥasan' proves that it is not weak and can be acted upon.",
                "This ruling confirms the general principle: 'When two things are commanded, choose the best; if the best is unavailable, the lesser is permissible.'",
                "This Hadith establishes that maintaining a Sutrah during prayer is a requirement of the Sharī'ah."
              ]
            }
          }
        ]
      }
    }
  ]
}
