{
  "hadithId": 186,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["1:5:7"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
  "name": {
    "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَقْطَعُ اَلصَّلَاةَ شَيْءٌ , وَادْرَأْ مَا اِسْتَطَعْتَ } أَخْرَجَهُ أَبُو دَاوُدَ , وَفِي سَنَدِهِ ضَعْفٌ .‏ ",
    "urdu": " سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” نماز کو کوئی چیز نہیں توڑتی (البتہ سامنے سے) گزرنے والے کو حتیٰ الوسع روکنے کی کوشش کرو۔ “ ابوداؤد نے اسے روایت کیا ہے اس کی سند میں ضعف ہے۔  ",
    "english": "Narrated Abū Sa'īd Al-Khudrī (RA): The Messenger of Allah (ﷺ) said: 'Nothing severs (nullifies) the prayer, but repel (Idra') the one who passes as much as you can.' Reported by Abu Dawud, and there is weakness in its chain."
  },
  "takhreej": {
    "arabic": "ضعيف .‏ رواه أبو داود (719)‏ وتمامه عنده : \"فإنما هو شيطان\" .‏ وعلته في أحد رواته ، وهو مجالد بن سعيد فإنه ضعيف ، ثم هو قد اضطرب في الحديث ، فمرة رفعه ومرة أوقفه.‏ وكذا وقع في الأصلين : \"وادرأ ما استطعت \" وهو في \"السنن\" بلفظ الجمع: \"وادرؤوا ما استطعتم\" .‏",
    "urdu": "ضعیف۔ اسے ابو داؤد (719) نے روایت کیا ہے اور ان کے ہاں اس کا بقیہ حصہ ہے: ”کیونکہ وہ شیطان ہوتا ہے۔“ اور اس کی علت اس کے ایک راوی مجالد بن سعید میں ہے جو ضعیف ہیں، پھر وہ اس حدیث میں مضطرب ہیں؛ کبھی اسے مرفوع (نبی ﷺ سے) اور کبھی موقوف (صحابی سے) روایت کرتے ہیں۔ اور (حافظ ابن حجر کی کتاب کے) دونوں نسخوں میں یہ «وادرأ ما استطعت» (واحد کے لیے) کے لفظ سے ہے، جبکہ سنن میں جمع کے لفظ «وادرؤوا ما استطعتم» سے ہے۔",
    "english": "Weak (Ḍa'īf). Reported by Abu Dawud (719), who has the continuation: 'for he is a devil.' Its defect lies in one of its narrators, Mujālid ibn Sa'īd, who is weak, and he was also confused (Muḍṭarib) in narrating this Hadith, sometimes reporting it as Marfū' and sometimes as Mauqūf. The wording in the original texts is in the singular: 'Idra' mā istaṭa't' (Repel as much as you can), while in the Sunan collections, it is in the plural: 'Idra'ū mā istaṭa'tum' (Repel as much as you can).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "لَا يَقْطَعُ اَلصَّلَاةَ شَيْءٌ",
      "english": "Nothing severs the prayer",
      "urdu": "نماز کو کوئی چیز نہیں توڑتی"
    },
    {
      "arabic": "وَادْرَأْ مَا اِسْتَطَعْتَ",
      "english": "But repel as much as you can",
      "urdu": "اور جتنا ہو سکے روکنے کی کوشش کرو"
    },
    {
      "arabic": "فَإِنَّمَا هُوَ شَيْطَانٌ",
      "english": "For he is a devil",
      "urdu": "کیونکہ وہ شیطان ہوتا ہے"
    },
    {
      "arabic": "ضَعْفٌ",
      "english": "Weakness (in the chain)",
      "urdu": "ضعف"
    },
    {
      "arabic": "يَقْطَعُ",
      "english": "Severs/nullifies",
      "urdu": "توڑتا ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس اصول کو بیان کرتی ہے کہ کسی بھی چیز کا نمازی کے آگے سے گزرنا، نماز کو باطل نہیں کرتا، بلکہ نمازی کو چاہیے کہ وہ گزرنے والے کو ہر ممکن کوشش سے روکے۔ یہ روایت اگرچہ سنداً ضعیف ہے اور صحیح حدیث (عورت، گدھا، کالا کتا نماز توڑ دیتے ہیں) کے مخالف ہے، لیکن فقہاء کے درمیان اس سے استدلال کیا جاتا ہے کہ نماز کی اصل عبادت کو صرف مخصوص چیزیں ہی باطل کرتی ہیں۔",
    "english": "This Hadith asserts the principle that nothing nullifies the prayer by passing in front of the worshipper, but the worshipper should try their best to repel the passerby. Although this narration is weak and contradicts the authentic Hadith (that the woman, donkey, and black dog nullify the prayer), jurists use it to argue that the prayer's core act of worship is only invalidated by specific, definite factors.",
    "english_alternative": ""
  },
  "references": [
    {
      "arabic": "رواه أبو داود (719)",
      "english": "Reported by Abu Dawud (719)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو سعيد الخدري",
        "english": "Abū Sa'īd Al-Khudrī"
      },
      "slug": "abu-said-al-khudri"
    }
  ],
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مختلف احادیث میں تطبیق",
        "english": "Reconciliation Between Different Ahadith"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایت کا ضعف",
              "english": "Weakness of the Narration"
            },
            "content": {
              "urdu": [
                "اس حدیث کا پہلا حصہ «لَا يَقْطَعُ اَلصَّلَاةَ شَيْءٌ» صحیح مسلم کی روایت (حدیث 183) کے حکم کے خلاف ہے، اس لیے محدثین نے اسے ضعیف قرار دیا۔",
                "صحیح قول یہ ہے کہ سترہ نہ ہونے پر عورت، گدھے اور کالے کتے کے گزرنے سے نماز باطل ہو جاتی ہے۔",
                "یہاں «لَا يَقْطَعُ» سے مراد 'نماز کو کامل طور پر باطل نہیں کرتا' ہو سکتا ہے، یا یہ ایک منسوخ حکم تھا۔"
              ],
              "english": [
                "The first part of this Hadith ('Nothing severs the prayer') contradicts the ruling in Ṣaḥīḥ Muslim (Hadith 183), leading scholars to grade it as weak.",
                "The authentic position is that the prayer is nullified by the passing of the woman, the donkey, and the black dog if there is no Sutrah.",
                "The phrase 'Lā yaqṭa'u' might be interpreted as 'does not nullify the prayer completely' or that it was an abrogated ruling."
              ]
            }
          },
          {
            "title": {
              "urdu": "روکنے کا حکم (اتفاقی)",
              "english": "The Command to Repel (Agreed Upon)"
            },
            "content": {
              "urdu": [
                "حدیث کا دوسرا حصہ «وَادْرَأْ مَا اِسْتَطَعْتَ» (حتیٰ الوسع روکنے کی کوشش کرو) صحیح اور ثابت ہے، اور یہ پچھلی حدیث (184) کے موافق ہے۔",
                "چاہے نماز ٹوٹے یا نہ ٹوٹے، گزرنے والے کو روکنے کی کوشش کرنا نمازی پر سنت ہے۔",
                "«شیطان» سے مراد وہی شخص ہے جو جان بوجھ کر گزرے، اور یہ اس عمل کے گناہ کی سنگینی کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The second part of the Hadith ('Repel as much as you can') is authentic and consistent with the previous Hadith (184).",
                "Whether the prayer is nullified or not, it is Sunnah for the worshipper to try and repel the passerby.",
                "'Shayṭān' (devil) refers to the person who passes intentionally, emphasizing the seriousness of that sin."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "سنت پر عمل اور احتیاط",
        "english": "Adherence to Sunnah and Caution"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سترہ اور گناہ",
              "english": "Sutrah and Sin"
            },
            "content": {
              "urdu": [
                "اس حدیث کا مفہوم نمازی کے حق میں ایک آسانی ہے، لیکن اس کا مطلب گزرنے والے کے گناہ میں کمی نہیں ہے۔",
                "مسلمان کو چاہیے کہ وہ ہمیشہ سترہ قائم کرے تاکہ خود کو نماز کے باطل ہونے سے اور دوسرے کو گناہ سے بچا سکے۔",
                "سخت وعید کے باوجود، نمازی کو صرف موذی جانوروں یا نماز توڑنے والی مخصوص اشیاء کو روکنے پر توجہ دینی چاہیے۔"
              ],
              "english": [
                "The implication of this Hadith is ease for the worshipper, but it does not lessen the sin upon the passerby.",
                "A Muslim should always set up a Sutrah to protect their prayer from being nullified and to save others from sin.",
                "Despite the severe warning, the worshipper should focus on repelling only harmful creatures or those specific items that nullify the prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "ضعف کی توجیہ",
              "english": "Justification of Weakness"
            },
            "content": {
              "urdu": [
                "حدیث کا ضعف اس کے متن کے صحیح مسلم کی قوی حدیث سے متصادم ہونے کی وجہ سے ہے، جس میں مجالد بن سعید کا اضطراب بھی شامل ہے۔",
                "علمائے حدیث کا کام ہے کہ وہ صحیح اور ضعیف کے درمیان فرق کو واضح کریں تاکہ شرعی احکام کو خالص سنت پر مبنی کیا جا سکے۔",
                "عورت، گدھا اور کالا کتا نماز کو توڑ دیتے ہیں، یہ حکم راجح ہے اور اس پر عمل ہونا چاہیے۔"
              ],
              "english": [
                "The Hadith's weakness stems from its text contradicting the strong Hadith in Ṣaḥīḥ Muslim, which also involves the confusion of Mujālid ibn Sa'īd.",
                "The role of Hadith scholars is to clarify the difference between authentic and weak to base legal rulings solely on pure Sunnah.",
                "The ruling that the woman, donkey, and black dog nullify the prayer is the preferred one and should be acted upon."
              ]
            }
          }
        ]
      }
    }
  ]
}
