{
  "hadithId": 180,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["1:5:1"],
    "kitabId": 2,
    "inKitabBab": 4,
    "arabicBook": "كتاب السترة",
    "babId": 14
  },
  "name": {
    "arabic": " عَنْ أَبِي جُهَيْمِ بْنِ اَلْحَارِثِ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَوْ يَعْلَمُ اَلْمَارُّ بَيْنَ يَدَيِ اَلْمُصَلِّي مَاذَا عَلَيْهِ مِنْ اَلْإِثْمِ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ } مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ .‏ وَوَقَعَ فِي \"اَلْبَزَّارِ\" مِنْ وَجْهٍ آخَرَ : { أَرْبَعِينَ خَرِيفًا } ",
    "urdu": "سیدنا ابوجہیم بن حارث رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر نمازی کے آگے سے گزرنے والے کو یہ معلوم ہو جائے کہ ایسا کرنے کا کتنا گناہ ہے تو اس کو نمازی کے آگے سے گزرنے کے مقابلے میں چالیس (برس) تک وہاں کھڑا رہنا زیادہ پسند ہو۔“ (بخاری و مسلم) اور یہ الفاظ بخاری کے ہیں۔ یہ حدیث (مسند) بزار میں ایک دوسری سند سے ہے اس میں چالیس سال کا ذکر ہے۔ ",
    "english": "Narrated Abū Juḥaym ibn Al-Ḥārith (RA): The Messenger of Allah (ﷺ) said: 'If the one who passes in front of a praying person knew what (sin/penalty) was upon him, it would be better for him to stand for forty (years) than to pass in front of him.' [Agreed upon (Al-Bukhārī and Muslim)], and the wording is from Al-Bukhārī. And it is found in 'Al-Bazzār' from another chain: 'forty autumns (Khārifan - years).'"
  },
  "takhreej": {
    "arabic": " صحيح .‏ رواه البخاري (510)‏ ، ومسلم (507)‏ ، واللفظ متفق عليه .‏ تنبيه : روى البخاري ومسلم قول أبي النضر ‏- أحد رواة الحديث ‏- : \"لا أدري أقال : أربعين يوما ، أو شهرا ، أو سنة \".‏ شاذ .‏ وهذا من أخطاء ابن عيينة ‏- ‏-رحمه الله‏- ‏- فقد كان يخطئ في هذا الحديث إسنادا ومتنا ، ففي المتن قوله : \"خريفا \" كما هنا ، وأما في الإسناد فقد كان يخالف الثوري ، ومالكا ، غير أني وجدته رجع إلى الصواب في السند ، كما ذكرت ذلك في \"المشكل\" عند الحديث رقم (86)‏ .‏",
    "urdu": "صحیح۔ اسے بخاری (510) اور مسلم (507) نے روایت کیا ہے۔ اور یہ لفظ متفق علیہ ہے۔ تنبیہ: بخاری اور مسلم نے ابو النضر (حدیث کے ایک راوی) کا قول روایت کیا ہے: ”مجھے نہیں معلوم کہ انہوں نے چالیس دن، یا چالیس مہینے، یا چالیس سال کہا تھا۔“ شاذ۔ اور یہ ابن عیینہؒ کی غلطیوں میں سے ہے، جنہوں نے اس حدیث کی سند اور متن میں غلطی کی ہے، جیسے متن میں ان کا قول ”خریفاً“ (سال) جیسا کہ یہاں ہے، جبکہ سند میں انہوں نے ثوری اور مالک کی مخالفت کی ہے۔ تاہم، میں نے پایا کہ انہوں نے سند میں صحیح قول کی طرف رجوع کر لیا تھا، جیسا کہ میں نے ”المشکل“ حدیث نمبر (86) میں ذکر کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (510) and Muslim (507), and the wording is agreed upon. Note: Al-Bukhārī and Muslim reported the statement of Abū An-Naḍr—one of the narrators—: 'I do not know if he said: forty days, or forty months, or forty years.' Anomalous (Shādh). This is one of the errors of Ibn 'Uyaynah (RH), who made mistakes in the chain and text of this Hadith, such as his wording 'Khārīfan' (autumn/year) as mentioned here. Regarding the chain, he contradicted Ath-Thawrī and Mālik. However, I found that he later returned to the correct chain, as I detailed in 'Al-Mushkil' under Hadith No. (86).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "اَلْمَارُّ",
      "english": "The one who passes",
      "urdu": "گزرنے والا"
    },
    {
      "arabic": "بَيْنَ يَدَيِ اَلْمُصَلِّي",
      "english": "In front of the praying person",
      "urdu": "نمازی کے آگے سے"
    },
    {
      "arabic": "مِنْ اَلْإِثْمِ",
      "english": "Of the sin/penalty",
      "urdu": "گناہ"
    },
    {
      "arabic": "لَكَانَ أَنْ يَقِفَ",
      "english": "It would be better for him to stand",
      "urdu": "اس کے لیے کھڑا رہنا زیادہ بہتر ہو"
    },
    {
      "arabic": "أَرْبَعِينَ خَيْرًا لَهُ",
      "english": "Forty (years) is better for him",
      "urdu": "چالیس (سال) اس کے لیے بہتر ہو"
    },
    {
      "arabic": "خَرِيفًا",
      "english": "Autumns (years)",
      "urdu": "سال"
    },
    {
      "arabic": "سُتْرَة",
      "english": "Barrier/Screen (for prayer)",
      "urdu": "سترہ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث نمازی کے آگے سے گزرنے کی سخت ممانعت اور وعید کو بیان کرتی ہے، اور یہ ایک سخت گناہ کا کام ہے۔ اس میں نبی اکرم صلی اللہ علیہ وسلم نے فرمایا کہ اگر گزرنے والا اس کے گناہ کی سنگینی کو جان لے تو وہ چالیس (دن، مہینے، یا سال) تک انتظار کرنا پسند کرے گا بجائے اس کے کہ وہ نمازی اور اس کے سترہ کے درمیان سے گزرے۔",
    "english": "This Hadith warns against the severe sin and prohibition of passing directly in front of a praying person. The Prophet (ﷺ) stated that if the passerby knew the severity of the sin, he would prefer to wait for forty (days, months, or years) rather than walk between the worshipper and his barrier (Sutrah)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (510)",
      "english": "Reported by Al-Bukhārī (510)"
    },
    {
      "arabic": "رواه مسلم (507)",
      "english": "Reported by Muslim (507)"
    },
    {
      "arabic": "رواه البزار",
      "english": "Reported by Al-Bazzār"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو جهيم بن الحارث",
        "english": "Abū Juḥaym ibn Al-Ḥārith"
      },
      "slug": "abu-juhaym-ibn-al-harith"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "نمازی کے آگے سے گزرنے کا حکم",
        "english": "The Ruling on Passing in Front of a Worshipper"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سخت گناہ اور ممانعت",
              "english": "Severe Sin and Prohibition"
            },
            "content": {
              "urdu": [
                "نمازی کے آگے سے گزرنا ایک کبیرہ گناہ ہے، جس پر نبی اکرم ﷺ نے انتہائی سخت وعید سنائی ہے۔",
                "یہ ممانعت اس لیے ہے کہ گزرنے والے کے عمل سے نمازی کی توجہ ٹوٹتی ہے اور اس کا خشوع متاثر ہوتا ہے۔",
                "اس وعید کی شدت کو چالیس (دن، مہینے یا سال) تک کھڑے رہنے کی فضیلت سے واضح کیا گیا۔"
              ],
              "english": [
                "Passing in front of a praying person is a major sin, against which the Prophet (ﷺ) issued a very severe warning.",
                "This prohibition is because the passerby's action breaks the worshipper's concentration and affects their reverence (Khushu').",
                "The severity of this warning is emphasized by stating that waiting for forty (days, months, or years) is preferable."
              ]
            }
          },
          {
            "title": {
              "urdu": "گزرنے کی حد",
              "english": "The Boundary of Passing"
            },
            "content": {
              "urdu": [
                "یہ ممانعت اس وقت ہوتی ہے جب نمازی نے اپنے آگے سترہ (آڑ/رکاوٹ) رکھی ہو اور کوئی اس سترہ اور نمازی کے درمیان سے گزرے۔",
                "اگر نمازی نے سترہ نہ رکھا ہو، تو ممانعت صرف اس جگہ تک ہے جہاں نمازی سجدہ کرتا ہے (محلِ سجود)۔",
                "سترہ رکھنا سنت ہے، اور یہ نمازی کے لیے تحفظ فراہم کرتا ہے تاکہ کوئی آگے سے نہ گزرے۔"
              ],
              "english": [
                "The prohibition applies when the worshipper has placed a Sutrah (barrier) and someone walks between the Sutrah and the worshipper.",
                "If the worshipper has not set a Sutrah, the prohibition extends only to the area where the worshipper performs prostration (Maḥall As-Sujūd).",
                "Placing a Sutrah is Sunnah and provides protection for the worshipper, preventing others from passing in front."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "چالیس کی مدت کا ابہام",
        "english": "Ambiguity of the 'Forty' Period"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "روایتی ابہام",
              "english": "Narrative Ambiguity"
            },
            "content": {
              "urdu": [
                "حدیث میں 'چالیس' کے بعد دن، مہینہ، یا سال کا ذکر نہیں کیا گیا، جس سے اس کی شدت اور مبالغہ آرائی ظاہر ہوتی ہے۔",
                "راوی (ابو النضر) کا یہ قول کہ 'مجھے نہیں معلوم...' اس ابہام کو مزید واضح کرتا ہے، لیکن یہ گناہ کی سنگینی کو کم نہیں کرتا۔",
                "بزار کی روایت میں 'خریفاً' (سال) کا لفظ اگرچہ شاذ ہے، لیکن یہ اس وعید کی ممکنہ انتہا کو ظاہر کرتا ہے۔"
              ],
              "english": [
                "The Hadith omits specifying 'days,' 'months,' or 'years' after 'forty,' which highlights its intensity and exaggeration (Mubālaghah).",
                "The narrator Abū An-Naḍr's comment ('I do not know...') further clarifies this ambiguity but does not diminish the gravity of the sin.",
                "Although the word 'Khārīfan' (years) in Al-Bazzār's narration is anomalous (Shādh), it indicates the potential extreme of the warning."
              ]
            }
          },
          {
            "title": {
              "urdu": "خلافِ سنت عمل",
              "english": "Action Contrary to Sunnah"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کے حکم میں اتنی سخت وعید کا سبب نماز میں اللہ کے ساتھ بندے کے تعلق کو خراب کرنا ہے۔",
                "اس گناہ کی سنگینی کی وجہ سے بعض فقہاء نے کہا ہے کہ اگر کوئی نماز میں آگے سے گزرے تو نمازی اسے روک سکتا ہے۔",
                "یہ حکم مسلمانوں کو نماز کی حالت میں ایک دوسرے کے حقوق کا خیال رکھنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "The severity of the Prophet's (ﷺ) warning is due to the act disrupting the sacred connection between the worshipper and Allah.",
                "Due to the gravity of this sin, some jurists permit the worshipper to physically prevent the passerby.",
                "This ruling teaches Muslims to respect each other's rights during the state of prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی سبق",
        "english": "Juristic and Practical Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سترہ کا اصول",
              "english": "The Principle of Sutrah"
            },
            "content": {
              "urdu": [
                "مسلمان کو چاہیے کہ وہ جہاں تک ممکن ہو، نماز میں سترہ (دیوار، ستون، یا چھڑی) کا اہتمام کرے۔",
                "سترہ کی مقدار عموماً ایک ذراع (تقریباً ایک ہاتھ) اور موٹائی انگلی کے برابر ہونی چاہیے۔",
                "اگر امام کے سامنے سترہ ہو تو مقتدیوں کے لیے اس کے آگے سے گزرنا جائز ہے، کیونکہ امام کا سترہ سب کا سترہ ہے۔"
              ],
              "english": [
                "A Muslim should, whenever possible, place a Sutrah (wall, column, or stick) in front of him during prayer.",
                "The Sutrah should generally be about the height of a forearm and the thickness of a finger.",
                "If the Imām has a Sutrah, it is permissible for the followers to pass in front of it, as the Imām's Sutrah serves for the entire congregation."
              ]
            }
          },
          {
            "title": {
              "urdu": "گزرنے والے کی ذمہ داری",
              "english": "The Passerby's Responsibility"
            },
            "content": {
              "urdu": [
                "جو شخص نمازی کو نماز میں دیکھے تو اس پر لازم ہے کہ وہ انتظار کرے اور اس کے آگے سے نہ گزرے۔",
                "اگر نمازی اور قبلہ کے درمیان کوئی رکاوٹ (جیسے سترہ) ہو تو اس کے پیچھے سے گزرنا جائز ہے۔",
                "گناہ کی یہ سخت وعید مسلمانوں کو ان کی عبادات کے حقوق کے بارے میں حساس بناتی ہے۔"
              ],
              "english": [
                "A person who sees another praying must wait and should not pass directly in front of him.",
                "It is permissible to pass behind a barrier (like a Sutrah) between the worshipper and the Qiblah.",
                "This severe warning about the sin makes Muslims highly sensitive about the rights of others' worship."
              ]
            }
          }
        ]
      }
    }
  ]
}
