{
  "hadithId": 936,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 8,
    "inKitabBab": 11,
    "arabicBook": "",
    "babId": 74
  },
  "name": {
    "arabic": "عَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { سَأَلَ فُلَانٌ فَقَالَ: يَا رَسُولَ اَللَّهِ! أَرَأَيْتَ أَنْ لَوْ وَجَدَ أَحَدُنَا اِمْرَأَتَهُ عَلَى فَاحِشَةٍ, كَيْفَ يَصْنَعُ? إِنْ تَكَلَّمَ تَكَلَّمَ بِأَمْرٍ عَظِيمٍ, وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ! فَلَمْ يُجِبْهُ, فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ, فَقَالَ: إِنَّ اَلَّذِي سَأَلْتُكَ عَنْهُ قَدِ ابْتُلِيتُ بِهِ, فَأَنْزَلَ اَللَّهُ اَلْآيَاتِ فِي سُورَةِ اَلنُّورِ, فَتَلَاهُنَّ عَلَيْهِ وَوَعَظَهُ وَذَكَّرَهُ، وَأَخْبَرَهُ أَنَّ عَذَابَ اَلدُّنْيَا أَهْوَنُ مِنْ عَذَابِ اَلْآخِرَةِ.‏ قَالَ: لَا, وَاَلَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ عَلَيْهَا, ثُمَّ دَعَاهَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَوَعَظَهَا كَذَلِكَ, قَالَتْ: لَا, وَاَلَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ, فَبَدَأَ بِالرَّجُلِ, فَشَهِدَ أَرْبَعَ شَهَادَاتٍ, ثُمَّ ثَنَّى بِالْمَرْأَةِ, ثُمَّ فَرَّقَ بَيْنَهُمَا.‏ }
رَوَاهُ مُسْلِم ٌ  ",
    "urdu": "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ فلاں صاحب نے سوال کیا اے اللہ کے رسول! بتائیے اگر ہم میں سے کوئی اپنی اہلیہ کو فاحشہ فعل میں مبتلا پائے تو وہ کیا کرے؟ اگر وہ اسے دوسروں سے بیان کرتا ہے تو یہ نہایت قبیح فعل ہے اور اگر خاموش رہتا ہے تو یہ بھی نہایت قبیح فعل ہے۔ آپ صلی اللہ علیہ وسلم نے اس کا کوئی جواب نہ دیا۔ پھر بعد میں جب وہ آیا تو اس نے کہا کہ تحقیق جو کچھ میں نے آپ صلی اللہ علیہ وسلم سے پوچھا ہے، میں خود ہی اس میں مبتلا ہوں۔ پس اللہ تعالیٰ نے سورۃ النور کی آیات نازل فرمائیں۔ آپ صلی اللہ علیہ وسلم نے وہ آیات اس کے سامنے پڑھیں اور اسے نصیحت فرمائی اور اللہ کی سزا یاد کرائی اور فرمایا کہ ”دنیا کا عذاب آخرت کے عذاب سے بہت ہلکا ہے۔ وہ بولا نہیں قسم ہے اس ذات کی جس نے آپ صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث فرمایا ہے، میں نے اس پر جھوٹا الزام نہیں لگایا ہے۔“ پھر رسول اللہ صلی اللہ علیہ وسلم نے اس عورت کو بلوایا اور اسے بھی اسی طرح نصیحت فرمائی۔ وہ بھی بولی نہیں اس خدا کی قسم! جس نے آپ صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث فرمایا ہے یقیناً وہ مرد جھوٹا ہے۔ پھر آپ صلی اللہ علیہ وسلم نے اس مرد سے آغاز فرمایا۔ اس مرد نے چار قسمیں کھائیں پھر آپ صلی اللہ علیہ وسلم نے عورت سے بھی قسمیں لیں اور دونوں کے درمیان تفریق فرما دی۔ (مسلم) ",
    "english": " "
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه مسلم (1493)‏ (4)‏ وقد اختصره الحافظ هنا، وهو بتمامه في مسلم: من طريق سعيد بن جبير قال: سئلت عن المتلاعنين في إمرة مصعب.‏ أيفرق بينهما؟ قال: فما دريت ما أقول: فمضيت إلى منزل ابن عمر بمكة.‏ فقالت للغلام: استأذن لي.‏ قال: إنه قائل.‏ فسمع صوتي.‏ قال: ابن جبير؟ قلت: نعم.‏ قال: ادخل.‏ فوالله ما جاء بك هذه الساعة إلا حاجة.‏ فدخلت.‏ فإذا هو مفترش برذعة.‏ متوسد وسادة حشوها ليف.‏ قلت: أبا عبد الرحمن! المتلاعنان، أيفرق بينهما؟ قال: سبحان الله! نعم.‏ إن أول من سأل عن ذلك فلان بن فلان.‏ قال: يا رسول الله! أرأيت أن لو وجد أحدنا امرأته على فاحشة، كيف يصنع؟! إن تكلم تكلم بأمر عظيم، وإن سكت سكت على مثل ذلك.‏ قال: فسكت النبي صلى الله عليه وسلم فلم يجبه، فلما كان بعد ذلك أتاه، فقال: إن الذي سألتك عنه قد ابتليت به.‏ فأنزل الله عز وجل هؤلاء الآيات في سورة النور: "والذين يرمون أزواجهم…" [النور: 6 ‏- 9] فتلاهن عليه، ووعظه، وذكره.‏ وأخبره أن عذاب الدنيا أهون من عذاب الآخرة.‏ قال: لا.‏ والذي بعثك بالحق ما كذبت عليها.‏ ثم دعاها فوعظها وذكرها، وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة.‏ قالت: لا.‏ والذي بعثك بالحق إنه لكاذب.‏ فبدأ بالرجل، فشهد أربع شهادات بالله إنه لمن الصادقين.‏ والخامسة أن لعنة الله عليه إن كان من الكاذبين.‏ ثم ثنى بالمرأة، فشهدت أربع شهادات بالله إنه لمن الكاذبين، والخامسة أن غضب الله عليها إن كان من الصادقين.‏ ثم فرق بينهما.‏ ",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
