{
  "hadithId": 727,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 7,
    "inKitabBab": 6,
    "arabicBook": "",
    "babId": 47
  },
  "name": {
    "arabic": " عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اَلرَّحْمَنِ, عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- [ قَالَ ]: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ, فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ } مُتَّفَقٌ عَلَيْهِ  وَرَوَاهُ أَبُو دَاوُدَ, وَمَالِكٌ: مِنْ رِوَايَةِ أَبِي بَكْرِ بْنِ عَبْدِ اَلرَّحْمَنِ مُرْسَلًا بِلَفْظِ: { أَيُّمَا رَجُلٌ بَاعَ مَتَاعًا فَأَفْلَسَ اَلَّذِي اِبْتَاعَهُ, وَلَمْ يَقْبِضِ اَلَّذِي بَاعَهُ مِنْ ثَمَنِهِ شَيْئًا , فَوَجَدَ مَتَاعَهُ بِعَيْنِهِ, فَهُوَ أَحَقُّ بِهِ, وَإِنْ مَاتَ اَلْمُشْتَرِي فَصَاحِبُ اَلْمَتَاعِ أُسْوَةُ اَلْغُرَمَاءِ }  وَوَصَلَهُ اَلْبَيْهَقِيُّ, وَضَعَّفَهُ تَبَعًا لِأَبِي دَاوُدَ  وَرَوَى أَبُو دَاوُدَ, وَابْنُ مَاجَهْ: مِنْ رِوَايَةِ عُمَرَ بْنِ خَلْدَةَ قَالَ: أَتَيْنَا أَبَا هُرَيْرَةَ فِي صَاحِبٍ لَنَا قَدْ أَفْلَسَ, فَقَالَ: لَأَقْضِيَنَّ فِيكُمْ بِقَضَاءِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَفْلَسَ أَوْ مَاتَ فَوَجَدَ رَجُلٌ مَتَاعَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ } وَصَحَّحَهُ اَلْحَاكِمُ, وَضَعَّفَ أَبُو دَاوُدَ هَذِهِ اَلزِّيَادَةَ فِي ذِكْرِ اَلْمَوْتِ",
    "urdu": "یدنا ابوبکر بن عبدالرحمٰن نے سیدنا ابوہریرہ رضی اللہ عنہ سے روایت کیا کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا کہ ”جو شخص مفلس کے پاس اپنی چیز بعینہ اسی حالت میں پائے تو وہ اس کا دوسرے کی بہ نسبت زیادہ حقدار ہے۔ (بخاری و مسلم) ابوداؤد اور مالک نے ابوبکر بن عبدالرحمٰن سے ان الفاظ کے ساتھ مرسل روایت بیان کی ہے کہ ”کوئی آدمی اگر کوئی چیز بیچے اور خریدنے والا مفلس ہو جائے اور بیچنے والے کو اس کی قیمت میں سے ابھی کچھ بھی نہیں ملا تو (اس صورت میں) اگر وہ بعینہ اپنا مال پا لیتا ہے تو وہ اس مال کا زیادہ حقدار ہے اور اگر خریدار مر جائے تو پھر صاحب مال دوسرے قرض خواہوں کے برابر ہے۔ بیہقی نے اسے موصول بیان کیا ہے اور ابوداؤد کی اتباع میں اسے ضعیف کہا ہے۔ ابوداؤد اور ابن ماجہ نے اسے عمر بن خلدۃ کی روایت سے بیان کیا ہے کہ ہم اپنے ایک ساتھی کے لئے جو مفلس ہو گیا تھا ابوہریرہ رضی اللہ عنہ کے پاس آئے تو انہوں نے کہا کہ میں تمہارے معاملے میں رسول اللہ صلی اللہ علیہ وسلم والا ہی فیصلہ کروں گا (اور وہ یہ تھا کہ) جو کوئی مفلس ہو جائے یا مر جائے اور کوئی آدمی اس کے پاس اپنی چیز بعینہ پا لے تو وہ ہی اس کا سب سے زیادہ حقدار ہے۔ حاکم نے اسے صحیح کہا ہے اور ابوداؤد نے ضعیف کہا ہے اور اسی طرح ابوداؤد نے اس زیادتی کو جو موت کے ذکر میں ہے، ضعیف کہا ہے۔ ",
    "english": " "
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه البخاري ( 2402 )‏، ومسلم ( 1559 )‏.‏ رواه مالك في " الموطأ ( 2 / 678 )‏، وأبو داود ( 3520 )‏، عن ابن شهاب، عن أبي بكر بن عبد الرحمن مرسلا به.‏ وتابع مالكا يونس، عن ابن شهاب مرسلا به.‏ رواه أبو داود ( 3521 )‏ وقال: فذكر معنى حديث مالك؛ وزاد: " وإن قضى من ثمنها شيئا، فهو أسوة الغرماء فيها ".‏ وخالفهما محمد بن الوليد الزبيدي كما في التعليق التالي.‏  رواه أبو داود ( 3522 )‏، والبيهقي ( 6 / 47 )‏، من طريق محمد بن الوليد الزبيدي، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، عن النبي ‏-صلى الله عليه وسلم‏- نحوه.‏ وزاد: " وأيما امرئ هلك، وعنده متاع امرئ بعينه، اقتضى منه شيئا أو لم يقتض، فهو أسوة الغرماء ".‏ وقال أبو داود: " حديث مالك أصح ".‏ وقال البيهقي: " لا يصح.‏ يعني: موصولا ".‏ قلت: ومال الحافظ إلى تصحيحه في " الفتح " وفي " التلخيص " وأفصح عن ذلك شيخنا في " الإرواء " ( 5 / 270 )‏ وذكر هناك ما يشهد له.‏  رواه أبو داود ( 3523 )‏، وابن ماجه ( 2360 )‏، والحاكم ( 2 / 50 )‏ وسنده ضعيف؛ إذ فيه أحد المجاهيل، إلا أنه أحد شواهد الرواية السابقة.‏",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
