{
  "hadithId": 207,
  "hadithNo": 13,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { مَا أُمِرْتُ بِتَشْيِيدِ اَلْمَسَاجِدِ } أَخْرَجَهُ أَبُو دَاوُدَ , وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏",
    "urdu": " سیدنا ابن عباس رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مجھے مساجد کی آرائش و زیبائش (پختہ اور بلند عمارت) کا حکم نہیں دیا گیا۔“ اسے ابوداؤد نے روایت کیا ہے۔ ابن حبان نے اس کو صحیح قرار دیا ہے۔",
    "english": "Narrated from Ibn 'Abbas (may Allah be pleased with them both) who said: The Messenger of Allah (peace and blessings be upon him) said: \"I have not been commanded to erect lofty (Tashyīd) or elaborate structures for the mosques.\" Reported by Abu Dawud, and Ibn Hibban graded it Sahih (Authentic)."
  },
  "takhreej": {
    "arabic": "صحيح. رواه أبو داود في كتاب الصلاة، باب في بناء المساجد (448)، وابن حبان في صحيحه (1615). وقد علق البخاري على قول ابن عباس الموقوف: 'لتزخرفنها كما زخرفتها اليهود والنصارى' (بصيغة الجزم).",
    "urdu": "صحیح۔ اسے ابو داؤد نے کتاب الصلاة، باب فی بناء المساجد (448) میں اور ابن حبان نے صحیحہ (1615) میں روایت کیا ہے۔ ابن عباس کا موقوف قول کہ 'تم انہیں ضرور آراستہ کرو گے جیسے یہود و نصاریٰ نے کیا' کو امام بخاری نے جزم کے ساتھ نقل کیا ہے۔",
    "english": "Authentic (Sahih). Reported by Abu Dawud in the Book of Prayer, Chapter: Building the mosques (448), and Ibn Hibban in his Sahih (1615). The saying attributed to Ibn 'Abbas: 'You will surely decorate them just as the Jews and Christians decorated them,' was confirmed by Al-Bukhari (in a suspended narration)."
  },
  "importantWords": [
    {
      "arabic": "ما أمرت",
      "english": "I was not commanded",
      "urdu": "مجھے حکم نہیں دیا گیا"
    },
    {
      "arabic": "بتشييد",
      "english": "To erect lofty/elaborate structures",
      "urdu": "شاندار/بلند عمارتیں بنانے کا"
    },
    {
      "arabic": "المساجد",
      "english": "The Mosques",
      "urdu": "مسجدیں"
    },
    {
      "arabic": "لتزخرفنها",
      "english": "You will certainly adorn/decorate them",
      "urdu": "تم انہیں ضرور آراستہ کرو گے"
    },
    {
      "arabic": "اليهود والنصارى",
      "english": "The Jews and Christians",
      "urdu": "یہود و نصاریٰ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اس بات کو واضح کرتی ہے کہ اللہ کے رسول صلی اللہ علیہ وسلم کو مساجد کی ظاہری شان و شوکت، بلند و بالا عمارتیں اور آرائشی تزئین و آرائش کا حکم نہیں دیا گیا تھا۔ اس حکم میں یہ حکمت پوشیدہ ہے کہ مساجد کی سادگی کو برقرار رکھا جائے تاکہ وہ ریاکاری اور دنیاوی فخر کا ذریعہ نہ بنیں، جو یہود و نصاریٰ کی امتوں کا طریقہ تھا۔",
    "english": "This Hadith clarifies that the Messenger of Allah (PBUH) was not commanded to focus on the outward grandeur, tall structures, and excessive decorative ornamentation of mosques. The wisdom behind this command is to maintain the simplicity of mosques so they do not become a source of ostentation or worldly pride, which was the practice of the Jewish and Christian communities."
  },
  "references": [
    {
      "arabic": "سنن أبي داود، كتاب الصلاة، باب في بناء المساجد (448)",
      "english": "Sunan Abu Dawud, Book of Prayer, Chapter: Building the mosques (448)"
    },
    {
      "arabic": "صحيح ابن حبان، كتاب الصلاة، باب ما جاء في كراهية زخرفة المساجد (1615)",
      "english": "Sahih Ibn Hibban, Book of Prayer, Chapter: What has been related concerning the dislike of mosque ornamentation (1615)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عباس",
        "english": "Abdullah ibn Abbas"
      },
      "slug": "abdullah-ibn-abbas"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=S8L_o_0aJkU",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اسلام میں تعمیرِ مسجد کا اصول",
        "english": "The Principle of Mosque Construction in Islam"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سادگی کا حکم",
              "english": "Command for Simplicity"
            },
            "content": {
              "urdu": [
                "نبی صلی اللہ علیہ وسلم نے مسجدوں کی تعمیر میں سادگی اور تواضع کو ترجیح دی، نہ کہ تزئین کو۔",
                "مسجد نبوی کی ابتدائی تعمیر کچی اینٹوں اور کھجور کے پتوں سے کی گئی تھی جو اس کی سادگی کو ظاہر کرتی ہے۔",
                "دین میں حکم یہ ہے کہ مسجدیں نمازیوں کو ٹھہرانے اور ان کی طہارت کے لیے کافی ہوں۔"
              ],
              "english": [
                "The Prophet (PBUH) prioritized simplicity and humility in mosque construction, not ornamentation.",
                "The early construction of the Prophet's Mosque, using unbaked bricks and palm leaves, illustrates its simplicity.",
                "The religious command is that mosques should be sufficient to accommodate worshippers and maintain purity."
              ]
            }
          },
          {
            "title": {
              "urdu": "تشييد اور زخرف کا مفہوم",
              "english": "Meaning of Tashyīd and Zukhruf"
            },
            "content": {
              "urdu": [
                "تشیید سے مراد عمارت کو بہت اونچا اور پختہ (چونے اور پتھروں سے) بنانا ہے، جو فضول خرچی ہے۔",
                "زخرف (آرائش) سے مراد سونے چاندی یا رنگین پتھروں سے غیر ضروری سجاوٹ کرنا ہے۔",
                "یہ دونوں کام مسجد کے اصل مقصد اور روحانیت میں کمی لاتے ہیں، اس لیے منع ہیں۔"
              ],
              "english": [
                "Tashyīd refers to making the building excessively tall and solid (with lime/plaster and stones), which is extravagance.",
                "Zukhruf (decoration) refers to unnecessary ornamentation with gold, silver, or colored stones.",
                "Both actions diminish the mosque's original purpose and spirituality, hence they are prohibited."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "یہود و نصاریٰ سے مشابہت کا خطرہ",
        "english": "Risk of Imitating Jews and Christians"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مذمت کی وجہ",
              "english": "Reason for Condemnation"
            },
            "content": {
              "urdu": [
                "حضرت ابن عباس کا قول واضح کرتا ہے کہ مسجدوں کی زیبائش پہلی امتوں کی گمراہی کا نتیجہ تھی۔",
                "ان امتوں نے جب دین کے اصول بدلے تو ان کی ظاہری عبادات میں تکلف اور ریاکاری بڑھ گئی۔",
                "مسلمانوں کو ان کے نقش قدم پر چلنے سے منع کیا گیا ہے تاکہ وہ اصلیتِ دین پر قائم رہیں۔"
              ],
              "english": [
                "Ibn 'Abbas's saying clarifies that mosque decoration was a result of the deviation of previous nations.",
                "When those nations altered their religious principles, extravagance and ostentation increased in their outward worship.",
                "Muslims are prohibited from following their footsteps to remain firm on the true essence of the religion."
              ]
            }
          },
          {
            "title": {
              "urdu": "ریاکاری کا دروازہ",
              "english": "The Door to Ostentation (Riya')"
            },
            "content": {
              "urdu": [
                "تشیید اور زخرف کا مقصد عموماً لوگوں کو دکھانا اور ایک دوسرے پر فخر کرنا ہوتا ہے (جیسا کہ پچھلی حدیث میں ذکر ہوا)۔",
                "مسجد کی تعمیر میں اخلاص ہونا چاہیے، نہ کہ شہرت یا دنیاوی ستائش کی طلب۔",
                "جب عبادت گاہیں فخر کا ذریعہ بن جائیں تو عبادت کا اجر و ثواب کم ہو جاتا ہے۔"
              ],
              "english": [
                "The purpose of Tashyīd and Zukhruf is often to show off to people and compete (as mentioned in the previous Hadith).",
                "Sincerity should be the driving force behind mosque construction, not the pursuit of fame or worldly praise.",
                "When places of worship become a source of boasting, the reward of the worship diminishes."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور عملی اصول",
        "english": "Juristic and Practical Principles"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مساجد میں زینت کا حکم",
              "english": "Ruling on Decoration in Mosques"
            },
            "content": {
              "urdu": [
                "سادگی کا اصول رکھتے ہوئے، مساجد کی مضبوطی، پائیداری اور طہارت پر خرچ کرنا ضروری ہے۔",
                "وہ معمولی آرائش جائز ہے جو نمازی کو کوئی خلل نہ دے اور طہارت و روشنی کو بہتر بنائے۔",
                "لیکن عمارت کو بہت اونچا بنانا، غیر ضروری نقش و نگار کرنا مکروہ تحریمی کے قریب ہے۔"
              ],
              "english": [
                "While adhering to the principle of simplicity, spending on the strength, durability, and cleanliness of mosques is necessary.",
                "Modest ornamentation that does not distract the worshipper and improves purity and lighting is permissible.",
                "However, making the building excessively tall or adding unnecessary designs is close to being severely disliked (Makruh Tahrimi)."
              ]
            }
          },
          {
            "title": {
              "urdu": "مال کا بہترین استعمال",
              "english": "Best Use of Wealth"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو ترجیح دینی چاہیے کہ وہ مالی وسائل کو غریبوں، مسکینوں اور دینی تعلیم پر خرچ کریں۔",
                "جبکہ مسجد کو مضبوطی سے تعمیر کیا جائے تاکہ وہ موسمی سختیوں سے محفوظ رہے اور عبادت میں خلل نہ آئے۔",
                "مسجد کے بجٹ کا زیادہ حصہ انسانوں کی فلاح و بہبود اور عبادت کی سہولت پر خرچ ہونا چاہیے۔"
              ],
              "english": [
                "Muslims should prioritize spending financial resources on the poor, needy, and religious education.",
                "The mosque should be built strongly to protect it from weather elements and prevent disruption of worship.",
                "The mosque's budget should primarily be spent on human welfare and facilitating worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "معاشرتی پیغام",
        "english": "Social Message"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ظاہری اور باطنی ترقی",
              "english": "Outward and Inner Development"
            },
            "content": {
              "urdu": [
                "یہ حکم ہمیں سکھاتا ہے کہ امت کی اصل ترقی عمارتوں کی شان سے نہیں بلکہ کردار اور ایمان کی مضبوطی سے ہوتی ہے۔",
                "جب ظاہری سجاوٹ پر زور بڑھ جاتا ہے تو لوگ باطنی اخلاص سے دور ہو جاتے ہیں۔",
                "مسجد کو دیکھ کر ہمیں دنیا کی یاد نہیں بلکہ اللہ کی عظمت اور سادگی کی یاد آنی چاہیے۔"
              ],
              "english": [
                "This command teaches us that the real development of the Ummah comes from strength of character and faith, not architectural splendor.",
                "When emphasis on outward decoration increases, people move away from inner sincerity.",
                "Upon seeing the mosque, we should be reminded of the greatness of Allah and simplicity, not the worldly domain."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی کی سنت پر عمل",
              "english": "Following the Prophet's Sunnah"
            },
            "content": {
              "urdu": [
                "اگر مسلمان ہر کام میں نبی صلی اللہ علیہ وسلم کی سادگی کو اپنائیں تو بہت سے مالی اور روحانی مسائل حل ہو سکتے ہیں۔",
                "مساجد کو تمام امت کے لیے مشترکہ اور پُرسکون گھر کی طرح ہونا چاہیے۔",
                "صحیح اور سادہ تعمیر اللہ کی رضا کے قریب تر ہے، جو اصل مقصد ہے۔"
              ],
              "english": [
                "If Muslims adopt the Prophet's simplicity in all matters, many financial and spiritual problems can be solved.",
                "Mosques should feel like a shared, tranquil home for the entire community.",
                "Simple and correct construction is closer to Allah's pleasure, which is the ultimate goal."
              ]
            }
          }
        ]
      }
    }
  ]
}
