{
  "hadithId": 209,
  "hadithNo": 15,
  "hadithReferences": {
    "sunnah.com": ["2", "6"],
    "kitabId": 2,
    "inKitabBab": 6,
    "arabicBook": "كتاب الصلاة",
    "babId": 16
  },
  "name": {
    "arabic": "وَعَنْ أَبِي قَتَادَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- { إِذَا دَخَلَ أَحَدُكُمْ اَلْمَسْجِدَ فَلَا يَجْلِسْ حَتَّى يُصَلِّيَ رَكْعَتَيْنِ } مُتَّفَقٌ عَلَيْهِ .‏",
    "urdu": "سیدنا ابو قتادہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے کوئی جب (بھی) مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت (نفل) ادا کر لے۔“ (بخاری ومسلم) ",
    "english": "Narrated from Abu Qatadah (may Allah be pleased with him): The Messenger of Allah (peace and blessings be upon him) said: \"When any one of you enters the mosque, he should not sit until he has prayed two Rak'ah (units of prayer).\" Agreed upon (Al-Bukhari and Muslim)."
  },
  "takhreej": {
    "arabic": "صحيح متفق عليه. رواه البخاري في كتاب الصلاة، باب إذا دخل المسجد فليصل ركعتين (1163)، ومسلم في كتاب صلاة المسافرين وقصرها، باب استحباب ركعتي الطواف وتحية المسجد (714).",
    "urdu": "صحیح متفق علیہ۔ اسے بخاری نے کتاب الصلاة، باب إذا دخل المسجد فلیصل رکعتین (1163) میں روایت کیا ہے، اور مسلم نے کتاب صلاة المسافرین وقصرھا، باب استحباب رکعتی الطواف وتحیة المسجد (714) میں روایت کیا ہے۔",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh). Reported by Al-Bukhari in the Book of Prayer, Chapter: When one enters the mosque, let him pray two Rak'ah (1163), and by Muslim in the Book of Traveler's Prayer and Shortening it, Chapter: Recommendation of the two Rak'ah of Tawaf and Tahiyyat Al-Masjid (714)."
  },
  "importantWords": [
    {
      "arabic": "إذا دخل",
      "english": "When he enters",
      "urdu": "جب داخل ہو"
    },
    {
      "arabic": "المسجد",
      "english": "The Mosque",
      "urdu": "مسجد"
    },
    {
      "arabic": "فلا يجلس",
      "english": "He should not sit",
      "urdu": "تو نہ بیٹھے"
    },
    {
      "arabic": "حتى يصلي",
      "english": "Until he prays",
      "urdu": "جب تک نماز نہ پڑھ لے"
    },
    {
      "arabic": "ركعتين",
      "english": "Two Rak'ah (units)",
      "urdu": "دو رکعتیں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث مسجد میں داخل ہونے کے ایک اہم ادب کو بیان کرتی ہے جسے 'تحیۃ المسجد' (مسجد کا حق یا احترام) کہتے ہیں۔ نبی صلی اللہ علیہ وسلم نے فرمایا کہ مسجد میں داخل ہونے والا شخص بیٹھنے سے پہلے دو رکعت نفل ضرور ادا کرے، یہ حکم مسجد کی حرمت اور اس کے آداب کی وجہ سے دیا گیا ہے۔",
    "english": "This Hadith clarifies an important etiquette of entering the mosque called 'Tahiyyat Al-Masjid' (Greeting the Mosque). The Prophet (PBUH) commanded that anyone entering the mosque must pray two voluntary Rak'ah before sitting down. This ruling is due to the sanctity and etiquette of the mosque."
  },
  "references": [
    {
      "arabic": "صحيح البخاري، كتاب الصلاة، باب إذا دخل المسجد فليصل ركعتين (1163)",
      "english": "Sahih Al-Bukhari, Book of Prayer, Chapter: When one enters the mosque, let him pray two Rak'ah (1163)"
    },
    {
      "arabic": "صحيح مسلم، كتاب صلاة المسافرين وقصرها، باب استحباب ركعتي الطواف وتحية المسجد (714)",
      "english": "Sahih Muslim, Book of Traveler's Prayer and Shortening it, Chapter: Recommendation of the two Rak'ah of Tawaf and Tahiyyat Al-Masjid (714)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abu Qatadah Al-Ansari"
      },
      "slug": "abu-qatadah-al-ansari"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kYv0R2cM5nE",
  "grade": {
    "arabic": "صحيح متفق عليه",
    "english": "Authentic, Agreed upon (Sahih Muttafaq 'Alayh)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "تحیۃ المسجد کی اہمیت",
        "english": "Importance of Tahiyyat Al-Masjid (Greeting the Mosque)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد کا ادب",
              "english": "Etiquette of the Mosque"
            },
            "content": {
              "urdu": [
                "تحیۃ المسجد ایک مستحب یا بعض علماء کے نزدیک واجب نفل ہے، جو مسجد کے احترام کے لیے ادا کی جاتی ہے۔",
                "یہ نماز نمازی کے لیے مسجد میں داخل ہونے کے بعد اللہ سے تعلق قائم کرنے کا پہلا عمل ہے۔",
                "مسجد اللہ کا گھر ہے، اور اس کے اندر داخل ہونے پر پہلے اس کے حق (نماز) کو ادا کرنا لازم ہے۔"
              ],
              "english": [
                "Tahiyyat Al-Masjid is a recommended Sunnah or, according to some scholars, an obligatory Nafl (voluntary) prayer performed to honor the mosque.",
                "This prayer is the worshipper's first act of connection with Allah upon entering His House.",
                "The mosque is the House of Allah, and upon entering it, one must first fulfill its right (the prayer)."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز سے پہلے بیٹھنے کی ممانعت",
              "english": "Prohibition of Sitting Before Prayer"
            },
            "content": {
              "urdu": [
                "حدیث میں 'فلا يجلس' (پس وہ نہ بیٹھے) کا حکم اس عمل کی تاکید کو ظاہر کرتا ہے۔",
                "یہ ممانعت دراصل دنیاوی امور سے گریز اور اللہ کے گھر میں عبادت کو مقدم کرنے کا درس ہے۔",
                "اگر امام خطبہ دے رہا ہو تو بیٹھ جانا چاہیے، کیونکہ خطبہ سننا واجب ہے جو نفل سے افضل ہے۔"
              ],
              "english": [
                "The command 'Fahā Yajlis' (he should not sit) indicates the emphasized nature of this action.",
                "This prohibition is essentially a lesson in avoiding worldly matters and prioritizing worship in Allah's House.",
                "If the Imam is delivering the sermon (Khutbah), one should sit, as listening to the Khutbah is obligatory and takes precedence over Nafl prayer."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی مسائل اور استثنائی صورتیں",
        "english": "Juristic Issues and Exemptions"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "تحیۃ المسجد کا حکم",
              "english": "Ruling of Tahiyyat Al-Masjid"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء کے نزدیک یہ سنتِ مؤکدہ (مضبوط سنت) ہے، جو کہ واجب کے قریب ہے۔",
                "یہ نماز ہر وقت جائز ہے، یہاں تک کہ ممنوعہ اوقات (طلوع، غروب) میں بھی بعض علماء نے اسے جائز رکھا ہے۔",
                "اگر کسی شخص نے مسجد میں داخل ہوتے ہی فرض نماز یا کوئی دوسری سنت ادا کر لی تو تحیۃ المسجد ادا ہو جاتی ہے۔"
              ],
              "english": [
                "According to the majority of jurists, it is a Sunnah Mu'akkadah (emphasized Sunnah), bordering on being obligatory.",
                "This prayer is permissible at all times; some scholars permit it even during prohibited times (sunrise, sunset).",
                "If a person performs a compulsory prayer or any other Sunnah prayer immediately upon entering the mosque, it fulfills the purpose of Tahiyyat Al-Masjid."
              ]
            }
          },
          {
            "title": {
              "urdu": "استثنائی حالات",
              "english": "Exceptional Circumstances"
            },
            "content": {
              "urdu": [
                "اگر کوئی شخص بہت تھکا ہوا ہو یا بھوک سے بے حال ہو تو بیٹھنے کی گنجائش ہو سکتی ہے۔",
                "ایسی حالت جب جماعت کھڑی ہو جائے یا نماز کا وقت بہت کم رہ جائے تو تحیۃ المسجد چھوڑ دی جاتی ہے۔",
                "تحیۃ المسجد ادا نہ کرنے کی اجازت صرف جائز ضرورت اور عذر کی بنا پر ہی ہے۔"
              ],
              "english": [
                "If a person is extremely tired or famished, there may be room for sitting down first.",
                "If the congregational prayer has started or the prayer time is very short, Tahiyyat Al-Masjid is omitted.",
                "Permission not to perform Tahiyyat Al-Masjid is only granted based on a legitimate need or excuse."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "روحانی اور تربیتی سبق",
        "english": "Spiritual and Educational Lesson"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مسجد سے تعلق",
              "english": "Connection with the Mosque"
            },
            "content": {
              "urdu": [
                "تحیۃ المسجد مسجد سے والہانہ تعلق اور محبت کا ایک عملی اظہار ہے۔",
                "نماز کے ذریعے مسجد کو 'سلام' کرنا اس بات کا اعلان ہے کہ یہ جگہ صرف اللہ کے لیے وقف ہے۔",
                "جو شخص اس عمل کی پابندی کرتا ہے، اس کے دل میں مسجد کی قدر و منزلت بڑھتی ہے۔"
              ],
              "english": [
                "Tahiyyat Al-Masjid is a practical expression of deep attachment and love for the mosque.",
                "Greeting the mosque through prayer is an announcement that this place is dedicated solely to Allah.",
                "The person who adheres to this practice increases the value and importance of the mosque in their heart."
              ]
            }
          },
          {
            "title": {
              "urdu": "خشوع کی تیاری",
              "english": "Preparation for Khushu' (Concentration)"
            },
            "content": {
              "urdu": [
                "یہ دو رکعت نفل دراصل نمازِ فرض کے لیے قلبی اور ذہنی طور پر تیار ہونے کا ذریعہ ہیں۔",
                "اس سے دنیاوی خیالات کو جھٹک کر اللہ کے حضور حاضری کے لیے یکسوئی پیدا ہوتی ہے۔",
                "اسلام ہر عبادت کی ابتدا آداب اور اخلاص کی حالت سے کرنے کی تعلیم دیتا ہے۔"
              ],
              "english": [
                "These two units of Nafl prayer are essentially a means of preparing the heart and mind for the obligatory prayer.",
                "It helps in discarding worldly thoughts and achieving concentration for presenting oneself before Allah.",
                "Islam teaches starting every act of worship with proper etiquette and a state of sincerity."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی رہنمائی اور تذکرہ",
        "english": "Practical Guidance and Remembrance"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "سنت کی ادائیگی میں جلدی",
              "english": "Promptness in Fulfilling the Sunnah"
            },
            "content": {
              "urdu": [
                "چونکہ حکم بیٹھنے سے پہلے کا ہے، اس لیے مسجد میں داخل ہوتے ہی یہ نفل فوراً ادا کرنی چاہیے۔",
                "یہ جلدی نیکی کے کاموں میں سبقت اور رغبت کا مظاہرہ کرتی ہے۔",
                "نبی صلی اللہ علیہ وسلم نے اس کے چھوڑنے کی ممانعت کو سخت لہجے میں بیان کیا ہے۔"
              ],
              "english": [
                "Since the command is before sitting, this Nafl prayer should be performed immediately upon entering the mosque.",
                "This promptness demonstrates eagerness and keenness in performing good deeds.",
                "The Prophet (PBUH) emphasized the prohibition of omitting it in a strict tone."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحابہ کا عمل",
              "english": "Action of the Companions"
            },
            "content": {
              "urdu": [
                "ایک واقعہ میں جب ایک صحابی (سُلیک الغطفانی) بیٹھ گئے تو نبی صلی اللہ علیہ وسلم نے انہیں اٹھا کر نماز پڑھنے کا حکم دیا۔",
                "یہ حکم زبانی تلقین کے ساتھ عملی مظاہرہ بھی ہے کہ یہ دو رکعتیں کتنی اہم ہیں۔",
                "نبی کا یہ عمل اس بات کی دلیل ہے کہ مسجد کے آداب میں کوتاہی نہیں ہونی چاہیے۔"
              ],
              "english": [
                "In one incident, when a Companion (Sulayk Al-Ghatfani) sat down, the Prophet (PBUH) ordered him to stand up and pray.",
                "This command is a practical demonstration alongside verbal instruction about the great importance of these two Rak'ah.",
                "This action by the Prophet proves that there should be no negligence regarding the mosque's etiquette."
              ]
            }
          }
        ]
      }
    }
  ]
}
