{
  "hadithId": 144,
  "hadithNo": 1,
  "hadithReferences": {
    "sunnah.com": ["1:3:1"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": " عَنْ عَبْدِ اَللَّهِ بْنِ زَيْدِ بْنِ عَبْدِ رَبِّهِ ‏- رضى الله عنه ‏- قَالَ: { طَافَ بِي ‏-وَأَنَا نَائِمٌ‏- رَجُلٌ فَقَالَ: تَقُولُ: \"اَللَّهُ أَكْبَرَ اَللَّهُ أَكْبَرُ, فَذَكَرَ اَلْآذَانَ ‏- بِتَرْبِيع اَلتَّكْبِيرِ بِغَيْرِ تَرْجِيعٍ, وَالْإِقَامَةَ فُرَادَى, إِلَّا قَدْ قَامَتِ اَلصَّلَاةُ ‏- قَالَ: فَلَمَّا أَصْبَحْتُ أَتَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \"إِنَّهَا لَرُؤْيَا حَقٍّ.‏.‏.‏\" } اَلْحَدِيثَ.‏ أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ خُزَيْمَةَ  وَزَادَ أَحْمَدُ فِي آخِرِهِ قِصَّةَ قَوْلِ بِلَالٍ فِي آذَانِ اَلْفَجْرِ: { اَلصَّلَاةُ خَيْرٌ مِنَ اَلنَّوْمِ }  وَلِابْنِ خُزَيْمَةَ: عَنْ أَنَسٍ قَالَ: { مِنْ اَلسُّنَّةِ إِذَا قَالَ اَلْمُؤَذِّنُ فِي اَلْفَجْرِ: حَيٌّ عَلَى اَلْفَلَاحِ, قَالَ: اَلصَّلَاةُ خَيْرٌ مِنَ اَلنَّوْمِ }",
    "urdu": " سیدنا عبداللہ بن زید بن عبدربہ رضی اللہ عنہ نے فرمایا کہ خواب میں مجھے ایک آدمی ملا جس نے مجھے کہا کہ کہو «الله أكبر الله أكبر» پھر اس نے ساری اذان کہی، چار مرتبہ «الله أكبر» کہا۔ بغیر ترجیع کے اور اقامت میں صرف ایک ایک مرتبہ کہا، مگر «قد قامت الصلاة» کو دو مرتبہ کہا۔ صبح جب میں بیدار ہوا تو میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا (اور اپنا خواب آپ صلی اللہ علیہ وسلم کو سنایا) آپ صلی اللہ علیہ وسلم نے فرمایا ”یقیناً یہ خواب سچا ہے۔“ اس حدیث کو احمد اور ابوداؤد نے روایت کیا ہے۔ ترمذی اور ابن خزیمہ نے صحیح قرار دیا ہے۔ احمد نے اس روایت کے آخر میں سیدنا بلال رضی اللہ عنہ کی فجر کی اذان میں «الصلاة خير من النوم» کا قصہ بھی مزید بیان کیا ہے اور ابن خزیمہ میں سیدنا انس رضی اللہ عنہ سے ہے کہ انہوں نے فرمایا سنت ہے کہ جب مؤذن صبح کی اذان میں «حي على الفلاح» کہے تو وہ کہے «الصلاة خير من النوم» ۔",
    "english": "Narrated 'Abdullāh ibn Zayd ibn 'Abd Rabbih (RA): He said: 'A man went around me while I was sleeping and said, 'Say: Allāhu Akbar, Allāhu Akbar...' and then mentioned the Adhān (Call to Prayer)—with the Takbīr (Allāhu Akbar) said four times, without Tarjī' (repeating the Shahādah quietly), and the Iqāmah (Call to Stand) said once, except for Qad qāmat aṣ-ṣalāh (Prayer is about to begin) said twice. He said: 'When morning came, I went to the Messenger of Allah (ﷺ), and he said: 'Indeed, it is a true dream...' (the rest of the Hadith).' Reported by Ahmad and Abu Dawud, and authenticated by At-Tirmidhī and Ibn Khuzaymah. Ahmad added at the end the account of Bilāl's saying in the Fajr Adhān: 'Aṣ-ṣalātu khayrun min an-nawm (Prayer is better than sleep).' And for Ibn Khuzaymah, from Anas, who said: 'It is from the Sunnah that when the Mu'adhdhin says Ḥayya 'ala al-falāḥ (Come to success) in the Fajr (dawn) Adhān, he says: Aṣ-ṣalātu khayrun min an-nawm.'"
  },
  "takhreej": {
    "arabic": " صحيح وإسناده حسن.‏ رواه أبو داود (499)‏، والترمذي (189)‏، وأحمد (4 /43)‏، وابن خزيمة (371)‏ وقال الترمذي: \"هذا حديث حسن صحيح\".‏ وقال ابن خزيمة (197)‏: \"خبر ثابت صحيح من جهة النقل\".‏  صحيح.‏ انظر ما قبله.‏ رواه ابن خزيمة (386)‏ بسند صحيح.‏ ",
    "urdu": "صحیح اور اس کی سند حسن ہے۔ اسے ابو داؤد (499)، ترمذی (189)، احمد (4/43)، اور ابن خزیمہ (371) نے روایت کیا ہے۔ ترمذی نے کہا: ”یہ حدیث حسن صحیح ہے۔“ ابن خزیمہ (197) نے کہا: ”یہ روایت نقل کے لحاظ سے ثابت اور صحیح ہے۔“ صحیح۔ اس سے پہلے کی روایت دیکھیں۔ اسے ابن خزیمہ (386) نے صحیح سند کے ساتھ روایت کیا ہے۔",
    "english": "Authentic (Ṣaḥīḥ) and its chain is Ḥasan (Good). Reported by Abu Dawud (499), At-Tirmidhī (189), Ahmad (4/43), and Ibn Khuzaymah (371). At-Tirmidhī said: 'This Hadith is Ḥasan Ṣaḥīḥ.' Ibn Khuzaymah (197) said: 'A fixed and authentic narration in terms of transmission.' Authentic (Ṣaḥīḥ). See the preceding narration. Reported by Ibn Khuzaymah (386) with an authentic chain.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "طَافَ بِي",
      "english": "A man went around me",
      "urdu": "ایک آدمی میرے پاس آیا"
    },
    {
      "arabic": "رُؤْيَا حَقٍّ",
      "english": "A true dream",
      "urdu": "سچا خواب"
    },
    {
      "arabic": "تَرْبِيع اَلتَّكْبِيرِ",
      "english": "Saying Takbīr four times",
      "urdu": "تکبیر چار بار کہنا"
    },
    {
      "arabic": "بِغَيْرِ تَرْجِيعٍ",
      "english": "Without Tarjī' (repetition)",
      "urdu": "ترجیع (تکرار) کے بغیر"
    },
    {
      "arabic": "فُرَادَى",
      "english": "Singularly (once)",
      "urdu": "ایک ایک مرتبہ"
    },
    {
      "arabic": "قَدْ قَامَتِ اَلصَّلَاةُ",
      "english": "Prayer is about to begin",
      "urdu": "نماز کھڑی ہونے والی ہے"
    },
    {
      "arabic": "اَلصَّلَاةُ خَيْرٌ مِنَ اَلنَّوْمِ",
      "english": "Prayer is better than sleep",
      "urdu": "نماز نیند سے بہتر ہے"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اذان اور اقامت کے شرعی الفاظ اور طریقے کو خواب کے ذریعے بیان کرتی ہے، جسے نبی اکرم صلی اللہ علیہ وسلم نے 'سچا خواب' قرار دیا۔ اس میں اذان میں تکبیر کو چار بار کہنے، شہادتین کی تکرار نہ کرنے، اقامت کے کلمات کو ایک ایک بار کہنے اور فجر کی اذان میں «الصلاة خير من النوم» کا اضافہ شامل ہے۔",
    "english": "This Hadith recounts the revelation of the legal wordings and method for the Adhān and Iqāmah through a dream, which the Prophet (ﷺ) confirmed as a 'true dream.' The method includes saying the Takbīr four times in the Adhān without repetition (Tarjī'), saying the Iqāmah phrases once (except for Qad qāmat aṣ-ṣalāh), and adding 'Aṣ-ṣalātu khayrun min an-nawm' in the Fajr Adhān."
  },
  "references": [
    {
      "arabic": "أخرجه أحمد (4 /43)",
      "english": "Reported by Ahmad (4/43)"
    },
    {
      "arabic": "رواه أبو داود (499)",
      "english": "Reported by Abu Dawud (499)"
    },
    {
      "arabic": "رواه الترمذي (189)",
      "english": "Reported by At-Tirmidhī (189)"
    },
    {
      "arabic": "صححه ابن خزيمة (371)",
      "english": "Authenticated by Ibn Khuzaymah (371)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن زيد بن عبد ربه",
        "english": "Abdullāh ibn Zayd ibn 'Abd Rabbih"
      },
      "slug": "abdullah-ibn-zayd-ibn-abd-rabbih"
    },
    {
      "id": 2,
      "name": {
        "arabic": "أنس بن مالك",
        "english": "Anas ibn Mālik"
      },
      "slug": "anas-ibn-malik"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kR9U_vH0xYk",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اذان اور اقامت کی مشروعیت",
        "english": "Legislation of Adhān and Iqāmah"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان کا آغاز (رویا)",
              "english": "The Origin of Adhān (The Dream)"
            },
            "content": {
              "urdu": [
                "اذان کی مشروعیت کا واقعہ خواب پر مبنی ہے، جسے نبی اکرم ﷺ نے 'سچا خواب' قرار دیا۔",
                "یہ اس بات کی دلیل ہے کہ سچے خواب شریعت کے ماخذ بن سکتے ہیں، جب انہیں وحی الٰہی سے تائید ملے۔",
                "اس خواب کے بعد ہی بلالؓ کو ان الفاظ کے ساتھ اذان دینے کا حکم دیا گیا، جس سے یہ سنت بن گئی۔"
              ],
              "english": [
                "The legislation of the Adhān is based on a dream, which the Prophet (ﷺ) confirmed as a 'true dream'.",
                "This serves as evidence that true dreams can be a source of legislation when confirmed by divine revelation.",
                "After this dream, Bilāl (RA) was commanded to call the Adhān with these words, establishing it as a Sunnah."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان کے کلمات کا طریقہ",
              "english": "Method of Adhān Wordings"
            },
            "content": {
              "urdu": [
                "اس حدیث میں اذان کے کلمات کو چار بار (تربیع) اور بغیر تکرار (ترجیع) کے کہنے کا ذکر ہے۔",
                "یہ اذان کا وہ طریقہ ہے جسے حنبلی، مالکی اور بعض دیگر فقہاء اختیار کرتے ہیں (اذان بلالی)۔",
                "اس طریقے میں اذان کے کل کلمات پندرہ ہوتے ہیں، جبکہ اقامت میں دس کلمات ہیں۔"
              ],
              "english": [
                "This Hadith describes the Adhān wordings as being said four times (Tarbī') and without repeating the Shahādah (Tarjī').",
                "This is the form of Adhān adopted by Ḥanbalī, Mālikī, and some other jurists (the Bilālī Adhān).",
                "In this form, the total number of Adhān phrases is fifteen, while the Iqāmah has ten phrases."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اقامت اور تثویب کا حکم",
        "english": "Ruling on Iqāmah and Tathwīb"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اقامت کا طریقہ",
              "english": "Method of Iqāmah"
            },
            "content": {
              "urdu": [
                "اقامت کے کلمات کو ایک ایک مرتبہ (فراداً) کہنا اور صرف «قد قامت الصلاة» کو دو بار کہنا اس حدیث سے ثابت ہے۔",
                "اس طریقے کو 'فراداً' اقامت کہا جاتا ہے اور یہ جمہور فقہاء (مالکی، شافعی، حنبلی) کے نزدیک معمول ہے۔",
                "اقامت کا مقصد لوگوں کو یہ اطلاع دینا ہے کہ فرض نماز شروع ہونے والی ہے، اس لیے اس کے کلمات مختصر رکھے گئے ہیں۔"
              ],
              "english": [
                "This Hadith proves that the Iqāmah phrases are to be said once (Furādā), except for 'Qad qāmat aṣ-ṣalāh' which is said twice.",
                "This method is known as 'Furādā Iqāmah' and is the standard practice according to the majority of jurists (Mālikī, Shāfi'ī, Ḥanbalī).",
                "The purpose of the Iqāmah is to notify people that the obligatory prayer is starting, thus its phrases are kept brief."
              ]
            }
          },
          {
            "title": {
              "urdu": "فجر کی اذان میں اضافہ (تثویب)",
              "english": "Addition in Fajr Adhān (Tathwīb)"
            },
            "content": {
              "urdu": [
                "فجر کی اذان میں «الصلاة خير من النوم» کا اضافہ (تثویب) سنت ہے اور اس حدیث کے آخر میں مذکور ہے۔",
                "یہ اضافہ صرف فجر کی اذان میں کیا جاتا ہے اور یہ اس لیے ہے کہ لوگ نیند سے بیدار ہو کر نماز کے لیے آئیں۔",
                "یہ حکم ابن خزیمہ کی روایت میں انسؓ سے بھی منقول ہے کہ یہ سنت کا حصہ ہے۔"
              ],
              "english": [
                "The addition of 'Aṣ-ṣalātu khayrun min an-nawm' (Tathwīb) in the Fajr Adhān is Sunnah and is mentioned at the end of this Hadith.",
                "This addition is specific to the Fajr Adhān to encourage people to wake up from sleep and attend the prayer.",
                "This ruling is also narrated from Anas (RA) in Ibn Khuzaymah, confirming it is part of the Sunnah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اختلاف اور ترجیحات",
        "english": "Juristic Differences and Preferences"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان کے مختلف طریقے",
              "english": "Different Forms of Adhān"
            },
            "content": {
              "urdu": [
                "اذان کے دو مشہور طریقے ہیں: اذان بلالی (جس میں تکبیر چار بار اور ترجیع نہیں) اور اذان ابومحذورہ (جس میں ترجیع ہوتی ہے)۔",
                "حنفی اور شافعی مذاہب میں ترجیع والی اذان کو بھی رائج مانا جاتا ہے، جو دیگر روایات سے ثابت ہے۔",
                "امت کے لیے دونوں طریقوں پر عمل جائز ہے، اس لیے دونوں میں سے کسی کو ترک کرنا درست نہیں۔"
              ],
              "english": [
                "There are two famous forms of Adhān: the Bilālī Adhān (Takbīr four times, no Tarjī') and the Abū Maḥdhūrah Adhān (which includes Tarjī').",
                "The Ḥanafī and Shāfi'ī schools also consider the Adhān with Tarjī' valid, based on other narrations.",
                "It is permissible for the Ummah to follow either method, so neither should be abandoned."
              ]
            }
          },
          {
            "title": {
              "urdu": "اقامت کا تثنیہ (دو بار کہنا)",
              "english": "Doubling the Iqāmah Phrases"
            },
            "content": {
              "urdu": [
                "اس روایت میں اقامت کے کلمات کو ایک ایک بار کہنے کا ذکر ہے، جبکہ بعض روایات میں انہیں دو دو بار کہنے کا بھی ذکر ہے۔",
                "شافعی اور حنفی فقہاء اقامت کو بھی تثنیہ (دو بار) کہنے کو پسند کرتے ہیں۔",
                "دونوں طریقے سنت سے ثابت ہیں، لیکن اس حدیث میں مذکور فرادیٰ (ایک ایک بار) کہنے کا طریقہ زیادہ مختصر اور افضل ہے۔"
              ],
              "english": [
                "This narration mentions saying the Iqāmah phrases once, while some narrations also mention saying them twice.",
                "Shāfi'ī and Ḥanafī jurists prefer saying the Iqāmah phrases twice (Tathniyah).",
                "Both methods are proven by the Sunnah, but the Furādā method mentioned in this Hadith is shorter and preferable."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی سبق",
        "english": "Training and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خواب میں شرعی تعلیم",
              "english": "Legal Instruction via Dream"
            },
            "content": {
              "urdu": [
                "یہ واقعہ ہمیں اللہ کی قدرت اور رسول اللہ ﷺ کی نبوت کی صداقت پر ایمان کا درس دیتا ہے۔",
                "اللہ تعالیٰ نے اذان جیسے اہم شعار کو خواب کے ذریعے سکھایا، جو نبی ﷺ کے لیے وحی کا حصہ ہے۔",
                "یہ واقعہ سنت کی اہمیت اور اس کے مختلف طریقوں کو سمجھنے کی ضرورت کو واضح کرتا ہے۔"
              ],
              "english": [
                "This incident teaches us faith in Allah's power and the truthfulness of the Prophet's (ﷺ) prophethood.",
                "Allah taught the crucial ritual of Adhān through a dream, which constituted a form of revelation for the Prophet (ﷺ).",
                "The incident highlights the importance of the Sunnah and the necessity of understanding its various methods."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز کی نیند پر فوقیت",
              "english": "Prayer Over Sleep"
            },
            "content": {
              "urdu": [
                "تثویب کا جملہ «الصلاة خير من النوم» مسلمان کو دنیاوی راحتوں پر اخروی اعمال کو ترجیح دینے کا درس دیتا ہے۔",
                "یہ فجر کے وقت بستر چھوڑنے اور اللہ کی پکار پر لبیک کہنے کی اہمیت کو اجاگر کرتا ہے۔",
                "مسلمان کو نیند یا دنیاوی مشاغل کی وجہ سے کبھی نماز میں سستی نہیں کرنی چاہیے۔"
              ],
              "english": [
                "The Tathwīb phrase 'Aṣ-ṣalātu khayrun min an-nawm' teaches the Muslim to prioritize deeds of the Hereafter over worldly comforts.",
                "It emphasizes the importance of leaving the bed at Fajr time and answering the call of Allah.",
                "A Muslim should never be lazy in prayer due to sleep or worldly preoccupation."
              ]
            }
          }
        ]
      }
    }
  ]
}
