{
  "hadithId": 154,
  "hadithNo": 11,
  "hadithReferences": {
    "sunnah.com": ["1:3:11"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": " وَعَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ ‏- رضى الله عنه ‏- { أَنَّهُ قَالَ : يَا رَسُولَ اَللَّهِ اِجْعَلْنِي إِمَامَ قَوْمِي .‏ قَالَ : \"أَنْتَ إِمَامُهُمْ , وَاقْتَدِ بِأَضْعَفِهِمْ , وَاِتَّخِذْ مُؤَذِّنًا لَا يَأْخُذُ عَلَى أَذَانِهِ أَجْرًا } أَخْرَجَهُ اَلْخَمْسَةُ , وَحَسَّنَهُ اَلتِّرْمِذِيُّ , وَصَحَّحَهُ اَلْحَاكِمُ .‏",
    "urdu": "سیدنا عثمان بن ابی العاص رضی اللہ عنہ سے مروی ہے انہوں نے عرض کیا یا رسول اللہ! مجھے میری قوم کا امام مقرر فرما دیں۔ ارشاد ہوا ”تم ان کے امام ہو (تمہیں تمہاری قوم کا امام مقرر کر دیا گیا) ان میں کمزور و ضعیف لوگوں کا خیال رکھو اور مؤذن ایسے آدمی کو مقرر کرو جو اذان کہنے کی اجرت نہ طلب کرے۔ “ اس کو احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور ترمذی نے اسے حسن قرار دیا ہے اور حاکم نے صحیح کہا ہے۔ ",
    "english": "Narrated 'Uthmān ibn Abī Al-'Āṣ (RA): 'He said: O Messenger of Allah! Appoint me as the Imām of my people. He said: 'You are their Imām, so lead them, follow the condition of the weakest among them, and choose a Mu'adhdhin who does not charge any wages for his Adhān.'' Reported by the five compilers (Ahmad, Abu Dawud, At-Tirmidhī, An-Nasa'ī, Ibn Mājah), and At-Tirmidhī graded it as Ḥasan (good), and Al-Ḥākim graded it as Ṣaḥīḥ (authentic)."
  },
  "takhreej": {
    "arabic": "صحيح .‏ رواه أبو داود (531)‏ ، والترمذي (209)‏ ، وابن ماجه (714)‏ ، وأحمد (4/21و217)‏ ، والحاكم (1/199و201)‏ .‏ وقال الترمذي : حسن كما نقل الحافظ عنه ، ويتأيد نقل الحافظ بنقل غيره من الأئمة الآخرين كالنووي ، والزيلعي، والمزي وغيرهم ، إلا أنه في بعض النسخ التي اعتمد عليها الشيخ أحمد شاكر ‏-رحمه الله‏- قول الترمذي : \"حسن صحيح\" .‏ ولم أجد ما يؤيد ذلك إلى الآن.‏ فالله أعلم .‏ قلت : ولفظ وطريق الحديث عند الترمذي ، وابن ماجه يختلف عنه عند الباقين ، ولم يكن يحسن من الحافظ ‏-رحمه الله‏- العزو لهم كلهم هكذا إجمالا .‏",
    "urdu": "صحیح۔ اسے ابو داؤد (531)، ترمذی (209)، ابن ماجہ (714)، احمد (4/21 اور 217) اور حاکم (1/199 اور 201) نے روایت کیا ہے۔ ترمذی نے اسے حسن قرار دیا جیسا کہ حافظ ابن حجر نے نقل کیا ہے، اور حافظ ابن حجر کی اس نقل کی تائید دیگر ائمہ جیسے نووی، زیلعی، اور مزی نے بھی کی ہے، البتہ شیخ احمد شاکرؒ کے زیرِ اعتماد نسخوں میں ترمذی کا قول ”حسن صحیح“ ہے۔ میں اس کی تائید ابھی تک نہیں پا سکا، واللہ اعلم۔ میں (حافظ ابن حجر) کہتا ہوں: ترمذی اور ابن ماجہ کے ہاں حدیث کے الفاظ اور طریق باقی کتب سے مختلف ہیں، اور حافظ (ابن حجر) کا اسے سب کی طرف اجمالاً منسوب کرنا مناسب نہیں تھا۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Abu Dawud (531), At-Tirmidhī (209), Ibn Mājah (714), Ahmad (4/21 & 217), and Al-Ḥākim (1/199 & 201). At-Tirmidhī graded it as Ḥasan (Good), as quoted by Al-Ḥāfiz. This grading is supported by other Imams like An-Nawawī, Az-Zayla'ī, and Al-Mizzī. However, some editions relied upon by Shaykh Aḥmad Shākir (RH) quote At-Tirmidhī as saying 'Ḥasan Ṣaḥīḥ.' I have not yet found confirmation for that; and Allah knows best. I say: The wording and chain of the Hadith in At-Tirmidhī and Ibn Mājah differ from the rest, and Al-Ḥāfiẓ's general attribution to all of them was not precise.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "إِمَامَ قَوْمِي",
      "english": "The Imām of my people",
      "urdu": "میری قوم کا امام"
    },
    {
      "arabic": "أَنْتَ إِمَامُهُمْ",
      "english": "You are their Imām",
      "urdu": "تم ان کے امام ہو"
    },
    {
      "arabic": "اِقْتَدِ بِأَضْعَفِهِمْ",
      "english": "Follow the condition of the weakest among them",
      "urdu": "ان میں کمزوروں کا خیال رکھو"
    },
    {
      "arabic": "اِتَّخِذْ مُؤَذِّنًا",
      "english": "Choose a Mu'adhdhin",
      "urdu": "ایک مؤذن مقرر کرو"
    },
    {
      "arabic": "لَا يَأْخُذُ",
      "english": "Who does not charge/take",
      "urdu": "جو نہ لے"
    },
    {
      "arabic": "عَلَى أَذَانِهِ أَجْرًا",
      "english": "Any wages for his Adhān",
      "urdu": "اپنی اذان پر کوئی اجرت"
    },
    {
      "arabic": "حَسَّنَهُ",
      "english": "Graded it as Ḥasan (Good)",
      "urdu": "اسے حسن قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث قیادت (امامت) کے دو بنیادی اصول بیان کرتی ہے: اول، امام کو چاہیے کہ وہ مقتدیوں میں کمزور ترین فرد کا خیال رکھے اور نماز کو طوالت نہ دے۔ دوم، اذان دینے والے (مؤذن) کو ایسا شخص مقرر کیا جائے جو اذان پر کوئی دنیاوی معاوضہ نہ لے، جو اس عبادت کی خالصتاً اللہ کے لیے ادائیگی کی تاکید ہے۔",
    "english": "This Hadith establishes two fundamental principles of leadership (Imāmah): First, the Imām should consider the condition of the weakest people in the congregation and not prolong the prayer. Second, the Mu'adhdhin (caller to prayer) should be chosen from those who do not charge any worldly wages for their Adhān, emphasizing the sincerity of this act of worship for the sake of Allah."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (531)",
      "english": "Reported by Abu Dawud (531)"
    },
    {
      "arabic": "رواه الترمذي (209)",
      "english": "Reported by At-Tirmidhī (209)"
    },
    {
      "arabic": "رواه الحاكم (1/199)",
      "english": "Reported by Al-Ḥākim (1/199)"
    },
    {
      "arabic": "رواه ابن ماجه (714)",
      "english": "Reported by Ibn Mājah (714)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عثمان بن أبي العاص",
        "english": "Uthmān ibn Abī Al-'Āṣ"
      },
      "slug": "uthman-ibn-abi-al-as"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "امامت اور کمزوروں کا خیال",
        "english": "Imāmah and Considering the Weak"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام کی ذمہ داری",
              "english": "The Responsibility of the Imām"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا عثمان بن ابی العاصؓ کو ان کی قوم کا امام مقرر کرنا، شرعی قیادت کی منظوری ہے۔",
                "امام کو حکم دیا گیا کہ وہ مقتدیوں میں سب سے کمزور، بیمار یا بوڑھے افراد کی حالت کا خیال رکھے۔",
                "یہ اس بات کی دلیل ہے کہ نماز میں تخفیف (کم طوالت) کرنا سنت ہے تاکہ جماعت پر مشقت نہ ہو۔"
              ],
              "english": [
                "The Prophet's (ﷺ) appointment of 'Uthmān ibn Abī Al-'Āṣ as the Imām sanctions his religious leadership.",
                "The Imām is commanded to consider the state of the weakest, sick, or elderly individuals in the congregation.",
                "This proves that shortening the prayer's length (Takhfīf) is Sunnah to avoid hardship on the congregation."
              ]
            }
          },
          {
            "title": {
              "urdu": "نماز میں اعتدال",
              "english": "Moderation in Prayer"
            },
            "content": {
              "urdu": [
                "اگرچہ امام کو نماز طویل کرنے کا اختیار ہے، لیکن اسے اعتدال سے کام لینا چاہیے تاکہ تمام لوگ شامل ہو سکیں۔",
                "یہ ہدایت سکھاتی ہے کہ اجتماعی عبادات میں فرد کے ذاتی شوق اور فضیلت سے زیادہ اجتماعی رعایت کو ترجیح دی جائے۔",
                "امام کی ذمہ داری ہے کہ وہ نماز کو مکمل سنت کے مطابق، مگر بوجھ نہ بناتے ہوئے، ادا کرے۔"
              ],
              "english": [
                "Although the Imām has the authority to lengthen the prayer, he must act with moderation so that all people can participate.",
                "This instruction teaches that in communal worship, the collective ease should be prioritized over individual desire for extra virtue.",
                "It is the Imām's duty to perform the prayer according to the complete Sunnah but without making it burdensome."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اذان پر اجرت لینے کا حکم",
        "english": "Ruling on Taking Wages for Adhān"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان خالص عبادت",
              "english": "Adhān is Pure Worship"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا یہ حکم کہ مؤذن اجرت نہ لے، ظاہر کرتا ہے کہ اذان ایک خالص عبادت ہے جو صرف اللہ کی رضا کے لیے ہونی چاہیے۔",
                "اجرت لینے کا عمل عبادت میں دنیاوی مقصد کو شامل کرتا ہے، جو اخلاص کے منافی ہے۔",
                "مؤذن کا اجر اللہ کے ذمہ ہے، جو اسے قیامت کے دن سب سے زیادہ اجر دے گا۔"
              ],
              "english": [
                "The Prophet's (ﷺ) command that the Mu'adhdhin should not charge wages indicates that Adhān is a pure act of worship for the sake of Allah alone.",
                "Taking wages introduces a worldly motive into the worship, which compromises sincerity (Ikhlāṣ).",
                "The Mu'adhdhin's reward is with Allah, Who will grant him the greatest reward on the Day of Judgment."
              ]
            }
          },
          {
            "title": {
              "urdu": "رزق لینا اور اجرت لینا",
              "english": "Taking Stipend vs. Taking Wages"
            },
            "content": {
              "urdu": [
                "فقہاء کے نزدیک، اذان کے لیے تنخواہ یا مشاہرہ (Stipend) لینا، جسے اجرت نہیں سمجھا جاتا، جائز ہے۔",
                "یہ تنخواہ مؤذن کی مدد اور فراغت کے لیے دی جاتی ہے تاکہ وہ اپنی ذمہ داری بہتر طور پر ادا کر سکے۔",
                "اصل ممانعت یہ ہے کہ اذان کو کمانے کا ذریعہ نہ بنایا جائے اور اجرت کو اس عبادت کا عوض نہ سمجھا جائے۔"
              ],
              "english": [
                "According to jurists, receiving a fixed stipend or allowance (Mušāharah) for the Adhān is permissible, provided it is not seen as a direct wage.",
                "This stipend is given to support the Mu'adhdhin and free him for his duty, ensuring he performs it well.",
                "The actual prohibition is against making the Adhān a means of livelihood and considering the payment as the exchange for the act of worship."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "شرعی قیادت کے اصول",
        "english": "Principles of Religious Leadership"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "امام اور مؤذن کا مقام",
              "english": "Status of Imām and Mu'adhdhin"
            },
            "content": {
              "urdu": [
                "یہ حدیث ایک ہی جگہ پر امامت اور اذان کے دونوں مناصب کے لیے شرائط اور ذمہ داریاں بیان کرتی ہے۔",
                "امام کو تقویٰ، علم اور مقتدیوں پر شفقت جیسی صفات سے متصف ہونا چاہیے۔",
                "مؤذن کو اخلاص، امانت داری، اور وقت کی پہچان جیسی صفات سے متصف ہونا چاہیے۔"
              ],
              "english": [
                "This Hadith outlines the prerequisites and responsibilities for both the Imāmah and the Mu'adhdhin roles in one context.",
                "The Imām should possess qualities like piety, knowledge, and compassion for the congregation.",
                "The Mu'adhdhin should possess sincerity, trustworthiness, and accurate knowledge of the times."
              ]
            }
          },
          {
            "title": {
              "urdu": "قیادت میں شفقت",
              "english": "Compassion in Leadership"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کی یہ نصیحت 'واقتد بأضعفهم' (کمزوروں کا خیال رکھو) ہر قائد کے لیے ایک رہنما اصول ہے۔",
                "دینی قیادت میں شفقت اور آسانی کو بنیادی اہمیت حاصل ہے، تاکہ لوگ دین سے نہ اکتا جائیں۔",
                "یہ سکھاتی ہے کہ ایک سچا امام وہ ہے جو اپنے مقتدیوں کے حالات کا خیال رکھتا ہو۔"
              ],
              "english": [
                "The Prophet's (ﷺ) advice 'Follow the condition of the weakest among them' is a guiding principle for every leader.",
                "Compassion and ease hold primary importance in religious leadership to prevent people from becoming averse to the religion.",
                "This teaches that a true Imām is one who cares for the circumstances of his followers."
              ]
            }
          }
        ]
      }
    }
  ]
}
