{
  "hadithId": 145,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": ["1:3:2"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": " عَنْ أَبِي مَحْذُورَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَلَّمَهُ اَلْآذَانَ, فَذَكَرَ فِيهِ اَلتَّرْجِيعَ } أَخْرَجَهُ مُسْلِمٌ.‏ وَلَكِنْ ذَكَرَ اَلتَّكْبِيرَ فِي أَوَّلِهِ مَرَّتَيْنِ فَقَطْ  وَرَوَاهُ اَلْخَمْسَةُ فَذَكَرُوهُ مُرَبَّعًا ",
    "urdu": "سیدنا ابومحذورہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو اذان سکھائی۔ اس میں انہوں نے ترجیع کا ذکر کیا ہے۔ مسلم نے روایت کیا ہے لیکن اس میں پہلی دفعہ «الله أكبر» کو صرف دو مرتبہ کہنے کا ذکر ہے۔ ابومحذورہ رضی اللہ عنہ سے مروی حدیث کو پانچوں نے روایت کیا ہے اور انہوں نے «الله أكبر» کو پہلی دفعہ چار مرتبہ کہنے کا ذکر کیا ہے۔  ",
    "english": "Narrated Abu Maḥdhūrah (RA): 'The Prophet (ﷺ) taught him the Adhān, and he mentioned Tarjī' (repetition of the Shahādah) in it.' Reported by Muslim, but he mentioned the Takbīr (Allāhu Akbar) at the beginning only twice. The five compilers (Ahmad, Abu Dawud, At-Tirmidhī, An-Nasa'ī, Ibn Majah) narrated it, and they mentioned the Takbīr as four times (Murabba'an)."
  },
  "takhreej": {
    "arabic": " صحيح.‏ رواه مسلم (379)‏.‏ \"والترجيع\": أي في الشهادتين فيقولها مرة بصوت منخفض، ومرة أخرى بصوت مرتفع.‏ صحيح.‏ رواه أبو داود (502)‏، والنسائي (2 /4‏-5)‏، والترمذي (192 )‏، وابن ماجه (709)‏، وأحمد (3 /409 و 6 /401)‏، وقال الترمذي: \"حديث حسن صحيح\".‏",
    "urdu": "صحیح۔ اسے مسلم (379) نے روایت کیا ہے۔ ”الترجیع“: یعنی شہادتین (کلمہ شہادت) میں، کہ ان کو ایک مرتبہ آہستہ آواز میں اور دوسری مرتبہ بلند آواز میں کہے۔ صحیح۔ اسے ابو داؤد (502)، نسائی (2/4-5)، ترمذی (192)، ابن ماجہ (709) اور احمد (3/409 اور 6/401) نے روایت کیا ہے، اور ترمذی نے کہا: ”حدیث حسن صحیح ہے۔“",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (379). 'At-Tarjī'' means: the repetition of the two Shahādah phrases (testimony of faith) by saying them once in a low voice and then repeating them again in a loud voice. Authentic (Ṣaḥīḥ). Reported by Abu Dawud (502), An-Nasa'ī (2/4-5), At-Tirmidhī (192), Ibn Mājah (709), and Ahmad (3/409 and 6/401). At-Tirmidhī said: 'Hadith Ḥasan Ṣaḥīḥ (Good and Authentic).'",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "عَلَّمَهُ اَلْآذَانَ",
      "english": "Taught him the Adhān",
      "urdu": "اسے اذان سکھائی"
    },
    {
      "arabic": "اَلتَّرْجِيعَ",
      "english": "Tarjī' (Repetition of Shahādah)",
      "urdu": "ترجیع (شہادتین کی تکرار)"
    },
    {
      "arabic": "مَرَّتَيْنِ فَقَطْ",
      "english": "Only twice",
      "urdu": "صرف دو مرتبہ"
    },
    {
      "arabic": "مُرَبَّعًا",
      "english": "Said four times (Takbīr)",
      "urdu": "چار مرتبہ کہا"
    },
    {
      "arabic": "اَلشَّهَادَتَيْنِ",
      "english": "The two testimonies (Shahādah)",
      "urdu": "دو گواہیاں"
    },
    {
      "arabic": "بِصَوْتٍ مُنْخَفِضٍ",
      "english": "In a low voice",
      "urdu": "آہستہ آواز میں"
    },
    {
      "arabic": "بِصَوْتٍ مُرْتَفِعٍ",
      "english": "In a loud voice",
      "urdu": "بلند آواز میں"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اذان کی دوسری مشہور شکل (اذان ابومحذورہ) کو بیان کرتی ہے، جس میں شہادتین کو آہستہ اور پھر بلند آواز میں دوہرایا جاتا ہے (ترجیع)۔ اس روایت میں تکبیر کو چار بار کہنے یا صرف دو بار کہنے کا اختلاف ہے، لیکن اکثر محدثین چار بار (تربیع) کہنے والی روایت کو ترجیح دیتے ہیں، جبکہ ترجیع کا عمل ثابت ہے۔",
    "english": "This Hadith describes the second well-known form of the Adhān (Adhān of Abū Maḥdhūrah), which includes Tarjī' (repeating the two Shahādah phrases quietly and then loudly). There is a difference in narration regarding whether the opening Takbīr is said four times or only twice, but most Hadith scholars favor the narration where it is said four times, while the practice of Tarjī' is confirmed."
  },
  "references": [
    {
      "arabic": "رواه مسلم (379)",
      "english": "Reported by Muslim (379)"
    },
    {
      "arabic": "رواه أبو داود (502)",
      "english": "Reported by Abu Dawud (502)"
    },
    {
      "arabic": "رواه النسائي (2 /4-5)",
      "english": "Reported by An-Nasa'ī (2/4-5)"
    },
    {
      "arabic": "رواه الترمذي (192)",
      "english": "Reported by At-Tirmidhī (192)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو محذورة",
        "english": "Abu Maḥdhūrah"
      },
      "slug": "abu-mahthurah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-t1yM-l1hI",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اذان میں ترجیع کا حکم",
        "english": "The Ruling on Tarjī' in Adhān"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ترجیع کی تعریف اور نوعیت",
              "english": "Definition and Nature of Tarjī'"
            },
            "content": {
              "urdu": [
                "ترجیع کا مطلب ہے کہ شہادتین (اشھد ان لا الہ الا اللہ، اشھد ان محمدا رسول اللہ) کو پہلے آہستہ اور پھر بلند آواز میں دوہرایا جائے۔",
                "یہ عمل ابومحذورہ کی اذان میں شامل ہے، جنہیں نبی اکرم ﷺ نے مکہ کے لیے مؤذن مقرر کیا تھا۔",
                "ترجیع اذان میں ایک مستحب عمل ہے اور یہ شافعی اور حنفی مذاہب میں معمول ہے۔"
              ],
              "english": [
                "Tarjī' means repeating the two Shahādah phrases by first saying them in a low voice and then raising the voice.",
                "This practice is included in the Adhān of Abū Maḥdhūrah, whom the Prophet (ﷺ) appointed as the Mu'adhdhin for Makkah.",
                "Tarjī' is a recommended practice in the Adhān and is customary in the Shāfi'ī and Ḥanafī schools."
              ]
            }
          },
          {
            "title": {
              "urdu": "تکبیر میں اختلافِ روایت",
              "english": "Difference in Takbīr Narration"
            },
            "content": {
              "urdu": [
                "اذان کی ابتدا میں «الله أكبر» کو چار بار کہنے کو تربیع (Murabba'an) اور دو بار کہنے کو تثنیہ (Muthannā) کہا جاتا ہے۔",
                "مسلم کی روایت میں تکبیر کو دو بار کہنے کا ذکر ہے، جبکہ دیگر کتب (بشمول پانچوں) میں چار بار کہنے کا ذکر ہے۔",
                "فقہاء نے چار بار کہنے (تربیع) کو ترجیح دی ہے، جو پہلے (اذان بلالی) اور اس (اذان ابومحذورہ) روایت کے درمیان ہم آہنگی پیدا کرتی ہے۔"
              ],
              "english": [
                "Saying 'Allāhu Akbar' four times is called Tarbī', and saying it twice is called Tathniyah.",
                "Muslim's narration mentions the Takbīr being said twice, while other books (including the five compilers) mention it four times.",
                "Jurists preferred saying it four times (Tarbī'), which harmonizes this narration with the earlier (Bilālī) Adhān."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اذان کے طریقوں میں وسعت",
        "english": "Leniency in Adhān Methods"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "شرعی تنوع (تنوع فی العبادة)",
              "english": "Legal Diversity (Tanawwu' fi al-'Ibādah)"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے مختلف علاقوں اور مؤذنین کو اذان کے مختلف طریقے سکھائے، جو شریعت کی وسعت کو ظاہر کرتا ہے۔",
                "اذان بلالی (بغیر ترجیع) اور اذان ابومحذورہ (ترجیع کے ساتھ) دونوں صحیح سنت سے ثابت ہیں۔",
                "مسلمانوں کو ان مختلف صحیح طریقوں میں سے کسی پر بھی عمل کرنے کی اجازت ہے، اختلاف کی گنجائش موجود ہے۔"
              ],
              "english": [
                "The Prophet (ﷺ) taught different methods of Adhān to various regions and Mu'adhdhins, showing the breadth of the Sharī'ah.",
                "Both the Bilālī Adhān (without Tarjī') and the Abū Maḥdhūrah Adhān (with Tarjī') are proven by authentic Sunnah.",
                "Muslims are permitted to follow any of these authentic methods, acknowledging the diversity in practice."
              ]
            }
          },
          {
            "title": {
              "urdu": "شہادتین کی تاکید",
              "english": "Emphasis on the Shahādah"
            },
            "content": {
              "urdu": [
                "ترجیع میں شہادتین کو آہستہ اور پھر بلند آواز میں دوہرانے کا عمل ایمان کے اقرار کی تاکید کو ظاہر کرتا ہے۔",
                "یہ اس بات کی اہمیت کو بڑھاتا ہے کہ بندہ اذان کے ذریعے اپنے ایمان کی گواہی پورے شہر میں بلند آواز سے دیتا ہے۔",
                "اذان کے بنیادی مقصد (توحید اور رسالت کا اعلان) کو یہ طریقہ مؤثر انداز میں پورا کرتا ہے۔"
              ],
              "english": [
                "The practice of repeating the Shahādah quietly and then loudly (Tarjī') emphasizes the affirmation of faith.",
                "It highlights the importance of the worshipper announcing their testimony of faith loudly across the town via the Adhān.",
                "This method effectively fulfills the primary purpose of the Adhān (the announcement of Monotheism and Prophethood)."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اجر اور مقصدیت",
        "english": "Reward and Intent"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اجر کی زیادتی",
              "english": "Increase in Reward"
            },
            "content": {
              "urdu": [
                "اذان کا عظیم اجر ہے اور جو شخص اسے صحیح طریقے سے ادا کرتا ہے، وہ اس اجر کا مستحق ہوتا ہے۔",
                "صحیح طریقے میں ان تمام کلمات کو شامل کرنا ہے جو سنت سے ثابت ہیں، خواہ ان کا طریقہ مختلف ہی ہو۔",
                "اذان دینے والے کو چاہیے کہ وہ اللہ کے لیے اخلاص کے ساتھ اور صحیح وقت پر اذان کہے۔"
              ],
              "english": [
                "The Adhān carries a great reward, and the one who performs it correctly is deserving of that reward.",
                "The correct method involves including all the phrases confirmed by the Sunnah, even if the method varies.",
                "The Mu'adhdhin should call the Adhān with sincerity for the sake of Allah and at the correct time."
              ]
            }
          },
          {
            "title": {
              "urdu": "نبی ﷺ کا تعلیم کا طریقہ",
              "english": "The Prophet's Teaching Method"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا ابومحذورہؓ کو اذان سکھانا اس بات کی دلیل ہے کہ آپ مختلف لوگوں کی صلاحیت کے مطابق تعلیم دیتے تھے۔",
                "ابومحذورہؓ کی آواز بلند تھی اور وہ مکہ کے لیے مؤذن تھے، جہاں زوردار اذان کی ضرورت تھی۔",
                "استاد کو چاہیے کہ وہ شاگرد کی ضرورت اور قابلیت کو مدنظر رکھتے ہوئے تعلیم دے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) act of teaching Abū Maḥdhūrah the Adhān shows that he taught based on the capacity of different individuals.",
                "Abū Maḥdhūrah had a loud voice and was the Mu'adhdhin for Makkah, where a strong Adhān was needed.",
                "A teacher should consider the needs and ability of the student when imparting knowledge."
              ]
            }
          }
        ]
      }
    }
  ]
}
