{
  "hadithId": 155,
  "hadithNo": 12,
  "hadithReferences": {
    "sunnah.com": ["1:3:12"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": "وَعَنْ مَالِكِ بْنِ الْحُوَيْرِثِ ‏- رضى الله عنه ‏- قَالَ : قَالَ لَنَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ وَإِذَا حَضَرَتِ اَلصَّلَاةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ .‏ .‏ .‏ } اَلْحَدِيثَ أَخْرَجَهُ اَلسَّبْعَةُ . ",
    "urdu": " سیدنا مالک بن حویرث رضی اللہ عنہ کا بیان ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ہم سے ارشاد فرمایا ”جب نماز کا وقت آ جائے تو تم میں سے کوئی آدمی تمہیں بلانے کے لیے اذان کہے۔ “ پھر پوری حدیث بیان کی۔ اسے ساتوں یعنی احمد، بخاری، مسلم، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے۔ ",
    "english": "Narrated Mālik ibn Al-Ḥuwayrith (RA): The Prophet (ﷺ) said to us: 'When the time for prayer comes, then let one of you call the Adhān for you...' (the rest of the Hadith). Reported by the seven compilers (Ahmad, Al-Bukhārī, Muslim, Abu Dawud, At-Tirmidhī, An-Nasā'ī, and Ibn Mājah)."
  },
  "takhreej": {
    "arabic": " صحيح .‏ رواه البخاري (628)‏ ، ومسلم (674)‏ ، وأبو داود (589)‏ ، والنسائي (2/9)‏ ، والترمذي (205)‏ ، وابن ماجه (9799)‏ ، وأحمد (3/436 و5/53)‏ وله ألفاظ ، وهو عند بعضهم مطولا ، وعند بعضهم مختصرا .‏ وزاد البخاري في بعض رواياته : \"وصلوا كما رأيتموني أصلي\" وهي عند أحمد بلفظ : \"كما تروني أصلي\" ، وليست هذه الزيادة عند أحد من أصحاب الكتب الستة سوى البخاري .‏ وانظر رقم (327)‏ .‏",
    "urdu": "صحیح۔ اسے بخاری (628)، مسلم (674)، ابوداؤد (589)، نسائی (2/9)، ترمذی (205)، ابن ماجہ (9799)، اور احمد (3/436 اور 5/53) نے روایت کیا ہے۔ اس کے مختلف الفاظ ہیں اور یہ بعض کے ہاں طویل ہے اور بعض کے ہاں مختصر۔ بخاری نے اپنی بعض روایات میں اضافہ کیا ہے: ”اور نماز اسی طرح پڑھو جس طرح تم نے مجھے نماز پڑھتے ہوئے دیکھا ہے۔“ اور احمد کے ہاں اس کا لفظ ہے: ”جس طرح تم مجھے نماز پڑھتے ہوئے دیکھتے ہو۔“ یہ اضافہ بخاری کے علاوہ کتب ستہ میں کسی کے پاس نہیں ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Al-Bukhārī (628), Muslim (674), Abu Dawud (589), An-Nasā'ī (2/9), At-Tirmidhī (205), Ibn Mājah (979), and Ahmad (3/436 & 5/53). It has various wordings, being long in some and short in others. Al-Bukhārī added in some narrations: 'And pray as you have seen me praying,' and for Ahmad, the wording is: 'As you see me praying.' This addition is found only in Al-Bukhārī among the Six Books compilers. See also Hadith No. (327).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "حَضَرَتِ اَلصَّلَاةُ",
      "english": "The time for prayer comes",
      "urdu": "نماز کا وقت آ جائے"
    },
    {
      "arabic": "فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ",
      "english": "Then let one of you call the Adhān for you",
      "urdu": "تو تم میں سے کوئی ایک اذان کہے"
    },
    {
      "arabic": "وَصَلُّوا",
      "english": "And pray",
      "urdu": "اور نماز پڑھو"
    },
    {
      "arabic": "كَمَا رَأَيْتُمُونِي أُصَلِّي",
      "english": "As you have seen me praying",
      "urdu": "جس طرح تم نے مجھے نماز پڑھتے دیکھا ہے"
    },
    {
      "arabic": "اَلسَّبْعَةُ",
      "english": "The Seven (compilers)",
      "urdu": "ساتوں محدثین"
    },
    {
      "arabic": "اَلْحَدِيثَ",
      "english": "The Hadith (rest of the narration)",
      "urdu": "پوری حدیث"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ جب نماز کا وقت آ جائے تو اس کی اطلاع کے لیے لوگوں میں سے کسی ایک کو اذان دینی چاہیے اور پھر نماز کی امامت کرنی چاہیے۔ اس حدیث میں نماز کے طریقہ کار کو نبی اکرم صلی اللہ علیہ وسلم کے طریقہ کار کی مکمل پیروی کے ساتھ ادا کرنے کی بھی تاکید کی گئی ہے (صَلُّوا كَمَا رَأَيْتُمُونِي أُصَلِّي)۔",
    "english": "This Hadith states that when the prayer time arrives, one person from the group should call the Adhān to announce it, and then lead the prayer. The Hadith also contains the crucial command emphasizing the necessity of performing the prayer exactly according to the Prophet's (ﷺ) method (Ṣallū kamā ra'aitumūnī uṣallī — Pray as you have seen me praying)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (628)",
      "english": "Reported by Al-Bukhārī (628)"
    },
    {
      "arabic": "رواه مسلم (674)",
      "english": "Reported by Muslim (674)"
    },
    {
      "arabic": "رواه أبو داود (589)",
      "english": "Reported by Abu Dawud (589)"
    },
    {
      "arabic": "رواه أحمد (3/436)",
      "english": "Reported by Ahmad (3/436)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "مالك بن الحويرث",
        "english": "Mālik ibn Al-Ḥuwayrith"
      },
      "slug": "malik-ibn-al-huwayrith"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=R-t1yM-l1hI",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اجتماعی نماز کا حکم",
        "english": "The Ruling of Congregational Prayer"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان کا اجتماعی ہونا",
              "english": "The Communal Nature of Adhān"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ نے جماعت کے لیے اذان کا حکم دیا، یہاں تک کہ سفر میں بھی جب لوگ ایک جگہ جمع ہوں۔",
                "«فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ» کا مطلب ہے کہ اذان ایک اجتماعی ذمہ داری ہے جو کسی ایک شخص کو ادا کرنی چاہیے۔",
                "یہ اس بات کی دلیل ہے کہ مسجد کے علاوہ بھی، اگر لوگ کسی جگہ نماز پڑھیں تو اذان اور اقامت دونوں سنت ہیں۔"
              ],
              "english": [
                "The Prophet (ﷺ) commanded the Adhān for the congregation, even during travel when people gathered together.",
                "The phrase 'let one of you call the Adhān for you' implies that Adhān is a communal responsibility to be performed by one person.",
                "This proves that Adhān and Iqāmah are Sunnah even outside the mosque if a group gathers for prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "امامت اور افضل شخص",
              "english": "Imāmah and the Most Qualified Person"
            },
            "content": {
              "urdu": [
                "حدیث کا اگلا حصہ یہ ہے کہ 'پھر تم میں سے سب سے بڑا (زیادہ قرآن جاننے والا) امامت کرائے۔'",
                "یہ حکم امام کے انتخاب کا معیار بیان کرتا ہے کہ علم، بالخصوص قرآن کا علم، امامت کی اولین شرط ہے۔",
                "اگرچہ اذان کوئی بھی دے سکتا ہے، لیکن امامت کے لیے سب سے زیادہ اہل شخص کا انتخاب ضروری ہے۔"
              ],
              "english": [
                "The subsequent part of the Hadith states: 'Then let the one among you who is the oldest/most knowledgeable of the Qur'ān lead you in prayer.'",
                "This defines the criterion for choosing the Imām, making knowledge, especially of the Qur'ān, the primary condition for Imāmah.",
                "While anyone can call the Adhān, selecting the most qualified person to lead the prayer is essential."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نماز کے طریقے کی اہمیت",
        "english": "Importance of the Prayer Method"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "نبی ﷺ کی مکمل پیروی",
              "english": "Complete Following of the Prophet (ﷺ)"
            },
            "content": {
              "urdu": [
                "حدیث کا سب سے اہم ٹکڑا «وصلوا كما رأيتموني أصلي» (نماز اسی طرح پڑھو جس طرح تم نے مجھے پڑھتے دیکھا ہے) ہے۔",
                "یہ حکم عبادات میں سنتِ نبوی ﷺ کی مکمل پیروی کو فرض قرار دیتا ہے اور بدعت کو مسترد کرتا ہے۔",
                "نماز کے تمام افعال، ارکان اور آداب کو نبی ﷺ کے طریقے کے مطابق ادا کرنا ضروری ہے۔"
              ],
              "english": [
                "The most crucial part of the Hadith is 'And pray as you have seen me praying.'",
                "This command makes the complete adherence to the Prophetic Sunnah in worship obligatory and rejects all forms of innovation (Bid'ah).",
                "All actions, pillars, and manners of the prayer must be performed precisely according to the Prophet's (ﷺ) method."
              ]
            }
          },
          {
            "title": {
              "urdu": "صحت اور قبولیت کا معیار",
              "english": "Standard for Validity and Acceptance"
            },
            "content": {
              "urdu": [
                "کسی بھی مسلمان کی نماز کی صحت اور قبولیت کا معیار نبی ﷺ کے طریقہ کار کی مطابقت ہے۔",
                "یہ اصول صرف نماز تک محدود نہیں، بلکہ تمام شرعی احکام پر لاگو ہوتا ہے۔",
                "رسول اللہ ﷺ کی اتباع ہی دین میں کامیابی کی واحد ضمانت ہے۔"
              ],
              "english": [
                "The standard for the validity and acceptance of any Muslim's prayer is its conformity to the Prophet's (ﷺ) methodology.",
                "This principle is not restricted to prayer but applies to all legal rulings in Islam.",
                "Following the Messenger of Allah (ﷺ) is the sole guarantee of success in the religion."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "مالک بن حویرثؓ کی روایت کا پس منظر",
        "english": "Background of Mālik ibn Al-Ḥuwayrith's Narration"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "صحابہؓ کا حصولِ علم",
              "english": "Companions Seeking Knowledge"
            },
            "content": {
              "urdu": [
                "مالک بن حویرثؓ اور ان کے ساتھی بیس دن تک نبی ﷺ کے پاس رہے اور آپ سے نماز کا طریقہ سیکھا۔",
                "ان کا سوال اور آپ ﷺ کا تفصیلی جواب علم کی اہمیت اور اس کی نشر و اشاعت کو ظاہر کرتا ہے۔",
                "نبی ﷺ نے ان کی روانگی کے وقت انہیں یہ ہدایات دیں تاکہ وہ اپنی قوم میں دین کو قائم کریں۔"
              ],
              "english": [
                "Mālik ibn Al-Ḥuwayrith and his companions stayed with the Prophet (ﷺ) for twenty days, learning the prayer method from him.",
                "Their question and the Prophet's detailed answer highlight the importance of knowledge and its dissemination.",
                "The Prophet (ﷺ) gave them these instructions upon their departure to establish the religion among their own people."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم کا طریقہ",
              "english": "Method of Instruction"
            },
            "content": {
              "urdu": [
                "آپ ﷺ نے انہیں دو کاموں کا حکم دیا: اذان دینا اور نماز پڑھنا، جو جماعت کی بنیاد ہیں۔",
                "اذان اور نماز دونوں کی تعلیم دینا اور انہیں اپنی قوم کے حوالے کرنا اسلامی قیادت کا ماڈل ہے۔",
                "یہ اس بات کا ثبوت ہے کہ مسلمان ہر جگہ اپنی عبادات کو اجتماعی شکل میں ادا کرے۔"
              ],
              "english": [
                "He commanded them to do two things: calling the Adhān and leading the prayer, which are the fundamentals of congregation.",
                "Teaching both Adhān and prayer and entrusting them to their people is a model of Islamic leadership.",
                "This proves that Muslims should perform their acts of worship in a collective form wherever they are."
              ]
            }
          }
        ]
      }
    }
  ]
}
