{
  "hadithId": 147,
  "hadithNo": 4,
  "hadithReferences": {
    "sunnah.com": ["1:3:4"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": " عَنْ أَبِي جُحَيْفَةَ ‏- رضى الله عنه ‏- قَالَ: { رَأَيْتُ بِلَالاً يُؤَذِّنُ وَأَتَتَبَّعُ فَاهُ, هَاهُنَا وَهَاهُنَا, وَإِصْبَعَاهُ فِي أُذُنَيْهِ } رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ وَلِابْنِ مَاجَهْ: وَجَعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ وَلِأَبِي دَاوُدَ: { لَوَى عُنُقَهُ, لَمَّا بَلَغَ \"حَيَّ عَلَى اَلصَّلَاةِ \" يَمِينًا وَشِمَالاً وَلَمْ يَسْتَدِرْ } وَأَصْلِهِ فِي اَلصَّحِيحَيْنِ",
    "urdu": " سیدنا ابوجحیفہ رضی اللہ عنہ فرماتے ہیں کہ میں نے بلال رضی اللہ عنہ کو اذان دیتے دیکھا کہ وہ اپنا چہرہ، ادھر ادھر پھیرتے تھے۔ اس وقت ان کی دونوں انگلیاں (انگشت ہائے شہادت) ان کے کانوں میں تھیں۔ احمد اور ترمذی نے اسے روایت کیا ہے اور ترمذی نے اسے صحیح قرار دیا ہے۔ ابن ماجہ کی روایت میں ہے کہ انہوں نے اپنی انگلیاں اپنے کانوں میں داخل کر لیں اور ابوداؤد میں ہے کہ جب «حي على الصلاة» کہتے تو اپنے دائیں بائیں ذرا رخ موڑ لیتے بالکل گھومتے نہیں تھے۔ اس کی اصل صحیحین میں ہے۔ ",
    "english": "Narrated Abū Juḥayfah (RA): 'I saw Bilāl calling the Adhān, and I was following his mouth, turning here and here (left and right), and his fingers were in his ears.' Reported by Ahmad and At-Tirmidhī, and At-Tirmidhī graded it as Sahih (authentic). For Ibn Mājah: 'And he put his fingers into his ears.' And for Abu Dawud: 'He twisted his neck when he reached 'Ḥayya 'ala aṣ-ṣalāh' (Come to prayer) to the right and left, and he did not turn completely.' The origin of this narration is in Al-Ṣaḥīḥayn (Al-Bukhārī and Muslim)."
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه أحمد (4/308‏-309)‏، والترمذي (197)‏، وقال الترمذي: \"حديث حسن صحيح\".‏ ابن ماجه (711)‏، وهو صحيح أيضا، وإن كان في سنده ضعف يسير إلا أنه يعضد برواية الترمذي وأحمد.‏ أبو داود (520)‏ وهو منكر .‏ قلت.‏ هو في البخاري (634)‏، ومسلم (503)‏، عن ابن أبي جحيفة، عن أبيه؛ أنه رأى بلالا يؤذن.‏ قال: فجعلت أتتبع فاه هاهنا وهاهنا.‏ ",
    "urdu": "صحیح۔ اسے احمد (4/308-309) اور ترمذی (197) نے روایت کیا ہے، اور ترمذی نے کہا: ”حدیث حسن صحیح ہے۔“ ابن ماجہ (711) بھی صحیح ہے، اگرچہ اس کی سند میں ہلکا ضعف ہے لیکن اسے ترمذی اور احمد کی روایت کی تائید حاصل ہے۔ ابو داؤد (520) میں مذکورہ الفاظ منکر ہیں۔ میں (حافظ ابن حجر) کہتا ہوں: اس کی اصل بخاری (634) اور مسلم (503) میں ابن ابی جحیفہ کی اپنے والد سے روایت میں ہے کہ انہوں نے بلال کو اذان دیتے دیکھا، تو وہ ان کے منہ کو یہاں وہاں (دائیں بائیں) دیکھتے رہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Ahmad (4/308-309) and At-Tirmidhī (197), and At-Tirmidhī said: 'Hadith Ḥasan Ṣaḥīḥ (Good and Authentic).' Ibn Mājah (711) is also authentic, although its chain has slight weakness, it is supported by the narration of At-Tirmidhī and Ahmad. The specific wording in Abu Dawud (520) is rejected (Munkar). I say: Its origin is in Al-Bukhārī (634) and Muslim (503), narrated from Ibn Abī Juḥayfah, from his father, that he saw Bilāl calling the Adhān, and he began to follow his mouth turning here and there (left and right).",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "يُؤَذِّنُ",
      "english": "He was calling the Adhān",
      "urdu": "وہ اذان دے رہے تھے"
    },
    {
      "arabic": "أَتَتَبَّعُ فَاهُ",
      "english": "I was following his mouth",
      "urdu": "میں ان کے منہ کو دیکھ رہا تھا"
    },
    {
      "arabic": "إِصْبَعَاهُ فِي أُذُنَيْهِ",
      "english": "His fingers were in his ears",
      "urdu": "ان کی انگلیاں ان کے کانوں میں تھیں"
    },
    {
      "arabic": "لَوَى عُنُقَهُ",
      "english": "He twisted his neck",
      "urdu": "انہوں نے اپنی گردن موڑی"
    },
    {
      "arabic": "يَمِينًا وَشِمَالاً",
      "english": "To the right and left",
      "urdu": "دائیں اور بائیں"
    },
    {
      "arabic": "لَمْ يَسْتَدِرْ",
      "english": "He did not turn completely",
      "urdu": "وہ پوری طرح نہیں گھومے"
    },
    {
      "arabic": "حَيَّ عَلَى اَلصَّلَاةِ",
      "english": "Come to prayer",
      "urdu": "حی علی الصلاۃ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث اذان دینے کے آداب اور طریقہ کار کو بیان کرتی ہے، جس میں مؤذن کا اذان دیتے وقت اپنی انگلیوں کو کانوں میں ڈالنا اور «حي على الصلاة» اور «حي على الفلاح» کہتے وقت دائیں اور بائیں جانب چہرے کو موڑنا شامل ہے تاکہ آواز دور تک جا سکے۔ یہ سنت بلال رضی اللہ عنہ کے عمل سے ثابت ہے۔",
    "english": "This Hadith describes the mannerisms and procedure of calling the Adhān, which includes the Mu'adhdhin placing his fingers in his ears and turning his face to the right and left while saying 'Ḥayya 'ala aṣ-ṣalāh' and 'Ḥayya 'ala al-falāḥ' to ensure the sound reaches farther. This Sunnah is confirmed by the practice of Bilāl (RA)."
  },
  "references": [
    {
      "arabic": "رواه البخاري (634)",
      "english": "Reported by Al-Bukhārī (634)"
    },
    {
      "arabic": "رواه مسلم (503)",
      "english": "Reported by Muslim (503)"
    },
    {
      "arabic": "رواه الترمذي (197)",
      "english": "Reported by At-Tirmidhī (197)"
    },
    {
      "arabic": "رواه ابن ماجه (711)",
      "english": "Reported by Ibn Mājah (711)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو جحيفة وهب بن عبد الله",
        "english": "Abū Juḥayfah Wahb ibn 'Abdullāh"
      },
      "slug": "abu-juhayfah-wahb-ibn-abdullah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kR9U_vH0xYk",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "اذان دینے کے آداب",
        "english": "Mannerisms of Calling the Adhān"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "کانوں میں انگلیاں ڈالنا (تصویب)",
              "english": "Placing Fingers in the Ears (Taṣwīb)"
            },
            "content": {
              "urdu": [
                "اذان دیتے وقت دونوں انگلیوں کو کانوں میں ڈالنا سنت ہے، جیسا کہ بلالؓ کے عمل سے ثابت ہے۔",
                "اس کا مقصد آواز کو زیادہ بلند اور گونجدار بنانا ہے تاکہ زیادہ دور تک پہنچ سکے۔",
                "یہ عمل اس بات کی دلیل ہے کہ مؤذن کو اذان بلند آواز سے دینی چاہیے۔"
              ],
              "english": [
                "It is Sunnah to place both fingers into the ears while calling the Adhān, as proven by the action of Bilāl (RA).",
                "The purpose is to make the voice louder and more resonant so it can be heard farther away.",
                "This action indicates that the Mu'adhdhin should call the Adhān in a high voice."
              ]
            }
          },
          {
            "title": {
              "urdu": "دائیں بائیں منہ موڑنا (التلوّي)",
              "english": "Turning the Face Left and Right (At-Talawwī)"
            },
            "content": {
              "urdu": [
                "جب مؤذن «حي على الصلاة» کہے تو دائیں طرف اور «حي على الفلاح» کہے تو بائیں طرف چہرے کو موڑے۔",
                "اس کا مقصد یہ ہے کہ آواز چاروں اطراف میں پھیل جائے اور تمام لوگ نماز کی طرف متوجہ ہو سکیں۔",
                "ابو داؤد کی روایت کے مطابق صرف گردن موڑی جائے، پورے جسم کو گھمایا نہ جائے۔"
              ],
              "english": [
                "The Mu'adhdhin should turn his face to the right when saying 'Ḥayya 'ala aṣ-ṣalāh' and to the left when saying 'Ḥayya 'ala al-falāḥ'.",
                "The aim is to spread the sound in all directions so that everyone can be alerted to the prayer.",
                "According to Abu Dawud's narration, only the neck should be twisted, not the whole body."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور فنی حکمت",
        "english": "Juristic and Technical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آواز کا پھیلاؤ",
              "english": "Spreading the Sound"
            },
            "content": {
              "urdu": [
                "قدیم زمانے میں لاؤڈ سپیکر کی عدم موجودگی میں یہ آداب آواز کو دور تک پہنچانے کے لیے ضروری تھے۔",
                "انگلیوں کو کانوں میں ڈالنے سے مؤذن کو اپنی آواز کی بازگشت محسوس ہوتی ہے جو اسے مزید بلند بولنے کی ترغیب دیتی ہے۔",
                "یہ سنتیں اذان کے پیغام کو مؤثر طریقے سے پہنچانے کا ایک فن ہیں۔"
              ],
              "english": [
                "In ancient times, without loudspeakers, these mannerisms were essential for projecting the voice far and wide.",
                "Placing the fingers in the ears allows the Mu'adhdhin to hear his own voice's reverberation, encouraging him to speak louder.",
                "These Sunnah practices are techniques for effectively conveying the message of the Adhān."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان کا وقار",
              "english": "Dignity of the Adhān"
            },
            "content": {
              "urdu": [
                "اذان اللہ کے نام کو بلند کرنے اور لوگوں کو عبادت کی دعوت دینے کا ایک شعار ہے۔",
                "مؤذن کو ان آداب کا خیال رکھنا چاہیے تاکہ اذان کا وقار اور احترام قائم رہے۔",
                "اذان کو جلدی میں یا غفلت سے نہیں دینا چاہیے بلکہ ٹھہر ٹھہر کر ادا کرنا چاہیے۔"
              ],
              "english": [
                "The Adhān is a ritual for exalting the name of Allah and inviting people to worship.",
                "The Mu'adhdhin must adhere to these mannerisms to maintain the dignity and respect of the Adhān.",
                "The Adhān should not be called hastily or carelessly but should be delivered distinctly and deliberately."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی سبق",
        "english": "Training and Practical Lessons"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "مشاہدے کی اہمیت",
              "english": "Importance of Observation"
            },
            "content": {
              "urdu": [
                "ابوجحیفہؓ کا بلالؓ کے اذان دینے کے عمل کا مشاہدہ کرنا صحابہ کرامؓ کے شوقِ علم کو ظاہر کرتا ہے۔",
                "یہ ہمیں سکھاتا ہے کہ عبادات کے طریقوں کو سنت کے مطابق باریک بینی سے دیکھنا چاہیے۔",
                "رسول اللہ ﷺ کی سنت کو محض الفاظ سے نہیں، بلکہ عمل سے بھی سمجھنا چاہیے۔"
              ],
              "english": [
                "Abū Juḥayfah's observation of Bilāl's Adhān demonstrates the Companions' eagerness to learn the religion.",
                "It teaches us to scrutinize the methods of worship to ensure they conform to the Sunnah.",
                "The Sunnah of the Prophet (ﷺ) should be understood not just from words, but also from actions."
              ]
            }
          },
          {
            "title": {
              "urdu": "دعوت اور مخاطب",
              "english": "Call and Audience"
            },
            "content": {
              "urdu": [
                "اذان دراصل تمام انسانوں کے لیے نماز کی دعوت ہے، اسی لیے اسے ہر طرف پھیلا کر کہا جاتا ہے۔",
                "دائیں اور بائیں موڑنے میں انسانوں کو نماز کے لیے براہ راست دعوت دینے کی حکمت پوشیدہ ہے۔",
                "یہ حکم مسلمانوں کو اپنی ذمہ داریوں کو بہتر طریقے سے ادا کرنے کی ترغیب دیتا ہے۔"
              ],
              "english": [
                "The Adhān is essentially an invitation to prayer for all people, which is why it is called out in all directions.",
                "Turning right and left holds the wisdom of directly calling people to prayer.",
                "This command encourages Muslims to perform their duties in the most effective manner."
              ]
            }
          }
        ]
      }
    }
  ]
}
