{
  "hadithId": 148,
  "hadithNo": 5,
  "hadithReferences": {
    "sunnah.com": ["1:3:5"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": " وَعَنْ أَبِي مَحْذُورَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَعْجَبَهُ صَوْتُهُ, فَعَلَّمَهُ اَلْآذَانَ } رَوَاهُ اِبْنُ خُزَيْمَةَ",
    "urdu": "سیدنا ابومحذورہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم کو ان کی آواز بہت پسند آئی۔ چنانچہ آپ صلی اللہ علیہ وسلم نے انہیں (ابومحذورہ رضی اللہ عنہ کو) اذان کی تعلیم خود دی (اذان سکھائی)۔ (ابن خزیمہ)  ",
    "english": "Narrated Abu Maḥdhūrah (RA): 'The Prophet (ﷺ) was impressed by his voice, so he taught him the Adhān.' Reported by Ibn Khuzaymah."
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه ابن خزيمة (377)‏ في سياق تعليم أبي محذورة الأذان، وأصله في مسلم (379).‏ وهذا الجزء يدل على أهمية اختيار المؤذن لحسن صوته.‏ ",
    "urdu": "صحیح۔ اسے ابن خزیمہ (377) نے ابومحذورہ کو اذان سکھانے کے سیاق میں روایت کیا ہے، اور اس کی اصل مسلم (379) میں ہے۔ یہ حصہ اس بات کی دلیل ہے کہ مؤذن کے انتخاب میں آواز کی خوبصورتی کو اہمیت حاصل ہے۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Ibn Khuzaymah (377) within the context of teaching Abū Maḥdhūrah the Adhān, and its origin is in Muslim (379). This part indicates the importance of choosing the Mu'adhdhin based on the quality of his voice.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "أَعْجَبَهُ صَوْتُهُ",
      "english": "His voice impressed him",
      "urdu": "آپ کو اس کی آواز پسند آئی"
    },
    {
      "arabic": "فَعَلَّمَهُ اَلْآذَانَ",
      "english": "So he taught him the Adhān",
      "urdu": "چنانچہ آپ نے اسے اذان سکھائی"
    },
    {
      "arabic": "اَلْمُؤَذِّنَ",
      "english": "The Mu'adhdhin (caller to prayer)",
      "urdu": "اذان دینے والا"
    },
    {
      "arabic": "اَلْفِطْرَة",
      "english": "Natural disposition",
      "urdu": "فطرت"
    },
    {
      "arabic": "حُسْنُ اَلصَّوْتِ",
      "english": "Good voice",
      "urdu": "اچھی آواز"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث بیان کرتی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ابومحذورہ رضی اللہ عنہ کی خوبصورت آواز سے متاثر ہو کر انہیں مکہ میں اذان کا طریقہ سکھایا اور انہیں مؤذن مقرر کیا۔ یہ اس بات کی دلیل ہے کہ اذان کی ادائیگی کے لیے آواز کا خوبصورت اور بلند ہونا مستحب ہے۔",
    "english": "This Hadith states that the Prophet (ﷺ) was impressed by the beautiful voice of Abū Maḥdhūrah (RA) and consequently taught him the Adhān and appointed him as the Mu'adhdhin for Makkah. This establishes that having a good and loud voice is a recommended quality for the caller to prayer."
  },
  "references": [
    {
      "arabic": "رواه ابن خزيمة (377)",
      "english": "Reported by Ibn Khuzaymah (377)"
    },
    {
      "arabic": "أصله في صحيح مسلم (379)",
      "english": "Origin in Sahih Muslim (379)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو محذورة",
        "english": "Abu Maḥdhūrah"
      },
      "slug": "abu-mahthurah"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=kR9U_vH0xYk",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "مؤذن کے لیے شرطیں اور آداب",
        "english": "Conditions and Manners for the Mu'adhdhin"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "خوبصورت آواز کی اہمیت",
              "english": "Importance of a Beautiful Voice"
            },
            "content": {
              "urdu": [
                "نبی اکرم ﷺ کا ابومحذورہؓ کی آواز سے متاثر ہونا مؤذن کے انتخاب میں حسن صوت کی اہمیت کو واضح کرتا ہے۔",
                "اذان اللہ کا عظیم شعار ہے، اس لیے اسے خوش الحانی سے ادا کیا جانا چاہیے تاکہ لوگ اس کی طرف متوجہ ہوں۔",
                "آواز کا اچھا ہونا ایک مستحب صفت ہے، واجب نہیں، لیکن اس سے دعوت کا اثر بڑھتا ہے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) appreciation of Abū Maḥdhūrah's voice highlights the importance of a beautiful voice in choosing a Mu'adhdhin.",
                "The Adhān is a great symbol of Islam, so it should be delivered melodiously to attract people.",
                "A good voice is a recommended quality, not an obligation, but it enhances the effect of the call."
              ]
            }
          },
          {
            "title": {
              "urdu": "تعلیم اور تقرری",
              "english": "Instruction and Appointment"
            },
            "content": {
              "urdu": [
                "آواز پسند آنے پر نبی ﷺ نے فوراً انہیں اذان کی تعلیم دی اور مکہ کا مؤذن مقرر کیا جو ایک بڑا اعزاز تھا۔",
                "یہ حکم اس بات کی دلیل ہے کہ اہل فضیلت کو دینی ذمہ داریوں پر فائز کرنا چاہیے۔",
                "مکہ میں اذان کے لیے اس شخص کا انتخاب ہوا جس کی آواز بہترین تھی تاکہ دور دور تک نماز کی دعوت پہنچے۔"
              ],
              "english": [
                "Upon hearing his voice, the Prophet (ﷺ) immediately taught him the Adhān and appointed him as the Mu'adhdhin of Makkah, which was a great honor.",
                "This indicates that people of distinction and virtue should be entrusted with religious responsibilities.",
                "The person with the best voice was chosen for the Adhān in Makkah to ensure the call to prayer reached far and wide."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "فقہی اور فنی حکمت",
        "english": "Juristic and Technical Wisdom"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "آواز کی بلندی اور اخلاص",
              "english": "Loudness and Sincerity of Voice"
            },
            "content": {
              "urdu": [
                "اذان کا مقصد لوگوں کو نماز کے لیے پکارنا ہے، اس لیے مؤذن کو بلند آواز والا ہونا چاہیے، جیسا کہ بلالؓ اور ابومحذورہؓ تھے۔",
                "اذان کی بلندی اور گونج کو صرف آواز کی خوبصورتی کے لیے نہیں، بلکہ مقصد کی تکمیل کے لیے استعمال کرنا چاہیے۔",
                "صرف آواز کی خوبصورتی اخلاص کے ساتھ ہونی چاہیے، تاکہ ریاکاری کا شائبہ نہ ہو۔"
              ],
              "english": [
                "The purpose of Adhān is to call people to prayer, so the Mu'adhdhin must have a loud voice, like Bilāl and Abū Maḥdhūrah.",
                "The loudness and resonance of the Adhān should be used for fulfilling the purpose, not merely for vocal aesthetics.",
                "The beauty of the voice must be accompanied by sincerity to avoid any suspicion of ostentation."
              ]
            }
          },
          {
            "title": {
              "urdu": "ابومحذورہ کی اذان کا طریقہ",
              "english": "The Method of Abū Maḥdhūrah's Adhān"
            },
            "content": {
              "urdu": [
                "ابومحذورہؓ کی یہ روایت ترجیع (شہادتین کی تکرار) والی اذان کی دلیل ہے، جو شافعی اور حنفی مذاہب کا ایک مسلک ہے۔",
                "آواز کی خوبصورتی کے ساتھ، اذان کے کلمات کی صحیح ادائیگی اور فقہی طریقہ بھی ضروری ہے۔",
                "نبی ﷺ نے ابومحذورہؓ کو ان کی آواز کی وجہ سے ترجیع والی اذان سکھائی، جو مکہ میں معمول بن گئی۔"
              ],
              "english": [
                "This narration by Abū Maḥdhūrah (RA) is evidence for the Adhān with Tarjī' (repetition of the Shahādah), which is a view in the Shāfi'ī and Ḥanafī schools.",
                "Along with a beautiful voice, correct pronunciation and the legal method of the Adhān are essential.",
                "The Prophet (ﷺ) taught Abū Maḥdhūrah the Adhān with Tarjī' due to his voice, which became the practice in Makkah."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "عملی زندگی اور تربیت",
        "english": "Practical Life and Training"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "قدرتی صلاحیتوں کا استعمال",
              "english": "Utilizing Natural Talents"
            },
            "content": {
              "urdu": [
                "یہ حدیث ہمیں سکھاتی ہے کہ اللہ نے انسان کو جو بھی صلاحیتیں دی ہیں، انہیں دین کی خدمت میں استعمال کرنا چاہیے۔",
                "خوبصورت آواز کو اللہ کی عبادت (اذان) کے لیے استعمال کرنا دنیا میں بھی اجر اور آخرت میں بلندی کا سبب ہے۔",
                "مؤذن کا مقام اسلام میں بہت اونچا ہے اور وہ قیامت کے دن سب سے لمبی گردن والے ہوں گے۔"
              ],
              "english": [
                "This Hadith teaches us that whatever talents Allah has given a person should be utilized in serving the religion.",
                "Using a beautiful voice for the worship of Allah (Adhān) brings reward in this world and high status in the Hereafter.",
                "The Mu'adhdhin has a high status in Islam and will have the longest necks on the Day of Resurrection."
              ]
            }
          },
          {
            "title": {
              "urdu": "اچھے مؤذن کی تلاش",
              "english": "Searching for a Good Mu'adhdhin"
            },
            "content": {
              "urdu": [
                "مسلمانوں کو چاہیے کہ وہ اپنی مساجد کے لیے خوبصورت اور اچھی آواز والے مؤذن کا انتخاب کریں۔",
                "اس کے ساتھ ساتھ مؤذن کا نیک اور وقت کی پابندی کرنے والا ہونا بھی ضروری ہے۔",
                "یہ انتخاب عبادت کی دعوت کے پیغام کو زیادہ مؤثر اور دلکش بناتا ہے۔"
              ],
              "english": [
                "Muslims should strive to choose a Mu'adhdhin with a beautiful and good voice for their mosques.",
                "In addition, the Mu'adhdhin must also be righteous and punctual in fulfilling the times.",
                "This selection makes the message of the call to worship more effective and appealing."
              ]
            }
          }
        ]
      }
    }
  ]
}
