{
  "hadithId": 150,
  "hadithNo": 7,
  "hadithReferences": {
    "sunnah.com": ["1:3:7"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": " وَعَنْ أَبِي قَتَادَةٌ فِي اَلْحَدِيثِ اَلطَّوِيلِ, { فِي نَوْمهُمْ عَنْ اَلصَّلَاةِ ‏- ثُمَّ أَذَّنَ بِلَالٌ, فَصَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَمَا كَانَ يَصْنَعُ كُلَّ يَوْمٍ } رَوَاهُ مُسْلِمٌ وَلَهُ عَنْ جَابِرٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَتَى اَلْمُزْدَلِفَةَ فَصَلَّى بِهَا اَلْمَغْرِبَ وَالْعِشَاءَ, بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ } وَلَهُ عَنْ اِبْنِ عُمَرَ: { جَمَعَ بَيْنَ اَلْمَغْرِبِ وَالْعِشَاءِ بِإِقَامَةٍ وَاحِدَةٍ } زَادَ أَبُو دَاوُدَ: { لِكُلِّ صَلَاةٍ }  وَفِي رِوَايَةِ لَهُ: { وَلَمْ يُنَادِ فِي وَاحِدَةٍ مِنْهُمَا }",
    "urdu": " سیدنا ابوقتادہ رضی اللہ عنہ سے (ایک لمبی حدیث جس میں دوران سفر غلبہ نیند اور تھکاوٹ سفر کی وجہ سے سو جانے کا ذکر ہے) مروی ہے، جب نیند سے بیداری ہوئی تو پھر بلال رضی اللہ عنہ نے اذان کہی اور نبی کریم صلی اللہ علیہ وسلم نے اسی طرح نماز پڑھی جس طرح روزانہ پڑھتے تھے۔ (مسلم) اور مسلم میں سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم مزدلفہ میں پہنچے تو وہاں آپ صلی اللہ علیہ وسلم نے مغرب اور عشاء کی نماز ایک اذان اور دو اقامتوں سے پڑھی اور مسلم ہی میں ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے مغرب اور عشاء دونوں نمازیں جمع کر کے ایک ہی اقامت کے ساتھ ادا فرمائیں اور ابوداؤد نے اتنا اضافہ نقل کیا ہے کہ ہر نماز کیلئے تکبیر کہی گئی اور اسی کی ایک روایت میں منقول ہے کہ ان دونوں نمازوں میں سے کسی کے لئے بھی اذان نہیں کہی گئی۔",
    "english": "Narrated Abū Qatādah (RA) in a long Hadith about sleeping through the prayer: '...Then Bilāl called the Adhān, and the Messenger of Allah (ﷺ) prayed as he used to do every day.' Reported by Muslim. And for Muslim, from Jābir (RA): 'The Prophet (ﷺ) came to Al-Muzdalifah and prayed Maghrib and 'Ishā' there with one Adhān and two Iqāmahs.' And for Muslim, from Ibn 'Umar: 'He combined Maghrib and 'Ishā' with one Iqāmah.' Abū Dawūd added: 'for every prayer.' And in a narration for him: 'and he did not call the Adhān for either of them.'"
  },
  "takhreej": {
    "arabic": "صحيح.‏ رواه مسلم (681)‏ في حديث طويل.‏ صحيح.‏ رواه مسلم (2/891/عبد الباقي)‏، وفي مسلم بعد اللفظ المذكور قوله: \"ولم يسبح بينهما شيئا\".‏ قلت: وهذا هو الصواب في تلك الليلة ‏-ليلة مزدلفة‏- وأما ما ذكره بعضهم أن من السنة صلاة ركعتين سنة المغرب اعتمادا منه على رواية ابن مسعود التي في \"البخاري\" فهو خطأ، وقد رددت عليه مفصلا \"بالأصل\".‏ صحيح.‏ رواه مسلم (1288)‏ (289 و 290)‏ وقوله: \"بإقامة واحدة\" أي: لكل صلاة كما هي رواية أبي داود (1928)‏، وهذا الحمل لرواية مسلم أولى من القول بشذوذها.‏ وأما رواية أبي داود: \"ولم يناد في واحدة منهما\" فهي شاذة.‏ والله أعلم.‏",
    "urdu": "صحیح۔ اسے مسلم (681) نے ایک لمبی حدیث میں روایت کیا ہے۔ صحیح۔ اسے مسلم (2/891/عبد الباقی) نے روایت کیا، اور مسلم میں مذکورہ الفاظ کے بعد یہ قول بھی ہے: ”اور ان دونوں کے درمیان کوئی نفلی نماز نہیں پڑھی۔“ میں (حافظ ابن حجر) کہتا ہوں: مزدلفہ کی اس رات کے لیے یہی صحیح ہے، اور بعض علماء کا ابن مسعودؓ کی بخاری والی روایت پر اعتماد کرتے ہوئے مغرب کی دو سنتیں پڑھنا خطا ہے، اور میں نے اس پر اصل میں تفصیلی رد کیا ہے۔ صحیح۔ اسے مسلم (1288)، (289، 290) نے روایت کیا ہے۔ اور ان کا قول ”بإقامة واحدة“ (ایک اقامت کے ساتھ) سے مراد یہ ہے کہ ہر نماز کے لیے الگ اقامت، جیسا کہ ابوداؤد (1928) کی روایت میں ہے، اور مسلم کی روایت کو اس پر محمول کرنا اس کے شاذ ہونے کے قول سے بہتر ہے۔ البتہ ابو داؤد کی روایت: ”اور ان دونوں میں سے کسی کے لیے بھی اذان نہیں کہی گئی“ شاذ ہے۔ واللہ اعلم۔",
    "english": "Authentic (Ṣaḥīḥ). Reported by Muslim (681) in a long Hadith. Authentic (Ṣaḥīḥ). Reported by Muslim (2/891/Abdul-Baqi), and after the mentioned wording, Muslim adds: 'and he did not perform any voluntary prayer (tasbīḥ) between them.' I say: This is the correct practice for that night (Muzdalifah night). The claim by some scholars that it is Sunnah to pray the two rak'ahs Sunnah of Maghrib, relying on the narration of Ibn Mas'ūd in Al-Bukhārī, is an error, and I have refuted it in detail in the original text. Authentic (Ṣaḥīḥ). Reported by Muslim (1288), (289, 290). The phrase 'with one Iqāmah' should be understood as meaning one Iqāmah for each prayer, as indicated by the narration of Abu Dawud (1928), and this interpretation of the Muslim narration is preferred over declaring it anomalous (shādh). However, the narration of Abu Dawud: 'and he did not call the Adhān for either of them' is anomalous. And Allah knows best.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "نَوْمهُمْ عَنْ اَلصَّلَاةِ",
      "english": "Their sleeping through the prayer",
      "urdu": "ان کا نماز سے سو جانا"
    },
    {
      "arabic": "أَذَّنَ بِلَالٌ",
      "english": "Bilāl called the Adhān",
      "urdu": "بلال نے اذان دی"
    },
    {
      "arabic": "اَلْمُزْدَلِفَةَ",
      "english": "Al-Muzdalifah (a holy site)",
      "urdu": "مزدلفہ"
    },
    {
      "arabic": "بِأَذَانٍ وَاحِدٍ",
      "english": "With one Adhān",
      "urdu": "ایک اذان کے ساتھ"
    },
    {
      "arabic": "إِقَامَتَيْنِ",
      "english": "Two Iqāmahs",
      "urdu": "دو اقامتیں"
    },
    {
      "arabic": "جَمَعَ بَيْنَ",
      "english": "He combined (prayers)",
      "urdu": "انہوں نے جمع کیں"
    },
    {
      "arabic": "بِإِقَامَةٍ وَاحِدَةٍ",
      "english": "With one Iqāmah",
      "urdu": "ایک اقامت کے ساتھ"
    }
  ],
  "summary": {
    "urdu": "یہ حدیث دو مختلف شرعی مسائل کو بیان کرتی ہے: اول: اگر نماز وقت پر سو جانے یا بھول جانے کی وجہ سے فوت ہو جائے تو جاگنے یا یاد آنے پر اذان و اقامت کے ساتھ معمول کے مطابق ادا کی جائے گی۔ دوم: نمازوں کو جمع کرنے (مغرب اور عشاء کو مزدلفہ میں) کا طریقہ یہ ہے کہ ایک اذان کے ساتھ دو اقامتیں کہی جائیں (ہر نماز کے لیے ایک اقامت)، اور ان کے درمیان کوئی نفل نماز نہ پڑھی جائے۔",
    "english": "This Hadith addresses two distinct legal issues: Firstly, if a prayer is missed due to oversleeping or forgetting, it should be performed with Adhān and Iqāmah as usual upon waking up or remembering. Secondly, the method of combining prayers (specifically Maghrib and 'Ishā' in Muzdalifah) is to call one Adhān followed by two Iqāmahs (one for each prayer), with no voluntary prayers in between."
  },
  "references": [
    {
      "arabic": "رواه مسلم (681) عن أبي قتادة",
      "english": "Reported by Muslim (681) from Abū Qatādah"
    },
    {
      "arabic": "رواه مسلم (2/891) عن جابر",
      "english": "Reported by Muslim (2/891) from Jābir"
    },
    {
      "arabic": "رواه مسلم (1288) عن ابن عمر",
      "english": "Reported by Muslim (1288) from Ibn 'Umar"
    },
    {
      "arabic": "رواه أبو داود (1928) بزيادة",
      "english": "Reported by Abu Dawud (1928) with an addition"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "أبو قتادة الأنصاري",
        "english": "Abū Qatādah Al-Anṣārī"
      },
      "slug": "abu-qatadah-al-ansari"
    },
    {
      "id": 2,
      "name": {
        "arabic": "جابر بن عبد الله",
        "english": "Jābir ibn 'Abdullāh"
      },
      "slug": "jabir-ibn-abdullah"
    },
    {
      "id": 3,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn 'Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=FjIuS4dYwM0",
  "grade": {
    "arabic": "صحيح",
    "english": "Authentic (Sahih)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "فوت شدہ نماز کی قضا کا حکم",
        "english": "Ruling on Making Up Missed Prayers"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان و اقامت کا وجوب",
              "english": "Obligation of Adhān and Iqāmah"
            },
            "content": {
              "urdu": [
                "جب نماز بھول جانے یا سو جانے کی وجہ سے فوت ہو جائے تو جاگنے یا یاد آنے پر اسے فوراً ادا کرنا فرض ہے۔",
                "مسلم کی روایت میں بلالؓ نے اذان دی اور نبی ﷺ نے نماز کو معمول کے مطابق ادا فرمایا۔",
                "یہ اس بات کی دلیل ہے کہ فوت شدہ نماز کی قضا کرتے وقت بھی اذان و اقامت دینا مسنون ہے۔"
              ],
              "english": [
                "If a prayer is missed due to forgetfulness or sleep, it is immediately obligatory to perform it upon waking up or remembering.",
                "In Muslim's narration, Bilāl called the Adhān, and the Prophet (ﷺ) performed the prayer as he usually did.",
                "This proves that it is legislated to call the Adhān and Iqāmah even when making up a missed prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "روزانہ کے عمل کی مشابہت",
              "english": "Resemblance to Daily Practice"
            },
            "content": {
              "urdu": [
                "نبی ﷺ کا 'جس طرح روزانہ پڑھتے تھے' نماز پڑھنا ظاہر کرتا ہے کہ قضا میں بھی مکمل سنت کی پیروی ضروری ہے۔",
                "اذان و اقامت کے بغیر قضا کرنے کا عمل، جیسے عام نفل نماز، درست نہیں ہے۔",
                "یہ حکم اس اصول کی تائید کرتا ہے کہ نماز کی قضا اس کی اصلی حالت کے مطابق کی جانی چاہیے۔"
              ],
              "english": [
                "The Prophet's (ﷺ) praying 'as he used to do every day' indicates that the complete Sunnah must be followed even in Qadā' (make-up prayer).",
                "Performing the make-up prayer without Adhān and Iqāmah, like a voluntary prayer, is not correct.",
                "This ruling supports the principle that a missed prayer should be made up according to its original form."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "نمازوں کو جمع کرنے کا طریقہ (مزدلفہ)",
        "english": "Method of Combining Prayers (Muzdalifah)"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک اذان اور دو اقامتیں",
              "english": "One Adhān and Two Iqāmahs"
            },
            "content": {
              "urdu": [
                "حج کے دوران مزدلفہ میں مغرب اور عشاء کی نمازوں کو جمع کرنا سنتِ نبوی ﷺ سے ثابت ہے۔",
                "جابرؓ کی روایت کے مطابق، ان دونوں نمازوں کو ایک اذان اور ہر ایک کے لیے الگ اقامت کے ساتھ ادا کیا گیا۔",
                "یہ جمع (Combining) کے مقام پر سنت ہے، جہاں اذان کی تکرار نہیں ہوتی مگر اقامت ہر نماز کے لیے ضروری ہے۔"
              ],
              "english": [
                "Combining Maghrib and 'Ishā' prayers in Muzdalifah during Hajj is established by the Prophetic Sunnah.",
                "According to Jābir's narration, these two prayers were performed with one Adhān and a separate Iqāmah for each.",
                "This is the Sunnah at the place of combination, where the Adhān is not repeated, but an Iqāmah is necessary for each prayer."
              ]
            }
          },
          {
            "title": {
              "urdu": "درمیان میں نفل نماز کی ممانعت",
              "english": "Prohibition of Voluntary Prayer in Between"
            },
            "content": {
              "urdu": [
                "مسلم کی روایت میں یہ وضاحت ہے کہ نبی ﷺ نے دونوں نمازوں کے درمیان کوئی نفل (لم یسبح بینھما شیئا) ادا نہیں کی۔",
                "یہ اس بات کی دلیل ہے کہ جمع کی ہوئی نمازوں کے درمیان کوئی نفل یا سنت نماز ادا نہیں کی جانی چاہیے۔",
                "اس حکم کا مقصد جمع کے عمل کو مکمل طور پر فرض نمازوں کی ادائیگی پر مرکوز رکھنا ہے۔"
              ],
              "english": [
                "Muslim's narration clarifies that the Prophet (ﷺ) did not perform any voluntary prayer (lam yusabbiḥ bainahumā shai'an) between the two prayers.",
                "This proves that no voluntary or Sunnah prayer should be performed between combined obligatory prayers.",
                "The purpose of this ruling is to keep the act of combining focused entirely on the performance of the obligatory prayers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اقامت کا حکم اور فقہی تطبیق",
        "english": "Ruling of Iqāmah and Juristic Reconciliation"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "ایک اقامت بمقابلہ دو اقامتیں",
              "english": "One Iqāmah Versus Two Iqāmahs"
            },
            "content": {
              "urdu": [
                "ابن عمرؓ کی روایت میں ایک اقامت کا ذکر ہے، جبکہ جابرؓ کی روایت میں دو اقامتوں کا ذکر ہے۔",
                "فقہاء نے ابوداؤد کی روایت کے اضافے 'لکل صلاۃ' (ہر نماز کے لیے) کو ترجیح دی ہے، یعنی دو اقامتیں سنت ہیں۔",
                "ابن عمرؓ کی روایت کو دو اقامتوں پر محمول کیا جاتا ہے تاکہ صحیح احادیث کے درمیان تطبیق ہو سکے۔"
              ],
              "english": [
                "Ibn 'Umar's narration mentions one Iqāmah, while Jābir's narration mentions two Iqāmahs.",
                "Jurists prefer the addition in Abu Dawud's narration, 'for every prayer,' meaning two Iqāmahs is the Sunnah.",
                "Ibn 'Umar's narration is reconciled by interpreting 'one Iqāmah' as one Iqāmah for each prayer, harmonizing the authentic Ahadith."
              ]
            }
          },
          {
            "title": {
              "urdu": "اذان کا حکم (شاذ روایت)",
              "english": "Ruling on Adhān (Anomalous Narration)"
            },
            "content": {
              "urdu": [
                "ابوداؤد کی ایک روایت میں یہ کہا گیا کہ دونوں نمازوں کے لیے اذان نہیں دی گئی، جسے محدثین نے شاذ (Anomalous) قرار دیا۔",
                "صحیح اور معتبر روایت جابرؓ کی ہے، جس میں ایک اذان کا ذکر ہے، جو سنتِ نبوی ﷺ کے مطابق ہے۔",
                "شاذ روایت پر عمل نہیں کیا جاتا، لہٰذا جمع کی صورت میں بھی ایک اذان دینا ضروری ہے۔"
              ],
              "english": [
                "A narration in Abu Dawud states that Adhān was not called for either prayer, which scholars ruled as Anomalous (Shādh).",
                "The authentic and reliable narration is Jābir's, which mentions one Adhān, consistent with the Prophetic Sunnah.",
                "Anomalous narrations are not acted upon, so calling one Adhān is necessary even when combining prayers."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "تربیتی اور عملی فوائد",
        "english": "Training and Practical Benefits"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "احتیاط اور سنت کی پابندی",
              "english": "Caution and Adherence to Sunnah"
            },
            "content": {
              "urdu": [
                "مزدلفہ کا واقعہ ہنگامی حالات میں بھی شریعت کے اصولوں کی مکمل پابندی کا درس دیتا ہے۔",
                "نماز کو جاگنے کے بعد فوراً اذان و اقامت کے ساتھ ادا کرنا اخلاص کی دلیل ہے۔",
                "مسلمان کو اپنی عبادات میں نبی ﷺ کے طریق کار کی باریکیوں پر غور کرنا چاہیے۔"
              ],
              "english": [
                "The Muzdalifah incident teaches adherence to Sharia principles even in exceptional circumstances.",
                "Performing the prayer immediately upon waking up, with Adhān and Iqāmah, is proof of sincerity.",
                "A Muslim should reflect on the minute details of the Prophet's (ﷺ) methodology in their acts of worship."
              ]
            }
          },
          {
            "title": {
              "urdu": "آسانی اور تخفیف",
              "english": "Ease and Alleviation"
            },
            "content": {
              "urdu": [
                "سفر یا مشقت کی وجہ سے نمازوں کو جمع کرنے کی رخصت اسلام میں آسانی اور تخفیف کا مظہر ہے۔",
                "یہ آسانی فوت شدہ نماز کی قضا کے وقت بھی دی گئی کہ صرف ایک اذان کافی ہے، مگر ہر نماز کے لیے اقامت ضروری ہے۔",
                "یہ طریقہ نماز کی ادائیگی میں آسانی اور اس کے بنیادی ارکان کی حفاظت کو یقینی بناتا ہے۔"
              ],
              "english": [
                "The concession to combine prayers due to travel or hardship manifests the principle of ease and alleviation in Islam.",
                "This ease is also granted when making up missed prayers by requiring only one Adhān, but an Iqāmah is necessary for each prayer.",
                "This method ensures ease in performing the prayer while safeguarding its fundamental components."
              ]
            }
          }
        ]
      }
    }
  ]
}
