{
  "hadithId": 152,
  "hadithNo": 9,
  "hadithReferences": {
    "sunnah.com": ["1:3:9"],
    "kitabId": 2,
    "inKitabBab": 2,
    "arabicBook": "كتاب الأذان والإقامة",
    "babId": 12
  },
  "name": {
    "arabic": "وَعَنْ اِبْنِ عُمَرَ; { إِنَّ بِلَالاً أَذَّنَ قَبْلَ اَلْفَجْرِ, فَأَمَرَهُ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَنْ يَرْجِعَ, فَيُنَادِيَ: \"أَلَا إِنَّ اَلْعَبْدَ نَامَ } رَوَاهُ أَبُو دَاوُدَ وَضَعَّفَهُ ",
    "urdu": "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ (ایک روز) بلال رضی اللہ عنہ نے طلوع فجر سے پہلے ہی اذان کہہ دی تو نبی کریم صلی اللہ علیہ و سلم نے انہیں دوبارہ اذان کہنے کا حکم دیا (تو بلال رضی اللہ عنہ نے یہ الفاظ کہہ کر منادی کی) ”خبردار! سنو بندہ کو نیند آ گئی تھی۔“ ابوداؤد نے اسے روایت کیا اور ضعیف قرار دیا۔ ",
    "english": "Narrated Ibn 'Umar (RA): 'Bilāl called the Adhān before Fajr, so the Prophet (ﷺ) commanded him to return and proclaim: 'Verily, the servant has slept (i.e., called the Adhān early).'' Reported by Abū Dāwūd, and he graded it as weak."
  },
  "takhreej": {
    "arabic": " ضعيف.‏ رواه أبو داود (532)‏، وأما تضعيف أبي داود فمثله فعل الترمذي إذ قال: \"حديث غير محفوظ\"، وحجتهم في ذلك أن حماد بن سلمة أخطأ فيه.‏ قلت: وتخطئة الثقة بدون بينة مردود كما فعلوا ذلك هنا.‏ ولكن الجملة \"إن العبد نام\" ضعيفة ومعارضة لما هو أصح من أن بلالا كان يؤذن بليل بإذن النبي صلى الله عليه وسلم.‏",
    "urdu": "ضعیف۔ اسے ابو داؤد (532) نے روایت کیا ہے، اور ابو داؤد کی تضعیف کی طرح ہی ترمذی نے بھی کیا جب انہوں نے کہا: ”حدیث غیر محفوظ ہے۔“ اور ان کی دلیل یہ ہے کہ حماد بن سلمہ نے اس میں غلطی کی ہے۔ میں (حافظ ابن حجر) کہتا ہوں: ثقہ راوی کو بلا دلیل غلط قرار دینا مردود ہے، جیسا کہ انہوں نے یہاں کیا ہے۔ لیکن جملہ ”ان العبد نام“ (بے شک بندہ سو گیا) ضعیف ہے اور اس صحیح روایت کے معارض ہے کہ بلال نبی ﷺ کی اجازت سے رات میں اذان دیتے تھے۔",
    "english": "Weak (Ḍa'īf). Reported by Abū Dāwūd (532). Abū Dāwūd's grading of weakness is echoed by At-Tirmidhī, who said: 'The Hadith is not preserved (Ghair Maḥfūẓ),' arguing that Ḥammād ibn Salamah erred in it. I say: Refuting a trustworthy narrator without evidence is rejected, as they did here. However, the phrase 'Verily, the servant has slept' is weak and contradicts the more authentic narration that Bilāl called the Adhān by night with the Prophet's (ﷺ) permission.",
    "english_alternative": ""
  },
  "importantWords": [
    {
      "arabic": "أَذَّنَ قَبْلَ اَلْفَجْرِ",
      "english": "Called the Adhān before Fajr",
      "urdu": "فجر سے پہلے اذان دی"
    },
    {
      "arabic": "فَأَمَرَهُ اَلنَّبِيُّ",
      "english": "The Prophet commanded him",
      "urdu": "نبی نے انہیں حکم دیا"
    },
    {
      "arabic": "أَنْ يَرْجِعَ",
      "english": "To return",
      "urdu": "کہ وہ واپس جائیں"
    },
    {
      "arabic": "فَيُنَادِيَ",
      "english": "And proclaim/call out",
      "urdu": "اور منادی کریں"
    },
    {
      "arabic": "أَلَا إِنَّ اَلْعَبْدَ نَامَ",
      "english": "Verily, the servant has slept",
      "urdu": "خبردار! بندہ سو گیا تھا"
    },
    {
      "arabic": "وَضَعَّفَهُ",
      "english": "And he graded it as weak",
      "urdu": "اور اس کو ضعیف قرار دیا"
    }
  ],
  "summary": {
    "urdu": "یہ روایت بیان کرتی ہے کہ ایک موقع پر بلال رضی اللہ عنہ نے فجر کا وقت ہونے سے پہلے ہی اذان دے دی، جس پر نبی اکرم صلی اللہ علیہ وسلم نے انہیں واپس جا کر اعلان کرنے کا حکم دیا کہ اذان جلدی میں (سوتے ہوئے) دی گئی تھی۔ یہ روایت سند کے اعتبار سے ضعیف ہے، لیکن فقہی طور پر اس پر دلیل لی جاتی ہے کہ اگر اذان وقت سے پہلے ہو جائے تو اسے دہرانا ضروری ہے۔",
    "english": "This narration suggests that on one occasion, Bilāl (RA) called the Adhān before the start of Fajr time, prompting the Prophet (ﷺ) to command him to return and announce that the Adhān was called too early (while sleeping). Although the narration is weak in chain, it is cited juristically to support the rule that an Adhān called before its proper time must be repeated."
  },
  "references": [
    {
      "arabic": "رواه أبو داود (532)",
      "english": "Reported by Abu Dawud (532)"
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": "عبد الله بن عمر",
        "english": "Abdullah ibn 'Umar"
      },
      "slug": "abdullah-ibn-umar"
    }
  ],
  "ytLink": "https://www.youtube.com/watch?v=A2Wp-7Z_l3k",
  "grade": {
    "arabic": "ضعيف",
    "english": "Weak (Ḍa'īf)"
  },
  "explanation": [
    {
      "sectionTitle": {
        "urdu": "وقت سے پہلے اذان کا حکم",
        "english": "Ruling on Adhān Before Time"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "اذان کا اعادہ (دہرانا)",
              "english": "Repetition of Adhān (I'ādah)"
            },
            "content": {
              "urdu": [
                "جمہور فقہاء اس بات پر متفق ہیں کہ اگر کوئی اذان وقت سے پہلے دے دی جائے تو وہ شرعاً معتبر نہیں ہوتی۔",
                "ایسی صورت میں مؤذن کو حکم ہے کہ وہ نماز کے وقت کے داخل ہونے پر اذان کو دوبارہ کہے۔",
                "یہ اس لیے ضروری ہے تاکہ نماز کے وقت کی صحیح اطلاع تمام مسلمانوں تک پہنچ سکے۔"
              ],
              "english": [
                "The majority of jurists agree that if an Adhān is called before its time, it is legally invalid.",
                "In such a case, the Mu'adhdhin is commanded to repeat the Adhān once the prayer time has officially commenced.",
                "This is necessary to ensure that the correct time for the prayer is announced to all Muslims."
              ]
            }
          },
          {
            "title": {
              "urdu": "بلالؓ کے عمل کی حقیقت",
              "english": "The Reality of Bilāl's Action"
            },
            "content": {
              "urdu": [
                "صحیح احادیث کے مطابق بلالؓ کی اذان ہمیشہ رات میں (فجر سے قبل) نبی ﷺ کی اجازت سے ہوتی تھی۔",
                "یہ روایت جو یہ کہتی ہے کہ انہوں نے غلطی سے پہلے اذان دی، سنداً ضعیف ہے اور صحیح احادیث کے معارض ہے۔",
                "البتہ، روایت کا یہ حصہ کہ 'دوبارہ اذان کا حکم دیا' اس اصول کی تائید کرتا ہے کہ وقت سے پہلے کی اذان کافی نہیں ہے۔"
              ],
              "english": [
                "According to authentic Ahadith, Bilāl's Adhān was consistently called during the night (before Fajr) with the Prophet's permission.",
                "This narration, suggesting he erred by calling the Adhān early, is weak and contradicts authentic Ahadith.",
                "However, the part of the narration about the command to repeat the Adhān supports the rule that an Adhān before time is insufficient."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "بلالؓ پر تنبیہ اور اس کی کیفیت",
        "english": "Admonition to Bilāl and its Nature"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "الفاظ کی تضعیف",
              "english": "Weakness of the Wording"
            },
            "content": {
              "urdu": [
                "روایت میں موجود جملہ «أَلَا إِنَّ اَلْعَبْدَ نَامَ» (خبردار! بندہ سو گیا تھا) سنداً ضعیف ہے اور غیر محفوظ قرار دیا گیا ہے۔",
                "ایسا اعلان کرنا بلالؓ کے مقام اور نبی ﷺ کی تعلیم کے خلاف ہے کہ وہ کسی کو بیدار کر کے سحری سے روکیں۔",
                "اگرچہ یہ الفاظ ضعیف ہیں، لیکن اس سے ایک سبق ملتا ہے کہ غلطی ہو جانے پر اس کی وضاحت ضروری ہے۔"
              ],
              "english": [
                "The phrase 'Verily, the servant has slept' in the Hadith is weak in chain and ruled 'Ghair Maḥfūẓ' (not preserved).",
                "Such an announcement contradicts Bilāl's status and the Prophet's teaching, as it would mislead people about Suhoor.",
                "Even though the wording is weak, it offers a lesson that clarification is necessary when a mistake occurs."
              ]
            }
          },
          {
            "title": {
              "urdu": "غلطی کی اصلاح کا طریقہ",
              "english": "Method of Correcting the Error"
            },
            "content": {
              "urdu": [
                "اگر اذان غلط وقت پر ہو جائے تو لوگوں کو فوراً اس کی اطلاع دینا ضروری ہے تاکہ لوگ سحری یا نماز کے وقت میں غلط فہمی کا شکار نہ ہوں۔",
                "نبی ﷺ کا دوبارہ اذان کا حکم دینا غلطی کو بغیر کسی سستی کے فوراً درست کرنے کی تعلیم دیتا ہے۔",
                "اذان چونکہ ایک اہم شعار ہے، لہٰذا اس کی ہر غلطی کی اصلاح ضروری ہے۔"
              ],
              "english": [
                "If the Adhān is called at the wrong time, it is vital to inform people immediately to prevent misunderstanding regarding Suhoor or prayer time.",
                "The Prophet's command to repeat the Adhān teaches prompt correction of the error without any laziness.",
                "Since the Adhān is a vital symbol of Islam, correcting any mistake in it is essential."
              ]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "اذان کے اوقات میں احتیاط",
        "english": "Caution in Adhān Times"
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "وقت کی پابندی",
              "english": "Adherence to Time"
            },
            "content": {
              "urdu": [
                "اذان دینے والے مؤذن پر لازم ہے کہ وہ نماز کے وقت کی صحیح پہچان اور اس کی پابندی کرے۔",
                "فجر کی پہلی اذان (بلالؓ کی) کو بھی رات کے آخری حصے میں دینا چاہیے، فجر صادق سے زیادہ دور نہیں۔",
                "اذان کی ادائیگی میں احتیاط کا معیار بہت بلند ہے تاکہ مسلمانوں کی عبادات ضائع نہ ہوں۔"
              ],
              "english": [
                "It is mandatory for the Mu'adhdhin to correctly identify and adhere to the prescribed prayer time.",
                "Even the first Fajr Adhān (Bilāl's) should be called in the late part of the night, not too far from Fajr Ṣādiq.",
                "The standard of caution in performing the Adhān is very high to ensure that the Muslims' acts of worship are not invalidated."
              ]
            }
          },
          {
            "title": {
              "urdu": "فقہی اختلاف کی اہمیت",
              "english": "Importance of Juristic Differences"
            },
            "content": {
              "urdu": [
                "محدثین کا کسی حدیث کو ضعیف قرار دینا شرعی احکام کو صرف صحیح روایات پر مبنی کرنے کے اصول کو واضح کرتا ہے۔",
                "امام ابو داؤد کا اس حدیث کو ضعیف قرار دینا اس بات کی دلیل ہے کہ وہ صرف ظاہری حکم پر اکتفا نہیں کرتے تھے۔",
                "مسلمان کو چاہیے کہ وہ علمائے حدیث کے اجتہاد اور تحقیق کی قدر کرے۔"
              ],
              "english": [
                "Scholars grading a Hadith as weak clarifies the principle of basing legal rulings solely on authentic narrations.",
                "Imam Abu Dawud's grading of this Hadith as weak indicates that he did not rely merely on the apparent ruling.",
                "A Muslim should appreciate the scholarly effort and research (Ijtihād) of the Hadith experts."
              ]
            }
          }
        ]
      }
    }
  ]
}
