{
  "chapId": 8,
  "bookId": 1,
  "summary": {
    "urdu": [""],
    "english": [""]
  },
  "description": {
    "urdu": " ",
    "english": " "
  },
  "hadithRange": {
    "from": 94,
    "to": 108
  },
  "hadiths": [
    {
      "id": 94,
      "name": {
        "arabic": "عَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ اَلْمَاءُ مِنْ اَلْمَاءِ } رَوَاهُ مُسْلِم ٌ وَأَصْلُهُ فِي اَلْبُخَارِيّ ِ ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”**پانی کا استعمال خروج پانی سے ہے**۔“ (یعنی جب تک منی کا خروج نہ ہو اس وقت تک غسل واجب نہیں ہوتا۔) اسے مسلم نے روایت کیا ہے اور اصل روایت بخاری میں بھی ہے۔  ",
        "english": "From Abu Sa'id Al-Khudri (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: **\"Water is from water\"** (i.e., Ghusl is required when semen is discharged). Reported by Muslim, and the basis of it is also in Al-Bukhari."
      }
    },

    {
      "id": 95,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا جَلَسَ بَيْنَ شُعَبِهَا اَلْأَرْبَعِ, ثُمَّ جَهَدَهَا, فَقَدْ وَجَبَ اَلْغُسْلُ } مُتَّفَقٌ عَلَيْه ِ  وَعَنْ أَبِي هُرَيْرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا جَلَسَ بَيْنَ شُعَبِهَا اَلْأَرْبَعِ, ثُمَّ جَهَدَهَا, فَقَدْ وَجَبَ اَلْغُسْلُ } مُتَّفَقٌ عَلَيْه ِ ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ”جب تم میں سے کوئی عورت کی **چار شاخوں کے درمیان میں بیٹھے** پھر **اپنی پوری کوشش کر لے** تو اس پر **غسل واجب** ہو گیا۔ (بخاری و مسلم) اور مسلم نے اتنا اضافہ نقل کیا ہے کہ **”خواہ انزال نہ ہوا ہو۔“**",
        "english": "And from Abu Hurairah (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: \"**When a man sits between her four parts, and then exerts himself with her, Ghusl is certainly required.**\" Muttafaqun 'alayhi (agreed upon by Al-Bukhari and Muslim). And Muslim added: **\"Even if he does not ejaculate (discharge semen).\"**"
      }
    },

    {
      "id": 96,
      "name": {
        "arabic": "  وَعَنْ أُمِّ سَلَمَةَ; أَنَّ أُمَّ سُلَيْمٍ  -وَهِيَ اِمْرَأَةُ أَبِي طَلْحَةَ - قَالَتْ: { يَا رَسُولَ اَللَّهِ! إِنَّ اَللَّهَ لَا يَسْتَحِي مِنْ اَلْحَقِّ, فَهَلْ عَلَى اَلْمَرْأَةِ اَلْغُسْلُ إِذَا اِحْتَلَمَتْ? قَالَ: \"نَعَمْ.  إِذَا رَأَتِ الْمَاءَ\" } اَلْحَدِيثَ.  مُتَّفَقٌ عَلَيْه ِ",
        "urdu": " سیدہ ام سلمہ رضی اللہ عنہا سے مروی ہے کہ ام سلیم رضی اللہ عنہا (جو ابوطلحہ رضی اللہ عنہ کی اہلیہ ہیں) نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: یا رسول اللہ! اللہ تعالیٰ حق بیان کرنے سے حیاء نہیں کرتا، تو بتائیں کیا عورت کو جب **احتلام** ہو جائے تو اس پر بھی **غسل فرض** ہے؟ فرمایا: **”ہاں! جب وہ پانی دیکھے۔“** (بخاری و مسلم) ",
        "english": "And from Umm Salamah: Umm Sulaim (who was the wife of Abu Talhah) said: \"O Messenger of Allah! Indeed, Allah is not ashamed of the truth. **Is Ghusl obligatory upon a woman if she has a wet dream?**\" He replied: **\"Yes, if she sees water (discharge).\"** The Hadith. Muttafaqun 'alayhi (agreed upon by Al-Bukhari and Muslim)."
      }
    },

    {
      "id": 97,
      "name": {
        "arabic": " وَعَنْ أَنَسِ]بْنِ مَالِكٍ]  - رضى الله عنه  - قَالَ: { قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  - -فِي اَلْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى اَلرَّجُلُ - قَالَ: 'تَغْتَسِلُ' } مُتَّفَقٌ عَلَيْه ِ زَادَ مُسْلِمٌ: فَقَالَتْ أُمُّ سُلَيْم ٍ 1  { وَهَلْ يَكُونُ هَذَا? قَالَ: 'نَعَمْ فَمِنْ أَيْنَ يَكُونُ اَلشَّبَهُ? }",
        "urdu": "سیدنا انس رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اس عورت کے متعلق فرمایا جو خواب میں وہی کچھ دیکھے جو ایک نوجوان مرد دیکھتا ہے (احتلام) ”کہ **وہ غسل کرے**۔“ (بخاری و مسلم) اور مسلم نے اتنا اضافہ بھی کیا ہے کہ سیدہ ام سلیم رضی اللہ عنہا نے آپ صلی اللہ علیہ وسلم کے جواب دینے پر مزید دریافت کیا، **کیا ایسا (عورت) کے ساتھ بھی ہوتا ہے؟** آپ صلی اللہ علیہ وسلم نے فرمایا **”ہاں! اگر ایسا نہ ہوتا تو مشابہت کہاں سے ہوتی۔“**  ",
        "english": "And from Anas ibn Malik (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said concerning a woman who sees in her sleep what a man sees (a wet dream): \"**She must perform Ghusl (ritual bath).**\" Muttafaqun 'alayhi (agreed upon). Muslim added that Umm Sulaim asked: **\"Does this happen?**\" He replied: **\"Yes, then from where does the resemblance (of the child to the mother) come?\"**"
      }
    },

    {
      "id": 98,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ اَلنَّبِيَّ  - صلى الله عليه وسلم  -يَغْتَسِلُ مِنْ أَرْبَعٍ: مِنْ اَلْجَنَابَةِ, وَيَوْمَ اَلْجُمُعَةِ, وَمِنْ اَلْحِجَامَةِ, وَمِنْ غُسْلِ اَلْمَيِّتِ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم **چار چیزوں** کی وجہ سے غسل فرمایا کرتے تھے: **جنابت**، **جمعہ کے روز**، **سینگی لگوانے کے بعد** اور **میت کو غسل دینے کی وجہ سے**۔ ابوداؤد نے اسے روایت کیا ہے اور ابن خزیمہ نے **صحیح** قرار دیا ہے۔ ",
        "english": "And from 'A'ishah (may Allah be pleased with her): She said: **\"The Prophet (peace be upon him) used to perform Ghusl (ritual bath) for four things: for Janabah (major impurity), on the day of Jumu'ah (Friday), after Al-Hijamah (cupping), and after washing the dead.**\" Reported by Abu Dawud, and authenticated as Sahih by Ibn Khuzaymah."
      }
    },

    {
      "id": 99,
      "name": {
        "arabic": "وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - { -فِي قِصَّةِ ثُمَامَةَ بْنِ أُثَالٍ, عِنْدَمَا أَسْلَم- وَأَمَرَهُ اَلنَّبِيُّ - صلى الله عليه وسلم -أَنْ يَغْتَسِلَ } رَوَاهُ عَبْدُ اَلرَّزَّاق وَأَصْلُهُ مُتَّفَقٌ عَلَيْه ِ ِ ",
        "urdu": "سیدنا ابوہریرہ رضی اللہ عنہ سے **ثمامة بن اثال** رضی اللہ عنہ کے اسلام لانے کے واقعہ کے متعلق مروی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اسے **غسل کرنے کا حکم** ارشاد فرمایا۔ عبدالرزاق نے اسے روایت کیا ہے اور اس کی اصل بخاری و مسلم میں موجود ہے۔ ",
        "english": "And from Abu Hurairah (may Allah be pleased with him), concerning **the story of Thumamah ibn Uthal when he embraced Islam**: **The Prophet (peace be upon him) commanded him to perform Ghusl (ritual bath).** Reported by 'Abdur-Razzaq, and its basis is agreed upon (Muttafaqun 'alayhi)."
      }
    },

    {
      "id": 100,
      "name": {
        "arabic": "وَعَنْ أَبِي سَعِيدٍ  - رضى الله عنه  - أَنَّ رَسُولَ اَللَّهِ  - صلى الله عليه وسلم  -قَالَ: { غُسْلُ اَلْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ } أَخْرَجَهُ اَلسَّبْعَة ُ ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”**جمعہ کے روز غسل کرنا ہر بالغ پر واجب ہے**۔“ اس کو **ساتوں** یعنی بخاری، مسلم، ابوداؤد، ترمذی، نسائی، ابن ماجہ اور احمد نے روایت کیا ہے۔ ",
        "english": "And from Abu Sa'id Al-Khudri (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: **\"Ghusl (ritual bath) on Jumu'ah (Friday) is obligatory upon every mature (person).\"** Reported by the Seven (major compilers)."
      }
    },

    {
      "id": 101,
      "name": {
        "arabic": " وَعَنْ سَمُرَةَ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ مَنْ تَوَضَّأَ يَوْمَ اَلْجُمُعَةِ فَبِهَا وَنِعْمَتْ, وَمَنْ اِغْتَسَلَ فَالْغُسْلُ أَفْضَلُ } رَوَاهُ اَلْخَمْسَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيّ ُ",
        "urdu": "سیدنا سمرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جمعہ کے روز جس نے **وضو کیا** اس نے **اچھا اور بہتر** کیا، اور جس نے **غسل** کیا تو **بہرحال افضل اور بہترین ہے**۔“ اس کو پانچوں یعنی احمد، ابوداؤد، ترمذی، نسائی اور ابن ماجہ نے روایت کیا ہے اور ترمذی نے اسے **حسن** قرار دیا ہے۔ ",
        "english": "And from Samurah (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: **\"Whoever performs Wudu' (minor ablution) on the day of Jumu'ah (Friday), that is fine and well, but whoever performs Ghusl (major ritual bath), then Ghusl is superior/more virtuous.\"** Reported by the Five (compilers), and authenticated as **Hasan (Good)** by At-Tirmidhi."
      }
    },

    {
      "id": 102,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ, ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ بَيْنَهُمَا وُضُوءًا } رَوَاهُ مُسْلِم ٌ  زَادَ اَلْحَاكِمُ: { فَإِنَّهُ أَنْشَطُ لِلْعَوْدِ } ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے کہ ”جب تم میں سے کوئی اپنی اہلیہ کے پاس جائے (یعنی تعلق زن و شو قائم کرے) پھر دوبارہ لطف اندوز ہونے کا ارادہ ہو تو **درمیان میں وضو کر لے**۔“ (مسلم) اور حاکم نے اتنا اضافہ کیا ہے کہ (یہ وضو) **دوبارہ مباشرت کیلئے زیادہ باعث نشاط** ہے یعنی فرحت بخش اور تازگی پیدا کرتا ہے۔",
        "english": "And from Abu Sa'id Al-Khudri (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: **\"When one of you has intercourse with his wife, and then wishes to repeat it, let him perform Wudu' (minor ablution) between the two acts.\"** Reported by Muslim. Al-Hakim added: **\"For indeed, it is more energizing/revitalizing for the second time.\"**"
      }
    },

    {
      "id": 103,
      "name": {
        "arabic": " وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ  - رضى الله عنه  - قَالَ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ, ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ بَيْنَهُمَا وُضُوءًا } رَوَاهُ مُسْلِم ٌ  زَادَ اَلْحَاكِمُ: { فَإِنَّهُ أَنْشَطُ لِلْعَوْدِ } ",
        "urdu": "سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے کہ ”جب تم میں سے کوئی اپنی اہلیہ کے پاس جائے (یعنی تعلق زن و شو قائم کرے) پھر دوبارہ لطف اندوز ہونے کا ارادہ ہو تو **درمیان میں وضو کر لے**۔“ (مسلم) اور حاکم نے اتنا اضافہ کیا ہے کہ (یہ وضو) **دوبارہ مباشرت کیلئے زیادہ باعث نشاط** ہے یعنی فرحت بخش اور تازگی پیدا کرتا ہے۔",
        "english": "And from Abu Sa'id Al-Khudri (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: **\"When one of you has intercourse with his wife, and then wishes to repeat it, let him perform Wudu' (minor ablution) between the two acts.\"** Reported by Muslim. Al-Hakim added: **\"For indeed, it is more energizing/revitalizing for the second time.\"**"
      }
    },

    {
      "id": 104,
      "name": {
        "arabic": "وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -إِذَا اِغْتَسَلَ مِنْ اَلْجَنَابَةِ يَبْدَأُ فَيَغْسِلُ يَدَيْهِ, ثُمَّ يُفْرِغُ بِيَمِينِهِ عَلَى شِمَالِهِ, فَيَغْسِلُ فَرْجَهُ, ثُمَّ يَتَوَضَّأُ, ثُمَّ يَأْخُذُ اَلْمَاءَ, فَيُدْخِلُ أَصَابِعَهُ فِي أُصُولِ اَلشَّعْرِ, ثُمَّ حَفَنَ عَلَى رَأْسِهِ ثَلَاثَ حَفَنَاتٍ, ثُمَّ أَفَاضَ عَلَى سَائِرِ جَسَدِهِ, ثُمَّ غَسَلَ رِجْلَيْهِ } مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِم ٍ وَلَهُمَا فِي حَدِيثِ مَيْمُونَةَ: { ثُمَّ أَفْرَغَ عَلَى فَرْجِهِ, فَغَسَلَهُ بِشِمَالِهِ, ثُمَّ ضَرَبَ بِهَا اَلْأَرْضَ } وَفِي رِوَايَةٍ: { فَمَسَحَهَا بِالتُّرَابِ } وَفِي آخِرِهِ: { ثُمَّ أَتَيْتُهُ بِالْمِنْدِيلِ } فَرَدَّهُ, وَفِيهِ: { وَجَعَلَ يَنْفُضُ الْمَاءَ بِيَدِهِ }",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب غسل جنابت کرتے تو اس طرح آغاز کرتے۔ پہلے ہاتھ دھوتے پھر سیدھے ہاتھ سے بائیں ہاتھ پر پانی ڈالتے اور اپنا عضو مخصوص دھوتے۔ پھر وضو کرتے، پھر پانی لے کر اپنی انگلیوں کے ذریعہ سر کے بالوں کی تہہ (جڑوں) میں داخل کرتے۔ پھر تین چلو پانی کے بھر کر یکے بعد دیگرے سر پر ڈالتے۔ پھر باقی سارے وجود پر پانی بہاتے (سب سے آخر میں) پھر دونوں پاؤں دھوتے۔ (بخاری و مسلم) متن حدیث کے الفاظ مسلم کے ہیں۔ اور بخاری و مسلم میں سیدہ میمونہ رضی اللہ عنہا کی روایت میں اس طرح ہے۔ ”پھر اپنے عضو مخصوص پر پانی ڈالتے اور اپنے بائیں ہاتھ سے اسے دھوتے اور ہاتھوں کو زمین پر مار کر مٹی سے ملتے اور (صاف کرتے)“ اور ایک دوسری روایت میں اس طرح ہے ”پھر دونوں ہاتھ مٹی سے مل کر اچھی طرح صاف کرتے۔“ اس روایت کے آخر میں ہے کہ ”میں نے آپ صلی اللہ علیہ وسلم کی خدمت میں رومال (تولیہ) پیش کیا مگر آپ صلی اللہ علیہ وسلم نے اسے واپس لوٹا دیا اور بدن (پر جو پانی رہ گیا تھا) اسے اپنے ہاتھ سے جھاڑنا شروع کیا۔“ ",
        "english": "Narrated 'Aishah (May Allah be pleased with her): When the Messenger of Allah (Peace and Blessings be upon him) took a bath because of Janabah (sexual impurity), he started by washing his hands. He would then pour water with his right hand over his left, and wash his private parts. He would then perform Wudu' (ablution), then take water and put his fingers to the roots of his hair. Then he would pour three handfuls of water over his head, and then pour water over the rest of his body. Finally, he would wash his feet. Agreed upon, and the wording is that of Muslim. In the narration of Maymunah, they both added: \"Then he poured water on his private parts and washed them with his left hand. He then rubbed it (his left hand) on the ground.\" And in another narration: \"And wiped it with earth.\" At the end of it: \"Then I brought him a towel, but he rejected it, and he began to shake the water off with his hand.\""
      }
    },

    {
      "id": 105,
      "name": {
        "arabic": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ إِنِّي اِمْرَأَةٌ أَشُدُّ شَعْرَ رَأْسِي, أَفَأَنْقُضُهُ لِغُسْلِ اَلْجَنَابَةِ? وَفِي رِوَايَةٍ: وَالْحَيْضَةِ? فَقَالَ: \"لَا, إِنَّمَا يَكْفِيكِ أَنْ تَحْثِي عَلَى رَأْسِكِ ثَلَاثَ حَثَيَاتٍ\" } رَوَاهُ مُسْلِم ٌ ",
        "urdu": "سیدہ ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ میں نے عرض کیا یا رسول اللہ! میں اپنے سر کے بال (یعنی مینڈھیوں کی شکل میں) باندھ لیتی ہوں۔ کیا غسل جنابت کے موقع پر ان کو کھولوں؟ اور ایک روایت میں حیض سے فارغ ہو کر غسل کے وقت کے الفاظ ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں (کھولنے کے ضرورت نہیں) بس تیرے لئے یہی کافی ہے کہ تو اپنے سر پر تین چلو پانی بہا دیا کر۔“ (مسلم) ",
        "english": "Narrated Umm Salamah (May Allah be pleased with her): I said, 'O Messenger of Allah, I am a woman who braids her hair. Should I undo it for Ghusl from Janabah?' And in one narration: 'or Haidah (menstruation)?' He replied: 'No. It is enough for you to pour three handfuls of water over your head.' Reported by Muslim."
      }
    },

    {
      "id": 106,
      "name": {
        "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -{ إِنِّي لَا أُحِلُّ اَلْمَسْجِدَ لِحَائِضٍ وَلَا جُنُبٌ } رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَة َ",
        "urdu": " سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میں حائضہ عورت اور حالت جنابت میں مبتلا مرد کیلئے مسجد میں داخلہ حلال نہیں کرتا (یعنی ان دونوں کو مسجد میں داخل ہونے کی اجازت نہیں دیتا)۔“ اس کو ابوداؤد نے روایت کیا ہے اور ابن خزیمہ نے اسے صحیح قرار دیا ہے۔ ",
        "english": "Narrated 'Aishah (May Allah be pleased with her): The Messenger of Allah (Peace and Blessings be upon him) said: 'I do not permit the mosque to a menstruating woman, nor to a person in a state of major ritual impurity (Junub).' Reported by Abu Dawud, and authenticated by Ibn Khuzaymah."
      }
    },

    {
      "id": 107,
      "name": {
        "arabic": " وَعَنْهَا قَالَتْ: { كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اَللَّهِ  - صلى الله عليه وسلم  -مِنْ إِنَاءٍ وَاحِدٍ, تَخْتَلِفُ أَيْدِينَا فِيهِ مِنَ اَلْجَنَابَةِ } مُتَّفَقٌ عَلَيْه ِ . زَادَ اِبْنُ حِبَّانَ: وَتَلْتَقِ ي ",
        "urdu": "سیدہ عائشہ رضی اللہ عنہا ہی سے یہ روایت بھی ہے کہ میں اور رسول اللہ صلی اللہ علیہ وسلم دونوں ایک ہی برتن سے غسل جنابت کر لیا کرتے تھے۔ اس برتن میں ہمارے ہاتھ یکے بعد دیگرے داخل ہوتے تھے۔ (بخاری و مسلم) اور ابن حبان نے اتنا اضافہ مزید نقل کیا ہے کہ بسا اوقات دونوں کے ہاتھ ایک دوسرے سے چھو جاتے تھے۔",
        "english": "Narrated 'Aishah (May Allah be pleased with her): 'I and the Messenger of Allah (Peace and Blessings be upon him) used to perform Ghusl (ritual bath) from Janabah (sexual impurity) from a single vessel, our hands alternating in it.' Agreed upon. Ibn Hibban added: 'and sometimes they would meet (touch one another).'"
      }
    },

    {
      "id": 108,
      "name": {
        "arabic": " وَعَنْ أَبِي هُرَيْرَةَ - رضى الله عنه - قَالَ: قَالَ رَسُولُ اَللَّهِ - صلى الله عليه وسلم -{ إِنَّ تَحْتَ كُلِّ شَعْرَةٍ جَنَابَةً, فَاغْسِلُوا اَلشَّعْرَ, وَأَنْقُوا اَلْبَشَرَ } رَوَاهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَضَعَّفَاه ُ وَلِأَحْمَدَ عَنْ عَائِشَةَ نَحْوُهُ, وَفِيهِ رَاوٍ مَجْهُول ٌ",
        "urdu": " سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد گرامی ہے کہ ”ہر بال کی تہہ (نیچے) میں جنابت کا اثر ہوتا ہے اس لئے بالوں کو (اچھی طرح) دھویا کرو اور جسم کو اچھی طرح (مل کر) صاف کیا کرو۔“ ابوداؤد اور ترمذی دونوں نے اسے روایت کیا ہے اور ساتھ ہی ضعیف بھی قرار دیا ہے۔ مسند احمد میں بھی سیدہ عائشہ رضی اللہ عنہا سے اسی طرح روایت ہے اور اس میں ایک راوی مجہول ہے۔ ",
        "english": "Narrated Abu Hurayrah (May Allah be pleased with him): The Messenger of Allah (Peace and Blessings be upon him) said: 'Indeed, there is Janabah (major impurity) under every single hair, so wash the hair and cleanse the skin thoroughly.' Reported by Abu Dawud and At-Tirmidhi, and both declared it weak. Ahmad reported a similar narration from 'Aishah, and in its chain is an unknown narrator."
      }
    }
  ]
}