{
  "hadithId": 407,
  "hadithNo": 2,
  "hadithReferences": {
    "sunnah.com": [""],
    "kitabId": 2,
    "inKitabBab": 16,
    "arabicBook": "",
    "babId": 26
  },
  "name": {
    "arabic": " وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { شَكَا اَلنَّاسُ إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قُحُوطَ الْمَطَرِ, فَأَمَرَ بِمِنْبَرٍ, فَوُضِعَ لَهُ فِي اَلْمُصَلَّى, وَوَعَدَ اَلنَّاسَ يَوْمًا يَخْرُجُونَ فِيهِ, فَخَرَجَ حِينَ بَدَا حَاجِبُ اَلشَّمْسِ, فَقَعَدَ عَلَى اَلْمِنْبَرِ, فَكَبَّرَ وَحَمِدَ اَللَّهَ, ثُمَّ قَالَ: "إِنَّكُمْ شَكَوْتُمْ جَدَبَ دِيَارِكُمْ, وَقَدْ أَمَرَكُمْ اَللَّهُ أَنْ تَدْعُوَهُ, وَوَعَدَكُمْ أَنْ يَسْتَجِيبَ لَكُمْ, ثُمَّ قَالَ: اَلْحَمْدُ لِلَّهِ رَبِّ اَلْعَالَمِينَ, اَلرَّحْمَنِ اَلرَّحِيمِ, مَالِكِ يَوْمِ اَلدِّينِ, لَا إِلَهَ إِلَّا اَللَّهُ يَفْعَلُ مَا يُرِيدُ, اَللَّهُمَّ أَنْتَ اَللَّهُ, لَا إِلَهَ إِلَّا أَنْتَ, أَنْتَ اَلْغَنِيُّ وَنَحْنُ اَلْفُقَرَاءُ, أَنْزِلْ عَلَيْنَا الْغَيْثَ, وَاجْعَلْ مَا أَنْزَلْتَ قُوَّةً وَبَلَاغًا إِلَى حِينٍ" ثُمَّ رَفَعَ يَدَيْهِ, فَلَمْ يَزَلْ حَتَّى رُئِيَ بَيَاضُ إِبِطَيْهِ, ثُمَّ حَوَّلَ إِلَى اَلنَّاسِ ظَهْرَهُ, وَقَلَبَ رِدَاءَهُ, وَهُوَ رَافِعٌ يَدَيْهِ, ثُمَّ أَقْبِلَ عَلَى اَلنَّاسِ وَنَزَلَ, وَصَلَّى رَكْعَتَيْنِ, فَأَنْشَأَ اَللَّهُ سَحَابَةً, فَرَعَدَتْ, وَبَرَقَتْ, ثُمَّ أَمْطَرَتْ } رَوَاهُ أَبُو دَاوُدَ وَقَالَ: "غَرِيبٌ, وَإِسْنَادُهُ جَيِّدٌ"  وَقِصَّةُ اَلتَّحْوِيلِ فِي "اَلصَّحِيحِ" مِنْ:
حَدِيثِ عَبْدِ اَللَّهِ بْنِ زَيْدٍ، وَفِيهِ: { فَتَوَجَّهَ إِلَى اَلْقِبْلَةِ, يَدْعُو, ثُمَّ صَلَّى رَكْعَتَيْنِ, جَهَرَ فِيهِمَا بِالْقِرَاءَةِ } وَلِلدَّارَقُطْنِيِّ مِنْ مُرْسَلِ 1‏ أَبِي جَعْفَرٍ اَلْبَاقِرِ: وَحَوَّلَ رِدَاءَهُ؛ لِيَتَحَوَّلَ اَلْقَحْطُ",
    "urdu": "سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس بارش نہ ہونے کی وجہ سے قحط سالی کی شکایت کی۔ آپ صلی اللہ علیہ وسلم نے عید گاہ میں منبر لے جانے کا حکم دیا، چنانچہ منبر عید گاہ میں لا کر رکھ دیا گیا۔ لوگوں سے ایک دن کا وعدہ کیا جس میں وہ سارے باہر نکلیں۔ آپ صلی اللہ علیہ وسلم خود اس وقت نکلے جب سورج کا کنارہ ظاہر ہوا۔ تشریف لا کر آپ صلی اللہ علیہ وسلم منبر پر بیٹھ گئے اور «الله اكبر» کہا اور اللہ تعالیٰ کی حمد و ستائش کی پھر (لوگوں سے مخاطب ہو کر) فرمایا ”تم لوگوں نے اپنے علاقوں کی خشک سالی کا شکوہ کیا ہے، اللہ تعالیٰ تو تمہیں یہ حکم دے چکا ہے کہ اس سے دعا کرو وہ تمہاری دعا قبول فرمائے گا۔“ پھر فرمایا ”تعریف اللہ ہی کے لیے سزاوار ہے جو کائنات کا پروردگار ہے۔ لوگوں کے حق میں بڑا مہربان اور ہمیشہ مہربان ہے۔ روز جزا کا مالک ہے۔ اللہ کے سوا دوسرا کوئی معبود نہیں۔ جو چاہتا ہے کر گزرتا ہے۔ الٰہی! تو ہی اللہ ہے، تیرے سوا کوئی دوسرا معبود نہیں۔ تو غنی ہے اور ہم فقیر و محتاج ہیں۔ ہم پر باران رحمت کا نزول فرما۔ جو کچھ تو ہمارے اوپر نازل فرمائے اسے ہمارے لیے روزی اور مدت دراز تک پہنچنے کا ذریعہ بنا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے اپنے دونوں دست مبارک اوپر اٹھائے کہ وہ بتدریج آہستہ آہستہ اوپر اٹھتے گئے یہاں تک کہ آپ صلی اللہ علیہ وسلم کی بغلوں کی سفیدی نظر آنے لگی۔ پھر لوگوں کی جانب اپنی پشت کر کے کھڑے ہو گئے اور اپنی چادر کو پھیر کر پلٹایا۔ آپ صلی اللہ علیہ وسلم اس وقت اپنے دونوں ہاتھ اوپر اٹھائے ہوئے تھے پھر لوگوں کی جانب متوجہ ہوئے اور منبر سے نیچے تشریف لے آئے اور دو رکعت نماز پڑھائی۔ اسی لمحہ اللہ تعالیٰ نے آسمان پر بادل پیدا کیا۔ وہ بدلی گرجی اور چمکی اور بارش ہونے لگی۔ اسے ابوداؤد نے روایت کیا ہے اور اسے غریب کہا ہے اور اس کی سند نہایت عمدہ و جید ہے۔ صحیح بخاری میں عبداللہ بن زید رضی اللہ عنہما کی روایت میں (تبدیلی چادر) کا قصہ اس طرح ہے ”پھر آپ صلی اللہ علیہ وسلم نے قبلہ کی طرف رخ کیا اور دعا فرماتے رہے، پھر دو رکعت نماز ادا فرمائی۔ ان میں قرآت بلند آواز سے کی۔“ اور دارقطنی میں ابوجعفر باقر کی مرسل روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے اپنی چادر اس لیے پھیر کر بدلی کہ قحط سالی بھی اسی طرح پھر جائے۔ ",
    "english": " "
  },
  "takhreej": {
    "arabic": " حسن.‏ رواه أبو داود (1173)‏، وصححه ابن حبان (2860)‏.‏  صحيح.‏ رواه البخاري (2/514/فتح)‏، وهو أيضا في مسلم (894)‏ خلا الجهر بالقراءة.‏ وعبد الله بن زيد: هو ابن زيد بن عاصم المازني؛ وليس هو عبد الله بن زيد صاحب النداء، وممن كان يقول بأنه صاحب النداء سفيان بن عيينة، ولكن البخاري وهمه (2/498/فتح)‏.‏ كذا بالأصل، و "المطبوع": وهو كذلك في "الشرح"، وهو الصواب عندي؛ لأنه كذلك في"السنن" وتحرف في "أ" إلى: "حديث".‏
‏2 ‏- صحيح.‏ رواه الدارقطني (2/66/2)‏، وهو وإن كان مرسلا بإسناد صحيح عند الدارقطني، فقد رواه الحاكم (1/326)‏، موصولا عن جابر رضي الله عنه، وقال: "هذا حديث صحيح الإسناد، ولم يخرجاه".‏ وقال الذهبي: "غريب عجيب صحيح".‏ قلت: وإسناد الحاكم أصح من إسناد الدارقطني، وأيضا جاء عن أنس لكن من طريق أحد الكذابين.‏",
    "urdu": " ",
    "english": " "
  },
  "importantWords": [
    {
      "arabic": " ",
      "english": " ",
      "urdu": " "
    }
  ],
  "summary": {
    "urdu": " ",
    "english": " "
  },
  "references": [
    {
      "arabic": " ",
      "english": " "
    }
  ],
  "narrators": [
    {
      "id": 1,
      "name": {
        "arabic": " ",
        "english": " "
      },
      "slug": " "
    }
  ],
  "ytLink": " ",
  "grade": {
    "arabic": " ",
    "english": " "
  },

  "explanation": [
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    },
    {
      "sectionTitle": {
        "urdu": "",
        "english": ""
      },
      "sectionData": {
        "points": [
          {
            "title": {
              "urdu": "",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          },
          {
            "title": {
              "urdu": " ",
              "english": ""
            },
            "content": {
              "urdu": ["", "", ""],
              "english": ["", "", ""]
            }
          }
        ]
      }
    }
  ]
}
